         MACRO -- $ICE -- HASP INTERFACE CONTROL ELEMENT DSECT'      R4 D0004000
         $ICE  &DOC=NO                                               R4 D0006000
         AIF   ('&DOC' NE 'YES').NODOC                               R4 D0008000
.NODOC   TITLE 'HASP INTERFACE CONTROL ELEMENT DSECT'                R4 D0010000
ICEDSECT DSECT                     INTERFACE CONTROL ELEMENT DSECT   R4 D0012000
         SPACE 3                                                     R4 D0014000
ICESTAT  DC    BL1'0'              ICE     STATUS INDICATORS         R4 D0016000
ICEFLAGS DC    BL1'0'              SESSION STATUS INDICATORS         R4 D0018000
ICERCVST DC    BL1'0'              RECEIVE PATH   INDICATORS         R4 D0020000
ICESNDST DC    BL1'0'              SEND    PATH   INDICATORS         R4 D0022000
ICEINDEX DC    AL1(0)              SERVICE ROUTINE INDEX POINTER     R4 D0024000
ICERSPCT DC    AL1(0)              CNT OF OUTSTANDING RESPONSES      R4 D0026000
ICERULEN DC    AL2(0)              MAXIMUM REQUEST UNIT LENGTH       R4 D0028000
ICESYMB  DC    CL8' '              VTAM SYMBOLIC NAME OF TERMINAL    R4 D0030000
ICECID   DC    XL4'0'              VTAM COMMUNICATION IDENTIFIER     R4 D0032000
ICEAPCHN DC    A(*-*)              ADDR OF NEXT LOGGED ON ICE        R4 D0034000
ICEALCHN DC    A(*-*)              ADDR OF NEXT ALLOCATED ICE        R4 D0036000
ICEXTCOD DC    0X'00'              VTAM EXIT ROUTINE ACTION CODE     R4 D0038000
ICEXTCHN DC    A(*-*)              VTAM EXIT ROUTINE ICE CHAIN       R4 D0040000
ICEINLM  DC    AL2(0)              INBOUND  QUEUE LIMIT              R4 D0042000
ICEINCT  DC    AL2(0)              INBOUND  QUEUE COUNTER            R4 D0044000
ICEACPTN DC    XL1'0'              COMPACTION TABLE NUMBER ACTIVE   R41 D0046000
ICERCPTN DC    XL1'0'              COMPACTION TABLE LAST REQUESTED  R41 D0046500
ICEXRFBK DC    XL1'0'              EXCEPTION RESPONSE FEEDBACK BITS R41 D0047000
         DS    X                   RESERVED                    @OZ19494 D0047500
ICEINHD  DC    A(*-*)              INBOUND  QUEUE HEAD BUFFER PTR    R4 D0048000
ICEINTL  DC    A(*-*)              INBOUND  QUEUE TAIL BUFFER PTR    R4 D0050000
ICEOUTLM DC    AL2(0)              OUTBOUND QUEUE LIMIT              R4 D0052000
ICEOUTCT DC    AL2(0)              OUTBOUND QUEUE COUNTER            R4 D0054000
ICEOUTBF DC    A(*-*)              OUTBOUND OUTSTANDING BUFFER PTR   R4 D0056000
ICEOUTHD DC    A(*-*)              OUTBOUND QUEUE  HEAD BUFFER PTR   R4 D0058000
ICEOUTTL DC    A(*-*)              OUTBOUND QUEUE  TAIL BUFFER PTR   R4 D0060000
ICEADCT  DC    A(*-*)              ADDR OF ASSOCIATED  LOGON DCT     R4 D0062000
ICELDCT  DC    A(*-*)              ADDR OF ASSOCIATED  LINE  DCT     R4 D0064000
ICERDCT  DC    A(*-*)              ADDR OF ASSOCIATED REMOTE DCT     R4 D0066000
ICESDCT  DC    A(*-*)              ADDR OF FIRST  SUSPENDED  DCT     R4 D0068000
ICEBUFAD DC    A(*-*)              ADDR OF CURRENLY SCHED BUFFER     R4 D0070000
ICECPT   DC    A(*-*)              SESSION COMPACTION TABLE ADDR    R41 D0072000
ICEWTIME DC    XL4'0'              SESSION ALLOC WAIT TIME STAMP     R4 D0080000
ICECNTRS DS    0A                  SESSION STATISTICS COUNTERS       R4 D0082000
ICETOTAL DC    A(0)                SESSION TOTAL SEND/REC  COUNT     R4 D0084000
ICEXRESP DC    A(0)                SESSION EXECPTION RESP  COUNT     R4 D0086000
ICELUSTA DC    A(0)                SESSION LOG UNIT STATUS COUNT     R4 D0088000
ICEBDREJ DC    A(0)                SESSION  BID  REJECTED  COUNT     R4 D0090000
ICETEMP  DC    A(0)                SESSION TEMPORARY ERROR COUNT     R4 D0092000
ICEFLGS2 DC    BL1'0'              SESSION STATUS FLAGS        @OZ29180 D0092010
         DC    AL3(0)              RESERVED                    @OZ29180 D0092020
ICEBIND  DC    XL36'00'            SESSION BIND IMAGE                R4 D0094000
ICEPROF  DC    XL4'00'             SESSION PROFILE                   R4 D0096000
ICESIZE  EQU   *-ICEDSECT          LENGTH OF ICE DSECT               R4 D0098000
&SYSECT  CSECT                                                       R4 D0100000
         TITLE 'HASP ICE STATUS BIT DEFINITIONS'                     R4 D0102000
*                             ICESTAT                                R4 D0106000
         SPACE 1                                                     R4 D0108000
ICEDRAIN EQU   B'10000000'         ICE DRAIN REQ PENDING             R4 D0110000
ICEALLOC EQU   B'01000000'         ICE ALLOCATED INDICATOR           R4 D0112000
ICETIMER EQU   B'00100000'         ICE AWAITING  TIMER INTRPT        R4 D0114000
ICEHOLD  EQU   B'00010000'         ICE TEMPORARY HOLD STATUS         R4 D0116000
ICERTRPD EQU   B'00001000'         ICE AWAITING  RTR  STATUS         R4 D0118000
ICERCVSP EQU   B'00000100'         ICE RECEIVE   CS   STATUS         R4 D0120000
ICEABORT EQU   B'00000010'         ICE   ABORT   INDICATOR           R4 D0122000
ICECLOSE EQU   B'00000001'         ICE   CLOSE   INDICATOR           R4 D0124000
         SPACE 1                                                     R4 D0126000
ICEAVAIL EQU   B'11111111'         ICE AVAILABLE INDICATOR           R4 D0128000
         SPACE 3                                                     R4 D0130000
*                             ICEFLAGS                               R4 D0132000
         SPACE 1                                                     R4 D0134000
ICEINBND EQU   B'10000000'         SESSION INBOUND  ALLOCATED HDX-FF R4 D0136000
ICEOUTBD EQU   B'01000000'         SESSION OUTBOUND ALLOCATED HDX-FF R4 D0138000
ICEREVFL EQU   B'00100000'         SESSION REVERSED DIRECTION HDX-FF R4 D0140000
ICEINBRK EQU   B'00010000'         SESSION IN BRACKET STATE          R4 D0142000
ICEBBPND EQU   B'00001000'         SESSION BB PENDING STATE          R4 D0144000
ICEEBPND EQU   B'00000100'         SESSION EB PENDING STATE          R4 D0146000
ICECHDIR EQU   B'00000010'         SESSION CD PENDING STATE          R4 D0148000
ICECNECT EQU   B'00000001'         SESSION IS CONNECTED (OPNDST)    R41 D0150000
         SPACE 1                                                     R4 D0152000
ICEBRCKT EQU   B'00011100'         BRACKET  STATUS  INDICATOR        R4 D0154000
         SPACE 3                                                     R4 D0156000
*                             ICEFLGS2                         @OZ29180 D0156100
         SPACE 1                                               @OZ29180 D0156200
ICE1STLU EQU   B'00001000'         FIRST SESSION FOR SMF       @OZ44410 D0156250
ICESIGNL EQU   B'00000100'         DATAFLOW INRPT PENDING      @OZ29180 D0156300
ICEOUTBK EQU   B'00000010'         DF INRPT OUTBD FOR OUTBD    @OZ29180 D0156400
ICEBREAK EQU   B'00000001'         DATAFLOW BREAK PENDING      @OZ29180 D0156500
ICEQUIES EQU   B'00010000'         QUIESCE THEN SHUTDOWN FLAG  @OZ48863 D0156550
         SPACE 3                                               @OZ29180 D0156600
*                             ICERCVST/ICESNDST                      R4 D0158000
         SPACE 1                                                     R4 D0160000
ICEDSTRM EQU   B'11110000'         STATE MASK                  @OZ29180 D0160100
ICERESUM EQU   B'00000000'         RESUME SUSPENDED DATA SET   @OZ29180 D0160200
ICENMEND EQU   B'00010000'         NORMAL END OF DATA SET      @OZ29180 D0160300
ICEBEGIN EQU   B'00100000'         BEGINNING OF DATA SET       @OZ29180 D0160400
ICEODS   EQU   B'00110000'         BEGIN/END OF DATA SET       @OZ29180 D0160500
ICESPEND EQU   B'01000000'         SUSPEND DATA SET            @OZ29180 D0160600
ICEABEND EQU   B'01010000'         ABORT DATA SET (NO RESUME)  @OZ29180 D0160700
ICECONT  EQU   B'01100000'         CONTINUE DESTINATION        @OZ29180 D0160800
ICESTRS1 EQU   B'01110000'         RESERVED                    @OZ29180 D0160900
ICESTRS2 EQU   B'10000000'         RESERVED                    @OZ29180 D0161000
ICESTRS3 EQU   B'10010000'         RESERVED                    @OZ29180 D0161100
ICESTRS4 EQU   B'10100000'         RESERVED                    @OZ29180 D0161200
ICESTRS5 EQU   B'10110000'         RESERVED                    @OZ29180 D0161300
ICESTRS6 EQU   B'11000000'         RESERVED                    @OZ29180 D0161400
ICESTRS7 EQU   B'11010000'         RESERVED                    @OZ29180 D0161500
ICENOFMH EQU   B'11100000'         DATAFLOW HAS NO FMH PENDING @OZ29180 D0162000
ICEINSTR EQU   B'11110000'         DATAFLOW NO FMH PEND        @OZ29180 D0164000
ICEINCHN EQU   B'00001000'         DATAFLOW IN CHAIN STATE     @OZ29180 D0166000
ICEOCPND EQU   B'00000100'         DATAFLOW EOC PEND STATE     @OZ29180 D0168000
ICECNCEL EQU   B'00000010'         DATAFLOW CHAIN CANCELED     @OZ29180 D0170000
*                                  THIS CARD DELETED BY APAR   @OZ29180 D0172000
*                                  THIS CARD DELETED BY APAR   @OZ29180 D0173000
*                                  THIS CARD DELETED BT APAR   @OZ29180 D0174000
ICEWTRSP EQU   B'00000001'         DATAFLOW WAITING FOR RESPONSE     R4 D0176000
         SPACE 3                                                     R4 D0178000
*                             ICEADCT/ICESDCT (SUSPEND FLAGS)        R4 D0180000
         SPACE 1                                                     R4 D0182000
ICESIMPL EQU   B'10000000'         IMPLIED SUSPEND WITHOUT FM HEADER R4 D0184000
ICESUSPD EQU   B'01000000'         SUSPEND IN PROGRESS.  $WAIT NEEDEDR4 D0186000
         SPACE 3                                                    R41 D0188000
*                             ICEXRFBK                              R41 D0190000
         SPACE 1                                                    R41 D0192000
ICEXRDNA EQU   B'10000000'         DEST NOT ACCEPTING FURTHER DATA  R41 D0194000
ICEXRCPY EQU   B'01000000'         DEST NOT HANDLING MULTIPLE COPIESR41 D0196000
         MEND                                                       R41 D0198000
