         TITLE 'IGFDU1, UNIT RECORD VALIDATE                           *00001000
                       '                                                00002000
IGFDU1   CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IGFDU1    73.223'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @08,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@08                                         0001 00013000
         L     @00,@SIZDATD                                        0001 00014000
         GETMAIN R,LV=(0)                                               00015000
         LR    @09,@01                                             0001 00016000
         USING @DATD,@09                                           0001 00017000
         ST    @13,@SA00001+4                                      0001 00018000
         LM    @00,@01,20(@13)                                     0001 00019000
         ST    @09,8(,@13)                                         0001 00020000
         LR    @13,@09                                             0001 00021000
*                                   /* LIST VERSION                  */ 00022000
*   DO;                             /* ?IGFDERR INIT                 */ 00023000
*                                                                  0095 00024000
*     /***************************************************************/ 00025000
*     /*                                                             */ 00026000
*     /* IGFDERR - INITIALIZE RECOVERY ENVIRONMENT                   */ 00027000
*     /*                                                             */ 00028000
*     /***************************************************************/ 00029000
*                                                                  0096 00030000
*     DERPLIST=DERPLIST&&DERPLIST;  /* CLEAR PARAMETER LIST          */ 00031000
         XC    DERPLIST(48),DERPLIST                               0096 00032000
*     DERFUNK=DERINIT;              /* INDICATE INIT FUNCTION        */ 00033000
         MVI   DERFUNK,X'01'                                       0097 00034000
*     DERREC=ADDR(DERRECPM);        /* POINT TO REC PARMS            */ 00035000
         LA    @14,DERRECPM                                        0098 00036000
         ST    @14,DERREC                                          0098 00037000
*     DERRETRY=ADDR(IGFDU1R);       /* POINT TO RETRY ROUTINE        */ 00038000
         LA    @14,IGFDU1R                                         0099 00039000
         ST    @14,DERRETRY                                        0099 00040000
*     GEN SETS(DERDATD)(MVC DERDATD,@SIZDATD);/* SET UP SPN, SIZE    */ 00041000
         MVC DERDATD,@SIZDATD                                           00042000
*     DERPFX=DERRMASK;              /* SET UP RUB MASK               */ 00043000
         MVC   DERPFX(2),@CB00604                                  0101 00044000
*     DERRCODE=CODEBASE;            /* SAVE CODEREG                  */ 00045000
         ST    CODEBASE,DERRCODE                                   0102 00046000
*     DERRDATA=DATABASE;            /* SAVE DATAREG                  */ 00047000
         ST    DATABASE,DERRDATA                                   0103 00048000
*     DERRDDR=DDRPTR;               /* SAVE DDRCOM POINTER           */ 00049000
         ST    DDRPTR,DERRDDR                                      0104 00050000
*     DERRSAVE=SAVEPTR;             /* SAVE REGISTER 13              */ 00051000
         ST    SAVEPTR,DERRSAVE                                    0105 00052000
*     CALL IGFDE0(DERPLIST);        /* ISSUE ESTAE                   */ 00053000
         LA    @14,DERPLIST                                        0106 00054000
         ST    @14,@AL00001                                        0106 00055000
         L     @15,@CV00556                                        0106 00056000
         LA    @01,@AL00001                                        0106 00057000
         BALR  @14,@15                                             0106 00058000
*   END;                            /* ?IGFDERR INIT                 */ 00059000
*                                   /* ESTAE ESTABLISHED             */ 00060000
*   DERLRC=4;                       /* SET LOCAL RETURN CODE TO 4    */ 00061000
         MVI   DERLRC,X'04'                                        0108 00062000
*   CALL IGFDV1;                    /* BRANCH TO DEVICE INDEPENDENT     00063000
*                                      VALIDATION                    */ 00064000
         L     @15,@CV00557                                        0109 00065000
         BALR  @14,@15                                             0109 00066000
*   IF RTNCODE=12 THEN              /* INVALID VALIDATION            */ 00067000
         CH    RTNCODE,@CH00608                                    0110 00068000
         BNE   @RF00110                                            0110 00069000
*     DERLRC=12;                    /* YES -EXIT                     */ 00070000
         MVI   DERLRC,X'0C'                                        0111 00071000
*   ELSE                                                           0112 00072000
*     IF RTNCODE=0 THEN             /* VALID VALIDATION              */ 00073000
         B     @RC00110                                            0112 00074000
@RF00110 LTR   RTNCODE,RTNCODE                                     0112 00075000
         BNZ   @RF00112                                            0112 00076000
*       DO;                         /* YES - A VALID RETURN FROM   0113 00077000
*                                      IGFDV0                        */ 00078000
*         IF DDRINV2=DDRVUS THEN    /* A USER REQUEST?               */ 00079000
*                                                                  0114 00080000
         CLI   DDRINV2(DDRPTR),X'03'                               0114 00081000
         BNE   @RF00114                                            0114 00082000
*           /*********************************************************/ 00083000
*           /*                                                       */ 00084000
*           /* USER VALIDATE REQUEST                                 */ 00085000
*           /*                                                       */ 00086000
*           /*********************************************************/ 00087000
*                                                                  0115 00088000
*           DERLRC=0;               /* YES - NO UNIT RECORD DEVICE 0115 00089000
*                                      DEPENDENT USER VALIDATION     */ 00090000
         MVI   DERLRC,X'00'                                        0115 00091000
*         IF DDRINV2=DDRVCM THEN    /* TO VALIDATE REQUEST ?       0116 00092000
*                                      YES-COMPARE THE FOLLOWING   0116 00093000
*                                      FIELDS - FROM UCB OPTION FLAGS   00094000
*                                      WITH TO UCB OPTION FLAGS -  0116 00095000
*                                      FROM UCB DEVICE TYPE WITH TO     00096000
*                                      UCB DEVICE TYPE - FROM UCB  0116 00097000
*                                      MODEL BITS WITH TO UCB MODEL     00098000
*                                      BITS (ONLY THE LAST FOUR MODEL   00099000
*                                      BITS)                         */ 00100000
*                                                                  0116 00101000
@RF00114 CLI   DDRINV2(DDRPTR),X'02'                               0116 00102000
         BNE   @RF00116                                            0116 00103000
*           /*********************************************************/ 00104000
*           /*                                                       */ 00105000
*           /* TO VALIDATE REQUEST                                   */ 00106000
*           /*                                                       */ 00107000
*           /*********************************************************/ 00108000
*                                                                  0117 00109000
*           IF DDRFMUCB->UCBTBYT2=DDRTOUCB->UCBTBYT2&DDRFMUCB->UCBTBYT4 00110000
*               =DDRTOUCB->UCBTBYT4&(DDRFMUCB->UCBTBYT1&'0F'X)=(   0117 00111000
*               DDRTOUCB->UCBTBYT1&'0F'X)THEN/* ARE DEVICE TYPES AND    00112000
*                                      FEATURES THE SAME             */ 00113000
         L     @14,DDRFMUCB(,DDRPTR)                               0117 00114000
         L     @12,DDRTOUCB(,DDRPTR)                               0117 00115000
         CLC   UCBTBYT2(1,@14),UCBTBYT2(@12)                       0117 00116000
         BNE   @RF00117                                            0117 00117000
         CLC   UCBTBYT4(1,@14),UCBTBYT4(@12)                       0117 00118000
         BNE   @RF00117                                            0117 00119000
         MVC   @TS00001(1),UCBTBYT1(@14)                           0117 00120000
         NI    @TS00001,X'0F'                                      0117 00121000
         MVC   @TS00001+1(1),UCBTBYT1(@12)                         0117 00122000
         NI    @TS00001+1,X'0F'                                    0117 00123000
         CLC   @TS00001(1),@TS00001+1                              0117 00124000
         BNE   @RF00117                                            0117 00125000
*             DERLRC=0;             /* YES                           */ 00126000
         MVI   DERLRC,X'00'                                        0118 00127000
*           ELSE                    /* NO                            */ 00128000
*             DDRINV1=DDRIIN;       /* SET INCOMPATIBLE FLAG         */ 00129000
         B     @RC00117                                            0119 00130000
@RF00117 MVI   DDRINV1(DDRPTR),X'04'                               0119 00131000
*         IF DDRINV2=DDRVFM THEN    /* FROM VALIDATE REQUEST         */ 00132000
*                                                                  0120 00133000
@RC00117 DS    0H                                                  0120 00134000
@RF00116 CLI   DDRINV2(DDRPTR),X'01'                               0120 00135000
         BNE   @RF00120                                            0120 00136000
*           /*********************************************************/ 00137000
*           /*                                                       */ 00138000
*           /* YES - FROM VALIDATE REQUEST                           */ 00139000
*           /*                                                       */ 00140000
*           /*********************************************************/ 00141000
*                                                                  0121 00142000
*           IF DDRFMUCB->UCBNOTRD='1'B THEN/* DEVICE NOT READY       */ 00143000
         L     @14,DDRFMUCB(,DDRPTR)                               0121 00144000
         TM    UCBNOTRD(@14),B'01000000'                           0121 00145000
         BNO   @RF00121                                            0121 00146000
*             DERLRC=0;             /* YES-DEVICE IS NOT READY       */ 00147000
         MVI   DERLRC,X'00'                                        0122 00148000
*           ELSE                                                   0123 00149000
*             DO;                   /* NOT FROM REQUEST              */ 00150000
         B     @RC00121                                            0123 00151000
@RF00121 DS    0H                                                  0124 00152000
*               DDRINV1=DDRINS;     /* NOT SUPPORTED                 */ 00153000
         MVI   DDRINV1(DDRPTR),X'03'                               0124 00154000
*               DDRTER1=DDRTID;     /* INVALID DEVICE                */ 00155000
         MVI   DDRTER1(DDRPTR),X'08'                               0125 00156000
*             END;                                                 0126 00157000
*       END;                                                       0127 00158000
*                                                                  0127 00159000
@RC00121 DS    0H                                                  0127 00160000
@RF00120 DS    0H                                                  0128 00161000
*   /*****************************************************************/ 00162000
*   /*                                                               */ 00163000
*   /* THIS IS THE COMMON EXIT ROUTINE FOR THIS MODULE               */ 00164000
*   /*                                                               */ 00165000
*   /*****************************************************************/ 00166000
*                                                                  0128 00167000
*IGFDU1R:                                                          0128 00168000
*   DO;                             /* ?IGFDERR CANCEL               */ 00169000
*                                                                  0128 00170000
@RF00112 DS    0H                                                  0128 00171000
@RC00110 DS    0H                                                  0128 00172000
IGFDU1R  DS    0H                                                  0129 00173000
*     /***************************************************************/ 00174000
*     /*                                                             */ 00175000
*     /* IGFDERR - CANCEL RECOVERY ENVIRONMENT                       */ 00176000
*     /*                                                             */ 00177000
*     /***************************************************************/ 00178000
*                                                                  0129 00179000
*     DERFUNK=DERCANC;              /* INDICATE CANCEL               */ 00180000
         MVI   DERFUNK,X'02'                                       0129 00181000
*     CALL IGFDE0(DERPLIST);        /* CANCEL ESTAE                  */ 00182000
         LA    @14,DERPLIST                                        0130 00183000
         ST    @14,@AL00001                                        0130 00184000
         L     @15,@CV00556                                        0130 00185000
         LA    @01,@AL00001                                        0130 00186000
         BALR  @14,@15                                             0130 00187000
*   END;                            /* ?IGFDERR CANCEL               */ 00188000
*                                   /* ESTAE CANCEL                  */ 00189000
*   RETURN CODE(DERLRC);            /* TO MODULE IGFDU0              */ 00190000
         SR    @12,@12                                             0132 00191000
         IC    @12,DERLRC                                          0132 00192000
         L     @13,4(,@13)                                         0132 00193000
         L     @00,@SIZDATD                                        0132 00194000
         LR    @01,@09                                             0132 00195000
         FREEMAIN R,LV=(0),A=(1)                                        00196000
         LR    @15,@12                                             0132 00197000
         L     @14,12(,@13)                                        0132 00198000
         LM    @00,@12,20(@13)                                     0132 00199000
         BR    @14                                                 0132 00200000
*   END IGFDU1                                                     0133 00201000
*                                                                  0133 00202000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00203000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 00204000
*/*%INCLUDE SYSLIB  (IHADDR  )                                       */ 00205000
*                                                                  0133 00206000
*       ;                                                          0133 00207000
@DATA    DS    0H                                                       00208000
@CH00608 DC    H'12'                                                    00209000
@DATD    DSECT                                                          00210000
         DS    0F                                                       00211000
@SA00001 DS    18F                                                      00212000
@AL00001 DS    1A                                                       00213000
IGFDU1   CSECT                                                          00214000
         DS    0F                                                       00215000
@DATD    DSECT                                                          00216000
         DS    0D                                                       00217000
@TS00001 DS    CL2                                                      00218000
         DS    CL2                                                      00219000
DERPLIST DS    CL48                                                     00220000
         ORG   DERPLIST                                                 00221000
DERFUNK  DS    AL1                                                      00222000
DERSWCHS DS    BL1                                                      00223000
         ORG   DERSWCHS                                                 00224000
DERCRASH DS    BL1                                                      00225000
DERPERK  EQU   DERSWCHS+0                                               00226000
DERECALL EQU   DERSWCHS+0                                               00227000
DERESTAE EQU   DERSWCHS+0                                               00228000
@NM00012 EQU   DERSWCHS+0                                               00229000
         ORG   DERPLIST+2                                               00230000
@NM00013 DS    CL2                                                      00231000
DERREC   DS    AL4                                                      00232000
DERSPEC  DS    AL4                                                      00233000
DERRETRY DS    AL4                                                      00234000
DERDATD  DS    CL4                                                      00235000
         ORG   DERDATD                                                  00236000
DERDASPN DS    FL1                                                      00237000
DERDALNG DS    FL3                                                      00238000
         ORG   DERPLIST+20                                              00239000
DERRSRC  DS    BL1                                                      00240000
         ORG   DERRSRC                                                  00241000
DERTAPE  DS    BL1                                                      00242000
DERUREC  EQU   DERRSRC+0                                                00243000
DERDISK  EQU   DERRSRC+0                                                00244000
@NM00014 EQU   DERRSRC+0                                                00245000
         ORG   DERPLIST+21                                              00246000
DERLRC   DS    AL1                                                      00247000
DERRUB   DS    CL18                                                     00248000
         ORG   DERRUB                                                   00249000
DERPFX   DS    BL2                                                      00250000
DERRCODE DS    AL4                                                      00251000
DERRDATA DS    AL4                                                      00252000
DERRDDR  DS    AL4                                                      00253000
DERRSAVE DS    AL4                                                      00254000
         ORG   DERPLIST+40                                              00255000
DERGMSPL DS    CL4                                                      00256000
         ORG   DERGMSPL                                                 00257000
DERGMSPN DS    FL1                                                      00258000
DERGMLNG DS    FL3                                                      00259000
         ORG   DERPLIST+44                                              00260000
DERGMADR DS    AL4                                                      00261000
         ORG   DERPLIST+48                                              00262000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00263000
@ENDDATD EQU   *                                                        00264000
IGFDU1   CSECT                                                          00265000
         DS    0F                                                       00266000
@SIZDATD DC    AL1(245)                                                 00267000
         DC    AL3(@ENDDATD-@DATD)                                      00268000
@CV00556 DC    V(IGFDE0)                                                00269000
@CV00557 DC    V(IGFDV1)                                                00270000
         DS    0D                                                       00271000
@CB00604 DC    B'0000000011100100'                                      00272000
DERRECPM DS    CL24                                                     00273000
         ORG   DERRECPM                                                 00274000
@NM00015 DC    CL8'IGFDI0'                                              00275000
@NM00016 DC    CL8'IGFDU1'                                              00276000
@NM00017 DC    CL8'73223'                                               00277000
         ORG   DERRECPM+24                                              00278000
         DS    CL2                                                      00279000
IGFDU1P  DC    13F'0'                                                   00280000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00281000
@01      EQU   01                                                       00282000
@02      EQU   02                                                       00283000
@03      EQU   03                                                       00284000
@04      EQU   04                                                       00285000
@05      EQU   05                                                       00286000
@06      EQU   06                                                       00287000
@07      EQU   07                                                       00288000
@08      EQU   08                                                       00289000
@09      EQU   09                                                       00290000
@10      EQU   10                                                       00291000
@11      EQU   11                                                       00292000
@12      EQU   12                                                       00293000
@13      EQU   13                                                       00294000
@14      EQU   14                                                       00295000
@15      EQU   15                                                       00296000
CODEBASE EQU   @08                                                      00297000
DATABASE EQU   @09                                                      00298000
DDRPTR   EQU   @10                                                      00299000
SAVEPTR  EQU   @13                                                      00300000
RTNCODE  EQU   @15                                                      00301000
UCB      EQU   0                                                        00302000
UCBOB    EQU   0                                                        00303000
UCBJBNR  EQU   UCBOB                                                    00304000
UCBFL5   EQU   UCBOB+1                                                  00305000
UCBAF    EQU   UCBFL5                                                   00306000
UCBSTAT  EQU   UCBOB+3                                                  00307000
UCBCHAN  EQU   UCBOB+4                                                  00308000
UCBSFLS  EQU   UCBOB+6                                                  00309000
UCBFLA   EQU   UCBSFLS                                                  00310000
UCBFL1   EQU   UCBFLA                                                   00311000
UCBBSY   EQU   UCBFL1                                                   00312000
UCBNRY   EQU   UCBFL1                                                   00313000
UCBNOTRD EQU   UCBNRY                                                   00314000
UCBPST   EQU   UCBFL1                                                   00315000
UCBCUB   EQU   UCBFL1                                                   00316000
UCBFLB   EQU   UCBSFLS+1                                                00317000
UCBCHM   EQU   UCBOB+8                                                  00318000
UCBCHM1  EQU   UCBCHM                                                   00319000
UCBPTH0  EQU   UCBCHM1                                                  00320000
UCBPTH1  EQU   UCBCHM1                                                  00321000
UCBWGT   EQU   UCBOB+12                                                 00322000
UCBTYP   EQU   UCBOB+16                                                 00323000
UCBTBYT1 EQU   UCBTYP                                                   00324000
UCB1FEA5 EQU   UCBTBYT1                                                 00325000
UCB1FEA6 EQU   UCBTBYT1                                                 00326000
UCBTBYT2 EQU   UCBTYP+1                                                 00327000
UCB2OPT2 EQU   UCBTBYT2                                                 00328000
UCBDUDN1 EQU   UCB2OPT2                                                 00329000
UCB2OPT3 EQU   UCBTBYT2                                                 00330000
UCBDUDN2 EQU   UCB2OPT3                                                 00331000
UCB2OPT4 EQU   UCBTBYT2                                                 00332000
UCBTBYT3 EQU   UCBTYP+2                                                 00333000
UCBDVCLS EQU   UCBTBYT3                                                 00334000
UCBTBYT4 EQU   UCBTYP+3                                                 00335000
UCBEXTPT EQU   UCBOB+20                                                 00336000
UCBFLC   EQU   UCBEXTPT                                                 00337000
UCBDEV   EQU   UCBOB+24                                                 00338000
UCBCMEXT EQU   0                                                        00339000
UCBATI   EQU   UCBCMEXT+3                                               00340000
@NM00004 EQU   UCBATI                                                   00341000
UCBFLP1  EQU   UCBCMEXT+5                                               00342000
UCBMT    EQU   0                                                        00343000
UCBOCR   EQU   0                                                        00344000
UCBUCS   EQU   0                                                        00345000
UCBUCSOP EQU   UCBUCS+4                                                 00346000
UCBFCBOP EQU   UCBUCS+5                                                 00347000
DDRCOM   EQU   0                                                        00348000
DDRSHORT EQU   DDRCOM                                                   00349000
DDRCNTRL EQU   DDRSHORT+8                                               00350000
DDRSRC   EQU   DDRCNTRL                                                 00351000
DDRSTAT  EQU   DDRCNTRL+1                                               00352000
DDRDCHAR EQU   DDRCNTRL+2                                               00353000
DDRDSTAT EQU   DDRDCHAR+1                                               00354000
DDRLONG  EQU   DDRCOM+24                                                00355000
DDRTOUCB EQU   DDRLONG                                                  00356000
DDRFMUCB EQU   DDRLONG+4                                                00357000
DDRROWN  EQU   DDRLONG+8                                                00358000
DDRMIHT  EQU   DDRLONG+12                                               00359000
DDRTER   EQU   DDRLONG+36                                               00360000
DDRTER1  EQU   DDRTER                                                   00361000
DDRINV   EQU   DDRLONG+38                                               00362000
DDRINV1  EQU   DDRINV                                                   00363000
DDRINV2  EQU   DDRINV+1                                                 00364000
DDRAPP   EQU   DDRLONG+40                                               00365000
DDRIOF   EQU   DDRLONG+52                                               00366000
DDRIOF2  EQU   DDRIOF+1                                                 00367000
DDRMSG   EQU   DDRLONG+54                                               00368000
DDRMSGP  EQU   DDRLONG+56                                               00369000
DDRLABEL EQU   DDRLONG+64                                               00370000
DDRREC   EQU   DDRLONG+66                                               00371000
DDRREC2  EQU   DDRREC+1                                                 00372000
UCBBGN   EQU   0                                                        00373000
UCBOBS01 EQU   UCBDEV                                                   00374000
UCBSTAB  EQU   UCBOBS01+10                                              00375000
UCBBSVL  EQU   UCBSTAB                                                  00376000
UCBPRSRS EQU   UCBSTAB                                                  00377000
UCBDMCT  EQU   UCBOBS01+11                                              00378000
UCBFL4   EQU   UCBOBS01+13                                              00379000
UCBOBS02 EQU   UCBDEV                                                   00380000
UCBTFL1  EQU   UCBOBS02+19                                              00381000
UCBXTN   EQU   UCBOBS02+20                                              00382000
UCBVOPT  EQU   UCBXTN                                                   00383000
UCBOBS03 EQU   UCBDEV                                                   00384000
UCBXTADR EQU   UCBOBS03                                                 00385000
UCBOBS04 EQU   UCBDEV                                                   00386000
UCBBTA   EQU   UCBOBS04+12                                              00387000
UCBOBS06 EQU   UCBDEV                                                   00388000
UCBAOF   EQU   UCBOBS06                                                 00389000
UCBAOF1  EQU   UCBAOF                                                   00390000
UCBAOF2  EQU   UCBAOF+1                                                 00391000
@NM00003 EQU   UCBOBS06+3                                               00392000
UCBIRB   EQU   UCBOBS06+4                                               00393000
UCBGRAF  EQU   UCBIRB                                                   00394000
UCBLDNCA EQU   UCBOBS06+8                                               00395000
UCBRDYQ  EQU   UCBLDNCA                                                 00396000
UCBIRLN  EQU   UCBRDYQ                                                  00397000
UCBLDNCB EQU   UCBRDYQ+1                                                00398000
UCBCTLNK EQU   UCBOBS06+12                                              00399000
UCBOBS07 EQU   UCBDEV                                                   00400000
UCBOBS08 EQU   UCBDEV                                                   00401000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00402000
UCBRV042 EQU   UCBOBS08+5                                               00403000
UCBCTCF1 EQU   UCBOBS08+4                                               00404000
UCBCTCAD EQU   UCBOBS08                                                 00405000
UCBICNCB EQU   UCBOBS07+4                                               00406000
UCBRV040 EQU   UCBOBS07                                                 00407000
UCBCTLNA EQU   UCBCTLNK+1                                               00408000
UCBRLN   EQU   UCBCTLNK                                                 00409000
UCBRDYQA EQU   UCBLDNCB                                                 00410000
UCBINRLN EQU   UCBIRLN                                                  00411000
UCBIRBA  EQU   UCBIRB+1                                                 00412000
UCBRV039 EQU   UCBGRAF                                                  00413000
UCBDWNR  EQU   UCBGRAF                                                  00414000
UCBRPND  EQU   UCBGRAF                                                  00415000
UCBUPM   EQU   UCBGRAF                                                  00416000
UCBBTAM  EQU   UCBGRAF                                                  00417000
UCBDRNO  EQU   UCBGRAF                                                  00418000
UCBDRO   EQU   UCBGRAF                                                  00419000
UCBOIP   EQU   UCBGRAF                                                  00420000
UCBATRCD EQU   @NM00003                                                 00421000
UCBSKPFG EQU   @NM00003                                                 00422000
UCBRIPND EQU   @NM00003                                                 00423000
UCBRTIAC EQU   @NM00003                                                 00424000
UCBRSV79 EQU   @NM00003                                                 00425000
UCBRSV78 EQU   @NM00003                                                 00426000
UCBRSV77 EQU   @NM00003                                                 00427000
UCBOLTEP EQU   @NM00003                                                 00428000
UCBATNCT EQU   UCBOBS06+2                                               00429000
UCBRSV76 EQU   UCBAOF2                                                  00430000
UCBRSV75 EQU   UCBAOF2                                                  00431000
UCBRSV74 EQU   UCBAOF2                                                  00432000
UCBRSV73 EQU   UCBAOF2                                                  00433000
UCBRSV72 EQU   UCBAOF2                                                  00434000
UCBRSV71 EQU   UCBAOF2                                                  00435000
UCBRSV70 EQU   UCBAOF2                                                  00436000
UCBRSV69 EQU   UCBAOF2                                                  00437000
UCBRSV68 EQU   UCBAOF1                                                  00438000
UCBRSV67 EQU   UCBAOF1                                                  00439000
UCBRSV66 EQU   UCBAOF1                                                  00440000
UCBRSV65 EQU   UCBAOF1                                                  00441000
UCBRSV64 EQU   UCBAOF1                                                  00442000
UCBOFNL  EQU   UCBAOF1                                                  00443000
UCBOFSP  EQU   UCBAOF1                                                  00444000
UCBOFMCR EQU   UCBAOF1                                                  00445000
UCBBTB   EQU   UCBBTA+1                                                 00446000
UCBDI    EQU   UCBBTA                                                   00447000
UCBSTART EQU   UCBOBS04+8                                               00448000
UCBTEB   EQU   UCBOBS04+4                                               00449000
UCBGCB   EQU   UCBOBS04+3                                               00450000
UCBOPEN  EQU   UCBOBS04+2                                               00451000
UCBRES1C EQU   UCBOBS04                                                 00452000
UCBXTNB  EQU   UCBXTN+1                                                 00453000
UCBRSV22 EQU   UCBVOPT                                                  00454000
UCBRSV21 EQU   UCBVOPT                                                  00455000
UCBRSV20 EQU   UCBVOPT                                                  00456000
UCBESVE  EQU   UCBVOPT                                                  00457000
UCBERPC  EQU   UCBVOPT                                                  00458000
UCBESVC  EQU   UCBVOPT                                                  00459000
UCBEVA   EQU   UCBVOPT                                                  00460000
UCBESV   EQU   UCBVOPT                                                  00461000
UCBRV009 EQU   UCBTFL1                                                  00462000
UCBRV008 EQU   UCBTFL1                                                  00463000
UCBRV007 EQU   UCBTFL1                                                  00464000
UCBRV006 EQU   UCBTFL1                                                  00465000
UCBRV005 EQU   UCBTFL1                                                  00466000
UCBRV038 EQU   UCBTFL1                                                  00467000
UCBNSLTP EQU   UCBTFL1                                                  00468000
UCBNLTP  EQU   UCBTFL1                                                  00469000
UCBRES1B EQU   UCBOBS02+18                                              00470000
UCBFSER  EQU   UCBOBS02+12                                              00471000
@NM00002 EQU   UCBOBS02+4                                               00472000
UCBFSEQ  EQU   UCBOBS02+2                                               00473000
UCBFSCT  EQU   UCBOBS02                                                 00474000
UCBNEXP  EQU   UCBOBS01+20                                              00475000
UCBBASE  EQU   UCBOBS01+16                                              00476000
UCBRES1A EQU   UCBOBS01+15                                              00477000
UCBUSER  EQU   UCBOBS01+14                                              00478000
UCBFL47  EQU   UCBFL4                                                   00479000
UCBFL46  EQU   UCBFL4                                                   00480000
UCBFL45  EQU   UCBFL4                                                   00481000
UCBFL44  EQU   UCBFL4                                                   00482000
UCBDSS   EQU   UCBFL4                                                   00483000
UCBRV028 EQU   UCBFL4                                                   00484000
UCBWDAV  EQU   UCBFL4                                                   00485000
UCBDAVV  EQU   UCBFL4                                                   00486000
UCBSQC   EQU   UCBOBS01+12                                              00487000
UCBDATP  EQU   UCBOBS01+12                                              00488000
UCBDMC   EQU   UCBDMCT                                                  00489000
UCBMOUNT EQU   UCBDMCT                                                  00490000
UCBBNUL  EQU   UCBSTAB                                                  00491000
UCBSHAR  EQU   UCBSTAB                                                  00492000
UCBBSTR  EQU   UCBSTAB                                                  00493000
UCBBPUB  EQU   UCBSTAB                                                  00494000
UCBBPRV  EQU   UCBSTAB                                                  00495000
UCBBALB  EQU   UCBPRSRS                                                 00496000
UCBPGFL  EQU   UCBSTAB                                                  00497000
UCBDVSHR EQU   UCBBSVL                                                  00498000
UCBVOLI  EQU   UCBOBS01+4                                               00499000
UCBVTOC  EQU   UCBOBS01                                                 00500000
@NM00011 EQU   DDRREC2                                                  00501000
DDRRFMTO EQU   DDRREC2                                                  00502000
DDRREC1  EQU   DDRREC                                                   00503000
DDRRETRY EQU   DDRLONG+65                                               00504000
DDRLNOP  EQU   DDRLABEL                                                 00505000
@NM00010 EQU   DDRLABEL                                                 00506000
DDRLSD   EQU   DDRLABEL                                                 00507000
DDRLNSL  EQU   DDRLABEL                                                 00508000
DDRLNL   EQU   DDRLABEL                                                 00509000
DDRLBLP  EQU   DDRLABEL                                                 00510000
DDRLAL   EQU   DDRLABEL                                                 00511000
DDRMSGPC EQU   DDRMSGP+1                                                00512000
DDRMSGPN EQU   DDRMSGP                                                  00513000
DDRMSGCD EQU   DDRMSG+1                                                 00514000
DDRMSGOP EQU   DDRMSG                                                   00515000
@NM00009 EQU   DDRIOF2                                                  00516000
DDRICNT  EQU   DDRIOF2                                                  00517000
DDRIMNT  EQU   DDRIOF2                                                  00518000
DDRILAB  EQU   DDRIOF2                                                  00519000
DDRITAKE EQU   DDRIOF2                                                  00520000
DDRWHICH EQU   DDRIOF2                                                  00521000
DDRIOF1  EQU   DDRIOF                                                   00522000
DDRCOUNT EQU   DDRLONG+48                                               00523000
DDRIBUF  EQU   DDRLONG+44                                               00524000
DDRIBUFL EQU   DDRLONG+42                                               00525000
DDRAPP2  EQU   DDRAPP+1                                                 00526000
DDRAPP1  EQU   DDRAPP                                                   00527000
DDRTER2  EQU   DDRTER+1                                                 00528000
DDRTEST  EQU   DDRLONG+32                                               00529000
DDRUASCB EQU   DDRLONG+28                                               00530000
DDRUTCB  EQU   DDRLONG+24                                               00531000
DDRUIOB  EQU   DDRLONG+20                                               00532000
DDRUDEB  EQU   DDRMIHT+4                                                00533000
DDRUDCB  EQU   DDRMIHT                                                  00534000
DDRASID  EQU   DDRLONG+10                                               00535000
DDRMIH   EQU   DDRLONG+9                                                00536000
DDRFIRST EQU   DDRROWN                                                  00537000
@NM00008 EQU   DDRROWN                                                  00538000
DDRRDENQ EQU   DDRROWN                                                  00539000
DDRRUENQ EQU   DDRROWN                                                  00540000
DDRRTENQ EQU   DDRROWN                                                  00541000
DDRTOCUA EQU   DDRSHORT+21                                              00542000
DDRFMCUA EQU   DDRSHORT+18                                              00543000
DDRUASID EQU   DDRSHORT+16                                              00544000
DDRUIOSB EQU   DDRSHORT+12                                              00545000
@NM00007 EQU   DDRDSTAT                                                 00546000
DDRUR    EQU   DDRDSTAT                                                 00547000
DDRMT    EQU   DDRDSTAT                                                 00548000
DDRDA    EQU   DDRDSTAT                                                 00549000
DDRBUFL  EQU   DDRDSTAT                                                 00550000
DDRMDR   EQU   DDRDCHAR                                                 00551000
@NM00006 EQU   DDRSTAT                                                  00552000
DDRSIRB  EQU   DDRSTAT                                                  00553000
DDRPRG   EQU   DDRSTAT                                                  00554000
DDRRMV   EQU   DDRSTAT                                                  00555000
DDRHAMA  EQU   DDRSTAT                                                  00556000
DDRQUE   EQU   DDRSTAT                                                  00557000
DDRACTV  EQU   DDRSTAT                                                  00558000
@NM00005 EQU   DDRSRC                                                   00559000
DDRPAGE  EQU   DDRSRC                                                   00560000
DDRSYS   EQU   DDRSRC                                                   00561000
DDROPER  EQU   DDRSRC                                                   00562000
DDRNXT   EQU   DDRSHORT+4                                               00563000
DDRID    EQU   DDRSHORT                                                 00564000
UCBERADR EQU   UCBUCS+12                                                00565000
UCBFCBID EQU   UCBUCS+8                                                 00566000
UCBERCNT EQU   UCBUCS+7                                                 00567000
UCBRSV51 EQU   UCBUCS+6                                                 00568000
UCBRSV50 EQU   UCBFCBOP                                                 00569000
UCBRSV49 EQU   UCBFCBOP                                                 00570000
UCBRSV48 EQU   UCBFCBOP                                                 00571000
UCBRSV47 EQU   UCBFCBOP                                                 00572000
UCBRSV46 EQU   UCBFCBOP                                                 00573000
UCBRSV45 EQU   UCBFCBOP                                                 00574000
UCBRSV44 EQU   UCBFCBOP                                                 00575000
UCBFCBO1 EQU   UCBFCBOP                                                 00576000
UCBUCSPE EQU   UCBUCSOP                                                 00577000
UCBRSV43 EQU   UCBUCSOP                                                 00578000
UCBRSV42 EQU   UCBUCSOP                                                 00579000
UCBRSV41 EQU   UCBUCSOP                                                 00580000
UCBRSV40 EQU   UCBUCSOP                                                 00581000
UCBRSV39 EQU   UCBUCSOP                                                 00582000
UCBUCSO2 EQU   UCBUCSOP                                                 00583000
UCBUCSO1 EQU   UCBUCSOP                                                 00584000
UCBUCSID EQU   UCBUCS                                                   00585000
UCBRDATA EQU   UCBOCR+4                                                 00586000
UCBFRID  EQU   UCBOCR                                                   00587000
UCBCLN   EQU   UCBMT+14                                                 00588000
UCBERG   EQU   UCBMT+12                                                 00589000
UCBMS    EQU   UCBMT+11                                                 00590000
UCBNB    EQU   UCBMT+10                                                 00591000
UCBPW    EQU   UCBMT+9                                                  00592000
UCBPR    EQU   UCBMT+8                                                  00593000
UCBSIO   EQU   UCBMT+6                                                  00594000
UCBTW    EQU   UCBMT+5                                                  00595000
UCBTR    EQU   UCBMT+4                                                  00596000
UCBTWT   EQU   UCBMT+3                                                  00597000
UCBTRT   EQU   UCBMT+2                                                  00598000
UCBCTD   EQU   UCBMT                                                    00599000
UCBASID  EQU   UCBCMEXT+14                                              00600000
UCBMFCNT EQU   UCBCMEXT+12                                              00601000
UCBPMSK  EQU   UCBCMEXT+10                                              00602000
UCBCCWOF EQU   UCBCMEXT+8                                               00603000
UCBRV041 EQU   UCBCMEXT+6                                               00604000
UCBRV036 EQU   UCBFLP1                                                  00605000
UCBRV035 EQU   UCBFLP1                                                  00606000
UCBRV034 EQU   UCBFLP1                                                  00607000
UCBRV033 EQU   UCBFLP1                                                  00608000
UCBRV032 EQU   UCBFLP1                                                  00609000
UCBRV031 EQU   UCBFLP1                                                  00610000
UCBRV030 EQU   UCBFLP1                                                  00611000
UCBNSRCH EQU   UCBFLP1                                                  00612000
UCBSNSCT EQU   UCBCMEXT+4                                               00613000
UCBHPDV  EQU   @NM00004                                                 00614000
UCBHALI  EQU   @NM00004                                                 00615000
UCBRSV09 EQU   @NM00004                                                 00616000
UCBRSV08 EQU   @NM00004                                                 00617000
UCBRSV07 EQU   @NM00004                                                 00618000
UCBRSV06 EQU   @NM00004                                                 00619000
UCBRSV05 EQU   @NM00004                                                 00620000
UCBRSV04 EQU   @NM00004                                                 00621000
UCBDTI   EQU   UCBCMEXT+2                                               00622000
UCBSTI   EQU   UCBCMEXT+1                                               00623000
UCBETI   EQU   UCBCMEXT                                                 00624000
UCBEXTP  EQU   UCBEXTPT+1                                               00625000
UCBDDRSW EQU   UCBFLC                                                   00626000
UCBTICBT EQU   UCBFLC                                                   00627000
UCBIVRR  EQU   UCBFLC                                                   00628000
UCBIVRS  EQU   UCBFLC                                                   00629000
UCBITF   EQU   UCBFLC                                                   00630000
UCBUDE   EQU   UCBFLC                                                   00631000
UCBWAA   EQU   UCBFLC                                                   00632000
UCBATTP  EQU   UCBFLC                                                   00633000
UCBUNTYP EQU   UCBTBYT4                                                 00634000
UCBRSV11 EQU   UCBDVCLS                                                 00635000
UCBRSV10 EQU   UCBDVCLS                                                 00636000
UCB3CHAR EQU   UCBDVCLS                                                 00637000
UCB3UREC EQU   UCBDVCLS                                                 00638000
UCB3DISP EQU   UCBDVCLS                                                 00639000
UCB3DACC EQU   UCBDVCLS                                                 00640000
UCB3COMM EQU   UCBDVCLS                                                 00641000
UCB3TAPE EQU   UCBDVCLS                                                 00642000
UCB2OPT7 EQU   UCBTBYT2                                                 00643000
UCB2OPT6 EQU   UCBTBYT2                                                 00644000
UCB2OPT5 EQU   UCBTBYT2                                                 00645000
UCBRWTAU EQU   UCB2OPT4                                                 00646000
UCBRPS   EQU   UCBDUDN2                                                 00647000
UCBRR    EQU   UCBDUDN1                                                 00648000
UCB2OPT1 EQU   UCBTBYT2                                                 00649000
UCB2OPT0 EQU   UCBTBYT2                                                 00650000
UCB1FEA7 EQU   UCBTBYT1                                                 00651000
UCBD6250 EQU   UCB1FEA6                                                 00652000
UCBD1600 EQU   UCB1FEA5                                                 00653000
UCB1FEA4 EQU   UCBTBYT1                                                 00654000
UCB1FEA3 EQU   UCBTBYT1                                                 00655000
UCB1FEA2 EQU   UCBTBYT1                                                 00656000
UCB1FEA1 EQU   UCBTBYT1                                                 00657000
UCB1FEA0 EQU   UCBTBYT1                                                 00658000
UCBNAME  EQU   UCBOB+13                                                 00659000
UCBRV029 EQU   UCBWGT                                                   00660000
UCBVHRSN EQU   UCBWGT                                                   00661000
UCBVORSN EQU   UCBWGT                                                   00662000
UCBMTPXP EQU   UCBWGT                                                   00663000
UCBREW   EQU   UCBWGT                                                   00664000
UCBPUB   EQU   UCBWGT                                                   00665000
UCBOUT   EQU   UCBWGT                                                   00666000
UCBIN    EQU   UCBWGT                                                   00667000
UCBCPU   EQU   UCBOB+11                                                 00668000
UCBLCI   EQU   UCBOB+10                                                 00669000
UCBCNT   EQU   UCBOB+9                                                  00670000
UCBRV017 EQU   UCBCHM1                                                  00671000
UCBRV016 EQU   UCBCHM1                                                  00672000
UCBRV015 EQU   UCBCHM1                                                  00673000
UCBRV014 EQU   UCBCHM1                                                  00674000
UCBSPB   EQU   UCBPTH1                                                  00675000
UCBPPB   EQU   UCBPTH1                                                  00676000
UCBSPA   EQU   UCBPTH0                                                  00677000
UCBPPA   EQU   UCBPTH0                                                  00678000
UCBFLB7  EQU   UCBFLB                                                   00679000
UCBFLB6  EQU   UCBFLB                                                   00680000
UCBFLB5  EQU   UCBFLB                                                   00681000
UCBFLB4  EQU   UCBFLB                                                   00682000
UCBRESVH EQU   UCBFLB                                                   00683000
UCBSPST  EQU   UCBFLB                                                   00684000
UCBASNS  EQU   UCBFLB                                                   00685000
UCBIORST EQU   UCBFLB                                                   00686000
UCBQISCE EQU   UCBFL1                                                   00687000
UCBACTV  EQU   UCBFL1                                                   00688000
UCBSAP   EQU   UCBFL1                                                   00689000
UCBNOTRC EQU   UCBCUB                                                   00690000
UCBPSNS  EQU   UCBFL1                                                   00691000
UCBUSING EQU   UCBPST                                                   00692000
UCBBUSYD EQU   UCBBSY                                                   00693000
UCBUA    EQU   UCBCHAN+1                                                00694000
UCBCHA   EQU   UCBCHAN                                                  00695000
UCBDADI  EQU   UCBSTAT                                                  00696000
UCBSYSR  EQU   UCBSTAT                                                  00697000
UCBPRES  EQU   UCBSTAT                                                  00698000
UCBALOC  EQU   UCBSTAT                                                  00699000
UCBUNLD  EQU   UCBSTAT                                                  00700000
UCBRESV  EQU   UCBSTAT                                                  00701000
UCBCHGS  EQU   UCBSTAT                                                  00702000
UCBONLI  EQU   UCBSTAT                                                  00703000
UCBID    EQU   UCBOB+2                                                  00704000
UCBALTPH EQU   UCBFL5                                                   00705000
UCBALTCU EQU   UCBFL5                                                   00706000
UCBNALOC EQU   UCBFL5                                                   00707000
UCBENVRD EQU   UCBFL5                                                   00708000
UCBVSDR  EQU   UCBFL5                                                   00709000
UCBSASK  EQU   UCBFL5                                                   00710000
UCBAMV   EQU   UCBAF                                                    00711000
UCBDCC   EQU   UCBFL5                                                   00712000
UCBMONT  EQU   UCBJBNR                                                  00713000
UCBRV011 EQU   UCBJBNR                                                  00714000
UCBRSV02 EQU   UCBJBNR                                                  00715000
UCBRSV01 EQU   UCBJBNR                                                  00716000
UCBRV003 EQU   UCBJBNR                                                  00717000
UCBRV002 EQU   UCBJBNR                                                  00718000
UCBRV001 EQU   UCBJBNR                                                  00719000
UCBVRDEV EQU   UCBJBNR                                                  00720000
UCBCMSEG EQU   UCBOB                                                    00721000
UCBPFXND EQU   UCB+512                                                  00722000
UCBIOQ   EQU   UCB+508                                                  00723000
UCBLOCK  EQU   UCB+504                                                  00724000
UCBPXST  EQU   UCB+504                                                  00725000
@NM00001 EQU   UCB                                                      00726000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00727000
@ENDDATA EQU   *                                                        00728000
         END   IGFDU1,(C'PL/S-II',0502,73223)                           00729000
