         TITLE 'IGFDI0, DDR INITIATOR                                  *00001000
                        '                                               00002000
IGFDI0   CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IGFDI0    77.039'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @08,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@08                                         0001 00013000
         L     @00,@SIZDATD                                        0001 00014000
         GETMAIN  R,LV=(0)                                              00015000
         LR    @09,@01                                             0001 00016000
         USING @DATD,@09                                           0001 00017000
         ST    @13,@SA00001+4                                      0001 00018000
         LM    @00,@01,20(@13)                                     0001 00019000
         ST    @09,8(,@13)                                         0001 00020000
         LR    @13,@09                                             0001 00021000
*   ASCBPTR=ESTASCB;                /* INIT ASCB PTR BECAUSE DE0   0209 00022000
*                                      DESTROYS REG 1        @YM04089*/ 00023000
         L     @14,ESTASCB(,ASCBPARM)                              0209 00024000
         ST    @14,ASCBPTR                                         0209 00025000
*   ESTIWORK=ESTADDR;               /* INIT FREE ADDRESS     @YM04089*/ 00026000
         L     @14,ESTADDR(,ASCBPARM)                              0210 00027000
         ST    @14,ESTIWORK                                        0210 00028000
*   RFY                                                            0211 00029000
*    (ESTAIARE) BASED(ESTIWORK);    /* REG 1 IS DESTROYED    @YM04089*/ 00030000
*   DO;                             /* ?IGFDERR INIT NODDRCOM        */ 00031000
*                                                                  0212 00032000
*     /***************************************************************/ 00033000
*     /*                                                             */ 00034000
*     /* IGFDERR - INITIALIZE RECOVERY ENVIRONMENT                   */ 00035000
*     /*                                                             */ 00036000
*     /***************************************************************/ 00037000
*                                                                  0213 00038000
*     DERPTR=ADDR(DERAREA);         /* POINT TO DERPLIST AREA        */ 00039000
         LA    DERPTR,DERAREA                                      0213 00040000
*     DERPLIST=DERPLIST&&DERPLIST;  /* CLEAR PARAMETER LIST          */ 00041000
         XC    DERPLIST(48,DERPTR),DERPLIST(DERPTR)                0214 00042000
*     DERFUNK=DERINIT;              /* INDICATE INIT FUNCTION        */ 00043000
         MVI   DERFUNK(DERPTR),X'01'                               0215 00044000
*     DERREC=ADDR(DERRECPM);        /* POINT TO REC PARMS            */ 00045000
         LA    @14,DERRECPM                                        0216 00046000
         ST    @14,DERREC(,DERPTR)                                 0216 00047000
*     DERSPEC=ADDR(IGFDI1);         /* POINT TO SPECIAL EXIT         */ 00048000
         L     @14,@CV01759                                        0217 00049000
         ST    @14,DERSPEC(,DERPTR)                                0217 00050000
*     DERRETRY=ADDR(IGFDI0R);       /* POINT TO RETRY ROUTINE        */ 00051000
         LA    @14,IGFDI0R                                         0218 00052000
         ST    @14,DERRETRY(,DERPTR)                               0218 00053000
*     GEN SETS(DERDATD) REFS(DERPTR)(MVC DERDATD(4,DERPTR),@SIZDATD)    00054000
*         ;                         /* SET UP SPN, SIZE              */ 00055000
         MVC DERDATD(4,DERPTR),@SIZDATD                                 00056000
*     DERPFX=DERRMASK;              /* SET UP RUB MASK               */ 00057000
         MVC   DERPFX(2,DERPTR),@CB01811                           0220 00058000
*     DERRCODE=CODEBASE;            /* SAVE CODEREG                  */ 00059000
         ST    CODEBASE,DERRCODE(,DERPTR)                          0221 00060000
*     DERRDATA=DATABASE;            /* SAVE DATAREG                  */ 00061000
         ST    DATABASE,DERRDATA(,DERPTR)                          0222 00062000
*     DERRSAVE=SAVEPTR;             /* SAVE REGISTER 13              */ 00063000
         ST    SAVEPTR,DERRSAVE(,DERPTR)                           0223 00064000
*     CALL IGFDE0(DERPLIST);        /* ISSUE ESTAE                   */ 00065000
         ST    DERPTR,@AL00001                                     0224 00066000
         L     @15,@CV01755                                        0224 00067000
         LA    @01,@AL00001                                        0224 00068000
         BALR  @14,@15                                             0224 00069000
*   END;                            /* ?IGFDERR INIT NODDRCOM ESTAE     00070000
*                                      ESTABLISHED                   */ 00071000
*   EXITVAR='0'B;                   /* QUEUE IS NOT EMPTY            */ 00072000
         NI    EXITVAR,B'01111111'                                 0226 00073000
*   DDRSPTR=0;                      /* USE VARIBLE IN ORDER TO FORCE    00074000
*                                      IN REG                        */ 00075000
         SLR   @14,@14                                             0227 00076000
         ST    @14,DDRSPTR                                         0227 00077000
*   DO WHILE(EXITVAR='0'B);         /* IS EXIT ON?                   */ 00078000
         B     @DE00228                                            0228 00079000
@DL00228 DS    0H                                                  0229 00080000
*/*   NO - QUEUE IS NOT EMPTY                                        */ 00081000
*/*   OBTAIN LOCAL LOCK                                              */ 00082000
*                                                                  0229 00083000
*     RFY                                                          0229 00084000
*      (R11,                                                       0229 00085000
*       R12,                                                       0229 00086000
*       R14,                                                       0229 00087000
*       SAVER13) RSTD;              /*                       @YM06734*/ 00088000
*     GEN REFS(PSALITA,FLC) SETS(R11,R12,R14,SAVER13);             0230 00089000
        LR SAVER13,SAVEPTR      SAVE REG 13 OVER SETLOCK                00090000
GETLOC SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                         XX00091000
               RELATED=(LOCAL,IGFDI0(FREELOC)) GET LOCAL LOCK           00092000
        LR SAVEPTR,SAVER13      RESTORE REG 13                          00093000
*     RFY                                                          0231 00094000
*      (R11,                                                       0231 00095000
*       R12,                                                       0231 00096000
*       R14,                                                       0231 00097000
*       SAVER13) UNRSTD;            /*                       @YM06734*/ 00098000
*     IF ASCBASID=1 THEN            /* IS THIS THE MASTER MEMORY     */ 00099000
         L     @14,ASCBPTR                                         0232 00100000
         CLC   ASCBASID(2,@14),@CH00069                            0232 00101000
         BNE   @RF00232                                            0232 00102000
*/*   YES - OBTAIN CMS LOCK                                          */ 00103000
*                                                                  0233 00104000
*       GEN REFS(PSALITA,FLC) SETS(R11,R12,R14,SAVER13);           0233 00105000
        LR SAVER13,SAVEPTR      SAVE REG 13 OVER SETLOCK                00106000
GETCMS SETLOCK OBTAIN,TYPE=CMS,MODE=UNCOND,                           XX00107000
               RELATED=(CMS,IGFDI0(FREECMS)) GET CMS LOCK               00108000
        LR SAVEPTR,SAVER13      RESTORE REG 13                          00109000
*     ELSE                                                         0234 00110000
*       ;                           /* NO - NOT THE MASTER MEMORY    */ 00111000
@RF00232 DS    0H                                                  0235 00112000
*     IF ASXBDDR^=0 THEN            /* IS DDR QUEUE EMPTY?           */ 00113000
         L     @14,ASCBPTR                                         0235 00114000
         L     @12,ASXBPTR(,@14)                                   0235 00115000
         L     @12,ASXBDDR(,@12)                                   0235 00116000
         LTR   @12,@12                                             0235 00117000
         BZ    @RF00235                                            0235 00118000
*       DO;                         /* NO - THE DDR QUEUE IS NOT   0236 00119000
*                                      EMPTY?                        */ 00120000
*         DDRPTR=ADDR(DDRCOMF);     /* INITIALIZE DDRCOM FULL PTR    */ 00121000
         LA    DDRPTR,DDRCOMF                                      0237 00122000
*         DDRSPTR=ASXBDDR;          /* INITIALIZE DDRCOM SHORT PTR   */ 00123000
         ST    @12,DDRSPTR                                         0238 00124000
*         DDRCOMF=DDRCOMF&&DDRCOMF; /* CLEAR FULL DDRCOM             */ 00125000
         XC    DDRCOMF(104),DDRCOMF                                0239 00126000
*         DDRSHORT=DDRSPTR->DDRSHORT;/* COPY SHORT DDRCOM INTO THE 0240 00127000
*                                      EMPTY FULL DDRCOM             */ 00128000
         MVC   DDRSHORT(24,DDRPTR),DDRSHORT(@12)                   0240 00129000
*         DDRID=DDRBLANK;           /* PLACE DDR INDICATOR IN FULL 0241 00130000
*                                      DDRCOM                        */ 00131000
         MVC   DDRID(4,DDRPTR),@CC01773                            0241 00132000
*         DDRQUE='0'B;              /* A REQUEST IS REMOVED          */ 00133000
*         DDRACTV='1'B;             /* THE FULL DDRCOM IS ACTIVE     */ 00134000
         OI    DDRACTV(DDRPTR),B'10000000'                         0243 00135000
         NI    DDRQUE(DDRPTR),B'10111111'                          0243 00136000
*         DDRASID=ASCBASID;         /* INITIALIZE ASID NUMBER        */ 00137000
         LH    @14,ASCBASID(,@14)                                  0244 00138000
         N     @14,@CF01848                                        0244 00139000
         STH   @14,DDRASID(,DDRPTR)                                0244 00140000
*         IF DDRSYS='1'B&DDRPRG='0'B THEN/* IS THIS A SYSTEM REQUEST    00141000
*                                      WITH IOSB STILL ACTIVE        */ 00142000
         TM    DDRSYS(DDRPTR),B'01000000'                          0245 00143000
         BNO   @RF00245                                            0245 00144000
         TM    DDRPRG(DDRPTR),B'00001000'                          0245 00145000
         BNZ   @RF00245                                            0245 00146000
*           DO;                     /* YES - A SYSTEM REQUEST WITH 0246 00147000
*                                      IOSB ACTIVE                   */ 00148000
*             DDREPTR=ADDR(EWDASNS)+LENGTH(EWDASNS);/* INTIALIZE THE    00149000
*                                      ERWA DDRCOM PTR               */ 00150000
         L     @14,IOSBPTR(,DDRPTR)                                0247 00151000
         L     DDREPTR,EWAPTR(,@14)                                0247 00152000
         LA    DDREPTR,EWDASNS(,DDREPTR)                           0247 00153000
         AL    DDREPTR,@CF00958                                    0247 00154000
*             DDRLONG=DDREPTR->DDRLONG;/* COPY THE LONG PORTION FROM    00155000
*                                      THE ERWA DDRCOM TO THE FULL 0248 00156000
*                                      DDRCOM                        */ 00157000
         MVC   DDRLONG(80,DDRPTR),DDRLONG(DDREPTR)                 0248 00158000
*           END;                                                   0249 00159000
*         ELSE                                                     0250 00160000
*           ;                       /* NO - NOT A SYSTEM REQUEST   0250 00161000
*                                      AND/OR IOSB NOT ACTIVE        */ 00162000
*                                                                  0250 00163000
@RF00245 DS    0H                                                  0251 00164000
*         /***********************************************************/ 00165000
*         /*                                                         */ 00166000
*         /* INITIALIZE SSIB/SSOB FOR SUBSEQUENT JES3 INTERFACE      */ 00167000
*         /*                                                 @Y02BKCI*/ 00168000
*         /*                                                         */ 00169000
*         /***********************************************************/ 00170000
*                                                                  0251 00171000
*         JES3BLKS=JES3BLKS&&JES3BLKS;/* CLEAR SSIB/SSOB STORAGE   0251 00172000
*                                                            @Y02BKCI*/ 00173000
         XC    JES3BLKS(72),JES3BLKS                               0251 00174000
*         DDRSSOB=ADDR(JES3SSOB);   /* SAVE PTR TO SSOB IN DDRCOM  0252 00175000
*                                                            @Y02BKCI*/ 00176000
         LA    @14,JES3SSOB                                        0252 00177000
         ST    @14,DDRSSOB(,DDRPTR)                                0252 00178000
*         SSOBID='SSOB';            /* SET UP SSOB ID FIELD  @Y02BKCI*/ 00179000
         MVC   SSOBID(4,@14),@CC01832                              0253 00180000
*         SSOBLEN=LENGTH(SSOB);     /* SET UP SSOB LENGTH FIELD    0254 00181000
*                                                            @Y02BKCI*/ 00182000
         MVC   SSOBLEN(2,@14),@CH00601                             0254 00183000
*         SSOBSSIB=ADDR(JES3SSIB);  /* SET UP SSOB PTR TO SSIB     0255 00184000
*                                                            @Y02BKCI*/ 00185000
         LA    @12,JES3SSIB                                        0255 00186000
         ST    @12,SSOBSSIB(,@14)                                  0255 00187000
*         SSOBINDV=ADDR(JES3SSDR);  /* SET UP SSOB PTR TO SSDR     0256 00188000
*                                                            @Y02BKCI*/ 00189000
         LA    @12,JES3SSDR                                        0256 00190000
         ST    @12,SSOBINDV(,@14)                                  0256 00191000
*         SSIBID='SSIB';            /* SET UP SSIB ID FIELD  @Y02BKCI*/ 00192000
         L     @14,SSIBPTR(,@14)                                   0257 00193000
         MVC   SSIBID(4,@14),@CC01833                              0257 00194000
*         SSIBLEN=LENGTH(SSIB);     /* SET UP SSIB LENGTH FIELD    0258 00195000
*                                                            @Y02BKCI*/ 00196000
         MVC   SSIBLEN(2,@14),@CH00599                             0258 00197000
*         SSIBSSNM=JESPJESN;        /* SET UP SSIB SUBSYSTEM NAME  0259 00198000
*                                      FIELD                 @Y02BKCI*/ 00199000
         L     @11,CVTPTR                                          0259 00200000
         L     @11,CVTJESCT(,@11)                                  0259 00201000
         MVC   SSIBSSNM(4,@14),JESPJESN(@11)                       0259 00202000
*         SSDRLEN=LENGTH(SSDR);     /* SET UP SSDR LENGTH FIELD    0260 00203000
*                                                            @Y02BKCI*/ 00204000
         MVC   SSDRLEN(2,@12),@CH00129                             0260 00205000
*         DERRDDR=DDRPTR;           /* PLACE DDRCOM ADDRESS IN     0261 00206000
*                                      DERPLIST                      */ 00207000
         ST    DDRPTR,DERRDDR(,DERPTR)                             0261 00208000
*         DDRIBUF=ADDR(BUFFER);     /* INITIALIZE I/O BUFFER ADDRESS */ 00209000
         LA    @14,BUFFER                                          0262 00210000
         ST    @14,DDRIBUF(,DDRPTR)                                0262 00211000
*         ASXBDDR=DDRPTR;           /* UPDATE ASXB DDRCOM QUEUE      */ 00212000
         L     @14,ASCBPTR                                         0263 00213000
         L     @14,ASXBPTR(,@14)                                   0263 00214000
         ST    DDRPTR,ASXBDDR(,@14)                                0263 00215000
*       END;                                                       0264 00216000
*     ELSE                          /* YES - DDR QUEUE IS EMPTY      */ 00217000
*       EXITVAR='1'B;               /* TASK MAY TERMINATE            */ 00218000
         B     @RC00235                                            0265 00219000
@RF00235 OI    EXITVAR,B'10000000'                                 0265 00220000
*     RFY                                                          0266 00221000
*      (R11,                                                       0266 00222000
*       R12,                                                       0266 00223000
*       R14,                                                       0266 00224000
*       SAVER13) RSTD;              /*                       @YM06734*/ 00225000
@RC00235 DS    0H                                                  0267 00226000
*     IF ASCBASID=1 THEN            /* IS THIS THE MASTER MEMORY     */ 00227000
         L     @06,ASCBPTR                                         0267 00228000
         CLC   ASCBASID(2,@06),@CH00069                            0267 00229000
         BNE   @RF00267                                            0267 00230000
*/*   YES - RELEASE CMS LOCK                                         */ 00231000
*                                                                  0268 00232000
*       GEN REFS(PSALITA,FLC) SETS(R11,R12,R14,SAVER13);           0268 00233000
        LR SAVER13,SAVEPTR      SAVE REG 13 OVER SETLOCK                00234000
RELCMS SETLOCK RELEASE,TYPE=CMS,                                      XX00235000
               RELATED=(CMS,IGFDI0(GETCMS)) FREE CMS LOCK               00236000
        LR SAVEPTR,SAVER13      RESTORE REG 13                          00237000
*     ELSE                                                         0269 00238000
*       ;                           /* NO - THE CMS LOCK IS NOT HELD */ 00239000
@RF00267 DS    0H                                                  0270 00240000
*     RFY                                                          0270 00241000
*      (R11,                                                       0270 00242000
*       R12,                                                       0270 00243000
*       R14,                                                       0270 00244000
*       SAVER13) UNRSTD;            /*                       @YM06734*/ 00245000
*/*  RELEASE LOCAL LOCK                                              */ 00246000
*                                                                  0271 00247000
*     GEN REFS(PSALITA,FLC) SETS(R11,R12,R14,SAVER13);             0271 00248000
        LR SAVER13,SAVEPTR      SAVE REG 13 OVER SETLOCK                00249000
RELLOC SETLOCK RELEASE,TYPE=LOCAL,                                    XX00250000
               RELATED=(LOCAL,IGFDI0(GETLOC)) RELEASE LOCAL LOCK        00251000
        LR SAVEPTR,SAVER13      RESTORE REG 13                          00252000
*     IF EXITVAR='0'B THEN          /* IS EXIT SET /                 */ 00253000
         TM    EXITVAR,B'10000000'                                 0272 00254000
         BNZ   @RF00272                                            0272 00255000
*       DO;                         /* NO - TERMINATION IS NOT SET   */ 00256000
*         DO;                       /* FREEMAIN(R) LV(LENGTH(DDRSHORT   00257000
*                                      ))SP(245)A(DDRSPTR->DDRSHORT) */ 00258000
*           RESPECIFY                                              0275 00259000
*            (GPR01F,                                              0275 00260000
*             GPR00F) RESTRICTED;                                  0275 00261000
*           GPR00F=LENGTH(DDRSHORT);/* LENGTH REQUESTED              */ 00262000
         LA    GPR00F,24                                           0276 00263000
*           GPR01F=245;             /* SP IN REG 1                   */ 00264000
         LA    GPR01F,245                                          0277 00265000
*           GEN(SLL   GPR01F,24)                                   0278 00266000
*           NODEFS NOREFS NOSETS NOEXIT NOFLOWS SEQFLOW;           0278 00267000
         SLL   GPR01F,24                                                00268000
*           GPR00F=GPR00F|GPR01F;   /* SP IN HI BYTE                 */ 00269000
         OR    GPR00F,GPR01F                                       0279 00270000
*           GPR01F=ADDR(DDRSPTR->DDRSHORT);/* SET REGISTER ONE       */ 00271000
         L     GPR01F,DDRSPTR                                      0280 00272000
*           SVC(10);                /* R-FORM OF GETMAIN             */ 00273000
         SVC   10                                                  0281 00274000
*           RESPECIFY                                              0282 00275000
*            (GPR01F,                                              0282 00276000
*             GPR00F) UNRESTRICTED;                                0282 00277000
*         END;                      /* FREEMAIN(R) LV(LENGTH(DDRSHORT   00278000
*                                      ))SP(245)A(DDRSPTR->DDRSHORT) */ 00279000
*         IF DDRHAMA='1'B THEN      /* IS REQUEST DEAD?              */ 00280000
         TM    DDRHAMA(DDRPTR),B'00100000'                         0284 00281000
         BNO   @RF00284                                            0284 00282000
*           DO;                     /*                       @ZA16592*/ 00283000
*             DDRTOUCB=0;           /* ZERO 'TO' UCB ADDRESS @ZA16592*/ 00284000
         SLR   @14,@14                                             0286 00285000
         ST    @14,DDRTOUCB(,DDRPTR)                               0286 00286000
*             DDRTOCUA=0;           /* ZERO 'TO' CUA         @ZA16592*/ 00287000
         STCM  @14,7,DDRTOCUA(DDRPTR)                              0287 00288000
*             DDRTER1=DDRTCE;       /* YES - CATASTROPHIC ERROR      */ 00289000
         MVI   DDRTER1(DDRPTR),X'07'                               0288 00290000
*           END;                    /*                       @ZA16592*/ 00291000
*         ELSE                      /* NO - REQUEST IS NOT DEAD      */ 00292000
*           DO;                                                    0290 00293000
         B     @RC00284                                            0290 00294000
@RF00284 DS    0H                                                  0291 00295000
*             IF DDRMT='1'B THEN    /* IS REQUEST FOR TAPE?          */ 00296000
         TM    DDRMT(DDRPTR),B'00100000'                           0291 00297000
         BNO   @RF00291                                            0291 00298000
*               CALL IGFDT0;        /* YES - CALL TAPE SELECT        */ 00299000
         L     @15,@CV01756                                        0292 00300000
         BALR  @14,@15                                             0292 00301000
*             ELSE                  /* NO - CONTINUE                 */ 00302000
*               IF DDRDA='1'B THEN  /* IS REQUEST FOR DISK?          */ 00303000
         B     @RC00291                                            0293 00304000
@RF00291 TM    DDRDA(DDRPTR),B'01000000'                           0293 00305000
         BNO   @RF00293                                            0293 00306000
*                 CALL IGFDD0;      /* YES - CALL DISK SELECT        */ 00307000
         L     @15,@CV01758                                        0294 00308000
         BALR  @14,@15                                             0294 00309000
*               ELSE                /* NO - NOT A DISK               */ 00310000
*                 CALL IGFDU0;      /* CALL UNIT RECORD SELECT       */ 00311000
         B     @RC00293                                            0295 00312000
@RF00293 L     @15,@CV01757                                        0295 00313000
         BALR  @14,@15                                             0295 00314000
*           END;                                                   0296 00315000
*                                                                  0296 00316000
@RC00293 DS    0H                                                  0296 00317000
@RC00291 DS    0H                                                  0297 00318000
*/*   THE REQUEST IS TERMINATED AFTER THE SELECT MODULE RETURNS OR 0297 00319000
*     AN INVALID REQUEST                                             */ 00320000
*/*   IGFDI1 INTERFACE REGISTERS                                     */ 00321000
*                                                                  0297 00322000
*         RFY                                                      0297 00323000
*          (R0,                                                    0297 00324000
*           R2) RSTD;                                              0297 00325000
@RC00284 DS    0H                                                  0298 00326000
*         R0=0;                     /* NOT AN ERROR ENTRY            */ 00327000
         SLR   R0,R0                                               0298 00328000
*         R2=R0;                    /* NOT AN ERROR ENTRY            */ 00329000
         LR    R2,R0                                               0299 00330000
*         ASCBPARM=ASCBPTR;         /* REG 1 = ASCB ADDRESS          */ 00331000
         L     ASCBPARM,ASCBPTR                                    0300 00332000
*         CALL IGFDI1;              /* TERMINATE REQUEST             */ 00333000
         L     @15,@CV01759                                        0301 00334000
         BALR  @14,@15                                             0301 00335000
*         IF RTNCODE^=0 THEN        /* IS THE QUEUE EMPTY?           */ 00336000
         LTR   RTNCODE,RTNCODE                                     0302 00337000
         BZ    @RF00302                                            0302 00338000
*           EXITVAR='1'B;           /* YES - SET LOOP END            */ 00339000
         OI    EXITVAR,B'10000000'                                 0303 00340000
*         ELSE                                                     0304 00341000
*           ;                       /* NO - QUEUE NOT EMPTY          */ 00342000
@RF00302 DS    0H                                                  0305 00343000
*         DERRDDR=0;                /* CLEAR DDRCOM ADDRESS IN     0305 00344000
*                                      DERPLIST                      */ 00345000
         SLR   @14,@14                                             0305 00346000
         ST    @14,DERRDDR(,DERPTR)                                0305 00347000
*         RFY                                                      0306 00348000
*          (R0,                                                    0306 00349000
*           R2) UNRSTD;                                            0306 00350000
*       END;                                                       0307 00351000
*   END;                            /* END OF DO LOOP - END OF     0308 00352000
*                                      REQUEST                       */ 00353000
*                                                                  0308 00354000
@RF00272 DS    0H                                                  0308 00355000
@DE00228 TM    EXITVAR,B'10000000'                                 0308 00356000
         BZ    @DL00228                                            0308 00357000
*   /*****************************************************************/ 00358000
*   /*                                                               */ 00359000
*   /* THE EXIT VARIABLE(EXITVAR) IS ON WHICH MEANS THE QUEUE IS     */ 00360000
*   /* EMPTY AND THE ESTAI WORKAREA WHICH WAS GETMAINED VIA IGFDS1   */ 00361000
*   /* MUST BE FREED.                                        @YM02581*/ 00362000
*   /*                                                               */ 00363000
*   /*****************************************************************/ 00364000
*                                                                  0309 00365000
*   DERPTR=ADDR(ESTPLIST);          /* SET DERPLIST PTR TO THE ESTAI    00366000
*                                      AREA THAT WAS GETMAINED VIA S1   00367000
*                                                            @YM04089*/ 00368000
         L     DERPTR,ESTIWORK                                     0309 00369000
         LA    DERPTR,ESTPLIST(,DERPTR)                            0309 00370000
*   DO;                             /* FREEMAIN(R) LV(DERDALNG)SP(DER   00371000
*                                      DASPN)A(ESTIWORK->DUMFREAD)   */ 00372000
*     RESPECIFY                                                    0311 00373000
*      (GPR01F,                                                    0311 00374000
*       GPR00F) RESTRICTED;                                        0311 00375000
*     GPR00F=DERDALNG;              /* LENGTH REQUESTED              */ 00376000
         L     GPR00F,DERDALNG-1(,DERPTR)                          0312 00377000
         ICM   GPR00F,8,@CB00617                                   0312 00378000
*     GPR01F=DERDASPN;              /* SP IN REG 1                   */ 00379000
         SLR   GPR01F,GPR01F                                       0313 00380000
         IC    GPR01F,DERDASPN(,DERPTR)                            0313 00381000
*     GEN(SLL   GPR01F,24)                                         0314 00382000
*     NODEFS NOREFS NOSETS NOEXIT NOFLOWS SEQFLOW;                 0314 00383000
         SLL   GPR01F,24                                                00384000
*     GPR00F=GPR00F|GPR01F;         /* SP IN HI BYTE                 */ 00385000
         OR    GPR00F,GPR01F                                       0315 00386000
*     GPR01F=ADDR(ESTIWORK->DUMFREAD);/* SET REGISTER ONE            */ 00387000
         L     GPR01F,ESTIWORK                                     0316 00388000
*     SVC(10);                      /* R-FORM OF GETMAIN             */ 00389000
         SVC   10                                                  0317 00390000
*     RESPECIFY                                                    0318 00391000
*      (GPR01F,                                                    0318 00392000
*       GPR00F) UNRESTRICTED;                                      0318 00393000
*   END;                            /* FREEMAIN(R) LV(DERDALNG)SP(DER   00394000
*                                      DASPN)A(ESTIWORK->DUMFREAD)   */ 00395000
*                                                                  0319 00396000
*   /*****************************************************************/ 00397000
*   /*                                                               */ 00398000
*   /* THIS IS THE COMMON EXIT ROUTINE FOR THIS MODULE       @YM04089*/ 00399000
*   /*                                                               */ 00400000
*   /*****************************************************************/ 00401000
*                                                                  0320 00402000
*IGFDI0R:                                                          0320 00403000
*   ;                               /*                       @YM04089*/ 00404000
IGFDI0R  DS    0H                                                  0321 00405000
*   DO;                             /* ?IGFDERR CANCEL               */ 00406000
*                                                                  0321 00407000
*     /***************************************************************/ 00408000
*     /*                                                             */ 00409000
*     /* IGFDERR - CANCEL RECOVERY ENVIRONMENT                       */ 00410000
*     /*                                                             */ 00411000
*     /***************************************************************/ 00412000
*                                                                  0322 00413000
*     DERPTR=ADDR(DERAREA);         /* POINT TO DERPLIST AREA        */ 00414000
         LA    DERPTR,DERAREA                                      0322 00415000
*     DERFUNK=DERCANC;              /* INDICATE CANCEL               */ 00416000
         MVI   DERFUNK(DERPTR),X'02'                               0323 00417000
*     CALL IGFDE0(DERPLIST);        /* CANCEL ESTAE                  */ 00418000
         ST    DERPTR,@AL00001                                     0324 00419000
         L     @15,@CV01755                                        0324 00420000
         LA    @01,@AL00001                                        0324 00421000
         BALR  @14,@15                                             0324 00422000
*   END;                            /* ?IGFDERR CANCEL ESTAE CANCEL  */ 00423000
*   RETURN;                         /* RETURN TO CALLER              */ 00424000
@EL00001 L     @13,4(,@13)                                         0326 00425000
@EF00001 L     @00,@SIZDATD                                        0326 00426000
         LR    @01,@09                                             0326 00427000
         FREEMAIN R,LV=(0),A=(1)                                        00428000
@ER00001 LM    @14,@12,12(@13)                                     0326 00429000
         BR    @14                                                 0326 00430000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 00431000
*     GPR00F FIXED(31) REG(0),                                     0327 00432000
*     GPR01F FIXED(31) REG(1);                                     0327 00433000
*   DECLARE                         /* COMMON VARIABLES              */ 00434000
*     I256C CHAR(256) BASED,                                       0328 00435000
*     I031F FIXED(31) BASED,                                       0328 00436000
*     I031P PTR(31) BASED,                                         0328 00437000
*     I015F FIXED(15) BASED,                                       0328 00438000
*     I015P PTR(15) BASED,                                         0328 00439000
*     I008P PTR(8) BASED,                                          0328 00440000
*     I001C CHAR(1) BASED;          /* NECESSARY FOR THE VARIBLE   0328 00441000
*                                      DECLARES IN FREEMAIN MACRO    */ 00442000
*   END IGFDI0                                                     0329 00443000
*                                                                  0329 00444000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00445000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00446000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00447000
*/*%INCLUDE SYSLIB  (IHAASXB )                                       */ 00448000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00449000
*/*%INCLUDE SYSLIB  (IHADDR  )                                       */ 00450000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00451000
*/*%INCLUDE SYSLIB  (IEFJESCT)                                       */ 00452000
*/*%INCLUDE SYSLIB  (IEFJSSIB)                                       */ 00453000
*/*%INCLUDE SYSLIB  (IEFJSSOB)                                       */ 00454000
*                                                                  0329 00455000
*       ;                                                          0329 00456000
@DATA    DS    0H                                                       00457000
@CH00069 DC    H'1'                                                     00458000
@CH00129 DC    H'16'                                                    00459000
@CH00601 DC    H'20'                                                    00460000
@CH00599 DC    H'36'                                                    00461000
@DATD    DSECT                                                          00462000
         DS    0F                                                       00463000
@SA00001 DS    18F                                                      00464000
@AL00001 DS    1A                                                       00465000
IGFDI0   CSECT                                                          00466000
         DS    0F                                                       00467000
@CF00958 DC    F'28'                                                    00468000
@CF01848 DC    XL4'0000FFFF'                                            00469000
@DATD    DSECT                                                          00470000
         DS    0D                                                       00471000
ASCBPTR  DS    A                                                        00472000
ESTIWORK DS    A                                                        00473000
DDRSPTR  DS    A                                                        00474000
DDRCOMF  DS    CL104                                                    00475000
BUFFER   DS    CL80                                                     00476000
JES3BLKS DS    CL72                                                     00477000
         ORG   JES3BLKS                                                 00478000
JES3SSIB DS    CL36                                                     00479000
JES3SSOB DS    CL20                                                     00480000
JES3SSDR DS    CL16                                                     00481000
         ORG   JES3BLKS+72                                              00482000
EXITVAR  DS    BL1                                                      00483000
         DS    CL3                                                      00484000
DERAREA  DS    CL48                                                     00485000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00486000
@ENDDATD EQU   *                                                        00487000
IGFDI0   CSECT                                                          00488000
         DS    0F                                                       00489000
@SIZDATD DC    AL1(245)                                                 00490000
         DC    AL3(@ENDDATD-@DATD)                                      00491000
@CV01755 DC    V(IGFDE0)                                                00492000
@CV01756 DC    V(IGFDT0)                                                00493000
@CV01757 DC    V(IGFDU0)                                                00494000
@CV01758 DC    V(IGFDD0)                                                00495000
@CV01759 DC    V(IGFDI1)                                                00496000
         DS    0D                                                       00497000
@CC01773 DC    C'DDR '                                                  00498000
@CC01832 DC    C'SSOB'                                                  00499000
@CC01833 DC    C'SSIB'                                                  00500000
@CB00617 DC    X'00'                                                    00501000
@CB01811 DC    B'0000000011100100'                                      00502000
DERRECPM DS    CL24                                                     00503000
         ORG   DERRECPM                                                 00504000
@NM00057 DC    CL8'IGFDI0'                                              00505000
@NM00058 DC    CL8'IGFDI0'                                              00506000
@NM00059 DC    CL8'77039'                                               00507000
         ORG   DERRECPM+24                                              00508000
         DS    CL1                                                      00509000
IGFDI0P  DC    13F'0'                                                   00510000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00511000
@01      EQU   01                                                       00512000
@02      EQU   02                                                       00513000
@03      EQU   03                                                       00514000
@04      EQU   04                                                       00515000
@05      EQU   05                                                       00516000
@06      EQU   06                                                       00517000
@07      EQU   07                                                       00518000
@08      EQU   08                                                       00519000
@09      EQU   09                                                       00520000
@10      EQU   10                                                       00521000
@11      EQU   11                                                       00522000
@12      EQU   12                                                       00523000
@13      EQU   13                                                       00524000
@14      EQU   14                                                       00525000
@15      EQU   15                                                       00526000
DDREPTR  EQU   @02                                                      00527000
CODEBASE EQU   @08                                                      00528000
DATABASE EQU   @09                                                      00529000
DDRPTR   EQU   @10                                                      00530000
ASCBPARM EQU   @01                                                      00531000
SAVER13  EQU   @07                                                      00532000
R0       EQU   @00                                                      00533000
R2       EQU   @02                                                      00534000
DERPTR   EQU   @03                                                      00535000
R11      EQU   @11                                                      00536000
R12      EQU   @12                                                      00537000
R14      EQU   @14                                                      00538000
SAVEPTR  EQU   @13                                                      00539000
RTNCODE  EQU   @15                                                      00540000
GPR01F   EQU   @01                                                      00541000
GPR00F   EQU   @00                                                      00542000
PSA      EQU   0                                                        00543000
FLCRNPSW EQU   PSA                                                      00544000
FLCROPSW EQU   PSA+8                                                    00545000
FLCICCW2 EQU   PSA+16                                                   00546000
FLCCVT   EQU   FLCICCW2                                                 00547000
PSAEEPSW EQU   PSA+132                                                  00548000
PSAESPSW EQU   PSA+136                                                  00549000
FLCSVILC EQU   PSAESPSW+1                                               00550000
PSAEPPSW EQU   PSA+140                                                  00551000
FLCPIILC EQU   PSAEPPSW+1                                               00552000
FLCPICOD EQU   PSAEPPSW+2                                               00553000
PSAPICOD EQU   FLCPICOD+1                                               00554000
FLCTEA   EQU   PSAEPPSW+4                                               00555000
FLCPER   EQU   PSA+152                                                  00556000
FLCMCLA  EQU   PSA+168                                                  00557000
FLCIOEL  EQU   FLCMCLA+4                                                00558000
FLCIOA   EQU   FLCMCLA+16                                               00559000
FLCFSA   EQU   FLCMCLA+80                                               00560000
PSASUPER EQU   PSA+552                                                  00561000
PSASUP1  EQU   PSASUPER                                                 00562000
PSASUP2  EQU   PSASUPER+1                                               00563000
PSASUP3  EQU   PSASUPER+2                                               00564000
PSASUP4  EQU   PSASUPER+3                                               00565000
PSACLHT  EQU   PSA+640                                                  00566000
PSALKSA  EQU   PSA+696                                                  00567000
PSAHLHI  EQU   PSA+760                                                  00568000
PSALITA  EQU   PSA+764                                                  00569000
PSADSSFL EQU   PSA+836                                                  00570000
PSADSSF1 EQU   PSADSSFL                                                 00571000
PSADSSF3 EQU   PSADSSFL+2                                               00572000
PSADSSF4 EQU   PSADSSFL+3                                               00573000
PSARSVT  EQU   PSA+896                                                  00574000
ASCB     EQU   0                                                        00575000
ASCBASID EQU   ASCB+36                                                  00576000
ASCBFW1  EQU   ASCB+100                                                 00577000
ASCBRCTF EQU   ASCBFW1+2                                                00578000
ASCBFLG1 EQU   ASCBFW1+3                                                00579000
ASCBASXB EQU   ASCB+108                                                 00580000
ASCBDSP1 EQU   ASCB+114                                                 00581000
ASCBFLG2 EQU   ASCB+115                                                 00582000
ASXB     EQU   0                                                        00583000
ASXBDDR  EQU   ASXB+124                                                 00584000
ASXBAEQ  EQU   ASXB+168                                                 00585000
IOSB     EQU   0                                                        00586000
IOSFLA   EQU   IOSB                                                     00587000
IOSACHN  EQU   IOSFLA                                                   00588000
IOSFLB   EQU   IOSB+1                                                   00589000
IOSFLC   EQU   IOSB+2                                                   00590000
IOSDVALT EQU   IOSFLC                                                   00591000
IOSPKEY  EQU   IOSB+12                                                  00592000
IOSOPT   EQU   IOSB+14                                                  00593000
IOSOPT2  EQU   IOSB+15                                                  00594000
@NM00026 EQU   IOSB+20                                                  00595000
IOSCSW   EQU   @NM00026+1                                               00596000
IOSTATUS EQU   IOSCSW+3                                                 00597000
IOSIPIB  EQU   IOSB+44                                                  00598000
IOSERP   EQU   IOSB+52                                                  00599000
IOSPATH  EQU   IOSB+86                                                  00600000
IOSCHN   EQU   IOSPATH                                                  00601000
IOSCKEY  EQU   IOSB+89                                                  00602000
IOSEEKA  EQU   IOSB+100                                                 00603000
IOSCCHH  EQU   IOSEEKA+3                                                00604000
IOSSKHH  EQU   IOSCCHH+2                                                00605000
DDRCOM   EQU   0                                                        00606000
DDRSHORT EQU   DDRCOM                                                   00607000
DDRID    EQU   DDRSHORT                                                 00608000
DDRCNTRL EQU   DDRSHORT+8                                               00609000
DDRSRC   EQU   DDRCNTRL                                                 00610000
DDRSYS   EQU   DDRSRC                                                   00611000
DDRSTAT  EQU   DDRCNTRL+1                                               00612000
DDRACTV  EQU   DDRSTAT                                                  00613000
DDRQUE   EQU   DDRSTAT                                                  00614000
DDRHAMA  EQU   DDRSTAT                                                  00615000
DDRPRG   EQU   DDRSTAT                                                  00616000
DDRDCHAR EQU   DDRCNTRL+2                                               00617000
DDRDSTAT EQU   DDRDCHAR+1                                               00618000
DDRDA    EQU   DDRDSTAT                                                 00619000
DDRMT    EQU   DDRDSTAT                                                 00620000
DDRUIOSB EQU   DDRSHORT+12                                              00621000
DDRTOCUA EQU   DDRSHORT+21                                              00622000
DDRLONG  EQU   DDRCOM+24                                                00623000
DDRTOUCB EQU   DDRLONG                                                  00624000
DDRROWN  EQU   DDRLONG+8                                                00625000
DDRASID  EQU   DDRLONG+10                                               00626000
DDRMIHT  EQU   DDRLONG+12                                               00627000
DDRTER   EQU   DDRLONG+36                                               00628000
DDRTER1  EQU   DDRTER                                                   00629000
DDRINV   EQU   DDRLONG+38                                               00630000
DDRAPP   EQU   DDRLONG+40                                               00631000
DDRIBUF  EQU   DDRLONG+44                                               00632000
DDRIOF   EQU   DDRLONG+52                                               00633000
DDRIOF2  EQU   DDRIOF+1                                                 00634000
DDRMSG   EQU   DDRLONG+54                                               00635000
DDRMSGP  EQU   DDRLONG+56                                               00636000
DDRLABEL EQU   DDRLONG+64                                               00637000
DDRREC   EQU   DDRLONG+66                                               00638000
DDRREC2  EQU   DDRREC+1                                                 00639000
DDRUSER  EQU   DDRLONG+68                                               00640000
DDRSSOB  EQU   DDRLONG+76                                               00641000
EWA      EQU   0                                                        00642000
EWAHDR   EQU   EWA                                                      00643000
EWAFLAGS EQU   EWA+4                                                    00644000
EWAFLG1  EQU   EWAFLAGS                                                 00645000
EWASCCD  EQU   EWAFLG1                                                  00646000
EWASCC3  EQU   EWASCCD                                                  00647000
EWAFLG2  EQU   EWAFLAGS+1                                               00648000
EWASNSCT EQU   EWAFLAGS+3                                               00649000
EWACNTRS EQU   EWA+10                                                   00650000
EWAERPIB EQU   EWA+16                                                   00651000
EWARGFG1 EQU   EWAERPIB+4                                               00652000
EWARGFG2 EQU   EWAERPIB+5                                               00653000
EWAXCSW1 EQU   EWAERPIB+6                                               00654000
EWAXCSW2 EQU   EWAERPIB+7                                               00655000
EWAIERP  EQU   EWA+32                                                   00656000
CVTMAP   EQU   0                                                        00657000
CVTDAR   EQU   CVTMAP+72                                                00658000
CVTFLGS1 EQU   CVTDAR                                                   00659000
CVTDCB   EQU   CVTMAP+116                                               00660000
CVTIERLC EQU   CVTMAP+144                                               00661000
CVTOPTA  EQU   CVTMAP+182                                               00662000
CVTOPTB  EQU   CVTMAP+183                                               00663000
CVTGTF   EQU   CVTMAP+236                                               00664000
CVTGTFST EQU   CVTGTF                                                   00665000
CVTGTFS  EQU   CVTGTFST                                                 00666000
CVTSTATE EQU   CVTGTFST                                                 00667000
CVTTMODE EQU   CVTGTFST                                                 00668000
CVTFORM  EQU   CVTGTFST                                                 00669000
CVTAQAVT EQU   CVTMAP+240                                               00670000
CVTTCMFG EQU   CVTAQAVT                                                 00671000
CVTVOLM2 EQU   CVTMAP+244                                               00672000
CVTTATA  EQU   CVTVOLM2                                                 00673000
CVTTSKS  EQU   CVTTATA                                                  00674000
CVTVOLF2 EQU   CVTTSKS                                                  00675000
CVTTAT   EQU   CVTTATA+1                                                00676000
CVTATER  EQU   CVTMAP+248                                               00677000
CVTEXT1  EQU   CVTMAP+252                                               00678000
CVTPURG  EQU   CVTMAP+260                                               00679000
CVTQMSG  EQU   CVTMAP+268                                               00680000
CVTDMSR  EQU   CVTMAP+272                                               00681000
CVTJESCT EQU   CVTMAP+296                                               00682000
CVTERPV  EQU   CVTMAP+316                                               00683000
CVTINTLA EQU   CVTMAP+320                                               00684000
CVTAPF   EQU   CVTMAP+324                                               00685000
CVTEXT2  EQU   CVTMAP+328                                               00686000
CVTHJES  EQU   CVTMAP+332                                               00687000
CVTPGSIA EQU   CVTMAP+348                                               00688000
CVTA1F1  EQU   CVTMAP+356                                               00689000
CVTSYSK  EQU   CVTMAP+357                                               00690000
CVTVOLM1 EQU   CVTMAP+380                                               00691000
CVTVOLF1 EQU   CVTVOLM1                                                 00692000
CVTATMCT EQU   CVTMAP+388                                               00693000
CVTXTNT1 EQU   0                                                        00694000
CVTXTNT2 EQU   0                                                        00695000
CVTDSSV  EQU   CVTXTNT2                                                 00696000
CVTFLGBT EQU   CVTXTNT2+5                                               00697000
CVTQID   EQU   CVTXTNT2+24                                              00698000
CVTRV400 EQU   CVTXTNT2+52                                              00699000
CVTRV409 EQU   CVTXTNT2+53                                              00700000
CVTATCVT EQU   CVTXTNT2+64                                              00701000
CVTRV429 EQU   CVTXTNT2+84                                              00702000
CVTRV438 EQU   CVTXTNT2+85                                              00703000
CVTRV457 EQU   CVTXTNT2+112                                             00704000
CVTRV466 EQU   CVTXTNT2+113                                             00705000
CVTFIX   EQU   0                                                        00706000
CVTRELNO EQU   CVTFIX+252                                               00707000
JESCT    EQU   0                                                        00708000
JESWAA   EQU   JESCT+8                                                  00709000
JESSSREQ EQU   JESCT+20                                                 00710000
JESPJESN EQU   JESCT+28                                                 00711000
SSIB     EQU   0                                                        00712000
SSIBID   EQU   SSIB                                                     00713000
SSIBLEN  EQU   SSIB+4                                                   00714000
SSIBFLG1 EQU   SSIB+6                                                   00715000
SSIBSSNM EQU   SSIB+8                                                   00716000
SSOB     EQU   0                                                        00717000
SSOBID   EQU   SSOB                                                     00718000
SSOBLEN  EQU   SSOB+4                                                   00719000
SSOBSSIB EQU   SSOB+8                                                   00720000
SSOBINDV EQU   SSOB+16                                                  00721000
SSDR     EQU   0                                                        00722000
SSDRLEN  EQU   SSDR                                                     00723000
SSDRFLG2 EQU   SSDR+3                                                   00724000
DUMFREAD EQU   0                                                        00725000
DERPLIST EQU   0                                                        00726000
DERFUNK  EQU   DERPLIST                                                 00727000
DERSWCHS EQU   DERPLIST+1                                               00728000
DERREC   EQU   DERPLIST+4                                               00729000
DERSPEC  EQU   DERPLIST+8                                               00730000
DERRETRY EQU   DERPLIST+12                                              00731000
DERDATD  EQU   DERPLIST+16                                              00732000
DERDASPN EQU   DERDATD                                                  00733000
DERDALNG EQU   DERDATD+1                                                00734000
DERRSRC  EQU   DERPLIST+20                                              00735000
DERRUB   EQU   DERPLIST+22                                              00736000
DERPFX   EQU   DERRUB                                                   00737000
DERRCODE EQU   DERRUB+2                                                 00738000
DERRDATA EQU   DERRUB+6                                                 00739000
DERRDDR  EQU   DERRUB+10                                                00740000
DERRSAVE EQU   DERRUB+14                                                00741000
DERGMSPL EQU   DERPLIST+40                                              00742000
ESTPARM  EQU   0                                                        00743000
ESTASCB  EQU   ESTPARM                                                  00744000
ESTADDR  EQU   ESTPARM+4                                                00745000
ESTAIARE EQU   0                                                        00746000
ESTPLIST EQU   ESTAIARE+72                                              00747000
I001C    EQU   0                                                        00748000
I008P    EQU   0                                                        00749000
I015F    EQU   0                                                        00750000
I015P    EQU   0                                                        00751000
I031F    EQU   0                                                        00752000
I031P    EQU   0                                                        00753000
I256C    EQU   0                                                        00754000
SSREQ    EQU   0                                                        00755000
SWAMGR   EQU   0                                                        00756000
FLC      EQU   PSA                                                      00757000
PSARSVTE EQU   PSARSVT                                                  00758000
ASXBPTR  EQU   ASCBASXB                                                 00759000
IOSBPTR  EQU   DDRUIOSB                                                 00760000
IOSATTSC EQU   IOSIPIB                                                  00761000
IOSWTOWA EQU   IOSIPIB                                                  00762000
IOSPCISC EQU   IOSIPIB                                                  00763000
EWAPTR   EQU   IOSERP                                                   00764000
EWADDIOS EQU   EWAIERP                                                  00765000
EWADAREA EQU   EWAIERP                                                  00766000
EWDASNS  EQU   EWADAREA                                                 00767000
EWDSNS0  EQU   EWDASNS                                                  00768000
EWDSNS1  EQU   EWDASNS+1                                                00769000
EWDMAM   EQU   EWDSNS1                                                  00770000
EWDSNS2  EQU   EWDASNS+2                                                00771000
EWDZLOG  EQU   EWDSNS2                                                  00772000
EWDWRPS  EQU   EWDZLOG                                                  00773000
EWD22    EQU   EWDSNS2                                                  00774000
EWDSNS10 EQU   EWDASNS+10                                               00775000
EWDSNS24 EQU   EWDASNS+24                                               00776000
EWDHOMAD EQU   EWADAREA+39                                              00777000
EWDHAFLG EQU   EWDHOMAD                                                 00778000
CVTPTR   EQU   FLCCVT                                                   00779000
CVTS01   EQU   CVTPGSIA                                                 00780000
CVTLPDIA EQU   CVTS01+12                                                00781000
CVTDIRST EQU   CVTLPDIA                                                 00782000
CVTSLIDA EQU   CVTS01+24                                                00783000
CVTCTLFG EQU   CVTS01+50                                                00784000
CVTRV210 EQU   CVTS01+424                                               00785000
CVTRV219 EQU   CVTS01+425                                               00786000
CVTRV228 EQU   CVTS01+426                                               00787000
CVTRV237 EQU   CVTS01+427                                               00788000
CVTMFRTR EQU   CVTS01+452                                               00789000
CVTRV262 EQU   CVTS01+468                                               00790000
CVTRV271 EQU   CVTS01+469                                               00791000
CVTRV280 EQU   CVTS01+470                                               00792000
CVTRV289 EQU   CVTS01+471                                               00793000
CVTGSDA  EQU   CVTS01+600                                               00794000
SSIBPTR  EQU   SSOBSSIB                                                 00795000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00796000
CVTRV628 EQU   CVTS01+728                                               00797000
CVTRV627 EQU   CVTS01+724                                               00798000
CVTRV626 EQU   CVTS01+720                                               00799000
CVTRV625 EQU   CVTS01+716                                               00800000
CVTRV624 EQU   CVTS01+712                                               00801000
CVTRV623 EQU   CVTS01+708                                               00802000
CVTRV622 EQU   CVTS01+704                                               00803000
CVTRV621 EQU   CVTS01+700                                               00804000
CVTRV620 EQU   CVTS01+696                                               00805000
CVTRV619 EQU   CVTS01+692                                               00806000
CVTRV618 EQU   CVTS01+688                                               00807000
CVTRV617 EQU   CVTS01+684                                               00808000
CVTRV616 EQU   CVTS01+680                                               00809000
CVTRV615 EQU   CVTS01+676                                               00810000
CVTRV614 EQU   CVTS01+672                                               00811000
CVTRV613 EQU   CVTS01+668                                               00812000
CVTRV612 EQU   CVTS01+664                                               00813000
CVTRV611 EQU   CVTS01+660                                               00814000
CVTRV610 EQU   CVTS01+656                                               00815000
CVTRV609 EQU   CVTS01+652                                               00816000
CVTRV608 EQU   CVTS01+648                                               00817000
CVTRV607 EQU   CVTS01+644                                               00818000
CVTRV606 EQU   CVTS01+640                                               00819000
CVTRV605 EQU   CVTS01+636                                               00820000
CVTRV604 EQU   CVTS01+632                                               00821000
CVTEFF02 EQU   CVTS01+628                                               00822000
CVTCBBR  EQU   CVTS01+624                                               00823000
CVTSSCR  EQU   CVTS01+620                                               00824000
CVTEVENT EQU   CVTS01+616                                               00825000
CVTCRCA  EQU   CVTS01+612                                               00826000
CVTTPIO  EQU   CVTS01+608                                               00827000
CVTADV   EQU   CVTS01+604                                               00828000
CVTGSDAB EQU   CVTGSDA                                                  00829000
CVTQV3   EQU   CVTS01+596                                               00830000
CVTQV2   EQU   CVTS01+592                                               00831000
CVTQV1   EQU   CVTS01+588                                               00832000
CVTRPT   EQU   CVTS01+584                                               00833000
CVTSSRB  EQU   CVTS01+580                                               00834000
CVTCSDRL EQU   CVTS01+576                                               00835000
CVTEXP1  EQU   CVTS01+572                                               00836000
CVTRMPMT EQU   CVTS01+568                                               00837000
CVTRMPTT EQU   CVTS01+564                                               00838000
CVTVPSA  EQU   CVTS01+560                                               00839000
CVTVSTOP EQU   CVTS01+556                                               00840000
CVTGTFR8 EQU   CVTS01+552                                               00841000
CVTQUIT  EQU   CVTS01+548                                               00842000
CVTVACR  EQU   CVTS01+544                                               00843000
CVTWTCB  EQU   CVTS01+540                                               00844000
CVTSTPRS EQU   CVTS01+536                                               00845000
CVT0PT02 EQU   CVTS01+532                                               00846000
CVTDARCM EQU   CVTS01+528                                               00847000
CVTIRECM EQU   CVTS01+524                                               00848000
CVTJRECM EQU   CVTS01+520                                               00849000
CVTVEMS0 EQU   CVTS01+516                                               00850000
CVTSPFRR EQU   CVTS01+512                                               00851000
CVTRLSTG EQU   CVTS01+508                                               00852000
CVT0TC0A EQU   CVTS01+504                                               00853000
CVTGMBR  EQU   CVTS01+500                                               00854000
CVTLFRM  EQU   CVTS01+496                                               00855000
CVTRMBR  EQU   CVTS01+492                                               00856000
CVTVIOP  EQU   CVTS01+488                                               00857000
CVTRV307 EQU   CVTS01+486                                               00858000
CVTRV306 EQU   CVTS01+484                                               00859000
CVTRV305 EQU   CVTS01+482                                               00860000
CVTRV304 EQU   CVTS01+480                                               00861000
CVTRV303 EQU   CVTS01+478                                               00862000
CVTRV302 EQU   CVTS01+476                                               00863000
CVTTRCA  EQU   CVTS01+472                                               00864000
CVTRV297 EQU   CVTRV289                                                 00865000
CVTRV296 EQU   CVTRV289                                                 00866000
CVTRV295 EQU   CVTRV289                                                 00867000
CVTRV294 EQU   CVTRV289                                                 00868000
CVTRV293 EQU   CVTRV289                                                 00869000
CVTRV292 EQU   CVTRV289                                                 00870000
CVTRV291 EQU   CVTRV289                                                 00871000
CVTRV290 EQU   CVTRV289                                                 00872000
CVTRV288 EQU   CVTRV280                                                 00873000
CVTRV287 EQU   CVTRV280                                                 00874000
CVTRV286 EQU   CVTRV280                                                 00875000
CVTRV285 EQU   CVTRV280                                                 00876000
CVTRV284 EQU   CVTRV280                                                 00877000
CVTRV283 EQU   CVTRV280                                                 00878000
CVTRV282 EQU   CVTRV280                                                 00879000
CVTRV281 EQU   CVTRV280                                                 00880000
CVTRV279 EQU   CVTRV271                                                 00881000
CVTRV278 EQU   CVTRV271                                                 00882000
CVTRV277 EQU   CVTRV271                                                 00883000
CVTRV276 EQU   CVTRV271                                                 00884000
CVTRV275 EQU   CVTRV271                                                 00885000
CVTRV274 EQU   CVTRV271                                                 00886000
CVTRV273 EQU   CVTRV271                                                 00887000
CVTRV272 EQU   CVTRV271                                                 00888000
CVTRV270 EQU   CVTRV262                                                 00889000
CVTRV269 EQU   CVTRV262                                                 00890000
CVTRV268 EQU   CVTRV262                                                 00891000
CVTRV267 EQU   CVTRV262                                                 00892000
CVTRV266 EQU   CVTRV262                                                 00893000
CVTRV265 EQU   CVTRV262                                                 00894000
CVTRV264 EQU   CVTRV262                                                 00895000
CVTRV263 EQU   CVTRV262                                                 00896000
CVTVFP   EQU   CVTS01+464                                               00897000
CVTVSI   EQU   CVTS01+460                                               00898000
CVTVPSIB EQU   CVTS01+456                                               00899000
CVTMFACT EQU   CVTMFRTR                                                 00900000
CVTMFCTL EQU   CVTS01+448                                               00901000
CVTPVBP  EQU   CVTS01+444                                               00902000
CVTPWI   EQU   CVTS01+440                                               00903000
CVTRV254 EQU   CVTS01+438                                               00904000
CVTRV253 EQU   CVTS01+436                                               00905000
CVTRV252 EQU   CVTS01+434                                               00906000
CVTRV251 EQU   CVTS01+433                                               00907000
CVTRV250 EQU   CVTS01+432                                               00908000
CVTRV249 EQU   CVTS01+431                                               00909000
CVTRV248 EQU   CVTS01+430                                               00910000
CVTRV247 EQU   CVTS01+429                                               00911000
CVTRV246 EQU   CVTS01+428                                               00912000
CVTRV245 EQU   CVTRV237                                                 00913000
CVTRV244 EQU   CVTRV237                                                 00914000
CVTRV243 EQU   CVTRV237                                                 00915000
CVTRV242 EQU   CVTRV237                                                 00916000
CVTRV241 EQU   CVTRV237                                                 00917000
CVTRV240 EQU   CVTRV237                                                 00918000
CVTRV239 EQU   CVTRV237                                                 00919000
CVTRV238 EQU   CVTRV237                                                 00920000
CVTRV236 EQU   CVTRV228                                                 00921000
CVTRV235 EQU   CVTRV228                                                 00922000
CVTRV234 EQU   CVTRV228                                                 00923000
CVTRV233 EQU   CVTRV228                                                 00924000
CVTRV232 EQU   CVTRV228                                                 00925000
CVTRV231 EQU   CVTRV228                                                 00926000
CVTRV230 EQU   CVTRV228                                                 00927000
CVTRV229 EQU   CVTRV228                                                 00928000
CVTRV227 EQU   CVTRV219                                                 00929000
CVTRV226 EQU   CVTRV219                                                 00930000
CVTRV225 EQU   CVTRV219                                                 00931000
CVTRV224 EQU   CVTRV219                                                 00932000
CVTRV223 EQU   CVTRV219                                                 00933000
CVTRV222 EQU   CVTRV219                                                 00934000
CVTRV221 EQU   CVTRV219                                                 00935000
CVTRV220 EQU   CVTRV219                                                 00936000
CVTRV218 EQU   CVTRV210                                                 00937000
CVTRV217 EQU   CVTRV210                                                 00938000
CVTRV216 EQU   CVTRV210                                                 00939000
CVTRV215 EQU   CVTRV210                                                 00940000
CVTRV214 EQU   CVTRV210                                                 00941000
CVTRV213 EQU   CVTRV210                                                 00942000
CVTRV212 EQU   CVTRV210                                                 00943000
CVTRV211 EQU   CVTRV210                                                 00944000
CVTLCCAT EQU   CVTS01+420                                               00945000
CVTPCCAT EQU   CVTS01+416                                               00946000
CVTIPCRP EQU   CVTS01+412                                               00947000
CVTIPCRI EQU   CVTS01+408                                               00948000
CVTIPCDS EQU   CVTS01+404                                               00949000
CVTAIDVT EQU   CVTS01+400                                               00950000
CVTSSAP  EQU   CVTS01+396                                               00951000
CVTEHCIR EQU   CVTS01+392                                               00952000
CVTEHDEF EQU   CVTS01+388                                               00953000
CVTDAIR  EQU   CVTS01+384                                               00954000
CVTPERFM EQU   CVTS01+380                                               00955000
CVT044R2 EQU   CVTS01+376                                               00956000
CVTFETCH EQU   CVTS01+372                                               00957000
CVTRSTWD EQU   CVTS01+368                                               00958000
CVTSPOST EQU   CVTS01+364                                               00959000
CVTIOBP  EQU   CVTS01+360                                               00960000
CVTASMVT EQU   CVTS01+356                                               00961000
CVTRECRQ EQU   CVTS01+352                                               00962000
CVTWSAC  EQU   CVTS01+348                                               00963000
CVTRV149 EQU   CVTS01+344                                               00964000
CVTWSAL  EQU   CVTS01+340                                               00965000
CVTSPSA  EQU   CVTS01+336                                               00966000
CVTGLMN  EQU   CVTS01+332                                               00967000
CVTVEAC0 EQU   CVTS01+328                                               00968000
CVT062R1 EQU   CVTS01+324                                               00969000
CVTRPOST EQU   CVTS01+320                                               00970000
CVTDQIQE EQU   CVTS01+316                                               00971000
CVTCSD   EQU   CVTS01+312                                               00972000
CVTLKRMA EQU   CVTS01+308                                               00973000
CVTRSPIE EQU   CVTS01+304                                               00974000
CVTRENQ  EQU   CVTS01+300                                               00975000
CVTLQCB  EQU   CVTS01+296                                               00976000
CVTFQCB  EQU   CVTS01+292                                               00977000
CVTQCS01 EQU   CVTS01+288                                               00978000
CVTAPFT  EQU   CVTS01+284                                               00979000
CVTPARRL EQU   CVTS01+280                                               00980000
CVTVWAIT EQU   CVTS01+276                                               00981000
CVTGSPL  EQU   CVTS01+272                                               00982000
CVTLSMQ  EQU   CVTS01+268                                               00983000
CVTGSMQ  EQU   CVTS01+264                                               00984000
CVTEXPRO EQU   CVTS01+260                                               00985000
CVTOPCTP EQU   CVTS01+256                                               00986000
CVTSIC   EQU   CVTS01+252                                               00987000
CVTTPIOS EQU   CVTS01+248                                               00988000
CVTRTMS  EQU   CVTS01+244                                               00989000
CVTSDBF  EQU   CVTS01+240                                               00990000
CVTSCBP  EQU   CVTS01+236                                               00991000
CVTSDMP  EQU   CVTS01+232                                               00992000
CVTSV60  EQU   CVTS01+228                                               00993000
CVTRTMCT EQU   CVTS01+224                                               00994000
CVTASCBL EQU   CVTS01+220                                               00995000
CVTASCBH EQU   CVTS01+216                                               00996000
CVTGDA   EQU   CVTS01+212                                               00997000
CVTASVT  EQU   CVTS01+208                                               00998000
CVTVVMDI EQU   CVTS01+204                                               00999000
CVTAQTOP EQU   CVTS01+200                                               01000000
CVTIOSCS EQU   CVTS01+196                                               01001000
CVTSDRM  EQU   CVTS01+192                                               01002000
CVTOPTE  EQU   CVTS01+188                                               01003000
CVTSTXU  EQU   CVTS01+184                                               01004000
CVTQUIS  EQU   CVTS01+180                                               01005000
CVTPARS  EQU   CVTS01+176                                               01006000
CVTS1EE  EQU   CVTS01+172                                               01007000
CVTFRAS  EQU   CVTS01+168                                               01008000
CVTQSAS  EQU   CVTS01+164                                               01009000
CVTCRAS  EQU   CVTS01+160                                               01010000
CVTCRMN  EQU   CVTS01+156                                               01011000
CVTDELCP EQU   CVTS01+152                                               01012000
CVTFRECL EQU   CVTS01+148                                               01013000
CVTGETCL EQU   CVTS01+144                                               01014000
CVTBLDCP EQU   CVTS01+140                                               01015000
CVTAUTHL EQU   CVTS01+136                                               01016000
CVTSCAN  EQU   CVTS01+132                                               01017000
CVTRV144 EQU   CVTS01+130                                               01018000
CVTMAXMP EQU   CVTS01+128                                               01019000
CVTSTCK  EQU   CVTS01+124                                               01020000
CVTRV139 EQU   CVTS01+123                                               01021000
CVTDSSAC EQU   CVTS01+122                                               01022000
CVTRV513 EQU   CVTS01+121                                               01023000
CVTIOSPL EQU   CVTS01+120                                               01024000
CVTPTGT  EQU   CVTS01+116                                               01025000
CVTCSPIE EQU   CVTS01+112                                               01026000
CVTSMFEX EQU   CVTS01+108                                               01027000
CVTOLT0A EQU   CVTS01+104                                               01028000
CVTSRBRT EQU   CVTS01+100                                               01029000
CVTPUTL  EQU   CVTS01+96                                                01030000
CVTRV519 EQU   CVTS01+92                                                01031000
CVTRV327 EQU   CVTS01+88                                                01032000
CVTRV326 EQU   CVTS01+84                                                01033000
CVTRV325 EQU   CVTS01+80                                                01034000
CVTRV324 EQU   CVTS01+76                                                01035000
CVT0VL01 EQU   CVTS01+72                                                01036000
CVTSHRVM EQU   CVTS01+68                                                01037000
CVTRV332 EQU   CVTS01+64                                                01038000
CVTTAS   EQU   CVTS01+60                                                01039000
CVTRSCN  EQU   CVTS01+56                                                01040000
CVTTRAC2 EQU   CVTS01+54                                                01041000
CVTTRACE EQU   CVTS01+52                                                01042000
CVTAPG   EQU   CVTS01+51                                                01043000
CVTSDTRC EQU   CVTCTLFG                                                 01044000
CVTGTRCE EQU   CVTCTLFG                                                 01045000
CVTNOMP  EQU   CVTCTLFG                                                 01046000
CVTRSV79 EQU   CVTCTLFG                                                 01047000
CVTDSTAT EQU   CVTCTLFG                                                 01048000
CVTRSV78 EQU   CVTCTLFG                                                 01049000
CVTRV333 EQU   CVTCTLFG                                                 01050000
CVTRV323 EQU   CVTCTLFG                                                 01051000
CVTSPVLK EQU   CVTS01+49                                                01052000
CVTRSV77 EQU   CVTS01+48                                                01053000
CVTRV331 EQU   CVTS01+44                                                01054000
CVTRV330 EQU   CVTS01+40                                                01055000
CVTRV329 EQU   CVTS01+36                                                01056000
CVTRV328 EQU   CVTS01+32                                                01057000
CVTRV322 EQU   CVTS01+28                                                01058000
CVTSLID  EQU   CVTSLIDA+1                                               01059000
CVTSYLK  EQU   CVTSLIDA                                                 01060000
CVTRV321 EQU   CVTS01+20                                                01061000
CVTRV320 EQU   CVTS01+16                                                01062000
CVTLPDIR EQU   CVTLPDIA+1                                               01063000
CVTRSV69 EQU   CVTDIRST                                                 01064000
CVTRSV68 EQU   CVTDIRST                                                 01065000
CVTRSV67 EQU   CVTDIRST                                                 01066000
CVTRSV66 EQU   CVTDIRST                                                 01067000
CVTRSV65 EQU   CVTDIRST                                                 01068000
CVTRSV64 EQU   CVTDIRST                                                 01069000
CVTRSV63 EQU   CVTDIRST                                                 01070000
CVTDICOM EQU   CVTDIRST                                                 01071000
CVTPVTP  EQU   CVTS01+8                                                 01072000
CVTLPDSR EQU   CVTS01+4                                                 01073000
CVTGETL  EQU   CVTS01                                                   01074000
EWDEND   EQU   EWADAREA+128                                             01075000
EWDCCWA  EQU   EWADAREA+120                                             01076000
EWDCCW9  EQU   EWADAREA+112                                             01077000
EWDCCW8  EQU   EWADAREA+104                                             01078000
EWDCCW7  EQU   EWADAREA+96                                              01079000
EWDCCW6  EQU   EWADAREA+88                                              01080000
EWDCCW5  EQU   EWADAREA+80                                              01081000
EWDCCW4  EQU   EWADAREA+72                                              01082000
EWDCCW3  EQU   EWADAREA+64                                              01083000
EWDCCW2  EQU   EWADAREA+56                                              01084000
EWDCCW1  EQU   EWADAREA+48                                              01085000
EWDDISP  EQU   EWADAREA+45                                              01086000
EWDHARNO EQU   EWDHOMAD+5                                               01087000
EWDCCHH  EQU   EWDHOMAD+1                                               01088000
EWDHAALT EQU   EWDHAFLG                                                 01089000
EWDHADEF EQU   EWDHAFLG                                                 01090000
EWDHA5   EQU   EWDHAFLG                                                 01091000
EWDHA4   EQU   EWDHAFLG                                                 01092000
EWDHA3   EQU   EWDHAFLG                                                 01093000
EWDHA2   EQU   EWDHAFLG                                                 01094000
EWDHA1   EQU   EWDHAFLG                                                 01095000
EWDHA0   EQU   EWDHAFLG                                                 01096000
EWDSAVC  EQU   EWADAREA+32                                              01097000
EWDSAVS  EQU   EWADAREA+30                                              01098000
EWDSAVOP EQU   EWADAREA+29                                              01099000
EWDSAVKY EQU   EWADAREA+28                                              01100000
EWDSNS27 EQU   EWDASNS+27                                               01101000
EWDSNS26 EQU   EWDASNS+26                                               01102000
EWDSNS25 EQU   EWDASNS+25                                               01103000
EWDRZRO  EQU   EWDSNS24                                                 01104000
EWDSNS23 EQU   EWDASNS+23                                               01105000
EWDSNS22 EQU   EWDASNS+22                                               01106000
EWDSNS21 EQU   EWDASNS+21                                               01107000
EWDSNS20 EQU   EWDASNS+20                                               01108000
EWDSNS19 EQU   EWDASNS+19                                               01109000
EWDSNS18 EQU   EWDASNS+18                                               01110000
EWDSNS17 EQU   EWDASNS+17                                               01111000
EWDSNS16 EQU   EWDASNS+16                                               01112000
EWDSNS15 EQU   EWDASNS+15                                               01113000
EWDSNS14 EQU   EWDASNS+14                                               01114000
EWDSNS13 EQU   EWDASNS+13                                               01115000
EWDSNS12 EQU   EWDASNS+12                                               01116000
EWDSNS11 EQU   EWDASNS+11                                               01117000
EWD107   EQU   EWDSNS10                                                 01118000
EWD106   EQU   EWDSNS10                                                 01119000
EWD105   EQU   EWDSNS10                                                 01120000
EWD104   EQU   EWDSNS10                                                 01121000
EWDSTAT  EQU   EWDSNS10                                                 01122000
EWD100   EQU   EWDSNS10                                                 01123000
EWDSNS9  EQU   EWDASNS+9                                                01124000
EWDSNS8  EQU   EWDASNS+8                                                01125000
EWDSNS7  EQU   EWDASNS+7                                                01126000
EWDSNS6  EQU   EWDASNS+6                                                01127000
EWDSNS5  EQU   EWDASNS+5                                                01128000
EWDSNS4  EQU   EWDASNS+4                                                01129000
EWDSNS3  EQU   EWDASNS+3                                                01130000
EWD27    EQU   EWDSNS2                                                  01131000
EWD26    EQU   EWDSNS2                                                  01132000
EWD25    EQU   EWDSNS2                                                  01133000
EWD24    EQU   EWDSNS2                                                  01134000
EWDEDAT  EQU   EWDSNS2                                                  01135000
EWDMDA2  EQU   EWD22                                                    01136000
EWDCORR  EQU   EWDSNS2                                                  01137000
EWDMDA1  EQU   EWDWRPS                                                  01138000
EWDOFLO  EQU   EWDSNS1                                                  01139000
EWDINHI  EQU   EWDMAM                                                   01140000
EWDFP    EQU   EWDSNS1                                                  01141000
EWDNRF   EQU   EWDSNS1                                                  01142000
EWD13    EQU   EWDSNS1                                                  01143000
EWDEOC   EQU   EWDSNS1                                                  01144000
EWDTVRN  EQU   EWDSNS1                                                  01145000
EWDPERM  EQU   EWDSNS1                                                  01146000
EWDSKCK  EQU   EWDSNS0                                                  01147000
EWDTCC   EQU   EWDSNS0                                                  01148000
EWDOVRN  EQU   EWDSNS0                                                  01149000
EWDDATA  EQU   EWDSNS0                                                  01150000
EWDEQU   EQU   EWDSNS0                                                  01151000
EWDBUSO  EQU   EWDSNS0                                                  01152000
EWDINT   EQU   EWDSNS0                                                  01153000
EWDCREJ  EQU   EWDSNS0                                                  01154000
EWAEND   EQU   EWADDIOS+71                                              01155000
EWASCSW  EQU   EWADDIOS+64                                              01156000
EWASNS   EQU   EWADDIOS                                                 01157000
IOSPCIWA EQU   IOSPCISC+44                                              01158000
IOSPCIRS EQU   IOSPCISC+8                                               01159000
@NM00031 EQU   IOSPCISC+4                                               01160000
@NM00030 EQU   IOSPCISC                                                 01161000
IOSWRNDR EQU   IOSWTOWA+4                                               01162000
IOSWTOPT EQU   IOSWTOWA+3                                               01163000
IOSWTOCP EQU   IOSWTOWA+2                                               01164000
IOSWTOCH EQU   IOSWTOWA                                                 01165000
IOSATTWA EQU   IOSATTSC+40                                              01166000
@NM00029 EQU   IOSATTSC+24                                              01167000
IOSATTSN EQU   IOSATTSC                                                 01168000
PSARSAV  EQU   PSARSVTE+60                                              01169000
PSARSTK  EQU   PSARSVTE+56                                              01170000
PSAESAV3 EQU   PSARSVTE+52                                              01171000
PSAESTK3 EQU   PSARSVTE+48                                              01172000
PSAESAV2 EQU   PSARSVTE+44                                              01173000
PSAESTK2 EQU   PSARSVTE+40                                              01174000
PSAESAV1 EQU   PSARSVTE+36                                              01175000
PSAESTK1 EQU   PSARSVTE+32                                              01176000
PSAPSAV  EQU   PSARSVTE+28                                              01177000
PSAPSTK  EQU   PSARSVTE+24                                              01178000
PSAMSAV  EQU   PSARSVTE+20                                              01179000
PSAMSTK  EQU   PSARSVTE+16                                              01180000
PSASSAV  EQU   PSARSVTE+12                                              01181000
PSASSTK  EQU   PSARSVTE+8                                               01182000
PSANSTK  EQU   PSARSVTE+4                                               01183000
PSACSTK  EQU   PSARSVTE                                                 01184000
WORKAREA EQU   ESTAIARE                                                 01185000
DERGMADR EQU   DERPLIST+44                                              01186000
DERGMLNG EQU   DERGMSPL+1                                               01187000
DERGMSPN EQU   DERGMSPL                                                 01188000
DERLRC   EQU   DERPLIST+21                                              01189000
@NM00056 EQU   DERRSRC                                                  01190000
DERDISK  EQU   DERRSRC                                                  01191000
DERUREC  EQU   DERRSRC                                                  01192000
DERTAPE  EQU   DERRSRC                                                  01193000
@NM00055 EQU   DERPLIST+2                                               01194000
@NM00054 EQU   DERSWCHS                                                 01195000
DERESTAE EQU   DERSWCHS                                                 01196000
DERECALL EQU   DERSWCHS                                                 01197000
DERPERK  EQU   DERSWCHS                                                 01198000
DERCRASH EQU   DERSWCHS                                                 01199000
SSDRUCBL EQU   SSDR+12                                                  01200000
SSDRSTOU EQU   SSDR+8                                                   01201000
SSDRSFRU EQU   SSDR+4                                                   01202000
SSDR4SWP EQU   SSDRFLG2                                                 01203000
@NM00053 EQU   SSDRFLG2                                                 01204000
SSDRFLG1 EQU   SSDR+2                                                   01205000
SSOBRETN EQU   SSOB+12                                                  01206000
SSOBFUNC EQU   SSOB+6                                                   01207000
SSIBSUSE EQU   SSIB+32                                                  01208000
SSIBRSV1 EQU   SSIB+28                                                  01209000
SSIBDEST EQU   SSIB+20                                                  01210000
SSIBJBID EQU   SSIB+12                                                  01211000
SSIBRESV EQU   SSIB+7                                                   01212000
@NM00052 EQU   SSIBFLG1                                                 01213000
SSIBPJES EQU   SSIBFLG1                                                 01214000
JESSSCT  EQU   JESCT+24                                                 01215000
JESRESQM EQU   JESCT+16                                                 01216000
JESQMGR  EQU   JESCT+12                                                 01217000
JESUNITS EQU   JESCT+4                                                  01218000
@NM00051 EQU   JESCT                                                    01219000
CVTLEVL  EQU   CVTRELNO+2                                               01220000
CVTNUMB  EQU   CVTRELNO                                                 01221000
CVTMDL   EQU   CVTFIX+250                                               01222000
@NM00050 EQU   CVTFIX+248                                               01223000
@NM00049 EQU   CVTFIX                                                   01224000
CVTRV482 EQU   CVTXTNT2+128                                             01225000
CVTRV481 EQU   CVTXTNT2+124                                             01226000
CVTRV480 EQU   CVTXTNT2+120                                             01227000
CVTRV479 EQU   CVTXTNT2+118                                             01228000
CVTRV478 EQU   CVTXTNT2+117                                             01229000
CVTRV477 EQU   CVTXTNT2+116                                             01230000
CVTRV476 EQU   CVTXTNT2+115                                             01231000
CVTRV475 EQU   CVTXTNT2+114                                             01232000
CVTRV474 EQU   CVTRV466                                                 01233000
CVTRV473 EQU   CVTRV466                                                 01234000
CVTRV472 EQU   CVTRV466                                                 01235000
CVTRV471 EQU   CVTRV466                                                 01236000
CVTRV470 EQU   CVTRV466                                                 01237000
CVTRV469 EQU   CVTRV466                                                 01238000
CVTRV468 EQU   CVTRV466                                                 01239000
CVTRV467 EQU   CVTRV466                                                 01240000
CVTRV465 EQU   CVTRV457                                                 01241000
CVTRV464 EQU   CVTRV457                                                 01242000
CVTRV463 EQU   CVTRV457                                                 01243000
CVTRV462 EQU   CVTRV457                                                 01244000
CVTRV461 EQU   CVTRV457                                                 01245000
CVTRV460 EQU   CVTRV457                                                 01246000
CVTRV459 EQU   CVTRV457                                                 01247000
CVTRV458 EQU   CVTRV457                                                 01248000
CVTRV456 EQU   CVTXTNT2+108                                             01249000
CVTRV455 EQU   CVTXTNT2+104                                             01250000
CVTRV454 EQU   CVTXTNT2+100                                             01251000
CVTRV453 EQU   CVTXTNT2+96                                              01252000
CVTRV452 EQU   CVTXTNT2+94                                              01253000
CVTRV451 EQU   CVTXTNT2+92                                              01254000
CVTRV450 EQU   CVTXTNT2+90                                              01255000
CVTRV449 EQU   CVTXTNT2+88                                              01256000
CVTRV448 EQU   CVTXTNT2+87                                              01257000
CVTRV447 EQU   CVTXTNT2+86                                              01258000
CVTRV446 EQU   CVTRV438                                                 01259000
CVTRV445 EQU   CVTRV438                                                 01260000
CVTRV444 EQU   CVTRV438                                                 01261000
CVTRV443 EQU   CVTRV438                                                 01262000
CVTRV442 EQU   CVTRV438                                                 01263000
CVTRV441 EQU   CVTRV438                                                 01264000
CVTRV440 EQU   CVTRV438                                                 01265000
CVTRV439 EQU   CVTRV438                                                 01266000
CVTRV437 EQU   CVTRV429                                                 01267000
CVTRV436 EQU   CVTRV429                                                 01268000
CVTRV435 EQU   CVTRV429                                                 01269000
CVTRV434 EQU   CVTRV429                                                 01270000
CVTRV433 EQU   CVTRV429                                                 01271000
CVTRV432 EQU   CVTRV429                                                 01272000
CVTRV431 EQU   CVTRV429                                                 01273000
CVTRV430 EQU   CVTRV429                                                 01274000
CVTRV428 EQU   CVTXTNT2+80                                              01275000
CVTRV427 EQU   CVTXTNT2+76                                              01276000
CVTRV426 EQU   CVTXTNT2+72                                              01277000
CVTRV425 EQU   CVTXTNT2+68                                              01278000
CVTATACT EQU   CVTATCVT                                                 01279000
CVTRV423 EQU   CVTXTNT2+62                                              01280000
CVTRV422 EQU   CVTXTNT2+60                                              01281000
CVTRV421 EQU   CVTXTNT2+58                                              01282000
CVTRV420 EQU   CVTXTNT2+56                                              01283000
CVTRV419 EQU   CVTXTNT2+55                                              01284000
CVTRV418 EQU   CVTXTNT2+54                                              01285000
CVTRV417 EQU   CVTRV409                                                 01286000
CVTRV416 EQU   CVTRV409                                                 01287000
CVTRV415 EQU   CVTRV409                                                 01288000
CVTRV414 EQU   CVTRV409                                                 01289000
CVTRV413 EQU   CVTRV409                                                 01290000
CVTRV412 EQU   CVTRV409                                                 01291000
CVTRV411 EQU   CVTRV409                                                 01292000
CVTRV410 EQU   CVTRV409                                                 01293000
CVTRV408 EQU   CVTRV400                                                 01294000
CVTRV407 EQU   CVTRV400                                                 01295000
CVTRV406 EQU   CVTRV400                                                 01296000
CVTRV405 EQU   CVTRV400                                                 01297000
CVTRV404 EQU   CVTRV400                                                 01298000
CVTRV403 EQU   CVTRV400                                                 01299000
CVTRV402 EQU   CVTRV400                                                 01300000
CVTRV401 EQU   CVTRV400                                                 01301000
CVTICB   EQU   CVTXTNT2+48                                              01302000
CVTSKTA  EQU   CVTXTNT2+44                                              01303000
CVTRSV99 EQU   CVTXTNT2+40                                              01304000
CVTRSV98 EQU   CVTXTNT2+36                                              01305000
CVTRSV97 EQU   CVTXTNT2+34                                              01306000
CVTRSV96 EQU   CVTXTNT2+32                                              01307000
CVTOLTEP EQU   CVTXTNT2+28                                              01308000
CVTQIDA  EQU   CVTQID+1                                                 01309000
CVTRSV95 EQU   CVTQID                                                   01310000
CVTRSV94 EQU   CVTXTNT2+20                                              01311000
CVTRSV93 EQU   CVTXTNT2+16                                              01312000
CVTRSV92 EQU   CVTXTNT2+12                                              01313000
CVTDEBVR EQU   CVTXTNT2+8                                               01314000
CVTRSV91 EQU   CVTXTNT2+6                                               01315000
CVTRSV9H EQU   CVTFLGBT                                                 01316000
CVTRSV9G EQU   CVTFLGBT                                                 01317000
CVTRSV9F EQU   CVTFLGBT                                                 01318000
CVTRSV9E EQU   CVTFLGBT                                                 01319000
CVTRSV9D EQU   CVTFLGBT                                                 01320000
CVTRSV9C EQU   CVTFLGBT                                                 01321000
CVTVME   EQU   CVTFLGBT                                                 01322000
CVTNPE   EQU   CVTFLGBT                                                 01323000
CVTNUCLS EQU   CVTXTNT2+4                                               01324000
CVTDSSVA EQU   CVTDSSV+1                                                01325000
CVTRSV89 EQU   CVTDSSV                                                  01326000
CVTRSV88 EQU   CVTXTNT1+8                                               01327000
CVTRSV87 EQU   CVTXTNT1+4                                               01328000
CVTFACHN EQU   CVTXTNT1                                                 01329000
CVTRV488 EQU   CVTMAP+412                                               01330000
CVTRV487 EQU   CVTMAP+408                                               01331000
CVTRV486 EQU   CVTMAP+404                                               01332000
CVTRV485 EQU   CVTMAP+400                                               01333000
CVTACTAP EQU   CVTMAP+396                                               01334000
CVTAUTH  EQU   CVTMAP+392                                               01335000
CVTATMCA EQU   CVTATMCT+1                                               01336000
CVTATMST EQU   CVTATMCT                                                 01337000
CVTRSV61 EQU   CVTMAP+384                                               01338000
CVTVOLT1 EQU   CVTVOLM1+1                                               01339000
CVTVOLI1 EQU   CVTVOLF1                                                 01340000
CVTSTOA  EQU   CVTMAP+376                                               01341000
CVTRSV58 EQU   CVTMAP+374                                               01342000
CVTRSV57 EQU   CVTMAP+372                                               01343000
CVTDDCE  EQU   CVTMAP+368                                               01344000
CVTPNWFR EQU   CVTMAP+364                                               01345000
CVTSMF   EQU   CVTMAP+360                                               01346000
CVTSULK  EQU   CVTMAP+358                                               01347000
CVTSLKO  EQU   CVTSYSK                                                  01348000
CVTSLKP  EQU   CVTSYSK                                                  01349000
CVTSLKQ  EQU   CVTSYSK                                                  01350000
CVTSLKR  EQU   CVTSYSK                                                  01351000
CVTRSV56 EQU   CVTSYSK                                                  01352000
CVTRSV55 EQU   CVTSYSK                                                  01353000
CVTRSV54 EQU   CVTSYSK                                                  01354000
CVTRSV53 EQU   CVTSYSK                                                  01355000
CVTRSV52 EQU   CVTA1F1                                                  01356000
CVTRSV51 EQU   CVTA1F1                                                  01357000
CVTRSV50 EQU   CVTA1F1                                                  01358000
CVTRSV49 EQU   CVTA1F1                                                  01359000
CVTRSV48 EQU   CVTA1F1                                                  01360000
CVTRSV47 EQU   CVTA1F1                                                  01361000
CVTSRSW  EQU   CVTA1F1                                                  01362000
CVTPFSW  EQU   CVTA1F1                                                  01363000
CVTPCVT  EQU   CVTMAP+352                                               01364000
CVTRSV46 EQU   CVTMAP+344                                               01365000
CVTRSV45 EQU   CVTMAP+340                                               01366000
CVTRSV44 EQU   CVTMAP+338                                               01367000
CVTRSV43 EQU   CVTMAP+336                                               01368000
CVTHJESA EQU   CVTHJES+1                                                01369000
CVTRSV42 EQU   CVTHJES                                                  01370000
CVTEXT2A EQU   CVTEXT2+1                                                01371000
CVTRSV41 EQU   CVTEXT2                                                  01372000
CVTAPFA  EQU   CVTAPF+1                                                 01373000
CVTRSV40 EQU   CVTAPF                                                   01374000
CVTRV518 EQU   CVTINTLA                                                 01375000
CVTRV517 EQU   CVTERPV                                                  01376000
CVTEORM  EQU   CVTMAP+312                                               01377000
CVTMCHPR EQU   CVTMAP+308                                               01378000
CVTTZ    EQU   CVTMAP+304                                               01379000
CVTJEPS  EQU   CVTMAP+300                                               01380000
CVTMODE  EQU   CVTMAP+292                                               01381000
CVTPTRV  EQU   CVTMAP+288                                               01382000
CVTREAL  EQU   CVTMAP+284                                               01383000
CVTRSV39 EQU   CVTMAP+280                                               01384000
CVTRSV38 EQU   CVTMAP+276                                               01385000
CVTDMSRA EQU   CVTDMSR+1                                                01386000
CVTRSV37 EQU   CVTDMSR                                                  01387000
CVTQMSGA EQU   CVTQMSG+1                                                01388000
CVTRSV36 EQU   CVTQMSG                                                  01389000
CVTAMFF  EQU   CVTMAP+264                                               01390000
CVTPURGA EQU   CVTPURG+1                                                01391000
CVTRSV35 EQU   CVTPURG                                                  01392000
CVTCBSP  EQU   CVTMAP+256                                               01393000
CVTATERA EQU   CVTATER+1                                                01394000
CVTSYST  EQU   CVTATER                                                  01395000
CVTVOLT2 EQU   CVTTAT                                                   01396000
CVTVOLI2 EQU   CVTVOLF2                                                 01397000
CVTAQAVB EQU   CVTAQAVT+1                                               01398000
CVTRSV34 EQU   CVTTCMFG                                                 01399000
CVTRSV33 EQU   CVTTCMFG                                                 01400000
CVTRSV32 EQU   CVTTCMFG                                                 01401000
CVTRSV31 EQU   CVTTCMFG                                                 01402000
CVTRSV30 EQU   CVTTCMFG                                                 01403000
CVTRSV29 EQU   CVTTCMFG                                                 01404000
CVTRSV28 EQU   CVTTCMFG                                                 01405000
CVTTCRDY EQU   CVTTCMFG                                                 01406000
CVTGTFA  EQU   CVTGTF+1                                                 01407000
CVTRSV27 EQU   CVTGTFST                                                 01408000
CVTRNIO  EQU   CVTGTFST                                                 01409000
CVTUSR   EQU   CVTGTFST                                                 01410000
CVTRV318 EQU   CVTFORM                                                  01411000
CVTRV317 EQU   CVTTMODE                                                 01412000
CVTRV316 EQU   CVTSTATE                                                 01413000
CVTRV315 EQU   CVTGTFS                                                  01414000
CVTGTFAV EQU   CVTGTFS                                                  01415000
CVT0SCR1 EQU   CVTMAP+232                                               01416000
CVTRV515 EQU   CVTMAP+228                                               01417000
CVTRMS   EQU   CVTMAP+224                                               01418000
CVTPATCH EQU   CVTMAP+220                                               01419000
CVTTSCE  EQU   CVTMAP+216                                               01420000
CVTLNKSC EQU   CVTMAP+214                                               01421000
CVTQABST EQU   CVTMAP+212                                               01422000
CVTMDLDS EQU   CVTMAP+208                                               01423000
CVTUSER  EQU   CVTMAP+204                                               01424000
CVTABEND EQU   CVTMAP+200                                               01425000
CVTSMCA  EQU   CVTMAP+196                                               01426000
CVTRSV18 EQU   CVTMAP+192                                               01427000
CVTQLPAQ EQU   CVTMAP+188                                               01428000
CVTQCDSR EQU   CVTMAP+184                                               01429000
CVTRSV17 EQU   CVTOPTB                                                  01430000
CVTRSV16 EQU   CVTOPTB                                                  01431000
CVTFP    EQU   CVTOPTB                                                  01432000
CVTAPTHR EQU   CVTOPTB                                                  01433000
CVTNLOG  EQU   CVTOPTB                                                  01434000
CVTTOD   EQU   CVTOPTB                                                  01435000
CVTCTIMS EQU   CVTOPTB                                                  01436000
CVTPROT  EQU   CVTOPTB                                                  01437000
CVTXPFP  EQU   CVTOPTA                                                  01438000
CVTASCII EQU   CVTOPTA                                                  01439000
CVTRSV13 EQU   CVTOPTA                                                  01440000
CVTRSV12 EQU   CVTOPTA                                                  01441000
CVTNIP   EQU   CVTOPTA                                                  01442000
CVTDDR   EQU   CVTOPTA                                                  01443000
CVTAPR   EQU   CVTOPTA                                                  01444000
CVTCCH   EQU   CVTOPTA                                                  01445000
CVTSNCTR EQU   CVTMAP+180                                               01446000
CVTQMWR  EQU   CVTMAP+176                                               01447000
CVTQOCR  EQU   CVTMAP+172                                               01448000
CVT1EF00 EQU   CVTMAP+168                                               01449000
CVTMZ00  EQU   CVTMAP+164                                               01450000
CVTHEAD  EQU   CVTMAP+160                                               01451000
CVTRSV11 EQU   CVTMAP+156                                               01452000
CVT0PT01 EQU   CVTMAP+152                                               01453000
CVTMSER  EQU   CVTMAP+148                                               01454000
CVTRV516 EQU   CVTIERLC                                                 01455000
CVTILCH  EQU   CVTMAP+140                                               01456000
CVT0DS   EQU   CVTMAP+136                                               01457000
CVTFBOSV EQU   CVTMAP+132                                               01458000
CVTNUCB  EQU   CVTMAP+128                                               01459000
CVTIXAVL EQU   CVTMAP+124                                               01460000
CVTIOQET EQU   CVTMAP+120                                               01461000
CVTDCBA  EQU   CVTMAP+117                                               01462000
CVTMVS2  EQU   CVTDCB                                                   01463000
CVT6DAT  EQU   CVTDCB                                                   01464000
CVT4MPS  EQU   CVTDCB                                                   01465000
CVTRSV09 EQU   CVTDCB                                                   01466000
CVT4MS1  EQU   CVTDCB                                                   01467000
CVT2SPS  EQU   CVTDCB                                                   01468000
CVT1SSS  EQU   CVTDCB                                                   01469000
CVTRSV08 EQU   CVTDCB                                                   01470000
CVTSTB   EQU   CVTMAP+112                                               01471000
CVTQTD00 EQU   CVTMAP+108                                               01472000
CVTQTE00 EQU   CVTMAP+104                                               01473000
CVTCUCB  EQU   CVTMAP+100                                               01474000
CVTSJQ   EQU   CVTMAP+96                                                01475000
CVTPBLDL EQU   CVTMAP+92                                                01476000
CVTTPC   EQU   CVTMAP+88                                                01477000
CVTSVDCB EQU   CVTMAP+84                                                01478000
CVTBRET  EQU   CVTMAP+82                                                01479000
CVTEXIT  EQU   CVTMAP+80                                                01480000
CVT0FN00 EQU   CVTMAP+76                                                01481000
CVTDARA  EQU   CVTDAR+1                                                 01482000
CVTRSV07 EQU   CVTFLGS1                                                 01483000
CVTRSV06 EQU   CVTFLGS1                                                 01484000
CVTRSV05 EQU   CVTFLGS1                                                 01485000
CVTRSV04 EQU   CVTFLGS1                                                 01486000
CVTRSV03 EQU   CVTFLGS1                                                 01487000
CVTRSV02 EQU   CVTFLGS1                                                 01488000
CVTRSV01 EQU   CVTFLGS1                                                 01489000
CVTDMPLK EQU   CVTFLGS1                                                 01490000
CVTXITP  EQU   CVTMAP+68                                                01491000
CVTZDTAB EQU   CVTMAP+64                                                01492000
CVTMSLT  EQU   CVTMAP+60                                                01493000
CVTDATE  EQU   CVTMAP+56                                                01494000
CVTBTERM EQU   CVTMAP+52                                                01495000
CVTSYSAD EQU   CVTMAP+48                                                01496000
CVTXTLER EQU   CVTMAP+44                                                01497000
CVTILK2  EQU   CVTMAP+40                                                01498000
CVTILK1  EQU   CVTMAP+36                                                01499000
CVTPRLTV EQU   CVTMAP+32                                                01500000
CVTPCNVT EQU   CVTMAP+28                                                01501000
CVT0VL00 EQU   CVTMAP+24                                                01502000
CVTXAPG  EQU   CVTMAP+20                                                01503000
CVTBUF   EQU   CVTMAP+16                                                01504000
CVTJOB   EQU   CVTMAP+12                                                01505000
CVTLINK  EQU   CVTMAP+8                                                 01506000
CVT0EF00 EQU   CVTMAP+4                                                 01507000
CVTTCBP  EQU   CVTMAP                                                   01508000
CVT      EQU   CVTMAP                                                   01509000
EWADDISP EQU   EWA+29                                                   01510000
EWADCNT  EQU   EWA+28                                                   01511000
EWACPU   EQU   EWA+27                                                   01512000
@NM00048 EQU   EWA+26                                                   01513000
EWACHA   EQU   EWA+24                                                   01514000
EWACSEQ  EQU   EWAXCSW2                                                 01515000
EWACDIN  EQU   EWAXCSW2                                                 01516000
@NM00047 EQU   EWAXCSW2                                                 01517000
EWACTEC  EQU   EWAXCSW2                                                 01518000
EWACDAV  EQU   EWAXCSW1                                                 01519000
EWACCHV  EQU   EWAXCSW1                                                 01520000
EWACCMD  EQU   EWAXCSW1                                                 01521000
EWACUNS  EQU   EWAXCSW1                                                 01522000
EWACSQV  EQU   EWAXCSW1                                                 01523000
@NM00046 EQU   EWAXCSW1                                                 01524000
EWACITF  EQU   EWAXCSW1                                                 01525000
@NM00045 EQU   EWARGFG2                                                 01526000
EWACCUE  EQU   EWARGFG2                                                 01527000
EWACSTG  EQU   EWARGFG2                                                 01528000
EWACSCU  EQU   EWARGFG2                                                 01529000
EWACCHA  EQU   EWARGFG2                                                 01530000
EWACCPU  EQU   EWARGFG2                                                 01531000
EWANORTY EQU   EWARGFG1                                                 01532000
EWACCNT  EQU   EWARGFG1                                                 01533000
EWACSNS  EQU   EWARGFG1                                                 01534000
@NM00044 EQU   EWARGFG1                                                 01535000
EWACHIO  EQU   EWARGFG1                                                 01536000
EWACTIO  EQU   EWARGFG1                                                 01537000
EWACINT  EQU   EWARGFG1                                                 01538000
EWACSIO  EQU   EWARGFG1                                                 01539000
EWAUCB   EQU   EWAERPIB+1                                               01540000
@NM00043 EQU   EWAERPIB                                                 01541000
EWASTUP  EQU   EWA+14                                                   01542000
EWACNTR4 EQU   EWACNTRS+3                                               01543000
EWACNTR3 EQU   EWACNTRS+2                                               01544000
EWACNTR2 EQU   EWACNTRS+1                                               01545000
EWACNTR1 EQU   EWACNTRS                                                 01546000
EWASSTAT EQU   EWA+8                                                    01547000
EWASCTMX EQU   EWASNSCT                                                 01548000
@NM00042 EQU   EWASNSCT                                                 01549000
EWAFLG3  EQU   EWAFLAGS+2                                               01550000
@NM00041 EQU   EWAFLG2                                                  01551000
EWADIR   EQU   EWAFLG2                                                  01552000
EWACOVF  EQU   EWAFLG2                                                  01553000
EWAWTEMP EQU   EWAFLG2                                                  01554000
EWAMDR   EQU   EWAFLG2                                                  01555000
EWABDSNS EQU   EWAFLG1                                                  01556000
EWADDMSG EQU   EWAFLG1                                                  01557000
EWASCC1  EQU   EWASCC3                                                  01558000
EWASCC2  EQU   EWASCC3                                                  01559000
@NM00040 EQU   EWAFLG1                                                  01560000
EWASLIS  EQU   EWAFLG1                                                  01561000
EWAEXT   EQU   EWAHDR                                                   01562000
DDRUBCNT EQU   DDRLONG+72                                               01563000
@NM00039 EQU   DDRUSER+1                                                01564000
DDRUMODE EQU   DDRUSER                                                  01565000
@NM00038 EQU   DDRREC2                                                  01566000
DDRRFMTO EQU   DDRREC2                                                  01567000
DDRREC1  EQU   DDRREC                                                   01568000
DDRRETRY EQU   DDRLONG+65                                               01569000
DDRLNOP  EQU   DDRLABEL                                                 01570000
@NM00037 EQU   DDRLABEL                                                 01571000
DDRLSD   EQU   DDRLABEL                                                 01572000
DDRLNSL  EQU   DDRLABEL                                                 01573000
DDRLNL   EQU   DDRLABEL                                                 01574000
DDRLBLP  EQU   DDRLABEL                                                 01575000
DDRLAL   EQU   DDRLABEL                                                 01576000
DDRMSGPC EQU   DDRMSGP+1                                                01577000
DDRMSGPN EQU   DDRMSGP                                                  01578000
DDRMSGCD EQU   DDRMSG+1                                                 01579000
DDRMSGOP EQU   DDRMSG                                                   01580000
@NM00036 EQU   DDRIOF2                                                  01581000
DDRICNT  EQU   DDRIOF2                                                  01582000
DDRIMNT  EQU   DDRIOF2                                                  01583000
DDRILAB  EQU   DDRIOF2                                                  01584000
DDRITAKE EQU   DDRIOF2                                                  01585000
DDRWHICH EQU   DDRIOF2                                                  01586000
DDRIOF1  EQU   DDRIOF                                                   01587000
DDRCOUNT EQU   DDRLONG+48                                               01588000
DDRIBUFL EQU   DDRLONG+42                                               01589000
DDRAPP2  EQU   DDRAPP+1                                                 01590000
DDRAPP1  EQU   DDRAPP                                                   01591000
DDRINV2  EQU   DDRINV+1                                                 01592000
DDRINV1  EQU   DDRINV                                                   01593000
DDRTER2  EQU   DDRTER+1                                                 01594000
DDRTEST  EQU   DDRLONG+32                                               01595000
DDRUASCB EQU   DDRLONG+28                                               01596000
DDRUTCB  EQU   DDRLONG+24                                               01597000
DDRUIOB  EQU   DDRLONG+20                                               01598000
DDRUDEB  EQU   DDRMIHT+4                                                01599000
DDRUDCB  EQU   DDRMIHT                                                  01600000
DDRMIH   EQU   DDRLONG+9                                                01601000
DDRFIRST EQU   DDRROWN                                                  01602000
DDRJES3L EQU   DDRROWN                                                  01603000
@NM00035 EQU   DDRROWN                                                  01604000
DDRRDENQ EQU   DDRROWN                                                  01605000
DDRRUENQ EQU   DDRROWN                                                  01606000
DDRRTENQ EQU   DDRROWN                                                  01607000
DDRFMUCB EQU   DDRLONG+4                                                01608000
DDRFMCUA EQU   DDRSHORT+18                                              01609000
DDRUASID EQU   DDRSHORT+16                                              01610000
@NM00034 EQU   DDRDSTAT                                                 01611000
DDRUR    EQU   DDRDSTAT                                                 01612000
DDRBUFL  EQU   DDRDSTAT                                                 01613000
DDRMDR   EQU   DDRDCHAR                                                 01614000
@NM00033 EQU   DDRSTAT                                                  01615000
DDRSIRB  EQU   DDRSTAT                                                  01616000
DDRRMV   EQU   DDRSTAT                                                  01617000
@NM00032 EQU   DDRSRC                                                   01618000
DDRPAGE  EQU   DDRSRC                                                   01619000
DDROPER  EQU   DDRSRC                                                   01620000
DDRNXT   EQU   DDRSHORT+4                                               01621000
IOSEND   EQU   IOSB+108                                                 01622000
IOSSKR   EQU   IOSEEKA+7                                                01623000
IOSSKH2  EQU   IOSSKHH+1                                                01624000
IOSSKH1  EQU   IOSSKHH                                                  01625000
IOSSKCC  EQU   IOSCCHH                                                  01626000
IOSSKBB  EQU   IOSEEKA+1                                                01627000
IOSSKM   EQU   IOSEEKA                                                  01628000
IOSEEK   EQU   IOSB+92                                                  01629000
IOSMDM   EQU   IOSB+91                                                  01630000
IOSMDB   EQU   IOSB+90                                                  01631000
IOSCKEY7 EQU   IOSCKEY                                                  01632000
IOSCKEY6 EQU   IOSCKEY                                                  01633000
IOSCKEY5 EQU   IOSCKEY                                                  01634000
IOSCKEY4 EQU   IOSCKEY                                                  01635000
@NM00028 EQU   IOSCKEY                                                  01636000
IOSFMSK  EQU   IOSB+88                                                  01637000
IOSCUDEV EQU   IOSPATH+1                                                01638000
@NM00027 EQU   IOSCHN                                                   01639000
IOSPATH3 EQU   IOSCHN                                                   01640000
IOSPATH2 EQU   IOSCHN                                                   01641000
IOSEXP   EQU   IOSCHN                                                   01642000
IOSGDP   EQU   IOSCHN                                                   01643000
IOSAFF   EQU   IOSB+85                                                  01644000
IOSRSS1B EQU   IOSB+84                                                  01645000
IOSDSID  EQU   IOSB+80                                                  01646000
IOSVST   EQU   IOSB+76                                                  01647000
IOSRST   EQU   IOSB+72                                                  01648000
IOSDIE   EQU   IOSB+68                                                  01649000
IOSABN   EQU   IOSB+64                                                  01650000
IOSNRM   EQU   IOSB+60                                                  01651000
IOSPCI   EQU   IOSB+56                                                  01652000
IOSPCHN  EQU   IOSB+48                                                  01653000
IOSSNS   EQU   IOSB+42                                                  01654000
IOSAPMSK EQU   IOSB+40                                                  01655000
IOSRES4A EQU   IOSB+36                                                  01656000
IOSUSE   EQU   IOSB+32                                                  01657000
IOSSRB   EQU   IOSB+28                                                  01658000
IOSCSWRC EQU   IOSCSW+5                                                 01659000
IOSTSB   EQU   IOSTATUS+1                                               01660000
IOSTSA   EQU   IOSTATUS                                                 01661000
IOSCSWCA EQU   IOSCSW                                                   01662000
IOSCC    EQU   @NM00026                                                 01663000
IOSUCB   EQU   IOSB+16                                                  01664000
IOSOPT2X EQU   IOSOPT2                                                  01665000
IOSHTP   EQU   IOSOPT2                                                  01666000
IOSRELSE EQU   IOSOPT                                                   01667000
IOSAPR   EQU   IOSOPT                                                   01668000
IOSTSLL  EQU   IOSOPT                                                   01669000
IOSNERP  EQU   IOSOPT                                                   01670000
IOSPSLL  EQU   IOSOPT                                                   01671000
IOSQISCE EQU   IOSOPT                                                   01672000
IOSDEP   EQU   IOSOPT                                                   01673000
IOSBYP   EQU   IOSOPT                                                   01674000
IOSCOD   EQU   IOSB+13                                                  01675000
IOSPKY7  EQU   IOSPKEY                                                  01676000
IOSPGDPX EQU   IOSPKEY                                                  01677000
IOSIDR   EQU   IOSPKEY                                                  01678000
IOSLCL   EQU   IOSPKEY                                                  01679000
@NM00025 EQU   IOSPKEY                                                  01680000
IOSPGAD  EQU   IOSB+8                                                   01681000
IOSASID  EQU   IOSB+6                                                   01682000
IOSPRLVL EQU   IOSB+5                                                   01683000
IOSDVRID EQU   IOSB+4                                                   01684000
IOSPROC  EQU   IOSB+3                                                   01685000
IOSFLC7  EQU   IOSFLC                                                   01686000
IOSFLC6  EQU   IOSFLC                                                   01687000
IOSGLC5  EQU   IOSFLC                                                   01688000
IOSFLC4  EQU   IOSFLC                                                   01689000
IOSTP    EQU   IOSFLC                                                   01690000
IOSCC3WE EQU   IOSFLC                                                   01691000
IOSVERIF EQU   IOSDVALT                                                 01692000
IOSDVMNT EQU   IOSFLC                                                   01693000
IOSLOG   EQU   IOSFLB                                                   01694000
IOSBDCST EQU   IOSFLB                                                   01695000
IOSMSG   EQU   IOSFLB                                                   01696000
IOSFLB4  EQU   IOSFLB                                                   01697000
IOSFLB3  EQU   IOSFLB                                                   01698000
IOSFLB2  EQU   IOSFLB                                                   01699000
IOSFLB1  EQU   IOSFLB                                                   01700000
IOSDIESE EQU   IOSFLB                                                   01701000
IOSIOSB  EQU   IOSFLA                                                   01702000
IOSDOM   EQU   IOSFLA                                                   01703000
IOSEX    EQU   IOSFLA                                                   01704000
IOSSMDB  EQU   IOSFLA                                                   01705000
IOSSMDA  EQU   IOSFLA                                                   01706000
IOSERR   EQU   IOSFLA                                                   01707000
IOSCCHN  EQU   IOSACHN                                                  01708000
IOSDCHN  EQU   IOSACHN                                                  01709000
ASXBEND  EQU   ASXB+232                                                 01710000
ASXBRV25 EQU   ASXB+228                                                 01711000
ASXBRV24 EQU   ASXB+224                                                 01712000
ASXBRV23 EQU   ASXB+220                                                 01713000
ASXBRV22 EQU   ASXB+216                                                 01714000
ASXBRV21 EQU   ASXB+212                                                 01715000
ASXBRV20 EQU   ASXB+208                                                 01716000
ASXBRV19 EQU   ASXB+204                                                 01717000
ASXBRV18 EQU   ASXB+200                                                 01718000
ASXBRV17 EQU   ASXB+196                                                 01719000
ASXBRV16 EQU   ASXB+192                                                 01720000
ASXBLSRB EQU   ASXBAEQ+20                                               01721000
ASXBFSRB EQU   ASXBAEQ+16                                               01722000
ASXBLRQE EQU   ASXBAEQ+12                                               01723000
ASXBFRQE EQU   ASXBAEQ+8                                                01724000
ASXBLIQE EQU   ASXBAEQ+4                                                01725000
ASXBFIQE EQU   ASXBAEQ                                                  01726000
ASXBETSK EQU   ASXB+164                                                 01727000
ASXBSIRB EQU   ASXB+160                                                 01728000
ASXBPSWD EQU   ASXB+152                                                 01729000
ASXBPRG  EQU   ASXB+136                                                 01730000
ASXBRV26 EQU   ASXB+132                                                 01731000
ASXBOUSB EQU   ASXB+128                                                 01732000
ASXBRCTD EQU   ASXB+120                                                 01733000
ASXBRSMD EQU   ASXB+116                                                 01734000
ASXBSPSA EQU   ASXB+112                                                 01735000
ASXBFRWA EQU   ASXB+108                                                 01736000
ASXBFLSA EQU   ASXB+36                                                  01737000
ASXBIHSA EQU   ASXB+32                                                  01738000
ASXBRV15 EQU   ASXB+28                                                  01739000
ASXBRV14 EQU   ASXB+24                                                  01740000
ASXBLWA  EQU   ASXB+20                                                  01741000
ASXBMPST EQU   ASXB+16                                                  01742000
ASXBRS00 EQU   ASXB+14                                                  01743000
ASXBTCBS EQU   ASXB+12                                                  01744000
ASXBLTCB EQU   ASXB+8                                                   01745000
ASXBFTCB EQU   ASXB+4                                                   01746000
ASXBASXB EQU   ASXB                                                     01747000
ASXBEGIN EQU   ASXB                                                     01748000
ASCBEND  EQU   ASCB+208                                                 01749000
ASCBSRBT EQU   ASCB+200                                                 01750000
ASCBSWTL EQU   ASCB+196                                                 01751000
ASCBRS14 EQU   ASCB+195                                                 01752000
ASCBSMCT EQU   ASCB+194                                                 01753000
ASCBRS12 EQU   ASCB+192                                                 01754000
ASCBPCTT EQU   ASCB+188                                                 01755000
ASCBVGTT EQU   ASCB+184                                                 01756000
ASCBLGCB EQU   ASCB+180                                                 01757000
ASCBJBNS EQU   ASCB+176                                                 01758000
ASCBJBNI EQU   ASCB+172                                                 01759000
ASCBMCC  EQU   ASCB+168                                                 01760000
ASCBRTWA EQU   ASCB+164                                                 01761000
ASCBIQEA EQU   ASCB+160                                                 01762000
ASCBXMPQ EQU   ASCB+156                                                 01763000
ASCBRS01 EQU   ASCB+154                                                 01764000
ASCBFMCT EQU   ASCB+152                                                 01765000
ASCBOUXB EQU   ASCB+148                                                 01766000
ASCBOUCB EQU   ASCB+144                                                 01767000
ASCBMECB EQU   ASCB+140                                                 01768000
ASCBQECB EQU   ASCB+136                                                 01769000
ASCBCMSB EQU   ASCB+132                                                 01770000
ASCBCMSF EQU   ASCB+128                                                 01771000
ASCBTCBS EQU   ASCB+124                                                 01772000
ASCBNVSC EQU   ASCB+122                                                 01773000
ASCBVSC  EQU   ASCB+120                                                 01774000
ASCBSRBS EQU   ASCB+118                                                 01775000
ASCBSSRB EQU   ASCB+116                                                 01776000
ASCBRV06 EQU   ASCBFLG2                                                 01777000
ASCBRV05 EQU   ASCBFLG2                                                 01778000
ASCBRV04 EQU   ASCBFLG2                                                 01779000
ASCBSNQS EQU   ASCBFLG2                                                 01780000
ASCBS2S  EQU   ASCBFLG2                                                 01781000
ASCBCEXT EQU   ASCBFLG2                                                 01782000
ASCBPXMT EQU   ASCBFLG2                                                 01783000
ASCBXMPT EQU   ASCBFLG2                                                 01784000
ASCBRF07 EQU   ASCBDSP1                                                 01785000
ASCBRF06 EQU   ASCBDSP1                                                 01786000
ASCBRF05 EQU   ASCBDSP1                                                 01787000
ASCBRF04 EQU   ASCBDSP1                                                 01788000
ASCBRF03 EQU   ASCBDSP1                                                 01789000
ASCBRF02 EQU   ASCBDSP1                                                 01790000
ASCBFAIL EQU   ASCBDSP1                                                 01791000
ASCBNOQ  EQU   ASCBDSP1                                                 01792000
ASCBSWCT EQU   ASCB+112                                                 01793000
ASCBTMCH EQU   ASCB+104                                                 01794000
ASCBNSWP EQU   ASCBFLG1                                                 01795000
ASCBTYP1 EQU   ASCBFLG1                                                 01796000
ASCBSTND EQU   ASCBFLG1                                                 01797000
ASCBABNT EQU   ASCBFLG1                                                 01798000
ASCBTERM EQU   ASCBFLG1                                                 01799000
ASCBS3S  EQU   ASCBFLG1                                                 01800000
ASCBCMSH EQU   ASCBFLG1                                                 01801000
ASCBTOFF EQU   ASCBFLG1                                                 01802000
ASCBRF01 EQU   ASCBRCTF                                                 01803000
ASCBTMLW EQU   ASCBRCTF                                                 01804000
ASCBOUT  EQU   ASCBRCTF                                                 01805000
ASCBWAIT EQU   ASCBRCTF                                                 01806000
ASCBRV08 EQU   ASCBRCTF                                                 01807000
ASCBFQU  EQU   ASCBRCTF                                                 01808000
ASCBFRS  EQU   ASCBRCTF                                                 01809000
ASCBTMNO EQU   ASCBRCTF                                                 01810000
ASCBAFFN EQU   ASCBFW1                                                  01811000
ASCBDUMP EQU   ASCB+96                                                  01812000
ASCBQSVC EQU   ASCB+92                                                  01813000
ASCBUBET EQU   ASCB+88                                                  01814000
ASCBECB  EQU   ASCB+84                                                  01815000
ASCBJSTL EQU   ASCB+80                                                  01816000
ASCBEWST EQU   ASCB+72                                                  01817000
ASCBEJST EQU   ASCB+64                                                  01818000
ASCBTSB  EQU   ASCB+60                                                  01819000
ASCBCSCB EQU   ASCB+56                                                  01820000
ASCBRSM  EQU   ASCB+52                                                  01821000
ASCBLDA  EQU   ASCB+48                                                  01822000
ASCBSTOR EQU   ASCB+44                                                  01823000
ASCBDP   EQU   ASCB+43                                                  01824000
ASCBRV07 EQU   ASCB+42                                                  01825000
ASCBIOSM EQU   ASCB+40                                                  01826000
ASCBSEQN EQU   ASCB+38                                                  01827000
ASCBCPUS EQU   ASCB+32                                                  01828000
ASCBSPL  EQU   ASCB+28                                                  01829000
ASCBLSLQ EQU   ASCB+24                                                  01830000
ASCBFSLQ EQU   ASCB+20                                                  01831000
ASCBIOSP EQU   ASCB+16                                                  01832000
ASCBLOCK EQU   ASCB+12                                                  01833000
ASCBBWDP EQU   ASCB+8                                                   01834000
ASCBFWDP EQU   ASCB+4                                                   01835000
ASCBASCB EQU   ASCB                                                     01836000
ASCBEGIN EQU   ASCB                                                     01837000
@NM00024 EQU   PSA+3668                                                 01838000
PSASTAK  EQU   PSA+3072                                                 01839000
@NM00023 EQU   PSA+1040                                                 01840000
PSAUSEND EQU   PSA+1040                                                 01841000
PSARV062 EQU   PSA+1036                                                 01842000
PSAATCVT EQU   PSA+1032                                                 01843000
PSAPCPSW EQU   PSA+1024                                                 01844000
PSAPIR2  EQU   PSA+1020                                                 01845000
PSARV059 EQU   PSA+1018                                                 01846000
PSASVC13 EQU   PSA+1016                                                 01847000
PSALSFCC EQU   PSA+1012                                                 01848000
PSASFACC EQU   PSA+1008                                                 01849000
PSASTOP  EQU   PSA+992                                                  01850000
PSASTART EQU   PSA+976                                                  01851000
PSARSPSW EQU   PSA+968                                                  01852000
PSASRPSW EQU   PSA+960                                                  01853000
PSARV045 EQU   PSA+892                                                  01854000
PSARV044 EQU   PSA+888                                                  01855000
PSARV043 EQU   PSA+884                                                  01856000
PSARV042 EQU   PSA+880                                                  01857000
PSARV041 EQU   PSA+876                                                  01858000
PSARV040 EQU   PSA+872                                                  01859000
PSARV025 EQU   PSA+868                                                  01860000
PSADSSED EQU   PSA+868                                                  01861000
PSADSSPR EQU   PSA+864                                                  01862000
PSADSSFW EQU   PSA+860                                                  01863000
PSADSS14 EQU   PSA+856                                                  01864000
PSADSSPP EQU   PSA+848                                                  01865000
PSADSSRP EQU   PSA+840                                                  01866000
PSADSS05 EQU   PSADSSF4                                                 01867000
PSADSS10 EQU   PSADSSF4                                                 01868000
PSADSSVE EQU   PSADSSF4                                                 01869000
PSADSSDE EQU   PSADSSF4                                                 01870000
PSADSSC0 EQU   PSADSSF4                                                 01871000
PSADSSIE EQU   PSADSSF4                                                 01872000
PSADSS12 EQU   PSADSSF4                                                 01873000
PSADSSRC EQU   PSADSSF4                                                 01874000
PSARV057 EQU   PSADSSF3                                                 01875000
PSARV056 EQU   PSADSSF3                                                 01876000
PSARV055 EQU   PSADSSF3                                                 01877000
PSADSSMC EQU   PSADSSF3                                                 01878000
PSADSSRW EQU   PSADSSF3                                                 01879000
PSADSSNM EQU   PSADSSF3                                                 01880000
PSADSSES EQU   PSADSSF3                                                 01881000
PSADSSGP EQU   PSADSSF3                                                 01882000
PSADSSF2 EQU   PSADSSFL+1                                               01883000
PSADSSPI EQU   PSADSSF1                                                 01884000
PSADSSOI EQU   PSADSSF1                                                 01885000
PSADSSSP EQU   PSADSSF1                                                 01886000
PSADSSTP EQU   PSADSSF1                                                 01887000
PSADSSDW EQU   PSADSSF1                                                 01888000
PSADSSDD EQU   PSADSSF1                                                 01889000
PSADSSDM EQU   PSADSSF1                                                 01890000
PSADSSMV EQU   PSADSSF1                                                 01891000
PSADSSTS EQU   PSA+816                                                  01892000
PSADSSWK EQU   PSA+812                                                  01893000
PSADSSR3 EQU   PSA+808                                                  01894000
PSADSSR2 EQU   PSA+804                                                  01895000
PSADSSRS EQU   PSA+800                                                  01896000
PSASTOR  EQU   PSA+796                                                  01897000
PSACPUSA EQU   PSA+794                                                  01898000
PSAVSTAP EQU   PSA+792                                                  01899000
PSAWKVAP EQU   PSA+788                                                  01900000
PSAWKRAP EQU   PSA+784                                                  01901000
PSAMCHIC EQU   PSA+783                                                  01902000
PSARV061 EQU   PSA+782                                                  01903000
PSASYMSK EQU   PSA+781                                                  01904000
PSAMCHFL EQU   PSA+780                                                  01905000
PSACR0   EQU   PSA+776                                                  01906000
PSAPSWSV EQU   PSA+768                                                  01907000
PSACLHS  EQU   PSAHLHI                                                  01908000
PSALKR15 EQU   PSALKSA+60                                               01909000
PSALKR14 EQU   PSALKSA+56                                               01910000
PSALKR13 EQU   PSALKSA+52                                               01911000
PSALKR12 EQU   PSALKSA+48                                               01912000
PSALKR11 EQU   PSALKSA+44                                               01913000
PSALKR10 EQU   PSALKSA+40                                               01914000
PSALKR9  EQU   PSALKSA+36                                               01915000
PSALKR8  EQU   PSALKSA+32                                               01916000
PSALKR7  EQU   PSALKSA+28                                               01917000
PSALKR6  EQU   PSALKSA+24                                               01918000
PSALKR5  EQU   PSALKSA+20                                               01919000
PSALKR4  EQU   PSALKSA+16                                               01920000
PSALKR3  EQU   PSALKSA+12                                               01921000
PSALKR2  EQU   PSALKSA+8                                                01922000
PSALKR1  EQU   PSALKSA+4                                                01923000
PSALKR0  EQU   PSALKSA                                                  01924000
PSARV023 EQU   PSACLHT+52                                               01925000
PSALOCAL EQU   PSACLHT+48                                               01926000
PSACMSL  EQU   PSACLHT+44                                               01927000
PSAOPTL  EQU   PSACLHT+40                                               01928000
PSATPACL EQU   PSACLHT+36                                               01929000
PSATPDNL EQU   PSACLHT+32                                               01930000
PSATPNCL EQU   PSACLHT+28                                               01931000
PSAIOSLL EQU   PSACLHT+24                                               01932000
PSAIOSUL EQU   PSACLHT+20                                               01933000
PSAIOSCL EQU   PSACLHT+16                                               01934000
PSAIOSSL EQU   PSACLHT+12                                               01935000
PSASALCL EQU   PSACLHT+8                                                01936000
PSAASML  EQU   PSACLHT+4                                                01937000
PSADISPL EQU   PSACLHT                                                  01938000
PSASRSA  EQU   PSA+636                                                  01939000
PSARV050 EQU   PSA+634                                                  01940000
PSADSSGO EQU   PSA+633                                                  01941000
PSARECUR EQU   PSA+632                                                  01942000
PSAHLHIS EQU   PSA+628                                                  01943000
PSAIPCSA EQU   PSA+624                                                  01944000
@NM00022 EQU   PSA+621                                                  01945000
PSAIPCDM EQU   PSA+620                                                  01946000
PSAIPCD  EQU   PSA+616                                                  01947000
@NM00021 EQU   PSA+613                                                  01948000
PSAIPCRM EQU   PSA+612                                                  01949000
PSAIPCR  EQU   PSA+608                                                  01950000
PSAMCHEX EQU   PSA+600                                                  01951000
PSAMPSW  EQU   PSA+592                                                  01952000
PSAEXPS2 EQU   PSA+584                                                  01953000
PSAEXPS1 EQU   PSA+576                                                  01954000
PSAPIREG EQU   PSA+572                                                  01955000
PSARSREG EQU   PSA+568                                                  01956000
PSAGPREG EQU   PSA+556                                                  01957000
PSARV022 EQU   PSASUP4                                                  01958000
PSARV021 EQU   PSASUP4                                                  01959000
PSARV020 EQU   PSASUP4                                                  01960000
PSARV019 EQU   PSASUP4                                                  01961000
PSARV018 EQU   PSASUP4                                                  01962000
PSARV017 EQU   PSASUP4                                                  01963000
PSARV016 EQU   PSASUP4                                                  01964000
PSARV015 EQU   PSASUP4                                                  01965000
PSARV014 EQU   PSASUP3                                                  01966000
PSARV013 EQU   PSASUP3                                                  01967000
PSARV012 EQU   PSASUP3                                                  01968000
PSARV011 EQU   PSASUP3                                                  01969000
PSARV010 EQU   PSASUP3                                                  01970000
PSAPSREG EQU   PSASUP3                                                  01971000
PSAPI2   EQU   PSASUP3                                                  01972000
PSAIOSUP EQU   PSASUP3                                                  01973000
PSALCR   EQU   PSASUP2                                                  01974000
PSARTM   EQU   PSASUP2                                                  01975000
PSAACR   EQU   PSASUP2                                                  01976000
PSAIPCE2 EQU   PSASUP2                                                  01977000
PSAIPCES EQU   PSASUP2                                                  01978000
PSAIPCEC EQU   PSASUP2                                                  01979000
PSAGTF   EQU   PSASUP2                                                  01980000
PSAIPCRI EQU   PSASUP2                                                  01981000
PSAIPCRP EQU   PSASUP1                                                  01982000
PSAIPCDR EQU   PSASUP1                                                  01983000
PSADISP  EQU   PSASUP1                                                  01984000
PSALOCK  EQU   PSASUP1                                                  01985000
PSAPI    EQU   PSASUP1                                                  01986000
PSAEXT   EQU   PSASUP1                                                  01987000
PSASVC   EQU   PSASUP1                                                  01988000
PSAIO    EQU   PSASUP1                                                  01989000
PSAAOLD  EQU   PSA+548                                                  01990000
PSAANEW  EQU   PSA+544                                                  01991000
PSATOLD  EQU   PSA+540                                                  01992000
PSATNEW  EQU   PSA+536                                                  01993000
PSALCCAR EQU   PSA+532                                                  01994000
PSALCCAV EQU   PSA+528                                                  01995000
PSAPCCAR EQU   PSA+524                                                  01996000
PSAPCCAV EQU   PSA+520                                                  01997000
PSACPULA EQU   PSA+518                                                  01998000
PSACPUPA EQU   PSA+516                                                  01999000
PSAPSA   EQU   PSA+512                                                  02000000
FLCHDEND EQU   PSA+512                                                  02001000
FLCCRSAV EQU   FLCMCLA+280                                              02002000
FLCGRSAV EQU   FLCMCLA+216                                              02003000
FLCFPSAV EQU   FLCMCLA+184                                              02004000
FLCFLA   EQU   FLCMCLA+88                                               02005000
FLCRGNCD EQU   FLCMCLA+84                                               02006000
FLCFSAA  EQU   FLCFSA+1                                                 02007000
@NM00020 EQU   FLCFSA                                                   02008000
@NM00019 EQU   FLCMCLA+72                                               02009000
FLCMCIC  EQU   FLCMCLA+64                                               02010000
@NM00018 EQU   FLCMCLA+20                                               02011000
FLCIOAA  EQU   FLCIOA+1                                                 02012000
@NM00017 EQU   FLCIOA                                                   02013000
@NM00016 EQU   FLCMCLA+15                                               02014000
@NM00015 EQU   FLCMCLA+14                                               02015000
@NM00014 EQU   FLCMCLA+12                                               02016000
FLCLCL   EQU   FLCMCLA+8                                                02017000
FLCIOELA EQU   FLCIOEL+1                                                02018000
@NM00013 EQU   FLCIOEL                                                  02019000
FLCCHNID EQU   FLCMCLA                                                  02020000
@NM00012 EQU   PSA+160                                                  02021000
FLCMTRCD EQU   PSA+157                                                  02022000
@NM00011 EQU   PSA+156                                                  02023000
FLCPERA  EQU   FLCPER+1                                                 02024000
@NM00010 EQU   FLCPER                                                   02025000
@NM00009 EQU   PSA+151                                                  02026000
FLCPERCD EQU   PSA+150                                                  02027000
FLCMCNUM EQU   PSA+149                                                  02028000
@NM00008 EQU   PSA+148                                                  02029000
FLCTEAA  EQU   FLCTEA+1                                                 02030000
@NM00007 EQU   FLCTEA                                                   02031000
PSAPIPC  EQU   PSAPICOD                                                 02032000
PSAPIMC  EQU   PSAPICOD                                                 02033000
PSAPIPER EQU   PSAPICOD                                                 02034000
PSARV049 EQU   FLCPICOD                                                 02035000
FLCPILCB EQU   FLCPIILC                                                 02036000
@NM00006 EQU   FLCPIILC                                                 02037000
@NM00005 EQU   PSAEPPSW                                                 02038000
FLCSVCN  EQU   PSAESPSW+2                                               02039000
FLCSILCB EQU   FLCSVILC                                                 02040000
@NM00004 EQU   FLCSVILC                                                 02041000
@NM00003 EQU   PSAESPSW                                                 02042000
FLCEICOD EQU   PSAEEPSW+2                                               02043000
PSASPAD  EQU   PSAEEPSW                                                 02044000
@NM00002 EQU   PSA+128                                                  02045000
FLCINPSW EQU   PSA+120                                                  02046000
FLCMNPSW EQU   PSA+112                                                  02047000
FLCPNPSW EQU   PSA+104                                                  02048000
FLCSNPSW EQU   PSA+96                                                   02049000
FLCENPSW EQU   PSA+88                                                   02050000
FLCTRACE EQU   PSA+84                                                   02051000
FLCTIMER EQU   PSA+80                                                   02052000
FLCCVT2  EQU   PSA+76                                                   02053000
FLCCAW   EQU   PSA+72                                                   02054000
FLCCSW   EQU   PSA+64                                                   02055000
FLCIOPSW EQU   PSA+56                                                   02056000
FLCMOPSW EQU   PSA+48                                                   02057000
FLCPOPSW EQU   PSA+40                                                   02058000
FLCSOPSW EQU   PSA+32                                                   02059000
FLCEOPSW EQU   PSA+24                                                   02060000
@NM00001 EQU   FLCICCW2+4                                               02061000
FLCICCW1 EQU   FLCROPSW                                                 02062000
FLCIPPSW EQU   FLCRNPSW                                                 02063000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02064000
@ENDDATA EQU   *                                                        02065000
         END   IGFDI0,(C'PLS1027',0701,77039)                           02066000
