         TITLE 'AHLTSVC FGBR FOR SVC GATHERING FOR VS2/R2              *00001000
                        '                                               00002000
AHLTSVC  CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'AHLTSVC   78.139'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
*                                                            /*ZM30921* 00011000
         USING   AHLTSVC,R15ENTRY    SETUP TEMP BASE REG                00012000
         B       LOADBASE            BRANCH AROUND ADCONS               00013000
NBASEAD1 DC    A(AHLTSVC)            ADDR OF ENTRY POINT                00014000
NBASEAD2 DC    A(AHLTSVC+4095)       ADDR OF SECOND 4K SECTION          00015000
NBASEAD3 DC    A(AHLTSVC+8190)    3RD 4K SECTION               ZM30921  00016000
LOADBASE L       BASEREG1,NBASEAD1   LOAD PERM BASE REG1                00017000
         L       BASEREG2,NBASEAD2   LOAD PERM BASE REG2                00018000
         L     BASEREG3,NBASEAD3   LOAD PERM BASE REG3         ZM30921  00019000
         USING   AHLTSVC,BASEREG1    TELL ASSEM ABOUT PERM BASE         00020000
         USING   AHLTSVC+4095,BASEREG2     TELL ASSEM ABOUT PERM BASE   00021000
         USING AHLTSVC+8190,BASEREG3                           ZM30921  00022000
         DROP    R15ENTRY            DROP TEMP BASE                     00023000
RBPRFXLN EQU 64                                                         00024000
RBPRFLNA EQU 32                                                         00025000
PRBLEN   EQU 136                                                        00026000
SIRBLEN  EQU 200                                                        00027000
TIRBLEN  EQU 136                                                        00028000
IRBLEN   EQU 128                                                        00029000
SVRBLEN  EQU 200                                                        00030000
CI       EQU   1                                                        00031000
UNPKLN26 EQU   7                                                        00032000
UNPKL26  EQU   4                                                        00033000
TRLEN26  EQU   6                                                        00034000
CCHH     EQU   1                                                        00035000
UNPKLN   EQU   11                                                       00036000
UNPKLN1  EQU   6                                                        00037000
ZERO     EQU   0                                                        00038000
TRLEN    EQU   10                                                       00039000
*   MCATRAIL=SETSVC;                /* SET MCATRAIL TO INDICATE SVC     00040000
*                                      GATHERING                     */ 00041000
         MVC   MCATRAIL(8,AWSAPTR),@CB04617                        0333 00042000
*   WORK1=ADDR(AHLTSVCE);           /* GET ADDR OF THE FRR FOR SETUP */ 00043000
         LA    WORK1,AHLTSVCE                                      0334 00044000
*   GEN;                                                           0335 00045000
     SETFRR A,FRRAD=(WORK1),PARMAD=(FRRPARM),WRKREGS=(FRRPARM,WORK2)    00046000
*   SVR14NRM=R14;                   /* SAVE RETURN ADDRESS TO AHLMCIH*/ 00047000
         ST    R14,SVR14NRM(,FRRPARM)                              0336 00048000
*   RFY                                                            0337 00049000
*     R14 UNRSTD;                                                  0337 00050000
*   ERRTRNAD=0;                     /* SET ERROR RET ADDR TO INDICATE   00051000
*                                      CATASTROPHIC ERROR AREA       */ 00052000
         SLR   ERRTRNAD,ERRTRNAD                                   0338 00053000
*   GEN;                                                           0339 00054000
     TM KEYCMWP,X'F1' TEST FOR SUPER STATE KEY 0                        00055000
     BNZ ENDSVC                                                         00056000
*   ASCBPTR=PSAAOLD;                /* GET ASCB ADDRESS              */ 00057000
         L     ASCBPTR,PSAAOLD                                     0340 00058000
*   IF ASCBPTR=GTFASCB THEN         /* CHECK FOR AN INTERRUPT FROM 0341 00059000
*                                      GTF                           */ 00060000
         C     ASCBPTR,GTFASCB(,PCTPTR)                            0341 00061000
         BNE   @RF00341                                            0341 00062000
*     IF OPTTRC=OFF THEN            /* CHECK TO SEE IF WE ARE TRACING   00063000
*                                      GTF                           */ 00064000
         TM    OPTTRC(PCTPTR),B'00001000'                          0342 00065000
         BZ    @RT00342                                            0342 00066000
*       GO TO ENDSVC;                                              0343 00067000
*   SVCASCB=ASCBPTR;                /* ALL OK SO GATHER THE ASCB   0344 00068000
*                                      ADDRESS                       */ 00069000
@RF00341 ST    ASCBPTR,SVCASCB(,AWSAPTR)                           0344 00070000
*   RECLGTH=LENGTH(BASICREC);       /* SET LGTH TO LENGTH OF THE   0345 00071000
*                                      BASIC RECORD                  */ 00072000
         LA    RECLGTH,46                                          0345 00073000
*   SVCTCB=PSATOLD;                 /* PICK UP THE TCB ADDRESS       */ 00074000
         MVC   SVCTCB(4,AWSAPTR),PSATOLD                           0346 00075000
*   SVCCPUID=PSACPUSA;              /* GATHER THE CPUID OF THE CPU WE   00076000
*                                      ARE ON                @YM03489*/ 00077000
         LH    @05,PSACPUSA                                        0347 00078000
         STH   @05,SVCCPUID(,AWSAPTR)                              0347 00079000
*   SVCPSW=FLCSOPSW;                /* GET SVC OLD PSW FROM INTERRUPT*/ 00080000
         MVC   SVCPSW(8,AWSAPTR),FLCSOPSW                          0348 00081000
*   SVCINTCD=FLCSVCN;               /* OVERLAY INTERRUPT CODE INTO 0349 00082000
*                                      PSW                           */ 00083000
         LH    @05,FLCSVCN                                         0349 00084000
         STH   @05,SVCINTCD(,AWSAPTR)                              0349 00085000
*   LCCAPTR=PSALCCAV;               /* SETUP ADDRESSABILITY TO LCCA  */ 00086000
         L     LCCAPTR,PSALCCAV                                    0350 00087000
*   SVCR15=REGFLCCA;                /* GATHER REGISTERS              */ 00088000
         MVC   SVCR15(4,AWSAPTR),REGFLCCA(LCCAPTR)                 0351 00089000
*   SVCR0R1=R0R1LCCA;                                              0352 00090000
         MVC   SVCR0R1(8,AWSAPTR),R0R1LCCA(LCCAPTR)                0352 00091000
*   ERRTRNAD=ADDR(RCOVJOBN);        /* CHANGE ERROR RETURN ADDRESS   */ 00092000
*                                                                  0353 00093000
         LA    ERRTRNAD,RCOVJOBN                                   0353 00094000
*   /*****************************************************************/ 00095000
*   /*                                                               */ 00096000
*   /* PICK UP THE JOBNAME                                           */ 00097000
*   /*                                                               */ 00098000
*   /*****************************************************************/ 00099000
*                                                                  0354 00100000
*   WORK1=ASCBJBNI;                 /* GET FIRST JOBNAME POINTER     */ 00101000
         L     WORK1,ASCBJBNI(,ASCBPTR)                            0354 00102000
*   IF WORK1=0 THEN                 /* CHECK FOR NO ADDRESS          */ 00103000
         SLR   @05,@05                                             0355 00104000
         CR    WORK1,@05                                           0355 00105000
         BNE   @RF00355                                            0355 00106000
*     DO;                                                          0356 00107000
*       WORK1=ASCBJBNS;             /* GET SECOND POINTER            */ 00108000
         L     WORK1,ASCBJBNS(,ASCBPTR)                            0357 00109000
*       IF WORK1=0 THEN             /* CHECK FOR GOOD ADDRESS        */ 00110000
         CR    WORK1,@05                                           0358 00111000
         BE    @RT00358                                            0358 00112000
*         GO TO SNOJBNM;            /* GO TO SET N/A                 */ 00113000
*     END;                                                         0360 00114000
*   IF JBNMTEST^=0 THEN             /* CHECK FOR VALID JOBNAME       */ 00115000
@RF00355 L     @05,JBNMTEST(,WORK1)                                0361 00116000
         LTR   @05,@05                                             0361 00117000
         BZ    @RF00361                                            0361 00118000
*     SVCJBNM=JOBNAME;              /* GOOD, SO GET IT               */ 00119000
         MVC   SVCJBNM(8,AWSAPTR),JOBNAME(WORK1)                   0362 00120000
*   ELSE                                                           0363 00121000
*SNOJBNM:                                                          0363 00122000
*     SVCJBNM=NOTAPP;               /* IT IS NO GOOD SO SET TO N/A   */ 00123000
         B     @RC00361                                            0363 00124000
@RF00361 DS    0H                                                  0363 00125000
SNOJBNM  MVC   SVCJBNM(8,AWSAPTR),@CC04600                         0363 00126000
*AHLSCDE:                                                          0364 00127000
*   ERRTRNAD=ADDR(RCOVMODN);        /* CHANGE ERROR RETURN ADDRESS   */ 00128000
@RC00361 DS    0H                                                  0364 00129000
AHLSCDE  LA    ERRTRNAD,RCOVMODN                                   0364 00130000
*   RBSECPTR=TCBRBP;                /* GET ADDRESS FOR RB            */ 00131000
         L     @05,TCBPTR                                          0365 00132000
         L     RBSECPTR,TCBRBP(,@05)                               0365 00133000
*   WORK1=RBSTAB1/16;               /* CLACULATE THE INDEX INTO THE     00134000
*                                      RB ROUTINE BRANCH TABLE       */ 00135000
         SLR   WORK1,WORK1                                         0366 00136000
         IC    WORK1,RBSTAB1(,RBSECPTR)                            0366 00137000
         SRL   WORK1,4                                             0366 00138000
*   GO TO RBTAB(WORK1);             /* BRANCH TO PROPER RB HANDLING     00139000
*                                      ROUTINE                       */ 00140000
         LR    @05,WORK1                                           0367 00141000
         SLA   @05,2                                               0367 00142000
         LA    @15,RBTABE                                          0367 00143000
         L     @05,RBTAB(@05,@15)                                  0367 00144000
         BR    @05                                                 0367 00145000
*RBERR:                                                            0368 00146000
*   SVCRBNAM=ASTER;                 /* PUT ASTERISKS IN TO INDICATE     00147000
*                                      INVALID RB CODE               */ 00148000
RBERR    MVC   SVCRBNAM(8,AWSAPTR),@CC04631                        0368 00149000
*   GO TO AHLSADDL;                 /* BRANCH TO CK FOR ADDL DATA    */ 00150000
         B     AHLSADDL                                            0369 00151000
*RBIRB:                                                            0370 00152000
*   SVCRBNAM=IRB;                   /* PUT IRB INDICATOR IN RECORD   */ 00153000
RBIRB    MVC   SVCRBNAM(8,AWSAPTR),@CC04629                        0370 00154000
*   GO TO AHLSADDL;                 /* BRANCH TO CK FOR ADDL DATA    */ 00155000
         B     AHLSADDL                                            0371 00156000
*RBEXT:                                                            0372 00157000
*   SVCRBNAM=RBEXRTNM;              /* GET THE NAME FROM THE RB      */ 00158000
RBEXT    MVC   SVCRBNAM(8,AWSAPTR),RBEXRTNM(RBSECPTR)              0372 00159000
*   IF RBEXTCK=0 THEN               /* CHECK TO SEE IF AN ERROR    0373 00160000
*                                      HANDLING ROUTINE IS IN CONTROL*/ 00161000
         CLI   RBEXTCK(RBSECPTR),0                                 0373 00162000
         BNE   @RF00373                                            0373 00163000
*     SVCEXTO=ASTER;                /* SET FIRST BYTE TO ASTERISK TO    00164000
*                                      INDICATE THAT THE ERROR     0374 00165000
*                                      HANDLING ROUTINE WAS IN     0374 00166000
*                                      CONTROL                       */ 00167000
         MVI   SVCEXTO(AWSAPTR),C'*'                               0374 00168000
*   GO TO AHLSADDL;                 /* BRANCH TO CHECK FOR ADDL DATA */ 00169000
         B     AHLSADDL                                            0375 00170000
*RBSVCT2:                                                          0376 00171000
*   IF RBCDE1=0 THEN                /* CHECK TO SEE IF WE HAVE A   0376 00172000
*                                      VALID CDE                     */ 00173000
RBSVCT2  L     @05,RBCDE1-1(,RBSECPTR)                             0376 00174000
         LA    @05,0(,@05)                                         0376 00175000
         LTR   @05,@05                                             0376 00176000
         BNZ   @RF00376                                            0376 00177000
*     SVCRBNAM=SVC2;                /* WE DONT SO PUT IN AN INDICATRO   00178000
*                                      SHOWING THAT IT WAS A TYPE 2     00179000
*                                      RESIDENT SVC                  */ 00180000
         MVC   SVCRBNAM(8,AWSAPTR),@CC04633                        0377 00181000
*   ELSE                            /* WE HAVE A CDE SO GET THE NAME    00182000
*                                      FROM THERE                    */ 00183000
*     DO;                                                          0378 00184000
         B     @RC00376                                            0378 00185000
@RF00376 DS    0H                                                  0379 00186000
*       SVCRBNAM=RBCDE1->CDNAME;    /* GET THEN NAME FROM THE CDE    */ 00187000
         L     @05,RBCDE1-1(,RBSECPTR)                             0379 00188000
         MVC   SVCRBNAM(8,AWSAPTR),CDNAME(@05)                     0379 00189000
*       SVCDOLY=SVCOVLY;            /* OVERLAY WITH SVC-             */ 00190000
         MVC   SVCDOLY(4,AWSAPTR),@CC04635                         0380 00191000
*     END;                                                         0381 00192000
*   GO TO AHLSADDL;                 /* BRANCH TO CHECK FOR MORE DATA */ 00193000
         B     AHLSADDL                                            0382 00194000
*RBSVCR:                                                           0383 00195000
*   IF RBCDE1=0 THEN                /* CHECK TO SEE IF WE HAVE A CDE    00196000
*                                      ADDRESS                       */ 00197000
RBSVCR   L     @05,RBCDE1-1(,RBSECPTR)                             0383 00198000
         LA    @05,0(,@05)                                         0383 00199000
         LTR   @05,@05                                             0383 00200000
         BNZ   @RF00383                                            0383 00201000
*     SVCRBNAM=SVCR;                /* NO, SO PUT IN THE RESIDENT  0384 00202000
*                                      INDICATOR                     */ 00203000
         MVC   SVCRBNAM(8,AWSAPTR),@CC04637                        0384 00204000
*   ELSE                            /* HAVE A CDE ADDRESS SO GET THE    00205000
*                                      NAME FROM THE LPDE            */ 00206000
*     DO;                                                          0385 00207000
         B     @RC00383                                            0385 00208000
@RF00383 DS    0H                                                  0386 00209000
*       SVCRBNAM=RBCDE1->LPDENAME;  /* THIS TIME THE CDE ADDRESS   0386 00210000
*                                      ACTUALLY POINTS TO AN LPDE    */ 00211000
         L     @05,RBCDE1-1(,RBSECPTR)                             0386 00212000
         MVC   SVCRBNAM(8,AWSAPTR),LPDENAME(@05)                   0386 00213000
*       SVCDOLY=SVCOVLY;            /* OVERLAY WITH SVC-             */ 00214000
         MVC   SVCDOLY(4,AWSAPTR),@CC04635                         0387 00215000
*     END;                                                         0388 00216000
*   GO TO AHLSADDL;                                                0389 00217000
         B     AHLSADDL                                            0389 00218000
*RBCDENM:                                                          0390 00219000
*   IF RBCDE1=0 THEN                /* CHECK FOR A VALID CDE ADDRESS */ 00220000
RBCDENM  L     @05,RBCDE1-1(,RBSECPTR)                             0390 00221000
         LA    @05,0(,@05)                                         0390 00222000
         LTR   @05,@05                                             0390 00223000
         BNZ   @RF00390                                            0390 00224000
*     SVCRBNAM=NOTAPP;              /* THERE ISNT ONE SO PUT IN THE     00225000
*                                      NOT APPLICABLE INDICATOR      */ 00226000
         MVC   SVCRBNAM(8,AWSAPTR),@CC04600                        0391 00227000
*   ELSE                            /* WE HAVE A CDE ADDRESS SO GET     00228000
*                                      THE NAME FROM THERE           */ 00229000
*     SVCRBNAM=RBCDE1->CDNAME;      /* GET THE NAME FROM THE CDE     */ 00230000
         B     @RC00390                                            0392 00231000
@RF00390 L     @05,RBCDE1-1(,RBSECPTR)                             0392 00232000
         MVC   SVCRBNAM(8,AWSAPTR),CDNAME(@05)                     0392 00233000
*AHLSADDL:                                                         0393 00234000
*   ERRTRNAD=0;                     /* INDICATE CATASTROPHIC ERROR 0393 00235000
*                                      AREA                          */ 00236000
@RC00390 DS    0H                                                  0393 00237000
AHLSADDL SLR   ERRTRNAD,ERRTRNAD                                   0393 00238000
*   IF FLCSVCN=<MAXSVC THEN         /* CHECK FOR AN SVC OVER THE   0394 00239000
*                                      GREATEST NUMBER POSSIBLE      */ 00240000
         LH    @05,FLCSVCN                                         0394 00241000
         C     @05,@CF04621                                        0394 00242000
         BH    @RF00394                                            0394 00243000
*     DO;                                                          0395 00244000
*       WORK2=SVCNOTAB(FLCSVCN);    /* GET INDEX INTO THE BRANCH   0396 00245000
*                                      TABLE                         */ 00246000
         LA    @15,SVCNUTAB                                        0396 00247000
         SLR   WORK2,WORK2                                         0396 00248000
         IC    WORK2,SVCNOTAB(@05,@15)                             0396 00249000
*       LCCAPTR=PSALCCAV;           /* RESTORE LCCA ADDR FOR ADDL  0397 00250000
*                                      SVCS                          */ 00251000
         L     LCCAPTR,PSALCCAV                                    0397 00252000
*       GO TO SVCROUTN(WORK2);      /* BR TO THE PROPER ROUTINE TO 0398 00253000
*                                      HANDLE THE ADDL DATA          */ 00254000
         LR    @05,WORK2                                           0398 00255000
         SLA   @05,2                                               0398 00256000
         L     @05,SVCROUTN-4(@05)                                 0398 00257000
         BR    @05                                                 0398 00258000
*     END;                                                         0399 00259000
*AHLSVSTK:                                                         0400 00260000
*   DO;                             /* AHLSTACK DLENGTH(RECLGTH)AID(A   00261000
*                                      IDC)FID(FIDC)                 */ 00262000
*                                                                  0400 00263000
@RF00394 DS    0H                                                  0400 00264000
AHLSVSTK DS    0H                                                  0401 00265000
*     /***************************************************************/ 00266000
*     /*                                                             */ 00267000
*     /* THE FOLLOWING CODE IS GENERATED BY THE AHLSTACK MACRO. THIS */ 00268000
*     /* CODE BUILDS THE GTF RECORD PREFIX AND THEN CALLS AHLSBLOK TO*/ 00269000
*     /* STACK THE RECORD.                                           */ 00270000
*     /*                                                             */ 00271000
*     /***************************************************************/ 00272000
*                                                                  0401 00273000
*     DCL                                                          0401 00274000
*       1 AHLGREC INT BASED(AHLRECPR) BDY(WORD),/* MAPPING FOR RECORD   00275000
*                                      PREFIX                        */ 00276000
*        2 AHLGLGTH PTR(16),        /* LENGTH OF RECORD PLUS PREFIX  */ 00277000
*        2 AHLGRES PTR(16),         /* FOR COMPATIBILITY TO QSAM     */ 00278000
*        2 AHLGAID PTR(8),          /* APPLICATION ID                */ 00279000
*        2 AHLGFID PTR(8),          /* FORMAT APPENDAGE ID           */ 00280000
*        2 AHLGTST CHAR(8),         /* TIMESTAMP IF SPECIFIED        */ 00281000
*         3 AHLGEIDS PTR(16) BDY(BYTE),/* RECORD EVENT IDENTIFIER IF    00282000
*                                      NO TIMESTAMP                  */ 00283000
*        2 AHLGEIDL PTR(16);        /* RECORD EVENT IDENTIFIER WITH     00284000
*                                      TIMESTAMP                     */ 00285000
*     DCL                                                          0402 00286000
*       AHLRECPR PTR(31) REG(1),    /* USED AS POINTER TO RECORD   0402 00287000
*                                      PREFIX AREA                   */ 00288000
*       AHLSBREG PTR(31) REG(14),   /* USED TO HOLD A STABLE COPY OF    00289000
*                                      THE SBLOKRTN FIELD IN THE   0402 00290000
*                                      GTFPCT                        */ 00291000
*       AHLRETCD PTR(31) REG(15);   /* USED TO PASS RETURN CODE TO 0402 00292000
*                                      INVOKER                       */ 00293000
*     DCL                                                          0403 00294000
*       AHLSBLOK ENTRY OPTIONS(NOEXIT,SEQFLOW,REFS(MCAWSA),SETS(   0403 00295000
*           AHLRETCD),NOFLOWS) BASED(AHLSBREG) VALRG(0);/* ENTRY FOR    00296000
*                                      AHLSBLOK                      */ 00297000
*     RFY                                                          0404 00298000
*      (AHLRECPR,                                                  0404 00299000
*       AHLSBREG,                                                  0404 00300000
*       AHLRETCD) RSTD;                                            0404 00301000
*     IF OPTTIME='1'B THEN          /* CHECK FOR TIMESTAMP REQUESTED */ 00302000
         TM    OPTTIME(PCTPTR),B'00000001'                         0405 00303000
         BNO   @RF00405                                            0405 00304000
*       DO;                         /* YES, TIMESTAMP                */ 00305000
*         AHLRECPR=ADDR(MCARECPR);  /* SETUP ADDRESSIBILITY TO PREFIX   00306000
*                                      FOR PREFIX WITH TIMESTAMP     */ 00307000
         LA    AHLRECPR,MCARECPR(,AWSAPTR)                         0407 00308000
*         AHLGLGTH=RECLGTH+16;      /* SET LENGTH TO INCLUDE ***   0408 00309000
*                                      DLENGTH *** PLUS TIMESTAMP  0408 00310000
*                                      PREFIX                        */ 00311000
         LA    @05,16                                              0408 00312000
         ALR   @05,RECLGTH                                         0408 00313000
         STH   @05,AHLGLGTH(,AHLRECPR)                             0408 00314000
*         GEN(STCK AHLGTST(AHLRECPR) PUT TOD CLOCK VALUE INTO PREFIX )  00315000
*         SETS(AHLGTST) NOEXIT SEQFLOW NOFLOWS;                    0409 00316000
         STCK AHLGTST(AHLRECPR) PUT TOD CLOCK VALUE INTO PREFIX         00317000
*         AHLGEIDL=MCAMCR->MCREID;  /* *** EID *** NOT SPECIFIED PUT    00318000
*                                      DEFAULT INTO PREFIX           */ 00319000
         L     @05,MCAMCR(,AWSAPTR)                                0410 00320000
         MVC   AHLGEIDL(2,AHLRECPR),MCREID(@05)                    0410 00321000
*       END;                                                       0411 00322000
*     ELSE                          /* NO TIMESTAMP TO BE DONE, BUILD   00323000
*                                      SHORT PREFIX                  */ 00324000
*       DO;                                                        0412 00325000
         B     @RC00405                                            0412 00326000
@RF00405 DS    0H                                                  0413 00327000
*         AHLRECPR=ADDR(MCARECPR)+8;/* SETUP ADDRESSIBILITY TO FOR 0413 00328000
*                                      SHORT PREFIX WITHOUT TIMESTAMP*/ 00329000
         LA    @05,8                                               0413 00330000
         LA    AHLRECPR,MCARECPR(,AWSAPTR)                         0413 00331000
         ALR   AHLRECPR,@05                                        0413 00332000
*         AHLGLGTH=RECLGTH+8;       /* PUT TOTAL RECORD LENGTH INTO     00333000
*                                      PREFIX *** DLENGTH *** PLUS 0414 00334000
*                                      PREFIX LENGTH                 */ 00335000
         ALR   @05,RECLGTH                                         0414 00336000
         STH   @05,AHLGLGTH(,AHLRECPR)                             0414 00337000
*         AHLGEIDS=MCAMCR->MCREID;  /* *** EID *** NOT SPECIFIED PUT    00338000
*                                      DEFAULT INTO PREFIX           */ 00339000
         L     @05,MCAMCR(,AWSAPTR)                                0415 00340000
         MVC   AHLGEIDS(2,AHLRECPR),MCREID(@05)                    0415 00341000
*       END;                                                       0416 00342000
*     AHLGRES=0;                    /* ZERO OUT FOR QSAM           0417 00343000
*                                      COMPATIBILITY                 */ 00344000
@RC00405 SLR   @05,@05                                             0417 00345000
         STH   @05,AHLGRES(,AHLRECPR)                              0417 00346000
*     AHLGAID=AIDC;                 /* PUT *** AID *** INTO PREFIX   */ 00347000
         MVI   AHLGAID(AHLRECPR),X'FF'                             0418 00348000
*     AHLGFID=FIDC;                 /* PUT *** FID *** INTO PREFIX   */ 00349000
         MVI   AHLGFID(AHLRECPR),X'01'                             0419 00350000
*     AHLRETCD=4;                   /* SET DEFAULT RETURN CODE       */ 00351000
         LA    AHLRETCD,4                                          0420 00352000
*     AHLSBREG=SBLOKRTN;            /* GET A STABLE COPY OF AHLSBLOK    00353000
*                                      ADDR                          */ 00354000
         L     AHLSBREG,SBLOKRTN(,PCTPTR)                          0421 00355000
*     IF AHLSBREG^=0 THEN           /* CHECK TO SEE IF AHLSBLOK IS 0422 00356000
*                                      AVAILABLE                     */ 00357000
         CR    AHLSBREG,@05                                        0422 00358000
         BE    @RF00422                                            0422 00359000
*       CALL AHLSBLOK;              /* YES, SO CALL AHLSBLOK TO BLOCK   00360000
*                                      RECORD                        */ 00361000
         LR    @15,AHLSBREG                                        0423 00362000
         BALR  @14,@15                                             0423 00363000
*     RFY                                                          0424 00364000
*      (AHLRECPR,                                                  0424 00365000
*       AHLSBREG,                                                  0424 00366000
*       AHLRETCD) UNRSTD;                                          0424 00367000
@RF00422 DS    0H                                                  0425 00368000
*   END;                                                           0425 00369000
*   RFY                                                            0426 00370000
*     R14 RSTD;                                                    0426 00371000
*ENDSVC:                                                           0427 00372000
*   R14=SVR14NRM;                   /* RESTORE RETURN ADDRESS        */ 00373000
ENDSVC   L     R14,SVR14NRM(,FRRPARM)                              0427 00374000
*   MCATRL8=0;                      /* RESET SVC16 FLAG      @YM04524*/ 00375000
         MVI   MCATRL8(AWSAPTR),X'00'                              0428 00376000
*   GEN;                                                           0429 00377000
   SETFRR D,WRKREGS=(FRRPARM,WORK1)                                     00378000
*   RETURN;                                                        0430 00379000
@EL00001 DS    0H                                                  0430 00380000
@EF00001 DS    0H                                                  0430 00381000
@ER00001 BR    @14                                                 0430 00382000
*   RFY                                                            0431 00383000
*     R14 UNRSTD;                                                  0431 00384000
*                                                                  0432 00385000
*/********************************************************************/ 00386000
*/*                                                                  */ 00387000
*/*             FINISH BUILDING SVC 0 , 92 , 114                     */ 00388000
*/*                                                                  */ 00389000
*/********************************************************************/ 00390000
*                                                                  0432 00391000
*AHLS0:                                                            0432 00392000
*   ERRTRNAD=ADDR(RCOV0A);          /* SET ERROR RETURN ADDRESS      */ 00393000
AHLS0    LA    ERRTRNAD,RCOV0A                                     0432 00394000
*   PARMPTR=REG1LCCA;               /* PICK UP PTR TO IOB            */ 00395000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0433 00396000
*   SCKPTR=ADDR(PARMPTR->IOBDCBPT); /* GET ADDR OF AREA TO BE CHKED  */ 00397000
         LA    @05,IOBDCBPT(,PARMPTR)                              0434 00398000
         ST    @05,SCKPTR(,AWSAPTR)                                0434 00399000
*   SCKLEN=LENGTH(DCBAD0);          /* GET LENGTH OF AREA TO BE FREED*/ 00400000
         MVC   SCKLEN(4,AWSAPTR),@CF00055                          0435 00401000
*   CALL SCK;                                                      0436 00402000
         BAL   @14,SCK                                             0436 00403000
*   DCBPTR=PARMPTR->IOBDCBPT;       /* PICK UP DCB ADDR              */ 00404000
         L     DCBPTR,IOBDCBPT(,PARMPTR)                           0437 00405000
*AHLS0A:                                                           0438 00406000
*   DCBAD0=DCBPTR;                  /* DCB ADDR INTO RECORD          */ 00407000
AHLS0A   STCM  DCBPTR,15,DCBAD0(AWSAPTR)                           0438 00408000
*   RECLGTH=RECLGTH+LENGTH(DCBAD0); /* UPDATE STACK RECLGTH          */ 00409000
         LA    @05,4                                               0439 00410000
         ALR   RECLGTH,@05                                         0439 00411000
*   ERRTRNAD=ADDR(RCOV0B);          /* RESET ERROR RETURN ADDR       */ 00412000
         LA    ERRTRNAD,RCOV0B                                     0440 00413000
*   SCKPTR=ADDR(DCBDEBAD);          /* GET AREA TO BE CHKED          */ 00414000
         LA    @15,DCBDEBAD+40(,DCBPTR)                            0441 00415000
         ST    @15,SCKPTR(,AWSAPTR)                                0441 00416000
*   SCKLEN=LENGTH(DEBAD0);          /* GET LENGTH OF AREA            */ 00417000
         ST    @05,SCKLEN(,AWSAPTR)                                0442 00418000
*   CALL SCK;                                                      0443 00419000
         BAL   @14,SCK                                             0443 00420000
*   DEBAD0=DCBDEBAD;                /* DEB ADDR FROM DCB             */ 00421000
         MVC   DEBAD0(4,AWSAPTR),DCBDEBAD+40(DCBPTR)               0444 00422000
*   RECLGTH=RECLGTH+LENGTH(DEBAD0); /* UPDATE STACK RECLGTH          */ 00423000
         AL    RECLGTH,@CF00055                                    0445 00424000
*   ERRTRNAD=ADDR(RCOVNAME);        /* SET RETURN TO MOVE ASTERISKS     00425000
*                                      INTO DDNAME FIELD             */ 00426000
         LA    ERRTRNAD,RCOVNAME                                   0446 00427000
*   GO TO SVDDNCK;                  /* CHECK FOR, AND GET IF THERE,     00428000
*                                      THE DDNAME                    */ 00429000
         B     SVDDNCK                                             0447 00430000
*                                                                  0448 00431000
*/********************************************************************/ 00432000
*/*                                                                  */ 00433000
*/*             FINISH BUILDING SVC 1                                */ 00434000
*/*                                                                  */ 00435000
*/********************************************************************/ 00436000
*                                                                  0448 00437000
*AHLS1:                                                            0448 00438000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SET ERROR RECOVERY ENTRY      */ 00439000
AHLS1    LA    ERRTRNAD,RCOVPLST                                   0448 00440000
*   PARMPTR=REG1LCCA;               /* PICK UP PARMLIST PTR FROM R1     00441000
*                                      SAVE AREA                     */ 00442000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0449 00443000
*   RECPTR=ADDR(SVCADDL);           /* SET PTR TO NEXT POS IN RECORD    00444000
*                                                            @YM03653*/ 00445000
         LA    RECPTR,SVCADDL(,AWSAPTR)                            0450 00446000
*   IF PARMTST=0 THEN               /* CHECK FOR NO ECBS             */ 00447000
         LTR   PARMTST,PARMTST                                     0451 00448000
         BNZ   @RF00451                                            0451 00449000
*     DO;                                                          0452 00450000
*       PARMSLEN=0;                 /* INDICATE NO ECBS              */ 00451000
         MVI   PARMSLEN(RECPTR),X'00'                              0453 00452000
*       RECLGTH=RECLGTH+LENGTH(PARMSLEN);/* UPDATE RECORD LENGTH     */ 00453000
         AL    RECLGTH,@CF00063                                    0454 00454000
*       GO TO AHLSVSTK;             /* RETURN                        */ 00455000
         B     AHLSVSTK                                            0455 00456000
*     END;                                                         0456 00457000
*   IF PARMTST<0 THEN                                              0457 00458000
@RF00451 LTR   PARMTST,PARMTST                                     0457 00459000
         BM    @RT00457                                            0457 00460000
*     GO TO AHLS1A;                 /* IF REG 1 AT INTERRUPT IS    0458 00461000
*                                      NEGATIVE, THE LIST IS VARIABLE   00462000
*                                      LENGTH                        */ 00463000
*                                                                  0458 00464000
*   /*****************************************************************/ 00465000
*   /*                                                               */ 00466000
*   /* ONE ECB IN PARAMETER LIST - STORE INTO RECORD                 */ 00467000
*   /*                                                               */ 00468000
*   /*****************************************************************/ 00469000
*                                                                  0459 00470000
*AHLS1B:                                                           0459 00471000
*   RECPARM(1:4)=PARMPTR;           /* STORE ECB ADDR INTO RECORD    */ 00472000
AHLS1B   STCM  PARMPTR,15,RECPARM(RECPTR)                          0459 00473000
*   TEMPLEN=LENGTH(PARM);           /* UPDATE TEMPORARY LEN          */ 00474000
         LA    TEMPLEN,4                                           0460 00475000
*AHLS1C:                                                           0461 00476000
*   PARMSLEN=TEMPLEN;               /* PLACE LENGTH INTO RECORD      */ 00477000
AHLS1C   STC   TEMPLEN,PARMSLEN(,RECPTR)                           0461 00478000
*   RECLGTH=RECLGTH+TEMPLEN+LENGTH(PARMSLEN);/* UPDATE STACK       0462 00479000
*                                      PARAMETER LSIT                */ 00480000
         LR    @05,RECLGTH                                         0462 00481000
         ALR   @05,TEMPLEN                                         0462 00482000
         AL    @05,@CF00063                                        0462 00483000
         LR    RECLGTH,@05                                         0462 00484000
*   GO TO AHLSVSTK;                 /* FINISHED                      */ 00485000
         B     AHLSVSTK                                            0463 00486000
*AHLS1A:                                                           0464 00487000
*   PARMPTR=-PARMPTR;               /* COMPLEMENT LIST ADDRESS       */ 00488000
AHLS1A   LCR   PARMPTR,PARMPTR                                     0464 00489000
*   RECPTR=PARMPTR;                 /* GET RECPTR INIT TO THE FIRST     00490000
*                                      ECB                           */ 00491000
         LR    RECPTR,PARMPTR                                      0465 00492000
*AHLS1D:                                                           0466 00493000
*   DO TEMPLEN=LENGTH(PARM) TO MAXDYN BY LENGTH(PARM);             0466 00494000
AHLS1D   LA    TEMPLEN,4                                           0466 00495000
@DL00466 DS    0H                                                  0467 00496000
*     IF ENDIT1=ON THEN                                            0467 00497000
         TM    ENDIT1(RECPTR),B'10000000'                          0467 00498000
         BO    @RT00467                                            0467 00499000
*       GO TO AHLS1E;                                              0468 00500000
*     RECPTR=RECPTR+LENGTH(PARM);   /* UPDATE RECPTR TO POINT TO THE    00501000
*                                      NEXT ECB                      */ 00502000
         AL    RECPTR,@CF00055                                     0469 00503000
*   END;                                                           0470 00504000
         AL    TEMPLEN,@CF00055                                    0470 00505000
         C     TEMPLEN,@CF02274                                    0470 00506000
         BNH   @DL00466                                            0470 00507000
*   TEMPLEN=TEMPLEN-LENGTH(PARM);                                  0471 00508000
         SL    TEMPLEN,@CF00055                                    0471 00509000
*AHLS1E:                                                           0472 00510000
*   SCKPTR=PARMPTR;                 /* GET ADDR OF AREA TO BE CHKED  */ 00511000
AHLS1E   ST    PARMPTR,SCKPTR(,AWSAPTR)                            0472 00512000
*   SCKLEN=TEMPLEN;                 /* GET LENGTH OF AREA            */ 00513000
         ST    TEMPLEN,SCKLEN(,AWSAPTR)                            0473 00514000
*   CALL SCK;                                                      0474 00515000
         BAL   @14,SCK                                             0474 00516000
*   RECPTR=ADDR(MCAREC)+RECLGTH;    /* POINT TO NEXT POS IN RECORD   */ 00517000
         LA    RECPTR,MCAREC(,AWSAPTR)                             0475 00518000
         ALR   RECPTR,RECLGTH                                      0475 00519000
*   RECPARM(1:TEMPLEN)=PARMS;       /* MOVE IN ENTIRE PLIST          */ 00520000
         LR    @05,TEMPLEN                                         0476 00521000
         BCTR  @05,0                                               0476 00522000
         EX    @05,@SM05738                                        0476 00523000
*   GO TO AHLS1C;                                                  0477 00524000
         B     AHLS1C                                              0477 00525000
*                                                                  0478 00526000
*   /*****************************************************************/ 00527000
*   /*                                                               */ 00528000
*   /* FINISH BUILDING SVC 2                                         */ 00529000
*   /*                                                               */ 00530000
*   /*****************************************************************/ 00531000
*                                                                  0478 00532000
*AHLS2:                                                            0478 00533000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP RECOVERY ENTRY ADDRESS  */ 00534000
AHLS2    LA    ERRTRNAD,RCOVPLST                                   0478 00535000
*   PARMPTR=REG1LCCA;               /* PICK UP PLIST ADDR FROM REGS     00536000
*                                      AT HOOK                       */ 00537000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0479 00538000
*   IF PARMTST<0 THEN               /* CHECK TO SEE IF THERE IS A  0480 00539000
*                                      PLIST                         */ 00540000
         LTR   PARMTST,PARMTST                                     0480 00541000
         BNM   @RF00480                                            0480 00542000
*     DO;                           /* YES SO GATHER IT              */ 00543000
*       SCKPTR=ADDR(PLISTA2);                                      0482 00544000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0482 00545000
*       SCKLEN=LENGTH(PLISTA2);                                    0483 00546000
         MVC   SCKLEN(4,AWSAPTR),@CF04459                          0483 00547000
*       CALL SCK;                                                  0484 00548000
         BAL   @14,SCK                                             0484 00549000
*       PLIST2=PLISTA2;             /* PICK UP PLIST                 */ 00550000
         MVC   PLIST2(12,AWSAPTR),PLISTA2(PARMPTR)                 0485 00551000
*       PLEN2=LENGTH(PLIST2);       /* UPDATE LENGTH BYTE            */ 00552000
         MVI   PLEN2(AWSAPTR),X'0C'                                0486 00553000
*       RECLGTH=RECLGTH+LENGTH(PLIST2)+LENGTH(PLEN2);/* UPDATE RECORD   00554000
*                                      LENGTH                        */ 00555000
         AL    RECLGTH,@CF01806                                    0487 00556000
*     END;                                                         0488 00557000
*   ELSE                            /* THERE IS NO PLIST             */ 00558000
*     DO;                           /* SET LENGTH TO ZERO            */ 00559000
         B     @RC00480                                            0489 00560000
@RF00480 DS    0H                                                  0490 00561000
*       ERRTRNAD=NULL;              /* INDICATE CATASTROPHIC ERROR 0490 00562000
*                                      AREA                          */ 00563000
         SLR   ERRTRNAD,ERRTRNAD                                   0490 00564000
*       PLEN2=0;                                                   0491 00565000
         MVI   PLEN2(AWSAPTR),X'00'                                0491 00566000
*       RECLGTH=RECLGTH+LENGTH(PLEN2);/* UPDATE RECORD LENGTH        */ 00567000
         AL    RECLGTH,@CF00063                                    0492 00568000
*     END;                                                         0493 00569000
*AHLS2A:                                                           0494 00570000
*   GO TO AHLSVSTK;                 /* BRANCH TO STACK THE RECORD AND   00571000
*                                      END                           */ 00572000
         B     AHLSVSTK                                            0494 00573000
*                                                                  0495 00574000
*/********************************************************************/ 00575000
*/*                                                                  */ 00576000
*/*             FINISH BUILDING SVC 4 , 5                            */ 00577000
*/*                                                                  */ 00578000
*/********************************************************************/ 00579000
*                                                                  0495 00580000
*AHLS4:                                                            0495 00581000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY TABLE  0495 00582000
*                                      ENTRY                         */ 00583000
AHLS4    LA    ERRTRNAD,RCOVPLST                                   0495 00584000
*   PARMPTR=REG1LCCA;               /* PICK UP PARMLIST PTR          */ 00585000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0496 00586000
*   IF PARMTST=NULL THEN                                           0497 00587000
         LTR   PARMTST,PARMTST                                     0497 00588000
         BNZ   @RF00497                                            0497 00589000
*     LEN4=NULL;                    /* INDICATE THAT THERE IS NO   0498 00590000
*                                      PLIST                         */ 00591000
         MVI   LEN4(AWSAPTR),X'00'                                 0498 00592000
*   ELSE                                                           0499 00593000
*     DO;                           /* THERE IS A NORMAL PLIST       */ 00594000
         B     @RC00497                                            0499 00595000
@RF00497 DS    0H                                                  0500 00596000
*       SCKPTR=ADDR(PARMLST4);                                     0500 00597000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0500 00598000
*       SCKLEN=LENGTH(PARMLST4);                                   0501 00599000
         MVC   SCKLEN(4,AWSAPTR),@CF04642                          0501 00600000
*       CALL SCK;                                                  0502 00601000
         BAL   @14,SCK                                             0502 00602000
*       PARM4=PARMLST4;             /* PICK UP THE PLIST             */ 00603000
         MVC   PARM4(10,AWSAPTR),PARMLST4(PARMPTR)                 0503 00604000
*       LEN4=LENGTH(PARM4);         /* FILL IN THE LENGTH FIELD      */ 00605000
         MVI   LEN4(AWSAPTR),X'0A'                                 0504 00606000
*     END;                                                         0505 00607000
*   RECLGTH=RECLGTH+LEN4+LENGTH(LEN4);/* UPDATE THE RECORD LENGTH    */ 00608000
@RC00497 LR    @05,RECLGTH                                         0506 00609000
         SLR   @15,@15                                             0506 00610000
         IC    @15,LEN4(,AWSAPTR)                                  0506 00611000
         ALR   @05,@15                                             0506 00612000
         AL    @05,@CF00063                                        0506 00613000
         LR    RECLGTH,@05                                         0506 00614000
*   GO TO AHLSVSTK;                 /* FINISHED -OUTPUT AND RETURN   */ 00615000
         B     AHLSVSTK                                            0507 00616000
*                                                                  0508 00617000
*/********************************************************************/ 00618000
*/*                                                                  */ 00619000
*/*             FINISH BUILDING SVC 6                                */ 00620000
*/*                                                                  */ 00621000
*/********************************************************************/ 00622000
*                                                                  0508 00623000
*AHLS6:                                                            0508 00624000
*   ERRTRNAD=ADDR(RCOV6A);          /* SET ERROR RETURN ADDR TO CODE    00625000
*                                      TO PLACE 16 ** IN RECORD      */ 00626000
AHLS6    LA    ERRTRNAD,RCOV6A                                     0508 00627000
*   PARMPTR=REGFLCCA;               /* PICK UP PTR TO PLIST          */ 00628000
         L     PARMPTR,REGFLCCA(,LCCAPTR)                          0509 00629000
*   SCKPTR=ADDR(LSTSV6);                                           0510 00630000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0510 00631000
*   SCKLEN=LENGTH(LSTSV6);                                         0511 00632000
         MVC   SCKLEN(4,AWSAPTR),@CF04459                          0511 00633000
*   CALL SCK;                                                      0512 00634000
         BAL   @14,SCK                                             0512 00635000
*   SVLST6=LSTSV6;                  /* PLACE 12 BYTE PARMLIST INTO 0513 00636000
*                                      RECORD                        */ 00637000
         MVC   SVLST6(12,AWSAPTR),LSTSV6(PARMPTR)                  0513 00638000
*   RECLGTH=RECLGTH+LENGTH(SVLST6); /* UPDATE STACK MSG LNGTH        */ 00639000
         AL    RECLGTH,@CF04459                                    0514 00640000
*   ERRTRNAD=ADDR(RCOV6B);          /* SET RETURN ADDR IN CASE OF  0515 00641000
*                                      ERROR                         */ 00642000
         LA    ERRTRNAD,RCOV6B                                     0515 00643000
*   PARMPTR=EPDENMA6;               /* PICK UP PTR TO THE NAME       */ 00644000
         SLR   PARMPTR,PARMPTR                                     0516 00645000
         ICM   PARMPTR,7,EPDENMA6(AWSAPTR)                         0516 00646000
*   EPDENM6=EPDE6;                  /* PLACE NAME IN RECORD          */ 00647000
         MVC   EPDENM6(8,AWSAPTR),EPDE6(PARMPTR)                   0517 00648000
*AHLS6B:                                                           0518 00649000
*   RECLGTH=RECLGTH+LENGTH(EPDENM6);/* UPDATE STACK MSG LEN          */ 00650000
AHLS6B   AL    RECLGTH,@CF00061                                    0518 00651000
*   GO TO AHLSVSTK;                                                0519 00652000
         B     AHLSVSTK                                            0519 00653000
*                                                                  0520 00654000
*/********************************************************************/ 00655000
*/*                                                                  */ 00656000
*/*             FINISH BUILDING SVC 7                                */ 00657000
*/*                                                                  */ 00658000
*/********************************************************************/ 00659000
*                                                                  0520 00660000
*AHLS7:                                                            0520 00661000
*   ERRTRNAD=ADDR(RCOV7A);          /* SET ERROR RETURN ADDR TO CODE    00662000
*                                      TO PLACE 16 ** IN RECORD      */ 00663000
AHLS7    LA    ERRTRNAD,RCOV7A                                     0520 00664000
*   PARMPTR=REGFLCCA;               /* PICK UP PTR TO LIST           */ 00665000
         L     PARMPTR,REGFLCCA(,LCCAPTR)                          0521 00666000
*   SCKPTR=ADDR(LSTSV7);                                           0522 00667000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0522 00668000
*   SCKLEN=LENGTH(LSTSV7);                                         0523 00669000
         MVC   SCKLEN(4,AWSAPTR),@CF00061                          0523 00670000
*   CALL SCK;                                                      0524 00671000
         BAL   @14,SCK                                             0524 00672000
*   SVLST7=LSTSV7;                  /* PLACE 8 BYTE PARMLIST INTO  0525 00673000
*                                      RECORD                        */ 00674000
         MVC   SVLST7(8,AWSAPTR),LSTSV7(PARMPTR)                   0525 00675000
*   RECLGTH=RECLGTH+LENGTH(SVLST7); /* UPDATE STACK MSG LNGTH        */ 00676000
         LA    @05,8                                               0526 00677000
         ALR   RECLGTH,@05                                         0526 00678000
*   ERRTRNAD=ADDR(RCOV7B);          /* SET RETURN ADDR IN CASE OF  0527 00679000
*                                      ERROR                         */ 00680000
         LA    ERRTRNAD,RCOV7B                                     0527 00681000
*   PARMPTR=EPDENMA7;                                              0528 00682000
         SLR   PARMPTR,PARMPTR                                     0528 00683000
         ICM   PARMPTR,7,EPDENMA7(AWSAPTR)                         0528 00684000
*   SCKPTR=ADDR(EPDE7);                                            0529 00685000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0529 00686000
*   SCKLEN=LENGTH(EPDE7);                                          0530 00687000
         ST    @05,SCKLEN(,AWSAPTR)                                0530 00688000
*   CALL SCK;                                                      0531 00689000
         BAL   @14,SCK                                             0531 00690000
*   EPDENM7=EPDE7;                  /* PLACE NAME IN RECORD          */ 00691000
         MVC   EPDENM7(8,AWSAPTR),EPDE7(PARMPTR)                   0532 00692000
*   RECLGTH=RECLGTH+LENGTH(EPDENM7);/* UPDATE STACK MSG LEN          */ 00693000
         AL    RECLGTH,@CF00061                                    0533 00694000
*   GO TO AHLSVSTK;                                                0534 00695000
         B     AHLSVSTK                                            0534 00696000
*                                                                  0535 00697000
*/********************************************************************/ 00698000
*/*                                                                  */ 00699000
*/*             FINISH BUILDING SVC 8 , 41                           */ 00700000
*/*                                                                  */ 00701000
*/********************************************************************/ 00702000
*                                                                  0535 00703000
*AHLS8:                                                            0535 00704000
*   ERRTRNAD=ADDR(RCOVNAME);        /* SET RETURN IN CASE OF ERROR   */ 00705000
AHLS8    LA    ERRTRNAD,RCOVNAME                                   0535 00706000
*   PARMPTR=REG0LCCA;               /* GET ADDR NAME FROM R0 SAVE  0536 00707000
*                                      AREA AND ENSURE POSITIVE      */ 00708000
         L     PARMPTR,REG0LCCA(,LCCAPTR)                          0536 00709000
*   IF SVCNO='29'X&PARMPTR=NULL THEN/* IF SVC IS 41 AND REG 0 IS 0,     00710000
*                                      NAME IS LOCATED VIA R1        */ 00711000
         CLI   SVCNO,41                                            0537 00712000
         BNE   @RF00537                                            0537 00713000
         LTR   PARMPTR,PARMPTR                                     0537 00714000
         BNZ   @RF00537                                            0537 00715000
*     DO;                                                          0538 00716000
*       PARMPTR=REG1LCCA;           /* PICK UP REGISTER 1            */ 00717000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0539 00718000
*       SCKPTR=ADDR(EPNM8C);                                       0540 00719000
         LA    @05,EPNM8C(,PARMPTR)                                0540 00720000
         ST    @05,SCKPTR(,AWSAPTR)                                0540 00721000
*       SCKLEN=LENGTH(EPNM8C);                                     0541 00722000
         MVC   SCKLEN(4,AWSAPTR),@CF00061                          0541 00723000
*       CALL SCK;                                                  0542 00724000
         BAL   @14,SCK                                             0542 00725000
*       EPNM8=EPNM8C;               /* MOVE IN NAME                  */ 00726000
         MVC   EPNM8(8,AWSAPTR),EPNM8C(PARMPTR)                    0543 00727000
*     END;                                                         0544 00728000
*   ELSE                                                           0545 00729000
*     DO;                                                          0545 00730000
         B     @RC00537                                            0545 00731000
@RF00537 DS    0H                                                  0546 00732000
*       IF SVCNO^='29'X THEN        /* IF SVC IS NOT 41      @ZA06039*/ 00733000
         CLI   SVCNO,41                                            0546 00734000
         BE    @RF00546                                            0546 00735000
*         GEN(LPR   PARMPTR,PARMPTR);/* ENSURE ADDR POSITIVE @ZA06039*/ 00736000
         LPR   PARMPTR,PARMPTR                                          00737000
*       ELSE                                                       0548 00738000
*         ;                         /*                       @ZA06039*/ 00739000
@RF00546 DS    0H                                                  0549 00740000
*AHLS8B:                                                           0549 00741000
*       SCKPTR=ADDR(EPNM8A);                                       0549 00742000
AHLS8B   ST    PARMPTR,SCKPTR(,AWSAPTR)                            0549 00743000
*       SCKLEN=LENGTH(EPNM8A);                                     0550 00744000
         MVC   SCKLEN(4,AWSAPTR),@CF00061                          0550 00745000
*       CALL SCK;                                                  0551 00746000
         BAL   @14,SCK                                             0551 00747000
*       EPNM8=EPNM8A;               /* OTHERWISE , R0 FINDS NAME     */ 00748000
         MVC   EPNM8(8,AWSAPTR),EPNM8A(PARMPTR)                    0552 00749000
*     END;                                                         0553 00750000
*AHLS8A:                                                           0554 00751000
*   RECLGTH=RECLGTH+LENGTH(EPNM8);  /* UPDATE MSG LENGTH             */ 00752000
@RC00537 DS    0H                                                  0554 00753000
AHLS8A   AL    RECLGTH,@CF00061                                    0554 00754000
*   GO TO AHLSVSTK;                 /* OUTPUT AND RETURN             */ 00755000
         B     AHLSVSTK                                            0555 00756000
*                                                                  0556 00757000
*/********************************************************************/ 00758000
*/*                                                                  */ 00759000
*/*             FINISH BUILDING SVC 9                                */ 00760000
*/*                                                                  */ 00761000
*/********************************************************************/ 00762000
*                                                                  0556 00763000
*AHLS9:                                                            0556 00764000
*   ERRTRNAD=ADDR(RCOVNAME);        /* SET RETURN IN CASE OF ERROR   */ 00765000
AHLS9    LA    ERRTRNAD,RCOVNAME                                   0556 00766000
*   PARMPTR=REG0LCCA;               /* PICK UP ADDR OF NAME          */ 00767000
         L     PARMPTR,REG0LCCA(,LCCAPTR)                          0557 00768000
*   GO TO AHLS8B;                   /* FINISH BUILDING THE RECORD    */ 00769000
         B     AHLS8B                                              0558 00770000
*                                                                  0559 00771000
*/********************************************************************/ 00772000
*/*                                                                  */ 00773000
*/*             FINISH BUILDING SVC 13                               */ 00774000
*/*                                                                  */ 00775000
*/********************************************************************/ 00776000
*                                                                  0559 00777000
*AHLS13:                                                           0559 00778000
*   ERRTRNAD=ADDR(RCOVWORD);        /* SET ERROR RETURN ADDR         */ 00779000
AHLS13   LA    ERRTRNAD,RCOVWORD                                   0559 00780000
*   TCBCC13=TCBRCMP;                /* MOVE IN COMPLETION CODE       */ 00781000
         MVI   TCBCC13+3(AWSAPTR),X'00'                            0560 00782000
         L     @05,TCBPTR                                          0560 00783000
         L     @05,TCBEXT2(,@05)                                   0560 00784000
         MVC   TCBCC13(3,AWSAPTR),TCBRCMP(@05)                     0560 00785000
*AHLS13A:                                                          0561 00786000
*   RECLGTH=RECLGTH+LENGTH(TCBCC13);/* UPDATE STACK RECORD LGTH      */ 00787000
AHLS13A  AL    RECLGTH,@CF00055                                    0561 00788000
*   GO TO AHLSVSTK;                                                0562 00789000
         B     AHLSVSTK                                            0562 00790000
*                                                                  0563 00791000
*/********************************************************************/ 00792000
*/*                                                                  */ 00793000
*/*         FINISH BUILDING SVC 14                                   */ 00794000
*/*                                                                  */ 00795000
*/********************************************************************/ 00796000
*                                                                  0563 00797000
*AHLS14:                                                           0563 00798000
*   ERRTRNAD=ADDR(RCOV14A);         /* SET ERROR RETURN ADDR         */ 00799000
AHLS14   LA    ERRTRNAD,RCOV14A                                    0563 00800000
*   PARMPTR=REG1LCCA;               /* PICK UP PTR TO PICA           */ 00801000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0564 00802000
*   SCKPTR=ADDR(PICA);                                             0565 00803000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0565 00804000
*   SCKLEN=LENGTH(PICA);                                           0566 00805000
         MVC   SCKLEN(4,AWSAPTR),@CF00919                          0566 00806000
*   CALL SCK;                                                      0567 00807000
         BAL   @14,SCK                                             0567 00808000
*   PICA14=PICA;                    /* PLACE 6 BYTE PICA INTO REC    */ 00809000
         MVC   PICA14(6,AWSAPTR),PICA(PARMPTR)                     0568 00810000
*AHLS14A:                                                          0569 00811000
*   RECLGTH=RECLGTH+LENGTH(PICA14); /* UPDATE MSG LENGTH             */ 00812000
AHLS14A  AL    RECLGTH,@CF00919                                    0569 00813000
*   GO TO AHLSVSTK;                 /* FINISHED                      */ 00814000
         B     AHLSVSTK                                            0570 00815000
*                                                                  0571 00816000
*/********************************************************************/ 00817000
*/*                                                                  */ 00818000
*/*             FINISH BUILDING SVC 15                               */ 00819000
*/*                                                                  */ 00820000
*/********************************************************************/ 00821000
*                                                                  0571 00822000
*AHLS15:                                                           0571 00823000
*   ERRTRNAD=ADDR(RCOV15A);         /* SET RETURN ADDR IN CASE OF  0571 00824000
*                                      ERROR                         */ 00825000
AHLS15   LA    ERRTRNAD,RCOV15A                                    0571 00826000
*   IOSBPTR=REG1LCCA;               /* GET ADDR OF IOSB              */ 00827000
         L     IOSBPTR,REG1LCCA(,LCCAPTR)                          0572 00828000
*   SCKPTR=ADDR(IOSFLA);                                           0573 00829000
         ST    IOSBPTR,SCKPTR(,AWSAPTR)                            0573 00830000
*   SCKLEN=LENGTH(IOSFLA);                                         0574 00831000
         MVC   SCKLEN(4,AWSAPTR),@CF00063                          0574 00832000
*   CALL SCK;                                                      0575 00833000
         BAL   @14,SCK                                             0575 00834000
*   ERRF15=IOSFLA;                  /* PICK UP ERP FLAGS             */ 00835000
         MVC   ERRF15(1,AWSAPTR),IOSFLA(IOSBPTR)                   0576 00836000
*   RECLGTH=RECLGTH+LENGTH(ERRF15); /* UPDATE STACK MSG LEN          */ 00837000
         AL    RECLGTH,@CF00063                                    0577 00838000
*   ERRTRNAD=ADDR(RCOV15B);         /* SET ERROR ADDRESS             */ 00839000
         LA    ERRTRNAD,RCOV15B                                    0578 00840000
*   UCBPTR=IOSUCB;                  /* PICK UP ADDR OF UCB           */ 00841000
         L     UCBPTR,IOSUCB(,IOSBPTR)                             0579 00842000
*   SCKPTR=ADDR(UCBCHAN);                                          0580 00843000
         LA    @05,UCBCHAN(,UCBPTR)                                0580 00844000
         ST    @05,SCKPTR(,AWSAPTR)                                0580 00845000
*   SCKLEN=LENGTH(UCBCHAN);                                        0581 00846000
         MVC   SCKLEN(4,AWSAPTR),@CF00075                          0581 00847000
*   CALL SCK;                                                      0582 00848000
         BAL   @14,SCK                                             0582 00849000
*   CUU15=UCBCHAN;                  /* PLACE CUU INTO RECORD         */ 00850000
         MVC   CUU15(2,AWSAPTR),UCBCHAN(UCBPTR)                    0583 00851000
*   RECLGTH=RECLGTH+LENGTH(CUU15);  /* UPDATE STACK MSG LENGTH       */ 00852000
         AL    RECLGTH,@CF00075                                    0584 00853000
*AHLS15C:                                                          0585 00854000
*   ERRTRNAD=ADDR(RCOV15C);         /* SET RETRY ADDRESS             */ 00855000
AHLS15C  LA    ERRTRNAD,RCOV15C                                    0585 00856000
*   WORK1=IOSSRB;                   /* GET SRB ADDR                  */ 00857000
         L     WORK1,IOSSRB(,IOSBPTR)                              0586 00858000
*   SCKPTR=ADDR(SRBPTCB);                                          0587 00859000
         LA    @05,SRBPTCB(,SRBPTR)                                0587 00860000
         ST    @05,SCKPTR(,AWSAPTR)                                0587 00861000
*   SCKLEN=LENGTH(SRBPTCB);                                        0588 00862000
         MVC   SCKLEN(4,AWSAPTR),@CF00055                          0588 00863000
*   CALL SCK;                                                      0589 00864000
         BAL   @14,SCK                                             0589 00865000
*   TCBA15=SRBPTCB;                 /* GET TCB ADDR FROM SRB         */ 00866000
         MVC   TCBA15(4,AWSAPTR),SRBPTCB(SRBPTR)                   0590 00867000
*   RECLGTH=RECLGTH+LENGTH(TCBA15); /* UPDATE LENGTH                 */ 00868000
         AL    RECLGTH,@CF00055                                    0591 00869000
*AHLS15D:                                                          0592 00870000
*   ERRTRNAD=ADDR(RCOVNAME);        /* SET RETURN ADDRESS FOR DDNCHK    00871000
*                                      ROUTINE ERROR IND             */ 00872000
AHLS15D  LA    ERRTRNAD,RCOVNAME                                   0592 00873000
*   IF DEB15^=0&DEB152='0'B THEN    /* POSS DEB              @ZA00425*/ 00874000
         ICM   @05,7,DEB15(IOSBPTR)                                0593 00875000
         BZ    @RF00593                                            0593 00876000
         TM    DEB152(IOSBPTR),B'00000001'                         0593 00877000
         BNZ   @RF00593                                            0593 00878000
*     DO;                           /*                       @ZA00425*/ 00879000
*       MCATRL8=1;                  /* TURN ON SVC1516 GATHERING DATA   00880000
*                                      BIT                   @ZA00425*/ 00881000
         MVI   MCATRL8(AWSAPTR),X'01'                              0595 00882000
*       PARMPTR=IOSDSID;            /* POTENTIAL DEB @       @ZM30921*/ 00883000
         L     PARMPTR,IOSDSID(,IOSBPTR)                           0596 00884000
*       CALL DEBCHK;                /* VALIDATE DEB          @ZM30921*/ 00885000
         BAL   @14,DEBCHK                                          0597 00886000
*       IF R15RC=NULL THEN          /* IF R15=0 THEN DEB IS VALID  0598 00887000
*                                                            @ZM30921*/ 00888000
         LTR   R15RC,R15RC                                         0598 00889000
         BNZ   @RF00598                                            0598 00890000
*         DO;                       /*                       @ZM30921*/ 00891000
*           DEBPTR=PARMPTR;         /* VALID DEB ADDR        @ZM30921*/ 00892000
         LR    DEBPTR,PARMPTR                                      0600 00893000
*           DCBPTR=DEBDCBAD;        /* PICK UP DCB @         @ZM30921*/ 00894000
         L     DCBPTR,DEBDCBAD(,DEBPTR)                            0601 00895000
*           GO TO SVDDNCK;          /* VAL AND MOVE DDN TO REC       */ 00896000
         B     SVDDNCK                                             0602 00897000
*         END;                      /*                       @ZM30921*/ 00898000
*       ELSE                                                       0604 00899000
*         GO TO AHLS15E;            /* PUT U/A INTO FIELDS FOR     0604 00900000
*                                      INVALID DEC           @ZM30921*/ 00901000
*     END;                          /*                       @ZA00425*/ 00902000
*   ELSE                                                           0606 00903000
*     DO;                           /* IF NOT DEB SET DDNAME U/A   0606 00904000
*                                                            @ZA00425*/ 00905000
@RF00593 DS    0H                                                  0607 00906000
*AHLS15E:                           /*                       @ZM30921*/ 00907000
*       DDNAME=UNAV;                /*                       @ZA00425*/ 00908000
AHLS15E  MVC   DDNAME(8,AWSAPTR),@CC04602                          0607 00909000
*       RECLGTH=RECLGTH+LENGTH(DDNAME);/*                    @ZA00425*/ 00910000
         AL    RECLGTH,@CF00061                                    0608 00911000
*       GO TO AHLSVSTK;             /*                       @ZA00425*/ 00912000
         B     AHLSVSTK                                            0609 00913000
*     END;                          /*                       @ZA00425*/ 00914000
*                                                                  0611 00915000
*/********************************************************************/ 00916000
*/*                                                                  */ 00917000
*/*             FINISH BUILDING SVC 16                               */ 00918000
*/*                                                                  */ 00919000
*/********************************************************************/ 00920000
*                                                                  0611 00921000
*AHLS16:                                                           0611 00922000
*   ERRTRNAD=ADDR(RCOV16A);         /* SET ERROR ADDR                */ 00923000
AHLS16   LA    ERRTRNAD,RCOV16A                                    0611 00924000
*   PARMPTR=REG1LCCA;               /* PICK UP PTR TO PLIST          */ 00925000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0612 00926000
*   SCKPTR=ADDR(PRMLST16);                                         0613 00927000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0613 00928000
*   SCKLEN=LENGTH(PRMLST16);                                       0614 00929000
         MVC   SCKLEN(4,AWSAPTR),@CF04459                          0614 00930000
*   CALL SCK;                                                      0615 00931000
         BAL   @14,SCK                                             0615 00932000
*   PLIST16=PRMLST16;               /* PLACE PARMLIST INTO RECORD    */ 00933000
         MVC   PLIST16(12,AWSAPTR),PRMLST16(PARMPTR)               0616 00934000
*   RECLGTH=RECLGTH+LENGTH(PLIST16);/* UPDATE STACK MSG LEN          */ 00935000
         AL    RECLGTH,@CF04459                                    0617 00936000
*   ERRTRNAD=ADDR(RCOV16B);         /* SET ERROR ADDR                */ 00937000
         LA    ERRTRNAD,RCOV16B                                    0618 00938000
*   IF DEBAD^='000000'X&DEBAD2='0'B THEN/*                   @YM04524*/ 00939000
         CLC   DEBAD(3,PARMPTR),@CB05563                           0619 00940000
         BE    @RF00619                                            0619 00941000
         TM    DEBAD2(PARMPTR),B'00000001'                         0619 00942000
         BNZ   @RF00619                                            0619 00943000
*     DO;                                                          0620 00944000
*       MCATRL8=1;                  /* SETSVC1516 GATHERING DATA BIT    00945000
*                                                            @ZA00425*/ 00946000
         MVI   MCATRL8(AWSAPTR),X'01'                              0621 00947000
*       PARMPTR=DEBAD16;            /* DEB ADDR              @ZA00425*/ 00948000
         L     PARMPTR,DEBAD16(,PARMPTR)                           0622 00949000
*       CALL DEBCHK;                /* VALIDATE DEB          @ZM30921*/ 00950000
         BAL   @14,DEBCHK                                          0623 00951000
*       IF R15RC=NULL THEN          /* R15=0 IF VALID DEB    @ZM30921*/ 00952000
         LTR   R15RC,R15RC                                         0624 00953000
         BNZ   @RF00624                                            0624 00954000
*         DO;                       /*                       @ZM30921*/ 00955000
*           SCKPTR=ADDR(PARMPTR->DEBDCBAD);/*                @YM04524*/ 00956000
         LA    @05,DEBDCBAD(,PARMPTR)                              0626 00957000
         ST    @05,SCKPTR(,AWSAPTR)                                0626 00958000
*           SCKLEN=LENGTH(DCBAD16); /*                       @YM04524*/ 00959000
         MVC   SCKLEN(4,AWSAPTR),@CF00055                          0627 00960000
*           CALL SCK;               /*                       @YM04524*/ 00961000
         BAL   @14,SCK                                             0628 00962000
*           DCBPTR=PARMPTR->DEBDCBAD;/* PICK UP ADDR OF DCB  @YM04524*/ 00963000
         L     DCBPTR,DEBDCBAD(,PARMPTR)                           0629 00964000
*           DCBAD16=DCBPTR;         /* PUT ADDR DCB IN RECORD      0630 00965000
*                                                            @YM04524*/ 00966000
         STCM  DCBPTR,15,DCBAD16(AWSAPTR)                          0630 00967000
*           RECLGTH=RECLGTH+LENGTH(DCBAD16);/*               @YM04524*/ 00968000
         AL    RECLGTH,@CF00055                                    0631 00969000
*           ERRTRNAD=ADDR(RCOVNAME);/*                       @YM04524*/ 00970000
         LA    ERRTRNAD,RCOVNAME                                   0632 00971000
*           GO TO SVDDNCK;          /*                       @YM04524*/ 00972000
         B     SVDDNCK                                             0633 00973000
*         END;                      /*                       @ZM30921*/ 00974000
*       ELSE                        /*                       @ZM30921*/ 00975000
*         GO TO AHLS16B;            /* PUT U/A IN FIELDS IF INVALID     00976000
*                                      DEB                   @ZM30921*/ 00977000
*     END;                                                         0636 00978000
*   ELSE                                                           0637 00979000
*     DO;                           /*                       @ZA00425*/ 00980000
@RF00619 DS    0H                                                  0638 00981000
*AHLS16B:                                                          0638 00982000
*       DCBAD16=UNAV;               /* PLACE U/A INTO RECORD @YM04524*/ 00983000
AHLS16B  MVC   DCBAD16(4,AWSAPTR),@CC04602                         0638 00984000
*       RECLGTH=RECLGTH+LENGTH(DCBAD16);/* UPDATE STACK MSG LEN    0639 00985000
*                                                            @YM04524*/ 00986000
         AL    RECLGTH,@CF00055                                    0639 00987000
*       ERRTRNAD=ADDR(RCOVNAME);    /* SET ERROR RTN ADDR            */ 00988000
         LA    ERRTRNAD,RCOVNAME                                   0640 00989000
*       DDNAME=UNAV;                /* DDNAME U/A            @YM04524*/ 00990000
         MVC   DDNAME(8,AWSAPTR),@CC04602                          0641 00991000
*       RECLGTH=RECLGTH+LENGTH(DDNAME);/* UPDATE MSG LENGTH  @YM04524*/ 00992000
         AL    RECLGTH,@CF00061                                    0642 00993000
*       GO TO AHLSVSTK;             /*                       @YM04524*/ 00994000
         B     AHLSVSTK                                            0643 00995000
*     END;                          /*                       @ZA00425*/ 00996000
*                                                                  0644 00997000
*   /*****************************************************************/ 00998000
*   /*                                                               */ 00999000
*   /* FINISH BUILDING SVC 17                                        */ 01000000
*   /*                                                               */ 01001000
*   /*****************************************************************/ 01002000
*                                                                  0645 01003000
*AHLS17:                                                           0645 01004000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 01005000
AHLS17   LA    ERRTRNAD,RCOVPLST                                   0645 01006000
*   PARMPTR=REG1LCCA;               /* PICK UP POINTER TO THE PLIST  */ 01007000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0646 01008000
*   IF NOPL^=NOPLIN17 THEN          /* CHECK FOR X'XXFFFFF' WHICH  0647 01009000
*                                      INDICATES NO PLIST            */ 01010000
         CLC   NOPL(3,PARMPTR),NOPLIN17                            0647 01011000
         BE    @RF00647                                            0647 01012000
*     DO;                                                          0648 01013000
*       PARMPTR=PL17PTR;            /* PICK UP ACTUAL POINTER        */ 01014000
         L     PARMPTR,PL17PTR(,PARMPTR)                           0649 01015000
*       IF PIRCNT>MAXPRM17 THEN     /* CHECK TO SEE IF THERE ARE MORE   01016000
*                                      PARMS THAT WE WANT TO GATHER  */ 01017000
         CLI   PIRCNT(PARMPTR),5                                   0650 01018000
         BNH   @RF00650                                            0650 01019000
*         TEMPLEN=LENGTH(PIRWORD1)+MAXPRM17*LENGTH(STRDVRU);/* SET 0651 01020000
*                                      LENGTH TO PICK UP THE MAXIMUM    01021000
*                                      PARM                          */ 01022000
         LA    TEMPLEN,44                                          0651 01023000
*       ELSE                                                       0652 01024000
*         TEMPLEN=LENGTH(PIRWORD1)+PIRCNT*LENGTH(STRDVRU);/* SET   0652 01025000
*                                      LENGTH TO PICK UP THOSE PARMS    01026000
*                                      THAT ARE THERE                */ 01027000
         B     @RC00650                                            0652 01028000
@RF00650 SLR   TEMPLEN,TEMPLEN                                     0652 01029000
         IC    TEMPLEN,PIRCNT(,PARMPTR)                            0652 01030000
         SLA   TEMPLEN,3                                           0652 01031000
         AL    TEMPLEN,@CF00055                                    0652 01032000
*       SCKPTR=ADDR(PLSTA17);                                      0653 01033000
@RC00650 ST    PARMPTR,SCKPTR(,AWSAPTR)                            0653 01034000
*       SCKLEN=TEMPLEN;                                            0654 01035000
         ST    TEMPLEN,SCKLEN(,AWSAPTR)                            0654 01036000
*       CALL SCK;                                                  0655 01037000
         BAL   @14,SCK                                             0655 01038000
*       PLST17(1:TEMPLEN)=PLSTA17;  /* MOVE IN THE LIST              */ 01039000
         LR    @05,TEMPLEN                                         0656 01040000
         BCTR  @05,0                                               0656 01041000
         EX    @05,@SM05740                                        0656 01042000
*       PLEN17=TEMPLEN;             /* SET THE LENGTH FIELD          */ 01043000
         STC   TEMPLEN,PLEN17(,AWSAPTR)                            0657 01044000
*     END;                                                         0658 01045000
*   ELSE                            /* THERE IS NO PLIST             */ 01046000
*     DO;                                                          0659 01047000
         B     @RC00647                                            0659 01048000
@RF00647 DS    0H                                                  0660 01049000
*       PARMPTR=PL17PTR;                                           0660 01050000
         L     PARMPTR,PL17PTR(,PARMPTR)                           0660 01051000
*       PLST17(1:4)=PARMPTR;        /* PUT IN THE REGISTER TO      0661 01052000
*                                      INDICATE NO PLIST             */ 01053000
         STCM  PARMPTR,15,PLST17(AWSAPTR)                          0661 01054000
*       PLEN17=LENGTH(PARMPTR);     /* SET LENGTH FIELD              */ 01055000
         MVI   PLEN17(AWSAPTR),X'04'                               0662 01056000
*     END;                                                         0663 01057000
*   RECLGTH=RECLGTH+PLEN17+LENGTH(PLEN17);/* UPDATE STACK RECORD   0664 01058000
*                                      LENGTH                        */ 01059000
@RC00647 LR    @05,RECLGTH                                         0664 01060000
         SLR   @15,@15                                             0664 01061000
         IC    @15,PLEN17(,AWSAPTR)                                0664 01062000
         ALR   @05,@15                                             0664 01063000
         AL    @05,@CF00063                                        0664 01064000
         LR    RECLGTH,@05                                         0664 01065000
*   GO TO AHLSVSTK;                 /* GO AND STACK THE RECORD       */ 01066000
         B     AHLSVSTK                                            0665 01067000
*                                                                  0666 01068000
*/********************************************************************/ 01069000
*/*                                                                  */ 01070000
*/*         FINISH BUILDING SVC 18                                   */ 01071000
*/*                                                                  */ 01072000
*/********************************************************************/ 01073000
*                                                                  0666 01074000
*AHLS18:                                                           0666 01075000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 01076000
AHLS18   LA    ERRTRNAD,RCOVPLST                                   0666 01077000
*   PARMPTR=REG0LCCA;               /* PICK UP REG 0 AT INTERRUPT    */ 01078000
         L     PARMPTR,REG0LCCA(,LCCAPTR)                          0667 01079000
*   IF R1LCCATS<NULL THEN                                          0668 01080000
         L     @05,R1LCCATS(,LCCAPTR)                              0668 01081000
         LTR   @05,@05                                             0668 01082000
         BNM   @RF00668                                            0668 01083000
*     DO;                           /* IF REG 1 IS NEGATIVE, SVC IS     01084000
*                                      FOR A FIND MACRO              */ 01085000
*                                                                  0669 01086000
*       /*************************************************************/ 01087000
*       /*                                                           */ 01088000
*       /* FIND MACRO                                                */ 01089000
*       /*                                                           */ 01090000
*       /*************************************************************/ 01091000
*                                                                  0670 01092000
*       SCKPTR=ADDR(FINDNM);                                       0670 01093000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0670 01094000
*       SCKLEN=LENGTH(FINDNM);                                     0671 01095000
         MVC   SCKLEN(4,AWSAPTR),@CF00061                          0671 01096000
*       CALL SCK;                                                  0672 01097000
         BAL   @14,SCK                                             0672 01098000
*       FINDPARM=FINDNM;            /* MOVE 8 BYTES TO RECORD        */ 01099000
         MVC   FINDPARM(8,AWSAPTR),FINDNM(PARMPTR)                 0673 01100000
*       LEN18A=LENGTH(FINDPARM);    /* PLACE 8 IN LENGTH FIELD       */ 01101000
         MVI   LEN18A(AWSAPTR),X'08'                               0674 01102000
*     END;                                                         0675 01103000
*   ELSE                                                           0676 01104000
*     DO;                           /* BLDL IS 12 BYTES LONG         */ 01105000
*                                                                  0676 01106000
         B     @RC00668                                            0676 01107000
@RF00668 DS    0H                                                  0677 01108000
*       /*************************************************************/ 01109000
*       /*                                                           */ 01110000
*       /* BLDL MACRO                                                */ 01111000
*       /*                                                           */ 01112000
*       /*************************************************************/ 01113000
*                                                                  0677 01114000
*AHLPRM12:                                                         0677 01115000
*       SCKPTR=ADDR(BLDLLIST);                                     0677 01116000
AHLPRM12 ST    PARMPTR,SCKPTR(,AWSAPTR)                            0677 01117000
*       SCKLEN=LENGTH(BLDLLIST);                                   0678 01118000
         MVC   SCKLEN(4,AWSAPTR),@CF04459                          0678 01119000
*       CALL SCK;                                                  0679 01120000
         BAL   @14,SCK                                             0679 01121000
*       PARM18=BLDLLIST;            /* MOVE 12 BYTE PARM LIST        */ 01122000
         MVC   PARM18(12,AWSAPTR),BLDLLIST(PARMPTR)                0680 01123000
*       LEN18=LENGTH(BLDLLIST);     /* PLACE 12 IN LENGTH FIELD      */ 01124000
         MVI   LEN18(AWSAPTR),X'0C'                                0681 01125000
*     END;                                                         0682 01126000
*   RECLGTH=RECLGTH+LEN18+LENGTH(LEN18);/* UPDATE STACK MSG LENGTH   */ 01127000
@RC00668 LR    @05,RECLGTH                                         0683 01128000
         SLR   @15,@15                                             0683 01129000
         IC    @15,LEN18(,AWSAPTR)                                 0683 01130000
         ALR   @05,@15                                             0683 01131000
         AL    @05,@CF00063                                        0683 01132000
         LR    RECLGTH,@05                                         0683 01133000
*   GO TO AHLSVSTK;                 /* FINISHED                      */ 01134000
         B     AHLSVSTK                                            0684 01135000
*                                                                  0685 01136000
*/********************************************************************/ 01137000
*/*                                                                  */ 01138000
*/*         FINISH BUILDING SVC 19 , 20 , 22 , 23 , 64 , 102         */ 01139000
*/*                                                                  */ 01140000
*/********************************************************************/ 01141000
*                                                                  0685 01142000
*AHLS19:                                                           0685 01143000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 01144000
AHLS19   LA    ERRTRNAD,RCOVPLST                                   0685 01145000
*   PARMPTR=REG1LCCA;               /* PICK UP ADDR OF PARMLIST      */ 01146000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0686 01147000
*   RECPTR=PARMPTR;                 /* SET UP ADDR BEFORE BRANCHING  */ 01148000
         LR    RECPTR,PARMPTR                                      0687 01149000
*   GO TO AHLS1D;                   /* FINISH RECORD                 */ 01150000
         B     AHLS1D                                              0688 01151000
*                                                                  0689 01152000
*/********************************************************************/ 01153000
*/*                                                                  */ 01154000
*/*         FINISH BUILDING SVC 21                                   */ 01155000
*/*                                                                  */ 01156000
*/********************************************************************/ 01157000
*                                                                  0689 01158000
*AHLS21:                                                           0689 01159000
*   ERRTRNAD=ADDR(RCOV21A);         /* SETUP ERROR RECOVERY          */ 01160000
AHLS21   LA    ERRTRNAD,RCOV21A                                    0689 01161000
*   PARMPTR=REG0LCCA;               /* PICK UP PTR TO PARAMETER LIST */ 01162000
         L     PARMPTR,REG0LCCA(,LCCAPTR)                          0690 01163000
*   DCBPTR=REG1LCCA;                /* PICK UP PTR TO DCB            */ 01164000
         L     DCBPTR,REG1LCCA(,LCCAPTR)                           0691 01165000
*   IF DCBPTR>0|PARMPTR>0 THEN      /* IF EITHER PTR IS POSITVE    0692 01166000
*                                      PARMLIST IS 12 OR 8 BYTES     */ 01167000
         SLR   @05,@05                                             0692 01168000
         CR    DCBPTR,@05                                          0692 01169000
         BH    @RT00692                                            0692 01170000
         CR    PARMPTR,@05                                         0692 01171000
         BNH   @RF00692                                            0692 01172000
@RT00692 DS    0H                                                  0693 01173000
*     IF PARMTST<0 THEN             /* IF REG0 NEG IT IS 8 BYTE PLIST*/ 01174000
         LTR   PARMTST,PARMTST                                     0693 01175000
         BNM   @RF00693                                            0693 01176000
*       TEMPLEN=LENGTH(NAME21C);    /* 8 BYTE PLIST                  */ 01177000
         LA    TEMPLEN,8                                           0694 01178000
*     ELSE                                                         0695 01179000
*       TEMPLEN=LENGTH(NAME21B);    /* 12 BYTE PLIST                 */ 01180000
         B     @RC00693                                            0695 01181000
@RF00693 LA    TEMPLEN,12                                          0695 01182000
*   ELSE                                                           0696 01183000
*     TEMPLEN=LENGTH(NAME21A);      /* OTHERWISE, PARMLIST IS 16   0696 01184000
*                                      BYTES                         */ 01185000
         B     @RC00692                                            0696 01186000
@RF00692 LA    TEMPLEN,16                                          0696 01187000
*   GEN(LPR   PARMPTR,PARMPTR  ENSURE POSITIVE );                  0697 01188000
@RC00692 DS    0H                                                  0697 01189000
         LPR   PARMPTR,PARMPTR  ENSURE POSITIVE                         01190000
*   SCKPTR=ADDR(PRM21LST);                                         0698 01191000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0698 01192000
*   SCKLEN=TEMPLEN;                                                0699 01193000
         ST    TEMPLEN,SCKLEN(,AWSAPTR)                            0699 01194000
*   CALL SCK;                                                      0700 01195000
         BAL   @14,SCK                                             0700 01196000
*   PARM21(1:TEMPLEN)=PRM21LST;     /* PLACE DETERMINED AMOUNT OF  0701 01197000
*                                      PARMLIST INTO RECORD          */ 01198000
         LR    @05,TEMPLEN                                         0701 01199000
         BCTR  @05,0                                               0701 01200000
         EX    @05,@SM05742                                        0701 01201000
*   PRMLEN21=TEMPLEN;               /* PLACE LENGTH IN LEN FIELD     */ 01202000
         STC   TEMPLEN,PRMLEN21(,AWSAPTR)                          0702 01203000
*   RECLGTH=RECLGTH+TEMPLEN+LENGTH(PRMLEN21);/* UPDATE STACK PARMLIST*/ 01204000
         LR    @05,RECLGTH                                         0703 01205000
         ALR   @05,TEMPLEN                                         0703 01206000
         AL    @05,@CF00063                                        0703 01207000
         LR    RECLGTH,@05                                         0703 01208000
*   ERRTRNAD=ADDR(RCOVNAME);        /* SET ERROR RETURN ADDR         */ 01209000
         LA    ERRTRNAD,RCOVNAME                                   0704 01210000
*   GEN(LPR   DCBPTR,DCBPTR    ENSURE POSITIVE ADDRESS );          0705 01211000
         LPR   DCBPTR,DCBPTR    ENSURE POSITIVE ADDRESS                 01212000
*   GO TO SVDDNCK;                  /* GO GET DDNAME                 */ 01213000
         B     SVDDNCK                                             0706 01214000
*                                                                  0707 01215000
*/********************************************************************/ 01216000
*/*                                                                  */ 01217000
*/*         FINISH BUILDING SVC 24                                   */ 01218000
*/*                                                                  */ 01219000
*/********************************************************************/ 01220000
*                                                                  0707 01221000
*AHLS24:                                                           0707 01222000
*   ERRTRNAD=ADDR(RCOVNAME);        /* SET RETURN ADDR IN CASE OF  0707 01223000
*                                      ERROR                         */ 01224000
AHLS24   LA    ERRTRNAD,RCOVNAME                                   0707 01225000
*   PARMPTR=REG1LCCA;               /* INSURE POSITIVE VALUE FOR   0708 01226000
*                                      ADDRESS                       */ 01227000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0708 01228000
*   GEN(LPR PARMPTR,PARMPTR);                                      0709 01229000
         LPR PARMPTR,PARMPTR                                            01230000
*   SCKPTR=ADDR(DDNAM24);                                          0710 01231000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0710 01232000
*   SCKLEN=LENGTH(DDNAM24);                                        0711 01233000
         MVC   SCKLEN(4,AWSAPTR),@CF00061                          0711 01234000
*   CALL SCK;                                                      0712 01235000
         BAL   @14,SCK                                             0712 01236000
*   DDN21=DDNAM24;                  /* MOVE DDNAME INTO RECORD       */ 01237000
         MVC   DDN21(8,AWSAPTR),DDNAM24(PARMPTR)                   0713 01238000
*AHLS24A:                                                          0714 01239000
*   RECLGTH=RECLGTH+LENGTH(DDN21);  /* UPDATE STACK MSG LEN          */ 01240000
AHLS24A  AL    RECLGTH,@CF00061                                    0714 01241000
*   GO TO AHLSVSTK;                 /* OUTPUT AND RETURN             */ 01242000
         B     AHLSVSTK                                            0715 01243000
*                                                                  0716 01244000
*/********************************************************************/ 01245000
*/*                                                                  */ 01246000
*/*         FINISH BUILDING SVC 25                                   */ 01247000
*/*                                                                  */ 01248000
*/********************************************************************/ 01249000
*                                                                  0716 01250000
*AHLS25:                                                           0716 01251000
*   ERRTRNAD=ADDR(RCOV25A);         /* SET ERROR RECOVERY            */ 01252000
AHLS25   LA    ERRTRNAD,RCOV25A                                    0716 01253000
*   PARMPTR=REG1LCCA;                                              0717 01254000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0717 01255000
*   GEN(LPR  DCBPTR,PARMPTR);       /* ENSURE ADDR IS POSITIVE       */ 01256000
         LPR  DCBPTR,PARMPTR                                            01257000
*   SCKPTR=ADDR(DCBFDAD);                                          0719 01258000
         LA    @05,DCBFDAD(,DCBPTR)                                0719 01259000
         ST    @05,SCKPTR(,AWSAPTR)                                0719 01260000
*   SCKLEN=LENGTH(DCBFDAD);                                        0720 01261000
         MVC   SCKLEN(4,AWSAPTR),@CF00061                          0720 01262000
*   CALL SCK;                                                      0721 01263000
         BAL   @14,SCK                                             0721 01264000
*   DCBFDA25=DCBFDAD;               /* PICK UP FDAD FIELD            */ 01265000
         MVC   DCBFDA25(8,AWSAPTR),DCBFDAD(DCBPTR)                 0722 01266000
*   SCKPTR=ADDR(DCBTRBAL);                                         0723 01267000
         LA    @05,DCBFDAD(,DCBPTR)                                0723 01268000
         LA    @05,DCBTRBAL+7(,@05)                                0723 01269000
         ST    @05,SCKPTR(,AWSAPTR)                                0723 01270000
*   SCKLEN=LENGTH(DCBTRBAL);                                       0724 01271000
         MVC   SCKLEN(4,AWSAPTR),@CF00075                          0724 01272000
*   CALL SCK;                                                      0725 01273000
         BAL   @14,SCK                                             0725 01274000
*   DCBTRB25=DCBTRBAL;              /* PICK UP TRACK BALANCE         */ 01275000
         LA    @05,DCBFDAD(,DCBPTR)                                0726 01276000
         LH    @05,DCBTRBAL+7(,@05)                                0726 01277000
         STH   @05,DCBTRB25(,AWSAPTR)                              0726 01278000
*   RECLGTH=RECLGTH+LENGTH(DCBFDA25)+LENGTH(DCBTRB25);/* UPDATE    0727 01279000
*                                      RECLGTH                       */ 01280000
         AL    RECLGTH,@CF04642                                    0727 01281000
*   ERRTRNAD=ADDR(RCOVNAME);        /* SET ERROR RECOVERY            */ 01282000
         LA    ERRTRNAD,RCOVNAME                                   0728 01283000
*   GO TO SVDDNCK;                  /* GO TO CHECK DDNAME            */ 01284000
         B     SVDDNCK                                             0729 01285000
*                                                                  0730 01286000
*/********************************************************************/ 01287000
*/*                                                                  */ 01288000
*/*         FINISH BUILDING SVC 26                                   */ 01289000
*/*                                                                  */ 01290000
*/********************************************************************/ 01291000
*                                                                  0730 01292000
*AHLS26:                                                           0730 01293000
*   ERRTRNAD=ADDR(RCOV26A);         /* SET ERROR RECOVERY ENTRY      */ 01294000
AHLS26   LA    ERRTRNAD,RCOV26A                                    0730 01295000
*   IF CTGAM0=ON THEN               /* THIS IS A VSAM CATALOG REQUEST*/ 01296000
         L     @05,REG1LCCA(,LCCAPTR)                              0731 01297000
         TM    CTGAM0(@05),B'00000001'                             0731 01298000
         BNO   @RF00731                                            0731 01299000
*     DO;                                                          0732 01300000
*       SCKPTR=ADDR(PLST26);                                       0733 01301000
         ST    @05,SCKPTR(,AWSAPTR)                                0733 01302000
*       SCKLEN=LENGTH(PARM26VS);                                   0734 01303000
         MVC   SCKLEN(4,AWSAPTR),@CF00992                          0734 01304000
*       CALL SCK;                                                  0735 01305000
         BAL   @14,SCK                                             0735 01306000
*       PARM26VS=PLST26;            /* PICK UP PLIST                 */ 01307000
         L     @05,REG1LCCA(,LCCAPTR)                              0736 01308000
         MVC   PARM26VS(20,AWSAPTR),PLST26(@05)                    0736 01309000
*       PLEN26=LENGTH(PARM26VS);    /* SET PLIST LENGTH FIELD        */ 01310000
         MVI   PLEN26(AWSAPTR),X'14'                               0737 01311000
*       RECLGTH=RECLGTH+LENGTH(PARM26VS)+LENGTH(PLEN26);/* UPDATE  0738 01312000
*                                      RECORD LENGTH                 */ 01313000
         AL    RECLGTH,@CF05067                                    0738 01314000
*AHLS26A:                                                          0739 01315000
*       ERRTRNAD=ADDR(RCOV26B);     /* UPDATE ERROR RECOVERY ENTRY   */ 01316000
AHLS26A  LA    ERRTRNAD,RCOV26B                                    0739 01317000
*       RECPTR=ADDR(MCAREC)+RECLGTH;/* UPDATE RECORD POINTER TO NEXT    01318000
*                                      FIELD                 @YM03653*/ 01319000
         LA    RECPTR,MCAREC(,AWSAPTR)                             0740 01320000
         ALR   RECPTR,RECLGTH                                      0740 01321000
*       IF CTGFUNC='100'B&CTGOPTNS='00001'B|CTGFUNC='100'B&CTGOPTNS=    01322000
*           '00010'B THEN           /*                       @YM03653*/ 01323000
         L     @05,REG1LCCA(,LCCAPTR)                              0741 01324000
         TM    CTGFUNC(@05),B'10000000'                            0741 01325000
         BNO   @GL00005                                            0741 01326000
         TM    CTGFUNC(@05),B'01100000'                            0741 01327000
         BNZ   @GL00005                                            0741 01328000
         TM    CTGOPTNS(@05),B'00001000'                           0741 01329000
         BNO   @GL00005                                            0741 01330000
         TM    CTGOPTNS(@05),B'11110000'                           0741 01331000
         BZ    @RT00741                                            0741 01332000
@GL00005 L     @05,REG1LCCA(,LCCAPTR)                              0741 01333000
         TM    CTGFUNC(@05),B'10000000'                            0741 01334000
         BNO   @RF00741                                            0741 01335000
         TM    CTGFUNC(@05),B'01100000'                            0741 01336000
         BNZ   @RF00741                                            0741 01337000
         TM    CTGOPTNS(@05),B'00010000'                           0741 01338000
         BNO   @RF00741                                            0741 01339000
         TM    CTGOPTNS(@05),B'11101000'                           0741 01340000
         BNZ   @RF00741                                            0741 01341000
@RT00741 DS    0H                                                  0742 01342000
*         DO;                       /*                       @YM03653*/ 01343000
*           PARMPTR=CTGFVENT;       /* PICK UP ADDR OF THE DSN     0743 01344000
*                                                            @YM03653*/ 01345000
         L     @05,REG1LCCA(,LCCAPTR)                              0743 01346000
         L     @05,CTGFVT(,@05)                                    0743 01347000
         L     PARMPTR,CTGFVENT(,@05)                              0743 01348000
*           CALL SVDSN;             /* GO GET THE DSN        @YM03653*/ 01349000
         BAL   @14,SVDSN                                           0744 01350000
*         END;                      /*                       @YM03653*/ 01351000
*       ELSE                                                       0746 01352000
*         IF CTGNAME=ON|CTGSUPLT=ON THEN                           0746 01353000
         B     @RC00741                                            0746 01354000
@RF00741 L     @05,REG1LCCA(,LCCAPTR)                              0746 01355000
         TM    CTGNAME(@05),B'00000100'                            0746 01356000
         BO    @RT00746                                            0746 01357000
         TM    CTGSUPLT(@05),B'00010000'                           0746 01358000
         BNO   @RF00746                                            0746 01359000
@RT00746 DS    0H                                                  0747 01360000
*           DO;                                                    0747 01361000
*             PARMPTR=CTGENT;                                      0748 01362000
         L     @05,REG1LCCA(,LCCAPTR)                              0748 01363000
         L     PARMPTR,CTGENT(,@05)                                0748 01364000
*             CALL SVDSN;                                          0749 01365000
         BAL   @14,SVDSN                                           0749 01366000
*           END;                                                   0750 01367000
*         ELSE                      /* IT IS A 3 BYTE CI NUMBER      */ 01368000
*           DO;                                                    0751 01369000
         B     @RC00746                                            0751 01370000
@RF00746 DS    0H                                                  0752 01371000
*             PARMPTR=CTGENT;       /* PICK UP ITS ADDRESS           */ 01372000
         L     @05,REG1LCCA(,LCCAPTR)                              0752 01373000
         L     PARMPTR,CTGENT(,@05)                                0752 01374000
*             SCKPTR=PARMPTR;                                      0753 01375000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0753 01376000
*             SCKLEN=3;                                            0754 01377000
         MVC   SCKLEN(4,AWSAPTR),@CF00294                          0754 01378000
*             CALL SCK;                                            0755 01379000
         BAL   @14,SCK                                             0755 01380000
*             GEN;                                                 0756 01381000
         UNPK  CI(UNPKLN26,RECPTR),0(UNPKL26,PARMPTR) UNPACK CI         01382000
         TR    CI(TRLEN26,RECPTR),CONVTAB-240 TRANSLATE TO EBCDIC       01383000
*             DSNLEN=LENGTH(CINUM); /* SETUP LENGTH FIELD            */ 01384000
         MVI   DSNLEN(RECPTR),X'06'                                0757 01385000
*             RECLGTH=RECLGTH+LENGTH(CINUM)+LENGTH(LEN26);/* UPDATE     01386000
*                                      RECORD LENGTH                 */ 01387000
         AL    RECLGTH,@CF00730                                    0758 01388000
*           END;                                                   0759 01389000
*AHLS26C:                                                          0760 01390000
*       ERRTRNAD=ADDR(RCOV26D);     /* UPDATE ERROR RECOVERY       0760 01391000
*                                      INDICATOR                     */ 01392000
@RC00746 DS    0H                                                  0760 01393000
@RC00741 DS    0H                                                  0760 01394000
AHLS26C  LA    ERRTRNAD,RCOV26D                                    0760 01395000
*       RECPTR=ADDR(MCAREC)+RECLGTH;/* UPDATE RECORD PTR             */ 01396000
         LA    RECPTR,MCAREC(,AWSAPTR)                             0761 01397000
         ALR   RECPTR,RECLGTH                                      0761 01398000
*       VOLLEN26=0;                 /* INDICATE THAT THERE IS NO   0762 01399000
*                                      VOLIST                        */ 01400000
         MVI   VOLLEN26(RECPTR),X'00'                              0762 01401000
*       RECLGTH=RECLGTH+LENGTH(VOLLEN26);/* UPDATE RECORD LENGTH     */ 01402000
         AL    RECLGTH,@CF00063                                    0763 01403000
*     END;                                                         0764 01404000
*   ELSE                                                           0765 01405000
*     DO;                                                          0765 01406000
         B     @RC00731                                            0765 01407000
@RF00731 DS    0H                                                  0766 01408000
*       IF CAT26^='000'B THEN       /* CHECK FOR CATALOG             */ 01409000
         L     @05,REG1LCCA(,LCCAPTR)                              0766 01410000
         TM    CAT26(@05),B'00111000'                              0766 01411000
         BZ    @RF00766                                            0766 01412000
*         DO;                       /* IT IS CATALOG                 */ 01413000
*           SCKPTR=ADDR(PLST26);                                   0768 01414000
         ST    @05,SCKPTR(,AWSAPTR)                                0768 01415000
*           SCKLEN=LENGTH(PARM26VS);                               0769 01416000
         MVC   SCKLEN(4,AWSAPTR),@CF00992                          0769 01417000
*           CALL SCK;                                              0770 01418000
         BAL   @14,SCK                                             0770 01419000
*           PARM26VS=PLST26;        /* PICK UP THE LONG PLIST        */ 01420000
         L     @05,REG1LCCA(,LCCAPTR)                              0771 01421000
         MVC   PARM26VS(20,AWSAPTR),PLST26(@05)                    0771 01422000
*           PLEN26=LENGTH(PARM26VS);/* FILL IN LENGTH FIELD          */ 01423000
         MVI   PLEN26(AWSAPTR),X'14'                               0772 01424000
*         END;                                                     0773 01425000
*       ELSE                        /* IT IS INDEX OR LOCATE         */ 01426000
*         DO;                                                      0774 01427000
         B     @RC00766                                            0774 01428000
@RF00766 DS    0H                                                  0775 01429000
*           SCKPTR=ADDR(PLST26);                                   0775 01430000
         L     @05,REG1LCCA(,LCCAPTR)                              0775 01431000
         ST    @05,SCKPTR(,AWSAPTR)                                0775 01432000
*           SCKLEN=LENGTH(PARM26S);                                0776 01433000
         MVC   SCKLEN(4,AWSAPTR),@CF00929                          0776 01434000
*           CALL SCK;                                              0777 01435000
         BAL   @14,SCK                                             0777 01436000
*           PARM26S=PLST26;         /* PICK UP THE SHORT PLIST       */ 01437000
         L     @05,REG1LCCA(,LCCAPTR)                              0778 01438000
         MVC   PARM26S(16,AWSAPTR),PLST26(@05)                     0778 01439000
*           PLEN26=LENGTH(PARM26S); /* FILL IN LENGTH FIELD          */ 01440000
         MVI   PLEN26(AWSAPTR),X'10'                               0779 01441000
*         END;                                                     0780 01442000
*       RECLGTH=RECLGTH+PLEN26+LENGTH(PLEN26);/* UPDATE RECORD LENGTH*/ 01443000
@RC00766 LR    @05,RECLGTH                                         0781 01444000
         SLR   @15,@15                                             0781 01445000
         IC    @15,PLEN26(,AWSAPTR)                                0781 01446000
         ALR   @05,@15                                             0781 01447000
         AL    @05,@CF00063                                        0781 01448000
         LR    RECLGTH,@05                                         0781 01449000
*AHLS26D:                                                          0782 01450000
*       ERRTRNAD=ADDR(RCOV26C);     /* SETUP ERROR RECOVERY ENTRY    */ 01451000
AHLS26D  LA    ERRTRNAD,RCOV26C                                    0782 01452000
*       RECPTR=ADDR(MCAREC)+RECLGTH;                               0783 01453000
         LA    RECPTR,MCAREC(,AWSAPTR)                             0783 01454000
         ALR   RECPTR,RECLGTH                                      0783 01455000
*       PARMPTR=DSNAD26;            /* GET ADDRESS OF THE DSN        */ 01456000
         L     @05,REG1LCCA(,LCCAPTR)                              0784 01457000
         L     PARMPTR,DSNAD26(,@05)                               0784 01458000
*       CALL SVDSN;                                                0785 01459000
         BAL   @14,SVDSN                                           0785 01460000
*AHLS26E:                                                          0786 01461000
*       RECPTR=ADDR(MCAREC)+RECLGTH;                               0786 01462000
AHLS26E  LA    RECPTR,MCAREC(,AWSAPTR)                             0786 01463000
         ALR   RECPTR,RECLGTH                                      0786 01464000
*       ERRTRNAD=ADDR(RCOV26D);                                    0787 01465000
         LA    ERRTRNAD,RCOV26D                                    0787 01466000
*       IF CAT26^='000'B THEN       /* CHECK FOR CATALOG             */ 01467000
         L     @05,REG1LCCA(,LCCAPTR)                              0788 01468000
         TM    CAT26(@05),B'00111000'                              0788 01469000
         BZ    @RF00788                                            0788 01470000
*         DO;                       /* IT IS CATALOG                 */ 01471000
*           IF VOLCNT>MAXVOL THEN   /* CHECK FOR MORE THAN MAX     0790 01472000
*                                      ENTRIES                       */ 01473000
         ICM   @05,15,VOLSTA26(AWSAPTR)                            0790 01474000
         CLC   VOLCNT(2,@05),@CH00294                              0790 01475000
         BNH   @RF00790                                            0790 01476000
*             TEMPLEN=LENGTH(VOLCNT)+MAXVOL*LENGTH(VOLENT);        0791 01477000
         LA    TEMPLEN,38                                          0791 01478000
*           ELSE                                                   0792 01479000
*             TEMPLEN=LENGTH(VOLCNT)+VOLCNT*LENGTH(VOLENT);        0792 01480000
         B     @RC00790                                            0792 01481000
@RF00790 ICM   @05,15,VOLSTA26(AWSAPTR)                            0792 01482000
         LH    TEMPLEN,VOLCNT(,@05)                                0792 01483000
         N     TEMPLEN,@CF04659                                    0792 01484000
         MH    TEMPLEN,@CH04459                                    0792 01485000
         AL    TEMPLEN,@CF00075                                    0792 01486000
*           VOLLEN26=TEMPLEN;       /* PUT VOLST LENGTH IN RECORD    */ 01487000
@RC00790 STC   TEMPLEN,VOLLEN26(,RECPTR)                           0793 01488000
*           SCKPTR=ADDR(VOLIST);                                   0794 01489000
         MVC   SCKPTR(4,AWSAPTR),VOLSTA26(AWSAPTR)                 0794 01490000
*           SCKLEN=TEMPLEN;                                        0795 01491000
         ST    TEMPLEN,SCKLEN(,AWSAPTR)                            0795 01492000
*           CALL SCK;                                              0796 01493000
         BAL   @14,SCK                                             0796 01494000
*           VOLIST26(1:TEMPLEN)=VOLIST;/* GATHER VOLLIST             */ 01495000
         LR    @05,TEMPLEN                                         0797 01496000
         BCTR  @05,0                                               0797 01497000
         ICM   @15,15,VOLSTA26(AWSAPTR)                            0797 01498000
         EX    @05,@SM05744                                        0797 01499000
*           RECLGTH=RECLGTH+VOLLEN26+LENGTH(VOLLEN26);/* UPDATE    0798 01500000
*                                      RECORD LENGTH                 */ 01501000
         LR    @05,RECLGTH                                         0798 01502000
         SLR   @15,@15                                             0798 01503000
         IC    @15,VOLLEN26(,RECPTR)                               0798 01504000
         ALR   @05,@15                                             0798 01505000
         AL    @05,@CF00063                                        0798 01506000
         LR    RECLGTH,@05                                         0798 01507000
*         END;                                                     0799 01508000
*       ELSE                        /* IT IS INDEX OR LOCATE         */ 01509000
*         DO;                                                      0800 01510000
         B     @RC00788                                            0800 01511000
@RF00788 DS    0H                                                  0801 01512000
*           VOLLEN26=0;             /* INDICATE NO VOLIST            */ 01513000
         MVI   VOLLEN26(RECPTR),X'00'                              0801 01514000
*           RECLGTH=RECLGTH+LENGTH(VOLLEN26);/* UPDATE RECORD LENGTH */ 01515000
         AL    RECLGTH,@CF00063                                    0802 01516000
*         END;                                                     0803 01517000
*     END;                                                         0804 01518000
*   GO TO AHLSVSTK;                                                0805 01519000
         B     AHLSVSTK                                            0805 01520000
*                                                                  0806 01521000
*/********************************************************************/ 01522000
*/*                                                                  */ 01523000
*/*         FINISH BUILDING SVC 27                                   */ 01524000
*/*                                                                  */ 01525000
*/********************************************************************/ 01526000
*                                                                  0806 01527000
*AHLS27:                                                           0806 01528000
*   ERRTRNAD=ADDR(RCOV27A);         /* SET RETURN ADDR IN CASE OF  0806 01529000
*                                      ERROR                         */ 01530000
AHLS27   LA    ERRTRNAD,RCOV27A                                    0806 01531000
*   PARMPTR=REG1LCCA;               /* PICK UP ADDRESS OF PARMLIST   */ 01532000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0807 01533000
*   SCKPTR=PARMPTR;                                                0808 01534000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0808 01535000
*   SCKLEN=LENGTH(PLIST27);                                        0809 01536000
         MVC   SCKLEN(4,AWSAPTR),@CF00929                          0809 01537000
*   CALL SCK;                                                      0810 01538000
         BAL   @14,SCK                                             0810 01539000
*   PLIST27=PRMLST27;               /* MOVE PARMLIST TO RECORD       */ 01540000
         MVC   PLIST27(16,AWSAPTR),PRMLST27(PARMPTR)               0811 01541000
*   RECLGTH=RECLGTH+LENGTH(PLIST27);/* UPDATE STACK MSG LEN          */ 01542000
         AL    RECLGTH,@CF00929                                    0812 01543000
*   ERRTRNAD=ADDR(RCOV27B);         /* RESET RETURN ADDR             */ 01544000
         LA    ERRTRNAD,RCOV27B                                    0813 01545000
*   IF VSERAD27=NULL THEN                                          0814 01546000
         L     @05,VSERAD27(,PARMPTR)                              0814 01547000
         LTR   @05,@05                                             0814 01548000
         BNZ   @RF00814                                            0814 01549000
*     VOLSER27=NOTAPP;              /* IF VOL-SER ADDRESS IS 0, N/A     01550000
*                                      IS USED                       */ 01551000
         MVC   VOLSER27(6,AWSAPTR),@CC04600                        0815 01552000
*   ELSE                                                           0816 01553000
*     DO;                                                          0816 01554000
         B     @RC00814                                            0816 01555000
@RF00814 DS    0H                                                  0817 01556000
*       SCKPTR=ADDR(VOLS27);                                       0817 01557000
         L     @05,VSERAD27(,PARMPTR)                              0817 01558000
         ST    @05,SCKPTR(,AWSAPTR)                                0817 01559000
*       SCKLEN=LENGTH(VOLS27);                                     0818 01560000
         MVC   SCKLEN(4,AWSAPTR),@CF00919                          0818 01561000
*       CALL SCK;                                                  0819 01562000
         BAL   @14,SCK                                             0819 01563000
*       VOLSER27=VOLS27;            /* OTHERWISE, VOL-SER IS MOVED 0820 01564000
*                                      INTO RECORD                   */ 01565000
         L     @05,VSERAD27(,PARMPTR)                              0820 01566000
         MVC   VOLSER27(6,AWSAPTR),VOLS27(@05)                     0820 01567000
*     END;                                                         0821 01568000
*   RECLGTH=RECLGTH+LENGTH(VOLSER27);/* UPDATE STACK MSG LEN         */ 01569000
@RC00814 AL    RECLGTH,@CF00919                                    0822 01570000
*AHLS27A:                                                          0823 01571000
*   ERRTRNAD=ADDR(RCOV27C);         /* SETUP ERROR RECOVERY          */ 01572000
AHLS27A  LA    ERRTRNAD,RCOV27C                                    0823 01573000
*   RECPTR=ADDR(MCAREC)+RECLGTH;                                   0824 01574000
         LA    RECPTR,MCAREC(,AWSAPTR)                             0824 01575000
         ALR   RECPTR,RECLGTH                                      0824 01576000
*   IF SRCHSEEK=SEARCH THEN                                        0825 01577000
         CLC   SRCHSEEK(2,PARMPTR),@CB04639                        0825 01578000
         BNE   @RF00825                                            0825 01579000
*     DO;                           /* IF SEARCH/SEEK CODE IS SEARCH,   01580000
*                                      MUST GET DSN                  */ 01581000
*                                                                  0826 01582000
*       /*************************************************************/ 01583000
*       /*                                                           */ 01584000
*       /* SEARCH CODE                                               */ 01585000
*       /*                                                           */ 01586000
*       /*************************************************************/ 01587000
*                                                                  0827 01588000
*       PARMPTR=DSNAD27;            /* GET ADDR OF DSN               */ 01589000
         L     PARMPTR,DSNAD27(,PARMPTR)                           0827 01590000
*       CALL SVDSN;                 /* MOVE IT INTO RECORD           */ 01591000
         BAL   @14,SVDSN                                           0828 01592000
*       GO TO AHLSVSTK;             /* GO TO EXIT ROUTINE            */ 01593000
         B     AHLSVSTK                                            0829 01594000
*     END;                                                         0830 01595000
*                                                                  0830 01596000
*/********************************************************************/ 01597000
*/*          SEEK - PLACE 10 CHARACTER CONVERTED CCHHR INTO RECORD   */ 01598000
*/********************************************************************/ 01599000
*                                                                  0831 01600000
*   ELSE                                                           0831 01601000
*     DO;                                                          0831 01602000
@RF00825 DS    0H                                                  0832 01603000
*       PARMPTR=CHRAD27;            /* PICK UP CCHHR FIELD ADDR      */ 01604000
         L     PARMPTR,CHRAD27(,PARMPTR)                           0832 01605000
*       SCKPTR=PARMPTR;                                            0833 01606000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0833 01607000
*       SCKLEN=5;                                                  0834 01608000
         MVC   SCKLEN(4,AWSAPTR),@CF01868                          0834 01609000
*       CALL SCK;                                                  0835 01610000
         BAL   @14,SCK                                             0835 01611000
*       GEN;                                                       0836 01612000
         UNPK  CCHH(UNPKLN,RECPTR),0(UNPKLN1,PARMPTR) UNPACK CCHHR      01613000
         TR    CCHH(TRLEN,RECPTR),CONVTAB-240 TRANSLATE TO EBCDIC       01614000
*       CCAHLEN=LENGTH(CCHHR27);    /* PUT 10 INTO LENGTH BYTE       */ 01615000
         MVI   CCAHLEN(RECPTR),X'0A'                               0837 01616000
*       RECLGTH=RECLGTH+LENGTH(CCAHLEN)+LENGTH(CCHHR27);/* UPDATE  0838 01617000
*                                      STACK MSG LEN                 */ 01618000
         AL    RECLGTH,@CF04861                                    0838 01619000
*     END;                                                         0839 01620000
*   GO TO AHLSVSTK;                                                0840 01621000
         B     AHLSVSTK                                            0840 01622000
*                                                                  0841 01623000
*   /*****************************************************************/ 01624000
*   /*                                                               */ 01625000
*   /* SVC 28 , 68                                                   */ 01626000
*   /*                                                               */ 01627000
*   /*****************************************************************/ 01628000
*                                                                  0841 01629000
*AHLS28:                                                           0841 01630000
*   ERRTRNAD=ADDR(RCOVWORD);        /* SET RETURN ADDR IN CASE OF  0841 01631000
*                                      ERROR                         */ 01632000
AHLS28   LA    ERRTRNAD,RCOVWORD                                   0841 01633000
*   PARM28=REGDLCCA;                /* PICK UP REG13 AT HOOK AND PUT    01634000
*                                      IN PLIST                      */ 01635000
         MVC   PARM28(4,AWSAPTR),REGDLCCA(LCCAPTR)                 0842 01636000
*   RECLGTH=RECLGTH+LENGTH(PARM28); /* UPDATE RECORD LENGTH FIELD    */ 01637000
         AL    RECLGTH,@CF00055                                    0843 01638000
*   GO TO AHLSVSTK;                                                0844 01639000
         B     AHLSVSTK                                            0844 01640000
*                                                                  0845 01641000
*/********************************************************************/ 01642000
*/*                                                                  */ 01643000
*/*         FINISH BUILDING SVC 29                                   */ 01644000
*/*                                                                  */ 01645000
*/********************************************************************/ 01646000
*                                                                  0845 01647000
*AHLS29:                                                           0845 01648000
*   ERRTRNAD=ADDR(RCOV29A);         /* SET ADDRESS IN CASE OF ERROR  */ 01649000
AHLS29   LA    ERRTRNAD,RCOV29A                                    0845 01650000
*   SCKPTR=ADDR(PARMLS29);                                         0846 01651000
         L     @05,REG1LCCA(,LCCAPTR)                              0846 01652000
         ST    @05,SCKPTR(,AWSAPTR)                                0846 01653000
*   SCKLEN=LENGTH(PARM29);                                         0847 01654000
         MVC   SCKLEN(4,AWSAPTR),@CF00929                          0847 01655000
*   CALL SCK;                                                      0848 01656000
         BAL   @14,SCK                                             0848 01657000
*   PARM29=PARMLS29;                /* MOVE 16 BYTE PARMLIST         */ 01658000
         L     @05,REG1LCCA(,LCCAPTR)                              0849 01659000
         MVC   PARM29(16,AWSAPTR),PARMLS29(@05)                    0849 01660000
*   RECLGTH=RECLGTH+LENGTH(PARM29); /* UPDATE STACK MSG LEN          */ 01661000
         AL    RECLGTH,@CF00929                                    0850 01662000
*AHLS29A:                                                          0851 01663000
*   ERRTRNAD=ADDR(RCOV29B);         /* SET RETURN IN CASE OF ERROR   */ 01664000
AHLS29A  LA    ERRTRNAD,RCOV29B                                    0851 01665000
*   RECPTR=ADDR(LEN29);             /* POINT TO FIELD TO RECEIVE   0852 01666000
*                                      DSNAME                        */ 01667000
         LA    RECPTR,LEN29(,AWSAPTR)                              0852 01668000
*   PARMPTR=DSNAD29;                /* PICK UP ADDRESS OF DSNAME FROM   01669000
*                                      PARMLIST                      */ 01670000
         L     @05,REG1LCCA(,LCCAPTR)                              0853 01671000
         L     PARMPTR,DSNAD29(,@05)                               0853 01672000
*   CALL SVDSN;                     /* MOVE IN DSN AND LENGTH        */ 01673000
         BAL   @14,SVDSN                                           0854 01674000
*AHLS29B:                                                          0855 01675000
*   ERRTRNAD=ADDR(RCOV29C);                                        0855 01676000
AHLS29B  LA    ERRTRNAD,RCOV29C                                    0855 01677000
*   RECPTR=ADDR(MCAREC)+RECLGTH;                                   0856 01678000
         LA    RECPTR,MCAREC(,AWSAPTR)                             0856 01679000
         ALR   RECPTR,RECLGTH                                      0856 01680000
*   IF VOLCNT29>MAXVOL THEN         /* CHECK FOR MORE THAN MAX     0857 01681000
*                                      ENTRIES               @YM03653*/ 01682000
         ICM   @05,15,VOLSTA29(AWSAPTR)                            0857 01683000
         CLC   VOLCNT29(2,@05),@CH00294                            0857 01684000
         BNH   @RF00857                                            0857 01685000
*     TEMPLEN=LENGTH(VOLCNT29)+MAXVOL*LENGTH(VOLENT29);/*    @YM03653*/ 01686000
         LA    TEMPLEN,38                                          0858 01687000
*   ELSE                            /*                       @YM03653*/ 01688000
*     TEMPLEN=LENGTH(VOLCNT29)+VOLCNT29*LENGTH(VOLENT29);/*  @YM03653*/ 01689000
         B     @RC00857                                            0859 01690000
@RF00857 ICM   @05,15,VOLSTA29(AWSAPTR)                            0859 01691000
         LH    TEMPLEN,VOLCNT29(,@05)                              0859 01692000
         N     TEMPLEN,@CF04659                                    0859 01693000
         MH    TEMPLEN,@CH04459                                    0859 01694000
         AL    TEMPLEN,@CF00075                                    0859 01695000
*   VOLLEN29=TEMPLEN;               /* PUT VOLST LENGTH IN RECORD  0860 01696000
*                                                            @YM03653*/ 01697000
@RC00857 STC   TEMPLEN,VOLLEN29(,RECPTR)                           0860 01698000
*   SCKPTR=ADDR(VLIST29);           /*                       @YM03653*/ 01699000
         MVC   SCKPTR(4,AWSAPTR),VOLSTA29(AWSAPTR)                 0861 01700000
*   SCKLEN=TEMPLEN;                 /*                       @YM03653*/ 01701000
         ST    TEMPLEN,SCKLEN(,AWSAPTR)                            0862 01702000
*   CALL SCK;                       /*                       @YM03653*/ 01703000
         BAL   @14,SCK                                             0863 01704000
*   VOLIST29(1:TEMPLEN)=VLIST29;    /* GATHER VOLLIST        @YM03653*/ 01705000
         LR    @05,TEMPLEN                                         0864 01706000
         BCTR  @05,0                                               0864 01707000
         ICM   @15,15,VOLSTA29(AWSAPTR)                            0864 01708000
         EX    @05,@SM05746                                        0864 01709000
*   RECLGTH=RECLGTH+VOLLEN29+LENGTH(VOLLEN29);/* UPDATE RECORD LENGTH   01710000
*                                                            @YM03653*/ 01711000
         LR    @05,RECLGTH                                         0865 01712000
         SLR   @15,@15                                             0865 01713000
         IC    @15,VOLLEN29(,RECPTR)                               0865 01714000
         ALR   @05,@15                                             0865 01715000
         AL    @05,@CF00063                                        0865 01716000
         LR    RECLGTH,@05                                         0865 01717000
*   GO TO AHLSVSTK;                                                0866 01718000
         B     AHLSVSTK                                            0866 01719000
*                                                                  0867 01720000
*/********************************************************************/ 01721000
*/*                                                                  */ 01722000
*/*         FINISH BUILDING SVC 30                                   */ 01723000
*/*                                                                  */ 01724000
*/********************************************************************/ 01725000
*                                                                  0867 01726000
*AHLS30:                                                           0867 01727000
*   ERRTRNAD=ADDR(RCOV30A);         /* SET ADDRESS IN CASE OF ERROR  */ 01728000
AHLS30   LA    ERRTRNAD,RCOV30A                                    0867 01729000
*   SCKPTR=ADDR(PARMLS30);                                         0868 01730000
         L     @05,REG1LCCA(,LCCAPTR)                              0868 01731000
         ST    @05,SCKPTR(,AWSAPTR)                                0868 01732000
*   SCKLEN=LENGTH(PARM30);                                         0869 01733000
         MVC   SCKLEN(4,AWSAPTR),@CF00929                          0869 01734000
*   CALL SCK;                                                      0870 01735000
         BAL   @14,SCK                                             0870 01736000
*   PARM30=PARMLS30;                /* MOVE 16 BYTE PARMLIST         */ 01737000
         L     @05,REG1LCCA(,LCCAPTR)                              0871 01738000
         MVC   PARM30(16,AWSAPTR),PARMLS30(@05)                    0871 01739000
*   RECLGTH=RECLGTH+LENGTH(PARM30); /* UPDATE STACK MSG LEN          */ 01740000
         AL    RECLGTH,@CF00929                                    0872 01741000
*AHLS30A:                                                          0873 01742000
*   ERRTRNAD=ADDR(RCOV30B);         /* SET RETURN IN CASE OF ERROR   */ 01743000
AHLS30A  LA    ERRTRNAD,RCOV30B                                    0873 01744000
*   RECPTR=ADDR(LEN30);             /* POINT TO FIELD TO RECEIVE   0874 01745000
*                                      DSNAME                        */ 01746000
         LA    RECPTR,LEN30(,AWSAPTR)                              0874 01747000
*   PARMPTR=DSNADO30;               /* PICK UP ADDRESS OF DSNAME FROM   01748000
*                                      PARMLIST                      */ 01749000
         L     @05,REG1LCCA(,LCCAPTR)                              0875 01750000
         L     PARMPTR,DSNADO30(,@05)                              0875 01751000
*   CALL SVDSN;                     /* MOVE IN DSN AND LENGTH        */ 01752000
         BAL   @14,SVDSN                                           0876 01753000
*AHLS30B:                                                          0877 01754000
*   ERRTRNAD=ADDR(RCOV30C);         /* UPDATE THE ERROR RECOVERY   0877 01755000
*                                      ENTRY                         */ 01756000
AHLS30B  LA    ERRTRNAD,RCOV30C                                    0877 01757000
*   RECPTR=ADDR(MCAREC)+RECLGTH;                                   0878 01758000
         LA    RECPTR,MCAREC(,AWSAPTR)                             0878 01759000
         ALR   RECPTR,RECLGTH                                      0878 01760000
*   PARMPTR=DSNADN30;               /* FIND NEW DSNAME               */ 01761000
         L     @05,REG1LCCA(,LCCAPTR)                              0879 01762000
         L     PARMPTR,DSNADN30(,@05)                              0879 01763000
*   CALL SVDSN;                     /* PLACE DSN IN RECORD           */ 01764000
         BAL   @14,SVDSN                                           0880 01765000
*AHLS30C:                                                          0881 01766000
*   ERRTRNAD=ADDR(RCOV30D);                                        0881 01767000
AHLS30C  LA    ERRTRNAD,RCOV30D                                    0881 01768000
*   RECPTR=ADDR(MCAREC)+RECLGTH;                                   0882 01769000
         LA    RECPTR,MCAREC(,AWSAPTR)                             0882 01770000
         ALR   RECPTR,RECLGTH                                      0882 01771000
*   IF VOLCNT30>MAXVOL THEN         /* CHECK FOR MORE THAN MAX     0883 01772000
*                                      ENTRIES               @YM03653*/ 01773000
         ICM   @05,15,VOLSTA30(AWSAPTR)                            0883 01774000
         CLC   VOLCNT30(2,@05),@CH00294                            0883 01775000
         BNH   @RF00883                                            0883 01776000
*     TEMPLEN=LENGTH(VOLCNT30)+MAXVOL*LENGTH(VOLENT30);/*    @YM03653*/ 01777000
         LA    TEMPLEN,38                                          0884 01778000
*   ELSE                            /*                       @YM03653*/ 01779000
*     TEMPLEN=LENGTH(VOLCNT30)+VOLCNT30*LENGTH(VOLENT30);/*  @YM03653*/ 01780000
         B     @RC00883                                            0885 01781000
@RF00883 ICM   @05,15,VOLSTA30(AWSAPTR)                            0885 01782000
         LH    TEMPLEN,VOLCNT30(,@05)                              0885 01783000
         N     TEMPLEN,@CF04659                                    0885 01784000
         MH    TEMPLEN,@CH04459                                    0885 01785000
         AL    TEMPLEN,@CF00075                                    0885 01786000
*   VOLLEN30=TEMPLEN;               /* PUT VOLST LENGTH IN RECORD  0886 01787000
*                                                            @YM03653*/ 01788000
@RC00883 STC   TEMPLEN,VOLLEN30(,RECPTR)                           0886 01789000
*   SCKPTR=ADDR(VLIST30);           /*                       @YM03653*/ 01790000
         MVC   SCKPTR(4,AWSAPTR),VOLSTA30(AWSAPTR)                 0887 01791000
*   SCKLEN=TEMPLEN;                 /*                       @YM03653*/ 01792000
         ST    TEMPLEN,SCKLEN(,AWSAPTR)                            0888 01793000
*   CALL SCK;                       /*                       @YM03653*/ 01794000
         BAL   @14,SCK                                             0889 01795000
*   VOLIST30(1:TEMPLEN)=VLIST30;    /* GATHER VOLLIST        @YM03653*/ 01796000
         LR    @05,TEMPLEN                                         0890 01797000
         BCTR  @05,0                                               0890 01798000
         ICM   @15,15,VOLSTA30(AWSAPTR)                            0890 01799000
         EX    @05,@SM05748                                        0890 01800000
*   RECLGTH=RECLGTH+VOLLEN30+LENGTH(VOLLEN30);/* UPDATE RECORD LENGTH   01801000
*                                                            @YM03653*/ 01802000
         LR    @05,RECLGTH                                         0891 01803000
         SLR   @15,@15                                             0891 01804000
         IC    @15,VOLLEN30(,RECPTR)                               0891 01805000
         ALR   @05,@15                                             0891 01806000
         AL    @05,@CF00063                                        0891 01807000
         LR    RECLGTH,@05                                         0891 01808000
*   GO TO AHLSVSTK;                                                0892 01809000
         B     AHLSVSTK                                            0892 01810000
*                                                                  0893 01811000
*/********************************************************************/ 01812000
*/*                                                                  */ 01813000
*/*         FINISH BUILDING SVC 31 , 53 , 55 , 57 , 58 , 69          */ 01814000
*/*                                                                  */ 01815000
*/********************************************************************/ 01816000
*                                                                  0893 01817000
*AHLS31:                                                           0893 01818000
*   ERRTRNAD=ADDR(RCOVNAME);                                       0893 01819000
AHLS31   LA    ERRTRNAD,RCOVNAME                                   0893 01820000
*   DCBPTR=ABS(REG1LCCA);                                          0894 01821000
         L     DCBPTR,REG1LCCA(,LCCAPTR)                           0894 01822000
*   IF R1LCCATS<NULL THEN           /* IF NEG THEN ITS AN IOB @    0895 01823000
*                                                            @ZA00425*/ 01824000
         L     @05,R1LCCATS(,LCCAPTR)                              0895 01825000
         LTR   @05,@05                                             0895 01826000
         BNM   @RF00895                                            0895 01827000
*     DO;                           /*                       @ZA00425*/ 01828000
*       GEN(LCR IOBSTPTR,IOBSTPTR); /*                       @ZA00425*/ 01829000
         LCR IOBSTPTR,IOBSTPTR                                          01830000
*       DCBPTR=IOBDCBPB;            /* GET DCB @ FROM IOB    @ZA00425*/ 01831000
         L     @05,IOBDCBPB-1(,IOBSTPTR)                           0898 01832000
         LA    @05,0(,@05)                                         0898 01833000
         LR    DCBPTR,@05                                          0898 01834000
*     END;                                                         0899 01835000
*   GO TO SVDDNCK;                  /* GET DDNAME                    */ 01836000
         B     SVDDNCK                                             0900 01837000
*                                                                  0901 01838000
*/********************************************************************/ 01839000
*/*                                                                  */ 01840000
*/*         FINISH BUILDING SVC 32                                   */ 01841000
*/*                                                                  */ 01842000
*/********************************************************************/ 01843000
*                                                                  0901 01844000
*AHLS32:                                                           0901 01845000
*   ERRTRNAD=ADDR(RCOV32A);         /* SET RETURN ADDR IN CASE OF  0901 01846000
*                                      ERROR                         */ 01847000
AHLS32   LA    ERRTRNAD,RCOV32A                                    0901 01848000
*   UCBPTR=REG1LCCA;                /* PICK UP THE POINTER TO THE UCB*/ 01849000
         L     UCBPTR,REG1LCCA(,LCCAPTR)                           0902 01850000
*   SCKPTR=ADDR(UCBCHAN);                                          0903 01851000
         LA    @05,UCBCHAN(,UCBPTR)                                0903 01852000
         ST    @05,SCKPTR(,AWSAPTR)                                0903 01853000
*   SCKLEN=LENGTH(CUU32);                                          0904 01854000
         MVC   SCKLEN(4,AWSAPTR),@CF00075                          0904 01855000
*   CALL SCK;                                                      0905 01856000
         BAL   @14,SCK                                             0905 01857000
*   CUU32=UCBCHAN;                  /* PLACE CUU INTO RECORD         */ 01858000
         MVC   CUU32(2,AWSAPTR),UCBCHAN(UCBPTR)                    0906 01859000
*   RECLGTH=RECLGTH+LENGTH(CUU32);  /* UPDATE STACK MSG LEN          */ 01860000
         AL    RECLGTH,@CF00075                                    0907 01861000
*AHLS32A:                                                          0908 01862000
*   ERRTRNAD=ADDR(RCOV32B);         /* SETUP ERROR RECOVERY          */ 01863000
AHLS32A  LA    ERRTRNAD,RCOV32B                                    0908 01864000
*   PARMPTR=REG0LCCA;               /* PICK UP ADDR OF JFCB OR MODEL    01865000
*                                      DSCB                          */ 01866000
         L     PARMPTR,REG0LCCA(,LCCAPTR)                          0909 01867000
*   CALL SVDSN;                     /* PLACE DSNAME IN RECORD        */ 01868000
         BAL   @14,SVDSN                                           0910 01869000
*   GO TO AHLSVSTK;                 /* DONE - OUTPUT AND RETURN      */ 01870000
         B     AHLSVSTK                                            0911 01871000
*                                                                  0912 01872000
*/********************************************************************/ 01873000
*/*                                                                  */ 01874000
*/*         FINISH BUILDING SVC 33                                   */ 01875000
*/*                                                                  */ 01876000
*/********************************************************************/ 01877000
*                                                                  0912 01878000
*AHLS33:                                                           0912 01879000
*   ERRTRNAD=ADDR(RCOV33A);         /* SET RETURN ADDR               */ 01880000
AHLS33   LA    ERRTRNAD,RCOV33A                                    0912 01881000
*AHLS33B:                                                          0913 01882000
*   UCBPTR=REG1LCCA;                /* PICK UP THE POINTER TO THE UCB*/ 01883000
AHLS33B  L     UCBPTR,REG1LCCA(,LCCAPTR)                           0913 01884000
*   UCBPTR=UCBPTR&HIODR2BY;         /* ZEROED HI ORDER BYTES @ZA04277*/ 01885000
         N     UCBPTR,@CF04659                                     0914 01886000
*   SCKPTR=ADDR(UCBCHAN);                                          0915 01887000
         LA    @05,UCBCHAN(,UCBPTR)                                0915 01888000
         ST    @05,SCKPTR(,AWSAPTR)                                0915 01889000
*   SCKLEN=LENGTH(CUU33);                                          0916 01890000
         MVC   SCKLEN(4,AWSAPTR),@CF00075                          0916 01891000
*   CALL SCK;                                                      0917 01892000
         BAL   @14,SCK                                             0917 01893000
*   CUU33=UCBCHAN;                  /* PLACE CUU INTO RECORD         */ 01894000
         MVC   CUU33(2,AWSAPTR),UCBCHAN(UCBPTR)                    0918 01895000
*AHLS33A:                                                          0919 01896000
*   RECLGTH=RECLGTH+LENGTH(CUU33);  /* UPDATE MSG LEN BY 2           */ 01897000
AHLS33A  AL    RECLGTH,@CF00075                                    0919 01898000
*   GO TO AHLSVSTK;                 /* FINISHED                      */ 01899000
         B     AHLSVSTK                                            0920 01900000
*                                                                  0921 01901000
*/********************************************************************/ 01902000
*/*                                                                  */ 01903000
*/*         FINISH BUILDING SVC 35                                   */ 01904000
*/*                                                                  */ 01905000
*/********************************************************************/ 01906000
*                                                                  0921 01907000
*AHLS35:                                                           0921 01908000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 01909000
AHLS35   LA    ERRTRNAD,RCOVPLST                                   0921 01910000
*   PARMPTR=REG1LCCA;               /* PICK UP PTR TO PARMLIST       */ 01911000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0922 01912000
*   IF REPLYLN^=NULL THEN                                          0923 01913000
         CLI   REPLYLN(PARMPTR),0                                  0923 01914000
         BE    @RF00923                                            0923 01915000
*     DO;                           /* REPLY LENGTH NOT ZERO       0924 01916000
*                                      INDICATES WTOR AND A 24 BYTE     01917000
*                                      PLIST                         */ 01918000
*/********************************************************************/ 01919000
*/*         WTOR REPLY - 20 BYTES                                    */ 01920000
*/********************************************************************/ 01921000
*                                                                  0925 01922000
*       SCKPTR=ADDR(WTORLSTA);                                     0925 01923000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0925 01924000
*       SCKLEN=LENGTH(WTORLIST);                                   0926 01925000
         MVC   SCKLEN(4,AWSAPTR),@CF00992                          0926 01926000
*       CALL SCK;                                                  0927 01927000
         BAL   @14,SCK                                             0927 01928000
*       WTORLIST=WTORLSTA;          /* MOVE 20 BYTE PARMLIST TO    0928 01929000
*                                      RECORD                        */ 01930000
         MVC   WTORLIST(20,AWSAPTR),WTORLSTA(PARMPTR)              0928 01931000
*       WTORLEN=LENGTH(WTORLIST);   /* UPDATE LENGTH FIELD           */ 01932000
         MVI   WTORLEN(AWSAPTR),X'14'                              0929 01933000
*       IF RRNDHERE=ON THEN         /* CK TO SEE IF R AND D CODES  0930 01934000
*                                      PRESENT                       */ 01935000
         TM    RRNDHERE(PARMPTR),B'10000000'                       0930 01936000
         BNO   @RF00930                                            0930 01937000
*         DO;                                                      0931 01938000
*           PARMPTR=PARMPTR+RMSGLEN+LENGTH(WTORXTRA);/* SKIP MESSAGE    01939000
*                                      TO GET TO R & D CODES         */ 01940000
         LR    @05,PARMPTR                                         0932 01941000
         LH    @15,RMSGLEN(,PARMPTR)                               0932 01942000
         N     @15,@CF04659                                        0932 01943000
         ALR   @05,@15                                             0932 01944000
         AL    @05,@CF00061                                        0932 01945000
         LR    PARMPTR,@05                                         0932 01946000
*           SCKPTR=ADDR(WTORNDA);                                  0933 01947000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0933 01948000
*           SCKLEN=LENGTH(WTORRND);                                0934 01949000
         MVC   SCKLEN(4,AWSAPTR),@CF00055                          0934 01950000
*           CALL SCK;                                              0935 01951000
         BAL   @14,SCK                                             0935 01952000
*           WTORRND=WTORNDA;        /* PICK UP R & D CODES           */ 01953000
         MVC   WTORRND(4,AWSAPTR),WTORNDA(PARMPTR)                 0936 01954000
*           WTORLEN=WTORLEN+LENGTH(WTORRND);/* PLACE 20 INTO LENGTH     01955000
*                                      BYTE                          */ 01956000
         LA    @05,4                                               0937 01957000
         SLR   @15,@15                                             0937 01958000
         IC    @15,WTORLEN(,AWSAPTR)                               0937 01959000
         ALR   @05,@15                                             0937 01960000
         STC   @05,WTORLEN(,AWSAPTR)                               0937 01961000
*         END;                                                     0938 01962000
*       RECLGTH=RECLGTH+WTORLEN+LENGTH(WTORLEN);/* UPDATE RECORD   0939 01963000
*                                      LENGTH                        */ 01964000
@RF00930 LR    @05,RECLGTH                                         0939 01965000
         SLR   @15,@15                                             0939 01966000
         IC    @15,WTORLEN(,AWSAPTR)                               0939 01967000
         ALR   @05,@15                                             0939 01968000
         AL    @05,@CF00063                                        0939 01969000
         LR    RECLGTH,@05                                         0939 01970000
*     END;                                                         0940 01971000
*   ELSE                            /* IT IS A WTO WITH A 16 BYTE  0941 01972000
*                                      PLIST                         */ 01973000
*     DO;                                                          0941 01974000
*                                                                  0941 01975000
         B     @RC00923                                            0941 01976000
@RF00923 DS    0H                                                  0942 01977000
*/********************************************************************/ 01978000
*/*         WTO  - 16 BYTES                                          */ 01979000
*/********************************************************************/ 01980000
*                                                                  0942 01981000
*       SCKPTR=ADDR(WTOLSTA);                                      0942 01982000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0942 01983000
*       SCKLEN=LENGTH(WTOLIST);                                    0943 01984000
         MVC   SCKLEN(4,AWSAPTR),@CF04459                          0943 01985000
*       CALL SCK;                                                  0944 01986000
         BAL   @14,SCK                                             0944 01987000
*       WTOLIST=WTOLSTA;            /* MOVE 16 BYTE PARMLIST TO    0945 01988000
*                                      RECORD                        */ 01989000
         MVC   WTOLIST(12,AWSAPTR),WTOLSTA(PARMPTR)                0945 01990000
*       WTOLEN=LENGTH(WTOLIST);     /* UPDATE LENGTH FIELD           */ 01991000
         MVI   WTOLEN(AWSAPTR),X'0C'                               0946 01992000
*       IF ORNDHERE=ON THEN         /* CK TO SEE IF R AND D CODES ARE   01993000
*                                      PRESENT                       */ 01994000
         TM    ORNDHERE(PARMPTR),B'10000000'                       0947 01995000
         BNO   @RF00947                                            0947 01996000
*         DO;                       /* YES                           */ 01997000
*           PARMPTR=PARMPTR+OMSGLEN;/* SKIP MESSAGE TO GET TO R & D     01998000
*                                      CODES                         */ 01999000
         LH    @05,OMSGLEN(,PARMPTR)                               0949 02000000
         N     @05,@CF04659                                        0949 02001000
         ALR   PARMPTR,@05                                         0949 02002000
*           SCKPTR=ADDR(WTORNDA);                                  0950 02003000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0950 02004000
*           SCKLEN=LENGTH(WTORND);                                 0951 02005000
         MVC   SCKLEN(4,AWSAPTR),@CF00055                          0951 02006000
*           CALL SCK;                                              0952 02007000
         BAL   @14,SCK                                             0952 02008000
*           WTORND=WTORNDA;         /* PICK UP R & D CODES           */ 02009000
         MVC   WTORND(4,AWSAPTR),WTORNDA(PARMPTR)                  0953 02010000
*           WTOLEN=WTOLEN+LENGTH(WTORND);/* PLACE 16 INTO LENGTH BYTE*/ 02011000
         LA    @05,4                                               0954 02012000
         SLR   @15,@15                                             0954 02013000
         IC    @15,WTOLEN(,AWSAPTR)                                0954 02014000
         ALR   @05,@15                                             0954 02015000
         STC   @05,WTOLEN(,AWSAPTR)                                0954 02016000
*         END;                                                     0955 02017000
*       RECLGTH=RECLGTH+WTOLEN+LENGTH(WTOLEN);/* UPDATE RECORD LENGTH*/ 02018000
@RF00947 LR    @05,RECLGTH                                         0956 02019000
         SLR   @15,@15                                             0956 02020000
         IC    @15,WTOLEN(,AWSAPTR)                                0956 02021000
         ALR   @05,@15                                             0956 02022000
         AL    @05,@CF00063                                        0956 02023000
         LR    RECLGTH,@05                                         0956 02024000
*     END;                                                         0957 02025000
*   GO TO AHLSVSTK;                 /* UPDATE STACK MSG LEN          */ 02026000
         B     AHLSVSTK                                            0958 02027000
*                                                                  0959 02028000
*/********************************************************************/ 02029000
*/*                                                                  */ 02030000
*/*         FINISH BUILDING SVC 37 , 40                              */ 02031000
*/*                                                                  */ 02032000
*/********************************************************************/ 02033000
*                                                                  0959 02034000
*AHLS37:                                                           0959 02035000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 02036000
AHLS37   LA    ERRTRNAD,RCOVPLST                                   0959 02037000
*   PARMPTR=REG1LCCA;               /* PICK UP PTR TO PARMS          */ 02038000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0960 02039000
*   GO TO AHLPRM12;                 /* GO MOVE PARMLIST              */ 02040000
         B     AHLPRM12                                            0961 02041000
*                                                                  0962 02042000
*/********************************************************************/ 02043000
*/*                                                                  */ 02044000
*/*         FINISH BUILDING SVC 42                                   */ 02045000
*/*                                                                  */ 02046000
*/********************************************************************/ 02047000
*                                                                  0962 02048000
*AHLS42:                                                           0962 02049000
*   ERRTRNAD=ADDR(RCOV42A);         /* SET RETRY ADDR IN CASE OF   0962 02050000
*                                      ERROR                         */ 02051000
AHLS42   LA    ERRTRNAD,RCOV42A                                    0962 02052000
*   PARMPTR=REGFLCCA;               /* GET ADDR FROM REGS STORED AT     02053000
*                                      INTERRUPT                     */ 02054000
         L     PARMPTR,REGFLCCA(,LCCAPTR)                          0963 02055000
*   IF LSTIND42=ON THEN             /* CHECK FOR EXTENDED LIST       */ 02056000
         TM    LSTIND42(PARMPTR),B'00100000'                       0964 02057000
         BNO   @RF00964                                            0964 02058000
*     DO;                           /* THIS IS AN EXTENDED LIST      */ 02059000
*       SCKPTR=ADDR(SUPLIST);                                      0966 02060000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0966 02061000
*       SCKLEN=LENGTH(SUPLST42);                                   0967 02062000
         MVC   SCKLEN(4,AWSAPTR),@CF00985                          0967 02063000
*       CALL SCK;                                                  0968 02064000
         BAL   @14,SCK                                             0968 02065000
*       SUPLST42=SUPLIST;           /* GATHER EXTENDED PLIST         */ 02066000
         MVC   SUPLST42(60,AWSAPTR),SUPLIST(PARMPTR)               0969 02067000
*       SUPLEN42=LENGTH(SUPLST42);  /* SET LENGTH FIELD              */ 02068000
         MVI   SUPLEN42(AWSAPTR),X'3C'                             0970 02069000
*       RECLGTH=RECLGTH+LENGTH(SUPLST42)+LENGTH(SUPLEN42);/* UPDATE     02070000
*                                      RECORD LENGTH                 */ 02071000
         AL    RECLGTH,@CF05736                                    0971 02072000
*     END;                                                         0972 02073000
*   ELSE                            /* THIS IS AN MVT TYPE LIST      */ 02074000
*     DO;                                                          0973 02075000
         B     @RC00964                                            0973 02076000
@RF00964 DS    0H                                                  0974 02077000
*       SCKPTR=ADDR(SUPLIST);                                      0974 02078000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0974 02079000
*       SCKLEN=LENGTH(SUPMVT);                                     0975 02080000
         MVC   SCKLEN(4,AWSAPTR),@CF00990                          0975 02081000
*       CALL SCK;                                                  0976 02082000
         BAL   @14,SCK                                             0976 02083000
*       SUPMVT=SUPLIST;             /* PICK UP ONLY THE MVT PORTION  */ 02084000
         MVC   SUPMVT(36,AWSAPTR),SUPLIST(PARMPTR)                 0977 02085000
*       SUPLEN42=LENGTH(SUPMVT);    /* SET LENGTH FIELD              */ 02086000
         MVI   SUPLEN42(AWSAPTR),X'24'                             0978 02087000
*       RECLGTH=RECLGTH+LENGTH(SUPMVT)+LENGTH(SUPLEN42);/* UPDATE  0979 02088000
*                                      RECORD LENGTH                 */ 02089000
         AL    RECLGTH,@CF05079                                    0979 02090000
*     END;                                                         0980 02091000
*AHLS42A:                                                          0981 02092000
*   ERRTRNAD=ADDR(RCOV42B);         /* SET RETRY ADDRESS IN CASE OF     02093000
*                                      ERROR                         */ 02094000
@RC00964 DS    0H                                                  0981 02095000
AHLS42A  LA    ERRTRNAD,RCOV42B                                    0981 02096000
*   PARMPTR=REG1LCCA;               /* PICK UP ADDR FROM REGS AT   0982 02097000
*                                      INTERRUPT                     */ 02098000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0982 02099000
*   IF PARMPTR=NULL THEN                                           0983 02100000
         LTR   PARMPTR,PARMPTR                                     0983 02101000
         BNZ   @RF00983                                            0983 02102000
*     DO;                           /* IF PTR IS ZERO , ZERO IS    0984 02103000
*                                      PLACED IN LENGTH FIELD AND NO    02104000
*                                      DATA IS MOVED                 */ 02105000
*       RECPTR=ADDR(MCAREC)+RECLGTH;/* POINT BASE TO NEXT BYTE IN  0985 02106000
*                                      RECORD                @YM03653*/ 02107000
         LA    RECPTR,MCAREC(,AWSAPTR)                             0985 02108000
         ALR   RECPTR,RECLGTH                                      0985 02109000
*       PRMLEN42=NULL;              /* PUT ZERO IN LENGTH FIELD      */ 02110000
         MVI   PRMLEN42(RECPTR),X'00'                              0986 02111000
*       RECLGTH=RECLGTH+LENGTH(PRMLEN42);/* UPDATE RECORD LENGTH     */ 02112000
         AL    RECLGTH,@CF00063                                    0987 02113000
*       GO TO AHLSVSTK;             /* OUTPUT AND RETURN             */ 02114000
         B     AHLSVSTK                                            0988 02115000
*     END;                                                         0989 02116000
*   ELSE                                                           0990 02117000
*     DO;                                                          0990 02118000
@RF00983 DS    0H                                                  0991 02119000
*       RECPTR=PARMPTR;             /* POINT TO THE PLIST TO BE    0991 02120000
*                                      GATHERED                      */ 02121000
         LR    RECPTR,PARMPTR                                      0991 02122000
*       GO TO AHLS1D;               /* OTHERWISE, MOVE VARIABLE    0992 02123000
*                                      LENGTH PARAMETER LIST         */ 02124000
         B     AHLS1D                                              0992 02125000
*     END;                                                         0993 02126000
*                                                                  0994 02127000
*/********************************************************************/ 02128000
*/*                                                                  */ 02129000
*/*         FINISH BUILDING SVC 44 , 62                              */ 02130000
*/*                                                                  */ 02131000
*/********************************************************************/ 02132000
*                                                                  0994 02133000
*AHLS44:                                                           0994 02134000
*   ERRTRNAD=ADDR(RCOVWORD);        /* SET RETURN ADDRESS IN CASE OF    02135000
*                                      ERROR                         */ 02136000
AHLS44   LA    ERRTRNAD,RCOVWORD                                   0994 02137000
*   PARMPTR=REG1LCCA;               /* PICK UP R1 AT INTERRUPT       */ 02138000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          0995 02139000
*   IF PARMPTR=NULL THEN                                           0996 02140000
         LTR   PARMPTR,PARMPTR                                     0996 02141000
         BNZ   @RF00996                                            0996 02142000
*     TCBAD44=PSATOLD;              /* IF PTR TO TCBPTR IS 0, USE  0997 02143000
*                                      CURRENT TCB                   */ 02144000
         MVC   TCBAD44(4,AWSAPTR),PSATOLD                          0997 02145000
*   ELSE                                                           0998 02146000
*     DO;                                                          0998 02147000
         B     @RC00996                                            0998 02148000
@RF00996 DS    0H                                                  0999 02149000
*       SCKPTR=ADDR(ADDRTCB);                                      0999 02150000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            0999 02151000
*       SCKLEN=LENGTH(TCBAD44);                                    1000 02152000
         MVC   SCKLEN(4,AWSAPTR),@CF00055                          1000 02153000
*       CALL SCK;                                                  1001 02154000
         BAL   @14,SCK                                             1001 02155000
*       TCBAD44=ADDRTCB;            /* OTHERWISE, USE ONE LOCATED BY    02156000
*                                      PTR                           */ 02157000
         MVC   TCBAD44(4,AWSAPTR),ADDRTCB(PARMPTR)                 1002 02158000
*     END;                                                         1003 02159000
*   RECLGTH=RECLGTH+LENGTH(TCBAD44);/* UPDATE STACK MSG LEN          */ 02160000
@RC00996 AL    RECLGTH,@CF00055                                    1004 02161000
*   GO TO AHLSVSTK;                 /* OUTPUT AND RETURN             */ 02162000
         B     AHLSVSTK                                            1005 02163000
*                                                                  1006 02164000
*/********************************************************************/ 02165000
*/*                                                                  */ 02166000
*/*         FINISH BUILDING SVC 45                                   */ 02167000
*/*                                                                  */ 02168000
*/********************************************************************/ 02169000
*                                                                  1006 02170000
*AHLS45:                                                           1006 02171000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 02172000
AHLS45   LA    ERRTRNAD,RCOVPLST                                   1006 02173000
*   PARMPTR=REGFLCCA;               /* POINT TO PARMLIST             */ 02174000
         L     PARMPTR,REGFLCCA(,LCCAPTR)                          1007 02175000
*   GO TO AHLPRM12;                 /* MOVE PARMLIST INTO RECORD     */ 02176000
         B     AHLPRM12                                            1008 02177000
*                                                                  1009 02178000
*/********************************************************************/ 02179000
*/*                                                                  */ 02180000
*/*         FINISH BUILDING SVC 47                                   */ 02181000
*/*                                                                  */ 02182000
*/********************************************************************/ 02183000
*                                                                  1009 02184000
*AHLS47:                                                           1009 02185000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 02186000
AHLS47   LA    ERRTRNAD,RCOVPLST                                   1009 02187000
*   PARMPTR=REG1LCCA;               /* PICK UP PTR TO PARMLIST       */ 02188000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          1010 02189000
*   IF TIMEROP<DINTVL THEN                                         1011 02190000
*                                                                  1011 02191000
         CLI   TIMEROP+72(LCCAPTR),X'30'                           1011 02192000
         BNL   @RF01011                                            1011 02193000
*     /***************************************************************/ 02194000
*     /*                                                             */ 02195000
*     /* BINTVL / TUINTVL OPTION                                     */ 02196000
*     /*                                                             */ 02197000
*     /***************************************************************/ 02198000
*                                                                  1012 02199000
*AHLPRM4:                                                          1012 02200000
*     DO;                                                          1012 02201000
AHLPRM4  DS    0H                                                  1013 02202000
*       SCKPTR=ADDR(TIME4BYT);                                     1013 02203000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            1013 02204000
*       SCKLEN=LENGTH(PRM4BYT);                                    1014 02205000
         MVC   SCKLEN(4,AWSAPTR),@CF00055                          1014 02206000
*       CALL SCK;                                                  1015 02207000
         BAL   @14,SCK                                             1015 02208000
*       PRM4BYT=TIME4BYT;           /* PLACE 4 BYTES INTO RECORD     */ 02209000
         MVC   PRM4BYT(4,AWSAPTR),TIME4BYT(PARMPTR)                1016 02210000
*       LEN47A=LENGTH(PRM4BYT);     /* PLACE 4 INTO LENGTH FIELD     */ 02211000
         MVI   LEN47A(AWSAPTR),X'04'                               1017 02212000
*     END;                                                         1018 02213000
*   ELSE                                                           1019 02214000
*                                                                  1019 02215000
*     /***************************************************************/ 02216000
*     /*                                                             */ 02217000
*     /* DINTVAL / TOD OPTION                                        */ 02218000
*     /*                                                             */ 02219000
*     /***************************************************************/ 02220000
*                                                                  1019 02221000
*AHLPRM8:                                                          1019 02222000
*     DO;                           /* DINTVAL/TOD OPTION            */ 02223000
         B     @RC01011                                            1019 02224000
@RF01011 DS    0H                                                  1019 02225000
AHLPRM8  DS    0H                                                  1020 02226000
*       SCKPTR=ADDR(TIME8BYT);                                     1020 02227000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            1020 02228000
*       SCKLEN=LENGTH(PRM8BYT);                                    1021 02229000
         MVC   SCKLEN(4,AWSAPTR),@CF00061                          1021 02230000
*       CALL SCK;                                                  1022 02231000
         BAL   @14,SCK                                             1022 02232000
*       PRM8BYT=TIME8BYT;           /* PLACE 8 BYTES INTO RECORD     */ 02233000
         MVC   PRM8BYT(8,AWSAPTR),TIME8BYT(PARMPTR)                1023 02234000
*       LEN47=LENGTH(PRM8BYT);      /* PLACE 8 INTO LENGTH           */ 02235000
         MVI   LEN47(AWSAPTR),X'08'                                1024 02236000
*     END;                                                         1025 02237000
*   RECLGTH=RECLGTH+LEN47+LENGTH(LEN47);/* UPDATE STACK RECLGTH      */ 02238000
@RC01011 LR    @05,RECLGTH                                         1026 02239000
         SLR   @15,@15                                             1026 02240000
         IC    @15,LEN47(,AWSAPTR)                                 1026 02241000
         ALR   @05,@15                                             1026 02242000
         AL    @05,@CF00063                                        1026 02243000
         LR    RECLGTH,@05                                         1026 02244000
*   GO TO AHLSVSTK;                 /* UPDATE MSG LEN AND QUIT       */ 02245000
         B     AHLSVSTK                                            1027 02246000
*                                                                  1028 02247000
*/********************************************************************/ 02248000
*/*                                                                  */ 02249000
*/*         FINISH BUILDING SVC 48 , 56                              */ 02250000
*/*                                                                  */ 02251000
*/********************************************************************/ 02252000
*                                                                  1028 02253000
*AHLS48:                                                           1028 02254000
*   ERRTRNAD=ADDR(RCOV48A);         /* SET RETRY ADDRESS FOR INLINE  */ 02255000
AHLS48   LA    ERRTRNAD,RCOV48A                                    1028 02256000
*   PARMPTR=REG1LCCA-4;             /* SET UP PLIST PTR TO BACK UP 1029 02257000
*                                      FOR TCB ADDR                  */ 02258000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          1029 02259000
         SL    PARMPTR,@CF00055                                    1029 02260000
*   SCKPTR=ADDR(PLSTA48);                                          1030 02261000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            1030 02262000
*   SCKLEN=LENGTH(PLST48);                                         1031 02263000
         MVC   SCKLEN(4,AWSAPTR),@CF00992                          1031 02264000
*   CALL SCK;                                                      1032 02265000
         BAL   @14,SCK                                             1032 02266000
*   PLST48=PLSTA48;                 /* PICK UP PLIST                 */ 02267000
         MVC   PLST48(20,AWSAPTR),PLSTA48(PARMPTR)                 1033 02268000
*   RECLGTH=RECLGTH+LENGTH(PLST48); /* UPDATE RECORD LENGTH          */ 02269000
         AL    RECLGTH,@CF00992                                    1034 02270000
*   ERRTRNAD=ADDR(RCOV48B);         /* SET RETRY ADDRESS             */ 02271000
         LA    ERRTRNAD,RCOV48B                                    1035 02272000
*   SCKPTR=ADDR(MAJOR);                                            1036 02273000
         L     @05,MAJA48(,PARMPTR)                                1036 02274000
         ST    @05,SCKPTR(,AWSAPTR)                                1036 02275000
*   SCKLEN=LENGTH(MAJ48);                                          1037 02276000
         MVC   SCKLEN(4,AWSAPTR),@CF00061                          1037 02277000
*   CALL SCK;                                                      1038 02278000
         BAL   @14,SCK                                             1038 02279000
*   MAJ48=MAJOR;                    /* PICK UP MAJOR RESOURCE NAME   */ 02280000
         L     @05,MAJA48(,PARMPTR)                                1039 02281000
         MVC   MAJ48(8,AWSAPTR),MAJOR(@05)                         1039 02282000
*   RECLGTH=RECLGTH+LENGTH(MAJ48);  /* UPDATE RECORD LENGTH          */ 02283000
         AL    RECLGTH,@CF00061                                    1040 02284000
*AHLS48B:                                                          1041 02285000
*   ERRTRNAD=ADDR(RCOV48C);         /* SET RETRY ADDRE FOR MINOR     */ 02286000
AHLS48B  LA    ERRTRNAD,RCOV48C                                    1041 02287000
*   IF MINL48=0 THEN                /* CHECK TO SEE IF THE MAIN MIN     02288000
*                                      LENGTH IS ZERO                */ 02289000
         CLI   MINL48(PARMPTR),0                                   1042 02290000
         BNE   @RF01042                                            1042 02291000
*     DO;                                                          1043 02292000
*       IF MINL482<=MAXMINOR THEN                                  1044 02293000
         L     @05,MINA48(,PARMPTR)                                1044 02294000
         CLI   MINL482(@05),44                                     1044 02295000
         BH    @RF01044                                            1044 02296000
*         MINLEN48=MINL482;         /* IT IS SO PICK UP THE ALTERNATE   02297000
*                                      MIN LENGTH FIELD IF IN      1045 02298000
*                                      ACCEPTABLE RANGE      @YM03655*/ 02299000
         IC    @15,MINL482(,@05)                                   1045 02300000
         STC   @15,MINLEN48(,AWSAPTR)                              1045 02301000
*       ELSE                                                       1046 02302000
*         MINLEN48=MAXMINOR;        /* OTHERWISE, USE MAXIMUM      1046 02303000
*                                                            @YM03655*/ 02304000
         B     @RC01044                                            1046 02305000
@RF01044 MVI   MINLEN48(AWSAPTR),X'2C'                             1046 02306000
*       SCKPTR=ADDR(MINOR2);                                       1047 02307000
@RC01044 L     @05,MINA48(,PARMPTR)                                1047 02308000
         LA    @05,MINOR2(,@05)                                    1047 02309000
         ST    @05,SCKPTR(,AWSAPTR)                                1047 02310000
*       SCKLEN=MINLEN48;                                           1048 02311000
         SLR   @05,@05                                             1048 02312000
         IC    @05,MINLEN48(,AWSAPTR)                              1048 02313000
         ST    @05,SCKLEN(,AWSAPTR)                                1048 02314000
*       CALL SCK;                                                  1049 02315000
         BAL   @14,SCK                                             1049 02316000
*       MIN48(1:MINLEN48)=MINOR2;   /* GET THE ALTERNATE MINOR NAME  */ 02317000
         SLR   @05,@05                                             1050 02318000
         IC    @05,MINLEN48(,AWSAPTR)                              1050 02319000
         BCTR  @05,0                                               1050 02320000
         L     @15,MINA48(,PARMPTR)                                1050 02321000
         EX    @05,@SM05750                                        1050 02322000
*     END;                                                         1051 02323000
*   ELSE                                                           1052 02324000
*     DO;                                                          1052 02325000
         B     @RC01042                                            1052 02326000
@RF01042 DS    0H                                                  1053 02327000
*       IF MINL48<=MAXMINOR THEN                                   1053 02328000
         CLI   MINL48(PARMPTR),44                                  1053 02329000
         BH    @RF01053                                            1053 02330000
*         MINLEN48=MINL48;          /* IS NOT ZERO SO PICK UP LENGTH    02331000
*                                      FROM MAIN FIELD IF IN THE   1054 02332000
*                                      ACCEPTABLE RANGE      @YM03655*/ 02333000
         IC    @05,MINL48(,PARMPTR)                                1054 02334000
         STC   @05,MINLEN48(,AWSAPTR)                              1054 02335000
*       ELSE                                                       1055 02336000
*         MINLEN48=MAXMINOR;        /* OTHERWISE, USE THE MAXIMUM  1055 02337000
*                                                            @YM03655*/ 02338000
         B     @RC01053                                            1055 02339000
@RF01053 MVI   MINLEN48(AWSAPTR),X'2C'                             1055 02340000
*       SCKPTR=ADDR(MINOR);                                        1056 02341000
@RC01053 L     @05,MINA48(,PARMPTR)                                1056 02342000
         ST    @05,SCKPTR(,AWSAPTR)                                1056 02343000
*       SCKLEN=MINLEN48;                                           1057 02344000
         SLR   @05,@05                                             1057 02345000
         IC    @05,MINLEN48(,AWSAPTR)                              1057 02346000
         ST    @05,SCKLEN(,AWSAPTR)                                1057 02347000
*       CALL SCK;                                                  1058 02348000
         BAL   @14,SCK                                             1058 02349000
*       MIN48(1:MINLEN48)=MINOR;    /* PICK UP MINOR RESOURCE NAME   */ 02350000
         SLR   @05,@05                                             1059 02351000
         IC    @05,MINLEN48(,AWSAPTR)                              1059 02352000
         BCTR  @05,0                                               1059 02353000
         L     @15,MINA48(,PARMPTR)                                1059 02354000
         EX    @05,@SM05752                                        1059 02355000
*     END;                                                         1060 02356000
*   RECLGTH=RECLGTH+MINLEN48+LENGTH(MINLEN48);/* UPDATE RECORD LENGTH*/ 02357000
@RC01042 LR    @05,RECLGTH                                         1061 02358000
         SLR   @15,@15                                             1061 02359000
         IC    @15,MINLEN48(,AWSAPTR)                              1061 02360000
         ALR   @05,@15                                             1061 02361000
         AL    @05,@CF00063                                        1061 02362000
         LR    RECLGTH,@05                                         1061 02363000
*   GO TO AHLSVSTK;                 /* GO STACK THE RECORD           */ 02364000
         B     AHLSVSTK                                            1062 02365000
*                                                                  1063 02366000
*/********************************************************************/ 02367000
*/*                                                                  */ 02368000
*/*         FINISH BUILDING SVC 51                                   */ 02369000
*/*                                                                  */ 02370000
*/********************************************************************/ 02371000
*                                                                  1063 02372000
*AHLS51:                                                           1063 02373000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SET ERROR RECOVERY            */ 02374000
AHLS51   LA    ERRTRNAD,RCOVPLST                                   1063 02375000
*   PARMPTR=REG1LCCA;               /* PICK UP LIST ADDR FROM SAVE 1064 02376000
*                                      AREA                          */ 02377000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          1064 02378000
*   IF SVCDMPID^='80'X              /* IF ZERO - NOT AN SVC DUMP     */ 02379000
*     THEN                                                         1065 02380000
         CLI   SVCDMPID(PARMPTR),X'80'                             1065 02381000
         BE    @RF01065                                            1065 02382000
*     DO;                                                          1066 02383000
*                                                                  1066 02384000
*       /*************************************************************/ 02385000
*       /*                                                           */ 02386000
*       /* ABDUMP / SNAP INTERRUPT - USE 12 BYTE FORMAT              */ 02387000
*       /*                                                           */ 02388000
*       /*************************************************************/ 02389000
*                                                                  1067 02390000
*       SCKPTR=ADDR(LSTSNAP);                                      1067 02391000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            1067 02392000
*       SCKLEN=LENGTH(LIST51A);                                    1068 02393000
         MVC   SCKLEN(4,AWSAPTR),@CF00992                          1068 02394000
*       CALL SCK;                                                  1069 02395000
         BAL   @14,SCK                                             1069 02396000
*       LIST51A=LSTSNAP;            /* PLACE 20 BYTES INTO RECORD    */ 02397000
         MVC   LIST51A(20,AWSAPTR),LSTSNAP(PARMPTR)                1070 02398000
*       LEN51A=LENGTH(LIST51A);     /* PUT PARMLIST LENGTH INTO LEN     02399000
*                                      FIELD                         */ 02400000
         MVI   LEN51A(AWSAPTR),X'14'                               1071 02401000
*       RECLGTH=RECLGTH+LENGTH(PARM51A);/* UPDATE MSG LENGTH @YM03653*/ 02402000
         AL    RECLGTH,@CF05067                                    1072 02403000
*       GO TO AHLSVSTK;             /* OUTPUT AND RETURN             */ 02404000
         B     AHLSVSTK                                            1073 02405000
*     END;                                                         1074 02406000
*                                                                  1074 02407000
*/********************************************************************/ 02408000
*/*         SVC DUMP - USE 16 BYTE FORMAT + MODULE NAME              */ 02409000
*/********************************************************************/ 02410000
*                                                                  1075 02411000
*   SCKPTR=ADDR(LSTSVCDP);                                         1075 02412000
@RF01065 ST    PARMPTR,SCKPTR(,AWSAPTR)                            1075 02413000
*   SCKLEN=LENGTH(LIST51B);                                        1076 02414000
         MVC   SCKLEN(4,AWSAPTR),@CF00072                          1076 02415000
*   CALL SCK;                                                      1077 02416000
         BAL   @14,SCK                                             1077 02417000
*   LIST51B=LSTSVCDP;               /* MOVE 16 BYTE PARMLIST TO    1078 02418000
*                                      RECORD                        */ 02419000
         MVC   LIST51B(24,AWSAPTR),LSTSVCDP(PARMPTR)               1078 02420000
*   LEN51B=LENGTH(LIST51B);         /* SET PARMLIST LENGTH TO 16     */ 02421000
         MVI   LEN51B(AWSAPTR),X'18'                               1079 02422000
*   RECLGTH=RECLGTH+LENGTH(PARM51B);/* UPDATE STACK MSG LEN  @YM03653*/ 02423000
         AL    RECLGTH,@CF05071                                    1080 02424000
*   GO TO AHLSVSTK;                 /* OUTPUT AND RETURN             */ 02425000
         B     AHLSVSTK                                            1081 02426000
*                                                                  1082 02427000
*   /*****************************************************************/ 02428000
*   /*                                                               */ 02429000
*   /* FINISH BUILDING SVC 52                                        */ 02430000
*   /*                                                               */ 02431000
*   /*****************************************************************/ 02432000
*                                                                  1082 02433000
*AHLS52:                                                           1082 02434000
*   ERRTRNAD=ADDR(RCOV52A);         /* SETUP ERROR RECOVERY          */ 02435000
AHLS52   LA    ERRTRNAD,RCOV52A                                    1082 02436000
*   PARMPTR=REG1LCCA;               /* PICK UP PLIST POINTER         */ 02437000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          1083 02438000
*   SCKPTR=ADDR(PARML52);                                          1084 02439000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            1084 02440000
*   SCKLEN=LENGTH(PARM52);                                         1085 02441000
         MVC   SCKLEN(4,AWSAPTR),@CF02196                          1085 02442000
*   CALL SCK;                                                      1086 02443000
         BAL   @14,SCK                                             1086 02444000
*   PARM52=PARML52;                 /* MOVE PLIST INTO RECORD        */ 02445000
         MVC   PARM52(52,AWSAPTR),PARML52(PARMPTR)                 1087 02446000
*   RECLGTH=RECLGTH+LENGTH(PARM52); /* UPDATE RECORD LENGTH          */ 02447000
         AL    RECLGTH,@CF02196                                    1088 02448000
*   GO TO AHLSVSTK;                 /* GO AND STACK THE RECORD       */ 02449000
         B     AHLSVSTK                                            1089 02450000
*                                                                  1090 02451000
*/********************************************************************/ 02452000
*/*                                                                  */ 02453000
*/*                   FINISH BUILDING SVC 54                         */ 02454000
*/*                                                                  */ 02455000
*/********************************************************************/ 02456000
*                                                                  1090 02457000
*AHLS54:                                                           1090 02458000
*   ERRTRNAD=ADDR(RCOV0A);          /* SET ERROR RETURN TO MOVE 16 1090 02459000
*                                      ASTERISKS INTO RECORD         */ 02460000
AHLS54   LA    ERRTRNAD,RCOV0A                                     1090 02461000
*   DCBPTR=REG1LCCA;                /* DCB ADDR FROM DECB            */ 02462000
         L     DCBPTR,REG1LCCA(,LCCAPTR)                           1091 02463000
*   GO TO AHLS0A;                   /* GO FINISH RECORD              */ 02464000
         B     AHLS0A                                              1092 02465000
*/********************************************************************/ 02466000
*/*                                                                  */ 02467000
*/*                   FINISH BUILDING SVC 60                         */ 02468000
*/*                                                                  */ 02469000
*/********************************************************************/ 02470000
*                                                                  1093 02471000
*AHLS60:                                                           1093 02472000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY  @YM06304*/ 02473000
AHLS60   LA    ERRTRNAD,RCOVPLST                                   1093 02474000
*   IF SVCR0(4:4)='04'X|SVCR0(4:4)='84'X THEN/* ESTAE CANCELLED,THERE   02475000
*                                      S NO PARM LIST        @YM06304*/ 02476000
         CLI   SVCR0+3(AWSAPTR),X'04'                              1094 02477000
         BE    @RT01094                                            1094 02478000
         CLI   SVCR0+3(AWSAPTR),X'84'                              1094 02479000
         BNE   @RF01094                                            1094 02480000
@RT01094 DS    0H                                                  1095 02481000
*     DO;                           /*                       @YM06304*/ 02482000
*       LEN18='00'X;                /* SET LENGTH OF PARM LIST=0   1096 02483000
*                                                            @YM06304*/ 02484000
         MVI   LEN18(AWSAPTR),X'00'                                1096 02485000
*       RECLGTH=RECLGTH+1;          /* COMPUTE TOTAL RECORD LENGTH 1097 02486000
*                                                            @YM06304*/ 02487000
         AL    RECLGTH,@CF00063                                    1097 02488000
*       GO TO AHLSVSTK;             /*                       @YM06304*/ 02489000
         B     AHLSVSTK                                            1098 02490000
*     END;                                                         1099 02491000
*   PARMPTR=REG1LCCA;               /* PICK UP PTR TO PARMS  @YM06304*/ 02492000
@RF01094 L     PARMPTR,REG1LCCA(,LCCAPTR)                          1100 02493000
*   GO TO AHLPRM12;                 /* GO MOVE PARMLIST      @YM06304*/ 02494000
         B     AHLPRM12                                            1101 02495000
*                                                                  1102 02496000
*/********************************************************************/ 02497000
*/*                                                                  */ 02498000
*/*         FINISH BUILDING SVC 63                                   */ 02499000
*/*                                                                  */ 02500000
*/********************************************************************/ 02501000
*                                                                  1102 02502000
*AHLS63:                                                           1102 02503000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 02504000
AHLS63   LA    ERRTRNAD,RCOVPLST                                   1102 02505000
*   PARMPTR=REG1LCCA;               /* PICK UP PARMLIST ADDR         */ 02506000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          1103 02507000
*   IF PARMPTR^=0 THEN                                             1104 02508000
         LTR   PARMPTR,PARMPTR                                     1104 02509000
         BNZ   @RT01104                                            1104 02510000
*     GO TO AHLPRM8;                /* MOVE 8 BYTES OF PARMLIST IF 1105 02511000
*                                      ADDR IS GOOD                  */ 02512000
*   LEN47=NULL;                     /* IF NO PARMLIST ADDR, PLACE 0     02513000
*                                      IN LEN BYTE                   */ 02514000
         MVI   LEN47(AWSAPTR),X'00'                                1106 02515000
*   RECLGTH=RECLGTH+LENGTH(LEN47);  /* UPDATE RECLENGTH              */ 02516000
         AL    RECLGTH,@CF00063                                    1107 02517000
*   GO TO AHLSVSTK;                 /* OUTPUT AND QUIT               */ 02518000
         B     AHLSVSTK                                            1108 02519000
*                                                                  1109 02520000
*/********************************************************************/ 02521000
*/*                                                                  */ 02522000
*/*         FINISH BUILDING SVC 66                                   */ 02523000
*/*                                                                  */ 02524000
*/********************************************************************/ 02525000
*                                                                  1109 02526000
*AHLS66:                                                           1109 02527000
*   ERRTRNAD=ADDR(RCOV66A);         /* SET RETURN ADDRESS IN CASE OF    02528000
*                                      ERROR                         */ 02529000
AHLS66   LA    ERRTRNAD,RCOV66A                                    1109 02530000
*   SCKPTR=ADDR(REG1LCCA->IOBERINF);                               1110 02531000
         L     @05,REG1LCCA(,LCCAPTR)                              1110 02532000
         LA    @05,IOBERINF(,@05)                                  1110 02533000
         ST    @05,SCKPTR(,AWSAPTR)                                1110 02534000
*   SCKLEN=LENGTH(ERINF66);                                        1111 02535000
         MVC   SCKLEN(4,AWSAPTR),@CF00929                          1111 02536000
*   CALL SCK;                                                      1112 02537000
         BAL   @14,SCK                                             1112 02538000
*   ERINF66=REG1LCCA->IOBERINF;     /* PLACE 8 BYTES OF ERROR INFO 1113 02539000
*                                      INTO RECORD                   */ 02540000
         L     @05,REG1LCCA(,LCCAPTR)                              1113 02541000
         MVC   ERINF66(16,AWSAPTR),IOBERINF(@05)                   1113 02542000
*   RECLGTH=RECLGTH+LENGTH(IOBERINF);/* UPDATE MSG LENGTH            */ 02543000
         AL    RECLGTH,@CF00929                                    1114 02544000
*   GO TO AHLSVSTK;                 /* FINISHED                      */ 02545000
         B     AHLSVSTK                                            1115 02546000
*                                                                  1116 02547000
*/********************************************************************/ 02548000
*/*                                                                  */ 02549000
*/*         FINISH BUILDING SVC 70                                   */ 02550000
*/*                                                                  */ 02551000
*/********************************************************************/ 02552000
*                                                                  1116 02553000
*AHLS70:                                                           1116 02554000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 02555000
AHLS70   LA    ERRTRNAD,RCOVPLST                                   1116 02556000
*   PARMPTR=REG1LCCA;               /* PICK UP PARMLIST PTR          */ 02557000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          1117 02558000
*   GO TO AHLPRM4;                  /* GO MOVE PARMLIST              */ 02559000
         B     AHLPRM4                                             1118 02560000
*                                                                  1119 02561000
*/********************************************************************/ 02562000
*/*                                                                  */ 02563000
*/*         FINISH BUILDING SVC 71                                   */ 02564000
*/*                                                                  */ 02565000
*/********************************************************************/ 02566000
*                                                                  1119 02567000
*AHLS71:                                                           1119 02568000
*   ERRTRNAD=ADDR(RCOV71A);         /* SET RETURN ADDR IN CASE OF  1119 02569000
*                                      ERROR                         */ 02570000
AHLS71   LA    ERRTRNAD,RCOV71A                                    1119 02571000
*   SCKPTR=ADDR(LSTPRM71);                                         1120 02572000
         L     @05,REG1LCCA(,LCCAPTR)                              1120 02573000
         ST    @05,SCKPTR(,AWSAPTR)                                1120 02574000
*   SCKLEN=LENGTH(PRMLST71);                                       1121 02575000
         MVC   SCKLEN(4,AWSAPTR),@CF00929                          1121 02576000
*   CALL SCK;                                                      1122 02577000
         BAL   @14,SCK                                             1122 02578000
*   PRMLST71=LSTPRM71;              /* MOVE 16 BYTE PARMLIST INTO  1123 02579000
*                                      RECORD                        */ 02580000
         L     @05,REG1LCCA(,LCCAPTR)                              1123 02581000
         MVC   PRMLST71(16,AWSAPTR),LSTPRM71(@05)                  1123 02582000
*   RECLGTH=RECLGTH+LENGTH(PRMLST71);/* UPDATE STACK MSG LEN         */ 02583000
         AL    RECLGTH,@CF00929                                    1124 02584000
*   ERRTRNAD=ADDR(RCOVNAME);        /* SET ERROR RETURN ADDR FOR CODE   02585000
*                                      IN SVDDN SUBROUTINE           */ 02586000
         LA    ERRTRNAD,RCOVNAME                                   1125 02587000
*   DCBPTR=DCBAD71;                 /* PICK UP DCB ADDRESS           */ 02588000
         L     DCBPTR,DCBAD71(,@05)                                1126 02589000
*   GO TO SVDDNCK;                  /* PASS IT TO DDNAME ROUTINE     */ 02590000
         B     SVDDNCK                                             1127 02591000
*                                                                  1128 02592000
*/********************************************************************/ 02593000
*/*                                                                  */ 02594000
*/*         FINISH BUILDING SVC 73 , 74                              */ 02595000
*/*                                                                  */ 02596000
*/********************************************************************/ 02597000
*                                                                  1128 02598000
*AHLS73:                                                           1128 02599000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 02600000
AHLS73   LA    ERRTRNAD,RCOVPLST                                   1128 02601000
*   PARMPTR=REG1LCCA;               /* PICK UP PTR TO THE PKIST    1129 02602000
*                                                            @YM03655*/ 02603000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          1129 02604000
*   IF PRMLEN73>=MAXLST73 THEN                                     1130 02605000
         LH    @05,PRMLEN73(,PARMPTR)                              1130 02606000
         C     @05,@CF04642                                        1130 02607000
         BL    @RF01130                                            1130 02608000
*     TEMPLEN=MAXBYT73;             /* SET COUNT TO MAXIMUM(40) IF 1131 02609000
*                                      COUNT IN LIST GT OR =         */ 02610000
         LA    TEMPLEN,44                                          1131 02611000
*   ELSE                                                           1132 02612000
*     TEMPLEN=(PRMLEN73*WRDCNT)+4;  /* OTHERWISE,PICK UP CORRECT NO.    02613000
*                                      OF BYTES              @YM04521*/ 02614000
         B     @RC01130                                            1132 02615000
@RF01130 LH    TEMPLEN,PRMLEN73(,PARMPTR)                          1132 02616000
         SLA   TEMPLEN,2                                           1132 02617000
         AL    TEMPLEN,@CF00055                                    1132 02618000
*   IF TEMPLEN>NULL THEN                                           1133 02619000
@RC01130 LTR   TEMPLEN,TEMPLEN                                     1133 02620000
         BNP   @RF01133                                            1133 02621000
*     DO;                                                          1134 02622000
*       SCKPTR=ADDR(PARM73);                                       1135 02623000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            1135 02624000
*       SCKLEN=TEMPLEN;                                            1136 02625000
         ST    TEMPLEN,SCKLEN(,AWSAPTR)                            1136 02626000
*       CALL SCK;                                                  1137 02627000
         BAL   @14,SCK                                             1137 02628000
*       PRMLST73(1:TEMPLEN)=PARM73; /* MOVE IN NEC- ESSARY NO. OF  1138 02629000
*                                      BYTES                         */ 02630000
         LR    @05,TEMPLEN                                         1138 02631000
         BCTR  @05,0                                               1138 02632000
         EX    @05,@SM05754                                        1138 02633000
*     END;                                                         1139 02634000
*   LEN73=TEMPLEN;                  /* MOVE LENGTH BYTE TO RECORD    */ 02635000
@RF01133 STC   TEMPLEN,LEN73(,AWSAPTR)                             1140 02636000
*   RECLGTH=RECLGTH+TEMPLEN+LENGTH(LEN73);/* UPDATE STACK MESSAGE  1141 02637000
*                                      LENGTH                        */ 02638000
         LR    @05,RECLGTH                                         1141 02639000
         ALR   @05,TEMPLEN                                         1141 02640000
         AL    @05,@CF00063                                        1141 02641000
         LR    RECLGTH,@05                                         1141 02642000
*   GO TO AHLSVSTK;                 /* DONE                          */ 02643000
         B     AHLSVSTK                                            1142 02644000
*                                                                  1143 02645000
*/********************************************************************/ 02646000
*/*                                                                  */ 02647000
*/*         FINISH BUILDING SVC 75                                   */ 02648000
*/*                                                                  */ 02649000
*/********************************************************************/ 02650000
*                                                                  1143 02651000
*AHLS75:                                                           1143 02652000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 02653000
AHLS75   LA    ERRTRNAD,RCOVPLST                                   1143 02654000
*   PARMPTR=REG0LCCA;               /* PICK UP PTR TO IQE            */ 02655000
         L     PARMPTR,REG0LCCA(,LCCAPTR)                          1144 02656000
*   IF PARMPTR^=NULL THEN                                          1145 02657000
         LTR   PARMPTR,PARMPTR                                     1145 02658000
         BNZ   @RT01145                                            1145 02659000
*     GO TO AHLPRM12;               /* IF 1QE ADDR IS NOT ZERO, PICK    02660000
*                                      UP AND MOVE 12 BYTE IQE       */ 02661000
*   LEN73=NULL;                     /* IF IQE ADDR IS ZERO, INDI-  1147 02662000
*                                      CATE WITH ZERO LENGTH         */ 02663000
         MVI   LEN73(AWSAPTR),X'00'                                1147 02664000
*   RECLGTH=RECLGTH+LENGTH(LEN73);  /* UPDATE LENGTH                 */ 02665000
         AL    RECLGTH,@CF00063                                    1148 02666000
*   GO TO AHLSVSTK;                 /* OUTPUT AND RETURN             */ 02667000
         B     AHLSVSTK                                            1149 02668000
*                                                                  1150 02669000
*/********************************************************************/ 02670000
*/*                                                                  */ 02671000
*/*         FINISH BUILDING SVC 77                                   */ 02672000
*/*                                                                  */ 02673000
*/********************************************************************/ 02674000
*                                                                  1150 02675000
*AHLS77:                                                           1150 02676000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 02677000
AHLS77   LA    ERRTRNAD,RCOVPLST                                   1150 02678000
*   SCKPTR=ADDR(PRM14BYT);                                         1151 02679000
         L     @05,REG1LCCA(,LCCAPTR)                              1151 02680000
         ST    @05,SCKPTR(,AWSAPTR)                                1151 02681000
*   SCKLEN=LENGTH(PRMLST77);                                       1152 02682000
         MVC   SCKLEN(4,AWSAPTR),@CF04344                          1152 02683000
*   CALL SCK;                                                      1153 02684000
         BAL   @14,SCK                                             1153 02685000
*   PRMLST77=PRM14BYT;              /* PLACE 14 BYTES OF PARMLIST  1154 02686000
*                                      INTO RECORD                   */ 02687000
         L     @05,REG1LCCA(,LCCAPTR)                              1154 02688000
         MVC   PRMLST77(14,AWSAPTR),PRM14BYT(@05)                  1154 02689000
*   LEN77=LENGTH(PRMLST77);         /* PLACE 14 INTO LENGTH BYTE     */ 02690000
         LA    @05,14                                              1155 02691000
         STC   @05,LEN77(,AWSAPTR)                                 1155 02692000
*   RECLGTH=RECLGTH+LEN77+LENGTH(LEN77);                           1156 02693000
         ALR   @05,RECLGTH                                         1156 02694000
         AL    @05,@CF00063                                        1156 02695000
         LR    RECLGTH,@05                                         1156 02696000
*   GO TO AHLSVSTK;                                                1157 02697000
         B     AHLSVSTK                                            1157 02698000
*                                                                  1158 02699000
*/********************************************************************/ 02700000
*/*                                                                  */ 02701000
*/*         FINISH BUILDING SVC 78                                   */ 02702000
*/*                                                                  */ 02703000
*/********************************************************************/ 02704000
*                                                                  1158 02705000
*AHLS78:                                                           1158 02706000
*   ERRTRNAD=ADDR(RCOV33A);         /* SET RETURN ADDR IN CASE OF  1158 02707000
*                                      ERROR                         */ 02708000
AHLS78   LA    ERRTRNAD,RCOV33A                                    1158 02709000
*   PARMPTR=REG0LCCA;               /* PICK UP UCB ADDRESS           */ 02710000
         L     PARMPTR,REG0LCCA(,LCCAPTR)                          1159 02711000
*   GO TO AHLS33B;                  /* MOVE CUU INTO RECORD          */ 02712000
         B     AHLS33B                                             1160 02713000
*                                                                  1161 02714000
*/********************************************************************/ 02715000
*/*                                                                  */ 02716000
*/*         FINISH BUILDING SVC 80                                   */ 02717000
*/*                                                                  */ 02718000
*/********************************************************************/ 02719000
*                                                                  1161 02720000
*AHLS80:                                                           1161 02721000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 02722000
AHLS80   LA    ERRTRNAD,RCOVPLST                                   1161 02723000
*   PARMPTR=REG0LCCA;               /* PICK UP ADDR PARMLIST         */ 02724000
         L     PARMPTR,REG0LCCA(,LCCAPTR)                          1162 02725000
*   GO TO AHLPRM8;                  /* MOVE 8 BYTE PARM LIST         */ 02726000
         B     AHLPRM8                                             1163 02727000
*                                                                  1164 02728000
*/********************************************************************/ 02729000
*/*                                                                  */ 02730000
*/*         FINISH BUILDING SVC 81                                   */ 02731000
*/*                                                                  */ 02732000
*/********************************************************************/ 02733000
*                                                                  1164 02734000
*AHLS81:                                                           1164 02735000
*   ERRTRNAD=ADDR(RCOV81A);         /* SET ADDRESS TO CODE TO MOVE 1164 02736000
*                                      ASTERISKS                     */ 02737000
AHLS81   LA    ERRTRNAD,RCOV81A                                    1164 02738000
*   IF PLLONG=OFF THEN                                             1165 02739000
         L     @05,REG1LCCA(,LCCAPTR)                              1165 02740000
         TM    PLLONG(@05),B'00000001'                             1165 02741000
         BNZ   @RF01165                                            1165 02742000
*     DO;                           /* IF SHORT PLIST        @Z40KI3N*/ 02743000
*       SCKPTR=ADDR(PLIST81);                                      1167 02744000
         ST    @05,SCKPTR(,AWSAPTR)                                1167 02745000
*       SCKLEN=LENGTH(PRMLST81);                                   1168 02746000
         MVC   SCKLEN(4,AWSAPTR),@CF00929                          1168 02747000
*       CALL SCK;                                                  1169 02748000
         BAL   @14,SCK                                             1169 02749000
*       PRMLST81=PLIST81;           /* MOVE 16 BYTE PARMLIST TO    1170 02750000
*                                      RECORD                        */ 02751000
         L     @05,REG1LCCA(,LCCAPTR)                              1170 02752000
         MVC   PRMLST81(16,AWSAPTR),PLIST81(@05)                   1170 02753000
*       RECLGTH=RECLGTH+LENGTH(PRMLST81);/* UPDATE MSG LEN           */ 02754000
         AL    RECLGTH,@CF00929                                    1171 02755000
*     END;                          /*                       @Z40KI3N*/ 02756000
*   ELSE                                                           1173 02757000
*     DO;                           /* IF LONG PLIST         @Z40KI3N*/ 02758000
         B     @RC01165                                            1173 02759000
@RF01165 DS    0H                                                  1174 02760000
*       SCKPTR=ADDR(PLIST81A);      /*                       @Z40KI3N*/ 02761000
         L     @05,REG1LCCA(,LCCAPTR)                              1174 02762000
         ST    @05,SCKPTR(,AWSAPTR)                                1174 02763000
*       SCKLEN=LENGTH(PRMLT81A);    /*                       @Z40KI3N*/ 02764000
         MVC   SCKLEN(4,AWSAPTR),@CF02778                          1175 02765000
*       CALL SCK;                   /*                       @Z40KI3N*/ 02766000
         BAL   @14,SCK                                             1176 02767000
*       PRMLT81A=PLIST81A;          /* MOVE 48 BYTE PLIST    @Z40KI3N*/ 02768000
         L     @05,REG1LCCA(,LCCAPTR)                              1177 02769000
         MVC   PRMLT81A(48,AWSAPTR),PLIST81A(@05)                  1177 02770000
*       RECLGTH=RECLGTH+LENGTH(PRMLT81A);/* UPDTE MSG LEN    @Z40KI3N*/ 02771000
         AL    RECLGTH,@CF02778                                    1178 02772000
*     END;                                                         1179 02773000
*   ERRTRNAD=ADDR(RCOVNAME);        /* SET RETURN ADDR TO MOVE 8   1180 02774000
*                                      ASTERISKS                     */ 02775000
@RC01165 LA    ERRTRNAD,RCOVNAME                                   1180 02776000
*   DCBPTR=DCBAD81;                 /* PICK UP PTR TO DCB            */ 02777000
         ICM   DCBPTR,15,DCBAD81(AWSAPTR)                          1181 02778000
*   GO TO SVDDNCK;                  /* PASS IT TO PICK UP DDNAME     */ 02779000
         B     SVDDNCK                                             1182 02780000
*                                                                  1183 02781000
*/********************************************************************/ 02782000
*/*                                                                  */ 02783000
*/*         FINISH BUILDING SVC 82                                   */ 02784000
*/*                                                                  */ 02785000
*/********************************************************************/ 02786000
*                                                                  1183 02787000
*AHLS82:                                                           1183 02788000
*   PARMPTR=REG1LCCA;               /* PICK UP PARMLIST ADDR         */ 02789000
AHLS82   L     PARMPTR,REG1LCCA(,LCCAPTR)                          1183 02790000
*   ERRTRNAD=ADDR(RCOV82A);         /* SETUP ERROR RECOVERY          */ 02791000
         LA    ERRTRNAD,RCOV82A                                    1184 02792000
*   IF TYPIND82=IND8F THEN                                         1185 02793000
         CLI   TYPIND82(PARMPTR),X'8F'                             1185 02794000
         BE    @RT01185                                            1185 02795000
*     GO TO AHLS821;                /* PROCESSING FOR '8F' TYPE      */ 02796000
*   IF TYPIND82=IND1F THEN                                         1187 02797000
         CLI   TYPIND82(PARMPTR),X'1F'                             1187 02798000
         BE    @RT01187                                            1187 02799000
*     GO TO AHLS822;                /* PROCESSING FOR '1F' TYPE      */ 02800000
*   IF TYPIND82=IND00 THEN                                         1189 02801000
         CLI   TYPIND82(PARMPTR),X'00'                             1189 02802000
         BE    @RT01189                                            1189 02803000
*     GO TO AHLS823;                /* PROCESSING FOR '00' TYPE      */ 02804000
*   IF TYPIND82=IND08|TYPIND82=IND88|TYPIND82=INDF8 THEN           1191 02805000
         CLI   TYPIND82(PARMPTR),X'08'                             1191 02806000
         BE    @RT01191                                            1191 02807000
         CLI   TYPIND82(PARMPTR),X'88'                             1191 02808000
         BE    @RT01191                                            1191 02809000
         CLI   TYPIND82(PARMPTR),X'F8'                             1191 02810000
         BE    @RT01191                                            1191 02811000
*     GO TO AHLS82D;                /* PROCESSING FOR '08' OR '88' OR   02812000
*                                      'F8'                          */ 02813000
*/********************************************************************/ 02814000
*/*         NONE OF THE ABOVE TYPES INDICATES ERROR CONDITION        */ 02815000
*/********************************************************************/ 02816000
*                                                                  1193 02817000
*AHLS82A:                                                          1193 02818000
*   ERREC82=ERR82;                  /* MOVE ENTIRE ERROR RECORD INTO    02819000
*                                      SVC TRACE RECORD              */ 02820000
AHLS82A  MVC   ERREC82(16,AWSAPTR),ERR82                           1193 02821000
*   RECLGTH=RECLGTH+LENGTH(ERREC82);/* ADD 8 TO STACK RECLGTH        */ 02822000
         AL    RECLGTH,@CF00929                                    1194 02823000
*   GO TO AHLSVSTK;                 /* DONE                          */ 02824000
         B     AHLSVSTK                                            1195 02825000
*/********************************************************************/ 02826000
*/*         INDICATOR = 8F                                           */ 02827000
*/********************************************************************/ 02828000
*                                                                  1196 02829000
*AHLS821:                                                          1196 02830000
*   SCKPTR=ADDR(PLIST82);                                          1196 02831000
AHLS821  ST    PARMPTR,SCKPTR(,AWSAPTR)                            1196 02832000
*   SCKLEN=LENGTH(PL8F);                                           1197 02833000
         MVC   SCKLEN(4,AWSAPTR),@CF00061                          1197 02834000
*   CALL SCK;                                                      1198 02835000
         BAL   @14,SCK                                             1198 02836000
*   PL8F=PLIST82;                   /* PLACE 8 BYTES OF PARMLIST INTO   02837000
*                                      RECORD                        */ 02838000
         MVC   PL8F(8,AWSAPTR),PLIST82(PARMPTR)                    1199 02839000
*   PLLN8F=LENGTH(PL8F);            /* PLACE 8 INTO LENGTH FIELD     */ 02840000
         MVI   PLLN8F(AWSAPTR),X'08'                               1200 02841000
*   CHLEN8F=NULL;                   /* PLACE ZERO IN CCHH LENGTH   1201 02842000
*                                      FIELD                         */ 02843000
         MVI   CHLEN8F(AWSAPTR),X'00'                              1201 02844000
*   RECLGTH=RECLGTH+LENGTH(CCPL8F); /* ADD 10 TO STACK MSG LGTH      */ 02845000
         AL    RECLGTH,@CF04642                                    1202 02846000
*AHLS825:                                                          1203 02847000
*   ERRTRNAD=ADDR(RCOV82B);         /* SET RETURN ADDRESS            */ 02848000
AHLS825  LA    ERRTRNAD,RCOV82B                                    1203 02849000
*   UCBPTR=UCBAD82;                 /* GET ADDR OF THE UCB           */ 02850000
         L     UCBPTR,UCBAD82(,PARMPTR)                            1204 02851000
*   SCKPTR=ADDR(UCBVOLI);                                          1205 02852000
         LA    @05,UCBVOLI(,UCBPTR)                                1205 02853000
         ST    @05,SCKPTR(,AWSAPTR)                                1205 02854000
*   SCKLEN=LENGTH(VS8F);                                           1206 02855000
         MVC   SCKLEN(4,AWSAPTR),@CF00919                          1206 02856000
*   CALL SCK;                                                      1207 02857000
         BAL   @14,SCK                                             1207 02858000
*   VS8F=UCBVOLI;                   /* GET THE VOL-SER FROM THE UCB  */ 02859000
         MVC   VS8F(6,AWSAPTR),UCBVOLI(UCBPTR)                     1208 02860000
*AHLS82B:                                                          1209 02861000
*   RECLGTH=RECLGTH+LENGTH(VS8F);   /* ADD 6 TO MSG LENGTH           */ 02862000
AHLS82B  AL    RECLGTH,@CF00919                                    1209 02863000
*   GO TO AHLSVSTK;                 /* DONE                          */ 02864000
         B     AHLSVSTK                                            1210 02865000
*/********************************************************************/ 02866000
*/*         INDICATOR = '1F'                                         */ 02867000
*/********************************************************************/ 02868000
*                                                                  1211 02869000
*AHLS822:                                                          1211 02870000
*   SCKPTR=ADDR(PLIST82);                                          1211 02871000
AHLS822  ST    PARMPTR,SCKPTR(,AWSAPTR)                            1211 02872000
*   SCKLEN=LENGTH(PL1F);                                           1212 02873000
         MVC   SCKLEN(4,AWSAPTR),@CF00061                          1212 02874000
*   CALL SCK;                                                      1213 02875000
         BAL   @14,SCK                                             1213 02876000
*   PL1F=PLIST82;                   /* PLACE 8 BYTE PARMLIST INTO  1214 02877000
*                                      RECORD                        */ 02878000
         MVC   PL1F(8,AWSAPTR),PLIST82(PARMPTR)                    1214 02879000
*   PLLN1F=LENGTH(PL1F);            /* PUT 8 INTO LENGTH FIELD       */ 02880000
         MVI   PLLN1F(AWSAPTR),X'08'                               1215 02881000
*   RECLGTH=RECLGTH+LENGTH(PLST1F); /* ADD 10 TO STACK LEN   @YM03653*/ 02882000
         AL    RECLGTH,@CF01778                                    1216 02883000
*   ERRTRNAD=ADDR(RCOV82C);                                        1217 02884000
         LA    ERRTRNAD,RCOV82C                                    1217 02885000
*   SCKPTR=ADDR(ALTRK82);                                          1218 02886000
         L     @05,CCHH82(,PARMPTR)                                1218 02887000
         ST    @05,SCKPTR(,AWSAPTR)                                1218 02888000
*   SCKLEN=LENGTH(CCHH1F);                                         1219 02889000
         MVC   SCKLEN(4,AWSAPTR),@CF00919                          1219 02890000
*   CALL SCK;                                                      1220 02891000
         BAL   @14,SCK                                             1220 02892000
*   CCHH1F=ALTRK82;                 /* PLACE 6 BYTES OF CCHH INTO  1221 02893000
*                                      RECORD                        */ 02894000
         L     @05,CCHH82(,PARMPTR)                                1221 02895000
         MVC   CCHH1F(6,AWSAPTR),ALTRK82(@05)                      1221 02896000
*   CHLN1F=LENGTH(CCHH1F);          /* PLACE 6 INTO LENGTH           */ 02897000
         MVI   CHLN1F(AWSAPTR),X'06'                               1222 02898000
*   RECLGTH=RECLGTH+LENGTH(CC1F);   /* ADD 20 TO STACK MSG LENGTH    */ 02899000
         AL    RECLGTH,@CF00730                                    1223 02900000
*   GO TO AHLS825;                  /* GO GET VOL-SER INFO           */ 02901000
         B     AHLS825                                             1224 02902000
*/********************************************************************/ 02903000
*/*         INDICATOR = '00'                                         */ 02904000
*/********************************************************************/ 02905000
*                                                                  1225 02906000
*AHLS823:                                                          1225 02907000
*   SCKPTR=ADDR(PLIST82);                                          1225 02908000
AHLS823  ST    PARMPTR,SCKPTR(,AWSAPTR)                            1225 02909000
*   SCKLEN=LENGTH(PL00);                                           1226 02910000
         MVC   SCKLEN(4,AWSAPTR),@CF04459                          1226 02911000
*   CALL SCK;                                                      1227 02912000
         BAL   @14,SCK                                             1227 02913000
*   PL00=PLIST82;                   /* PLACE 12 BYTES OF PARMLIST  1228 02914000
*                                      INTO RECORD                   */ 02915000
         MVC   PL00(12,AWSAPTR),PLIST82(PARMPTR)                   1228 02916000
*   PLLN00=LENGTH(PL00);            /* PLACE 12 INTO LENGTH          */ 02917000
         MVI   PLLN00(AWSAPTR),X'0C'                               1229 02918000
*   RECLGTH=RECLGTH+LENGTH(PLST00); /* UPDATE RECORD LENGTH  @YM03653*/ 02919000
         AL    RECLGTH,@CF01806                                    1230 02920000
*   ERRTRNAD=ADDR(RCOV82C);                                        1231 02921000
         LA    ERRTRNAD,RCOV82C                                    1231 02922000
*   SCKPTR=ADDR(ALTRK82);                                          1232 02923000
         L     @05,CCHH82(,PARMPTR)                                1232 02924000
         ST    @05,SCKPTR(,AWSAPTR)                                1232 02925000
*   SCKLEN=LENGTH(CCHH00);                                         1233 02926000
         MVC   SCKLEN(4,AWSAPTR),@CF00919                          1233 02927000
*   CALL SCK;                                                      1234 02928000
         BAL   @14,SCK                                             1234 02929000
*   CCHH00=ALTRK82;                 /* PLACE 6 BYTES OF CCHH INTO  1235 02930000
*                                      RECORD                        */ 02931000
         L     @05,CCHH82(,PARMPTR)                                1235 02932000
         MVC   CCHH00(6,AWSAPTR),ALTRK82(@05)                      1235 02933000
*   CHLN00=LENGTH(CCHH00);          /* PLACE 6 INTO LENGTH           */ 02934000
         MVI   CHLN00(AWSAPTR),X'06'                               1236 02935000
*   RECLGTH=RECLGTH+LENGTH(CC00);   /* ADD 20 TO STACK MSG LENGTH    */ 02936000
         AL    RECLGTH,@CF00730                                    1237 02937000
*   GO TO AHLS825;                  /* GO GET VOL-SER INFO           */ 02938000
         B     AHLS825                                             1238 02939000
*/********************************************************************/ 02940000
*/*         INDICATOR IS '88' OR '08' OR 'F8'                        */ 02941000
*/********************************************************************/ 02942000
*                                                                  1239 02943000
*AHLS82D:                                                          1239 02944000
*   IF TYPIND82=IND08 THEN                                         1239 02945000
AHLS82D  CLI   TYPIND82(PARMPTR),X'08'                             1239 02946000
         BNE   @RF01239                                            1239 02947000
*     DO;                           /* '08' INDICATES 12 BYTE PARM 1240 02948000
*                                      LIST                          */ 02949000
*       SCKPTR=ADDR(PLIST82);                                      1241 02950000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            1241 02951000
*       SCKLEN=LENGTH(PL08);                                       1242 02952000
         MVC   SCKLEN(4,AWSAPTR),@CF04459                          1242 02953000
*       CALL SCK;                                                  1243 02954000
         BAL   @14,SCK                                             1243 02955000
*       PL08=PLIST82;               /* MOVE 12 BYTE PARMLIST         */ 02956000
         MVC   PL08(12,AWSAPTR),PLIST82(PARMPTR)                   1244 02957000
*       PLLN88=LENGTH(PL08);        /* SET LENGTH TO 12              */ 02958000
         MVI   PLLN88(AWSAPTR),X'0C'                               1245 02959000
*     END;                                                         1246 02960000
*   ELSE                                                           1247 02961000
*     DO;                                                          1247 02962000
         B     @RC01239                                            1247 02963000
@RF01239 DS    0H                                                  1248 02964000
*       SCKPTR=ADDR(PLIST82);                                      1248 02965000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            1248 02966000
*       SCKLEN=LENGTH(PL88);                                       1249 02967000
         MVC   SCKLEN(4,AWSAPTR),@CF00929                          1249 02968000
*       CALL SCK;                                                  1250 02969000
         BAL   @14,SCK                                             1250 02970000
*       PL88=PLIST82;               /* MOVE 16 BYTE PARMLIST         */ 02971000
         MVC   PL88(16,AWSAPTR),PLIST82(PARMPTR)                   1251 02972000
*       PLLN88=LENGTH(PL88);        /* SET LENGTH TO 16              */ 02973000
         MVI   PLLN88(AWSAPTR),X'10'                               1252 02974000
*     END;                                                         1253 02975000
*   RECLGTH=RECLGTH+PLLN88+LENGTH(PLLN88);                         1254 02976000
@RC01239 LR    @05,RECLGTH                                         1254 02977000
         SLR   @15,@15                                             1254 02978000
         IC    @15,PLLN88(,AWSAPTR)                                1254 02979000
         ALR   @05,@15                                             1254 02980000
         AL    @05,@CF00063                                        1254 02981000
         LR    RECLGTH,@05                                         1254 02982000
*AHLS827:                                                          1255 02983000
*   ERRTRNAD=ADDR(RCOV82C);         /* SET ERROR RETURN ADDRESS      */ 02984000
AHLS827  LA    ERRTRNAD,RCOV82C                                    1255 02985000
*   RECPTR=ADDR(MCAREC)+RECLGTH+LENGTH(VS88);/* UPDATE RECPTR TO   1256 02986000
*                                      POINT TO NEXT BYTE IN RECORD,    02987000
*                                      WITH LENGTH OF VOLSER ADDED 1256 02988000
*                                      SINCE NOT GATHERED YET      1256 02989000
*                                                            @YM03653*/ 02990000
         LA    RECPTR,MCAREC(,AWSAPTR)                             1256 02991000
         ALR   RECPTR,RECLGTH                                      1256 02992000
         AL    RECPTR,@CF00919                                     1256 02993000
*   SCKPTR=ADDR(MBCCHH82);                                         1257 02994000
         L     @05,MBCHRA82(,PARMPTR)                              1257 02995000
         ST    @05,SCKPTR(,AWSAPTR)                                1257 02996000
*   SCKLEN=LENGTH(CCHH8288);                                       1258 02997000
         MVC   SCKLEN(4,AWSAPTR),@CF00061                          1258 02998000
*   CALL SCK;                                                      1259 02999000
         BAL   @14,SCK                                             1259 03000000
*   CCHH8288=MBCCHH82;              /* MOVE 8 BYTE MBBCCHHR INTO   1260 03001000
*                                      RECORD                        */ 03002000
         L     @05,MBCHRA82(,PARMPTR)                              1260 03003000
         MVC   CCHH8288(8,RECPTR),MBCCHH82(@05)                    1260 03004000
*   CHLN82=LENGTH(CCHH8288);        /* PLACE 8 INTO LENGTH BYTE      */ 03005000
         MVI   CHLN82(RECPTR),X'08'                                1261 03006000
*   RECLGTH=RECLGTH+LENGTH(CCHH8288)+LENGTH(CHLN82);/* ADD 8 TO STACK   03007000
*                                      MSG LENGTH                    */ 03008000
         AL    RECLGTH,@CF01778                                    1262 03009000
*AHLS824:                                                          1263 03010000
*   ERRTRNAD=ADDR(RCOV82B);         /* SET ERROR RETURN ADDR         */ 03011000
AHLS824  LA    ERRTRNAD,RCOV82B                                    1263 03012000
*   SCKPTR=ADDR(VOLSER82);                                         1264 03013000
         L     @05,VSERAD82(,PARMPTR)                              1264 03014000
         ST    @05,SCKPTR(,AWSAPTR)                                1264 03015000
*   SCKLEN=LENGTH(VS88);                                           1265 03016000
         MVC   SCKLEN(4,AWSAPTR),@CF00919                          1265 03017000
*   CALL SCK;                                                      1266 03018000
         BAL   @14,SCK                                             1266 03019000
*   VS88=VOLSER82;                  /* PLACE VOL-SER IN RECORD       */ 03020000
         L     @05,VSERAD82(,PARMPTR)                              1267 03021000
         MVC   VS88(6,AWSAPTR),VOLSER82(@05)                       1267 03022000
*   RECLGTH=RECLGTH+LENGTH(VS88);   /* ADD 6 TO STACK MSG LENGTH     */ 03023000
         AL    RECLGTH,@CF00919                                    1268 03024000
*   GO TO AHLSVSTK;                                                1269 03025000
         B     AHLSVSTK                                            1269 03026000
*                                                                  1270 03027000
*/********************************************************************/ 03028000
*/*                                                                  */ 03029000
*/*         FINISH BUILDING SVC 86                                   */ 03030000
*/*                                                                  */ 03031000
*/********************************************************************/ 03032000
*                                                                  1270 03033000
*AHLS86:                                                           1270 03034000
*   ERRTRNAD=ADDR(RCOV86A);         /* SET ERROR RETURN TO CODE TO 1270 03035000
*                                      PLACE 13 ASTERISKS IN RECORD  */ 03036000
AHLS86   LA    ERRTRNAD,RCOV86A                                    1270 03037000
*   SCKPTR=ADDR(PLIST86);                                          1271 03038000
         L     @05,REG1LCCA(,LCCAPTR)                              1271 03039000
         ST    @05,SCKPTR(,AWSAPTR)                                1271 03040000
*   SCKLEN=LENGTH(PRMLST86);                                       1272 03041000
         MVC   SCKLEN(4,AWSAPTR),@CF00061                          1272 03042000
*   CALL SCK;                                                      1273 03043000
         BAL   @14,SCK                                             1273 03044000
*   PRMLST86=PLIST86;               /* PLACE 8 BYTE PARMLIST IN    1274 03045000
*                                      RECORD                        */ 03046000
         L     @05,REG1LCCA(,LCCAPTR)                              1274 03047000
         MVC   PRMLST86(8,AWSAPTR),PLIST86(@05)                    1274 03048000
*   RECLGTH=RECLGTH+LENGTH(PRMLST86);/* ADD 8 TO STACK PLIST         */ 03049000
         AL    RECLGTH,@CF00061                                    1275 03050000
*   ERRTRNAD=ADDR(RCOV86B);         /* SET RETURN ADDR               */ 03051000
         LA    ERRTRNAD,RCOV86B                                    1276 03052000
*   SCKPTR=ADDR(CCH86);                                            1277 03053000
         L     @05,CCHHR86A(,@05)                                  1277 03054000
         ST    @05,SCKPTR(,AWSAPTR)                                1277 03055000
*   SCKLEN=LENGTH(CCHHR86);                                        1278 03056000
         MVC   SCKLEN(4,AWSAPTR),@CF01868                          1278 03057000
*   CALL SCK;                                                      1279 03058000
         BAL   @14,SCK                                             1279 03059000
*   CCHHR86=CCH86;                  /* PLACE CCHHR INTO RECORD       */ 03060000
         L     @05,REG1LCCA(,LCCAPTR)                              1280 03061000
         L     @05,CCHHR86A(,@05)                                  1280 03062000
         MVC   CCHHR86(5,AWSAPTR),CCH86(@05)                       1280 03063000
*   RECLGTH=RECLGTH+LENGTH(CCHHR86);/* ADD 5 TO MSG LENGTH           */ 03064000
         AL    RECLGTH,@CF01868                                    1281 03065000
*   GO TO AHLSVSTK;                                                1282 03066000
         B     AHLSVSTK                                            1282 03067000
*                                                                  1283 03068000
*/********************************************************************/ 03069000
*/*                                                                  */ 03070000
*/*         FINISH BUILDING SVC 87                                   */ 03071000
*/*                                                                  */ 03072000
*/********************************************************************/ 03073000
*                                                                  1283 03074000
*AHLS87:                                                           1283 03075000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 03076000
AHLS87   LA    ERRTRNAD,RCOVPLST                                   1283 03077000
*   PARMPTR=REG1LCCA;               /* PICK UP PTR TO MSG ID LIST    */ 03078000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          1284 03079000
*   IF REG0LCCA=NULL|REG0LCCA=4 THEN                               1285 03080000
         L     @05,REG0LCCA(,LCCAPTR)                              1285 03081000
         LTR   @05,@05                                             1285 03082000
         BZ    @RT01285                                            1285 03083000
         C     @05,@CF00055                                        1285 03084000
         BNE   @RF01285                                            1285 03085000
@RT01285 DS    0H                                                  1286 03086000
*     DO;                                                          1286 03087000
*       RECPTR=ADDR(SVCADDL);       /* POINT TO NEXT BYTE IN RECORD  */ 03088000
         LA    RECPTR,SVCADDL(,AWSAPTR)                            1287 03089000
*       GO TO AHLS1B;               /* IF REG0 AT INTERRUPT IS ZERO     03090000
*                                      OR FOUR, THEN ONLY ONE ADDR   */ 03091000
         B     AHLS1B                                              1288 03092000
*     END;                                                         1289 03093000
*   ELSE                                                           1290 03094000
*     DO;                                                          1290 03095000
@RF01285 DS    0H                                                  1291 03096000
*       RECPTR=PARMPTR;             /* LOAD POINTER          @YM03655*/ 03097000
         LR    RECPTR,PARMPTR                                      1291 03098000
*       GO TO AHLS1D;               /* PLACE PARMS INTO RECORD     1292 03099000
*                                                            @YM03655*/ 03100000
         B     AHLS1D                                              1292 03101000
*     END;                                                         1293 03102000
*                                                                  1294 03103000
*/********************************************************************/ 03104000
*/*                                                                  */ 03105000
*/*         FINISH BUILDING SVC 88                                   */ 03106000
*/*                                                                  */ 03107000
*/********************************************************************/ 03108000
*                                                                  1294 03109000
*AHLS88:                                                           1294 03110000
*   ERRTRNAD=ADDR(RCOV88A);         /* SET RETURN TO CODE TO PLACE 6    03111000
*                                      ASTERISKS IN RECORD           */ 03112000
AHLS88   LA    ERRTRNAD,RCOV88A                                    1294 03113000
*   DCBPTR=REG1LCCA;                /* GET DCB ADDR                  */ 03114000
         L     DCBPTR,REG1LCCA(,LCCAPTR)                           1295 03115000
*   SCKPTR=ADDR(DCBDEBAD);                                         1296 03116000
         LA    @05,DCBDEBAD+40(,DCBPTR)                            1296 03117000
         ST    @05,SCKPTR(,AWSAPTR)                                1296 03118000
*   SCKLEN=LENGTH(DEBAD88);                                        1297 03119000
         MVC   SCKLEN(4,AWSAPTR),@CF00055                          1297 03120000
*   CALL SCK;                                                      1298 03121000
         BAL   @14,SCK                                             1298 03122000
*   DEBPTR=DCBDEBAD;                /* GET DEB ADDRESS               */ 03123000
         L     DEBPTR,DCBDEBAD+40(,DCBPTR)                         1299 03124000
*   DEBAD88=DEBPTR;                 /* MOVE DEB ADDR INTO RECORD     */ 03125000
         STCM  DEBPTR,15,DEBAD88(AWSAPTR)                          1300 03126000
*   RECLGTH=RECLGTH+LENGTH(DEBAD88);/* ADD 4 TO STACK LENGTH         */ 03127000
         AL    RECLGTH,@CF00055                                    1301 03128000
*   ERRTRNAD=ADDR(RCOV88B);         /* SET ERROR RETURN ADDR         */ 03129000
         LA    ERRTRNAD,RCOV88B                                    1302 03130000
*   SCKPTR=ADDR(DEBOFLGS);                                         1303 03131000
         LA    @05,DEBOFLGS(,DEBPTR)                               1303 03132000
         ST    @05,SCKPTR(,AWSAPTR)                                1303 03133000
*   SCKLEN=LENGTH(DSSTAT88);                                       1304 03134000
         MVC   SCKLEN(4,AWSAPTR),@CF00063                          1304 03135000
*   CALL SCK;                                                      1305 03136000
         BAL   @14,SCK                                             1305 03137000
*   DSSTAT88=DEBOFLGS;              /* MOVE 1 BYTE OF DSSTAT TO    1306 03138000
*                                      RECORD                        */ 03139000
         MVC   DSSTAT88(1,AWSAPTR),DEBOFLGS(DEBPTR)                1306 03140000
*   IF DCBDSGIS=ON THEN             /* CHECK FOR ISAM                */ 03141000
         TM    DCBDSGIS+16(DCBPTR),B'10000000'                     1307 03142000
         BNO   @RF01307                                            1307 03143000
*     DEBDAPTR=DEBPTR+LENGTH(DEBBASIC)+LENGTH(DEBBAS01);/* CALC    1308 03144000
*                                      LENGTH FOR THE DA PORTION OF     03145000
*                                      THE DEB                       */ 03146000
         LA    @05,48                                              1308 03147000
         ALR   @05,DEBPTR                                          1308 03148000
         LR    DEBDAPTR,@05                                        1308 03149000
*   ELSE                            /* NOT ISAM                      */ 03150000
*     DEBDAPTR=DEBPTR+LENGTH(DEBBASIC);                            1309 03151000
         B     @RC01307                                            1309 03152000
@RF01307 LA    @05,32                                              1309 03153000
         ALR   @05,DEBPTR                                          1309 03154000
         LR    DEBDAPTR,@05                                        1309 03155000
*   SCKPTR=ADDR(DEBDVMOD);                                         1310 03156000
@RC01307 ST    DEBDAPTR,SCKPTR(,AWSAPTR)                           1310 03157000
*   SCKLEN=LENGTH(DEVMOD88);                                       1311 03158000
         MVC   SCKLEN(4,AWSAPTR),@CF00063                          1311 03159000
*   CALL SCK;                                                      1312 03160000
         BAL   @14,SCK                                             1312 03161000
*   DEVMOD88=DEBDVMOD;              /* PLACE DEVMOD INFO INTO REC    */ 03162000
         MVC   DEVMOD88(1,AWSAPTR),DEBDVMOD(DEBDAPTR)              1313 03163000
*   RECLGTH=RECLGTH+LENGTH(DEVMOD88)+LENGTH(DSSTAT88);/* ADD TO STACK   03164000
*                                      RECORD LENGTH                 */ 03165000
         AL    RECLGTH,@CF00075                                    1314 03166000
*   GO TO AHLSVSTK;                 /* FINISHED - OUTPUT AND RETURN  */ 03167000
         B     AHLSVSTK                                            1315 03168000
*                                                                  1316 03169000
*/********************************************************************/ 03170000
*/*                                                                  */ 03171000
*/*         FINISH BUILDING SVC 96                                   */ 03172000
*/*                                                                  */ 03173000
*/********************************************************************/ 03174000
*                                                                  1316 03175000
*AHLS96:                                                           1316 03176000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 03177000
AHLS96   LA    ERRTRNAD,RCOVPLST                                   1316 03178000
*   SCKPTR=ADDR(PLIST96);                                          1317 03179000
         L     @05,REG1LCCA(,LCCAPTR)                              1317 03180000
         ST    @05,SCKPTR(,AWSAPTR)                                1317 03181000
*   SCKLEN=LENGTH(PRMLST96);                                       1318 03182000
         MVC   SCKLEN(4,AWSAPTR),@CF00992                          1318 03183000
*   CALL SCK;                                                      1319 03184000
         BAL   @14,SCK                                             1319 03185000
*   PRMLST96=PLIST96;               /* MOVE 20 BYTE PARM LIST TO   1320 03186000
*                                      RECORD                        */ 03187000
         L     @05,REG1LCCA(,LCCAPTR)                              1320 03188000
         MVC   PRMLST96(20,AWSAPTR),PLIST96(@05)                   1320 03189000
*   LEN96=LENGTH(PRMLST96);         /* PLACE 20 IN LENGTH FIELD      */ 03190000
         LA    @05,20                                              1321 03191000
         STC   @05,LEN96(,AWSAPTR)                                 1321 03192000
*   RECLGTH=RECLGTH+LEN96+LENGTH(LEN96);/* UPDATE STACK MSG LENGTH   */ 03193000
         ALR   @05,RECLGTH                                         1322 03194000
         AL    @05,@CF00063                                        1322 03195000
         LR    RECLGTH,@05                                         1322 03196000
*   GO TO AHLSVSTK;                 /* STACK RECORD                  */ 03197000
         B     AHLSVSTK                                            1323 03198000
*                                                                  1324 03199000
*/********************************************************************/ 03200000
*/*                                                                  */ 03201000
*/*         FINISH BUILDING SVC 98                                   */ 03202000
*/*                                                                  */ 03203000
*/********************************************************************/ 03204000
*                                                                  1324 03205000
*AHLS98:                                                           1324 03206000
*   ERRTRNAD=ADDR(RCOV98A);         /* SET ERROR ADDRESS TO CODE TO     03207000
*                                      MOVE 4 ASTERISKS AND ERROR  1324 03208000
*                                      INDICATOR INTO RECORD         */ 03209000
AHLS98   LA    ERRTRNAD,RCOV98A                                    1324 03210000
*   PARMPTR=REG1LCCA;               /* PICK UP PARMLIST ADDR         */ 03211000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          1325 03212000
*   SCKPTR=ADDR(PMLIST98);                                         1326 03213000
         ST    PARMPTR,SCKPTR(,AWSAPTR)                            1326 03214000
*   SCKLEN=LENGTH(PRMLST98);                                       1327 03215000
         MVC   SCKLEN(4,AWSAPTR),@CF00055                          1327 03216000
*   CALL SCK;                                                      1328 03217000
         BAL   @14,SCK                                             1328 03218000
*   PRMLST98=PMLIST98;              /* MOVE 4 BYTE PARMLIST INTO   1329 03219000
*                                      RECORD                        */ 03220000
         MVC   PRMLST98(4,AWSAPTR),PMLIST98(PARMPTR)               1329 03221000
*   RECLGTH=RECLGTH+LENGTH(PRMLST98);/* ADD 4 TO STACK MSG LEN       */ 03222000
         AL    RECLGTH,@CF00055                                    1330 03223000
*   ERRTRNAD=ADDR(RCOV98B);                                        1331 03224000
         LA    ERRTRNAD,RCOV98B                                    1331 03225000
*   IF DSNLEN98^=NULL THEN          /* IF LENGTH IS NOT ZERO, MOVE 1332 03226000
*                                      DSN TO RECORD                 */ 03227000
         CLI   DSNLEN98(PARMPTR),0                                 1332 03228000
         BE    @RF01332                                            1332 03229000
*     DO;                                                          1333 03230000
*       SCKPTR=ADDR(DSNME98);                                      1334 03231000
         L     @05,DSNAD98(,PARMPTR)                               1334 03232000
         ST    @05,SCKPTR(,AWSAPTR)                                1334 03233000
*       SCKLEN=DSNLEN98;                                           1335 03234000
         SLR   @05,@05                                             1335 03235000
         IC    @05,DSNLEN98(,PARMPTR)                              1335 03236000
         ST    @05,SCKLEN(,AWSAPTR)                                1335 03237000
*       CALL SCK;                                                  1336 03238000
         BAL   @14,SCK                                             1336 03239000
*       DSN98(1:DSNLEN98)=DSNME98;                                 1337 03240000
         SLR   @05,@05                                             1337 03241000
         IC    @05,DSNLEN98(,PARMPTR)                              1337 03242000
         BCTR  @05,0                                               1337 03243000
         L     @15,DSNAD98(,PARMPTR)                               1337 03244000
         EX    @05,@SM05756                                        1337 03245000
*     END;                                                         1338 03246000
*   LEN98=DSNLEN98;                 /* MOVE LENGTH OF DS NAME INTO 1339 03247000
*                                      RECORD                        */ 03248000
@RF01332 SLR   @05,@05                                             1339 03249000
         IC    @05,DSNLEN98(,PARMPTR)                              1339 03250000
         STC   @05,LEN98(,AWSAPTR)                                 1339 03251000
*   RECLGTH=RECLGTH+LEN98+LENGTH(LEN98);                           1340 03252000
         ALR   @05,RECLGTH                                         1340 03253000
         AL    @05,@CF00063                                        1340 03254000
         LR    RECLGTH,@05                                         1340 03255000
*   GO TO AHLSVSTK;                                                1341 03256000
         B     AHLSVSTK                                            1341 03257000
*                                                                  1342 03258000
*/********************************************************************/ 03259000
*/*                                                                  */ 03260000
*/*         FINISH BUILDING SVC 99                                   */ 03261000
*/*                                                                  */ 03262000
*/********************************************************************/ 03263000
*                                                                  1342 03264000
*AHLS99:                                                           1342 03265000
*   ERRTRNAD=ADDR(RCOVPLST);        /* SETUP ERROR RECOVERY          */ 03266000
AHLS99   LA    ERRTRNAD,RCOVPLST                                   1342 03267000
*   PARMPTR=REG1LCCA;               /* PICK UP PARMLIST ADDR         */ 03268000
         L     PARMPTR,REG1LCCA(,LCCAPTR)                          1343 03269000
*   GENERATE NOFLOWS NOEXIT SETS(PARMPTR);                         1344 03270000
*                                                          /*@ZA2834 */ 03271000
         L     PARMPTR,0(0,PARMPTR)    POINT TO PARM LIST   OZ28384     03272000
*   COUNT=LNTH99;                   /* PICK UP LENGTH OF DATA M4383  */ 03273000
         SLR   COUNT,COUNT                                         1345 03274000
         IC    COUNT,LNTH99(,PARMPTR)                              1345 03275000
*   IF COUNT=0 THEN                                                1346 03276000
         LTR   COUNT,COUNT                                         1346 03277000
         BZ    @RT01346                                            1346 03278000
*     GO TO AHLS990;                /* IF NO DATA, DONT MOVE ANY     */ 03279000
*   IF COUNT>MAXDYN THEN                                           1348 03280000
         LA    @05,40                                              1348 03281000
         CR    COUNT,@05                                           1348 03282000
         BNH   @RF01348                                            1348 03283000
*     COUNT=MAXDYN;                 /* IF THE NUMBER OF BYTES IS MORE   03284000
*                                      THAN 40 , USE 40              */ 03285000
         LR    COUNT,@05                                           1349 03286000
*   SCKPTR=ADDR(PLIST99);                                          1350 03287000
@RF01348 ST    PARMPTR,SCKPTR(,AWSAPTR)                            1350 03288000
*   SCKLEN=COUNT;                                                  1351 03289000
         ST    COUNT,SCKLEN(,AWSAPTR)                              1351 03290000
*   CALL SCK;                                                      1352 03291000
         BAL   @14,SCK                                             1352 03292000
*   PRMLST99(1:COUNT)=PLIST99;      /* MOVE PARMLIST TO RECORD       */ 03293000
         LR    @05,COUNT                                           1353 03294000
         BCTR  @05,0                                               1353 03295000
         EX    @05,@SM05758                                        1353 03296000
*AHLS990:                                                          1354 03297000
*   LEN99=COUNT;                    /* PLACE NO. OF BYTES INTO LENGTH   03298000
*                                      FIELD                         */ 03299000
AHLS990  STC   COUNT,LEN99(,AWSAPTR)                               1354 03300000
*   RECLGTH=RECLGTH+LEN99+LENGTH(LEN99);                           1355 03301000
         SLR   @05,@05                                             1355 03302000
         IC    @05,LEN99(,AWSAPTR)                                 1355 03303000
         ALR   @05,RECLGTH                                         1355 03304000
         AL    @05,@CF00063                                        1355 03305000
         LR    RECLGTH,@05                                         1355 03306000
*   GO TO AHLSVSTK;                 /* FINISH AND RETURN             */ 03307000
         B     AHLSVSTK                                            1356 03308000
*DEBCHK:                            /* CHECK TO SEE IF VALID DEB   1357 03309000
*                                                            @ZM30921*/ 03310000
*   RFY                                                            1357 03311000
*    (RETURNAD,                                                    1357 03312000
*     R15ENTRY) RSTD;               /*                       @ZM30921*/ 03313000
DEBCHK   DS    0H                                                  1358 03314000
*   RETSAV3=RETURNAD;               /* SAVE RETURN ADDRESS   @ZM30921*/ 03315000
         ST    RETURNAD,RETSAV3(,AWSAPTR)                          1358 03316000
*   RETSAV4=ERRTRNAD;               /* SAVE RECOVERY ADDR    @ZM30921*/ 03317000
         ST    ERRTRNAD,RETSAV4(,AWSAPTR)                          1359 03318000
*   ERRTRNAD=SVCTCB;                /* SET UP PARMS FOR DEB VAL CHK     03319000
*                                      RTN                   @ZM30921*/ 03320000
         ICM   ERRTRNAD,15,SVCTCB(AWSAPTR)                         1360 03321000
*   R15ENTRY=CVTDEBVR;              /* DEB VAL RTN ADDR      @ZM30921*/ 03322000
         L     @05,CVTPTR                                          1361 03323000
         L     @05,CVTEXT2(,@05)                                   1361 03324000
         L     R15ENTRY,CVTDEBVR(,@05)                             1361 03325000
*   GEN;                                                           1362 03326000
*    /*                                                                 03327000
   BALR @14,@15           NO - GO TO DEB VAL CHK RTN          ZM30921   03328000
   DROP @11                                                   ZM30921   03329000
   USING *,@14                                                ZM30921   03330000
   B RESTORE              IF GOOD DEB CHK RTN RETURNS HERE    ZM30921   03331000
   B RESTORE              IF BAD RTN RETURNS HERE             ZM30921   03332000
SVCPURG DC A(AHLTSVC)                                         ZM30921   03333000
RESTORE L @11,SVCPURG     RELOAD BASE,ERROR RET,AND RET REGS  ZM30921   03334000
   DROP @14                                                   ZM30921   03335000
   USING AHLTSVC,@11                                          ZM30921   03336000
   L ERRTRNAD,RETSAV4(,AWSAPTR)                               ZM30921   03337000
   L @14,RETSAV3(,AWSAPTR)                                    ZM30921   03338000
   NI MCATRL8(AWSAPTR),X'FE'  TURN OFF DEB FLAG               ZM30921   03339000
   BR @14                RETURN TO SVC PROCESSING             ZM30921   03340000
*   RFY                                                            1363 03341000
*    (RETURNAD,                                                    1363 03342000
*     R15ENTRY) UNRSTD;             /*                       @ZM30921*/ 03343000
*SVDDNCK:                                                          1364 03344000
*   IF DCBOFOPN^=ON THEN                                           1364 03345000
SVDDNCK  TM    DCBOFOPN+40(DCBPTR),B'00010000'                     1364 03346000
         BO    @RF01364                                            1364 03347000
*SVDDNCKB:                                                         1365 03348000
*     DO;                                                          1365 03349000
SVDDNCKB DS    0H                                                  1366 03350000
*       DDNAME=NOTAPP;              /* IF DCB IS NOT OPEN, DONT GET     03351000
*                                      DDNAME                        */ 03352000
         MVC   DDNAME(8,AWSAPTR),@CC04600                          1366 03353000
*SVDDNCKC:                                                         1367 03354000
*       RECLGTH=RECLGTH+LENGTH(DDNAME);                            1367 03355000
SVDDNCKC AL    RECLGTH,@CF00061                                    1367 03356000
*       GO TO AHLSVSTK;             /* GO AND STACK THE RECORD       */ 03357000
         B     AHLSVSTK                                            1368 03358000
*     END;                                                         1369 03359000
*   IF DCBTIOT<MINOFF|DCBTIOT>MAXOFF THEN                          1370 03360000
@RF01364 LA    @05,40                                              1370 03361000
         ALR   @05,DCBPTR                                          1370 03362000
         LH    @15,DCBTIOT(,@05)                                   1370 03363000
         C     @15,@CF00072                                        1370 03364000
         BL    @RT01370                                            1370 03365000
         C     @15,@CF04624                                        1370 03366000
         BH    @RT01370                                            1370 03367000
*     GO TO SVDDNCKB;               /* IF TIOT OFFSET INVALID, THEN     03368000
*                                      DONT GET DDNAME               */ 03369000
*   DEBPTR=DCBDEBAD;                /* GET DEB ADDR                  */ 03370000
         L     DEBPTR,DCBDEBAD(,@05)                               1372 03371000
*   IF DEBTCBB=NULL THEN                                           1373 03372000
         L     @05,DEBTCBB-1(,DEBPTR)                              1373 03373000
         LA    @05,0(,@05)                                         1373 03374000
         LTR   @05,@05                                             1373 03375000
         BZ    @RT01373                                            1373 03376000
*     GO TO SVDDNCKB;               /* DEB PTR TO TCB MUST NOT BE  1374 03377000
*                                      ZERO - IF SO, DONT GET DDNAME */ 03378000
*   IF DEBTCBB->TCBTIO=NULL THEN                                   1375 03379000
         L     @05,TCBTIO(,@05)                                    1375 03380000
         LTR   @05,@05                                             1375 03381000
         BZ    @RT01375                                            1375 03382000
*     GO TO SVDDNCKB;               /* TIOT PTR FROM TCB MUST ALSO BE   03383000
*                                      NON-ZERO                      */ 03384000
*                                                                  1376 03385000
*   /*****************************************************************/ 03386000
*   /*                                                               */ 03387000
*   /* DDNAME VALIDITY CHECKS HAVE PASSED - GET DDNAME               */ 03388000
*   /*                                                               */ 03389000
*   /*****************************************************************/ 03390000
*                                                                  1377 03391000
*   DDPTR=DCBTIOT+DEBTCBB->TCBTIO;  /* FIND ENTRY IN TIOT            */ 03392000
         ALR   @15,@05                                             1377 03393000
         LR    DDPTR,@15                                           1377 03394000
*   SCKPTR=ADDR(DDNAMEO);                                          1378 03395000
         LA    @05,DDNAMEO(,DDPTR)                                 1378 03396000
         ST    @05,SCKPTR(,AWSAPTR)                                1378 03397000
*   SCKLEN=LENGTH(DDNAME);                                         1379 03398000
         MVC   SCKLEN(4,AWSAPTR),@CF00061                          1379 03399000
*   CALL SCK;                                                      1380 03400000
         BAL   @14,SCK                                             1380 03401000
*   DDNAME=DDNAMEO;                 /* MOVE DDNAME TO RECORD         */ 03402000
         MVC   DDNAME(8,AWSAPTR),DDNAMEO(DDPTR)                    1381 03403000
*   DDNAME=DDNAME|BLANKS;           /* ENSURE EBCDIC                 */ 03404000
         OC    DDNAME(8,AWSAPTR),@CC04627                          1382 03405000
*   IF DDNAME=DDNAMEO THEN                                         1383 03406000
         CLC   DDNAME(8,AWSAPTR),DDNAMEO(DDPTR)                    1383 03407000
         BE    @RT01383                                            1383 03408000
*     GO TO SVDDNCKC;                                              1384 03409000
*   ELSE                                                           1385 03410000
*     GO TO SVDDNCKB;                                              1385 03411000
         B     SVDDNCKB                                            1385 03412000
*SVDSN:                                                            1386 03413000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               1386 03414000
SVDSN    DS    0H                                                  1387 03415000
*   RFY                                                            1387 03416000
*     R14 RSTD;                                                    1387 03417000
*   RETSAVE=RETURNAD;                                              1388 03418000
         LR    RETSAVE,RETURNAD                                    1388 03419000
*   RFY                                                            1389 03420000
*     R14 UNRSTD;                                                  1389 03421000
*   RECPTR=ADDR(MCAREC)+RECLGTH;                                   1390 03422000
         LA    RECPTR,MCAREC(,AWSAPTR)                             1390 03423000
         ALR   RECPTR,RECLGTH                                      1390 03424000
*   DO INDEX=1 TO 44;               /* SCAN FOR FIRST BLANK          */ 03425000
         LA    INDEX,1                                             1391 03426000
@DL01391 DS    0H                                                  1392 03427000
*     IF DSNCHAR(INDEX)=BLANKS THEN                                1392 03428000
         LR    @05,PARMPTR                                         1392 03429000
         ALR   @05,INDEX                                           1392 03430000
         BCTR  @05,0                                               1392 03431000
         CLI   DSNCHAR(@05),C' '                                   1392 03432000
         BE    @RT01392                                            1392 03433000
*       GO TO SVDSNA;                                              1393 03434000
*   END;                                                           1394 03435000
         AL    INDEX,@CF00063                                      1394 03436000
         C     INDEX,@CF02955                                      1394 03437000
         BNH   @DL01391                                            1394 03438000
*SVDSNA:                                                           1395 03439000
*   INDEX=INDEX-1;                  /* SUBTRACT ONE                  */ 03440000
SVDSNA   BCTR  INDEX,0                                             1395 03441000
*   IF INDEX=NULL THEN                                             1396 03442000
         LTR   INDEX,INDEX                                         1396 03443000
         BNZ   @RF01396                                            1396 03444000
*     DO;                           /* ZERO INDEX INDICATES DSNAME 1397 03445000
*                                      WAS BLANK - MOVE IN N/A M4383 */ 03446000
*       INDEX=3;                    /* SET LENGTH TO 3 M4383         */ 03447000
         LA    INDEX,3                                             1398 03448000
*       DSNAME(1:3)=NOTAPP;         /* MOVE IN N/A M4383             */ 03449000
         MVC   DSNAME(3,RECPTR),@CC04600                           1399 03450000
*     END;                                                         1400 03451000
*   ELSE                                                           1401 03452000
*     DO;                                                          1401 03453000
         B     @RC01396                                            1401 03454000
@RF01396 DS    0H                                                  1402 03455000
*       GEN(IC   R14,USERKEY  PICK UP USERS PROTECT KEY );         1402 03456000
         IC   R14,USERKEY  PICK UP USERS PROTECT KEY                    03457000
*       SPKA(R14);                  /* CHANGE TO USERS PROT KEY      */ 03458000
         SPKA  0(R14)                                              1403 03459000
*       R14=ADDR(DSETNM);           /* PICK UP PTR TO DSNAME TO BE 1404 03460000
*                                      CHECKED                       */ 03461000
         LR    R14,PARMPTR                                         1404 03462000
*       GEN(TM  0(R14),X'00'  TEST FOR FETCH PROTECTION );         1405 03463000
         TM  0(R14),X'00'  TEST FOR FETCH PROTECTION                    03464000
*       R14=R14+INDEX-1;            /* BUMP PTR TO LAST BYTE OF AREA */ 03465000
         LR    @15,R14                                             1406 03466000
         ALR   @15,INDEX                                           1406 03467000
         BCTR  @15,0                                               1406 03468000
         LR    R14,@15                                             1406 03469000
*       GEN(TM  0(R14),X'00'  TEST FOR FETCH PROTECTION );         1407 03470000
         TM  0(R14),X'00'  TEST FOR FETCH PROTECTION                    03471000
*       SPKA(0);                    /* CHANGE BACK TO ZERO PROT KEY  */ 03472000
         SLR   @05,@05                                             1408 03473000
         SPKA  0(@05)                                              1408 03474000
*       DSNAME(1:INDEX)=DSETNM;     /* OTHERWISE, MOVE IN DSN M4383  */ 03475000
         LR    @05,INDEX                                           1409 03476000
         BCTR  @05,0                                               1409 03477000
         EX    @05,@SM05760                                        1409 03478000
*     END;                                                         1410 03479000
*   DSNLEN=INDEX;                   /* PLACE COUNT INTO LEN FIELD    */ 03480000
@RC01396 STC   INDEX,DSNLEN(,RECPTR)                               1411 03481000
*   RECLGTH=RECLGTH+INDEX+LENGTH(DSNLEN);/* UPDATE MSG LEN           */ 03482000
         LR    @05,RECLGTH                                         1412 03483000
         ALR   @05,INDEX                                           1412 03484000
         AL    @05,@CF00063                                        1412 03485000
         LR    RECLGTH,@05                                         1412 03486000
*   RFY                                                            1413 03487000
*     R14 RSTD;                                                    1413 03488000
*   RETURNAD=RETSAVE;               /* RESTORE RETURN ADDRESS        */ 03489000
         LR    RETURNAD,RETSAVE                                    1414 03490000
*   RETURN;                                                        1415 03491000
@EL00002 DS    0H                                                  1415 03492000
@EF00002 DS    0H                                                  1415 03493000
@ER00002 BR    @14                                                 1415 03494000
*   RFY                                                            1416 03495000
*     R14 UNRSTD;                                                  1416 03496000
*   END SVDSN;                                                     1417 03497000
*SCK:                                                              1418 03498000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               1418 03499000
SCK      DS    0H                                                  1419 03500000
*   RFY                                                            1419 03501000
*     R14 RSTD;                                                    1419 03502000
*   RETSAVE=RETURNAD;               /* SAVE CALLERS RETURN ADDRESS   */ 03503000
         LR    RETSAVE,RETURNAD                                    1420 03504000
*   GEN(IC   R14,USERKEY  PICK UP USERS PROTECT KEY );             1421 03505000
         IC   R14,USERKEY  PICK UP USERS PROTECT KEY                    03506000
*   SPKA(R14);                      /* CHANGE TO USERS PROT KEY      */ 03507000
         SPKA  0(R14)                                              1422 03508000
*   R14=SCKPTR;                     /* PICK UP PTR TO AREA TO BE   1423 03509000
*                                      CHECKED                       */ 03510000
         L     R14,SCKPTR(,AWSAPTR)                                1423 03511000
*   GEN(IC   R15RC,0(R14) TEST FOR FETCH PROTECTION );             1424 03512000
         IC   R15RC,0(R14) TEST FOR FETCH PROTECTION                    03513000
*   R14=R14+SCKLEN;                 /* BUMP PTR TO LAST BYTE OF AREA */ 03514000
         AL    R14,SCKLEN(,AWSAPTR)                                1425 03515000
*   R14=R14-1;                      /* BACK UP ONE                   */ 03516000
         BCTR  R14,0                                               1426 03517000
*   GEN(IC  R15RC,0(R14)  TEST FOR FETCH PROTECTION );             1427 03518000
         IC  R15RC,0(R14)  TEST FOR FETCH PROTECTION                    03519000
*   SPKA(0);                        /* CHANGE BACK INTO KEY ZERO     */ 03520000
         SLR   @15,@15                                             1428 03521000
         SPKA  0(@15)                                              1428 03522000
*   RETURNAD=RETSAVE;               /* RESTORE CALLERS RETURN ADDRESS*/ 03523000
         LR    RETURNAD,RETSAVE                                    1429 03524000
*   RETURN;                                                        1430 03525000
@EL00003 DS    0H                                                  1430 03526000
@EF00003 DS    0H                                                  1430 03527000
@ER00003 BR    @14                                                 1430 03528000
*   RFY                                                            1431 03529000
*     R14 UNRSTD;                                                  1431 03530000
*   END SCK;                                                       1432 03531000
*AHLTSVCE:                                                         1433 03532000
*   GEN SETS(BASEREG1,BASEREG2,BASEREG3) NOEXIT NOFLOWS SEQFLOW;   1433 03533000
*                                                                  1433 03534000
AHLTSVCE DS    0H                                                  1433 03535000
*                    /* @ZM30921*/                                      03536000
         USING   AHLTSVCE,R15ENTRY   SETUP TEMP BASE REG                03537000
         B       SETUP               BRANCH AROUND ADCONS               03538000
EBASEAD1 DC    A(AHLTSVC)            ADDR OF ENTRY POINT                03539000
EBASEAD2 DC    A(AHLTSVC+4095)       ADDR OF SECOND 4K SECTION          03540000
EBASEAD3 DC    A(AHLTSVC+8190)  3RD BASE REG                  ZM30921   03541000
SETUP    L       BASEREG1,EBASEAD1   LOAD PERM BASE REG1                03542000
         L       BASEREG2,EBASEAD2   LOAD PERM BASE REG2                03543000
         L     BASEREG3,EBASEAD3                              ZM30921   03544000
         USING   AHLTSVC,BASEREG1    TELL ASSEM ABOUT PERM BASE         03545000
         USING   AHLTSVC+4095,BASEREG2     TELL ASSEM ABOUT PERM BASE   03546000
         USING AHLTSVC+8190,BASEREG3                          ZM30921   03547000
         DROP    R15ENTRY            DROP TEMP BASE                     03548000
*   /*****************************************************************/ 03549000
*   /*                                                               */ 03550000
*   /* THIS IS THE FRR FOR AHLTSVC. IF AN ERROR OCCURRS DURING THE   */ 03551000
*   /* EXECUTION OF THE MODULE THIS ROUTINE GAINS CONTROL CERTAIN    */ 03552000
*   /* ERROR CONDITIONS ARE CHECKED AND APPRORIATE ACTION IS TAKEN   */ 03553000
*   /* DEPENDING ON THE ERROR                                        */ 03554000
*   /*                                                               */ 03555000
*   /*****************************************************************/ 03556000
*                                                                  1434 03557000
*   ;                                                              1434 03558000
*                                                                  1434 03559000
*   /*****************************************************************/ 03560000
*   /*                                                               */ 03561000
*   /* GET THE FRR PARAMETER FIELD FROM THE SDWA, SAVE REG 14 FOR    */ 03562000
*   /* RETURN TO RTM, RE-ESTABLISH ADDRESSIBILITY TO THE MCAWSA,SAVE */ 03563000
*   /* THE MCATRAIL BITS AT THE TIME OF ERROR, TURN ON THE ERROR BIT,*/ 03564000
*   /* AND RE-ESTABLISH ADDRESSIBILITY TO THE GTFPCT AND THE MCQE    */ 03565000
*   /*                                                               */ 03566000
*   /*****************************************************************/ 03567000
*                                                                  1435 03568000
*   RFY                                                            1435 03569000
*    (LCCAPTR,                                                     1435 03570000
*     R14,                                                         1435 03571000
*     PTRMCQE,                                                     1435 03572000
*     SDWAPTR) RSTD;                                               1435 03573000
*   RFY                                                            1436 03574000
*     MCRWSA BASED(WSACGTF);                                       1436 03575000
*   RFY                                                            1437 03576000
*     MCQE BASED(PTRMCQE);                                         1437 03577000
*   FRRPARM=SDWAPARM;               /* PICK UP ADDRESS OF FRR PARM 1438 03578000
*                                      FIELD                         */ 03579000
         L     FRRPARM,SDWAPARM(,SDWAPTR)                          1438 03580000
*   SVR14FRR=R14;                   /* SAVE RETURN ADDRESS TO RTM    */ 03581000
         ST    R14,SVR14FRR(,FRRPARM)                              1439 03582000
*   LCCAPTR=PSALCCAV;               /* PICK UP POINTER TO THE LCCA 1440 03583000
*                                      FROM THE PSA                  */ 03584000
         L     LCCAPTR,PSALCCAV                                    1440 03585000
*   AWSAPTR=MCRMCA;                 /* GET ADDRESS OF MCAWSA AT ERROR   03586000
*                                      FROM MCRWSA                   */ 03587000
         L     @15,LCCACPUS(,LCCAPTR)                              1441 03588000
         L     @15,WSACGTF(,@15)                                   1441 03589000
         L     AWSAPTR,MCRMCA(,@15)                                1441 03590000
*   RFY                                                            1442 03591000
*    (LCCAPTR,                                                     1442 03592000
*     R14) UNRSTD;                                                 1442 03593000
*   RFY                                                            1443 03594000
*     MCRWSA BASED(MCAMCR);                                        1443 03595000
*   MCAERROR=ON;                    /* INDICATE ERROR ROUTINE IN   1444 03596000
*                                      CONTROL                       */ 03597000
         OI    MCAERROR(AWSAPTR),B'00000100'                       1444 03598000
*   PTRMCQE=MCRREG0;                /* GET ADDR OF MCQE AT TIME OF 1445 03599000
*                                      ERROR FROM MCRWSA             */ 03600000
         L     @05,MCAMCR(,AWSAPTR)                                1445 03601000
         L     PTRMCQE,MCRREG0(,@05)                               1445 03602000
*   PCTPTR=MCQEAT;                  /* GET ADDR OF PCT AT TIME OF  1446 03603000
*                                      ERROR FROM SDWA               */ 03604000
         LR    @05,PTRMCQE                                         1446 03605000
         L     PCTPTR,MCQEAT(,@05)                                 1446 03606000
*   ERRTRNAD=SDWAGR10;              /* PICK UP ERROR ENTRY ADDRESS   */ 03607000
         L     ERRTRNAD,SDWAGR10(,SDWAPTR)                         1447 03608000
*   DO;                             /* SETRP RECPARM(RECID)          */ 03609000
*     RESPECIFY                                                    1449 03610000
*      (GPR00P,                                                    1449 03611000
*       GPR01P,                                                    1449 03612000
*       GPR14P,                                                    1449 03613000
*       GPR15P) RSTD;                                              1449 03614000
*     GPR01P->SDWARCDE=0;           /* SAVE RC VALUE                 */ 03615000
         MVI   SDWARCDE(GPR01P),X'00'                              1450 03616000
*     GPR15P=ADDR(RECID);           /* ACCESS RECORD PARAMETER LIST  */ 03617000
         LA    GPR15P,RECID                                        1451 03618000
*     GPR01P->SDWARECP=GPR15P->I256C(1:24);/* COPY RECORD PARAMETERS */ 03619000
         MVC   SDWARECP(24,GPR01P),I256C(GPR15P)                   1452 03620000
*     RESPECIFY                                                    1453 03621000
*      (GPR00P,                                                    1453 03622000
*       GPR01P,                                                    1453 03623000
*       GPR14P,                                                    1453 03624000
*       GPR15P) UNRSTD;                                            1453 03625000
*   END;                                                           1454 03626000
*                                                                  1455 03627000
*   /*****************************************************************/ 03628000
*   /*                                                               */ 03629000
*   /* DETERMINE WHAT THE ERROR WAS                                  */ 03630000
*   /*                                                               */ 03631000
*   /*****************************************************************/ 03632000
*                                                                  1455 03633000
*   ;                                                              1455 03634000
*                                                                  1455 03635000
*   /*****************************************************************/ 03636000
*   /*                                                               */ 03637000
*   /* THE FIRST CHECK IS FOR A MACHINE CHECK. IF THE ERROR IS A     */ 03638000
*   /* MACHINE CHECK THEN WE NEED TO DETERMINE IF IT IS A RECOVERABLE*/ 03639000
*   /* ERROR BY CHECKING FOR AN INSTRUCTION FAILURE AND TO SEE IF THE*/ 03640000
*   /* REGISTERS AND PSW ARE VALID. IF THESE CONDITIONS EXIST THEN WE*/ 03641000
*   /* WILL RETRY TO THE ADDRESS IN THE PSW AT ERROR THAT IS         */ 03642000
*   /* CONTAINED AT SDWAEC1 IN THE RTCS. OTHERWISE WE WILL DISABLE   */ 03643000
*   /* THE ROUTINE AND RETURN TO AHLMCIH                             */ 03644000
*   /*                                                               */ 03645000
*   /*****************************************************************/ 03646000
*                                                                  1456 03647000
*   IF SDWAMCHK=ON THEN             /* CHECK FOR MACHINE CHECK ERROR */ 03648000
         TM    SDWAMCHK(SDWAPTR),B'10000000'                       1456 03649000
         BNO   @RF01456                                            1456 03650000
*     DO;                                                          1457 03651000
*       DO;                         /* SETRP RC(SDWACWT)             */ 03652000
*         RESPECIFY                                                1459 03653000
*          (GPR00P,                                                1459 03654000
*           GPR01P,                                                1459 03655000
*           GPR14P,                                                1459 03656000
*           GPR15P) RSTD;                                          1459 03657000
*         GPR01P->SDWARCDE=SDWACWT; /* SAVE RC VALUE                 */ 03658000
         MVI   SDWARCDE(GPR01P),X'00'                              1460 03659000
*         RESPECIFY                                                1461 03660000
*          (GPR00P,                                                1461 03661000
*           GPR01P,                                                1461 03662000
*           GPR14P,                                                1461 03663000
*           GPR15P) UNRSTD;                                        1461 03664000
*       END;                                                       1462 03665000
*     END;                                                         1463 03666000
*   ELSE                            /* IT IS NOT MACH CHECK ERROR SO    03667000
*                                      CHECK THE REST                */ 03668000
*                                                                  1464 03669000
*     /***************************************************************/ 03670000
*     /*                                                             */ 03671000
*     /* CHECK TO SEE IF THE ROUTINE WAS PERCOLATED TO               */ 03672000
*     /*                                                             */ 03673000
*     /***************************************************************/ 03674000
*                                                                  1464 03675000
*     IF SDWAPERC=ON THEN           /* CHECK TO SEE IF WE WERE     1464 03676000
*                                      PERCOLATED TO                 */ 03677000
         B     @RC01456                                            1464 03678000
@RF01456 TM    SDWAPERC(SDWAPTR),B'00010000'                       1464 03679000
         BNO   @RF01464                                            1464 03680000
*       DO;                                                        1465 03681000
*         DO;                       /* SETRP RC(SDWACWT)             */ 03682000
*           RESPECIFY                                              1467 03683000
*            (GPR00P,                                              1467 03684000
*             GPR01P,                                              1467 03685000
*             GPR14P,                                              1467 03686000
*             GPR15P) RSTD;                                        1467 03687000
*           GPR01P->SDWARCDE=SDWACWT;/* SAVE RC VALUE                */ 03688000
         MVI   SDWARCDE(GPR01P),X'00'                              1468 03689000
*           RESPECIFY                                              1469 03690000
*            (GPR00P,                                              1469 03691000
*             GPR01P,                                              1469 03692000
*             GPR14P,                                              1469 03693000
*             GPR15P) UNRSTD;                                      1469 03694000
*         END;                                                     1470 03695000
*         IF SDWAEAS=OFF THEN       /* CHECK TO SEE IF THE PREVIOUS     03696000
*                                      EXIT TOOK A DUMP              */ 03697000
         TM    SDWAEAS(SDWAPTR),B'00001000'                        1471 03698000
         BNZ   @RF01471                                            1471 03699000
*           DO;                     /*                       @YM01897*/ 03700000
*             SPLPTR=ADDR(DMPLIST); /* LOAD PLST FOR DUMP MODLE    1473 03701000
*                                                            @YM01897*/ 03702000
         LA    SPLPTR,DMPLIST                                      1473 03703000
*             CALL AHLDMPMD;        /* CALL THE DUMPING ROUTINE      */ 03704000
         L     @15,PCTDMPMD(,PCTPTR)                               1474 03705000
         BALR  @14,@15                                             1474 03706000
*           END;                                                   1475 03707000
*       END;                                                       1476 03708000
*     ELSE                                                         1477 03709000
*       DO;                                                        1477 03710000
         B     @RC01464                                            1477 03711000
@RF01464 DS    0H                                                  1478 03712000
*         IF MCATRL8=1 THEN         /*                       @YM04524*/ 03713000
         CLI   MCATRL8(AWSAPTR),1                                  1478 03714000
         BNE   @RF01478                                            1478 03715000
*           DO;                     /*                       @ZM30921*/ 03716000
*             ERRTRNAD=RETSAV4;     /* RELOAD REG 10         @ZM30921*/ 03717000
         L     ERRTRNAD,RETSAV4(,AWSAPTR)                          1480 03718000
*             RETURNAD=RETSAV3;     /* RELOAD REG14          @ZM30921*/ 03719000
         L     RETURNAD,RETSAV3(,AWSAPTR)                          1481 03720000
*             SDWASR10=ERRTRNAD;    /* RESET R10,11,14 IN SDWA     1482 03721000
*                                                            @ZA09002*/ 03722000
         ST    ERRTRNAD,SDWASR10(,SDWAPTR)                         1482 03723000
*             SDWASR11=BASEREG1;    /*                       @ZA09002*/ 03724000
         ST    BASEREG1,SDWASR11(,SDWAPTR)                         1483 03725000
*             SDWASR14=RETURNAD;    /*                       @ZA09002*/ 03726000
         ST    RETURNAD,SDWASR14(,SDWAPTR)                         1484 03727000
*             DO;                   /* SETRP RECORD(NO)              */ 03728000
*               RESPECIFY                                          1486 03729000
*                (GPR00P,                                          1486 03730000
*                 GPR01P,                                          1486 03731000
*                 GPR14P,                                          1486 03732000
*                 GPR15P) RSTD;                                    1486 03733000
*               GPR01P->SDWARCDE=0; /* SAVE RC VALUE                 */ 03734000
         MVI   SDWARCDE(GPR01P),X'00'                              1487 03735000
*               GPR01P->SDWARCRD='0'B;/* TURN OFF RECORD INDICATOR   */ 03736000
         NI    SDWARCRD(GPR01P),B'01111111'                        1488 03737000
*               RESPECIFY                                          1489 03738000
*                (GPR00P,                                          1489 03739000
*                 GPR01P,                                          1489 03740000
*                 GPR14P,                                          1489 03741000
*                 GPR15P) UNRSTD;                                  1489 03742000
*             END;                  /* TURN OFF, LOGGING ERROR     1490 03743000
*                                                            @YM04524*/ 03744000
*           END;                    /*                       @ZM30921*/ 03745000
*         IF FLCPICOD='0011'X THEN  /* CHECK FOR PAGE FAULT          */ 03746000
@RF01478 CLC   FLCPICOD(2),@CH05687                                1492 03747000
         BNE   @RF01492                                            1492 03748000
*           DO;                                                    1493 03749000
*             ERRINDX=2;            /* SETUP INDEX TO ERR INDICATOR     03750000
*                                      TABLE                         */ 03751000
         LA    ERRINDX,2                                           1494 03752000
*             IF ERRTRNAD=0 THEN    /* CHECK FOR AN UNRECOVERABLE  1495 03753000
*                                      ERROR                         */ 03754000
         LTR   ERRTRNAD,ERRTRNAD                                   1495 03755000
         BZ    @RT01495                                            1495 03756000
*               GO TO UNRECERR;     /* IT IS UNRECOVERABLE SO GO AND    03757000
*                                      HANDLE IT                     */ 03758000
*             ELSE                                                 1497 03759000
*               DO;                 /*                       @YM04520*/ 03760000
*                 DO;               /* SETRP RECORD(NO)              */ 03761000
*                   RESPECIFY                                      1499 03762000
*                    (GPR00P,                                      1499 03763000
*                     GPR01P,                                      1499 03764000
*                     GPR14P,                                      1499 03765000
*                     GPR15P) RSTD;                                1499 03766000
*                   GPR01P->SDWARCDE=0;/* SAVE RC VALUE              */ 03767000
         MVI   SDWARCDE(GPR01P),X'00'                              1500 03768000
*                   GPR01P->SDWARCRD='0'B;/* TURN OFF RECORD       1501 03769000
*                                      INDICATOR                     */ 03770000
         NI    SDWARCRD(GPR01P),B'01111111'                        1501 03771000
*                   RESPECIFY                                      1502 03772000
*                    (GPR00P,                                      1502 03773000
*                     GPR01P,                                      1502 03774000
*                     GPR14P,                                      1502 03775000
*                     GPR15P) UNRSTD;                              1502 03776000
*                 END;              /* DISALLOW LOGREC RECORD ON PAGE   03777000
*                                      FAULTS                @YM04520*/ 03778000
*                 GO TO RECOVERY;   /* IT IS A VALID PAGE FAULT IN 1504 03779000
*                                      RECOVERY CODE SO GO TO THE  1504 03780000
*                                      RECOVERY SECTION              */ 03781000
         B     RECOVERY                                            1504 03782000
*               END;                /*                       @YM04520*/ 03783000
*           END;                                                   1506 03784000
*         ELSE                      /* IS NOT A PAGE FAULT           */ 03785000
*           IF FLCPICOD='0004'X THEN/* CHECK FOR PROTECTION CHECK    */ 03786000
@RF01492 CLC   FLCPICOD(2),@CH04272                                1507 03787000
         BNE   @RF01507                                            1507 03788000
*             DO;                                                  1508 03789000
*               ERRINDX=3;          /* SETUP INDEX TO ERR INDICATOR     03790000
*                                      TABLE                         */ 03791000
         LA    ERRINDX,3                                           1509 03792000
*               IF ERRTRNAD=0 THEN  /* CHECK FOR AN UNRECOVERABLE  1510 03793000
*                                      ERROR                         */ 03794000
         LTR   ERRTRNAD,ERRTRNAD                                   1510 03795000
         BZ    @RT01510                                            1510 03796000
*                 GO TO UNRECERR;   /* IT IS UNRECOVERABLE SO GO AND    03797000
*                                      HANDLE IT                     */ 03798000
*               ELSE                                               1512 03799000
*                 DO;               /*                       @ZA14116*/ 03800000
*                   DO;             /* SETRP RECORD(NO)              */ 03801000
*                     RESPECIFY                                    1514 03802000
*                      (GPR00P,                                    1514 03803000
*                       GPR01P,                                    1514 03804000
*                       GPR14P,                                    1514 03805000
*                       GPR15P) RSTD;                              1514 03806000
*                     GPR01P->SDWARCDE=0;/* SAVE RC VALUE            */ 03807000
         MVI   SDWARCDE(GPR01P),X'00'                              1515 03808000
*                     GPR01P->SDWARCRD='0'B;/* TURN OFF RECORD     1516 03809000
*                                      INDICATOR                     */ 03810000
         NI    SDWARCRD(GPR01P),B'01111111'                        1516 03811000
*                     RESPECIFY                                    1517 03812000
*                      (GPR00P,                                    1517 03813000
*                       GPR01P,                                    1517 03814000
*                       GPR14P,                                    1517 03815000
*                       GPR15P) UNRSTD;                            1517 03816000
*                   END;            /* DISALLOW LOGREC RECORDING ON     03817000
*                                      PROTECTION CHECKS IF        1518 03818000
*                                      RECOVERABLE           @ZA14116*/ 03819000
*                   GO TO RECOVERY; /* IT IS A VALID PROTECTION CHECK   03820000
*                                      IN RECOVERY CODE SO GO TO THE    03821000
*                                      RECOVERY SECTION      @ZA14116*/ 03822000
         B     RECOVERY                                            1519 03823000
*                 END;              /*                       @ZA14116*/ 03824000
*             END;                                                 1521 03825000
*           ELSE                                                   1522 03826000
*             IF FLCPICOD='0010'X THEN/* IS INTERRUPT SEGMENT      1522 03827000
*                                      EXCEPTION             @ZA17678*/ 03828000
@RF01507 CLC   FLCPICOD(2),@CH05690                                1522 03829000
         BNE   @RF01522                                            1522 03830000
*               DO;                 /*                       @ZA17678*/ 03831000
*                 ERRINDX=1;        /* YES, SET UP TO MOVE ASTERISKS    03832000
*                                      IN THE FIELD          @ZA17678*/ 03833000
         LA    ERRINDX,1                                           1524 03834000
*                 IF ERRTRNAD=0 THEN/* IS RETRY ADDRESS VALID      1525 03835000
*                                                            @ZA17678*/ 03836000
         LTR   ERRTRNAD,ERRTRNAD                                   1525 03837000
         BZ    @RT01525                                            1525 03838000
*                   GO TO UNRECERR; /* NO, THEN ERROR IS UNRECOV-  1526 03839000
*                                      ERABLE                @ZA17678*/ 03840000
*                 ELSE                                             1527 03841000
*                   DO;             /*                       @ZA17678*/ 03842000
*                     DO;           /* SETRP RECORD(NO)              */ 03843000
*                       RESPECIFY                                  1529 03844000
*                        (GPR00P,                                  1529 03845000
*                         GPR01P,                                  1529 03846000
*                         GPR14P,                                  1529 03847000
*                         GPR15P) RSTD;                            1529 03848000
*                       GPR01P->SDWARCDE=0;/* SAVE RC VALUE          */ 03849000
         MVI   SDWARCDE(GPR01P),X'00'                              1530 03850000
*                       GPR01P->SDWARCRD='0'B;/* TURN OFF RECORD   1531 03851000
*                                      INDICATOR                     */ 03852000
         NI    SDWARCRD(GPR01P),B'01111111'                        1531 03853000
*                       RESPECIFY                                  1532 03854000
*                        (GPR00P,                                  1532 03855000
*                         GPR01P,                                  1532 03856000
*                         GPR14P,                                  1532 03857000
*                         GPR15P) UNRSTD;                          1532 03858000
*                     END;          /* OTHERWISE, TURN OFF THE     1533 03859000
*                                      RECORDING OF SEGMENT        1533 03860000
*                                      EXCEPTIONS            @ZA17678*/ 03861000
*                     GO TO RECOVERY;/* NOW ATTEMPT TO RETRY @ZA17678*/ 03862000
         B     RECOVERY                                            1534 03863000
*                   END;            /*                       @ZA17678*/ 03864000
*               END;                /*                       @ZA17678*/ 03865000
*                                                                  1537 03866000
*         /***********************************************************/ 03867000
*         /*                                                         */ 03868000
*         /* CHECK FOR DEBUG MODE ON OR OFF AND TO SEE IF WE WERE    */ 03869000
*         /* ENTERED ONLY FOR CLEANUP                                */ 03870000
*         /*                                                         */ 03871000
*         /***********************************************************/ 03872000
*                                                                  1537 03873000
*         IF GTFDEBUG=ON|SDWACLUP=ON THEN/* CHECK TO SEE IF USER WANT   03874000
*                                      TERMINATION AND DUMP OR IF WE    03875000
*                                      WERE ENTERED ONLY FOR CLEANUP */ 03876000
@RF01522 TM    GTFDEBUG(PCTPTR),B'01000000'                        1537 03877000
         BO    @RT01537                                            1537 03878000
         TM    SDWACLUP(SDWAPTR),B'10000000'                       1537 03879000
         BNO   @RF01537                                            1537 03880000
@RT01537 DS    0H                                                  1538 03881000
*           DO;                                                    1538 03882000
*             CALL DMPMOD;          /* CALL TO DO SDUMP              */ 03883000
         BAL   @14,DMPMOD                                          1539 03884000
*             DO;                   /* SETRP RC(SDWACWT)             */ 03885000
*               RESPECIFY                                          1541 03886000
*                (GPR00P,                                          1541 03887000
*                 GPR01P,                                          1541 03888000
*                 GPR14P,                                          1541 03889000
*                 GPR15P) RSTD;                                    1541 03890000
*               GPR01P->SDWARCDE=SDWACWT;/* SAVE RC VALUE            */ 03891000
         MVI   SDWARCDE(GPR01P),X'00'                              1542 03892000
*               RESPECIFY                                          1543 03893000
*                (GPR00P,                                          1543 03894000
*                 GPR01P,                                          1543 03895000
*                 GPR14P,                                          1543 03896000
*                 GPR15P) UNRSTD;                                  1543 03897000
*             END;                                                 1544 03898000
*           END;                                                   1545 03899000
*         ELSE                      /* NOT DEBUG MODE SO CHECK MORE  */ 03900000
*                                                                  1546 03901000
*           /*********************************************************/ 03902000
*           /*                                                       */ 03903000
*           /* CHECK FOR AN UNRECOVERABLE ERROR                      */ 03904000
*           /*                                                       */ 03905000
*           /*********************************************************/ 03906000
*                                                                  1546 03907000
*           IF ERRTRNAD=0 THEN                                     1546 03908000
         B     @RC01537                                            1546 03909000
@RF01537 LTR   ERRTRNAD,ERRTRNAD                                   1546 03910000
         BNZ   @RF01546                                            1546 03911000
*UNRECERR:                          /* CHECK FOR UNRECOVERABLE ERROR */ 03912000
*             CALL CATERR;          /* GET CATAS ERROR ROUTINE       */ 03913000
UNRECERR BAL   @14,CATERR                                          1547 03914000
*           ELSE                    /* CHECK FOR RECURSION ERROR     */ 03915000
*                                                                  1548 03916000
*             /*******************************************************/ 03917000
*             /*                                                     */ 03918000
*             /* CHECK FOR TOO MANY ENTRIES INTO THE FRR             */ 03919000
*             /*                                                     */ 03920000
*             /*******************************************************/ 03921000
*                                                                  1548 03922000
*             DO;                                                  1548 03923000
         B     @RC01546                                            1548 03924000
@RF01546 DS    0H                                                  1549 03925000
*               RECURCTR=RECURCTR+1;/* UPDATE RECURSION COUNT        */ 03926000
         LA    @05,1                                               1549 03927000
         LH    @15,RECURCTR(,FRRPARM)                              1549 03928000
         N     @15,@CF04659                                        1549 03929000
         ALR   @05,@15                                             1549 03930000
         STH   @05,RECURCTR(,FRRPARM)                              1549 03931000
*               IF RECURCTR>=RECURLMT THEN/* CHECK FOR TOO MANY    1550 03932000
*                                      RECURSIONS                    */ 03933000
         C     @05,@CF01778                                        1550 03934000
         BL    @RF01550                                            1550 03935000
*                 CALL CATERR;      /* GET CATAS ERROR ROUTINE       */ 03936000
         BAL   @14,CATERR                                          1551 03937000
*               ELSE                /* RECOVERABLE ERROR SO PROCESS     03938000
*                                      IT AS SUCH                    */ 03939000
*                 DO;                                              1552 03940000
         B     @RC01550                                            1552 03941000
@RF01550 DS    0H                                                  1553 03942000
*                   ERRINDX=1;      /* THIS SETS INDX TO PUT       1553 03943000
*                                      ASTERISKS INTO ERROR FIELD    */ 03944000
         LA    ERRINDX,1                                           1553 03945000
*RECOVERY:                                                         1554 03946000
*                   RECLGTH=SDWAGR09;/* GET CURRENT RECLGTH          */ 03947000
RECOVERY L     RECLGTH,SDWAGR09(,SDWAPTR)                          1554 03948000
*RCOVMORE:                                                         1555 03949000
*                   RECPTR=ADDR(MCAREC)+RCOVOFF;/* POINT TO RECORD 1555 03950000
*                                      FIELD                         */ 03951000
RCOVMORE LA    RECPTR,MCAREC(,AWSAPTR)                             1555 03952000
         SLR   @05,@05                                             1555 03953000
         IC    @05,RCOVOFF(,ERRTRNAD)                              1555 03954000
         ALR   RECPTR,@05                                          1555 03955000
*                   IF FLDOFF=ON THEN                              1556 03956000
         TM    FLDOFF(ERRTRNAD),B'00100000'                        1556 03957000
         BNO   @RF01556                                            1556 03958000
*                     IF PLEN=ERRORIND THEN/* CHECK FOR ERROR IND IN    03959000
*                                      LEN FIELD                     */ 03960000
         CLI   PLEN(RECPTR),255                                    1557 03961000
         BNE   @RF01557                                            1557 03962000
*                       RECPTR=RECPTR+LENGTH(PLIST);               1558 03963000
         AL    RECPTR,@CF01868                                     1558 03964000
*                     ELSE                                         1559 03965000
*                       RECPTR=RECPTR+PLEN+LENGTH(PLEN);           1559 03966000
         B     @RC01557                                            1559 03967000
@RF01557 LR    @05,RECPTR                                          1559 03968000
         SLR   @15,@15                                             1559 03969000
         IC    @15,PLEN(,RECPTR)                                   1559 03970000
         ALR   @05,@15                                             1559 03971000
         AL    @05,@CF00063                                        1559 03972000
         LR    RECPTR,@05                                          1559 03973000
*                   IF SECOFF=ON THEN                              1560 03974000
@RC01557 DS    0H                                                  1560 03975000
@RF01556 TM    SECOFF(ERRTRNAD),B'00001000'                        1560 03976000
         BNO   @RF01560                                            1560 03977000
*                     IF PLEN=ERRORIND THEN/* CHECK FOR ERROR IND IN    03978000
*                                      LEN FIELD                     */ 03979000
         CLI   PLEN(RECPTR),255                                    1561 03980000
         BNE   @RF01561                                            1561 03981000
*                       RECPTR=RECPTR+LENGTH(PLIST);               1562 03982000
         AL    RECPTR,@CF01868                                     1562 03983000
*                     ELSE                                         1563 03984000
*                       RECPTR=RECPTR+PLEN+LENGTH(PLEN);           1563 03985000
         B     @RC01561                                            1563 03986000
@RF01561 LR    @05,RECPTR                                          1563 03987000
         SLR   @15,@15                                             1563 03988000
         IC    @15,PLEN(,RECPTR)                                   1563 03989000
         ALR   @05,@15                                             1563 03990000
         AL    @05,@CF00063                                        1563 03991000
         LR    RECPTR,@05                                          1563 03992000
*                   IF FLDLEN=ON THEN/* CHECK TO SEE IF THIS FIELD 1564 03993000
*                                      HAS A LENGTH BYTE             */ 03994000
@RC01561 DS    0H                                                  1564 03995000
@RF01560 TM    FLDLEN(ERRTRNAD),B'00010000'                        1564 03996000
         BNO   @RF01564                                            1564 03997000
*                     DO;                                          1565 03998000
*                       PLEN=ERRORIND;/* SET IN ERROR INDICATOR      */ 03999000
         MVI   PLEN(RECPTR),X'FF'                                  1566 04000000
*                       RECLGTH=RECLGTH+LENGTH(PLEN);/* UPDATE RECORD   04001000
*                                      LENGTH                        */ 04002000
         LA    @05,1                                               1567 04003000
         ALR   RECLGTH,@05                                         1567 04004000
*                       RECPTR=RECPTR+LENGTH(PLEN);/* POINT TO THE 1568 04005000
*                                      FIELD IN ERROR                */ 04006000
         ALR   RECPTR,@05                                          1568 04007000
*                     END;                                         1569 04008000
*                   ERRFLD(1:RCOVLGTH)=ERRTAB(ERRINDX);/* MOVE IN  1570 04009000
*                                      ERROR INDICATORS              */ 04010000
@RF01564 SLR   @05,@05                                             1570 04011000
         IC    @05,RCOVLGTH(,ERRTRNAD)                             1570 04012000
         LR    @15,@05                                             1570 04013000
         BCTR  @15,0                                               1570 04014000
         LR    @14,ERRINDX                                         1570 04015000
         MH    @14,@CH02196                                        1570 04016000
         LA    @05,ERRTAB-52(@14)                                  1570 04017000
         EX    @15,@SM05764                                        1570 04018000
*                   IF BASREC=OFF THEN/* CHECK TO SEE IF ERROR     1571 04019000
*                                      OCCURRED IN BASIC RECORD      */ 04020000
         TM    BASREC(ERRTRNAD),B'00000100'                        1571 04021000
         BNZ   @RF01571                                            1571 04022000
*                     RECLGTH=RECLGTH+RCOVLGTH;/* UPDATE RECORD    1572 04023000
*                                      LENGTH                        */ 04024000
         SLR   @05,@05                                             1572 04025000
         IC    @05,RCOVLGTH(,ERRTRNAD)                             1572 04026000
         ALR   RECLGTH,@05                                         1572 04027000
*                   IF NXTENT=ON THEN/* CK TO SEE IF NEXT ENTRY TO BE   04028000
*                                      PROCESSED                     */ 04029000
@RF01571 TM    NXTENT(ERRTRNAD),B'10000000'                        1573 04030000
         BNO   @RF01573                                            1573 04031000
*                     DO;                                          1574 04032000
*                       ERRTRNAD=ERRTRNAD+LENGTH(RECOVENT);/* MOVE TO   04033000
*                                      NEXT ENTRY                    */ 04034000
         AL    ERRTRNAD,@CF00055                                   1575 04035000
*                       GO TO RCOVMORE;/* RETURN TO PROCESS THE NEXT    04036000
*                                      ENTRY                         */ 04037000
         B     RCOVMORE                                            1576 04038000
*                     END;                                         1577 04039000
*                   ELSE                                           1578 04040000
*                     DO;                                          1578 04041000
@RF01573 DS    0H                                                  1579 04042000
*                       IF NXTDDN=ON THEN/* CK TO SEE IF DDNAME    1579 04043000
*                                      PROCESSING IS NEXT            */ 04044000
         TM    NXTDDN(ERRTRNAD),B'01000000'                        1579 04045000
         BNO   @RF01579                                            1579 04046000
*                         DO;                                      1580 04047000
*                           ERRTRNAD=ADDR(RCOVNAME);/* YES SO SET IT    04048000
*                                      UP                            */ 04049000
         LA    ERRTRNAD,RCOVNAME                                   1581 04050000
*                           GO TO RCOVMORE;                        1582 04051000
         B     RCOVMORE                                            1582 04052000
*                         END;                                     1583 04053000
*                     END;                                         1584 04054000
@RF01579 DS    0H                                                  1585 04055000
*                   RETAD=RETADTAB(RCOVINDX);/* GET RETRY ADDRESS FOR   04056000
*                                      SETRP                         */ 04057000
         SLR   @05,@05                                             1585 04058000
         IC    @05,RCOVINDX(,ERRTRNAD)                             1585 04059000
         SLA   @05,2                                               1585 04060000
         L     RETAD,RETADTAB-4(@05)                               1585 04061000
*                   SDWASR09=RECLGTH;/* UPDATE RECORD LENGTH IN THE     04062000
*                                      REGISTERS THAT WILL BERESTORED   04063000
*                                      ON THE RETRY TO REFLECT WHAT     04064000
*                                      HAS BEEN DONE IN THE FRR      */ 04065000
         ST    RECLGTH,SDWASR09(,SDWAPTR)                          1586 04066000
*                   DO;             /* SETRP RETADDR(RECOVADD)RC(SDWA   04067000
*                                      RETY)RETREGS(YES)             */ 04068000
*                     RESPECIFY                                    1588 04069000
*                      (GPR00P,                                    1588 04070000
*                       GPR01P,                                    1588 04071000
*                       GPR14P,                                    1588 04072000
*                       GPR15P) RSTD;                              1588 04073000
*                     GPR01P->SDWARCDE=SDWARETY;/* STORE RC INTO SDWA*/ 04074000
         MVI   SDWARCDE(GPR01P),X'04'                              1589 04075000
*                     GPR01P->SDWARTYA=ADDR(RECOVADD);/* SAVE RETRY     04076000
*                                      ADDRESS                       */ 04077000
         ST    RETAD,SDWARTYA(,GPR01P)                             1590 04078000
*                     GPR01P->SDWAUPRG='1'B;/* TURN ON RETREGS     1591 04079000
*                                      INDICATOR                     */ 04080000
         OI    SDWAUPRG(GPR01P),B'00001000'                        1591 04081000
*                     RESPECIFY                                    1592 04082000
*                      (GPR00P,                                    1592 04083000
*                       GPR01P,                                    1592 04084000
*                       GPR14P,                                    1592 04085000
*                       GPR15P) UNRSTD;                            1592 04086000
*                   END;                                           1593 04087000
*                 END;                                             1594 04088000
*             END;                                                 1595 04089000
@RC01550 DS    0H                                                  1596 04090000
*       END;                                                       1596 04091000
@RC01546 DS    0H                                                  1596 04092000
@RC01537 DS    0H                                                  1597 04093000
*   RFY                                                            1597 04094000
*     R14 RSTD;                                                    1597 04095000
@RC01464 DS    0H                                                  1597 04096000
@RC01456 DS    0H                                                  1598 04097000
*   R14=SVR14FRR;                   /* RESTORE RTM RETURN ADDRESS    */ 04098000
         L     R14,SVR14FRR(,FRRPARM)                              1598 04099000
*   GEN SETS(R14) EXIT(BR R14 RETURN TO CALLER);                   1599 04100000
         BR R14 RETURN TO CALLER                                        04101000
*   RFY                                                            1600 04102000
*     R14 UNRSTD;                                                  1600 04103000
*DMPMOD:                                                           1601 04104000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               1601 04105000
*                                                                  1601 04106000
         B     @PB00004                                            1601 04107000
DMPMOD   DS    0H                                                  1602 04108000
*   /*****************************************************************/ 04109000
*   /*                                                               */ 04110000
*   /* THIS ROUTINE IS CALLED WHEN THE AHLTSVC FRR ROUTINE IS GOING  */ 04111000
*   /* TO TERMINATE TRACING ON THE ENTIRE MODULE EVENT. THIS ROUTINE */ 04112000
*   /* ISSUES AN SDUMP TO DUMP THE SDWA, MCRWSA AND MCAWSA PLUS THE  */ 04113000
*   /* MODULE ITSELF AND THEN ISSUES A TERMINATION MESSAGE FOR THE   */ 04114000
*   /* EVENT BEING TERMINATED OR FOR THE EVENT CAUSING THE ENTIRE    */ 04115000
*   /* MODULE TO BE TERMINATED (DEBUG = YES).                        */ 04116000
*   /*                                                               */ 04117000
*   /*****************************************************************/ 04118000
*                                                                  1602 04119000
*   RFY                                                            1602 04120000
*     R14 RSTD;                                                    1602 04121000
*   RETSAV2=R14;                    /* SAVE RETURN ADDRESS           */ 04122000
         ST    R14,RETSAV2(,AWSAPTR)                               1603 04123000
*   RFY                                                            1604 04124000
*     R14 UNRSTD;                                                  1604 04125000
*   MCQESAV=PTRMCQE;                /* SAVE MCQE POINTER SINCE SDUMP    04126000
*                                      WILL DESTROY IT               */ 04127000
         ST    PTRMCQE,MCQESAV(,AWSAPTR)                           1605 04128000
*   SDWASAV=SDWAPTR;                /* SAVE THE SDWA POINTER SINCE 1606 04129000
*                                      REG 1 IS USED FOR THE WTO   1606 04130000
*                                      PLIST                         */ 04131000
         ST    SDWAPTR,SDWASAV(,AWSAPTR)                           1606 04132000
*   SPLPTR=ADDR(DMPLIST);           /* LOAD PLIST FOR DUMP MODULE    */ 04133000
         LA    SPLPTR,DMPLIST                                      1607 04134000
*   LSTADR=ADDR(@ENDDATA);          /* SET LAST ADDRESS TO END OF  1608 04135000
*                                      MODULE                        */ 04136000
         LA    @05,@ENDDATA                                        1608 04137000
         STCM  @05,7,LSTADR                                        1608 04138000
*   CALL AHLDMPMD;                  /* CALL THE DUMPING ROUTINE      */ 04139000
         L     @15,PCTDMPMD(,PCTPTR)                               1609 04140000
         BALR  @14,@15                                             1609 04141000
*   RFY                                                            1610 04142000
*     R15RC RSTD;                                                  1610 04143000
*   WTOPARML=WTOCONS;               /* MOVE THE CONSTATNS INTO THE 1611 04144000
*                                      WTO PLIST                     */ 04145000
         MVC   WTOPARML(16,AWSAPTR),@CC04661                       1611 04146000
*   WTODIND=R15RC;                  /* MOVE IN THE SDUMP INDICATOR 1612 04147000
*                                      RETRUNDE BY AHLDMPMD          */ 04148000
         STH   R15RC,WTODIND(,AWSAPTR)                             1612 04149000
*   RFY                                                            1613 04150000
*     R15RC UNRSTD;                                                1613 04151000
*   PARMPTR=ADDR(WTOPARML);         /* LOAD PLIST POINTER INTO     1614 04152000
*                                      REGISTER                      */ 04153000
         LA    PARMPTR,WTOPARML(,AWSAPTR)                          1614 04154000
*   CALL AHLWTOMD;                                                 1615 04155000
         L     @15,PCTWTOMD(,PCTPTR)                               1615 04156000
         BALR  @14,@15                                             1615 04157000
*   PTRMCQE=MCQESAV;                /* RESTORE MCQE ADDRESS          */ 04158000
         L     PTRMCQE,MCQESAV(,AWSAPTR)                           1616 04159000
*   SDWAPTR=SDWASAV;                /* RESTORE SDWA POINTER          */ 04160000
         L     SDWAPTR,SDWASAV(,AWSAPTR)                           1617 04161000
*   RFY                                                            1618 04162000
*     R14 RSTD;                                                    1618 04163000
*   R14=RETSAV2;                    /* RESTORE RETURN ADDRESS        */ 04164000
         L     R14,RETSAV2(,AWSAPTR)                               1619 04165000
*   GEN EXIT(BR R14 RETURN TO CALLER);                             1620 04166000
         BR R14 RETURN TO CALLER                                        04167000
*   RFY                                                            1621 04168000
*     R14 UNRSTD;                                                  1621 04169000
*   END DMPMOD;                                                    1622 04170000
@EL00004 DS    0H                                                  1622 04171000
@EF00004 DS    0H                                                  1622 04172000
@ER00004 BR    @14                                                 1622 04173000
*CATERR:                                                           1623 04174000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               1623 04175000
CATERR   DS    0H                                                  1624 04176000
*   RFY                                                            1624 04177000
*     R14 RSTD;                                                    1624 04178000
*                                                                  1624 04179000
*   /*****************************************************************/ 04180000
*   /*                                                               */ 04181000
*   /* IF AN UNRECOVERABLE ERROR IS ENCOUNTERED AND DEBUG = NO THIS  */ 04182000
*   /* ROUTINE WILL BE CALLED TO STACK THE ERROR RECORD, TURN OFF THE*/ 04183000
*   /* ACTICE FUNCTION, ISSUE THE SETEVENT MACRO TO DISABLE TRACING  */ 04184000
*   /* ON SVC, CALL THE DUMPING ROUTINE AND THEN ISSUE THE CODE THAT */ 04185000
*   /* WILL RETURN TO MCIH WITHOUT TERMINATING ALL OF GTF.           */ 04186000
*   /*                                                               */ 04187000
*   /*****************************************************************/ 04188000
*                                                                  1625 04189000
*   RETSAV1=R14;                    /* SAVE RETURN ADDRESS           */ 04190000
         ST    R14,RETSAV1(,AWSAPTR)                               1625 04191000
*   RFY                                                            1626 04192000
*     R14 UNRSTD;                                                  1626 04193000
*   ERRASCB=CATERIND;               /* INDICATE CATAS ERROR IN FIRST    04194000
*                                      OF RECORD                     */ 04195000
         MVC   ERRASCB(2,AWSAPTR),@CB04604                         1627 04196000
*   SDWASAV=SDWAPTR;                /* SAVE PTR TO RTCA SINCE STACK     04197000
*                                      AND SETEVENT DESTROY IT       */ 04198000
         ST    SDWAPTR,SDWASAV(,AWSAPTR)                           1628 04199000
*   DO;                             /* AHLSTACK DLENGTH(DEFLGTH)AID(A   04200000
*                                      IDC)FID(FIDC)                 */ 04201000
*                                                                  1629 04202000
*     /***************************************************************/ 04203000
*     /*                                                             */ 04204000
*     /* THE FOLLOWING CODE IS GENERATED BY THE AHLSTACK MACRO. THIS */ 04205000
*     /* CODE BUILDS THE GTF RECORD PREFIX AND THEN CALLS AHLSBLOK TO*/ 04206000
*     /* STACK THE RECORD.                                           */ 04207000
*     /*                                                             */ 04208000
*     /***************************************************************/ 04209000
*                                                                  1630 04210000
*     RFY                                                          1630 04211000
*      (AHLRECPR,                                                  1630 04212000
*       AHLSBREG,                                                  1630 04213000
*       AHLRETCD) RSTD;                                            1630 04214000
*     IF OPTTIME='1'B THEN          /* CHECK FOR TIMESTAMP REQUESTED */ 04215000
         TM    OPTTIME(PCTPTR),B'00000001'                         1631 04216000
         BNO   @RF01631                                            1631 04217000
*       DO;                         /* YES, TIMESTAMP                */ 04218000
*         AHLRECPR=ADDR(MCARECPR);  /* SETUP ADDRESSIBILITY TO PREFIX   04219000
*                                      FOR PREFIX WITH TIMESTAMP     */ 04220000
         LA    AHLRECPR,MCARECPR(,AWSAPTR)                         1633 04221000
*         AHLGLGTH=DEFLGTH+16;      /* SET LENGTH TO INCLUDE ***   1634 04222000
*                                      DLENGTH *** PLUS TIMESTAMP  1634 04223000
*                                      PREFIX                        */ 04224000
         MVC   AHLGLGTH(2,AHLRECPR),@CH05070                       1634 04225000
*         GEN(STCK AHLGTST(AHLRECPR) PUT TOD CLOCK VALUE INTO PREFIX )  04226000
*         SETS(AHLGTST) NOEXIT SEQFLOW NOFLOWS;                    1635 04227000
         STCK AHLGTST(AHLRECPR) PUT TOD CLOCK VALUE INTO PREFIX         04228000
*         AHLGEIDL=MCAMCR->MCREID;  /* *** EID *** NOT SPECIFIED PUT    04229000
*                                      DEFAULT INTO PREFIX           */ 04230000
         L     @05,MCAMCR(,AWSAPTR)                                1636 04231000
         MVC   AHLGEIDL(2,AHLRECPR),MCREID(@05)                    1636 04232000
*       END;                                                       1637 04233000
*     ELSE                          /* NO TIMESTAMP TO BE DONE, BUILD   04234000
*                                      SHORT PREFIX                  */ 04235000
*       DO;                                                        1638 04236000
         B     @RC01631                                            1638 04237000
@RF01631 DS    0H                                                  1639 04238000
*         AHLRECPR=ADDR(MCARECPR)+8;/* SETUP ADDRESSIBILITY TO FOR 1639 04239000
*                                      SHORT PREFIX WITHOUT TIMESTAMP*/ 04240000
         LA    AHLRECPR,MCARECPR(,AWSAPTR)                         1639 04241000
         AL    AHLRECPR,@CF00061                                   1639 04242000
*         AHLGLGTH=DEFLGTH+8;       /* PUT TOTAL RECORD LENGTH INTO     04243000
*                                      PREFIX *** DLENGTH *** PLUS 1640 04244000
*                                      PREFIX LENGTH                 */ 04245000
         MVC   AHLGLGTH(2,AHLRECPR),@CH05084                       1640 04246000
*         AHLGEIDS=MCAMCR->MCREID;  /* *** EID *** NOT SPECIFIED PUT    04247000
*                                      DEFAULT INTO PREFIX           */ 04248000
         L     @05,MCAMCR(,AWSAPTR)                                1641 04249000
         MVC   AHLGEIDS(2,AHLRECPR),MCREID(@05)                    1641 04250000
*       END;                                                       1642 04251000
*     AHLGRES=0;                    /* ZERO OUT FOR QSAM           1643 04252000
*                                      COMPATIBILITY                 */ 04253000
@RC01631 SLR   @05,@05                                             1643 04254000
         STH   @05,AHLGRES(,AHLRECPR)                              1643 04255000
*     AHLGAID=AIDC;                 /* PUT *** AID *** INTO PREFIX   */ 04256000
         MVI   AHLGAID(AHLRECPR),X'FF'                             1644 04257000
*     AHLGFID=FIDC;                 /* PUT *** FID *** INTO PREFIX   */ 04258000
         MVI   AHLGFID(AHLRECPR),X'01'                             1645 04259000
*     AHLRETCD=4;                   /* SET DEFAULT RETURN CODE       */ 04260000
         LA    AHLRETCD,4                                          1646 04261000
*     AHLSBREG=SBLOKRTN;            /* GET A STABLE COPY OF AHLSBLOK    04262000
*                                      ADDR                          */ 04263000
         L     AHLSBREG,SBLOKRTN(,PCTPTR)                          1647 04264000
*     IF AHLSBREG^=0 THEN           /* CHECK TO SEE IF AHLSBLOK IS 1648 04265000
*                                      AVAILABLE                     */ 04266000
         CR    AHLSBREG,@05                                        1648 04267000
         BE    @RF01648                                            1648 04268000
*       CALL AHLSBLOK;              /* YES, SO CALL AHLSBLOK TO BLOCK   04269000
*                                      RECORD                        */ 04270000
         LR    @15,AHLSBREG                                        1649 04271000
         BALR  @14,@15                                             1649 04272000
*     RFY                                                          1650 04273000
*      (AHLRECPR,                                                  1650 04274000
*       AHLSBREG,                                                  1650 04275000
*       AHLRETCD) UNRSTD;                                          1650 04276000
@RF01648 DS    0H                                                  1651 04277000
*   END;                                                           1651 04278000
*   SDWAPTR=SDWASAV;                /* REST PTR SINCE DMPMOD WILL  1652 04279000
*                                      SAVE IT                       */ 04280000
         L     SDWAPTR,SDWASAV(,AWSAPTR)                           1652 04281000
*   RFY                                                            1653 04282000
*    (WORK1,                                                       1653 04283000
*     WORK2) RSTD;                                                 1653 04284000
*                                                                  1654 04285000
*   /*****************************************************************/ 04286000
*   /*                                                               */ 04287000
*   /* TURN OFF ACTIVE BIT IN THE PCTCATF FIELD                      */ 04288000
*   /*                                                               */ 04289000
*   /*****************************************************************/ 04290000
*                                                                  1654 04291000
*CKBIT:                                                            1654 04292000
*   IF PCTSVC=ON THEN               /* CHECK TO SEE IF SVC GATHER  1654 04293000
*                                      FUNCTIONS CURRENT BIT IS STILL   04294000
*                                      ON                            */ 04295000
CKBIT    TM    PCTSVC(PCTPTR),B'10000000'                          1654 04296000
         BNO   @RF01654                                            1654 04297000
*     DO;                           /* YES                           */ 04298000
*       WORK1=PCTCATF;              /* GET BITS FOR CURRENT TRACE  1656 04299000
*                                      FUNCTIONS                     */ 04300000
         L     WORK1,PCTCATF(,PCTPTR)                              1656 04301000
*       WORK2=WORK1&&SVCPCT;        /* SET OFF THE SVC BIT IN THE  1657 04302000
*                                      FIELD                         */ 04303000
         LR    WORK2,WORK1                                         1657 04304000
         X     WORK2,@CF04614                                      1657 04305000
*       CS(WORK1,WORK2,PCTCATF);    /* CHECK FOR SAME STATUS         */ 04306000
         CS    WORK1,@07,PCTCATF(PCTPTR)                           1658 04307000
*       BC(4,CKBIT);                /* IF CHANGED START ALL OVER   1659 04308000
*                                      AGAIN                         */ 04309000
         BC    4,CKBIT                                             1659 04310000
*       CALL DMPMOD;                /* CALL TO GET SDUMP             */ 04311000
         BAL   @14,DMPMOD                                          1660 04312000
*       RFY                                                        1661 04313000
*        (WORK1,                                                   1661 04314000
*         WORK2) UNRSTD;                                           1661 04315000
*                                                                  1661 04316000
*       /*************************************************************/ 04317000
*       /*                                                           */ 04318000
*       /* DISABLE TRACING ON ALL SVCS                               */ 04319000
*       /*                                                           */ 04320000
*       /*************************************************************/ 04321000
*                                                                  1662 04322000
*       PTRMCQE=MCRREG0;            /* RESTORE MCQE PTR TO INSURE  1662 04323000
*                                      THAT IT IS GOOD SINCE IT COULD   04324000
*                                      HAVE BEEN DESTROYED BY A MACRO*/ 04325000
         L     @05,MCAMCR(,AWSAPTR)                                1662 04326000
         L     PTRMCQE,MCRREG0(,@05)                               1662 04327000
*       DO;                         /* SETEVENT NAME('GTF')MCQE(MCQE)   04328000
*                                      ACTION(DISABLE)EIDAD(MCREID)  */ 04329000
*                                                                  1663 04330000
*         /***********************************************************/ 04331000
*         /*                                                         */ 04332000
*         /* THE FOLLOWING SECTION OF CODE IS GENERATED BY THE       */ 04333000
*         /* SETEVENT MACRO. THIS CODE WILL BE EITHER AN INITIALIZED */ 04334000
*         /* PARAMETER LIST, OR IF IT IS THE RESULT OF STANDARD OR   */ 04335000
*         /* EXECUTE FORM IT WILL FILL in the list, GENERATE ALL     */ 04336000
*         /* LINKAGES AND CALL THE PROPER sERVICE, EITHER AHLSETEV OR*/ 04337000
*         /* AHLSETD                                                 */ 04338000
*         /*                                                         */ 04339000
*         /***********************************************************/ 04340000
*                                                                  1664 04341000
*         DCL                                                      1664 04342000
*           AHLPPTR REG(1) PTR(31) RSTD;/* PARAMETER LIST ADDRESS    */ 04343000
*         DCL                                                      1665 04344000
*           AHLSETEV ENTRY OPTIONS(EXIT,SEQFLOW) BASED(MCHSETE) VALRG(0 04345000
*               );                  /* ENTRY FOR ADD ACTIVAT,FREE    */ 04346000
*         DCL                                                      1666 04347000
*           AHLSETD ENTRY OPTIONS(EXIT,SEQFLOW) BASED(MCHSETD) VALRG(0) 04348000
*             ;                     /* ENTRY FOR DISABLE AND CHANGE  */ 04349000
*         DCL                                                      1667 04350000
*           1 SEPL BASED(AHLPPTR) BDY(WORD),/* DSECT PARAMETER LIST  */ 04351000
*            2 SEFG PTR(8),         /* ACTION GLAGS                  */ 04352000
*            2 * PTR(8),                                           1667 04353000
*            2 SEEN PTR(8),         /* EID COUNT                     */ 04354000
*            2 SECN PTR(8),         /* CLASS COUNT                   */ 04355000
*            2 SENM CHAR(8),        /* APPLICATION NMAE              */ 04356000
*            2 SEEL PTR(31),        /* ADDRESS OF LIST OF EIDS       */ 04357000
*            2 SECL PTR(31),        /* ADDRESS OF LIST OF CLASSES    */ 04358000
*            2 SEMC PTR(31);        /* MCQE ADDRESS                  */ 04359000
*         DCL                                                      1668 04360000
*           1 SEPL0080 STATIC LOCAL BDY(WORD),/* ACTUAL PLIST FOR  1668 04361000
*                                      STANDARD INVOCATION           */ 04362000
*            2 SEFG0080 PTR(8),                                    1668 04363000
*            2 * PTR(8),                                           1668 04364000
*            2 SEEN0080 PTR(8),                                    1668 04365000
*            2 SECN0080 PTR(8),                                    1668 04366000
*            2 SENM0080 CHAR(8),                                   1668 04367000
*            2 SEEL0080 PTR(31),                                   1668 04368000
*            2 SECL0080 PTR(31),                                   1668 04369000
*            2 SEMC0080 PTR(31);                                   1668 04370000
*         AHLPPTR=ADDR(SEPL0080);   /* INIT PLIST PTR                */ 04371000
         LA    AHLPPTR,SEPL0080                                    1669 04372000
*         SEPL=SEPL&&SEPL;          /* ZERO OUT PLIST                */ 04373000
         XC    SEPL(24,AHLPPTR),SEPL(AHLPPTR)                      1670 04374000
*         SEMC=ADDR(MCQE);          /* INIT MCQE PTR                 */ 04375000
         ST    PTRMCQE,SEMC(,AHLPPTR)                              1671 04376000
*         SENM='GTF';               /* MOVE IN NAME                  */ 04377000
         MVI   SENM+3(AHLPPTR),C' '                                1672 04378000
         MVC   SENM+4(4,AHLPPTR),SENM+3(AHLPPTR)                   1672 04379000
         MVC   SENM(3,AHLPPTR),@CC05728                            1672 04380000
*         SEFG=32;                  /* MOVE IN FLAGS                 */ 04381000
         MVI   SEFG(AHLPPTR),X'20'                                 1673 04382000
*         SEEL=ADDR(MCREID);        /* SET EID LIST ADDR             */ 04383000
         LA    @05,MCREID(,@05)                                    1674 04384000
         ST    @05,SEEL(,AHLPPTR)                                  1674 04385000
*         SEEN=1;                   /* SET TO DEFAULT                */ 04386000
         MVI   SEEN(AHLPPTR),X'01'                                 1675 04387000
*         CALL AHLSETD;             /* CALL SERVICE                  */ 04388000
         L     @05,CVTPTR                                          1676 04389000
         L     @05,CVTGTFA-1(,@05)                                 1676 04390000
         L     @15,MCHSETD(,@05)                                   1676 04391000
         BALR  @14,@15                                             1676 04392000
*       END;                                                       1677 04393000
*     END;                                                         1678 04394000
*   SDWAPTR=SDWASAV;                /* RESTORE SDWA POINTER          */ 04395000
*                                                                  1679 04396000
@RF01654 L     SDWAPTR,SDWASAV(,AWSAPTR)                           1679 04397000
*   /*****************************************************************/ 04398000
*   /*                                                               */ 04399000
*   /* IF ALL FUNCTIONS ARE DISABLED TERMINATE GTF, OTHERWISE RETURN */ 04400000
*   /* TO MCIH                                                       */ 04401000
*   /*                                                               */ 04402000
*   /*****************************************************************/ 04403000
*                                                                  1680 04404000
*   RFY                                                            1680 04405000
*     R14 RSTD;                                                    1680 04406000
*   IF PCTCATF=0 THEN               /* CHECK TO SEE IF ALL FUNCTIONS    04407000
*                                      DISABLED                      */ 04408000
         L     @15,PCTCATF(,PCTPTR)                                1681 04409000
         LTR   @15,@15                                             1681 04410000
         BNZ   @RF01681                                            1681 04411000
*     DO;                                                          1682 04412000
*       DO;                         /* SETRP RC(SDWACWT)             */ 04413000
*         RESPECIFY                                                1684 04414000
*          (GPR00P,                                                1684 04415000
*           GPR01P,                                                1684 04416000
*           GPR14P,                                                1684 04417000
*           GPR15P) RSTD;                                          1684 04418000
*         GPR01P->SDWARCDE=SDWACWT; /* SAVE RC VALUE                 */ 04419000
         MVI   SDWARCDE(GPR01P),X'00'                              1685 04420000
*         RESPECIFY                                                1686 04421000
*          (GPR00P,                                                1686 04422000
*           GPR01P,                                                1686 04423000
*           GPR14P,                                                1686 04424000
*           GPR15P) UNRSTD;                                        1686 04425000
*       END;                                                       1687 04426000
*       R14=SVR14FRR;               /* REST RET ADDRR TO RTM         */ 04427000
         L     R14,SVR14FRR(,FRRPARM)                              1688 04428000
*     END;                                                         1689 04429000
*   ELSE                            /* STILL SOME FUNCTIONS RUNNING  */ 04430000
*     DO;                                                          1690 04431000
         B     @RC01681                                            1690 04432000
@RF01681 DS    0H                                                  1691 04433000
*       DO;                         /* SETRP                       1691 04434000
*                                      RETADDR(RADDR)RC(SDWARETY)    */ 04435000
*         RESPECIFY                                                1692 04436000
*          (GPR00P,                                                1692 04437000
*           GPR01P,                                                1692 04438000
*           GPR14P,                                                1692 04439000
*           GPR15P) RSTD;                                          1692 04440000
*         GPR01P->SDWARCDE=SDWARETY;/* STORE RC INTO SDWA            */ 04441000
         MVI   SDWARCDE(GPR01P),X'04'                              1693 04442000
*         GPR01P->SDWARTYA=ADDR(RADDR);/* SAVE RETRY ADDRESS         */ 04443000
         L     @05,SVR14NRM(,FRRPARM)                              1694 04444000
         ST    @05,SDWARTYA(,GPR01P)                               1694 04445000
*         RESPECIFY                                                1695 04446000
*          (GPR00P,                                                1695 04447000
*           GPR01P,                                                1695 04448000
*           GPR14P,                                                1695 04449000
*           GPR15P) UNRSTD;                                        1695 04450000
*       END;                                                       1696 04451000
*       RFY                                                        1697 04452000
*         WORK1 RSTD;                                              1697 04453000
*       R14=SVR14FRR;               /* RESTORE RET ADDR TO RETURN TO    04454000
*                                      RTM                           */ 04455000
         L     R14,SVR14FRR(,FRRPARM)                              1698 04456000
*       GEN SETS(FRRPARM,WORK1) NOEXIT SEQFLOW NOFLOWS;            1699 04457000
       SETFRR D,WRKREGS=(FRRPARM,WORK1)                                 04458000
*     END;                                                         1700 04459000
*   GEN SETS(R14) EXIT(BR R14 RETURN TO CALLER);                   1701 04460000
@RC01681 DS    0H                                                  1701 04461000
         BR R14 RETURN TO CALLER                                        04462000
*   RFY                                                            1702 04463000
*    (WORK1,                                                       1702 04464000
*     R14) UNRSTD;                                                 1702 04465000
*   END CATERR;                                                    1703 04466000
@EL00005 DS    0H                                                  1703 04467000
@EF00005 DS    0H                                                  1703 04468000
@ER00005 BR    @14                                                 1703 04469000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 04470000
*     GPR00P PTR(31) REG(0),                                       1704 04471000
*     GPR01P PTR(31) REG(1),                                       1704 04472000
*     GPR14P PTR(31) REG(14),                                      1704 04473000
*     GPR15P PTR(31) REG(15);                                      1704 04474000
*   DECLARE                         /* COMMON VARIABLES              */ 04475000
*     I256C CHAR(256) BASED,                                       1705 04476000
*     I031F FIXED(31) BASED,                                       1705 04477000
*     I031P PTR(31) BASED,                                         1705 04478000
*     I015F FIXED(15) BASED,                                       1705 04479000
*     I015P PTR(15) BASED,                                         1705 04480000
*     I008P PTR(8) BASED,                                          1705 04481000
*     I001C CHAR(1) BASED;                                         1705 04482000
*AHLTSVCN:                                                         1706 04483000
*   END AHLTSVC                                                    1706 04484000
*                                                                  1706 04485000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 04486000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 04487000
*/*%INCLUDE SYSLIB  (GTFPCT  )                                       */ 04488000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 04489000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 04490000
*/*%INCLUDE SYSLIB  (IEZDEB  )                                       */ 04491000
*/*%INCLUDE SYSLIB  (IEZIOB  )                                       */ 04492000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 04493000
*/*%INCLUDE SYSLIB  (IHACDE  )                                       */ 04494000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 04495000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 04496000
*/*%INCLUDE SYSLIB  (IHADECB )                                       */ 04497000
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */ 04498000
*/*%INCLUDE SYSLIB  (IHALCCA )                                       */ 04499000
*/*%INCLUDE SYSLIB  (IHALPDE )                                       */ 04500000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 04501000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 04502000
*/*%INCLUDE SYSLIB  (IHARB   )                                       */ 04503000
*/*%INCLUDE SYSLIB  (IKJRB   )                                       */ 04504000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 04505000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 04506000
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                       */ 04507000
*/*%INCLUDE SYSLIB  (IMDMEDIT)                                       */ 04508000
*/*%INCLUDE SYSLIB  (MCAWSA  )                                       */ 04509000
*/*%INCLUDE SYSLIB  (MCHEAD  )                                       */ 04510000
*/*%INCLUDE SYSLIB  (MCQE    )                                       */ 04511000
*/*%INCLUDE SYSLIB  (MCRWSA  )                                       */ 04512000
*                                                                  1706 04513000
*       ;                                                          1706 04514000
         B     @EL00001                                            1706 04515000
@DATA    DS    0H                                                       04516000
@CH05084 DC    H'46'                                                    04517000
@CH05070 DC    H'54'                                                    04518000
@CH04272 DC    XL2'0004'                                                04519000
@CH05687 DC    XL2'0011'                                                04520000
@CH05690 DC    XL2'0010'                                                04521000
@SM05738 MVC   RECPARM(0,RECPTR),PARMS(PARMPTR)                         04522000
@SM05740 MVC   PLST17(0,AWSAPTR),PLSTA17(PARMPTR)                       04523000
@SM05742 MVC   PARM21(0,AWSAPTR),PRM21LST(PARMPTR)                      04524000
@SM05744 MVC   VOLIST26(0,RECPTR),VOLIST(@15)                           04525000
@SM05746 MVC   VOLIST29(0,RECPTR),VLIST29(@15)                          04526000
@SM05748 MVC   VOLIST30(0,RECPTR),VLIST30(@15)                          04527000
@SM05750 MVC   MIN48(0,AWSAPTR),MINOR2(@15)                             04528000
@SM05752 MVC   MIN48(0,AWSAPTR),MINOR(@15)                              04529000
@SM05754 MVC   PRMLST73(0,AWSAPTR),PARM73(PARMPTR)                      04530000
@SM05756 MVC   DSN98(0,AWSAPTR),DSNME98(@15)                            04531000
@SM05758 MVC   PRMLST99(0,AWSAPTR),PLIST99(PARMPTR)                     04532000
@SM05760 MVC   DSNAME(0,RECPTR),DSETNM(PARMPTR)                         04533000
@SM05764 MVC   ERRFLD(0,RECPTR),0(@05)                                  04534000
@DATD    DSECT                                                          04535000
         DS    0F                                                       04536000
AHLTSVC  CSECT                                                          04537000
         DS    0F                                                       04538000
@CF00063 DC    F'1'                                                     04539000
@CF00075 DC    F'2'                                                     04540000
@CF00294 DC    F'3'                                                     04541000
@CH00294 EQU   @CF00294+2                                               04542000
@CF00055 DC    F'4'                                                     04543000
@CF01868 DC    F'5'                                                     04544000
@CF00919 DC    F'6'                                                     04545000
@CF00730 DC    F'7'                                                     04546000
@CF00061 DC    F'8'                                                     04547000
@CF01778 DC    F'9'                                                     04548000
@CF04642 DC    F'10'                                                    04549000
@CF04861 DC    F'11'                                                    04550000
@CF04459 DC    F'12'                                                    04551000
@CH04459 EQU   @CF04459+2                                               04552000
@CF01806 DC    F'13'                                                    04553000
@CF04344 DC    F'14'                                                    04554000
@CF00929 DC    F'16'                                                    04555000
@CF00992 DC    F'20'                                                    04556000
@CF05067 DC    F'21'                                                    04557000
@CF00072 DC    F'24'                                                    04558000
@CF05071 DC    F'25'                                                    04559000
@CF00990 DC    F'36'                                                    04560000
@CF05079 DC    F'37'                                                    04561000
@CF02274 DC    F'40'                                                    04562000
@CF02955 DC    F'44'                                                    04563000
@CF02778 DC    F'48'                                                    04564000
@CF02196 DC    F'52'                                                    04565000
@CH02196 EQU   @CF02196+2                                               04566000
@CF00985 DC    F'60'                                                    04567000
@CF05736 DC    F'61'                                                    04568000
@CF04624 DC    F'5124'                                                  04569000
@CF04614 DC    XL4'80000000'                                            04570000
@CF04659 DC    XL4'0000FFFF'                                            04571000
@CF04621 DC    XL4'007C'                                                04572000
@DATD    DSECT                                                          04573000
         DS    0D                                                       04574000
@ENDDATD EQU   *                                                        04575000
AHLTSVC  CSECT                                                          04576000
         NOPR  ((@ENDDATD-@DATD)*16)                                    04577000
         DS    0F                                                       04578000
@SIZDATD DC    AL1(0)                                                   04579000
         DC    AL3(@ENDDATD-@DATD)                                      04580000
         DS    0D                                                       04581000
         DS    CL1                                                      04582000
NOPLIN17 DC    XL3'FFFFFF'                                              04583000
@CC04661 DC    C'SVC SVC   TRAC  '                                      04584000
@CC04600 DC    C'N/A     '                                              04585000
@CC04602 DC    C'U/A     '                                              04586000
@CC04627 DC    C'        '                                              04587000
@CC04629 DC    C'**IRB***'                                              04588000
@CC04631 DC    C'********'                                              04589000
@CC04633 DC    C'SVC-T2  '                                              04590000
@CC04637 DC    C'SVC-RES '                                              04591000
@CC04635 EQU   @CC04633                                                 04592000
@CC05728 DC    C'GTF'                                                   04593000
@CB04617 DC    X'8000000000000000'                                      04594000
@CB05563 DC    X'000000'                                                04595000
@CB04604 DC    X'EEEE'                                                  04596000
@CB04639 DC    X'C100'                                                  04597000
         DS    CL2                                                      04598000
DMPLIST  DS    CL12                                                     04599000
         ORG   DMPLIST                                                  04600000
HDRAD    DC    AL4(SDMPHDR)                                             04601000
DUMPADDS DS    CL8                                                      04602000
         ORG   DUMPADDS                                                 04603000
BEGADDR  DC    AL4(AHLTSVC)                                             04604000
ENDADDR  DS    AL4                                                      04605000
         ORG   ENDADDR                                                  04606000
DLSTEOL  DC    XL1'80'                                                  04607000
LSTADR   DC    AL3(AHLTSVCN)                                            04608000
         ORG   DMPLIST+12                                               04609000
SDMPHDR  DS    CL27                                                     04610000
         ORG   SDMPHDR                                                  04611000
HDRLGH   DC    AL1(26)                                                  04612000
HDR      DC    CL26'DUMP OF GTF MODULE AHLTSVC'                         04613000
         ORG   SDMPHDR+27                                               04614000
RECID    DC    CL24'AHLTSVC AHLTSVC AHLTSVCE'                           04615000
         DS    CL1                                                      04616000
RECOVTAB DS    CL240                                                    04617000
         ORG   RECOVTAB                                                 04618000
RCOVJOBN DS    CL4                                                      04619000
         ORG   RCOVJOBN                                                 04620000
@NM00194 DC    AL1(4)                                                   04621000
@NM00195 DC    AL1(8)                                                   04622000
@NM00196 DC    AL1(6)                                                   04623000
@NM00197 DC    AL1(2)                                                   04624000
         ORG   RECOVTAB+4                                               04625000
RCOVMODN DS    CL4                                                      04626000
         ORG   RCOVMODN                                                 04627000
@NM00198 DC    AL1(4)                                                   04628000
@NM00199 DC    AL1(8)                                                   04629000
@NM00200 DC    AL1(26)                                                  04630000
@NM00201 DC    AL1(3)                                                   04631000
         ORG   RECOVTAB+8                                               04632000
RCOVNAME DS    CL4                                                      04633000
         ORG   RCOVNAME                                                 04634000
@NM00202 DC    AL1(0)                                                   04635000
@NM00203 DC    AL1(8)                                                   04636000
@NM00204 DC    AL1(46)                                                  04637000
@NM00205 DC    AL1(1)                                                   04638000
         ORG   RECOVTAB+12                                              04639000
RCOVPLST DS    CL4                                                      04640000
         ORG   RCOVPLST                                                 04641000
@NM00206 DC    AL1(16)                                                  04642000
@NM00207 DC    AL1(4)                                                   04643000
@NM00208 DC    AL1(46)                                                  04644000
@NM00209 DC    AL1(1)                                                   04645000
         ORG   RECOVTAB+16                                              04646000
RCOVWORD DS    CL4                                                      04647000
         ORG   RCOVWORD                                                 04648000
@NM00210 DC    AL1(0)                                                   04649000
@NM00211 DC    AL1(4)                                                   04650000
@NM00212 DC    AL1(46)                                                  04651000
@NM00213 DC    AL1(1)                                                   04652000
         ORG   RECOVTAB+20                                              04653000
RCOV0A   DS    CL4                                                      04654000
         ORG   RCOV0A                                                   04655000
@NM00214 DC    AL1(0)                                                   04656000
@NM00215 DC    AL1(16)                                                  04657000
@NM00216 DC    AL1(46)                                                  04658000
@NM00217 DC    AL1(1)                                                   04659000
         ORG   RECOVTAB+24                                              04660000
RCOV0B   DS    CL4                                                      04661000
         ORG   RCOV0B                                                   04662000
@NM00218 DC    AL1(64)                                                  04663000
@NM00219 DC    AL1(4)                                                   04664000
@NM00220 DC    AL1(46+8+4)                                              04665000
@NM00221 DC    AL1(0)                                                   04666000
         ORG   RECOVTAB+28                                              04667000
RCOV6A   DS    CL4                                                      04668000
         ORG   RCOV6A                                                   04669000
@NM00222 DC    AL1(0)                                                   04670000
@NM00223 DC    AL1(20)                                                  04671000
@NM00224 DC    AL1(46)                                                  04672000
@NM00225 DC    AL1(1)                                                   04673000
         ORG   RECOVTAB+32                                              04674000
RCOV6B   DS    CL4                                                      04675000
         ORG   RCOV6B                                                   04676000
@NM00226 DC    AL1(0)                                                   04677000
@NM00227 DC    AL1(8)                                                   04678000
@NM00228 DC    AL1(46)                                                  04679000
@NM00229 DC    AL1(1)                                                   04680000
         ORG   RECOVTAB+36                                              04681000
RCOV7A   DS    CL4                                                      04682000
         ORG   RCOV7A                                                   04683000
@NM00230 DC    AL1(0)                                                   04684000
@NM00231 DC    AL1(16)                                                  04685000
@NM00232 DC    AL1(46)                                                  04686000
@NM00233 DC    AL1(1)                                                   04687000
         ORG   RECOVTAB+40                                              04688000
RCOV7B   DS    CL4                                                      04689000
         ORG   RCOV7B                                                   04690000
@NM00234 DC    AL1(0)                                                   04691000
@NM00235 DC    AL1(8)                                                   04692000
@NM00236 DC    AL1(46)                                                  04693000
@NM00237 DC    AL1(1)                                                   04694000
         ORG   RECOVTAB+44                                              04695000
RCOV14A  DS    CL4                                                      04696000
         ORG   RCOV14A                                                  04697000
@NM00238 DC    AL1(0)                                                   04698000
@NM00239 DC    AL1(6)                                                   04699000
@NM00240 DC    AL1(46)                                                  04700000
@NM00241 DC    AL1(1)                                                   04701000
         ORG   RECOVTAB+48                                              04702000
RCOV15A  DS    CL4                                                      04703000
         ORG   RCOV15A                                                  04704000
@NM00242 DC    AL1(0)                                                   04705000
@NM00243 DC    AL1(15)                                                  04706000
@NM00244 DC    AL1(46)                                                  04707000
@NM00245 DC    AL1(1)                                                   04708000
         ORG   RECOVTAB+52                                              04709000
RCOV15B  DS    CL4                                                      04710000
         ORG   RCOV15B                                                  04711000
@NM00246 DC    AL1(0)                                                   04712000
@NM00247 DC    AL1(2)                                                   04713000
@NM00248 DC    AL1(46+4+8+1)                                            04714000
@NM00249 DC    AL1(4)                                                   04715000
         ORG   RECOVTAB+56                                              04716000
RCOV15C  DS    CL4                                                      04717000
         ORG   RCOV15C                                                  04718000
@NM00250 DC    AL1(0)                                                   04719000
@NM00251 DC    AL1(4)                                                   04720000
@NM00252 DC    AL1(46+8+1)                                              04721000
@NM00253 DC    AL1(5)                                                   04722000
         ORG   RECOVTAB+60                                              04723000
RCOV16A  DS    CL4                                                      04724000
         ORG   RCOV16A                                                  04725000
@NM00254 DC    AL1(0)                                                   04726000
@NM00255 DC    AL1(24)                                                  04727000
@NM00256 DC    AL1(46)                                                  04728000
@NM00257 DC    AL1(1)                                                   04729000
         ORG   RECOVTAB+64                                              04730000
RCOV16B  DS    CL4                                                      04731000
         ORG   RCOV16B                                                  04732000
@NM00258 DC    AL1(64)                                                  04733000
@NM00259 DC    AL1(4)                                                   04734000
@NM00260 DC    AL1(46+8)                                                04735000
@NM00261 DC    AL1(0)                                                   04736000
         ORG   RECOVTAB+68                                              04737000
RCOV21A  DS    CL4                                                      04738000
         ORG   RCOV21A                                                  04739000
@NM00262 DC    AL1(80)                                                  04740000
@NM00263 DC    AL1(4)                                                   04741000
@NM00264 DC    AL1(46+8)                                                04742000
@NM00265 DC    AL1(0)                                                   04743000
         ORG   RECOVTAB+72                                              04744000
RCOV25A  DS    CL4                                                      04745000
         ORG   RCOV25A                                                  04746000
@NM00266 DC    AL1(0)                                                   04747000
@NM00267 DC    AL1(18)                                                  04748000
@NM00268 DC    AL1(46)                                                  04749000
@NM00269 DC    AL1(1)                                                   04750000
         ORG   RECOVTAB+76                                              04751000
RCOV26A  DS    CL4                                                      04752000
         ORG   RCOV26A                                                  04753000
@NM00270 DC    AL1(144)                                                 04754000
@NM00271 DC    AL1(4)                                                   04755000
@NM00272 DC    AL1(46)                                                  04756000
@NM00273 DC    AL1(0)                                                   04757000
         ORG   RECOVTAB+80                                              04758000
@NM00274 DS    CL4                                                      04759000
         ORG   @NM00274                                                 04760000
@NM00275 DC    AL1(176)                                                 04761000
@NM00276 DC    AL1(4)                                                   04762000
@NM00277 DC    AL1(46)                                                  04763000
@NM00278 DC    AL1(0)                                                   04764000
         ORG   RECOVTAB+84                                              04765000
RCOV26D  DS    CL4                                                      04766000
         ORG   RCOV26D                                                  04767000
@NM00279 DC    AL1(56)                                                  04768000
@NM00280 DC    AL1(4)                                                   04769000
@NM00281 DC    AL1(46)                                                  04770000
@NM00282 DC    AL1(1)                                                   04771000
         ORG   RECOVTAB+88                                              04772000
RCOV26B  DS    CL4                                                      04773000
         ORG   RCOV26B                                                  04774000
@NM00283 DC    AL1(48)                                                  04775000
@NM00284 DC    AL1(4)                                                   04776000
@NM00285 DC    AL1(46)                                                  04777000
@NM00286 DC    AL1(10)                                                  04778000
         ORG   RECOVTAB+92                                              04779000
RCOV26C  DS    CL4                                                      04780000
         ORG   RCOV26C                                                  04781000
@NM00287 DC    AL1(48)                                                  04782000
@NM00288 DC    AL1(4)                                                   04783000
@NM00289 DC    AL1(46)                                                  04784000
@NM00290 DC    AL1(11)                                                  04785000
         ORG   RECOVTAB+96                                              04786000
RCOV27A  DS    CL4                                                      04787000
         ORG   RCOV27A                                                  04788000
@NM00291 DC    AL1(128)                                                 04789000
@NM00292 DC    AL1(22)                                                  04790000
@NM00293 DC    AL1(46)                                                  04791000
@NM00294 DC    AL1(0)                                                   04792000
         ORG   RECOVTAB+100                                             04793000
RCOV27C  DS    CL4                                                      04794000
         ORG   RCOV27C                                                  04795000
@NM00295 DC    AL1(16)                                                  04796000
@NM00296 DC    AL1(4)                                                   04797000
@NM00297 DC    AL1(46+22)                                               04798000
@NM00298 DC    AL1(1)                                                   04799000
         ORG   RECOVTAB+104                                             04800000
RCOV27B  DS    CL4                                                      04801000
         ORG   RCOV27B                                                  04802000
@NM00299 DC    AL1(0)                                                   04803000
@NM00300 DC    AL1(6)                                                   04804000
@NM00301 DC    AL1(46+16)                                               04805000
@NM00302 DC    AL1(6)                                                   04806000
         ORG   RECOVTAB+108                                             04807000
RCOV29A  DS    CL4                                                      04808000
         ORG   RCOV29A                                                  04809000
@NM00303 DC    AL1(128)                                                 04810000
@NM00304 DC    AL1(16)                                                  04811000
@NM00305 DC    AL1(46)                                                  04812000
@NM00306 DC    AL1(0)                                                   04813000
         ORG   RECOVTAB+112                                             04814000
@NM00307 DS    CL4                                                      04815000
         ORG   @NM00307                                                 04816000
@NM00308 DC    AL1(144)                                                 04817000
@NM00309 DC    AL1(4)                                                   04818000
@NM00310 DC    AL1(46+16)                                               04819000
@NM00311 DC    AL1(0)                                                   04820000
         ORG   RECOVTAB+116                                             04821000
RCOV29C  DS    CL4                                                      04822000
         ORG   RCOV29C                                                  04823000
@NM00312 DC    AL1(48)                                                  04824000
@NM00313 DC    AL1(4)                                                   04825000
@NM00314 DC    AL1(46+16)                                               04826000
@NM00315 DC    AL1(1)                                                   04827000
         ORG   RECOVTAB+120                                             04828000
RCOV29B  DS    CL4                                                      04829000
         ORG   RCOV29B                                                  04830000
@NM00316 DC    AL1(16)                                                  04831000
@NM00317 DC    AL1(4)                                                   04832000
@NM00318 DC    AL1(46+16)                                               04833000
@NM00319 DC    AL1(12)                                                  04834000
         ORG   RECOVTAB+124                                             04835000
RCOV30A  DS    CL4                                                      04836000
         ORG   RCOV30A                                                  04837000
@NM00320 DC    AL1(128)                                                 04838000
@NM00321 DC    AL1(16)                                                  04839000
@NM00322 DC    AL1(46)                                                  04840000
@NM00323 DC    AL1(0)                                                   04841000
         ORG   RECOVTAB+128                                             04842000
@NM00324 DS    CL4                                                      04843000
         ORG   @NM00324                                                 04844000
@NM00325 DC    AL1(144)                                                 04845000
@NM00326 DC    AL1(4)                                                   04846000
@NM00327 DC    AL1(46+16)                                               04847000
@NM00328 DC    AL1(0)                                                   04848000
         ORG   RECOVTAB+132                                             04849000
@NM00329 DS    CL4                                                      04850000
         ORG   @NM00329                                                 04851000
@NM00330 DC    AL1(144)                                                 04852000
@NM00331 DC    AL1(4)                                                   04853000
@NM00332 DC    AL1(46+16+5)                                             04854000
@NM00333 DC    AL1(0)                                                   04855000
         ORG   RECOVTAB+136                                             04856000
RCOV30D  DS    CL4                                                      04857000
         ORG   RCOV30D                                                  04858000
@NM00334 DC    AL1(56)                                                  04859000
@NM00335 DC    AL1(4)                                                   04860000
@NM00336 DC    AL1(46+16)                                               04861000
@NM00337 DC    AL1(1)                                                   04862000
         ORG   RECOVTAB+140                                             04863000
RCOV30B  DS    CL4                                                      04864000
         ORG   RCOV30B                                                  04865000
@NM00338 DC    AL1(16)                                                  04866000
@NM00339 DC    AL1(4)                                                   04867000
@NM00340 DC    AL1(46+16)                                               04868000
@NM00341 DC    AL1(13)                                                  04869000
         ORG   RECOVTAB+144                                             04870000
RCOV30C  DS    CL4                                                      04871000
         ORG   RCOV30C                                                  04872000
@NM00342 DC    AL1(48)                                                  04873000
@NM00343 DC    AL1(4)                                                   04874000
@NM00344 DC    AL1(46+16)                                               04875000
@NM00345 DC    AL1(14)                                                  04876000
         ORG   RECOVTAB+148                                             04877000
RCOV32A  DS    CL4                                                      04878000
         ORG   RCOV32A                                                  04879000
@NM00346 DC    AL1(0)                                                   04880000
@NM00347 DC    AL1(2)                                                   04881000
@NM00348 DC    AL1(46)                                                  04882000
@NM00349 DC    AL1(7)                                                   04883000
         ORG   RECOVTAB+152                                             04884000
RCOV32B  DS    CL4                                                      04885000
         ORG   RCOV32B                                                  04886000
@NM00350 DC    AL1(16)                                                  04887000
@NM00351 DC    AL1(4)                                                   04888000
@NM00352 DC    AL1(46+2)                                                04889000
@NM00353 DC    AL1(1)                                                   04890000
         ORG   RECOVTAB+156                                             04891000
RCOV33A  DS    CL4                                                      04892000
         ORG   RCOV33A                                                  04893000
@NM00354 DC    AL1(0)                                                   04894000
@NM00355 DC    AL1(2)                                                   04895000
@NM00356 DC    AL1(46)                                                  04896000
@NM00357 DC    AL1(1)                                                   04897000
         ORG   RECOVTAB+160                                             04898000
RCOV42A  DS    CL4                                                      04899000
         ORG   RCOV42A                                                  04900000
@NM00358 DC    AL1(16)                                                  04901000
@NM00359 DC    AL1(4)                                                   04902000
@NM00360 DC    AL1(46)                                                  04903000
@NM00361 DC    AL1(8)                                                   04904000
         ORG   RECOVTAB+164                                             04905000
RCOV42B  DS    CL4                                                      04906000
         ORG   RCOV42B                                                  04907000
@NM00362 DC    AL1(48)                                                  04908000
@NM00363 DC    AL1(4)                                                   04909000
@NM00364 DC    AL1(46)                                                  04910000
@NM00365 DC    AL1(1)                                                   04911000
         ORG   RECOVTAB+168                                             04912000
RCOV48A  DS    CL4                                                      04913000
         ORG   RCOV48A                                                  04914000
@NM00366 DC    AL1(128)                                                 04915000
@NM00367 DC    AL1(28)                                                  04916000
@NM00368 DC    AL1(46)                                                  04917000
@NM00369 DC    AL1(0)                                                   04918000
         ORG   RECOVTAB+172                                             04919000
RCOV48C  DS    CL4                                                      04920000
         ORG   RCOV48C                                                  04921000
@NM00370 DC    AL1(16)                                                  04922000
@NM00371 DC    AL1(4)                                                   04923000
@NM00372 DC    AL1(46+28)                                               04924000
@NM00373 DC    AL1(1)                                                   04925000
         ORG   RECOVTAB+176                                             04926000
RCOV48B  DS    CL4                                                      04927000
         ORG   RCOV48B                                                  04928000
@NM00374 DC    AL1(0)                                                   04929000
@NM00375 DC    AL1(8)                                                   04930000
@NM00376 DC    AL1(46+20)                                               04931000
@NM00377 DC    AL1(9)                                                   04932000
         ORG   RECOVTAB+180                                             04933000
RCOV52A  DS    CL4                                                      04934000
         ORG   RCOV52A                                                  04935000
@NM00378 DC    AL1(0)                                                   04936000
@NM00379 DC    AL1(52)                                                  04937000
@NM00380 DC    AL1(46)                                                  04938000
@NM00381 DC    AL1(1)                                                   04939000
         ORG   RECOVTAB+184                                             04940000
RCOV66A  DS    CL4                                                      04941000
         ORG   RCOV66A                                                  04942000
@NM00382 DC    AL1(0)                                                   04943000
@NM00383 DC    AL1(16)                                                  04944000
@NM00384 DC    AL1(46)                                                  04945000
@NM00385 DC    AL1(1)                                                   04946000
         ORG   RECOVTAB+188                                             04947000
RCOV71A  DS    CL4                                                      04948000
         ORG   RCOV71A                                                  04949000
@NM00386 DC    AL1(64)                                                  04950000
@NM00387 DC    AL1(16)                                                  04951000
@NM00388 DC    AL1(46+8)                                                04952000
@NM00389 DC    AL1(1)                                                   04953000
         ORG   RECOVTAB+192                                             04954000
RCOV81A  DS    CL4                                                      04955000
         ORG   RCOV81A                                                  04956000
@NM00390 DC    AL1(64)                                                  04957000
@NM00391 DC    AL1(16)                                                  04958000
@NM00392 DC    AL1(46+8)                                                04959000
@NM00393 DC    AL1(1)                                                   04960000
         ORG   RECOVTAB+196                                             04961000
RCOV82A  DS    CL4                                                      04962000
         ORG   RCOV82A                                                  04963000
@NM00394 DC    AL1(144)                                                 04964000
@NM00395 DC    AL1(4)                                                   04965000
@NM00396 DC    AL1(46+6)                                                04966000
@NM00397 DC    AL1(0)                                                   04967000
         ORG   RECOVTAB+200                                             04968000
@NM00398 DS    CL4                                                      04969000
         ORG   @NM00398                                                 04970000
@NM00399 DC    AL1(144)                                                 04971000
@NM00400 DC    AL1(4)                                                   04972000
@NM00401 DC    AL1(46+6+5)                                              04973000
@NM00402 DC    AL1(0)                                                   04974000
         ORG   RECOVTAB+204                                             04975000
RCOV82B  DS    CL4                                                      04976000
         ORG   RCOV82B                                                  04977000
@NM00403 DC    AL1(0)                                                   04978000
@NM00404 DC    AL1(6)                                                   04979000
@NM00405 DC    AL1(46)                                                  04980000
@NM00406 DC    AL1(1)                                                   04981000
         ORG   RECOVTAB+208                                             04982000
RCOV82C  DS    CL4                                                      04983000
         ORG   RCOV82C                                                  04984000
@NM00407 DC    AL1(48)                                                  04985000
@NM00408 DC    AL1(4)                                                   04986000
@NM00409 DC    AL1(46+6)                                                04987000
@NM00410 DC    AL1(15)                                                  04988000
         ORG   RECOVTAB+212                                             04989000
RCOV86A  DS    CL4                                                      04990000
         ORG   RCOV86A                                                  04991000
@NM00411 DC    AL1(0)                                                   04992000
@NM00412 DC    AL1(13)                                                  04993000
@NM00413 DC    AL1(46)                                                  04994000
@NM00414 DC    AL1(1)                                                   04995000
         ORG   RECOVTAB+216                                             04996000
RCOV86B  DS    CL4                                                      04997000
         ORG   RCOV86B                                                  04998000
@NM00415 DC    AL1(0)                                                   04999000
@NM00416 DC    AL1(5)                                                   05000000
@NM00417 DC    AL1(46+8)                                                05001000
@NM00418 DC    AL1(1)                                                   05002000
         ORG   RECOVTAB+220                                             05003000
RCOV88A  DS    CL4                                                      05004000
         ORG   RCOV88A                                                  05005000
@NM00419 DC    AL1(0)                                                   05006000
@NM00420 DC    AL1(6)                                                   05007000
@NM00421 DC    AL1(46)                                                  05008000
@NM00422 DC    AL1(1)                                                   05009000
         ORG   RECOVTAB+224                                             05010000
RCOV88B  DS    CL4                                                      05011000
         ORG   RCOV88B                                                  05012000
@NM00423 DC    AL1(0)                                                   05013000
@NM00424 DC    AL1(2)                                                   05014000
@NM00425 DC    AL1(46+4)                                                05015000
@NM00426 DC    AL1(1)                                                   05016000
         ORG   RECOVTAB+228                                             05017000
RCOV98A  DS    CL4                                                      05018000
         ORG   RCOV98A                                                  05019000
@NM00427 DC    AL1(128)                                                 05020000
@NM00428 DC    AL1(4)                                                   05021000
@NM00429 DC    AL1(46)                                                  05022000
@NM00430 DC    AL1(0)                                                   05023000
         ORG   RECOVTAB+232                                             05024000
RCOV98B  DS    CL4                                                      05025000
         ORG   RCOV98B                                                  05026000
@NM00431 DC    AL1(16)                                                  05027000
@NM00432 DC    AL1(4)                                                   05028000
@NM00433 DC    AL1(46+4)                                                05029000
@NM00434 DC    AL1(1)                                                   05030000
         ORG   RECOVTAB+236                                             05031000
RCOVLAST DS    FL4                                                      05032000
         ORG   RECOVTAB+240                                             05033000
CONVTAB  DC    CL16'0123456789ABCDEF'                                   05034000
ERR82    DS    CL16                                                     05035000
         ORG   ERR82                                                    05036000
ERR82VS  DC    CL6'******'                                              05037000
ERR82CC  DS    CL5                                                      05038000
         ORG   ERR82CC                                                  05039000
CCLEN82E DC    XL1'FF'                                                  05040000
CC82ERR  DC    CL4'****'                                                05041000
         ORG   ERR82+11                                                 05042000
ERR82PL  DS    CL5                                                      05043000
         ORG   ERR82PL                                                  05044000
PLLEN82E DC    XL1'FF'                                                  05045000
PL82ERR  DC    CL4'****'                                                05046000
         ORG   ERR82+16                                                 05047000
SEPL0080 DS    CL24                                                     05048000
         ORG   SEPL0080                                                 05049000
SEFG0080 DS    AL1                                                      05050000
@NM00477 DS    AL1                                                      05051000
SEEN0080 DS    AL1                                                      05052000
SECN0080 DS    AL1                                                      05053000
SENM0080 DS    CL8                                                      05054000
SEEL0080 DS    AL4                                                      05055000
SECL0080 DS    AL4                                                      05056000
SEMC0080 DS    AL4                                                      05057000
         ORG   SEPL0080+24                                              05058000
RBTABE   DC    AL4(RBCDENM)                                             05059000
         DC    3AL4(RBERR)                                              05060000
         DC    AL4(RBIRB)                                               05061000
         DC    3AL4(RBERR)                                              05062000
         DC    AL4(RBEXT)                                               05063000
         DC    3AL4(RBERR)                                              05064000
         DC    AL4(RBSVCT2)                                             05065000
         DC    AL4(RBSVCR)                                              05066000
         DC    2AL4(RBERR)                                              05067000
ERRTAB   DC    CL52'***************************************************C05068000
               *'                                                       05069000
         DC    CL52'PPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPPC05070000
               P'                                                       05071000
         DC    CL52'SSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSC05072000
               S'                                                       05073000
AHLSVCPT DC    400X'00'                                                 05074000
RETADTAB DC    AL4(AHLSVSTK)                                            05075000
         DC    AL4(AHLSCDE)                                             05076000
         DC    AL4(AHLSADDL)                                            05077000
         DC    AL4(AHLS15C)                                             05078000
         DC    AL4(AHLS15D)                                             05079000
         DC    AL4(AHLS27A)                                             05080000
         DC    AL4(AHLS32A)                                             05081000
         DC    AL4(AHLS42A)                                             05082000
         DC    AL4(AHLS48B)                                             05083000
         DC    AL4(AHLS26C)                                             05084000
         DC    AL4(AHLS26E)                                             05085000
         DC    AL4(AHLS29B)                                             05086000
         DC    AL4(AHLS30B)                                             05087000
         DC    AL4(AHLS30C)                                             05088000
         DC    AL4(AHLS825)                                             05089000
SVCNUTAB DC    AL1(2)                                                   05090000
         DC    AL1(3)                                                   05091000
         DC    AL1(4)                                                   05092000
         DC    AL1(1)                                                   05093000
         DC    AL1(5)                                                   05094000
         DC    AL1(5)                                                   05095000
         DC    AL1(6)                                                   05096000
         DC    AL1(7)                                                   05097000
         DC    AL1(8)                                                   05098000
         DC    AL1(9)                                                   05099000
         DC    AL1(1)                                                   05100000
         DC    AL1(1)                                                   05101000
         DC    AL1(1)                                                   05102000
         DC    AL1(10)                                                  05103000
         DC    AL1(11)                                                  05104000
         DC    AL1(12)                                                  05105000
         DC    AL1(13)                                                  05106000
         DC    AL1(14)                                                  05107000
         DC    AL1(15)                                                  05108000
         DC    AL1(16)                                                  05109000
         DC    AL1(16)                                                  05110000
         DC    AL1(17)                                                  05111000
         DC    AL1(16)                                                  05112000
         DC    AL1(16)                                                  05113000
         DC    AL1(18)                                                  05114000
         DC    AL1(19)                                                  05115000
         DC    AL1(20)                                                  05116000
         DC    AL1(21)                                                  05117000
         DC    AL1(22)                                                  05118000
         DC    AL1(23)                                                  05119000
         DC    AL1(54)                                                  05120000
         DC    AL1(24)                                                  05121000
         DC    AL1(25)                                                  05122000
         DC    AL1(26)                                                  05123000
         DC    AL1(1)                                                   05124000
         DC    AL1(27)                                                  05125000
         DC    AL1(1)                                                   05126000
         DC    AL1(28)                                                  05127000
         DC    AL1(1)                                                   05128000
         DC    AL1(50)                                                  05129000
         DC    AL1(28)                                                  05130000
         DC    AL1(8)                                                   05131000
         DC    AL1(30)                                                  05132000
         DC    AL1(1)                                                   05133000
         DC    AL1(31)                                                  05134000
         DC    AL1(32)                                                  05135000
         DC    AL1(1)                                                   05136000
         DC    AL1(33)                                                  05137000
         DC    AL1(29)                                                  05138000
         DC    AL1(1)                                                   05139000
         DC    AL1(1)                                                   05140000
         DC    AL1(34)                                                  05141000
         DC    AL1(53)                                                  05142000
         DC    AL1(24)                                                  05143000
         DC    AL1(35)                                                  05144000
         DC    AL1(24)                                                  05145000
         DC    AL1(29)                                                  05146000
         DC    AL1(24)                                                  05147000
         DC    AL1(24)                                                  05148000
         DC    AL1(1)                                                   05149000
         DC    AL1(55)                                                  05150000
         DC    AL1(1)                                                   05151000
         DC    AL1(31)                                                  05152000
         DC    AL1(36)                                                  05153000
         DC    AL1(16)                                                  05154000
         DC    AL1(1)                                                   05155000
         DC    AL1(37)                                                  05156000
         DC    AL1(1)                                                   05157000
         DC    AL1(22)                                                  05158000
         DC    AL1(24)                                                  05159000
         DC    AL1(38)                                                  05160000
         DC    AL1(39)                                                  05161000
         DC    AL1(1)                                                   05162000
         DC    AL1(40)                                                  05163000
         DC    AL1(40)                                                  05164000
         DC    AL1(41)                                                  05165000
         DC    AL1(1)                                                   05166000
         DC    AL1(42)                                                  05167000
         DC    AL1(43)                                                  05168000
         DC    AL1(1)                                                   05169000
         DC    AL1(44)                                                  05170000
         DC    AL1(45)                                                  05171000
         DC    AL1(46)                                                  05172000
         DC    AL1(1)                                                   05173000
         DC    AL1(1)                                                   05174000
         DC    AL1(1)                                                   05175000
         DC    AL1(47)                                                  05176000
         DC    AL1(48)                                                  05177000
         DC    AL1(49)                                                  05178000
         DC    AL1(1)                                                   05179000
         DC    AL1(1)                                                   05180000
         DC    AL1(1)                                                   05181000
         DC    AL1(2)                                                   05182000
         DC    AL1(1)                                                   05183000
         DC    AL1(1)                                                   05184000
         DC    AL1(1)                                                   05185000
         DC    AL1(50)                                                  05186000
         DC    AL1(1)                                                   05187000
         DC    AL1(51)                                                  05188000
         DC    AL1(52)                                                  05189000
         DC    AL1(1)                                                   05190000
         DC    AL1(1)                                                   05191000
         DC    AL1(16)                                                  05192000
         DC    AL1(1)                                                   05193000
         DC    AL1(1)                                                   05194000
         DC    AL1(1)                                                   05195000
         DC    AL1(1)                                                   05196000
         DC    AL1(1)                                                   05197000
         DC    AL1(1)                                                   05198000
         DC    AL1(1)                                                   05199000
         DC    AL1(1)                                                   05200000
         DC    AL1(1)                                                   05201000
         DC    AL1(1)                                                   05202000
         DC    AL1(1)                                                   05203000
         DC    AL1(2)                                                   05204000
         DC    AL1(1)                                                   05205000
         DC    AL1(1)                                                   05206000
         DC    AL1(1)                                                   05207000
         DC    AL1(1)                                                   05208000
         DC    AL1(1)                                                   05209000
         DC    AL1(1)                                                   05210000
         DC    AL1(1)                                                   05211000
         DC    AL1(1)                                                   05212000
         DC    AL1(1)                                                   05213000
         DC    AL1(1)                                                   05214000
         DS    CL3                                                      05215000
SVCROUTN DC    AL4(AHLSVSTK)                                            05216000
         DC    AL4(AHLS0)                                               05217000
         DC    AL4(AHLS1)                                               05218000
         DC    AL4(AHLS2)                                               05219000
         DC    AL4(AHLS4)                                               05220000
         DC    AL4(AHLS6)                                               05221000
         DC    AL4(AHLS7)                                               05222000
         DC    AL4(AHLS8)                                               05223000
         DC    AL4(AHLS9)                                               05224000
         DC    AL4(AHLS13)                                              05225000
         DC    AL4(AHLS14)                                              05226000
         DC    AL4(AHLS15)                                              05227000
         DC    AL4(AHLS16)                                              05228000
         DC    AL4(AHLS17)                                              05229000
         DC    AL4(AHLS18)                                              05230000
         DC    AL4(AHLS19)                                              05231000
         DC    AL4(AHLS21)                                              05232000
         DC    AL4(AHLS24)                                              05233000
         DC    AL4(AHLS25)                                              05234000
         DC    AL4(AHLS26)                                              05235000
         DC    AL4(AHLS27)                                              05236000
         DC    AL4(AHLS28)                                              05237000
         DC    AL4(AHLS29)                                              05238000
         DC    AL4(AHLS31)                                              05239000
         DC    AL4(AHLS32)                                              05240000
         DC    AL4(AHLS33)                                              05241000
         DC    AL4(AHLS35)                                              05242000
         DC    AL4(AHLS37)                                              05243000
         DC    AL4(AHLS48)                                              05244000
         DC    AL4(AHLS42)                                              05245000
         DC    AL4(AHLS44)                                              05246000
         DC    AL4(AHLS45)                                              05247000
         DC    AL4(AHLS47)                                              05248000
         DC    AL4(AHLS51)                                              05249000
         DC    AL4(AHLS54)                                              05250000
         DC    AL4(AHLS63)                                              05251000
         DC    AL4(AHLS66)                                              05252000
         DC    AL4(AHLS70)                                              05253000
         DC    AL4(AHLS71)                                              05254000
         DC    AL4(AHLS73)                                              05255000
         DC    AL4(AHLS75)                                              05256000
         DC    AL4(AHLS77)                                              05257000
         DC    AL4(AHLS78)                                              05258000
         DC    AL4(AHLS80)                                              05259000
         DC    AL4(AHLS81)                                              05260000
         DC    AL4(AHLS82)                                              05261000
         DC    AL4(AHLS86)                                              05262000
         DC    AL4(AHLS87)                                              05263000
         DC    AL4(AHLS88)                                              05264000
         DC    AL4(AHLS96)                                              05265000
         DC    AL4(AHLS98)                                              05266000
         DC    AL4(AHLS99)                                              05267000
         DC    AL4(AHLS52)                                              05268000
         DC    AL4(AHLS30)                                              05269000
         DC    AL4(AHLS60)                                              05270000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       05271000
@01      EQU   01                                                       05272000
@02      EQU   02                                                       05273000
@03      EQU   03                                                       05274000
@04      EQU   04                                                       05275000
@05      EQU   05                                                       05276000
@06      EQU   06                                                       05277000
@07      EQU   07                                                       05278000
@08      EQU   08                                                       05279000
@09      EQU   09                                                       05280000
@10      EQU   10                                                       05281000
@11      EQU   11                                                       05282000
@12      EQU   12                                                       05283000
@13      EQU   13                                                       05284000
@14      EQU   14                                                       05285000
@15      EQU   15                                                       05286000
BASEREG1 EQU   @11                                                      05287000
BASEREG2 EQU   @12                                                      05288000
BASEREG3 EQU   @04                                                      05289000
PCTPTR   EQU   @02                                                      05290000
IOSBPTR  EQU   @01                                                      05291000
UCBPTR   EQU   @06                                                      05292000
DEBPTR   EQU   @07                                                      05293000
DEBDAPTR EQU   @07                                                      05294000
IOBSTPTR EQU   @06                                                      05295000
ASCBPTR  EQU   @07                                                      05296000
DCBPTR   EQU   @06                                                      05297000
LCCAPTR  EQU   @08                                                      05298000
SDWAPTR  EQU   @01                                                      05299000
RBSECPTR EQU   @07                                                      05300000
SRBPTR   EQU   @08                                                      05301000
AWSAPTR  EQU   @03                                                      05302000
SPLPTR   EQU   @00                                                      05303000
PTRMCQE  EQU   @00                                                      05304000
RETSAVE  EQU   @00                                                      05305000
PARMPTR  EQU   @01                                                      05306000
PARMTST  EQU   @01                                                      05307000
COUNT    EQU   @06                                                      05308000
MOVE3    EQU   @06                                                      05309000
INDEX    EQU   @06                                                      05310000
RETAD    EQU   @06                                                      05311000
RECPTR   EQU   @07                                                      05312000
DDPTR    EQU   @07                                                      05313000
WORK2    EQU   @07                                                      05314000
WORK1    EQU   @08                                                      05315000
TEMPLEN  EQU   @08                                                      05316000
LISTPTR  EQU   @08                                                      05317000
ERRINDX  EQU   @08                                                      05318000
RECLGTH  EQU   @09                                                      05319000
MOVE4    EQU   @09                                                      05320000
ERRTRNAD EQU   @10                                                      05321000
MOVE2    EQU   @10                                                      05322000
FRRPARM  EQU   @13                                                      05323000
R14      EQU   @14                                                      05324000
RETURNAD EQU   @14                                                      05325000
R15RC    EQU   @15                                                      05326000
R15ENTRY EQU   @15                                                      05327000
AHLRECPR EQU   @01                                                      05328000
AHLSBREG EQU   @14                                                      05329000
AHLRETCD EQU   @15                                                      05330000
GPR00P   EQU   @00                                                      05331000
GPR01P   EQU   @01                                                      05332000
GPR14P   EQU   @14                                                      05333000
GPR15P   EQU   @15                                                      05334000
AHLPPTR  EQU   @01                                                      05335000
         ENTRY AHLSVCPT                                                 05336000
CVTPTR   EQU   16                                                       05337000
PSA      EQU   0                                                        05338000
FLCRNPSW EQU   PSA                                                      05339000
FLCROPSW EQU   PSA+8                                                    05340000
FLCICCW2 EQU   PSA+16                                                   05341000
FLCSOPSW EQU   PSA+32                                                   05342000
FLCPOPSW EQU   PSA+40                                                   05343000
PSAEEPSW EQU   PSA+132                                                  05344000
PSAESPSW EQU   PSA+136                                                  05345000
FLCSVILC EQU   PSAESPSW+1                                               05346000
FLCSVCN  EQU   PSAESPSW+2                                               05347000
PSAEPPSW EQU   PSA+140                                                  05348000
FLCPIILC EQU   PSAEPPSW+1                                               05349000
FLCPICOD EQU   PSAEPPSW+2                                               05350000
PSAPICOD EQU   FLCPICOD+1                                               05351000
FLCTEA   EQU   PSAEPPSW+4                                               05352000
FLCPER   EQU   PSA+152                                                  05353000
FLCMCLA  EQU   PSA+168                                                  05354000
FLCIOEL  EQU   FLCMCLA+4                                                05355000
FLCIOA   EQU   FLCMCLA+16                                               05356000
FLCFSA   EQU   FLCMCLA+80                                               05357000
PSALCCAV EQU   PSA+528                                                  05358000
PSATOLD  EQU   PSA+540                                                  05359000
PSAAOLD  EQU   PSA+548                                                  05360000
PSASUPER EQU   PSA+552                                                  05361000
PSASUP1  EQU   PSASUPER                                                 05362000
PSASUP2  EQU   PSASUPER+1                                               05363000
PSASUP3  EQU   PSASUPER+2                                               05364000
PSASUP4  EQU   PSASUPER+3                                               05365000
PSACLHT  EQU   PSA+640                                                  05366000
PSALKSA  EQU   PSA+696                                                  05367000
PSAHLHI  EQU   PSA+760                                                  05368000
PSACPUSA EQU   PSA+794                                                  05369000
PSADSSFL EQU   PSA+836                                                  05370000
PSADSSF1 EQU   PSADSSFL                                                 05371000
PSADSSF3 EQU   PSADSSFL+2                                               05372000
PSADSSF4 EQU   PSADSSFL+3                                               05373000
PSARSVT  EQU   PSA+896                                                  05374000
CVTMAP   EQU   0                                                        05375000
CVTDAR   EQU   CVTMAP+72                                                05376000
CVTFLGS1 EQU   CVTDAR                                                   05377000
CVTDCB   EQU   CVTMAP+116                                               05378000
CVTIOQET EQU   CVTMAP+120                                               05379000
CVTIERLC EQU   CVTMAP+144                                               05380000
CVTHEAD  EQU   CVTMAP+160                                               05381000
CVTSV76C EQU   CVTHEAD                                                  05382000
CVTOPTA  EQU   CVTMAP+182                                               05383000
CVTOPTB  EQU   CVTMAP+183                                               05384000
CVTGTF   EQU   CVTMAP+236                                               05385000
CVTGTFST EQU   CVTGTF                                                   05386000
CVTGTFS  EQU   CVTGTFST                                                 05387000
CVTSTATE EQU   CVTGTFST                                                 05388000
CVTTMODE EQU   CVTGTFST                                                 05389000
CVTFORM  EQU   CVTGTFST                                                 05390000
CVTGTFA  EQU   CVTGTF+1                                                 05391000
CVTAQAVT EQU   CVTMAP+240                                               05392000
CVTTCMFG EQU   CVTAQAVT                                                 05393000
CVTVOLM2 EQU   CVTMAP+244                                               05394000
CVTTATA  EQU   CVTVOLM2                                                 05395000
CVTTSKS  EQU   CVTTATA                                                  05396000
CVTVOLF2 EQU   CVTTSKS                                                  05397000
CVTTAT   EQU   CVTTATA+1                                                05398000
CVTATER  EQU   CVTMAP+248                                               05399000
CVTEXT1  EQU   CVTMAP+252                                               05400000
CVTPURG  EQU   CVTMAP+260                                               05401000
CVTQMSG  EQU   CVTMAP+268                                               05402000
CVTDMSR  EQU   CVTMAP+272                                               05403000
CVTRSV37 EQU   CVTDMSR                                                  05404000
CVTDMSRF EQU   CVTRSV37                                                 05405000
CVTERPV  EQU   CVTMAP+316                                               05406000
CVTINTLA EQU   CVTMAP+320                                               05407000
CVTAPF   EQU   CVTMAP+324                                               05408000
CVTEXT2  EQU   CVTMAP+328                                               05409000
CVTHJES  EQU   CVTMAP+332                                               05410000
CVTPGSIA EQU   CVTMAP+348                                               05411000
CVTA1F1  EQU   CVTMAP+356                                               05412000
CVTSYSK  EQU   CVTMAP+357                                               05413000
CVTVOLM1 EQU   CVTMAP+380                                               05414000
CVTVOLF1 EQU   CVTVOLM1                                                 05415000
CVTATMCT EQU   CVTMAP+388                                               05416000
CVTXTNT1 EQU   0                                                        05417000
CVTXTNT2 EQU   0                                                        05418000
CVTDSSV  EQU   CVTXTNT2                                                 05419000
CVTFLGBT EQU   CVTXTNT2+5                                               05420000
CVTDEBVR EQU   CVTXTNT2+8                                               05421000
CVTQID   EQU   CVTXTNT2+24                                              05422000
CVTRV400 EQU   CVTXTNT2+52                                              05423000
CVTRV409 EQU   CVTXTNT2+53                                              05424000
CVTATCVT EQU   CVTXTNT2+64                                              05425000
CVTRV429 EQU   CVTXTNT2+84                                              05426000
CVTRV438 EQU   CVTXTNT2+85                                              05427000
CVTRV457 EQU   CVTXTNT2+112                                             05428000
CVTRV466 EQU   CVTXTNT2+113                                             05429000
CVTFIX   EQU   0                                                        05430000
CVTRELNO EQU   CVTFIX+252                                               05431000
GTFPCT   EQU   0                                                        05432000
GTFSTAT  EQU   GTFPCT+8                                                 05433000
GTFDEBUG EQU   GTFSTAT                                                  05434000
GTFOPTS  EQU   GTFPCT+12                                                05435000
GTFOPTS1 EQU   GTFOPTS                                                  05436000
OPTTRC   EQU   GTFOPTS1                                                 05437000
GTFOPTS2 EQU   GTFOPTS+1                                                05438000
GTFOPTS3 EQU   GTFOPTS+2                                                05439000
GTFOPTS4 EQU   GTFOPTS+3                                                05440000
OPTTIME  EQU   GTFOPTS4                                                 05441000
PCTCATF  EQU   GTFPCT+16                                                05442000
PCTSVC   EQU   PCTCATF                                                  05443000
NEXTBLOK EQU   GTFPCT+180                                               05444000
SBLOKRTN EQU   GTFPCT+188                                               05445000
WRTRCOM  EQU   GTFPCT+204                                               05446000
TRMWRIT  EQU   GTFPCT+212                                               05447000
WRTRERR  EQU   GTFPCT+216                                               05448000
GTFSSRB  EQU   GTFPCT+220                                               05449000
QLOCKWRD EQU   GTFPCT+236                                               05450000
QLOCKECB EQU   GTFPCT+240                                               05451000
AUDITFLG EQU   GTFPCT+296                                               05452000
GTFASCB  EQU   GTFPCT+300                                               05453000
PCTDMPMD EQU   GTFPCT+308                                               05454000
PCTWTOMD EQU   GTFPCT+312                                               05455000
IOSB     EQU   0                                                        05456000
IOSFLA   EQU   IOSB                                                     05457000
IOSACHN  EQU   IOSFLA                                                   05458000
IOSFLB   EQU   IOSB+1                                                   05459000
IOSFLC   EQU   IOSB+2                                                   05460000
IOSDVALT EQU   IOSFLC                                                   05461000
IOSPKEY  EQU   IOSB+12                                                  05462000
IOSOPT   EQU   IOSB+14                                                  05463000
IOSOPT2  EQU   IOSB+15                                                  05464000
IOSUCB   EQU   IOSB+16                                                  05465000
@NM00012 EQU   IOSB+20                                                  05466000
IOSCSW   EQU   @NM00012+1                                               05467000
IOSTATUS EQU   IOSCSW+3                                                 05468000
IOSSRB   EQU   IOSB+28                                                  05469000
IOSIPIB  EQU   IOSB+44                                                  05470000
IOSDSID  EQU   IOSB+80                                                  05471000
IOSPATH  EQU   IOSB+86                                                  05472000
IOSCHN   EQU   IOSPATH                                                  05473000
IOSCKEY  EQU   IOSB+89                                                  05474000
IOSEEKA  EQU   IOSB+100                                                 05475000
IOSCCHH  EQU   IOSEEKA+3                                                05476000
IOSSKHH  EQU   IOSCCHH+2                                                05477000
UCB      EQU   0                                                        05478000
UCBOB    EQU   0                                                        05479000
UCBJBNR  EQU   UCBOB                                                    05480000
UCBFL5   EQU   UCBOB+1                                                  05481000
UCBAF    EQU   UCBFL5                                                   05482000
UCBSTAT  EQU   UCBOB+3                                                  05483000
UCBCHAN  EQU   UCBOB+4                                                  05484000
UCBSFLS  EQU   UCBOB+6                                                  05485000
UCBFLA   EQU   UCBSFLS                                                  05486000
UCBFL1   EQU   UCBFLA                                                   05487000
UCBBSY   EQU   UCBFL1                                                   05488000
UCBNRY   EQU   UCBFL1                                                   05489000
UCBPST   EQU   UCBFL1                                                   05490000
UCBCUB   EQU   UCBFL1                                                   05491000
UCBFLB   EQU   UCBSFLS+1                                                05492000
UCBCHM   EQU   UCBOB+8                                                  05493000
UCBCHM1  EQU   UCBCHM                                                   05494000
UCBPTH0  EQU   UCBCHM1                                                  05495000
UCBPTH1  EQU   UCBCHM1                                                  05496000
UCBWGT   EQU   UCBOB+12                                                 05497000
UCBTYP   EQU   UCBOB+16                                                 05498000
UCBTBYT1 EQU   UCBTYP                                                   05499000
UCB1FEA5 EQU   UCBTBYT1                                                 05500000
UCB1FEA6 EQU   UCBTBYT1                                                 05501000
UCBTBYT2 EQU   UCBTYP+1                                                 05502000
UCB2OPT2 EQU   UCBTBYT2                                                 05503000
UCBDUDN1 EQU   UCB2OPT2                                                 05504000
UCB2OPT3 EQU   UCBTBYT2                                                 05505000
UCBDUDN2 EQU   UCB2OPT3                                                 05506000
UCB2OPT4 EQU   UCBTBYT2                                                 05507000
UCBRWTAU EQU   UCB2OPT4                                                 05508000
UCB2OPT6 EQU   UCBTBYT2                                                 05509000
UCB2OPT7 EQU   UCBTBYT2                                                 05510000
UCBTBYT3 EQU   UCBTYP+2                                                 05511000
UCBDVCLS EQU   UCBTBYT3                                                 05512000
UCBTBYT4 EQU   UCBTYP+3                                                 05513000
UCBEXTPT EQU   UCBOB+20                                                 05514000
UCBFLC   EQU   UCBEXTPT                                                 05515000
UCBDEV   EQU   UCBOB+24                                                 05516000
UCBCMEXT EQU   0                                                        05517000
UCBATI   EQU   UCBCMEXT+3                                               05518000
@NM00021 EQU   UCBATI                                                   05519000
UCBFLP1  EQU   UCBCMEXT+5                                               05520000
UCBMT    EQU   0                                                        05521000
UCBOCR   EQU   0                                                        05522000
UCB3540X EQU   0                                                        05523000
UCBDKBYT EQU   UCB3540X+6                                               05524000
UCB3800X EQU   0                                                        05525000
UCBOPTNS EQU   UCB3800X                                                 05526000
UCBACTIV EQU   UCB3800X+3                                               05527000
UCBMDRBF EQU   UCB3800X+36                                              05528000
UCBUCS   EQU   0                                                        05529000
UCBUCSOP EQU   UCBUCS+4                                                 05530000
UCBFCBOP EQU   UCBUCS+5                                                 05531000
DEBBASIC EQU   0                                                        05532000
DEBTCBAD EQU   DEBBASIC                                                 05533000
DEBTCBB  EQU   DEBTCBAD+1                                               05534000
DEBDEBAD EQU   DEBBASIC+4                                               05535000
DEBIRBAD EQU   DEBBASIC+8                                               05536000
DEBOFLGS EQU   DEBIRBAD                                                 05537000
DEBOPATB EQU   DEBBASIC+12                                              05538000
DEBFLGS1 EQU   DEBBASIC+14                                              05539000
DEBUSRPG EQU   DEBBASIC+16                                              05540000
DEBRRQ   EQU   DEBBASIC+20                                              05541000
DEBECBAD EQU   DEBRRQ                                                   05542000
DEBDCBAD EQU   DEBBASIC+24                                              05543000
DEBPROTG EQU   DEBDCBAD                                                 05544000
DEBAPPAD EQU   DEBBASIC+28                                              05545000
DEBBASND EQU   DEBBASIC+32                                              05546000
DEBDASD  EQU   0                                                        05547000
DEBUCBAD EQU   DEBDASD                                                  05548000
DEBDVMOD EQU   DEBUCBAD                                                 05549000
DEBACSMD EQU   0                                                        05550000
DEBVOLSQ EQU   DEBACSMD                                                 05551000
DEBVOLBT EQU   DEBVOLSQ                                                 05552000
DEBDSNM  EQU   DEBACSMD+4                                               05553000
DEBUTSAA EQU   DEBDSNM                                                  05554000
DEBEXPTR EQU   0                                                        05555000
DEBACS01 EQU   0                                                        05556000
DEBDSNAM EQU   DEBACS01                                                 05557000
DEBACS02 EQU   0                                                        05558000
DEBDBLK  EQU   DEBACS02                                                 05559000
DEBACS03 EQU   0                                                        05560000
DEBACS04 EQU   0                                                        05561000
DEBTBFRA EQU   DEBACS04                                                 05562000
DEBTCCWA EQU   DEBACS04+4                                               05563000
DEBACS05 EQU   0                                                        05564000
DEBFUCBA EQU   DEBACS05                                                 05565000
DEBLUCBA EQU   DEBACS05+4                                               05566000
DEBACS06 EQU   0                                                        05567000
DEBACS07 EQU   0                                                        05568000
DEBACS08 EQU   0                                                        05569000
DEBSUBNM EQU   0                                                        05570000
DEBSBPTR EQU   0                                                        05571000
DEB      EQU   0                                                        05572000
DEBAVT   EQU   DEB                                                      05573000
DEBEOEA  EQU   DEBAVT                                                   05574000
DEBEOEAB EQU   DEBEOEA                                                  05575000
DEBSIOA  EQU   DEBAVT+4                                                 05576000
DEBSIOAB EQU   DEBSIOA                                                  05577000
DEBPCIA  EQU   DEBAVT+8                                                 05578000
DEBPCIAB EQU   DEBPCIA                                                  05579000
DEBCEA   EQU   DEBAVT+12                                                05580000
DEBCEAB  EQU   DEBCEA                                                   05581000
DEBXCEA  EQU   DEBAVT+16                                                05582000
DEBXCEAB EQU   DEBXCEA                                                  05583000
DEBPREFX EQU   DEB+20                                                   05584000
DEBXTNP  EQU   DEBPREFX+8                                               05585000
DEBXTN   EQU   0                                                        05586000
DEBXFLG1 EQU   DEBXTN+2                                                 05587000
IOBPREFX EQU   0                                                        05588000
IOBCFLG1 EQU   IOBPREFX                                                 05589000
IOBPRPTR EQU   0                                                        05590000
IOBSTDRD EQU   0                                                        05591000
IOBFLAG1 EQU   IOBSTDRD                                                 05592000
IOBCYCCK EQU   IOBFLAG1                                                 05593000
IOBRSTRT EQU   IOBFLAG1                                                 05594000
IOBFLAG2 EQU   IOBSTDRD+1                                               05595000
IOBPURGE EQU   IOBFLAG2                                                 05596000
IOBRDHA0 EQU   IOBFLAG2                                                 05597000
IOBSENS0 EQU   IOBSTDRD+2                                               05598000
IOBS0B7  EQU   IOBSENS0                                                 05599000
IOBSENS1 EQU   IOBSTDRD+3                                               05600000
IOBECBPT EQU   IOBSTDRD+4                                               05601000
IOBFLAG3 EQU   IOBSTDRD+8                                               05602000
IOBFL3   EQU   IOBFLAG3                                                 05603000
IOBCNC   EQU   IOBFL3                                                   05604000
IOBICL   EQU   IOBFL3                                                   05605000
IOBCSW   EQU   IOBSTDRD+9                                               05606000
IOBIOCSW EQU   IOBCSW                                                   05607000
IOBSTBYT EQU   IOBIOCSW+3                                               05608000
IOBUSTAT EQU   IOBSTBYT                                                 05609000
IOBCSTAT EQU   IOBSTBYT+1                                               05610000
IOBSTART EQU   IOBSTDRD+16                                              05611000
IOBDCBPT EQU   IOBSTDRD+20                                              05612000
IOBFLAG4 EQU   IOBDCBPT                                                 05613000
IOBDCBPB EQU   IOBDCBPT+1                                               05614000
IOBRESTR EQU   IOBSTDRD+24                                              05615000
IOBINCAM EQU   IOBSTDRD+28                                              05616000
IOBBTAMF EQU   IOBINCAM                                                 05617000
ASCB     EQU   0                                                        05618000
ASCBFW1  EQU   ASCB+100                                                 05619000
ASCBRCTF EQU   ASCBFW1+2                                                05620000
ASCBFLG1 EQU   ASCBFW1+3                                                05621000
ASCBDSP1 EQU   ASCB+114                                                 05622000
ASCBFLG2 EQU   ASCB+115                                                 05623000
ASCBJBNI EQU   ASCB+172                                                 05624000
ASCBJBNS EQU   ASCB+176                                                 05625000
CDENTRY  EQU   0                                                        05626000
CDNAME   EQU   CDENTRY+8                                                05627000
CDATTR   EQU   CDENTRY+28                                               05628000
CDATTR2  EQU   CDENTRY+29                                               05629000
CDENTPTR EQU   0                                                        05630000
IHADCB   EQU   0                                                        05631000
IHADCS00 EQU   0                                                        05632000
DCBFDAD  EQU   IHADCS00+5                                               05633000
IHADCS01 EQU   0                                                        05634000
DCBDVTBL EQU   IHADCS01                                                 05635000
DCBTRBAL EQU   IHADCS01+6                                               05636000
IHADCS11 EQU   0                                                        05637000
DCBRELB  EQU   IHADCS11                                                 05638000
DCBREL   EQU   DCBRELB+1                                                05639000
DCBBUFCB EQU   IHADCS11+4                                               05640000
DCBDSORG EQU   IHADCS11+10                                              05641000
DCBDSRG1 EQU   DCBDSORG                                                 05642000
DCBDSGIS EQU   DCBDSRG1                                                 05643000
DCBDSRG2 EQU   DCBDSORG+1                                               05644000
DCBIOBAD EQU   IHADCS11+12                                              05645000
DCBODEB  EQU   DCBIOBAD                                                 05646000
DCBLNP   EQU   DCBODEB                                                  05647000
DCBQSLM  EQU   DCBLNP                                                   05648000
DCBIOBAA EQU   DCBODEB+1                                                05649000
IHADCS50 EQU   0                                                        05650000
DCBSVCXL EQU   IHADCS50                                                 05651000
DCBEODAD EQU   IHADCS50+4                                               05652000
DCBBFALN EQU   DCBEODAD                                                 05653000
DCBHIARC EQU   DCBBFALN                                                 05654000
DCBBFTEK EQU   DCBHIARC                                                 05655000
DCBBFT   EQU   DCBBFTEK                                                 05656000
DCBEXLST EQU   IHADCS50+8                                               05657000
DCBRECFM EQU   DCBEXLST                                                 05658000
DCBRECLA EQU   DCBRECFM                                                 05659000
IHADCS24 EQU   0                                                        05660000
DCBOFLGS EQU   IHADCS24+8                                               05661000
DCBOFLWR EQU   DCBOFLGS                                                 05662000
DCBOFOPN EQU   DCBOFLGS                                                 05663000
DCBIFLG  EQU   IHADCS24+9                                               05664000
DCBIBPCT EQU   DCBIFLG                                                  05665000
DCBMACR  EQU   IHADCS24+10                                              05666000
DCBMACR1 EQU   DCBMACR                                                  05667000
DCBMRFE  EQU   DCBMACR1                                                 05668000
DCBMRGET EQU   DCBMRFE                                                  05669000
DCBMRAPG EQU   DCBMACR1                                                 05670000
DCBMRRD  EQU   DCBMRAPG                                                 05671000
DCBMRCI  EQU   DCBMACR1                                                 05672000
DCBMRMVG EQU   DCBMRCI                                                  05673000
DCBMRLCG EQU   DCBMACR1                                                 05674000
DCBMRABC EQU   DCBMACR1                                                 05675000
DCBMRPT1 EQU   DCBMRABC                                                 05676000
DCBMRSBG EQU   DCBMRPT1                                                 05677000
DCBMRCRL EQU   DCBMACR1                                                 05678000
DCBMRCHK EQU   DCBMRCRL                                                 05679000
DCBMRRDX EQU   DCBMRCHK                                                 05680000
DCBMRDMG EQU   DCBMACR1                                                 05681000
DCBMACR2 EQU   DCBMACR+1                                                05682000
DCBMRPUT EQU   DCBMACR2                                                 05683000
DCBMRWRT EQU   DCBMACR2                                                 05684000
DCBMRMVP EQU   DCBMACR2                                                 05685000
DCBMR5WD EQU   DCBMACR2                                                 05686000
DCBMRLDM EQU   DCBMR5WD                                                 05687000
DCBMRLCP EQU   DCBMRLDM                                                 05688000
DCBMR4WD EQU   DCBMACR2                                                 05689000
DCBMRPT2 EQU   DCBMR4WD                                                 05690000
DCBMRTMD EQU   DCBMRPT2                                                 05691000
DCBMR3WD EQU   DCBMACR2                                                 05692000
DCBMRCTL EQU   DCBMR3WD                                                 05693000
DCBMRSTK EQU   DCBMRCTL                                                 05694000
DCBMR1WD EQU   DCBMACR2                                                 05695000
DCBMRSWA EQU   DCBMR1WD                                                 05696000
DCBMRDMD EQU   DCBMRSWA                                                 05697000
IHADCS25 EQU   0                                                        05698000
DCBTIOT  EQU   IHADCS25                                                 05699000
DCBMACRF EQU   IHADCS25+2                                               05700000
DCBMACF1 EQU   DCBMACRF                                                 05701000
DCBMFFE  EQU   DCBMACF1                                                 05702000
DCBMFGET EQU   DCBMFFE                                                  05703000
DCBMFAPG EQU   DCBMACF1                                                 05704000
DCBMFRD  EQU   DCBMFAPG                                                 05705000
DCBMFCI  EQU   DCBMACF1                                                 05706000
DCBMFMVG EQU   DCBMFCI                                                  05707000
DCBMFLCG EQU   DCBMACF1                                                 05708000
DCBMFABC EQU   DCBMACF1                                                 05709000
DCBMFPT1 EQU   DCBMFABC                                                 05710000
DCBMFSBG EQU   DCBMFPT1                                                 05711000
DCBMFCRL EQU   DCBMACF1                                                 05712000
DCBMFCHK EQU   DCBMFCRL                                                 05713000
DCBMFDMG EQU   DCBMACF1                                                 05714000
DCBMACF2 EQU   DCBMACRF+1                                               05715000
DCBMFPUT EQU   DCBMACF2                                                 05716000
DCBMFWRT EQU   DCBMACF2                                                 05717000
DCBMFMVP EQU   DCBMACF2                                                 05718000
DCBMF5WD EQU   DCBMACF2                                                 05719000
DCBMFLDM EQU   DCBMF5WD                                                 05720000
DCBMFLCP EQU   DCBMFLDM                                                 05721000
DCBMF4WD EQU   DCBMACF2                                                 05722000
DCBMFPT2 EQU   DCBMF4WD                                                 05723000
DCBMFTMD EQU   DCBMFPT2                                                 05724000
DCBMF3WD EQU   DCBMACF2                                                 05725000
DCBMFCTL EQU   DCBMF3WD                                                 05726000
DCBMFSTK EQU   DCBMFCTL                                                 05727000
DCBMF1WD EQU   DCBMACF2                                                 05728000
DCBMFSWA EQU   DCBMF1WD                                                 05729000
DCBMFDMD EQU   DCBMFSWA                                                 05730000
DCBDEBAD EQU   IHADCS25+4                                               05731000
DCBIFLGS EQU   DCBDEBAD                                                 05732000
DCBIFPCT EQU   DCBIFLGS                                                 05733000
IHADCS28 EQU   0                                                        05734000
DCBOPTCD EQU   IHADCS28                                                 05735000
DCBOPTZ  EQU   DCBOPTCD                                                 05736000
DECB     EQU   0                                                        05737000
DECBPTR  EQU   DECB+4                                                   05738000
DECTYPE  EQU   DECBPTR                                                  05739000
DECTYPE1 EQU   DECTYPE                                                  05740000
DECTYPE2 EQU   DECTYPE+1                                                05741000
DECNEXT  EQU   DECB+20                                                  05742000
DECBPT   EQU   0                                                        05743000
DECBS01  EQU   0                                                        05744000
DECBECB  EQU   DECBS01                                                  05745000
DECBRB   EQU   DECBECB                                                  05746000
DECBECBF EQU   DECBRB                                                   05747000
DECBTYP1 EQU   DECBS01+4                                                05748000
DECBTYP2 EQU   DECBS01+5                                                05749000
DECBEXC1 EQU   DECBS01+24                                               05750000
DECBEXC2 EQU   DECBS01+25                                               05751000
DECBS02  EQU   0                                                        05752000
@NM00043 EQU   DECBS02                                                  05753000
DECCC2   EQU   @NM00043+1                                               05754000
DECCC3   EQU   @NM00043+2                                               05755000
@NM00045 EQU   DECBS02+4                                                05756000
@NM00046 EQU   @NM00045                                                 05757000
@NM00047 EQU   @NM00045+1                                               05758000
DECTYPRU EQU   @NM00047                                                 05759000
DECNA    EQU   DECBS02+28                                               05760000
DECBS03  EQU   0                                                        05761000
DECCPOL  EQU   DECBS03+20                                               05762000
@NM00055 EQU   DECBS03+36                                               05763000
DECBS04  EQU   0                                                        05764000
@NM00058 EQU   DECBS04+4                                                05765000
@NM00059 EQU   @NM00058                                                 05766000
@NM00062 EQU   DECBS04+8                                                05767000
DECBUFCT EQU   @NM00062                                                 05768000
DECONLTT EQU   DECBUFCT                                                 05769000
DECENTRY EQU   DECBS04+20                                               05770000
DECFLAGS EQU   DECBS04+24                                               05771000
DECWACK  EQU   DECFLAGS                                                 05772000
DECREVRS EQU   DECFLAGS                                                 05773000
DECERRST EQU   DECBS04+29                                               05774000
DECPOLPT EQU   DECBS04+36                                               05775000
FRRS     EQU   0                                                        05776000
FRRSHEAD EQU   FRRS                                                     05777000
FRRSPTR  EQU   0                                                        05778000
FRRSENTR EQU   0                                                        05779000
FRRSFLGS EQU   FRRSENTR+4                                               05780000
FRRSFLG1 EQU   FRRSFLGS                                                 05781000
FRREPTR  EQU   0                                                        05782000
LCCA     EQU   0                                                        05783000
LCCAPGR2 EQU   LCCA+72                                                  05784000
LCCAIHRC EQU   LCCA+520                                                 05785000
LCCAIHR1 EQU   LCCAIHRC                                                 05786000
LCCAIHR2 EQU   LCCAIHRC+1                                               05787000
LCCAIHR3 EQU   LCCAIHRC+2                                               05788000
LCCAIHR4 EQU   LCCAIHRC+3                                               05789000
LCCASPIN EQU   LCCA+524                                                 05790000
LCCASPN1 EQU   LCCASPIN                                                 05791000
LCCASPN2 EQU   LCCASPIN+1                                               05792000
LCCASPN3 EQU   LCCASPIN+2                                               05793000
LCCASPN4 EQU   LCCASPIN+3                                               05794000
LCCACPUS EQU   LCCA+536                                                 05795000
LCCADSF1 EQU   LCCA+540                                                 05796000
LCCADSF2 EQU   LCCA+541                                                 05797000
LCCASPSA EQU   LCCA+544                                                 05798000
LCCACRFL EQU   LCCA+692                                                 05799000
LCCACREX EQU   LCCA+693                                                 05800000
LCCALKFG EQU   LCCA+694                                                 05801000
LCCASRBF EQU   LCCA+720                                                 05802000
LPDE     EQU   0                                                        05803000
LPDENAME EQU   LPDE+8                                                   05804000
LPDEATTR EQU   LPDE+28                                                  05805000
LPDEATT2 EQU   LPDE+29                                                  05806000
LPDEMJNM EQU   LPDE+32                                                  05807000
LPDEPTR  EQU   0                                                        05808000
SDWA     EQU   0                                                        05809000
SDWAPARM EQU   SDWA                                                     05810000
SDWAFIOB EQU   SDWA+4                                                   05811000
SDWAABCC EQU   SDWAFIOB                                                 05812000
SDWACMPF EQU   SDWAABCC                                                 05813000
SDWACTL1 EQU   SDWA+8                                                   05814000
SDWACMKA EQU   SDWACTL1                                                 05815000
SDWAMWPA EQU   SDWACTL1+1                                               05816000
SDWAPMKA EQU   SDWACTL1+4                                               05817000
SDWACTL2 EQU   SDWA+16                                                  05818000
SDWACMKP EQU   SDWACTL2                                                 05819000
SDWAMWPP EQU   SDWACTL2+1                                               05820000
SDWAPMKP EQU   SDWACTL2+4                                               05821000
SDWAGRSV EQU   SDWA+24                                                  05822000
SDWAGR09 EQU   SDWAGRSV+36                                              05823000
SDWAGR10 EQU   SDWAGRSV+40                                              05824000
SDWANAME EQU   SDWA+88                                                  05825000
SDWAEC1  EQU   SDWA+104                                                 05826000
SDWAEMK1 EQU   SDWAEC1                                                  05827000
SDWAMWP1 EQU   SDWAEC1+1                                                05828000
SDWAINT1 EQU   SDWAEC1+2                                                05829000
SDWANXT1 EQU   SDWAEC1+4                                                05830000
SDWAAEC1 EQU   SDWA+112                                                 05831000
SDWAILC1 EQU   SDWAAEC1+1                                               05832000
SDWAINC1 EQU   SDWAAEC1+2                                               05833000
SDWAICD1 EQU   SDWAINC1+1                                               05834000
SDWAEC2  EQU   SDWA+120                                                 05835000
SDWAEMK2 EQU   SDWAEC2                                                  05836000
SDWAMWP2 EQU   SDWAEC2+1                                                05837000
SDWAINT2 EQU   SDWAEC2+2                                                05838000
SDWANXT2 EQU   SDWAEC2+4                                                05839000
SDWAAEC2 EQU   SDWA+128                                                 05840000
SDWAILC2 EQU   SDWAAEC2+1                                               05841000
SDWAINC2 EQU   SDWAAEC2+2                                               05842000
SDWAICD2 EQU   SDWAINC2+1                                               05843000
SDWASRSV EQU   SDWA+136                                                 05844000
SDWASR09 EQU   SDWASRSV+36                                              05845000
SDWASR10 EQU   SDWASRSV+40                                              05846000
SDWASR11 EQU   SDWASRSV+44                                              05847000
SDWASR14 EQU   SDWASRSV+56                                              05848000
SDWAIDNT EQU   SDWA+200                                                 05849000
SDWAMCH  EQU   SDWA+204                                                 05850000
SDWASTCK EQU   SDWAMCH                                                  05851000
SDWAMCHI EQU   SDWAMCH+8                                                05852000
SDWAMCHS EQU   SDWAMCHI                                                 05853000
SDWAMCHD EQU   SDWAMCHI+1                                               05854000
SDWARSR1 EQU   SDWAMCH+12                                               05855000
SDWARSR2 EQU   SDWAMCH+13                                               05856000
SDWAFLGS EQU   SDWA+232                                                 05857000
SDWAERRA EQU   SDWAFLGS                                                 05858000
SDWAMCHK EQU   SDWAERRA                                                 05859000
SDWAERRB EQU   SDWAFLGS+1                                               05860000
SDWAERRC EQU   SDWAFLGS+2                                               05861000
SDWAPERC EQU   SDWAERRC                                                 05862000
SDWAEAS  EQU   SDWAERRC                                                 05863000
SDWAERRD EQU   SDWAFLGS+3                                               05864000
SDWACLUP EQU   SDWAERRD                                                 05865000
SDWAIOFS EQU   SDWA+238                                                 05866000
SDWARTYA EQU   SDWA+240                                                 05867000
SDWACPUA EQU   SDWA+248                                                 05868000
SDWAPARQ EQU   SDWA+252                                                 05869000
SDWARCDE EQU   SDWAPARQ                                                 05870000
SDWAACF2 EQU   SDWAPARQ+1                                               05871000
SDWARCRD EQU   SDWAACF2                                                 05872000
SDWAUPRG EQU   SDWAACF2                                                 05873000
SDWAACF3 EQU   SDWAPARQ+2                                               05874000
SDWAACF4 EQU   SDWAPARQ+3                                               05875000
SDWALKWA EQU   SDWA+256                                                 05876000
SDWALKWS EQU   SDWALKWA                                                 05877000
SDWARECP EQU   SDWA+292                                                 05878000
SDWAREXN EQU   SDWARECP+16                                              05879000
SDWASNPA EQU   SDWA+320                                                 05880000
SDWADUMP EQU   SDWASNPA                                                 05881000
SDWADPFS EQU   SDWADUMP+1                                               05882000
SDWADDAT EQU   SDWASNPA+4                                               05883000
SDWASDAT EQU   SDWADDAT                                                 05884000
SDWAPDAT EQU   SDWADDAT+2                                               05885000
SDWADPSA EQU   SDWA+328                                                 05886000
SDWADPSL EQU   SDWADPSA                                                 05887000
SDWARA   EQU   SDWA+400                                                 05888000
SDWADPVA EQU   SDWARA+2                                                 05889000
RBPRFX   EQU   0                                                        05890000
RBBASIC  EQU   0                                                        05891000
RBEXRTNM EQU   RBBASIC                                                  05892000
RBTMFLD  EQU   RBEXRTNM                                                 05893000
RBSTAB   EQU   RBBASIC+10                                               05894000
XSTAB    EQU   RBSTAB                                                   05895000
RBSTAB1  EQU   XSTAB                                                    05896000
XSTAB1   EQU   RBSTAB1                                                  05897000
RBFTCKPT EQU   XSTAB1                                                   05898000
RBSTAB2  EQU   XSTAB+1                                                  05899000
XSTAB2   EQU   RBSTAB2                                                  05900000
RBTCBNXT EQU   XSTAB2                                                   05901000
RBFACTV  EQU   XSTAB2                                                   05902000
RBFDYN   EQU   XSTAB2                                                   05903000
RBECBWT  EQU   XSTAB2                                                   05904000
RBOPSW   EQU   RBBASIC+16                                               05905000
XRBPSW   EQU   RBOPSW                                                   05906000
RBOPSWB2 EQU   XRBPSW+1                                                 05907000
RBLINK   EQU   RBBASIC+28                                               05908000
XRBLNK   EQU   RBLINK                                                   05909000
RBWCF    EQU   XRBLNK                                                   05910000
RBLINKB  EQU   XRBLNK+1                                                 05911000
RBGRSAVE EQU   RBBASIC+32                                               05912000
XRBREG   EQU   RBGRSAVE                                                 05913000
RBGRS0   EQU   XRBREG                                                   05914000
RBGRS1   EQU   XRBREG+4                                                 05915000
RBGRS2   EQU   XRBREG+8                                                 05916000
RBGRS3   EQU   XRBREG+12                                                05917000
RBGRS4   EQU   XRBREG+16                                                05918000
RBGRS5   EQU   XRBREG+20                                                05919000
RBGRS6   EQU   XRBREG+24                                                05920000
RBGRS7   EQU   XRBREG+28                                                05921000
RBGRS8   EQU   XRBREG+32                                                05922000
RBGRS9   EQU   XRBREG+36                                                05923000
RBGRS10  EQU   XRBREG+40                                                05924000
RBGRS11  EQU   XRBREG+44                                                05925000
RBGRS12  EQU   XRBREG+48                                                05926000
RBGRS13  EQU   XRBREG+52                                                05927000
RBGRS14  EQU   XRBREG+56                                                05928000
RBGRS15  EQU   XRBREG+60                                                05929000
XRBESA   EQU   RBBASIC+96                                               05930000
RBPREFIX EQU   0                                                        05931000
RBRSV019 EQU   RBPREFIX+14                                              05932000
RBRSV028 EQU   RBPREFIX+15                                              05933000
RBRSV041 EQU   RBPREFIX+27                                              05934000
RBRSV054 EQU   RBPREFIX+39                                              05935000
RBRTOPSW EQU   RBPREFIX+40                                              05936000
RBRTPSW2 EQU   RBRTOPSW+8                                               05937000
RBRTICIL EQU   RBRTPSW2                                                 05938000
RBFLAGS1 EQU   RBPREFIX+56                                              05939000
RBINTCDA EQU   RBPREFIX+61                                              05940000
RBSECT   EQU   0                                                        05941000
RBPPSAV  EQU   RBSECT                                                   05942000
@NM00156 EQU   RBSECT+10                                                05943000
@NM00157 EQU   @NM00156                                                 05944000
RBTRSVRB EQU   @NM00157                                                 05945000
@NM00159 EQU   @NM00156+1                                               05946000
RBETXR   EQU   @NM00159                                                 05947000
RBEP     EQU   RBSECT+12                                                05948000
RBPGMQ   EQU   RBSECT+24                                                05949000
@NM00166 EQU   RBSECT+28                                                05950000
IRBEND   EQU   RBSECT+96                                                05951000
@NM00170 EQU   RBSECT+96                                                05952000
RBRSV138 EQU   @NM00170+7                                               05953000
RBRSV150 EQU   RBSECT+167                                               05954000
SRBSECT  EQU   0                                                        05955000
SRB      EQU   SRBSECT                                                  05956000
SRBFLC   EQU   SRB+12                                                   05957000
SRBPTCB  EQU   SRBFLC+4                                                 05958000
TCBFIX   EQU   0                                                        05959000
TCBFRS   EQU   TCBFIX                                                   05960000
TCB      EQU   0                                                        05961000
TCBRBP   EQU   TCB                                                      05962000
TCBPIE   EQU   TCB+4                                                    05963000
TCBPMASK EQU   TCBPIE                                                   05964000
TCBTIO   EQU   TCB+12                                                   05965000
TCBCMP   EQU   TCB+16                                                   05966000
TCBCMPF  EQU   TCBCMP                                                   05967000
TCBCPP   EQU   TCBCMPF                                                  05968000
TCBSTCC  EQU   TCBCMPF                                                  05969000
TCBCDBL  EQU   TCBCMPF                                                  05970000
TCBCWTO  EQU   TCBCMPF                                                  05971000
TCBCIND  EQU   TCBCMPF                                                  05972000
TCBCMSG  EQU   TCBCMPF                                                  05973000
TCBTRN   EQU   TCB+20                                                   05974000
TCBABF   EQU   TCBTRN                                                   05975000
TCBMSS   EQU   TCB+24                                                   05976000
TCBPKF   EQU   TCB+28                                                   05977000
TCBFLGS  EQU   TCB+29                                                   05978000
TCBFLGS1 EQU   TCBFLGS                                                  05979000
TCBFLGS2 EQU   TCBFLGS+1                                                05980000
TCBFLGS3 EQU   TCBFLGS+2                                                05981000
TCBFLGS4 EQU   TCBFLGS+3                                                05982000
TCBFLGS5 EQU   TCBFLGS+4                                                05983000
TCBABWF  EQU   TCBFLGS5                                                 05984000
TCBJPQ   EQU   TCB+44                                                   05985000
TCBPURGE EQU   TCBJPQ                                                   05986000
TCBGRS   EQU   TCB+48                                                   05987000
TCBFSA   EQU   TCB+112                                                  05988000
TCBTME   EQU   TCB+120                                                  05989000
TCBJSTCB EQU   TCB+124                                                  05990000
TCBTSFLG EQU   TCB+148                                                  05991000
TCBTSTSK EQU   TCBTSFLG                                                 05992000
TCBSTAB  EQU   TCB+160                                                  05993000
TCBNSTAE EQU   TCBSTAB                                                  05994000
TCBTCT   EQU   TCB+164                                                  05995000
TCBTCTGF EQU   TCBTCT                                                   05996000
TCBSCNDY EQU   TCB+172                                                  05997000
TCBNDSP  EQU   TCBSCNDY                                                 05998000
TCBNDSP1 EQU   TCBNDSP+1                                                05999000
TCBNDSP2 EQU   TCBNDSP+2                                                06000000
TCBNDSP3 EQU   TCBNDSP+3                                                06001000
TCBJSCB  EQU   TCB+180                                                  06002000
TCBRECDE EQU   TCBJSCB                                                  06003000
TCBEXT1  EQU   TCB+196                                                  06004000
TCBBITS  EQU   TCB+200                                                  06005000
TCBNDSP4 EQU   TCBBITS                                                  06006000
TCBNDSP5 EQU   TCBBITS+1                                                06007000
TCBFLGS6 EQU   TCBBITS+2                                                06008000
TCBFLGS7 EQU   TCBBITS+3                                                06009000
TCBDAR   EQU   TCB+204                                                  06010000
TCBDARC  EQU   TCBDAR                                                   06011000
TCBEXT2  EQU   TCB+208                                                  06012000
TCBFOE   EQU   TCB+244                                                  06013000
TCBESTAE EQU   TCB+264                                                  06014000
TCBESTRM EQU   TCBESTAE+1                                               06015000
TCBFBYT1 EQU   TCB+276                                                  06016000
TCBFBYT2 EQU   TCB+277                                                  06017000
TCBRV124 EQU   TCB+278                                                  06018000
TCBRV133 EQU   TCB+279                                                  06019000
TCBXTNT2 EQU   0                                                        06020000
TCBGTF   EQU   TCBXTNT2                                                 06021000
TCBTFLG  EQU   TCBGTF                                                   06022000
TCBRCMP  EQU   TCBXTNT2+5                                               06023000
TCBRV146 EQU   TCBXTNT2+28                                              06024000
TCBRV155 EQU   TCBXTNT2+29                                              06025000
TCBRV164 EQU   TCBXTNT2+30                                              06026000
TCBRV173 EQU   TCBXTNT2+31                                              06027000
WSAC     EQU   0                                                        06028000
WSACGTF  EQU   WSAC+4                                                   06029000
MCAWSA   EQU   0                                                        06030000
MCATRAIL EQU   MCAWSA+256                                               06031000
MCATRL1  EQU   MCATRAIL                                                 06032000
MCATRL2  EQU   MCATRAIL+1                                               06033000
MCAERROR EQU   MCATRL2                                                  06034000
MCATRL3  EQU   MCATRAIL+2                                               06035000
MCATRL4  EQU   MCATRAIL+3                                               06036000
MCATRL5  EQU   MCATRAIL+4                                               06037000
MCATRL6  EQU   MCATRAIL+5                                               06038000
MCATRL7  EQU   MCATRAIL+6                                               06039000
MCATRL8  EQU   MCATRAIL+7                                               06040000
MCAMCR   EQU   MCAWSA+264                                               06041000
MCARECPR EQU   MCAWSA+268                                               06042000
MCAREC   EQU   MCAWSA+284                                               06043000
MCAWORK  EQU   MCAWSA+584                                               06044000
MCHEAD   EQU   0                                                        06045000
MCHFLGS  EQU   MCHEAD+24                                                06046000
MCHFLG1  EQU   MCHFLGS                                                  06047000
MCHSETE  EQU   MCHEAD+28                                                06048000
MCHSETD  EQU   MCHEAD+32                                                06049000
MCQE     EQU   0                                                        06050000
MCQEAT   EQU   MCQE+32                                                  06051000
MCQEFLGS EQU   MCQE+41                                                  06052000
MCRWSA   EQU   0                                                        06053000
MCROUTSA EQU   MCRWSA+64                                                06054000
MCRMCA   EQU   MCRWSA+128                                               06055000
MCRWSAF  EQU   MCRWSA+132                                               06056000
MCREID   EQU   MCRWSA+134                                               06057000
FRRPLST  EQU   0                                                        06058000
RECURCTR EQU   FRRPLST                                                  06059000
SVR14NRM EQU   FRRPLST+4                                                06060000
SVR14FRR EQU   FRRPLST+8                                                06061000
JOBNAME  EQU   0                                                        06062000
JBNMTEST EQU   JOBNAME                                                  06063000
TIOENT   EQU   0                                                        06064000
DDNAMEO  EQU   TIOENT+4                                                 06065000
SDMPBUF  EQU   0                                                        06066000
RBTAB    EQU   0                                                        06067000
RADDR    EQU   0                                                        06068000
AHLWTOMD EQU   0                                                        06069000
AHLDMPMD EQU   0                                                        06070000
DSNCHAR  EQU   0                                                        06071000
LENDSNM  EQU   0                                                        06072000
DSNLEN   EQU   LENDSNM                                                  06073000
DSNAME   EQU   LENDSNM+1                                                06074000
DSETNM   EQU   0                                                        06075000
ERRFLD   EQU   0                                                        06076000
RECOVADD EQU   0                                                        06077000
RECOVENT EQU   0                                                        06078000
RCOVFLG  EQU   RECOVENT                                                 06079000
NXTENT   EQU   RCOVFLG                                                  06080000
NXTDDN   EQU   RCOVFLG                                                  06081000
FLDOFF   EQU   RCOVFLG                                                  06082000
FLDLEN   EQU   RCOVFLG                                                  06083000
SECOFF   EQU   RCOVFLG                                                  06084000
BASREC   EQU   RCOVFLG                                                  06085000
RCOVLGTH EQU   RECOVENT+1                                               06086000
RCOVOFF  EQU   RECOVENT+2                                               06087000
RCOVINDX EQU   RECOVENT+3                                               06088000
PLIST    EQU   0                                                        06089000
PLEN     EQU   PLIST                                                    06090000
PLST     EQU   PLIST+1                                                  06091000
SVCNOTAB EQU   0                                                        06092000
PARM01   EQU   0                                                        06093000
PARMSLEN EQU   PARM01                                                   06094000
RECPARM  EQU   PARM01+1                                                 06095000
PARM     EQU   0                                                        06096000
ENDIND1  EQU   PARM                                                     06097000
ENDIT1   EQU   ENDIND1                                                  06098000
PARMS    EQU   0                                                        06099000
PLISTA2  EQU   0                                                        06100000
PARMLST4 EQU   0                                                        06101000
LSTSV6   EQU   0                                                        06102000
EPDE6    EQU   0                                                        06103000
LSTSV7   EQU   0                                                        06104000
EPDE7    EQU   0                                                        06105000
EPNM8A   EQU   0                                                        06106000
EPNM8B   EQU   0                                                        06107000
EPNM8C   EQU   EPNM8B+4                                                 06108000
PICA     EQU   0                                                        06109000
PRMLST15 EQU   0                                                        06110000
@NM00439 EQU   PRMLST15+80                                              06111000
DEB15    EQU   @NM00439+1                                               06112000
DEB152   EQU   DEB15+2                                                  06113000
PRMLST16 EQU   0                                                        06114000
DEBAD16  EQU   PRMLST16                                                 06115000
DEBAD    EQU   DEBAD16+1                                                06116000
DEBAD2   EQU   DEBAD+2                                                  06117000
PL17PTR  EQU   0                                                        06118000
NOPL     EQU   PL17PTR+1                                                06119000
PLSTA17  EQU   0                                                        06120000
PIRWORD1 EQU   PLSTA17                                                  06121000
PIRCNT   EQU   PIRWORD1+1                                               06122000
STRDVRU  EQU   PLSTA17+4                                                06123000
FINDNM   EQU   0                                                        06124000
BLDLLIST EQU   0                                                        06125000
PRM21LST EQU   0                                                        06126000
DDNAM24  EQU   0                                                        06127000
PLST26   EQU   0                                                        06128000
CTGOPTN1 EQU   PLST26                                                   06129000
CAT26    EQU   CTGOPTN1                                                 06130000
CTGNAME  EQU   CTGOPTN1                                                 06131000
CTGOPTN3 EQU   PLST26+2                                                 06132000
CTGFUNC  EQU   CTGOPTN3                                                 06133000
CTGSUPLT EQU   CTGOPTN3                                                 06134000
CTGAM0   EQU   CTGOPTN3                                                 06135000
CTGENT   EQU   PLST26+4                                                 06136000
CTGFVT   EQU   CTGENT                                                   06137000
DSNAD26  EQU   CTGFVT                                                   06138000
@NM00450 EQU   PLST26+16                                                06139000
CTGOPTNS EQU   @NM00450                                                 06140000
CTGFV    EQU   0                                                        06141000
CTGFVENT EQU   CTGFV+20                                                 06142000
VOLSTP26 EQU   0                                                        06143000
VOLLEN26 EQU   VOLSTP26                                                 06144000
VOLIST26 EQU   VOLSTP26+1                                               06145000
VOLIST   EQU   0                                                        06146000
VOLCNT   EQU   VOLIST                                                   06147000
VOLENT   EQU   VOLIST+2                                                 06148000
PRMLST27 EQU   0                                                        06149000
SRCHSEEK EQU   PRMLST27                                                 06150000
DSNAD27  EQU   PRMLST27+4                                               06151000
CHRAD27  EQU   DSNAD27                                                  06152000
VSERAD27 EQU   PRMLST27+8                                               06153000
VOLS27   EQU   0                                                        06154000
CCHHPARM EQU   0                                                        06155000
CCAHLEN  EQU   CCHHPARM                                                 06156000
CCHHR27  EQU   CCHHPARM+1                                               06157000
ERRPRM27 EQU   0                                                        06158000
PARMLS29 EQU   0                                                        06159000
DSNAD29  EQU   PARMLS29+4                                               06160000
VOLSTP29 EQU   0                                                        06161000
VOLLEN29 EQU   VOLSTP29                                                 06162000
VOLIST29 EQU   VOLSTP29+1                                               06163000
VLIST29  EQU   0                                                        06164000
VOLCNT29 EQU   VLIST29                                                  06165000
VOLENT29 EQU   VLIST29+2                                                06166000
PARMLS30 EQU   0                                                        06167000
DSNADO30 EQU   PARMLS30+4                                               06168000
DSNADN30 EQU   PARMLS30+8                                               06169000
VOLSTP30 EQU   0                                                        06170000
VOLLEN30 EQU   VOLSTP30                                                 06171000
VOLIST30 EQU   VOLSTP30+1                                               06172000
VLIST30  EQU   0                                                        06173000
VOLCNT30 EQU   VLIST30                                                  06174000
VOLENT30 EQU   VLIST30+2                                                06175000
WTORLSTA EQU   0                                                        06176000
WTORXTRA EQU   WTORLSTA                                                 06177000
RPLYLN   EQU   WTORXTRA                                                 06178000
REPLYLN  EQU   RPLYLN                                                   06179000
RMSGLEN  EQU   WTORLSTA+8                                               06180000
RMCSFLGS EQU   WTORLSTA+10                                              06181000
RRNDHERE EQU   RMCSFLGS                                                 06182000
WTORNDA  EQU   0                                                        06183000
WTOLSTA  EQU   0                                                        06184000
OMSGLEN  EQU   WTOLSTA                                                  06185000
OMCSFLGS EQU   WTOLSTA+2                                                06186000
ORNDHERE EQU   OMCSFLGS                                                 06187000
SUPLIST  EQU   0                                                        06188000
FLAGS    EQU   SUPLIST+20                                               06189000
LSTIND42 EQU   FLAGS                                                    06190000
PRMLEN42 EQU   0                                                        06191000
ADDRTCB  EQU   0                                                        06192000
TIMEROP  EQU   0                                                        06193000
TIME8BYT EQU   0                                                        06194000
TIME4BYT EQU   0                                                        06195000
PLSTA48  EQU   0                                                        06196000
FLAGS48  EQU   PLSTA48+4                                                06197000
MINL48   EQU   FLAGS48+1                                                06198000
MAJA48   EQU   PLSTA48+8                                                06199000
MINA48   EQU   PLSTA48+12                                               06200000
MAJOR    EQU   0                                                        06201000
MINOR    EQU   0                                                        06202000
MINL482  EQU   MINOR                                                    06203000
MINOR2   EQU   MINOR+1                                                  06204000
SVCDMPLS EQU   0                                                        06205000
SVCDMPID EQU   SVCDMPLS+8                                               06206000
LSTSNAP  EQU   0                                                        06207000
LSTSVCDP EQU   0                                                        06208000
PARML52  EQU   0                                                        06209000
LSTPRM71 EQU   0                                                        06210000
DCBAD71  EQU   LSTPRM71                                                 06211000
PARM73   EQU   0                                                        06212000
PRMLEN73 EQU   PARM73+2                                                 06213000
PRM14BYT EQU   0                                                        06214000
PLIST81  EQU   0                                                        06215000
@NM00470 EQU   PLIST81+10                                               06216000
PLLONG   EQU   @NM00470                                                 06217000
PLIST81A EQU   0                                                        06218000
PLIST82  EQU   0                                                        06219000
UCBAD82  EQU   PLIST82                                                  06220000
TYPIND82 EQU   UCBAD82                                                  06221000
VSERAD82 EQU   PLIST82+4                                                06222000
CCHH82   EQU   VSERAD82                                                 06223000
MBCHRA82 EQU   PLIST82+8                                                06224000
MBCCHH82 EQU   0                                                        06225000
VOLSER82 EQU   0                                                        06226000
ALTRK82  EQU   0                                                        06227000
CCHH82L  EQU   0                                                        06228000
CHLN82   EQU   CCHH82L                                                  06229000
CCHH8288 EQU   CCHH82L+1                                                06230000
PLIST86  EQU   0                                                        06231000
CCHHR86A EQU   PLIST86+4                                                06232000
CCH86    EQU   0                                                        06233000
PLIST96  EQU   0                                                        06234000
PLIST98  EQU   0                                                        06235000
PMLIST98 EQU   PLIST98                                                  06236000
DSNAD98  EQU   PLIST98+4                                                06237000
DSNLEN98 EQU   DSNAD98                                                  06238000
DSNME98  EQU   0                                                        06239000
PLIST99  EQU   0                                                        06240000
PREFIX99 EQU   PLIST99                                                  06241000
LNTH99   EQU   PREFIX99+1                                               06242000
AHLGREC  EQU   0                                                        06243000
AHLGLGTH EQU   AHLGREC                                                  06244000
AHLGRES  EQU   AHLGREC+2                                                06245000
AHLGAID  EQU   AHLGREC+4                                                06246000
AHLGFID  EQU   AHLGREC+5                                                06247000
AHLGTST  EQU   AHLGREC+6                                                06248000
AHLGEIDS EQU   AHLGTST                                                  06249000
AHLGEIDL EQU   AHLGREC+14                                               06250000
AHLSBLOK EQU   0                                                        06251000
I256C    EQU   0                                                        06252000
AHLSETD  EQU   0                                                        06253000
SEPL     EQU   0                                                        06254000
SEFG     EQU   SEPL                                                     06255000
SEEN     EQU   SEPL+2                                                   06256000
SENM     EQU   SEPL+4                                                   06257000
SEEL     EQU   SEPL+12                                                  06258000
SEMC     EQU   SEPL+20                                                  06259000
ACRADDR  EQU   0                                                        06260000
AHLSETEV EQU   0                                                        06261000
DDN99    EQU   0                                                        06262000
I001C    EQU   0                                                        06263000
I008P    EQU   0                                                        06264000
I015F    EQU   0                                                        06265000
I015P    EQU   0                                                        06266000
I031F    EQU   0                                                        06267000
I031P    EQU   0                                                        06268000
QMPA     EQU   0                                                        06269000
UCBBGN   EQU   0                                                        06270000
UCBPTR32 EQU   0                                                        06271000
CVTS01   EQU   CVTPGSIA                                                 06272000
CVTLPDIA EQU   CVTS01+12                                                06273000
CVTDIRST EQU   CVTLPDIA                                                 06274000
CVTSLIDA EQU   CVTS01+24                                                06275000
CVTCTLFG EQU   CVTS01+50                                                06276000
CVTSDBF  EQU   CVTS01+240                                               06277000
CVTRV210 EQU   CVTS01+424                                               06278000
CVTRV219 EQU   CVTS01+425                                               06279000
CVTRV228 EQU   CVTS01+426                                               06280000
CVTRV237 EQU   CVTS01+427                                               06281000
CVTMFRTR EQU   CVTS01+452                                               06282000
CVTRV262 EQU   CVTS01+468                                               06283000
CVTRV271 EQU   CVTS01+469                                               06284000
CVTRV280 EQU   CVTS01+470                                               06285000
CVTRV289 EQU   CVTS01+471                                               06286000
CVTGSDA  EQU   CVTS01+600                                               06287000
IOSATTSC EQU   IOSIPIB                                                  06288000
IOSWTOWA EQU   IOSIPIB                                                  06289000
IOSPCISC EQU   IOSIPIB                                                  06290000
UCBOBS01 EQU   UCBDEV                                                   06291000
UCBVOLI  EQU   UCBOBS01+4                                               06292000
UCBSTAB  EQU   UCBOBS01+10                                              06293000
UCBBSVL  EQU   UCBSTAB                                                  06294000
UCBPRSRS EQU   UCBSTAB                                                  06295000
UCBDMCT  EQU   UCBOBS01+11                                              06296000
UCBFL4   EQU   UCBOBS01+13                                              06297000
UCBOBS02 EQU   UCBDEV                                                   06298000
UCBTFL1  EQU   UCBOBS02+19                                              06299000
UCBXTN   EQU   UCBOBS02+20                                              06300000
UCBVOPT  EQU   UCBXTN                                                   06301000
UCBOBS03 EQU   UCBDEV                                                   06302000
UCBXTADR EQU   UCBOBS03                                                 06303000
UCBOBS04 EQU   UCBDEV                                                   06304000
UCBBTA   EQU   UCBOBS04+12                                              06305000
UCBOBS06 EQU   UCBDEV                                                   06306000
UCBAOF   EQU   UCBOBS06                                                 06307000
UCBAOF1  EQU   UCBAOF                                                   06308000
UCBAOF2  EQU   UCBAOF+1                                                 06309000
@NM00020 EQU   UCBOBS06+3                                               06310000
UCBIRB   EQU   UCBOBS06+4                                               06311000
UCBGRAF  EQU   UCBIRB                                                   06312000
UCBLDNCA EQU   UCBOBS06+8                                               06313000
UCBRDYQ  EQU   UCBLDNCA                                                 06314000
UCBIRLN  EQU   UCBRDYQ                                                  06315000
UCBLDNCB EQU   UCBRDYQ+1                                                06316000
UCBCTLNK EQU   UCBOBS06+12                                              06317000
UCBOBS07 EQU   UCBDEV                                                   06318000
UCBOBS08 EQU   UCBDEV                                                   06319000
UCBCTCAD EQU   UCBOBS08                                                 06320000
UCBCTCF1 EQU   UCBOBS08+4                                               06321000
UCBOBS09 EQU   UCBDEV                                                   06322000
DEBBAS02 EQU   DEBBASND                                                 06323000
DEBDDS1  EQU   DEBBAS02                                                 06324000
DEBSUCBA EQU   DEBDDS1                                                  06325000
DEBDEVED EQU   DEBDDS1+4                                                06326000
DEBRDCB  EQU   DEBDDS1+4                                                06327000
DEBPDCB  EQU   DEBDDS1+8                                                06328000
DEBWDCB  EQU   DEBDDS1+12                                               06329000
DEBACS09 EQU   DEBDEVED                                                 06330000
DEBASC09 EQU   DEBACS09                                                 06331000
DEBEAMFG EQU   DEBASC09+3                                               06332000
DEBDSID  EQU   DEBASC09+4                                               06333000
DEBEOD   EQU   DEBASC09+12                                              06334000
DEBBOE   EQU   DEBEOD                                                   06335000
DEBEODRV EQU   DEBBOE                                                   06336000
DEBEODTT EQU   DEBBOE+1                                                 06337000
DEBEOD0  EQU   DEBBOE+2                                                 06338000
DEBEODSS EQU   DEBBOE+3                                                 06339000
DEBBAS01 EQU   DEBBASND                                                 06340000
DEBISAM  EQU   DEBBAS01                                                 06341000
DEBFIEAD EQU   DEBISAM                                                  06342000
DEBFPEAD EQU   DEBISAM+4                                                06343000
DEBFOEAD EQU   DEBISAM+8                                                06344000
DEBEXPT  EQU   DEBISAM+12                                               06345000
DEBRPSID EQU   DEBEXPT                                                  06346000
IOBORG01 EQU   IOBPREFX+8                                               06347000
IOBNIOBA EQU   IOBORG01                                                 06348000
IOBNFLG1 EQU   IOBNIOBA                                                 06349000
IOBPRTOV EQU   IOBNFLG1                                                 06350000
IOBORG02 EQU   IOBPREFX+8                                               06351000
IOBDQADA EQU   IOBORG02                                                 06352000
IOBDEQIN EQU   IOBDQADA                                                 06353000
IOBORG03 EQU   IOBPREFX+12                                              06354000
IOBORG04 EQU   IOBINCAM                                                 06355000
IOBORG12 EQU   IOBINCAM                                                 06356000
IOBFL4   EQU   IOBORG12                                                 06357000
IOBEXTEN EQU   IOBSTDRD+32                                              06358000
IOBSEEK  EQU   IOBEXTEN                                                 06359000
IOBBB    EQU   IOBSEEK+1                                                06360000
IOBCC    EQU   IOBSEEK+3                                                06361000
IOBHH    EQU   IOBSEEK+5                                                06362000
IOBORG05 EQU   IOBEXTEN                                                 06363000
IOBERINF EQU   IOBORG05+16                                              06364000
IOBORG06 EQU   IOBEXTEN                                                 06365000
IOBNXTPT EQU   IOBORG06+4                                               06366000
IOBSTATA EQU   IOBNXTPT                                                 06367000
IOBORG07 EQU   IOBEXTEN+8                                               06368000
W1IEXTEN EQU   IOBORG07                                                 06369000
IOBORG08 EQU   IOBEXTEN+8                                               06370000
IOBINDCT EQU   IOBORG08+4                                               06371000
IOBUNSQR EQU   IOBORG08+5                                               06372000
IOBFCHAD EQU   IOBORG08+8                                               06373000
IOBORG09 EQU   IOBEXTEN+8                                               06374000
IOBDPLAD EQU   IOBORG09+4                                               06375000
IOBDTYPE EQU   IOBORG09+8                                               06376000
IOBDTYP2 EQU   IOBORG09+9                                               06377000
IOBDSTAT EQU   IOBORG09+10                                              06378000
IOBSTAT1 EQU   IOBDSTAT                                                 06379000
IOBORG10 EQU   IOBEXTEN+8                                               06380000
IOBSEEK2 EQU   IOBORG10                                                 06381000
IOBORG11 EQU   IOBEXTEN                                                 06382000
IOBERCT  EQU   IOBORG11                                                 06383000
IOBUCBXV EQU   IOBERCT                                                  06384000
IOBNAME  EQU   IOBORG11+4                                               06385000
IOBORG13 EQU   IOBEXTEN                                                 06386000
IOBSKADR EQU   IOBORG13                                                 06387000
DECBS05  EQU   DECNEXT                                                  06388000
PSARSVTE EQU   PSARSVT                                                  06389000
RBSECS03 EQU   RBEP                                                     06390000
RBCDE    EQU   RBSECS03                                                 06391000
RBCDFLGS EQU   RBCDE                                                    06392000
RBCDE1   EQU   RBCDE+1                                                  06393000
RBSECS05 EQU   RBPGMQ                                                   06394000
RBSQE    EQU   RBSECS05                                                 06395000
RBSECS06 EQU   RBPGMQ                                                   06396000
RBIQE    EQU   RBSECS06                                                 06397000
RBSECS07 EQU   RBPGMQ                                                   06398000
RBIQE2   EQU   RBSECS07                                                 06399000
RBSECS08 EQU   IRBEND                                                   06400000
RBSECS09 EQU   IRBEND                                                   06401000
TCBPTR   EQU   PSATOLD                                                  06402000
WORKAREA EQU   MCAWORK                                                  06403000
MCQESAV  EQU   WORKAREA                                                 06404000
SDWASAV  EQU   WORKAREA+4                                               06405000
RETSAV1  EQU   WORKAREA+8                                               06406000
RETSAV2  EQU   WORKAREA+12                                              06407000
WTOPARML EQU   WORKAREA+16                                              06408000
WTODIND  EQU   WTOPARML+14                                              06409000
SCKPTR   EQU   WORKAREA+32                                              06410000
SCKLEN   EQU   WORKAREA+36                                              06411000
RETSAV3  EQU   WORKAREA+40                                              06412000
RETSAV4  EQU   WORKAREA+44                                              06413000
POPSW    EQU   FLCPOPSW                                                 06414000
REGSLCCA EQU   LCCAPGR2                                                 06415000
R0R1LCCA EQU   REGSLCCA                                                 06416000
REG0LCCA EQU   R0R1LCCA                                                 06417000
REG1LCCA EQU   R0R1LCCA+4                                               06418000
R1LCCATS EQU   REG1LCCA                                                 06419000
REGDLCCA EQU   REGSLCCA+52                                              06420000
REGFLCCA EQU   REGSLCCA+60                                              06421000
MCRREGS  EQU   MCROUTSA                                                 06422000
MCRREG0  EQU   MCRREGS                                                  06423000
SVCREC   EQU   MCAREC                                                   06424000
BASICREC EQU   SVCREC                                                   06425000
SVCASCB  EQU   BASICREC                                                 06426000
SVCCPUID EQU   BASICREC+4                                               06427000
SVCJBNM  EQU   BASICREC+6                                               06428000
SVCPSW   EQU   BASICREC+14                                              06429000
SVCINTCD EQU   SVCPSW+2                                                 06430000
SVCTCB   EQU   BASICREC+22                                              06431000
SVCRBNAM EQU   BASICREC+26                                              06432000
SVCDOLY  EQU   SVCRBNAM                                                 06433000
SVCEXTO  EQU   SVCDOLY                                                  06434000
SVCREGS  EQU   BASICREC+34                                              06435000
SVCR15   EQU   SVCREGS                                                  06436000
SVCR0R1  EQU   SVCREGS+4                                                06437000
SVCR0    EQU   SVCR0R1                                                  06438000
SVCADDL  EQU   SVCREC+46                                                06439000
ERRASCB  EQU   MCAREC                                                   06440000
DDNAME   EQU   SVCADDL                                                  06441000
SVCNO    EQU   FLCSVCN+1                                                06442000
RBEXTCK  EQU   RBEXRTNM                                                 06443000
SVC0REC  EQU   SVCADDL                                                  06444000
DDNAME0  EQU   SVC0REC                                                  06445000
DCBAD0   EQU   SVC0REC+8                                                06446000
DEBAD0   EQU   SVC0REC+12                                               06447000
SV6PRM   EQU   SVCADDL                                                  06448000
EPDENM6  EQU   SV6PRM                                                   06449000
SVLST6   EQU   SV6PRM+8                                                 06450000
EPDENMA6 EQU   SVLST6+1                                                 06451000
SV7PRM   EQU   SVCADDL                                                  06452000
EPDENM7  EQU   SV7PRM                                                   06453000
SVLST7   EQU   SV7PRM+8                                                 06454000
EPDENMA7 EQU   SVLST7+1                                                 06455000
PICA14   EQU   SVCADDL                                                  06456000
PARM15   EQU   SVCADDL                                                  06457000
DDNAME15 EQU   PARM15                                                   06458000
ERRF15   EQU   PARM15+8                                                 06459000
TCBA15   EQU   PARM15+9                                                 06460000
CUU15    EQU   PARM15+13                                                06461000
PARM16   EQU   SVCADDL                                                  06462000
DDNDCB16 EQU   PARM16                                                   06463000
DDNM16   EQU   DDNDCB16                                                 06464000
DCBAD16  EQU   DDNDCB16+8                                               06465000
PLIST16  EQU   PARM16+12                                                06466000
SVC25REC EQU   SVCADDL                                                  06467000
DCBFDA25 EQU   SVC25REC+8                                               06468000
DCBTRB25 EQU   SVC25REC+16                                              06469000
PARM27   EQU   SVCADDL                                                  06470000
PLIST27  EQU   PARM27                                                   06471000
VOLSER27 EQU   PARM27+16                                                06472000
CUU32    EQU   SVCADDL                                                  06473000
CUU33    EQU   SVCADDL                                                  06474000
PARM52   EQU   SVCADDL                                                  06475000
ERINF66  EQU   SVCADDL                                                  06476000
RECORD86 EQU   SVCADDL                                                  06477000
PRMLST86 EQU   RECORD86                                                 06478000
CCHHR86  EQU   RECORD86+8                                               06479000
RECORD88 EQU   SVCADDL                                                  06480000
DEBAD88  EQU   RECORD88                                                 06481000
ADD88    EQU   RECORD88+4                                               06482000
DSSTAT88 EQU   ADD88                                                    06483000
DEVMOD88 EQU   ADD88+1                                                  06484000
PARM2    EQU   SVCADDL                                                  06485000
PLEN2    EQU   PARM2                                                    06486000
PLIST2   EQU   PARM2+1                                                  06487000
SVC4PARM EQU   SVCADDL                                                  06488000
LEN4     EQU   SVC4PARM                                                 06489000
PARM4    EQU   SVC4PARM+1                                               06490000
EPNM8    EQU   SVCADDL                                                  06491000
TCBCC13  EQU   SVCADDL                                                  06492000
PARM17   EQU   SVCADDL                                                  06493000
PLEN17   EQU   PARM17                                                   06494000
PLST17   EQU   PARM17+1                                                 06495000
REC18    EQU   SVCADDL                                                  06496000
LEN18    EQU   REC18                                                    06497000
PARM18   EQU   REC18+1                                                  06498000
REC18A   EQU   SVCADDL                                                  06499000
LEN18A   EQU   REC18A                                                   06500000
FINDPARM EQU   REC18A+1                                                 06501000
SVC21PRM EQU   SVCADDL                                                  06502000
DDN21    EQU   SVC21PRM                                                 06503000
PRMLEN21 EQU   SVC21PRM+8                                               06504000
PARM21   EQU   SVC21PRM+9                                               06505000
NAME21A  EQU   PARM21                                                   06506000
NAME21B  EQU   NAME21A                                                  06507000
NAME21C  EQU   NAME21B                                                  06508000
REC26    EQU   SVCADDL                                                  06509000
PLEN26   EQU   REC26                                                    06510000
PARM26VS EQU   REC26+1                                                  06511000
PARM26S  EQU   PARM26VS                                                 06512000
VOLSTA26 EQU   PARM26S+12                                               06513000
LEN26    EQU   REC26+21                                                 06514000
DSN26    EQU   REC26+22                                                 06515000
CINUM    EQU   DSN26                                                    06516000
PARM28   EQU   SVCADDL                                                  06517000
REC29    EQU   SVCADDL                                                  06518000
PARM29   EQU   REC29                                                    06519000
VOLSTA29 EQU   PARM29+12                                                06520000
LEN29    EQU   REC29+16                                                 06521000
REC30    EQU   SVCADDL                                                  06522000
PARM30   EQU   REC30                                                    06523000
VOLSTA30 EQU   PARM30+12                                                06524000
LEN30    EQU   REC30+16                                                 06525000
WTORPARM EQU   SVCADDL                                                  06526000
WTORLEN  EQU   WTORPARM                                                 06527000
WTORLIST EQU   WTORPARM+1                                               06528000
WTORRND  EQU   WTORPARM+21                                              06529000
WTOPARM  EQU   SVCADDL                                                  06530000
WTOLEN   EQU   WTOPARM                                                  06531000
WTOLIST  EQU   WTOPARM+1                                                06532000
WTORND   EQU   WTOPARM+13                                               06533000
REC42    EQU   SVCADDL                                                  06534000
SUPLEN42 EQU   REC42                                                    06535000
SUPLST42 EQU   REC42+1                                                  06536000
SUPMVT   EQU   SUPLST42                                                 06537000
TCBAD44  EQU   SVCADDL                                                  06538000
PARM47   EQU   SVCADDL                                                  06539000
LEN47    EQU   PARM47                                                   06540000
PRM8BYT  EQU   PARM47+1                                                 06541000
PARM47A  EQU   SVCADDL                                                  06542000
LEN47A   EQU   PARM47A                                                  06543000
PRM4BYT  EQU   PARM47A+1                                                06544000
SV48PARM EQU   SVCADDL                                                  06545000
LST48A   EQU   SV48PARM                                                 06546000
PLST48   EQU   LST48A                                                   06547000
MAJ48    EQU   LST48A+20                                                06548000
MINLEN48 EQU   SV48PARM+28                                              06549000
MIN48    EQU   SV48PARM+29                                              06550000
PARM51A  EQU   SVCADDL                                                  06551000
LEN51A   EQU   PARM51A                                                  06552000
LIST51A  EQU   PARM51A+1                                                06553000
PARM51B  EQU   SVCADDL                                                  06554000
LEN51B   EQU   PARM51B                                                  06555000
LIST51B  EQU   PARM51B+1                                                06556000
PARM71   EQU   SVCADDL                                                  06557000
DDNAME71 EQU   PARM71                                                   06558000
PRMLST71 EQU   PARM71+8                                                 06559000
RECORD73 EQU   SVCADDL                                                  06560000
LEN73    EQU   RECORD73                                                 06561000
PRMLST73 EQU   RECORD73+1                                               06562000
PARM77   EQU   SVCADDL                                                  06563000
LEN77    EQU   PARM77                                                   06564000
PRMLST77 EQU   PARM77+1                                                 06565000
RECORD81 EQU   SVCADDL                                                  06566000
DDN81    EQU   RECORD81                                                 06567000
PRMLST81 EQU   RECORD81+8                                               06568000
DCBAD81  EQU   PRMLST81                                                 06569000
RECRD81A EQU   SVCADDL                                                  06570000
PRMLT81A EQU   RECRD81A+8                                               06571000
REC828F  EQU   SVCADDL                                                  06572000
VS8F     EQU   REC828F                                                  06573000
CCPL8F   EQU   REC828F+6                                                06574000
PLLN8F   EQU   CCPL8F                                                   06575000
PL8F     EQU   CCPL8F+1                                                 06576000
CHLEN8F  EQU   CCPL8F+9                                                 06577000
REC821F  EQU   SVCADDL                                                  06578000
PLST1F   EQU   REC821F+6                                                06579000
PLLN1F   EQU   PLST1F                                                   06580000
PL1F     EQU   PLST1F+1                                                 06581000
CC1F     EQU   REC821F+15                                               06582000
CHLN1F   EQU   CC1F                                                     06583000
CCHH1F   EQU   CC1F+1                                                   06584000
REC8200  EQU   SVCADDL                                                  06585000
VS00     EQU   REC8200                                                  06586000
PLST00   EQU   REC8200+6                                                06587000
PLLN00   EQU   PLST00                                                   06588000
PL00     EQU   PLST00+1                                                 06589000
CC00     EQU   REC8200+19                                               06590000
CHLN00   EQU   CC00                                                     06591000
CCHH00   EQU   CC00+1                                                   06592000
REC8288  EQU   SVCADDL                                                  06593000
VS88     EQU   REC8288                                                  06594000
PLLN88   EQU   REC8288+6                                                06595000
PL88     EQU   REC8288+7                                                06596000
PL08     EQU   PL88                                                     06597000
ERREC82  EQU   SVCADDL                                                  06598000
RECORD90 EQU   SVCADDL                                                  06599000
RECORD96 EQU   SVCADDL                                                  06600000
LEN96    EQU   RECORD96                                                 06601000
PRMLST96 EQU   RECORD96+1                                               06602000
RECORD98 EQU   SVCADDL                                                  06603000
PRMLST98 EQU   RECORD98                                                 06604000
PRMERR98 EQU   RECORD98+4                                               06605000
LEN98    EQU   PRMERR98                                                 06606000
DSN98    EQU   RECORD98+5                                               06607000
RECORD99 EQU   SVCADDL                                                  06608000
LEN99    EQU   RECORD99                                                 06609000
PRMLST99 EQU   RECORD99+1                                               06610000
DDN31    EQU   SVCADDL                                                  06611000
FLC      EQU   PSA                                                      06612000
REXNTEST EQU   SDWAREXN                                                 06613000
SDMPBIT  EQU   CVTSDBF                                                  06614000
USERKEY  EQU   FLCSOPSW+1                                               06615000
*                                      START UNREFERENCED COMPONENTS    06616000
QMPA90   EQU   RECORD90+1                                               06617000
LEN90    EQU   RECORD90                                                 06618000
VS1F     EQU   REC821F                                                  06619000
@NM00472 EQU   RECRD81A                                                 06620000
PPLST42  EQU   REC42+62                                                 06621000
PPLEN42  EQU   REC42+61                                                 06622000
DSN30    EQU   REC30+17                                                 06623000
@NM00457 EQU   PARM30                                                   06624000
DSN29    EQU   REC29+17                                                 06625000
@NM00454 EQU   PARM29                                                   06626000
VOLST26  EQU   REC26+67                                                 06627000
VOLEN26  EQU   REC26+66                                                 06628000
@NM00444 EQU   PARM26S                                                  06629000
DDN25    EQU   SVC25REC                                                 06630000
@NM00436 EQU   SVLST7                                                   06631000
@NM00435 EQU   SVLST6                                                   06632000
SVCR1    EQU   SVCR0R1+4                                                06633000
@NM00193 EQU   SVCPSW                                                   06634000
MCRREG1  EQU   MCRREGS+4                                                06635000
REGELCCA EQU   REGSLCCA+56                                              06636000
REGCLCCA EQU   REGSLCCA+48                                              06637000
REGBLCCA EQU   REGSLCCA+44                                              06638000
@NM00191 EQU   REGSLCCA+12                                              06639000
REG2LCCA EQU   REGSLCCA+8                                               06640000
PSWADDR  EQU   POPSW+4                                                  06641000
@NM00190 EQU   POPSW+2                                                  06642000
KEYCMWP  EQU   POPSW+1                                                  06643000
@NM00189 EQU   POPSW                                                    06644000
@NM00188 EQU   WTOPARML                                                 06645000
RBRSV161 EQU   RBSECS09+64                                              06646000
RBSIRBWA EQU   RBSECS09                                                 06647000
RBIQEWRK EQU   RBSECS08+4                                               06648000
RBNEXAV  EQU   RBSECS08                                                 06649000
RBIQEA   EQU   RBIQE2                                                   06650000
RBIQE1   EQU   RBIQE+1                                                  06651000
RBUSE    EQU   RBIQE                                                    06652000
RBSQEA   EQU   RBSQE+1                                                  06653000
@NM00171 EQU   RBSQE                                                    06654000
RBCDLOAD EQU   RBCDFLGS                                                 06655000
RBCDXCTL EQU   RBCDFLGS                                                 06656000
RBCDSYNC EQU   RBCDFLGS                                                 06657000
RBCDNODE EQU   RBCDFLGS                                                 06658000
RBCDSAVE EQU   RBCDFLGS                                                 06659000
RBCDATCH EQU   RBCDFLGS                                                 06660000
RBRSV009 EQU   RBCDFLGS                                                 06661000
RBNOCELL EQU   RBCDFLGS                                                 06662000
PSARSAV  EQU   PSARSVTE+60                                              06663000
PSARSTK  EQU   PSARSVTE+56                                              06664000
PSAESAV3 EQU   PSARSVTE+52                                              06665000
PSAESTK3 EQU   PSARSVTE+48                                              06666000
PSAESAV2 EQU   PSARSVTE+44                                              06667000
PSAESTK2 EQU   PSARSVTE+40                                              06668000
PSAESAV1 EQU   PSARSVTE+36                                              06669000
PSAESTK1 EQU   PSARSVTE+32                                              06670000
PSAPSAV  EQU   PSARSVTE+28                                              06671000
PSAPSTK  EQU   PSARSVTE+24                                              06672000
PSAMSAV  EQU   PSARSVTE+20                                              06673000
PSAMSTK  EQU   PSARSVTE+16                                              06674000
PSASSAV  EQU   PSARSVTE+12                                              06675000
PSASSTK  EQU   PSARSVTE+8                                               06676000
PSANSTK  EQU   PSARSVTE+4                                               06677000
PSACSTK  EQU   PSARSVTE                                                 06678000
DECBLFMT EQU   DECBS05+8                                                06679000
DECBLNNM EQU   DECBS05+4                                                06680000
DECBHDRA EQU   DECBS05                                                  06681000
IOBSKSS  EQU   IOBSKADR+3                                               06682000
IOBSK0   EQU   IOBSKADR+2                                               06683000
IOBSKTT  EQU   IOBSKADR+1                                               06684000
IOBSKRV  EQU   IOBSKADR                                                 06685000
IOBCSWSV EQU   IOBORG11+17                                              06686000
IOBSENSV EQU   IOBORG11+16                                              06687000
IOBRCD   EQU   IOBORG11+12                                              06688000
IOBMDREC EQU   IOBORG11+8                                               06689000
IOBNAMEA EQU   IOBNAME+1                                                06690000
IOBNAMSZ EQU   IOBNAME                                                  06691000
IOBERCTA EQU   IOBERCT+1                                                06692000
IOBRTYPE EQU   IOBUCBXV                                                 06693000
IOBRDCHP EQU   IOBORG10+20                                              06694000
IOBNEXTA EQU   IOBORG10+16                                              06695000
IOBREADA EQU   IOBORG10+12                                              06696000
IOBBUFC  EQU   IOBORG10+8                                               06697000
IOBSK2R  EQU   IOBSEEK2+7                                               06698000
IOBSK2HH EQU   IOBSEEK2+5                                               06699000
IOBSK2CC EQU   IOBSEEK2+3                                               06700000
IOBSK2BB EQU   IOBSEEK2+1                                               06701000
IOBSK2M  EQU   IOBSEEK2                                                 06702000
IOBCHNPR EQU   IOBORG09+40                                              06703000
IOBDNCRF EQU   IOBORG09+32                                              06704000
IOBRSV35 EQU   IOBORG09+24                                              06705000
IOBDQPTR EQU   IOBORG09+20                                              06706000
IOBRSV34 EQU   IOBORG09+18                                              06707000
IOBDBYTN EQU   IOBORG09+16                                              06708000
IOBDCPND EQU   IOBORG09+12                                              06709000
IOBSTAT2 EQU   IOBDSTAT+1                                               06710000
IOBSIORT EQU   IOBSTAT1                                                 06711000
IOBADDVU EQU   IOBSTAT1                                                 06712000
IOBBUFF  EQU   IOBSTAT1                                                 06713000
IOBENQUE EQU   IOBSTAT1                                                 06714000
IOBPASS2 EQU   IOBSTAT1                                                 06715000
IOBSYNCH EQU   IOBSTAT1                                                 06716000
IOBNEWVL EQU   IOBSTAT1                                                 06717000
IOBABNRM EQU   IOBSTAT1                                                 06718000
IOBRELEX EQU   IOBDTYP2                                                 06719000
IOBADDTY EQU   IOBDTYP2                                                 06720000
IOBTYPE  EQU   IOBDTYP2                                                 06721000
IOBRQUST EQU   IOBDTYP2                                                 06722000
IOBSUFFX EQU   IOBDTYP2                                                 06723000
IOBSBLKL EQU   IOBDTYP2                                                 06724000
IOBSKEY  EQU   IOBDTYP2                                                 06725000
IOBRELBL EQU   IOBDTYPE                                                 06726000
IOBRDEXC EQU   IOBDTYPE                                                 06727000
IOBDYNBF EQU   IOBDTYPE                                                 06728000
IOBACTAD EQU   IOBDTYPE                                                 06729000
IOBFDBCK EQU   IOBDTYPE                                                 06730000
IOBEXTSC EQU   IOBDTYPE                                                 06731000
IOBOVFLO EQU   IOBDTYPE                                                 06732000
IOBVERFY EQU   IOBDTYPE                                                 06733000
IOBDPLB  EQU   IOBDPLAD+1                                               06734000
IOBDAYLI EQU   IOBDPLAD                                                 06735000
IOBDIOBS EQU   IOBORG09+2                                               06736000
IOBDBYTR EQU   IOBORG09                                                 06737000
IOBBCHAD EQU   IOBORG08+12                                              06738000
IOBFCHNB EQU   IOBFCHAD+1                                               06739000
IOBCOUNT EQU   IOBFCHAD                                                 06740000
IOBASYN  EQU   IOBORG08+7                                               06741000
IOBAPP   EQU   IOBORG08+6                                               06742000
IOBRSV32 EQU   IOBUNSQR                                                 06743000
IOBRSV31 EQU   IOBUNSQR                                                 06744000
IOBRSV30 EQU   IOBUNSQR                                                 06745000
IOBKNRWR EQU   IOBUNSQR                                                 06746000
IOBKNWR  EQU   IOBUNSQR                                                 06747000
IOBNTAV2 EQU   IOBUNSQR                                                 06748000
IOBNTAV1 EQU   IOBUNSQR                                                 06749000
IOBCPBSY EQU   IOBUNSQR                                                 06750000
IOBCHNNL EQU   IOBINDCT                                                 06751000
IOBRSV29 EQU   IOBINDCT                                                 06752000
IOBRSV28 EQU   IOBINDCT                                                 06753000
IOBRSV27 EQU   IOBINDCT                                                 06754000
IOBKEYAD EQU   IOBINDCT                                                 06755000
IOBOVPTR EQU   IOBINDCT                                                 06756000
IOBUNSCH EQU   IOBINDCT                                                 06757000
IOBDEQCP EQU   IOBINDCT                                                 06758000
IOBCCWAD EQU   IOBORG08                                                 06759000
W1OEXTEN EQU   W1IEXTEN                                                 06760000
IOBCCW   EQU   IOBORG06+8                                               06761000
IOBNXTPB EQU   IOBNXTPT+1                                               06762000
IOBRSV26 EQU   IOBSTATA                                                 06763000
IOBRSV25 EQU   IOBSTATA                                                 06764000
IOBRSV24 EQU   IOBSTATA                                                 06765000
IOBRSV23 EQU   IOBSTATA                                                 06766000
IOBRSV22 EQU   IOBSTATA                                                 06767000
IOBRSV21 EQU   IOBSTATA                                                 06768000
IOBRSV20 EQU   IOBSTATA                                                 06769000
IOBAVLFL EQU   IOBSTATA                                                 06770000
IOBRSV37 EQU   IOBORG06+1                                               06771000
IOBUCBXG EQU   IOBORG06                                                 06772000
IOBCPA   EQU   IOBORG05+32                                              06773000
IOBERCCW EQU   IOBORG05+8                                               06774000
IOBSNDPT EQU   IOBORG05+7                                               06775000
IOBRCVPT EQU   IOBORG05+6                                               06776000
IOBWORK  EQU   IOBORG05+1                                               06777000
IOBUCBX  EQU   IOBORG05                                                 06778000
IOBR     EQU   IOBSEEK+7                                                06779000
IOBHH2   EQU   IOBHH+1                                                  06780000
IOBHH1   EQU   IOBHH                                                    06781000
IOBCC2   EQU   IOBCC+1                                                  06782000
IOBCC1   EQU   IOBCC                                                    06783000
IOBBB2   EQU   IOBBB+1                                                  06784000
IOBBB1   EQU   IOBBB                                                    06785000
IOBM     EQU   IOBSEEK                                                  06786000
IOBRSV46 EQU   IOBFL4                                                   06787000
IOBRSV47 EQU   IOBFL4                                                   06788000
IOBENT   EQU   IOBFL4                                                   06789000
IOBEQP   EQU   IOBFL4                                                   06790000
IOBBUS   EQU   IOBFL4                                                   06791000
IOBDCK   EQU   IOBFL4                                                   06792000
IOBREJ   EQU   IOBFL4                                                   06793000
IOBOVR   EQU   IOBFL4                                                   06794000
IOBCRILC EQU   IOBORG04+1                                               06795000
IOBCRDCC EQU   IOBORG04                                                 06796000
IOBGQECB EQU   IOBORG03                                                 06797000
IOBSWAP  EQU   IOBORG02+4                                               06798000
IOBDQADB EQU   IOBDQADA+1                                               06799000
IOBRSV13 EQU   IOBDEQIN                                                 06800000
IOBRSV12 EQU   IOBDEQIN                                                 06801000
IOBRSV11 EQU   IOBDEQIN                                                 06802000
IOBRSV10 EQU   IOBDEQIN                                                 06803000
IOBRSV09 EQU   IOBDEQIN                                                 06804000
IOBRSV08 EQU   IOBDEQIN                                                 06805000
IOBRSV07 EQU   IOBDEQIN                                                 06806000
IOBDEQ   EQU   IOBDEQIN                                                 06807000
IOBNECB  EQU   IOBORG01+4                                               06808000
IOBNIOBB EQU   IOBNIOBA+1                                               06809000
IOBFIRST EQU   IOBNFLG1                                                 06810000
IOBUPERR EQU   IOBNFLG1                                                 06811000
IOBSPAN  EQU   IOBNFLG1                                                 06812000
IOBBKSPC EQU   IOBNFLG1                                                 06813000
IOBUPDAT EQU   IOBNFLG1                                                 06814000
IOBREAD  EQU   IOBNFLG1                                                 06815000
IOBWRITE EQU   IOBNFLG1                                                 06816000
IOBSEGMT EQU   IOBPRTOV                                                 06817000
DEBEXPTA EQU   DEBEXPT+1                                                06818000
DEBRSV12 EQU   DEBRPSID                                                 06819000
DEBRSV11 EQU   DEBRPSID                                                 06820000
DEBRSV10 EQU   DEBRPSID                                                 06821000
DEBRSV09 EQU   DEBRPSID                                                 06822000
DEBRPSAP EQU   DEBRPSID                                                 06823000
DEBRPSO  EQU   DEBRPSID                                                 06824000
DEBRPSI  EQU   DEBRPSID                                                 06825000
DEBRPSP  EQU   DEBRPSID                                                 06826000
DEBFOEB  EQU   DEBFOEAD+1                                               06827000
DEBNOEE  EQU   DEBFOEAD                                                 06828000
DEBFPEB  EQU   DEBFPEAD+1                                               06829000
DEBNPEE  EQU   DEBFPEAD                                                 06830000
DEBFIEB  EQU   DEBFIEAD+1                                               06831000
DEBNIEE  EQU   DEBFIEAD                                                 06832000
DEBBOESS EQU   DEBEODSS                                                 06833000
DEBBOE0  EQU   DEBEOD0                                                  06834000
DEBBOETT EQU   DEBEODTT                                                 06835000
DEBBOERV EQU   DEBEODRV                                                 06836000
DEBRV008 EQU   DEBDSID+7                                                06837000
DEBWTPTI EQU   DEBDSID+6                                                06838000
DEBEXDTE EQU   DEBDSID                                                  06839000
DEBRV007 EQU   DEBEAMFG                                                 06840000
DEBRV006 EQU   DEBEAMFG                                                 06841000
DEBRV005 EQU   DEBEAMFG                                                 06842000
DEBRV004 EQU   DEBEAMFG                                                 06843000
DEBSECVL EQU   DEBEAMFG                                                 06844000
DEBVAMSG EQU   DEBEAMFG                                                 06845000
DEBDSOPN EQU   DEBEAMFG                                                 06846000
DEBMULTI EQU   DEBEAMFG                                                 06847000
DEBVSEQU EQU   DEBASC09+2                                               06848000
DEBDSSQL EQU   DEBASC09+1                                               06849000
DEBVOLAC EQU   DEBASC09                                                 06850000
DEBWDCBA EQU   DEBWDCB+1                                                06851000
DEBRSV08 EQU   DEBWDCB                                                  06852000
DEBPDCBA EQU   DEBPDCB+1                                                06853000
DEBRSV07 EQU   DEBPDCB                                                  06854000
DEBRDCBA EQU   DEBRDCB+1                                                06855000
DEBRSV06 EQU   DEBRDCB                                                  06856000
DEBSUCBB EQU   DEBSUCBA+1                                               06857000
DEBSDVM  EQU   DEBSUCBA                                                 06858000
UCBRV066 EQU   UCBOBS09+4                                               06859000
UCBIOSBA EQU   UCBOBS09                                                 06860000
UCBRV042 EQU   UCBOBS08+5                                               06861000
UCBRV082 EQU   UCBCTCF1                                                 06862000
UCBRV081 EQU   UCBCTCF1                                                 06863000
UCBRV080 EQU   UCBCTCF1                                                 06864000
UCBRV079 EQU   UCBCTCF1                                                 06865000
UCBRV078 EQU   UCBCTCF1                                                 06866000
UCBRV077 EQU   UCBCTCF1                                                 06867000
UCBRV076 EQU   UCBCTCF1                                                 06868000
UCBCTC80 EQU   UCBCTCF1                                                 06869000
UCBCTCAL EQU   UCBCTCAD                                                 06870000
UCBICNCB EQU   UCBOBS07+4                                               06871000
UCBRV040 EQU   UCBOBS07                                                 06872000
UCBCTLNA EQU   UCBCTLNK+1                                               06873000
UCBRLN   EQU   UCBCTLNK                                                 06874000
UCBRDYQA EQU   UCBLDNCB                                                 06875000
UCBINRLN EQU   UCBIRLN                                                  06876000
UCBIRBA  EQU   UCBIRB+1                                                 06877000
UCBRV039 EQU   UCBGRAF                                                  06878000
UCBDWNR  EQU   UCBGRAF                                                  06879000
UCBRPND  EQU   UCBGRAF                                                  06880000
UCBUPM   EQU   UCBGRAF                                                  06881000
UCBBTAM  EQU   UCBGRAF                                                  06882000
UCBDRNO  EQU   UCBGRAF                                                  06883000
UCBDRO   EQU   UCBGRAF                                                  06884000
UCBOIP   EQU   UCBGRAF                                                  06885000
UCBATRCD EQU   @NM00020                                                 06886000
UCBSKPFG EQU   @NM00020                                                 06887000
UCBRIPND EQU   @NM00020                                                 06888000
UCBRTIAC EQU   @NM00020                                                 06889000
UCBRSV79 EQU   @NM00020                                                 06890000
UCBRSV78 EQU   @NM00020                                                 06891000
UCBRSV77 EQU   @NM00020                                                 06892000
UCBOLTEP EQU   @NM00020                                                 06893000
UCBATNCT EQU   UCBOBS06+2                                               06894000
UCBRSV76 EQU   UCBAOF2                                                  06895000
UCBRSV75 EQU   UCBAOF2                                                  06896000
UCBRSV74 EQU   UCBAOF2                                                  06897000
UCBRSV73 EQU   UCBAOF2                                                  06898000
UCBRSV72 EQU   UCBAOF2                                                  06899000
UCBRSV71 EQU   UCBAOF2                                                  06900000
UCBRSV70 EQU   UCBAOF2                                                  06901000
UCBRSV69 EQU   UCBAOF2                                                  06902000
UCBRSV68 EQU   UCBAOF1                                                  06903000
UCBRSV67 EQU   UCBAOF1                                                  06904000
UCBRSV66 EQU   UCBAOF1                                                  06905000
UCBRSV65 EQU   UCBAOF1                                                  06906000
UCBRSV64 EQU   UCBAOF1                                                  06907000
UCBOFNL  EQU   UCBAOF1                                                  06908000
UCBOFSP  EQU   UCBAOF1                                                  06909000
UCBOFMCR EQU   UCBAOF1                                                  06910000
UCBBTB   EQU   UCBBTA+1                                                 06911000
UCBDI    EQU   UCBBTA                                                   06912000
UCBSNS   EQU   UCBOBS04+8                                               06913000
UCBTEB   EQU   UCBOBS04+4                                               06914000
UCBGCB   EQU   UCBOBS04+3                                               06915000
UCBOPEN  EQU   UCBOBS04+2                                               06916000
UCBSTART EQU   UCBOBS04                                                 06917000
UCBXTNB  EQU   UCBXTN+1                                                 06918000
UCBRSV22 EQU   UCBVOPT                                                  06919000
UCBRSV21 EQU   UCBVOPT                                                  06920000
UCBRSV20 EQU   UCBVOPT                                                  06921000
UCBESVE  EQU   UCBVOPT                                                  06922000
UCBERPC  EQU   UCBVOPT                                                  06923000
UCBESVC  EQU   UCBVOPT                                                  06924000
UCBEVA   EQU   UCBVOPT                                                  06925000
UCBESV   EQU   UCBVOPT                                                  06926000
UCBRV009 EQU   UCBTFL1                                                  06927000
UCBRV008 EQU   UCBTFL1                                                  06928000
UCBRV007 EQU   UCBTFL1                                                  06929000
UCBRV006 EQU   UCBTFL1                                                  06930000
UCBRV005 EQU   UCBTFL1                                                  06931000
UCBDQDSP EQU   UCBTFL1                                                  06932000
UCBNSLTP EQU   UCBTFL1                                                  06933000
UCBNLTP  EQU   UCBTFL1                                                  06934000
UCBRES1B EQU   UCBOBS02+18                                              06935000
UCBFSER  EQU   UCBOBS02+12                                              06936000
@NM00019 EQU   UCBOBS02+4                                               06937000
UCBFSEQ  EQU   UCBOBS02+2                                               06938000
UCBFSCT  EQU   UCBOBS02                                                 06939000
UCBNEXP  EQU   UCBOBS01+20                                              06940000
UCBBASE  EQU   UCBOBS01+16                                              06941000
UCBRES1A EQU   UCBOBS01+15                                              06942000
UCBUSER  EQU   UCBOBS01+14                                              06943000
UCBFL47  EQU   UCBFL4                                                   06944000
UCBFL46  EQU   UCBFL4                                                   06945000
UCBFL45  EQU   UCBFL4                                                   06946000
UCBRV065 EQU   UCBFL4                                                   06947000
UCBDSS   EQU   UCBFL4                                                   06948000
UCBRESVP EQU   UCBFL4                                                   06949000
UCBWDAV  EQU   UCBFL4                                                   06950000
UCBDAVV  EQU   UCBFL4                                                   06951000
UCBSQC   EQU   UCBOBS01+12                                              06952000
UCBDATP  EQU   UCBOBS01+12                                              06953000
UCBDMC   EQU   UCBDMCT                                                  06954000
UCBMOUNT EQU   UCBDMCT                                                  06955000
UCBBNUL  EQU   UCBSTAB                                                  06956000
UCBSHAR  EQU   UCBSTAB                                                  06957000
UCBBSTR  EQU   UCBSTAB                                                  06958000
UCBBPUB  EQU   UCBSTAB                                                  06959000
UCBBPRV  EQU   UCBSTAB                                                  06960000
UCBBALB  EQU   UCBPRSRS                                                 06961000
UCBPGFL  EQU   UCBSTAB                                                  06962000
UCBDVSHR EQU   UCBBSVL                                                  06963000
UCBVTOC  EQU   UCBOBS01                                                 06964000
IOSPCIWA EQU   IOSPCISC+44                                              06965000
IOSPCIRS EQU   IOSPCISC+8                                               06966000
@NM00017 EQU   IOSPCISC+4                                               06967000
@NM00016 EQU   IOSPCISC                                                 06968000
IOSWRNDR EQU   IOSWTOWA+4                                               06969000
IOSWTOPT EQU   IOSWTOWA+3                                               06970000
IOSWTOCP EQU   IOSWTOWA+2                                               06971000
IOSWTOCH EQU   IOSWTOWA                                                 06972000
IOSATTWA EQU   IOSATTSC+40                                              06973000
@NM00015 EQU   IOSATTSC+24                                              06974000
IOSATTSN EQU   IOSATTSC                                                 06975000
CVTRV628 EQU   CVTS01+728                                               06976000
CVTRV627 EQU   CVTS01+724                                               06977000
CVTRV626 EQU   CVTS01+720                                               06978000
CVTRV625 EQU   CVTS01+716                                               06979000
CVTRV624 EQU   CVTS01+712                                               06980000
CVTRV623 EQU   CVTS01+708                                               06981000
CVTRV622 EQU   CVTS01+704                                               06982000
CVTRV621 EQU   CVTS01+700                                               06983000
CVTIHASU EQU   CVTS01+696                                               06984000
CVTRV619 EQU   CVTS01+692                                               06985000
CVTRV618 EQU   CVTS01+688                                               06986000
CVTRV617 EQU   CVTS01+684                                               06987000
CVTRV616 EQU   CVTS01+680                                               06988000
CVTRV615 EQU   CVTS01+676                                               06989000
CVTRV614 EQU   CVTS01+672                                               06990000
CVTRV613 EQU   CVTS01+668                                               06991000
CVTTCASP EQU   CVTS01+664                                               06992000
CVT0PT03 EQU   CVTS01+660                                               06993000
CVT0PT0E EQU   CVTS01+656                                               06994000
CVTRV609 EQU   CVTS01+652                                               06995000
CVTCGK   EQU   CVTS01+648                                               06996000
CVTRAC   EQU   CVTS01+644                                               06997000
CVTHSM   EQU   CVTS01+640                                               06998000
CVTRV605 EQU   CVTS01+636                                               06999000
CVTRV604 EQU   CVTS01+632                                               07000000
CVTEFF02 EQU   CVTS01+628                                               07001000
CVTCBBR  EQU   CVTS01+624                                               07002000
CVTSSCR  EQU   CVTS01+620                                               07003000
CVTEVENT EQU   CVTS01+616                                               07004000
CVTCRCA  EQU   CVTS01+612                                               07005000
CVTTPIO  EQU   CVTS01+608                                               07006000
CVTADV   EQU   CVTS01+604                                               07007000
CVTGSDAB EQU   CVTGSDA                                                  07008000
CVTQV3   EQU   CVTS01+596                                               07009000
CVTQV2   EQU   CVTS01+592                                               07010000
CVTQV1   EQU   CVTS01+588                                               07011000
CVTRPT   EQU   CVTS01+584                                               07012000
CVTSSRB  EQU   CVTS01+580                                               07013000
CVTCSDRL EQU   CVTS01+576                                               07014000
CVTEXP1  EQU   CVTS01+572                                               07015000
CVTRMPMT EQU   CVTS01+568                                               07016000
CVTRMPTT EQU   CVTS01+564                                               07017000
CVTVPSA  EQU   CVTS01+560                                               07018000
CVTVSTOP EQU   CVTS01+556                                               07019000
CVTGTFR8 EQU   CVTS01+552                                               07020000
CVTQUIT  EQU   CVTS01+548                                               07021000
CVTVACR  EQU   CVTS01+544                                               07022000
CVTWTCB  EQU   CVTS01+540                                               07023000
CVTSTPRS EQU   CVTS01+536                                               07024000
CVT0PT02 EQU   CVTS01+532                                               07025000
CVTDARCM EQU   CVTS01+528                                               07026000
CVTIRECM EQU   CVTS01+524                                               07027000
CVTJRECM EQU   CVTS01+520                                               07028000
CVTVEMS0 EQU   CVTS01+516                                               07029000
CVTSPFRR EQU   CVTS01+512                                               07030000
CVTRLSTG EQU   CVTS01+508                                               07031000
CVT0TC0A EQU   CVTS01+504                                               07032000
CVTGMBR  EQU   CVTS01+500                                               07033000
CVTLFRM  EQU   CVTS01+496                                               07034000
CVTRMBR  EQU   CVTS01+492                                               07035000
CVTVIOP  EQU   CVTS01+488                                               07036000
CVTRV307 EQU   CVTS01+486                                               07037000
CVTRV306 EQU   CVTS01+484                                               07038000
CVTRV305 EQU   CVTS01+482                                               07039000
CVTRV304 EQU   CVTS01+480                                               07040000
CVTRV303 EQU   CVTS01+478                                               07041000
CVTRV302 EQU   CVTS01+476                                               07042000
CVTTRCA  EQU   CVTS01+472                                               07043000
CVTRV297 EQU   CVTRV289                                                 07044000
CVTRV296 EQU   CVTRV289                                                 07045000
CVTRV295 EQU   CVTRV289                                                 07046000
CVTRV294 EQU   CVTRV289                                                 07047000
CVTRV293 EQU   CVTRV289                                                 07048000
CVTRV292 EQU   CVTRV289                                                 07049000
CVTRV291 EQU   CVTRV289                                                 07050000
CVTRV290 EQU   CVTRV289                                                 07051000
CVTRV288 EQU   CVTRV280                                                 07052000
CVTRV287 EQU   CVTRV280                                                 07053000
CVTRV286 EQU   CVTRV280                                                 07054000
CVTRV285 EQU   CVTRV280                                                 07055000
CVTRV284 EQU   CVTRV280                                                 07056000
CVTRV283 EQU   CVTRV280                                                 07057000
CVTRV282 EQU   CVTRV280                                                 07058000
CVTRV281 EQU   CVTRV280                                                 07059000
CVTRV279 EQU   CVTRV271                                                 07060000
CVTRV278 EQU   CVTRV271                                                 07061000
CVTRV277 EQU   CVTRV271                                                 07062000
CVTRV276 EQU   CVTRV271                                                 07063000
CVTRV275 EQU   CVTRV271                                                 07064000
CVTRV274 EQU   CVTRV271                                                 07065000
CVTRV273 EQU   CVTRV271                                                 07066000
CVTRV272 EQU   CVTRV271                                                 07067000
CVTRV270 EQU   CVTRV262                                                 07068000
CVTRV269 EQU   CVTRV262                                                 07069000
CVTRV268 EQU   CVTRV262                                                 07070000
CVTRV267 EQU   CVTRV262                                                 07071000
CVTRV266 EQU   CVTRV262                                                 07072000
CVTRV265 EQU   CVTRV262                                                 07073000
CVTRV264 EQU   CVTRV262                                                 07074000
CVTRV263 EQU   CVTRV262                                                 07075000
CVTVFP   EQU   CVTS01+464                                               07076000
CVTVSI   EQU   CVTS01+460                                               07077000
CVTVPSIB EQU   CVTS01+456                                               07078000
CVTMFACT EQU   CVTMFRTR                                                 07079000
CVTMFCTL EQU   CVTS01+448                                               07080000
CVTPVBP  EQU   CVTS01+444                                               07081000
CVTPWI   EQU   CVTS01+440                                               07082000
CVTRV254 EQU   CVTS01+438                                               07083000
CVTRV253 EQU   CVTS01+436                                               07084000
CVTRV252 EQU   CVTS01+434                                               07085000
CVTRV251 EQU   CVTS01+433                                               07086000
CVTRV250 EQU   CVTS01+432                                               07087000
CVTRV249 EQU   CVTS01+431                                               07088000
CVTRV248 EQU   CVTS01+430                                               07089000
CVTRV247 EQU   CVTS01+429                                               07090000
CVTRV246 EQU   CVTS01+428                                               07091000
CVTRV245 EQU   CVTRV237                                                 07092000
CVTRV244 EQU   CVTRV237                                                 07093000
CVTRV243 EQU   CVTRV237                                                 07094000
CVTRV242 EQU   CVTRV237                                                 07095000
CVTRV241 EQU   CVTRV237                                                 07096000
CVTRV240 EQU   CVTRV237                                                 07097000
CVTRV239 EQU   CVTRV237                                                 07098000
CVTRV238 EQU   CVTRV237                                                 07099000
CVTRV236 EQU   CVTRV228                                                 07100000
CVTRV235 EQU   CVTRV228                                                 07101000
CVTRV234 EQU   CVTRV228                                                 07102000
CVTRV233 EQU   CVTRV228                                                 07103000
CVTRV232 EQU   CVTRV228                                                 07104000
CVTRV231 EQU   CVTRV228                                                 07105000
CVTRV230 EQU   CVTRV228                                                 07106000
CVTRV229 EQU   CVTRV228                                                 07107000
CVTRV227 EQU   CVTRV219                                                 07108000
CVTRV226 EQU   CVTRV219                                                 07109000
CVTRV225 EQU   CVTRV219                                                 07110000
CVTRV224 EQU   CVTRV219                                                 07111000
CVTRV223 EQU   CVTRV219                                                 07112000
CVTRV222 EQU   CVTRV219                                                 07113000
CVTRV221 EQU   CVTRV219                                                 07114000
CVTRV220 EQU   CVTRV219                                                 07115000
CVTRV218 EQU   CVTRV210                                                 07116000
CVTRV217 EQU   CVTRV210                                                 07117000
CVTRV216 EQU   CVTRV210                                                 07118000
CVTRV215 EQU   CVTRV210                                                 07119000
CVTRV214 EQU   CVTRV210                                                 07120000
CVTRV213 EQU   CVTRV210                                                 07121000
CVTRV212 EQU   CVTRV210                                                 07122000
CVTRV211 EQU   CVTRV210                                                 07123000
CVTLCCAT EQU   CVTS01+420                                               07124000
CVTPCCAT EQU   CVTS01+416                                               07125000
CVTIPCRP EQU   CVTS01+412                                               07126000
CVTIPCRI EQU   CVTS01+408                                               07127000
CVTIPCDS EQU   CVTS01+404                                               07128000
CVTAIDVT EQU   CVTS01+400                                               07129000
CVTSSAP  EQU   CVTS01+396                                               07130000
CVTEHCIR EQU   CVTS01+392                                               07131000
CVTEHDEF EQU   CVTS01+388                                               07132000
CVTDAIR  EQU   CVTS01+384                                               07133000
CVTPERFM EQU   CVTS01+380                                               07134000
CVT044R2 EQU   CVTS01+376                                               07135000
CVTFETCH EQU   CVTS01+372                                               07136000
CVTRSTWD EQU   CVTS01+368                                               07137000
CVTSPOST EQU   CVTS01+364                                               07138000
CVTIOBP  EQU   CVTS01+360                                               07139000
CVTASMVT EQU   CVTS01+356                                               07140000
CVTRECRQ EQU   CVTS01+352                                               07141000
CVTWSAC  EQU   CVTS01+348                                               07142000
CVTRV149 EQU   CVTS01+344                                               07143000
CVTWSAL  EQU   CVTS01+340                                               07144000
CVTSPSA  EQU   CVTS01+336                                               07145000
CVTGLMN  EQU   CVTS01+332                                               07146000
CVTVEAC0 EQU   CVTS01+328                                               07147000
CVT062R1 EQU   CVTS01+324                                               07148000
CVTRPOST EQU   CVTS01+320                                               07149000
CVTDQIQE EQU   CVTS01+316                                               07150000
CVTCSD   EQU   CVTS01+312                                               07151000
CVTLKRMA EQU   CVTS01+308                                               07152000
CVTRSPIE EQU   CVTS01+304                                               07153000
CVTRENQ  EQU   CVTS01+300                                               07154000
CVTLQCB  EQU   CVTS01+296                                               07155000
CVTFQCB  EQU   CVTS01+292                                               07156000
CVTQCS01 EQU   CVTS01+288                                               07157000
CVTAPFT  EQU   CVTS01+284                                               07158000
CVTPARRL EQU   CVTS01+280                                               07159000
CVTVWAIT EQU   CVTS01+276                                               07160000
CVTGSPL  EQU   CVTS01+272                                               07161000
CVTLSMQ  EQU   CVTS01+268                                               07162000
CVTGSMQ  EQU   CVTS01+264                                               07163000
CVTEXPRO EQU   CVTS01+260                                               07164000
CVTOPCTP EQU   CVTS01+256                                               07165000
CVTSIC   EQU   CVTS01+252                                               07166000
CVTTPIOS EQU   CVTS01+248                                               07167000
CVTRTMS  EQU   CVTS01+244                                               07168000
CVTSCBP  EQU   CVTS01+236                                               07169000
CVTSDMP  EQU   CVTS01+232                                               07170000
CVTSV60  EQU   CVTS01+228                                               07171000
CVTRTMCT EQU   CVTS01+224                                               07172000
CVTASCBL EQU   CVTS01+220                                               07173000
CVTASCBH EQU   CVTS01+216                                               07174000
CVTGDA   EQU   CVTS01+212                                               07175000
CVTASVT  EQU   CVTS01+208                                               07176000
CVTVVMDI EQU   CVTS01+204                                               07177000
CVTAQTOP EQU   CVTS01+200                                               07178000
CVTIOSCS EQU   CVTS01+196                                               07179000
CVTSDRM  EQU   CVTS01+192                                               07180000
CVTOPTE  EQU   CVTS01+188                                               07181000
CVTSTXU  EQU   CVTS01+184                                               07182000
CVTQUIS  EQU   CVTS01+180                                               07183000
CVTPARS  EQU   CVTS01+176                                               07184000
CVTS1EE  EQU   CVTS01+172                                               07185000
CVTFRAS  EQU   CVTS01+168                                               07186000
CVTQSAS  EQU   CVTS01+164                                               07187000
CVTCRAS  EQU   CVTS01+160                                               07188000
CVTCRMN  EQU   CVTS01+156                                               07189000
CVTDELCP EQU   CVTS01+152                                               07190000
CVTFRECL EQU   CVTS01+148                                               07191000
CVTGETCL EQU   CVTS01+144                                               07192000
CVTBLDCP EQU   CVTS01+140                                               07193000
CVTAUTHL EQU   CVTS01+136                                               07194000
CVTSCAN  EQU   CVTS01+132                                               07195000
CVTRV144 EQU   CVTS01+130                                               07196000
CVTMAXMP EQU   CVTS01+128                                               07197000
CVTSTCK  EQU   CVTS01+124                                               07198000
CVTRV139 EQU   CVTS01+123                                               07199000
CVTDSSAC EQU   CVTS01+122                                               07200000
CVTRV513 EQU   CVTS01+121                                               07201000
CVTIOSPL EQU   CVTS01+120                                               07202000
CVTPTGT  EQU   CVTS01+116                                               07203000
CVTCSPIE EQU   CVTS01+112                                               07204000
CVTSMFEX EQU   CVTS01+108                                               07205000
CVTOLT0A EQU   CVTS01+104                                               07206000
CVTSRBRT EQU   CVTS01+100                                               07207000
CVTPUTL  EQU   CVTS01+96                                                07208000
CVTASCRL EQU   CVTS01+92                                                07209000
CVTASCRF EQU   CVTS01+88                                                07210000
CVTRV326 EQU   CVTS01+84                                                07211000
CVTRV325 EQU   CVTS01+80                                                07212000
CVTRV324 EQU   CVTS01+76                                                07213000
CVT0VL01 EQU   CVTS01+72                                                07214000
CVTSHRVM EQU   CVTS01+68                                                07215000
CVTRV332 EQU   CVTS01+64                                                07216000
CVTTAS   EQU   CVTS01+60                                                07217000
CVTRSCN  EQU   CVTS01+56                                                07218000
CVTTRAC2 EQU   CVTS01+54                                                07219000
CVTTRACE EQU   CVTS01+52                                                07220000
CVTAPG   EQU   CVTS01+51                                                07221000
CVTSDTRC EQU   CVTCTLFG                                                 07222000
CVTGTRCE EQU   CVTCTLFG                                                 07223000
CVTNOMP  EQU   CVTCTLFG                                                 07224000
CVTRSV79 EQU   CVTCTLFG                                                 07225000
CVTDSTAT EQU   CVTCTLFG                                                 07226000
CVTRSV78 EQU   CVTCTLFG                                                 07227000
CVTRV333 EQU   CVTCTLFG                                                 07228000
CVTRV323 EQU   CVTCTLFG                                                 07229000
CVTSPVLK EQU   CVTS01+49                                                07230000
CVTRSV77 EQU   CVTS01+48                                                07231000
CVTRV331 EQU   CVTS01+44                                                07232000
CVTRV330 EQU   CVTS01+40                                                07233000
CVTRV329 EQU   CVTS01+36                                                07234000
CVTRV328 EQU   CVTS01+32                                                07235000
CVTRV322 EQU   CVTS01+28                                                07236000
CVTSLID  EQU   CVTSLIDA+1                                               07237000
CVTSYLK  EQU   CVTSLIDA                                                 07238000
CVTRV321 EQU   CVTS01+20                                                07239000
CVTRV320 EQU   CVTS01+16                                                07240000
CVTLPDIR EQU   CVTLPDIA+1                                               07241000
CVTRSV69 EQU   CVTDIRST                                                 07242000
CVTRSV68 EQU   CVTDIRST                                                 07243000
CVTRSV67 EQU   CVTDIRST                                                 07244000
CVTRSV66 EQU   CVTDIRST                                                 07245000
CVTRSV65 EQU   CVTDIRST                                                 07246000
CVTRSV64 EQU   CVTDIRST                                                 07247000
CVTRSV63 EQU   CVTDIRST                                                 07248000
CVTDICOM EQU   CVTDIRST                                                 07249000
CVTPVTP  EQU   CVTS01+8                                                 07250000
CVTLPDSR EQU   CVTS01+4                                                 07251000
CVTGETL  EQU   CVTS01                                                   07252000
SECL     EQU   SEPL+16                                                  07253000
SECN     EQU   SEPL+3                                                   07254000
@NM00476 EQU   SEPL+1                                                   07255000
DATA99   EQU   PLIST99+4                                                07256000
@NM00475 EQU   PREFIX99+2                                               07257000
@NM00474 EQU   PREFIX99                                                 07258000
@NM00473 EQU   PLIST86                                                  07259000
CCHH8200 EQU   CCHH8288                                                 07260000
@NM00471 EQU   @NM00470                                                 07261000
@NM00469 EQU   PLIST81                                                  07262000
@NM00468 EQU   PARM73                                                   07263000
@NM00467 EQU   SVCDMPLS                                                 07264000
@NM00466 EQU   FLAGS48                                                  07265000
@NM00465 EQU   PLSTA48                                                  07266000
@NM00464 EQU   FLAGS                                                    07267000
@NM00463 EQU   SUPLIST                                                  07268000
@NM00462 EQU   WTOLSTA+3                                                07269000
@NM00461 EQU   WTORLSTA+11                                              07270000
@NM00460 EQU   WTORXTRA+1                                               07271000
@NM00459 EQU   PARMLS30+12                                              07272000
@NM00458 EQU   PARMLS30                                                 07273000
@NM00456 EQU   PARMLS29+8                                               07274000
@NM00455 EQU   PARMLS29                                                 07275000
ERRLEN27 EQU   ERRPRM27+22                                              07276000
@NM00453 EQU   ERRPRM27                                                 07277000
@NM00452 EQU   PRMLST27+2                                               07278000
@NM00451 EQU   CTGFV                                                    07279000
@NM00449 EQU   PLST26+12                                                07280000
CTGCAT   EQU   PLST26+8                                                 07281000
@NM00448 EQU   PLST26+3                                                 07282000
@NM00447 EQU   CTGOPTN3                                                 07283000
@NM00446 EQU   PLST26+1                                                 07284000
@NM00445 EQU   CTGOPTN1                                                 07285000
@NM00443 EQU   PIRWORD1                                                 07286000
@NM00442 EQU   PL17PTR                                                  07287000
DEBAD1   EQU   DEBAD                                                    07288000
@NM00441 EQU   DEBAD16                                                  07289000
DEB151   EQU   DEB15                                                    07290000
@NM00440 EQU   @NM00439                                                 07291000
@NM00438 EQU   PRMLST15                                                 07292000
@NM00437 EQU   EPNM8B                                                   07293000
PARMAD   EQU   PARM+1                                                   07294000
ZEROLGTH EQU   SDMPBUF+1470                                             07295000
ZEROADD  EQU   SDMPBUF+1466                                             07296000
RTCDMP   EQU   SDMPBUF+954                                              07297000
RTCLGTH  EQU   SDMPBUF+952                                              07298000
RTCADD   EQU   SDMPBUF+948                                              07299000
MCADMP   EQU   SDMPBUF+148                                              07300000
MCALGTH  EQU   SDMPBUF+146                                              07301000
MCAADD   EQU   SDMPBUF+142                                              07302000
MCRDMP   EQU   SDMPBUF+6                                                07303000
MCRLGTH  EQU   SDMPBUF+4                                                07304000
MCRADD   EQU   SDMPBUF                                                  07305000
@NM00192 EQU   TIOENT                                                   07306000
@NM00187 EQU   FRRPLST+2                                                07307000
MCRRESV  EQU   MCRWSAF                                                  07308000
MCRBRENT EQU   MCRWSAF                                                  07309000
MCERROR  EQU   MCRWSAF                                                  07310000
MCINFGBR EQU   MCRWSAF                                                  07311000
MCINCTL  EQU   MCRWSAF                                                  07312000
MCRMCIH  EQU   MCRWSA                                                   07313000
MCQESRB  EQU   MCQE+44                                                  07314000
@NM00186 EQU   MCQE+42                                                  07315000
@NM00185 EQU   MCQEFLGS                                                 07316000
MCQEACT  EQU   MCQEFLGS                                                 07317000
MCQESCHE EQU   MCQE+40                                                  07318000
MCQETECB EQU   MCQE+36                                                  07319000
MCQEMCCL EQU   MCQE+28                                                  07320000
MCQEMCEE EQU   MCQE+24                                                  07321000
MCQEMCQE EQU   MCQE+20                                                  07322000
MCQEASCB EQU   MCQE+16                                                  07323000
MCQENAME EQU   MCQE+8                                                   07324000
MCQEIDEN EQU   MCQE                                                     07325000
MCHEADTR EQU   MCHEAD+48                                                07326000
MCHEADRD EQU   MCHEAD+44                                                07327000
MCHFRRAD EQU   MCHEAD+40                                                07328000
MCHMCER  EQU   MCHEAD+36                                                07329000
@NM00184 EQU   MCHFLGS+1                                                07330000
@NM00183 EQU   MCHFLG1                                                  07331000
MCHTERM  EQU   MCHFLG1                                                  07332000
MCHACT   EQU   MCHFLG1                                                  07333000
MCHDIS   EQU   MCHEAD+20                                                07334000
MCHCTL   EQU   MCHEAD+16                                                07335000
MCHCNT   EQU   MCHEAD+12                                                07336000
MCHCUR   EQU   MCHEAD+8                                                 07337000
MCHIDEN  EQU   MCHEAD                                                   07338000
MCASWORK EQU   MCAWSA+644                                               07339000
@NM00182 EQU   MCATRL8                                                  07340000
@NM00181 EQU   MCATRL8                                                  07341000
@NM00180 EQU   MCATRL8                                                  07342000
@NM00179 EQU   MCATRL8                                                  07343000
MCAFRECT EQU   MCATRL7                                                  07344000
MCAFRECC EQU   MCATRL7                                                  07345000
MCAFRESP EQU   MCATRL7                                                  07346000
MCAFREXJ EQU   MCATRL7                                                  07347000
MCAFRSBR EQU   MCATRL6                                                  07348000
MCAFRDMJ EQU   MCATRL6                                                  07349000
MCAFRDPC EQU   MCATRL6                                                  07350000
MCAFRPIC EQU   MCATRL6                                                  07351000
MCAFRPIJ EQU   MCATRL6                                                  07352000
@NM00178 EQU   MCATRL5                                                  07353000
MCADREGS EQU   MCATRL5                                                  07354000
MCAFRRB  EQU   MCATRL5                                                  07355000
MCAFRRJ  EQU   MCATRL5                                                  07356000
MCAFRRA  EQU   MCATRL5                                                  07357000
MCAFRERT EQU   MCATRL5                                                  07358000
MCAFREPC EQU   MCATRL5                                                  07359000
MCAMJOBN EQU   MCATRL4                                                  07360000
MCAMSDWA EQU   MCATRL4                                                  07361000
MCAMBTU  EQU   MCATRL4                                                  07362000
MCAMIOSB EQU   MCATRL4                                                  07363000
MCAMTCB  EQU   MCATRL4                                                  07364000
MCAMASCB EQU   MCATRL4                                                  07365000
MCAMUCB  EQU   MCATRL4                                                  07366000
MCAMEXT  EQU   MCATRL4                                                  07367000
MCAFRFRT EQU   MCATRL3                                                  07368000
MCAFRFA  EQU   MCATRL3                                                  07369000
MCAFRSJ  EQU   MCATRL3                                                  07370000
MCAFRSA  EQU   MCATRL3                                                  07371000
MCAPIF   EQU   MCATRL3                                                  07372000
MCASIOF  EQU   MCATRL3                                                  07373000
MCAIOF   EQU   MCATRL3                                                  07374000
MCASVCF  EQU   MCATRL3                                                  07375000
MCATDIR  EQU   MCATRL2                                                  07376000
MCALSR   EQU   MCATRL2                                                  07377000
MCAUIO   EQU   MCATRL2                                                  07378000
MCASTA   EQU   MCATRL2                                                  07379000
MCAFRR   EQU   MCATRL2                                                  07380000
MCASRM   EQU   MCATRL2                                                  07381000
MCARNIO  EQU   MCATRL2                                                  07382000
MCAUSR   EQU   MCATRL1                                                  07383000
MCAPI    EQU   MCATRL1                                                  07384000
MCASRB   EQU   MCATRL1                                                  07385000
MCADSP   EQU   MCATRL1                                                  07386000
MCASIO   EQU   MCATRL1                                                  07387000
MCAIO    EQU   MCATRL1                                                  07388000
MCAEXT   EQU   MCATRL1                                                  07389000
MCASVC   EQU   MCATRL1                                                  07390000
MCAMSG   EQU   MCAWSA+192                                               07391000
MCASETEV EQU   MCAWSA+128                                               07392000
MCAFWORK EQU   MCAWSA+112                                               07393000
MCASFEOB EQU   MCAWSA+56                                                07394000
MCASBLOK EQU   MCAWSA                                                   07395000
WSACASMS EQU   WSAC+60                                                  07396000
WSACASMD EQU   WSAC+56                                                  07397000
WSACCCH  EQU   WSAC+52                                                  07398000
WSACRRSA EQU   WSAC+48                                                  07399000
WSACREST EQU   WSAC+44                                                  07400000
WSACRSTI EQU   WSAC+40                                                  07401000
WSACABTM EQU   WSAC+36                                                  07402000
WSACMF1  EQU   WSAC+32                                                  07403000
WSACEDS0 EQU   WSAC+28                                                  07404000
WSACIOS  EQU   WSAC+24                                                  07405000
WSACRTMK EQU   WSAC+20                                                  07406000
WSACACR  EQU   WSAC+16                                                  07407000
WSACTIME EQU   WSAC+12                                                  07408000
WSACOPTM EQU   WSAC+8                                                   07409000
WSACCWSA EQU   WSAC                                                     07410000
@NM00177 EQU   TCBXTNT2+32                                              07411000
TCBRV181 EQU   TCBRV173                                                 07412000
TCBRV180 EQU   TCBRV173                                                 07413000
TCBRV179 EQU   TCBRV173                                                 07414000
TCBRV178 EQU   TCBRV173                                                 07415000
TCBRV177 EQU   TCBRV173                                                 07416000
TCBRV176 EQU   TCBRV173                                                 07417000
TCBRV175 EQU   TCBRV173                                                 07418000
TCBRV174 EQU   TCBRV173                                                 07419000
TCBRV172 EQU   TCBRV164                                                 07420000
TCBRV171 EQU   TCBRV164                                                 07421000
TCBRV170 EQU   TCBRV164                                                 07422000
TCBRV169 EQU   TCBRV164                                                 07423000
TCBRV168 EQU   TCBRV164                                                 07424000
TCBRV167 EQU   TCBRV164                                                 07425000
TCBRV166 EQU   TCBRV164                                                 07426000
TCBRV165 EQU   TCBRV164                                                 07427000
TCBRV163 EQU   TCBRV155                                                 07428000
TCBRV162 EQU   TCBRV155                                                 07429000
TCBRV161 EQU   TCBRV155                                                 07430000
TCBRV160 EQU   TCBRV155                                                 07431000
TCBRV159 EQU   TCBRV155                                                 07432000
TCBRV158 EQU   TCBRV155                                                 07433000
TCBRV157 EQU   TCBRV155                                                 07434000
TCBRV156 EQU   TCBRV155                                                 07435000
TCBRV154 EQU   TCBRV146                                                 07436000
TCBRV153 EQU   TCBRV146                                                 07437000
TCBRV152 EQU   TCBRV146                                                 07438000
TCBRV151 EQU   TCBRV146                                                 07439000
TCBRV150 EQU   TCBRV146                                                 07440000
TCBRV149 EQU   TCBRV146                                                 07441000
TCBRV148 EQU   TCBRV146                                                 07442000
TCBRV147 EQU   TCBRV146                                                 07443000
TCBRV145 EQU   TCBXTNT2+26                                              07444000
TCBRV144 EQU   TCBXTNT2+24                                              07445000
TCBRV143 EQU   TCBXTNT2+20                                              07446000
TCBRV142 EQU   TCBXTNT2+16                                              07447000
TCBRSV49 EQU   TCBXTNT2+12                                              07448000
TCBEVENT EQU   TCBXTNT2+8                                               07449000
TCBRSVAB EQU   TCBXTNT2+4                                               07450000
TCBGTFA  EQU   TCBGTF+1                                                 07451000
TCBRSV47 EQU   TCBTFLG                                                  07452000
TCBRSV46 EQU   TCBTFLG                                                  07453000
TCBRSV45 EQU   TCBTFLG                                                  07454000
TCBRSV44 EQU   TCBTFLG                                                  07455000
TCBRSV43 EQU   TCBTFLG                                                  07456000
TCBDSPIT EQU   TCBTFLG                                                  07457000
TCBERRTN EQU   TCBTFLG                                                  07458000
TCBASYNC EQU   TCBTFLG                                                  07459000
@NM00176 EQU   TCB+296                                                  07460000
TCBSVCA2 EQU   TCB+292                                                  07461000
TCBSWASA EQU   TCB+288                                                  07462000
TCBDBTB  EQU   TCB+284                                                  07463000
TCBRPT   EQU   TCB+280                                                  07464000
TCBRV141 EQU   TCBRV133                                                 07465000
TCBRV140 EQU   TCBRV133                                                 07466000
TCBRV139 EQU   TCBRV133                                                 07467000
TCBRV138 EQU   TCBRV133                                                 07468000
TCBRV137 EQU   TCBRV133                                                 07469000
TCBRV136 EQU   TCBRV133                                                 07470000
TCBRV135 EQU   TCBRV133                                                 07471000
TCBRV134 EQU   TCBRV133                                                 07472000
TCBRV132 EQU   TCBRV124                                                 07473000
TCBRV131 EQU   TCBRV124                                                 07474000
TCBRV130 EQU   TCBRV124                                                 07475000
TCBRV129 EQU   TCBRV124                                                 07476000
TCBRV128 EQU   TCBRV124                                                 07477000
TCBRV127 EQU   TCBRV124                                                 07478000
TCBRV126 EQU   TCBRV124                                                 07479000
TCBRV125 EQU   TCBRV124                                                 07480000
TCBRV123 EQU   TCBFBYT2                                                 07481000
TCBRV122 EQU   TCBFBYT2                                                 07482000
TCBECBNV EQU   TCBFBYT2                                                 07483000
TCBSSSYN EQU   TCBFBYT2                                                 07484000
TCBFPRAP EQU   TCBFBYT2                                                 07485000
TCBFDW   EQU   TCBFBYT2                                                 07486000
TCBFMW   EQU   TCBFBYT2                                                 07487000
TCBCNCB  EQU   TCBFBYT2                                                 07488000
TCBLLH   EQU   TCBFBYT1                                                 07489000
TCBRV113 EQU   TCBFBYT1                                                 07490000
TCBEOT   EQU   TCBFBYT1                                                 07491000
TCBRTM2  EQU   TCBFBYT1                                                 07492000
TCBPGNLY EQU   TCBFBYT1                                                 07493000
TCBNDIOS EQU   TCBFBYT1                                                 07494000
TCBACTIV EQU   TCBFBYT1                                                 07495000
TCBEOTFM EQU   TCBFBYT1                                                 07496000
TCBAFFN  EQU   TCB+274                                                  07497000
TCBCCPVI EQU   TCB+272                                                  07498000
TCBUKYSP EQU   TCB+268                                                  07499000
TCBMODE  EQU   TCBESTAE+3                                               07500000
TCBERTYP EQU   TCBESTAE+2                                               07501000
TCBRV314 EQU   TCBESTRM                                                 07502000
TCBRV313 EQU   TCBESTRM                                                 07503000
TCBRV312 EQU   TCBESTRM                                                 07504000
TCBRV311 EQU   TCBESTRM                                                 07505000
TCBRV310 EQU   TCBESTRM                                                 07506000
TCBRV309 EQU   TCBESTRM                                                 07507000
TCBRV308 EQU   TCBESTRM                                                 07508000
TCBETERM EQU   TCBESTRM                                                 07509000
TCBSCBKY EQU   TCBESTAE                                                 07510000
TCBRTM12 EQU   TCB+260                                                  07511000
TCBTCBID EQU   TCB+256                                                  07512000
TCBRSV96 EQU   TCB+252                                                  07513000
TCBSWA   EQU   TCB+248                                                  07514000
TCBFOEA  EQU   TCBFOE+1                                                 07515000
TCBRSV42 EQU   TCBFOE                                                   07516000
TCBRV306 EQU   TCB+240                                                  07517000
TCBRSV41 EQU   TCB+239                                                  07518000
TCBTID   EQU   TCB+238                                                  07519000
TCBRSVAA EQU   TCB+237                                                  07520000
TCBABCUR EQU   TCB+236                                                  07521000
TCBTMSAV EQU   TCB+232                                                  07522000
TCBIOTIM EQU   TCB+228                                                  07523000
TCBRTWA  EQU   TCB+224                                                  07524000
TCBBACK  EQU   TCB+220                                                  07525000
TCBTIRB  EQU   TCB+216                                                  07526000
TCBAECB  EQU   TCB+212                                                  07527000
TCBEXT2A EQU   TCBEXT2+1                                                07528000
TCBRSV39 EQU   TCBEXT2                                                  07529000
TCBSTMCT EQU   TCB+207                                                  07530000
TCBSYSCT EQU   TCB+206                                                  07531000
TCBRSV37 EQU   TCB+205                                                  07532000
TCBEXSVC EQU   TCBDAR                                                   07533000
TCBDARMS EQU   TCBDAR                                                   07534000
TCBDARWT EQU   TCBDAR                                                   07535000
TCBDARO  EQU   TCBDAR                                                   07536000
TCBDARMC EQU   TCBDARC                                                  07537000
TCBDARD  EQU   TCBDAR                                                   07538000
TCBDARS  EQU   TCBDAR                                                   07539000
TCBDARP  EQU   TCBDAR                                                   07540000
TCBGTOFM EQU   TCBFLGS7                                                 07541000
TCBADMP  EQU   TCBFLGS7                                                 07542000
TCBRSTSK EQU   TCBFLGS7                                                 07543000
TCBSVCS  EQU   TCBFLGS7                                                 07544000
TCBSTACK EQU   TCBFLGS7                                                 07545000
TCBRSV34 EQU   TCBFLGS7                                                 07546000
TCBRSV33 EQU   TCBFLGS7                                                 07547000
TCBGPECB EQU   TCBFLGS7                                                 07548000
TCBNTJS  EQU   TCBFLGS6                                                 07549000
TCBAPG   EQU   TCBFLGS6                                                 07550000
TCBMIGR  EQU   TCBFLGS6                                                 07551000
TCBRV303 EQU   TCBFLGS6                                                 07552000
TCBSPVLK EQU   TCBFLGS6                                                 07553000
TCBCPU   EQU   TCBFLGS6                                                 07554000
TCBPIE17 EQU   TCBFLGS6                                                 07555000
TCBRV    EQU   TCBFLGS6                                                 07556000
TCBRSV79 EQU   TCBNDSP5                                                 07557000
TCBRSV78 EQU   TCBNDSP5                                                 07558000
TCBRSV77 EQU   TCBNDSP5                                                 07559000
TCBRSV76 EQU   TCBNDSP5                                                 07560000
TCBRSV75 EQU   TCBNDSP5                                                 07561000
TCBRSV74 EQU   TCBNDSP5                                                 07562000
TCBRSV95 EQU   TCBNDSP5                                                 07563000
TCBRSV94 EQU   TCBNDSP5                                                 07564000
TCBRSV93 EQU   TCBNDSP4                                                 07565000
TCBRSV92 EQU   TCBNDSP4                                                 07566000
TCBRSV91 EQU   TCBNDSP4                                                 07567000
TCBRSV90 EQU   TCBNDSP4                                                 07568000
TCBRSV89 EQU   TCBNDSP4                                                 07569000
TCBRSV88 EQU   TCBNDSP4                                                 07570000
TCBRSV87 EQU   TCBNDSP4                                                 07571000
TCBRSV86 EQU   TCBNDSP4                                                 07572000
TCBEXT1A EQU   TCBEXT1+1                                                07573000
TCBRSV32 EQU   TCBEXT1                                                  07574000
TCBEXCPD EQU   TCB+192                                                  07575000
TCBIOBRC EQU   TCB+188                                                  07576000
TCBDDWTC EQU   TCB+186                                                  07577000
TCBDDEXC EQU   TCB+184                                                  07578000
TCBJSCBB EQU   TCBJSCB+1                                                07579000
@NM00175 EQU   TCBRECDE                                                 07580000
TCBREC   EQU   TCBRECDE                                                 07581000
TCBMDIDS EQU   TCB+176                                                  07582000
TCBNDINT EQU   TCBNDSP3                                                 07583000
TCBRSV27 EQU   TCBNDSP3                                                 07584000
TCBRSV26 EQU   TCBNDSP3                                                 07585000
TCBRSV25 EQU   TCBNDSP3                                                 07586000
TCBRSV24 EQU   TCBNDSP3                                                 07587000
TCBSRBND EQU   TCBNDSP3                                                 07588000
TCBRV302 EQU   TCBNDSP3                                                 07589000
TCBLJSND EQU   TCBNDSP3                                                 07590000
TCBABE   EQU   TCBNDSP2                                                 07591000
TCBDSS   EQU   TCBNDSP2                                                 07592000
TCBOWAIT EQU   TCBNDSP2                                                 07593000
TCBIWAIT EQU   TCBNDSP2                                                 07594000
TCBNDTS  EQU   TCBNDSP2                                                 07595000
TCBNDSVC EQU   TCBNDSP2                                                 07596000
TCBSTPP  EQU   TCBNDSP2                                                 07597000
TCBABD   EQU   TCBNDSP2                                                 07598000
TCBRSV22 EQU   TCBNDSP1                                                 07599000
TCBPIEND EQU   TCBNDSP1                                                 07600000
TCBTPSP  EQU   TCBNDSP1                                                 07601000
TCBDDRND EQU   TCBNDSP1                                                 07602000
TCBRSPND EQU   TCBNDSP1                                                 07603000
TCBRSTND EQU   TCBNDSP1                                                 07604000
TCBDARPN EQU   TCBNDSP1                                                 07605000
TCBDARTN EQU   TCBNDSP1                                                 07606000
TCBNDSP0 EQU   TCBNDSP                                                  07607000
TCBUSER  EQU   TCB+168                                                  07608000
TCBTCTB  EQU   TCBTCT+1                                                 07609000
TCBRSV9C EQU   TCBTCTGF                                                 07610000
TCBRSV9B EQU   TCBTCTGF                                                 07611000
TCBRSV9A EQU   TCBTCTGF                                                 07612000
TCBRSV99 EQU   TCBTCTGF                                                 07613000
TCBRSV98 EQU   TCBTCTGF                                                 07614000
TCBRSV97 EQU   TCBTCTGF                                                 07615000
TCBRSV20 EQU   TCBTCTGF                                                 07616000
TCBSMFGF EQU   TCBTCTGF                                                 07617000
TCBSTABB EQU   TCBSTAB+1                                                07618000
TCBSTCUR EQU   TCBNSTAE                                                 07619000
TCBRV301 EQU   TCBNSTAE                                                 07620000
TCBSYNCH EQU   TCBNSTAE                                                 07621000
TCBHALT  EQU   TCBNSTAE                                                 07622000
TCBPPSUP EQU   TCBNSTAE                                                 07623000
TCB33E   EQU   TCBNSTAE                                                 07624000
TCBQUIES EQU   TCBNSTAE                                                 07625000
TCBSTABE EQU   TCBNSTAE                                                 07626000
TCBAQE   EQU   TCB+156                                                  07627000
TCBPQE   EQU   TCB+152                                                  07628000
TCBTSDP  EQU   TCB+151                                                  07629000
TCBTSLP  EQU   TCB+150                                                  07630000
TCBSTPCT EQU   TCB+149                                                  07631000
TCBCPUBN EQU   TCBTSFLG                                                 07632000
TCBDYDSP EQU   TCBTSFLG                                                 07633000
TCBRSV18 EQU   TCBTSFLG                                                 07634000
TCBRSV17 EQU   TCBTSFLG                                                 07635000
TCBTIOTG EQU   TCBTSFLG                                                 07636000
TCBATT   EQU   TCBTSFLG                                                 07637000
TCBSTPPR EQU   TCBTSFLG                                                 07638000
TCBRV300 EQU   TCBTSTSK                                                 07639000
TCBECB   EQU   TCB+144                                                  07640000
TCBIQE   EQU   TCB+140                                                  07641000
TCBLTC   EQU   TCB+136                                                  07642000
TCBOTC   EQU   TCB+132                                                  07643000
TCBNTC   EQU   TCB+128                                                  07644000
TCBJSTCA EQU   TCBJSTCB+1                                               07645000
TCBRSV16 EQU   TCBJSTCB                                                 07646000
TCBTQET  EQU   TCBTME                                                   07647000
TCBTCB   EQU   TCB+116                                                  07648000
TCBFSAB  EQU   TCBFSA+1                                                 07649000
TCBQEL   EQU   TCBFSA                                                   07650000
TCBGRS15 EQU   TCBGRS+60                                                07651000
TCBGRS14 EQU   TCBGRS+56                                                07652000
TCBGRS13 EQU   TCBGRS+52                                                07653000
TCBGRS12 EQU   TCBGRS+48                                                07654000
TCBGRS11 EQU   TCBGRS+44                                                07655000
TCBGRS10 EQU   TCBGRS+40                                                07656000
TCBGRS9  EQU   TCBGRS+36                                                07657000
TCBGRS8  EQU   TCBGRS+32                                                07658000
TCBGRS7  EQU   TCBGRS+28                                                07659000
TCBGRS6  EQU   TCBGRS+24                                                07660000
TCBGRS5  EQU   TCBGRS+20                                                07661000
TCBGRS4  EQU   TCBGRS+16                                                07662000
TCBGRS3  EQU   TCBGRS+12                                                07663000
TCBGRS2  EQU   TCBGRS+8                                                 07664000
TCBGRS1  EQU   TCBGRS+4                                                 07665000
TCBGRS0  EQU   TCBGRS                                                   07666000
TCBJPQB  EQU   TCBJPQ+1                                                 07667000
TCBRSV15 EQU   TCBPURGE                                                 07668000
TCBRSV14 EQU   TCBPURGE                                                 07669000
TCBRSV13 EQU   TCBPURGE                                                 07670000
TCBRSV12 EQU   TCBPURGE                                                 07671000
TCBRSV11 EQU   TCBPURGE                                                 07672000
TCBRSV10 EQU   TCBPURGE                                                 07673000
TCBRSV09 EQU   TCBPURGE                                                 07674000
TCBJPQF  EQU   TCBPURGE                                                 07675000
TCBJLB   EQU   TCB+40                                                   07676000
TCBLLS   EQU   TCB+36                                                   07677000
TCBDSP   EQU   TCB+35                                                   07678000
TCBLMP   EQU   TCB+34                                                   07679000
TCBPNDSP EQU   TCBFLGS5                                                 07680000
TCBFCD1  EQU   TCBFLGS5                                                 07681000
TCBSTP   EQU   TCBFLGS5                                                 07682000
TCBSYS   EQU   TCBFLGS5                                                 07683000
TCBANDSP EQU   TCBFLGS5                                                 07684000
TCBPAGE  EQU   TCBFLGS5                                                 07685000
TCBUXNDF EQU   TCBABWF                                                  07686000
TCBFC    EQU   TCBFLGS5                                                 07687000
TCBONDSP EQU   TCBFLGS4                                                 07688000
TCBMPCND EQU   TCBFLGS4                                                 07689000
TCBMPCVQ EQU   TCBFLGS4                                                 07690000
TCBUXNDV EQU   TCBFLGS4                                                 07691000
TCBHNDSP EQU   TCBFLGS4                                                 07692000
TCBRQENA EQU   TCBFLGS4                                                 07693000
TCBSER   EQU   TCBFLGS4                                                 07694000
TCBNDUMP EQU   TCBFLGS4                                                 07695000
TCBDWSTA EQU   TCBFLGS3                                                 07696000
TCBRSV08 EQU   TCBFLGS3                                                 07697000
TCBRSV07 EQU   TCBFLGS3                                                 07698000
TCBRSV06 EQU   TCBFLGS3                                                 07699000
TCBABGM  EQU   TCBFLGS3                                                 07700000
TCBABTRM EQU   TCBFLGS3                                                 07701000
TCBADINP EQU   TCBFLGS3                                                 07702000
TCBFSM   EQU   TCBFLGS3                                                 07703000
TCBFTS   EQU   TCBFLGS2                                                 07704000
TCBFETXR EQU   TCBFLGS2                                                 07705000
TCBFDSOP EQU   TCBFLGS2                                                 07706000
TCBFJMC  EQU   TCBFLGS2                                                 07707000
TCBFSMC  EQU   TCBFLGS2                                                 07708000
TCBFABOP EQU   TCBFLGS2                                                 07709000
TCBFSTI  EQU   TCBFLGS2                                                 07710000
TCBFOINP EQU   TCBFLGS2                                                 07711000
TCBFX    EQU   TCBFLGS1                                                 07712000
TCBFS    EQU   TCBFLGS1                                                 07713000
TCBFT    EQU   TCBFLGS1                                                 07714000
TCBPDUMP EQU   TCBFLGS1                                                 07715000
TCBNONPR EQU   TCBFLGS1                                                 07716000
TCBFERA  EQU   TCBFLGS1                                                 07717000
TCBFE    EQU   TCBFLGS1                                                 07718000
TCBFA    EQU   TCBFLGS1                                                 07719000
TCBZERO  EQU   TCBPKF                                                   07720000
TCBFLAG  EQU   TCBPKF                                                   07721000
TCBMSSB  EQU   TCBMSS+1                                                 07722000
TCBRSV03 EQU   TCBMSS                                                   07723000
TCBTRNB  EQU   TCBTRN+1                                                 07724000
TCBRSV02 EQU   TCBABF                                                   07725000
TCBOLTEP EQU   TCBABF                                                   07726000
TCBTCP   EQU   TCBABF                                                   07727000
TCBTCPP  EQU   TCBABF                                                   07728000
TCBRSV01 EQU   TCBABF                                                   07729000
TCBGRPH  EQU   TCBABF                                                   07730000
TCBNOCHK EQU   TCBABF                                                   07731000
TCBMOD91 EQU   TCBABF                                                   07732000
TCBCMPC  EQU   TCBCMP+1                                                 07733000
TCBRV318 EQU   TCBCMSG                                                  07734000
TCBRV317 EQU   TCBCIND                                                  07735000
TCBRV316 EQU   TCBCWTO                                                  07736000
TCBCASID EQU   TCBCDBL                                                  07737000
TCBNOCC  EQU   TCBSTCC                                                  07738000
TCBDMPO  EQU   TCBCPP                                                   07739000
TCBCSTEP EQU   TCBCMPF                                                  07740000
TCBCREQ  EQU   TCBCMPF                                                  07741000
TCBDEB   EQU   TCB+8                                                    07742000
TCBPIEA  EQU   TCBPIE+1                                                 07743000
TCBPM    EQU   TCBPMASK                                                 07744000
@NM00174 EQU   TCBPMASK                                                 07745000
TCBFRS6  EQU   TCBFRS+24                                                07746000
TCBFRS4  EQU   TCBFRS+16                                                07747000
TCBFRS2  EQU   TCBFRS+8                                                 07748000
TCBFRS0  EQU   TCBFRS                                                   07749000
@NM00173 EQU   SRB+40                                                   07750000
@NM00172 EQU   SRB+38                                                   07751000
SRBPRIOR EQU   SRB+37                                                   07752000
SRBPKF   EQU   SRB+36                                                   07753000
SRBSAVE  EQU   SRB+32                                                   07754000
SRBPARM  EQU   SRB+28                                                   07755000
SRBRMTR  EQU   SRB+24                                                   07756000
SRBEP    EQU   SRB+20                                                   07757000
SRBPASID EQU   SRBFLC+2                                                 07758000
SRBCPAFF EQU   SRBFLC                                                   07759000
SRBASCB  EQU   SRB+8                                                    07760000
SRBFLNK  EQU   SRB+4                                                    07761000
SRBID    EQU   SRB                                                      07762000
SIRBEND  EQU   RBSECT+168                                               07763000
SVRBEND  EQU   RBSECT+168                                               07764000
RBRSV158 EQU   RBRSV150                                                 07765000
RBRSV157 EQU   RBRSV150                                                 07766000
RBRSV156 EQU   RBRSV150                                                 07767000
RBRSV155 EQU   RBRSV150                                                 07768000
RBRSV154 EQU   RBRSV150                                                 07769000
RBRSV153 EQU   RBRSV150                                                 07770000
RBRSV152 EQU   RBRSV150                                                 07771000
RBRSV151 EQU   RBRSV150                                                 07772000
RBRSV149 EQU   RBSECT+166                                               07773000
RBRSV148 EQU   RBSECT+164                                               07774000
RBSCBB   EQU   RBSECT+144                                               07775000
TIRBEND  EQU   @NM00170+8                                               07776000
PRBEND   EQU   @NM00170+8                                               07777000
RBRSV146 EQU   RBRSV138                                                 07778000
RBRSV145 EQU   RBRSV138                                                 07779000
RBRSV144 EQU   RBRSV138                                                 07780000
RBRSV143 EQU   RBRSV138                                                 07781000
RBRSV142 EQU   RBRSV138                                                 07782000
RBRSV141 EQU   RBRSV138                                                 07783000
RBRSV140 EQU   RBRSV138                                                 07784000
RBRSV139 EQU   RBRSV138                                                 07785000
RBRSV137 EQU   @NM00170+6                                               07786000
RBRSV136 EQU   @NM00170+4                                               07787000
RBRSV135 EQU   @NM00170                                                 07788000
@NM00169 EQU   RBSECT+32                                                07789000
@NM00168 EQU   @NM00166+1                                               07790000
@NM00167 EQU   @NM00166                                                 07791000
RBPGMQ1  EQU   RBPGMQ+1                                                 07792000
@NM00165 EQU   RBPGMQ                                                   07793000
@NM00164 EQU   RBSECT+16                                                07794000
@NM00163 EQU   @NM00159                                                 07795000
@NM00162 EQU   @NM00159                                                 07796000
RBIQETP  EQU   @NM00159                                                 07797000
RBUSIQE  EQU   RBETXR                                                   07798000
RBATTN   EQU   @NM00159                                                 07799000
@NM00161 EQU   @NM00159                                                 07800000
@NM00160 EQU   @NM00159                                                 07801000
RBPMSVRB EQU   @NM00157                                                 07802000
RBATNXIT EQU   @NM00157                                                 07803000
@NM00158 EQU   @NM00157                                                 07804000
RBWAITP  EQU   @NM00157                                                 07805000
RBFNSVRB EQU   RBTRSVRB                                                 07806000
RBFTP    EQU   @NM00157                                                 07807000
RBSIZE   EQU   RBSECT+8                                                 07808000
RBABOPSW EQU   RBSECT+4                                                 07809000
RBPPSAV1 EQU   RBPPSAV+1                                                07810000
@NM00155 EQU   RBPPSAV                                                  07811000
RBPRFXND EQU   RBPREFIX+64                                              07812000
RBINTCOD EQU   RBINTCDA+1                                               07813000
RBINLNTH EQU   RBINTCDA                                                 07814000
RBWCSA   EQU   RBPREFIX+60                                              07815000
RBRSV004 EQU   RBPREFIX+57                                              07816000
RBSSSYN  EQU   RBFLAGS1                                                 07817000
RBSCB    EQU   RBFLAGS1                                                 07818000
RBLONGWT EQU   RBFLAGS1                                                 07819000
RBASIR   EQU   RBFLAGS1                                                 07820000
RBRSV159 EQU   RBFLAGS1                                                 07821000
RBABEND  EQU   RBFLAGS1                                                 07822000
RBXWAIT  EQU   RBFLAGS1                                                 07823000
RBSLOCK  EQU   RBFLAGS1                                                 07824000
RBRTRAN  EQU   RBRTPSW2+4                                               07825000
RBRTINCD EQU   RBRTICIL+2                                               07826000
RBRTILC  EQU   RBRTICIL+1                                               07827000
RBRSV160 EQU   RBRTICIL                                                 07828000
RBRTPSW1 EQU   RBRTOPSW                                                 07829000
RBRSV062 EQU   RBRSV054                                                 07830000
RBRSV061 EQU   RBRSV054                                                 07831000
RBRSV060 EQU   RBRSV054                                                 07832000
RBRSV059 EQU   RBRSV054                                                 07833000
RBRSV058 EQU   RBRSV054                                                 07834000
RBRSV057 EQU   RBRSV054                                                 07835000
RBRSV056 EQU   RBRSV054                                                 07836000
RBRSV055 EQU   RBRSV054                                                 07837000
RBRSV053 EQU   RBPREFIX+38                                              07838000
RBRSV052 EQU   RBPREFIX+36                                              07839000
RBRSV051 EQU   RBPREFIX+32                                              07840000
RBPRFXST EQU   RBPREFIX+32                                              07841000
RBRSV050 EQU   RBPREFIX+28                                              07842000
RBRSV049 EQU   RBRSV041                                                 07843000
RBRSV048 EQU   RBRSV041                                                 07844000
RBRSV047 EQU   RBRSV041                                                 07845000
RBRSV046 EQU   RBRSV041                                                 07846000
RBRSV045 EQU   RBRSV041                                                 07847000
RBRSV044 EQU   RBRSV041                                                 07848000
RBRSV043 EQU   RBRSV041                                                 07849000
RBRSV042 EQU   RBRSV041                                                 07850000
RBRSV040 EQU   RBPREFIX+26                                              07851000
RBRSV039 EQU   RBPREFIX+24                                              07852000
RBRSV038 EQU   RBPREFIX+20                                              07853000
RBRSV037 EQU   RBPREFIX+16                                              07854000
RBRSV036 EQU   RBRSV028                                                 07855000
RBRSV035 EQU   RBRSV028                                                 07856000
RBRSV034 EQU   RBRSV028                                                 07857000
RBRSV033 EQU   RBRSV028                                                 07858000
RBRSV032 EQU   RBRSV028                                                 07859000
RBRSV031 EQU   RBRSV028                                                 07860000
RBRSV030 EQU   RBRSV028                                                 07861000
RBRSV029 EQU   RBRSV028                                                 07862000
RBRSV027 EQU   RBRSV019                                                 07863000
RBRSV026 EQU   RBRSV019                                                 07864000
RBRSV025 EQU   RBRSV019                                                 07865000
RBRSV024 EQU   RBRSV019                                                 07866000
RBRSV023 EQU   RBRSV019                                                 07867000
RBRSV022 EQU   RBRSV019                                                 07868000
RBRSV021 EQU   RBRSV019                                                 07869000
RBRSV020 EQU   RBRSV019                                                 07870000
RBRSV018 EQU   RBPREFIX+13                                              07871000
RBRSV017 EQU   RBPREFIX+12                                              07872000
RBSRV016 EQU   RBPREFIX+11                                              07873000
RBRSV015 EQU   RBPREFIX+10                                              07874000
RBRSV014 EQU   RBPREFIX+8                                               07875000
RBRSV013 EQU   RBPREFIX+4                                               07876000
RBRSV012 EQU   RBPREFIX                                                 07877000
RBEXSAVE EQU   XRBESA                                                   07878000
XRBREG15 EQU   RBGRS15                                                  07879000
XRBREG14 EQU   RBGRS14                                                  07880000
XRBREG13 EQU   RBGRS13                                                  07881000
XRBREG12 EQU   RBGRS12                                                  07882000
XRBREG11 EQU   RBGRS11                                                  07883000
XRBREG10 EQU   RBGRS10                                                  07884000
XRBREG9  EQU   RBGRS9                                                   07885000
XRBREG8  EQU   RBGRS8                                                   07886000
XRBREG7  EQU   RBGRS7                                                   07887000
XRBREG6  EQU   RBGRS6                                                   07888000
XRBREG5  EQU   RBGRS5                                                   07889000
XRBREG4  EQU   RBGRS4                                                   07890000
XRBREG3  EQU   RBGRS3                                                   07891000
XRBREG2  EQU   RBGRS2                                                   07892000
XRBREG1  EQU   RBGRS1                                                   07893000
XRBREG0  EQU   RBGRS0                                                   07894000
XRBLNKA  EQU   RBLINKB                                                  07895000
XRBWT    EQU   RBWCF                                                    07896000
@NM00154 EQU   RBBASIC+24                                               07897000
RBOPSWPS EQU   RBOPSWB2                                                 07898000
@NM00153 EQU   RBOPSWB2                                                 07899000
@NM00152 EQU   XRBPSW                                                   07900000
@NM00151 EQU   RBBASIC+12                                               07901000
XRBWAIT  EQU   RBECBWT                                                  07902000
XRBFRRB  EQU   RBFDYN                                                   07903000
@NM00150 EQU   XSTAB2                                                   07904000
XRBACTV  EQU   RBFACTV                                                  07905000
XRBTCBP  EQU   RBTCBNXT                                                 07906000
@NM00149 EQU   XSTAB1                                                   07907000
XRBCKPT  EQU   RBFTCKPT                                                 07908000
@NM00148 EQU   XSTAB1                                                   07909000
@NM00147 EQU   RBBASIC+8                                                07910000
@NM00146 EQU   RBEXRTNM+1                                               07911000
RBTMIND3 EQU   RBTMFLD                                                  07912000
RBTMIND2 EQU   RBTMFLD                                                  07913000
RBTMCMP  EQU   RBTMFLD                                                  07914000
RBWLIM   EQU   RBTMFLD                                                  07915000
RBRSV005 EQU   RBTMFLD                                                  07916000
RBTMTOD  EQU   RBTMFLD                                                  07917000
RBTMQUE  EQU   RBTMFLD                                                  07918000
@NM00145 EQU   RBPRFX                                                   07919000
@NM00144 EQU   SDWA+512                                                 07920000
SDWAVRA  EQU   SDWARA+4                                                 07921000
SDWAURAL EQU   SDWARA+3                                                 07922000
@NM00143 EQU   SDWADPVA                                                 07923000
SDWAEBC  EQU   SDWADPVA                                                 07924000
SDWAHEX  EQU   SDWADPVA                                                 07925000
SDWAVRAL EQU   SDWARA                                                   07926000
@NM00142 EQU   SDWA+396                                                 07927000
SDWACOMP EQU   SDWA+392                                                 07928000
SDWARCPL EQU   SDWA+364                                                 07929000
@NM00141 EQU   SDWADPSA+32                                              07930000
SDWATO4  EQU   SDWADPSL+28                                              07931000
SDWAFRM4 EQU   SDWADPSL+24                                              07932000
SDWATO3  EQU   SDWADPSL+20                                              07933000
SDWAFRM3 EQU   SDWADPSL+16                                              07934000
SDWATO2  EQU   SDWADPSL+12                                              07935000
SDWAFRM2 EQU   SDWADPSL+8                                               07936000
SDWATO1  EQU   SDWADPSL+4                                               07937000
SDWAFRM1 EQU   SDWADPSL                                                 07938000
@NM00140 EQU   SDWADDAT+3                                               07939000
@NM00139 EQU   SDWAPDAT                                                 07940000
SDWAUSPL EQU   SDWAPDAT                                                 07941000
SDWADPSW EQU   SDWAPDAT                                                 07942000
SDWATJPA EQU   SDWAPDAT                                                 07943000
SDWATLPA EQU   SDWAPDAT                                                 07944000
SDWADREG EQU   SDWAPDAT                                                 07945000
SDWADSAH EQU   SDWAPDAT                                                 07946000
SDWADSAS EQU   SDWAPDAT                                                 07947000
@NM00138 EQU   SDWADDAT+1                                               07948000
@NM00137 EQU   SDWASDAT                                                 07949000
SDWAQQS  EQU   SDWASDAT                                                 07950000
SDWACBS  EQU   SDWASDAT                                                 07951000
SDWAGTF  EQU   SDWASDAT                                                 07952000
SDWASWA  EQU   SDWASDAT                                                 07953000
SDWALSQA EQU   SDWASDAT                                                 07954000
SDWASQA  EQU   SDWASDAT                                                 07955000
SDWANUC  EQU   SDWASDAT                                                 07956000
@NM00136 EQU   SDWADUMP+2                                               07957000
@NM00135 EQU   SDWADPFS                                                 07958000
SDWASLST EQU   SDWADPFS                                                 07959000
@NM00134 EQU   SDWADPFS                                                 07960000
SDWADLST EQU   SDWADPFS                                                 07961000
SDWADPT  EQU   SDWADPFS                                                 07962000
SDWADPID EQU   SDWADUMP                                                 07963000
SDWADPLA EQU   SDWA+316                                                 07964000
SDWACSCT EQU   SDWARECP+8                                               07965000
SDWAMODN EQU   SDWARECP                                                 07966000
@NM00133 EQU   SDWALKWA+32                                              07967000
SDWATALW EQU   SDWALKWS+28                                              07968000
SDWATDLW EQU   SDWALKWS+24                                              07969000
SDWATNLW EQU   SDWALKWS+20                                              07970000
SDWAAPLW EQU   SDWALKWS+16                                              07971000
SDWAIPLW EQU   SDWALKWS+12                                              07972000
SDWAILLW EQU   SDWALKWS+8                                               07973000
SDWAIULW EQU   SDWALKWS+4                                               07974000
SDWAICLW EQU   SDWALKWS                                                 07975000
SDWAFLLK EQU   SDWAACF4                                                 07976000
SDWACMS  EQU   SDWAACF4                                                 07977000
SDWAOPTM EQU   SDWAACF4                                                 07978000
SDWATADB EQU   SDWAACF4                                                 07979000
SDWATDNB EQU   SDWAACF4                                                 07980000
SDWATNCB EQU   SDWAACF4                                                 07981000
SDWAILCH EQU   SDWAACF4                                                 07982000
SDWAIUCB EQU   SDWAACF4                                                 07983000
SDWAICAT EQU   SDWAACF3                                                 07984000
SDWAIPRG EQU   SDWAACF3                                                 07985000
SDWASALL EQU   SDWAACF3                                                 07986000
SDWAASMP EQU   SDWAACF3                                                 07987000
SDWADISP EQU   SDWAACF3                                                 07988000
@NM00132 EQU   SDWAACF3                                                 07989000
@NM00131 EQU   SDWAACF2                                                 07990000
SDWAFREE EQU   SDWAACF2                                                 07991000
@NM00130 EQU   SDWAACF2                                                 07992000
SDWASPIN EQU   SDWAACF2                                                 07993000
@NM00129 EQU   SDWAACF2                                                 07994000
SDWALCPU EQU   SDWACPUA+2                                               07995000
@NM00128 EQU   SDWACPUA                                                 07996000
SDWARECA EQU   SDWA+244                                                 07997000
@NM00127 EQU   SDWA+239                                                 07998000
@NM00126 EQU   SDWAIOFS                                                 07999000
SDWANIOP EQU   SDWAIOFS                                                 08000000
SDWANOIO EQU   SDWAIOFS                                                 08001000
SDWAIOHT EQU   SDWAIOFS                                                 08002000
SDWAIOQR EQU   SDWAIOFS                                                 08003000
SDWAFMID EQU   SDWA+236                                                 08004000
@NM00125 EQU   SDWAERRD                                                 08005000
SDWAMCIV EQU   SDWAERRD                                                 08006000
SDWARPIV EQU   SDWAERRD                                                 08007000
SDWAMABD EQU   SDWAERRD                                                 08008000
SDWACTS  EQU   SDWAERRD                                                 08009000
SDWASTAE EQU   SDWAERRD                                                 08010000
SDWANRBE EQU   SDWAERRD                                                 08011000
@NM00124 EQU   SDWAERRC                                                 08012000
SDWAIRB  EQU   SDWAERRC                                                 08013000
SDWASTAI EQU   SDWAERRC                                                 08014000
SDWASTAF EQU   SDWAERRC                                                 08015000
SDWASRBM EQU   SDWAERRB                                                 08016000
SDWALDIS EQU   SDWAERRB                                                 08017000
SDWAENRB EQU   SDWAERRB                                                 08018000
SDWATYP1 EQU   SDWAERRB                                                 08019000
@NM00123 EQU   SDWAERRB                                                 08020000
SDWAPGIO EQU   SDWAERRA                                                 08021000
SDWATEXC EQU   SDWAERRA                                                 08022000
SDWASVCE EQU   SDWAERRA                                                 08023000
SDWAABTM EQU   SDWAERRA                                                 08024000
SDWASVCD EQU   SDWAERRA                                                 08025000
SDWARKEY EQU   SDWAERRA                                                 08026000
SDWAPCHK EQU   SDWAERRA                                                 08027000
SDWATIME EQU   SDWAMCH+20                                               08028000
SDWARFSA EQU   SDWAMCH+16                                               08029000
@NM00122 EQU   SDWAMCH+14                                               08030000
SDWAVEQR EQU   SDWARSR2                                                 08031000
SDWAPGFX EQU   SDWARSR2                                                 08032000
SDWAFLSQ EQU   SDWARSR2                                                 08033000
SDWAFSQA EQU   SDWARSR2                                                 08034000
SDWANUCL EQU   SDWARSR2                                                 08035000
SDWASPER EQU   SDWARSR2                                                 08036000
SDWAINTC EQU   SDWARSR2                                                 08037000
SDWAOFLN EQU   SDWARSR2                                                 08038000
SDWACHNG EQU   SDWARSR1                                                 08039000
SDWAMSER EQU   SDWARSR1                                                 08040000
@NM00121 EQU   SDWARSR1                                                 08041000
SDWACPID EQU   SDWAMCH+10                                               08042000
SDWATERR EQU   SDWAMCHD                                                 08043000
SDWAFPRX EQU   SDWAMCHD                                                 08044000
SDWAINSF EQU   SDWAMCHD                                                 08045000
SDWAACR  EQU   SDWAMCHD                                                 08046000
SDWASCK  EQU   SDWAMCHD                                                 08047000
SDWAPSWU EQU   SDWAMCHD                                                 08048000
SDWAREGU EQU   SDWAMCHD                                                 08049000
SDWASKYF EQU   SDWAMCHD                                                 08050000
@NM00120 EQU   SDWAMCHS                                                 08051000
SDWARSRF EQU   SDWAMCHS                                                 08052000
SDWARSRC EQU   SDWAMCHS                                                 08053000
SDWAINVP EQU   SDWAMCHS                                                 08054000
SDWATSVL EQU   SDWAMCHS                                                 08055000
SDWARCDF EQU   SDWAMCHS                                                 08056000
SDWASRVL EQU   SDWAMCHS                                                 08057000
SDWASCKE EQU   SDWASTCK+4                                               08058000
SDWASCKB EQU   SDWASTCK                                                 08059000
SDWALNTH EQU   SDWAIDNT+1                                               08060000
SDWASPID EQU   SDWAIDNT                                                 08061000
SDWASR15 EQU   SDWASRSV+60                                              08062000
SDWASR13 EQU   SDWASRSV+52                                              08063000
SDWASR12 EQU   SDWASRSV+48                                              08064000
SDWASR08 EQU   SDWASRSV+32                                              08065000
SDWASR07 EQU   SDWASRSV+28                                              08066000
SDWASR06 EQU   SDWASRSV+24                                              08067000
SDWASR05 EQU   SDWASRSV+20                                              08068000
SDWASR04 EQU   SDWASRSV+16                                              08069000
SDWASR03 EQU   SDWASRSV+12                                              08070000
SDWASR02 EQU   SDWASRSV+8                                               08071000
SDWASR01 EQU   SDWASRSV+4                                               08072000
SDWASR00 EQU   SDWASRSV                                                 08073000
SDWATRN2 EQU   SDWAAEC2+4                                               08074000
SDWAIPC2 EQU   SDWAICD2                                                 08075000
SDWAIMC2 EQU   SDWAICD2                                                 08076000
SDWAIPR2 EQU   SDWAICD2                                                 08077000
@NM00119 EQU   SDWAINC2                                                 08078000
@NM00118 EQU   SDWAILC2                                                 08079000
SDWAIL2  EQU   SDWAILC2                                                 08080000
@NM00117 EQU   SDWAILC2                                                 08081000
@NM00116 EQU   SDWAAEC2                                                 08082000
SDWAADD2 EQU   SDWANXT2+1                                               08083000
@NM00115 EQU   SDWANXT2                                                 08084000
@NM00114 EQU   SDWAEC2+3                                                08085000
SDWASGN2 EQU   SDWAINT2                                                 08086000
SDWAEXP2 EQU   SDWAINT2                                                 08087000
SDWADEC2 EQU   SDWAINT2                                                 08088000
SDWAFPO2 EQU   SDWAINT2                                                 08089000
SDWACC2  EQU   SDWAINT2                                                 08090000
@NM00113 EQU   SDWAINT2                                                 08091000
SDWAPGM2 EQU   SDWAMWP2                                                 08092000
SDWAWAT2 EQU   SDWAMWP2                                                 08093000
SDWAMCK2 EQU   SDWAMWP2                                                 08094000
SDWAECT2 EQU   SDWAMWP2                                                 08095000
SDWAKEY2 EQU   SDWAMWP2                                                 08096000
SDWAEXT2 EQU   SDWAEMK2                                                 08097000
SDWAIO2  EQU   SDWAEMK2                                                 08098000
SDWATRM2 EQU   SDWAEMK2                                                 08099000
@NM00112 EQU   SDWAEMK2                                                 08100000
SDWAPER2 EQU   SDWAEMK2                                                 08101000
@NM00111 EQU   SDWAEMK2                                                 08102000
SDWATRAN EQU   SDWAAEC1+4                                               08103000
SDWAIPC1 EQU   SDWAICD1                                                 08104000
SDWAIMC1 EQU   SDWAICD1                                                 08105000
SDWAIPR1 EQU   SDWAICD1                                                 08106000
@NM00110 EQU   SDWAINC1                                                 08107000
@NM00109 EQU   SDWAILC1                                                 08108000
SDWAIL1  EQU   SDWAILC1                                                 08109000
@NM00108 EQU   SDWAILC1                                                 08110000
@NM00107 EQU   SDWAAEC1                                                 08111000
SDWAADD1 EQU   SDWANXT1+1                                               08112000
@NM00106 EQU   SDWANXT1                                                 08113000
@NM00105 EQU   SDWAEC1+3                                                08114000
SDWASGN1 EQU   SDWAINT1                                                 08115000
SDWAEXP1 EQU   SDWAINT1                                                 08116000
SDWADEC1 EQU   SDWAINT1                                                 08117000
SDWAFPO1 EQU   SDWAINT1                                                 08118000
SDWACC1  EQU   SDWAINT1                                                 08119000
@NM00104 EQU   SDWAINT1                                                 08120000
SDWAPGM1 EQU   SDWAMWP1                                                 08121000
SDWAWAT1 EQU   SDWAMWP1                                                 08122000
SDWAMCK1 EQU   SDWAMWP1                                                 08123000
SDWAECT1 EQU   SDWAMWP1                                                 08124000
SDWAKEY1 EQU   SDWAMWP1                                                 08125000
SDWAEXT1 EQU   SDWAEMK1                                                 08126000
SDWAIO1  EQU   SDWAEMK1                                                 08127000
SDWATRM1 EQU   SDWAEMK1                                                 08128000
@NM00103 EQU   SDWAEMK1                                                 08129000
SDWAPER1 EQU   SDWAEMK1                                                 08130000
@NM00102 EQU   SDWAEMK1                                                 08131000
SDWAIOBR EQU   SDWA+100                                                 08132000
SDWAEPA  EQU   SDWA+96                                                  08133000
@NM00101 EQU   SDWANAME+4                                               08134000
SDWARBAD EQU   SDWANAME                                                 08135000
SDWAGR15 EQU   SDWAGRSV+60                                              08136000
SDWAGR14 EQU   SDWAGRSV+56                                              08137000
SDWAGR13 EQU   SDWAGRSV+52                                              08138000
SDWAGR12 EQU   SDWAGRSV+48                                              08139000
SDWAGR11 EQU   SDWAGRSV+44                                              08140000
SDWAGR08 EQU   SDWAGRSV+32                                              08141000
SDWAGR07 EQU   SDWAGRSV+28                                              08142000
SDWAGR06 EQU   SDWAGRSV+24                                              08143000
SDWAGR05 EQU   SDWAGRSV+20                                              08144000
SDWAGR04 EQU   SDWAGRSV+16                                              08145000
SDWAGR03 EQU   SDWAGRSV+12                                              08146000
SDWAGR02 EQU   SDWAGRSV+8                                               08147000
SDWAGR01 EQU   SDWAGRSV+4                                               08148000
SDWAGR00 EQU   SDWAGRSV                                                 08149000
SDWANXTP EQU   SDWACTL2+5                                               08150000
SDWASGP  EQU   SDWAPMKP                                                 08151000
SDWAEUP  EQU   SDWAPMKP                                                 08152000
SDWADOP  EQU   SDWAPMKP                                                 08153000
SDWAFPP  EQU   SDWAPMKP                                                 08154000
SDWACCP  EQU   SDWAPMKP                                                 08155000
SDWAILP  EQU   SDWAPMKP                                                 08156000
SDWAINTP EQU   SDWACTL2+2                                               08157000
SDWASPVP EQU   SDWAMWPP                                                 08158000
SDWAWATP EQU   SDWAMWPP                                                 08159000
SDWAMCKP EQU   SDWAMWPP                                                 08160000
@NM00100 EQU   SDWAMWPP                                                 08161000
SDWAKEYP EQU   SDWAMWPP                                                 08162000
SDWAEXTP EQU   SDWACMKP                                                 08163000
SDWAIOP  EQU   SDWACMKP                                                 08164000
SDWANXTA EQU   SDWACTL1+5                                               08165000
SDWASGA  EQU   SDWAPMKA                                                 08166000
SDWAEUA  EQU   SDWAPMKA                                                 08167000
SDWADOA  EQU   SDWAPMKA                                                 08168000
SDWAFPA  EQU   SDWAPMKA                                                 08169000
SDWACCA  EQU   SDWAPMKA                                                 08170000
SDWAILA  EQU   SDWAPMKA                                                 08171000
SDWAINTA EQU   SDWACTL1+2                                               08172000
SDWASPVA EQU   SDWAMWPA                                                 08173000
SDWAWATA EQU   SDWAMWPA                                                 08174000
SDWAMCKA EQU   SDWAMWPA                                                 08175000
@NM00099 EQU   SDWAMWPA                                                 08176000
SDWAKEYA EQU   SDWAMWPA                                                 08177000
SDWAEXTA EQU   SDWACMKA                                                 08178000
SDWAIOA  EQU   SDWACMKA                                                 08179000
SDWACMPC EQU   SDWAABCC+1                                               08180000
@NM00098 EQU   SDWACMPF                                                 08181000
SDWASTCC EQU   SDWACMPF                                                 08182000
@NM00097 EQU   SDWACMPF                                                 08183000
SDWASTEP EQU   SDWACMPF                                                 08184000
SDWAREQ  EQU   SDWACMPF                                                 08185000
LPDEXTAD EQU   LPDEMJNM+4                                               08186000
LPDEXTLN EQU   LPDEMJNM                                                 08187000
LPDEATT3 EQU   LPDE+30                                                  08188000
LPDEAUTH EQU   LPDEATT2                                                 08189000
LPDESYSL EQU   LPDEATT2                                                 08190000
@NM00072 EQU   LPDEATT2                                                 08191000
@NM00071 EQU   LPDEATT2                                                 08192000
LPDERLC  EQU   LPDEATT2                                                 08193000
LPDEXLE  EQU   LPDEATT2                                                 08194000
@NM00070 EQU   LPDEATT2                                                 08195000
LPDENLR  EQU   LPDEATTR                                                 08196000
@NM00069 EQU   LPDEATTR                                                 08197000
LPDEMIN  EQU   LPDEATTR                                                 08198000
@NM00068 EQU   LPDEATTR                                                 08199000
LPDESER  EQU   LPDEATTR                                                 08200000
LPDEREN  EQU   LPDEATTR                                                 08201000
@NM00067 EQU   LPDEATTR                                                 08202000
LPDENIP  EQU   LPDEATTR                                                 08203000
@NM00066 EQU   LPDE+26                                                  08204000
LPDEUSE  EQU   LPDE+24                                                  08205000
LPDEXLP  EQU   LPDE+20                                                  08206000
LPDENTP  EQU   LPDE+16                                                  08207000
LPDERBP  EQU   LPDE+4                                                   08208000
LPDECHN  EQU   LPDE                                                     08209000
LCCAR125 EQU   LCCA+964                                                 08210000
LCCAR124 EQU   LCCA+960                                                 08211000
LCCASGPR EQU   LCCA+896                                                 08212000
LCCADRT2 EQU   LCCA+888                                                 08213000
LCCADRT1 EQU   LCCA+880                                                 08214000
LCCAR103 EQU   LCCA+876                                                 08215000
LCCAESS2 EQU   LCCA+872                                                 08216000
LCCASPLJ EQU   LCCA+868                                                 08217000
LCCASMQJ EQU   LCCA+864                                                 08218000
LCCAIRT  EQU   LCCA+736                                                 08219000
LCCAASID EQU   LCCA+732                                                 08220000
LCCARV89 EQU   LCCA+728                                                 08221000
LCCAPGTA EQU   LCCASRBF+2                                               08222000
LCCASAFN EQU   LCCASRBF                                                 08223000
LCCAECSA EQU   LCCA+716                                                 08224000
LCCAICR0 EQU   LCCA+712                                                 08225000
LCCALWTM EQU   LCCA+704                                                 08226000
LCCARV78 EQU   LCCA+700                                                 08227000
LCCAPINV EQU   LCCA+696                                                 08228000
LCCARV88 EQU   LCCA+695                                                 08229000
LCCARV87 EQU   LCCALKFG                                                 08230000
LCCARV86 EQU   LCCALKFG                                                 08231000
LCCARV85 EQU   LCCALKFG                                                 08232000
LCCARV84 EQU   LCCALKFG                                                 08233000
LCCALKRD EQU   LCCALKFG                                                 08234000
LCCALKAQ EQU   LCCALKFG                                                 08235000
LCCALKSA EQU   LCCALKFG                                                 08236000
LCCALKDP EQU   LCCALKFG                                                 08237000
LCCACRST EQU   LCCACREX                                                 08238000
LCCACRDP EQU   LCCACREX                                                 08239000
LCCACRLM EQU   LCCACREX                                                 08240000
LCCACRIN EQU   LCCACREX                                                 08241000
LCCACRRT EQU   LCCACREX                                                 08242000
LCCACRLE EQU   LCCACREX                                                 08243000
LCCACRRM EQU   LCCACREX                                                 08244000
LCCACREF EQU   LCCACREX                                                 08245000
LCCAVARY EQU   LCCACRFL                                                 08246000
LCCARV73 EQU   LCCACRFL                                                 08247000
LCCARV72 EQU   LCCACRFL                                                 08248000
LCCARV71 EQU   LCCACRFL                                                 08249000
LCCARV70 EQU   LCCACRFL                                                 08250000
LCCARV69 EQU   LCCACRFL                                                 08251000
LCCACLMS EQU   LCCACRFL                                                 08252000
LCCACRTM EQU   LCCACRFL                                                 08253000
LCCALCR0 EQU   LCCA+688                                                 08254000
LCCACRLC EQU   LCCA+684                                                 08255000
LCCARCPU EQU   LCCA+680                                                 08256000
LCCADCPU EQU   LCCA+676                                                 08257000
LCCASRBJ EQU   LCCA+672                                                 08258000
LCCADSSR EQU   LCCA+668                                                 08259000
LCCADSSC EQU   LCCA+660                                                 08260000
LCCADSS3 EQU   LCCA+648                                                 08261000
LCCADSS2 EQU   LCCA+636                                                 08262000
LCCADSS1 EQU   LCCA+624                                                 08263000
LCCAWTIM EQU   LCCA+616                                                 08264000
LCCAITOD EQU   LCCA+608                                                 08265000
LCCADTOD EQU   LCCA+600                                                 08266000
LCCASTOD EQU   LCCA+592                                                 08267000
LCCARIR5 EQU   LCCASPSA+44                                              08268000
LCCARIR4 EQU   LCCASPSA+40                                              08269000
LCCARIR3 EQU   LCCASPSA+36                                              08270000
LCCARIR2 EQU   LCCASPSA+32                                              08271000
LCCARPR5 EQU   LCCASPSA+28                                              08272000
LCCARPR4 EQU   LCCASPSA+24                                              08273000
LCCARPR3 EQU   LCCASPSA+20                                              08274000
LCCARPR2 EQU   LCCASPSA+16                                              08275000
LCCADSR5 EQU   LCCASPSA+12                                              08276000
LCCADSR4 EQU   LCCASPSA+8                                               08277000
LCCADSR3 EQU   LCCASPSA+4                                               08278000
LCCADSR2 EQU   LCCASPSA                                                 08279000
LCCARV68 EQU   LCCA+543                                                 08280000
LCCAPSMK EQU   LCCA+542                                                 08281000
LCCARV67 EQU   LCCADSF2                                                 08282000
LCCARV66 EQU   LCCADSF2                                                 08283000
LCCARV65 EQU   LCCADSF2                                                 08284000
LCCARV64 EQU   LCCADSF2                                                 08285000
LCCADSRW EQU   LCCADSF2                                                 08286000
LCCADSPL EQU   LCCADSF2                                                 08287000
LCCAGSRB EQU   LCCADSF2                                                 08288000
LCCASRBM EQU   LCCADSF2                                                 08289000
LCCARV61 EQU   LCCADSF1                                                 08290000
LCCARV60 EQU   LCCADSF1                                                 08291000
LCCARV59 EQU   LCCADSF1                                                 08292000
LCCARV58 EQU   LCCADSF1                                                 08293000
LCCATIMR EQU   LCCADSF1                                                 08294000
LCCADSS  EQU   LCCADSF1                                                 08295000
LCCAVCPU EQU   LCCADSF1                                                 08296000
LCCAACR  EQU   LCCADSF1                                                 08297000
LCCAASCP EQU   LCCA+532                                                 08298000
LCCAESSA EQU   LCCA+528                                                 08299000
LCCARV55 EQU   LCCASPN4                                                 08300000
LCCARV54 EQU   LCCASPN4                                                 08301000
LCCARV53 EQU   LCCASPN4                                                 08302000
LCCARV52 EQU   LCCASPN4                                                 08303000
LCCARV51 EQU   LCCASPN4                                                 08304000
LCCARV50 EQU   LCCASPN4                                                 08305000
LCCARV49 EQU   LCCASPN4                                                 08306000
LCCARV48 EQU   LCCASPN4                                                 08307000
LCCARV47 EQU   LCCASPN3                                                 08308000
LCCARV46 EQU   LCCASPN3                                                 08309000
LCCARV45 EQU   LCCASPN3                                                 08310000
LCCARV44 EQU   LCCASPN3                                                 08311000
LCCARV43 EQU   LCCASPN3                                                 08312000
LCCARV42 EQU   LCCASPN3                                                 08313000
LCCARV41 EQU   LCCASPN3                                                 08314000
LCCARV40 EQU   LCCASPN3                                                 08315000
LCCARV39 EQU   LCCASPN2                                                 08316000
LCCARV38 EQU   LCCASPN2                                                 08317000
LCCARV37 EQU   LCCASPN2                                                 08318000
LCCARV36 EQU   LCCASPN2                                                 08319000
LCCARV35 EQU   LCCASPN2                                                 08320000
LCCARV34 EQU   LCCASPN2                                                 08321000
LCCARV33 EQU   LCCASPN2                                                 08322000
LCCARV32 EQU   LCCASPN2                                                 08323000
LCCARV31 EQU   LCCASPN1                                                 08324000
LCCARV30 EQU   LCCASPN1                                                 08325000
LCCAMFIO EQU   LCCASPN1                                                 08326000
LCCARSTR EQU   LCCASPN1                                                 08327000
LCCATSPN EQU   LCCASPN1                                                 08328000
LCCALOCK EQU   LCCASPN1                                                 08329000
LCCASIGP EQU   LCCASPN1                                                 08330000
LCCAPTLB EQU   LCCASPN1                                                 08331000
LCCARV27 EQU   LCCAIHR4                                                 08332000
LCCARV26 EQU   LCCAIHR4                                                 08333000
LCCARV25 EQU   LCCAIHR4                                                 08334000
LCCARV24 EQU   LCCAIHR4                                                 08335000
LCCARV23 EQU   LCCAIHR4                                                 08336000
LCCARV22 EQU   LCCAIHR4                                                 08337000
LCCARV21 EQU   LCCAIHR4                                                 08338000
LCCARV20 EQU   LCCAIHR4                                                 08339000
LCCARV19 EQU   LCCAIHR3                                                 08340000
LCCARV18 EQU   LCCAIHR3                                                 08341000
LCCARV17 EQU   LCCAIHR3                                                 08342000
LCCARV16 EQU   LCCAIHR3                                                 08343000
LCCARV15 EQU   LCCAIHR3                                                 08344000
LCCARV14 EQU   LCCAIHR3                                                 08345000
LCCARV13 EQU   LCCAIHR3                                                 08346000
LCCARV12 EQU   LCCAIHR3                                                 08347000
LCCARV11 EQU   LCCAIHR2                                                 08348000
LCCARV10 EQU   LCCAIHR2                                                 08349000
LCCARV09 EQU   LCCAIHR2                                                 08350000
LCCARV08 EQU   LCCAIHR2                                                 08351000
LCCARV07 EQU   LCCAIHR2                                                 08352000
LCCARV06 EQU   LCCAIHR2                                                 08353000
LCCARV05 EQU   LCCAIHR2                                                 08354000
LCCARV04 EQU   LCCAIHR2                                                 08355000
LCCARV03 EQU   LCCAIHR1                                                 08356000
LCCARV02 EQU   LCCAIHR1                                                 08357000
LCCARV01 EQU   LCCAIHR1                                                 08358000
LCCAPPIE EQU   LCCAIHR1                                                 08359000
LCCAPSG1 EQU   LCCAIHR1                                                 08360000
LCCAPDAT EQU   LCCAIHR1                                                 08361000
LCCAXRC2 EQU   LCCAIHR1                                                 08362000
LCCAXRC1 EQU   LCCAIHR1                                                 08363000
LCCAIOPS EQU   LCCA+512                                                 08364000
LCCAGPGR EQU   LCCA+448                                                 08365000
LCCAR133 EQU   LCCA+444                                                 08366000
LCCAR132 EQU   LCCA+440                                                 08367000
LCCAR131 EQU   LCCA+436                                                 08368000
LCCAR130 EQU   LCCA+432                                                 08369000
LCCAR129 EQU   LCCA+428                                                 08370000
LCCAR128 EQU   LCCA+424                                                 08371000
LCCAR127 EQU   LCCA+420                                                 08372000
LCCAR126 EQU   LCCA+416                                                 08373000
LCCARSGR EQU   LCCA+352                                                 08374000
LCCAXGR3 EQU   LCCA+288                                                 08375000
LCCAXGR2 EQU   LCCA+224                                                 08376000
LCCAXGR1 EQU   LCCA+160                                                 08377000
LCCACR0  EQU   LCCA+156                                                 08378000
LCCAMCR1 EQU   LCCA+152                                                 08379000
LCCAPVAD EQU   LCCA+148                                                 08380000
LCCAPINT EQU   LCCA+144                                                 08381000
LCCAPPSW EQU   LCCA+136                                                 08382000
LCCAPGR1 EQU   LCCA+8                                                   08383000
LCCARV77 EQU   LCCA+6                                                   08384000
LCCACPUA EQU   LCCA+4                                                   08385000
LCCALCCA EQU   LCCA                                                     08386000
FRRSPARM EQU   FRRSENTR+8                                               08387000
@NM00065 EQU   FRRSFLGS+1                                               08388000
@NM00064 EQU   FRRSFLG1                                                 08389000
FRRSNEST EQU   FRRSFLG1                                                 08390000
FRRSRCUR EQU   FRRSFLG1                                                 08391000
FRRSFRRA EQU   FRRSENTR                                                 08392000
FRRSENTS EQU   FRRS+84                                                  08393000
FRRSRTMW EQU   FRRS+16                                                  08394000
FRRSCURR EQU   FRRSHEAD+12                                              08395000
FRRSELEN EQU   FRRSHEAD+8                                               08396000
FRRSLAST EQU   FRRSHEAD+4                                               08397000
FRRSEMP  EQU   FRRSHEAD                                                 08398000
DECWAREA EQU   DECBS04+44                                               08399000
DECWLNG  EQU   DECBS04+42                                               08400000
DECRSV56 EQU   DECBS04+40                                               08401000
DECPOLPA EQU   DECPOLPT+1                                               08402000
DECNDXPL EQU   DECPOLPT                                                 08403000
DECADRPT EQU   DECBS04+32                                               08404000
DECCSWST EQU   DECBS04+30                                               08405000
DECRSV55 EQU   DECERRST                                                 08406000
DECRSV54 EQU   DECERRST                                                 08407000
DECRSV53 EQU   DECERRST                                                 08408000
DECDSABL EQU   DECERRST                                                 08409000
DECDIAGN EQU   DECERRST                                                 08410000
DECERPER EQU   DECERRST                                                 08411000
DECUNDEF EQU   DECERRST                                                 08412000
DECSIO3  EQU   DECERRST                                                 08413000
DECTPCOD EQU   DECBS04+28                                               08414000
DECRESPN EQU   DECBS04+26                                               08415000
DECRLN   EQU   DECBS04+25                                               08416000
DECSTXNQ EQU   DECFLAGS                                                 08417000
DECSSMSG EQU   DECREVRS                                                 08418000
DECNEGRP EQU   DECFLAGS                                                 08419000
DECNOBUF EQU   DECFLAGS                                                 08420000
DECBADID EQU   DECFLAGS                                                 08421000
DECALTAC EQU   DECFLAGS                                                 08422000
DECDIFAC EQU   DECWACK                                                  08423000
DECERRMS EQU   DECWACK                                                  08424000
DECENTRA EQU   DECENTRY+1                                               08425000
DECCMCOD EQU   DECENTRY                                                 08426000
DECCOUNT EQU   DECBS04+18                                               08427000
DECSENS1 EQU   DECBS04+17                                               08428000
DECSENS0 EQU   DECBS04+16                                               08429000
@NM00063 EQU   DECBS04+12                                               08430000
DECDCBAA EQU   @NM00062+1                                               08431000
DECRSV52 EQU   DECONLTT                                                 08432000
DECRSV51 EQU   DECONLTT                                                 08433000
DECRSV50 EQU   DECONLTT                                                 08434000
DECRSV49 EQU   DECONLTT                                                 08435000
DECRSV48 EQU   DECONLTT                                                 08436000
DECRSV47 EQU   DECONLTT                                                 08437000
DECRCVMS EQU   DECONLTT                                                 08438000
DECONLTS EQU   DECONLTT                                                 08439000
@NM00061 EQU   DECBS04+6                                                08440000
@NM00060 EQU   @NM00058+1                                               08441000
DECSLNTH EQU   @NM00059                                                 08442000
DECSAREA EQU   @NM00059                                                 08443000
DECSTRME EQU   @NM00059                                                 08444000
DECRSV46 EQU   @NM00059                                                 08445000
DECRSV45 EQU   @NM00059                                                 08446000
DECRSV44 EQU   @NM00059                                                 08447000
DECRSV43 EQU   @NM00059                                                 08448000
DECRDAPL EQU   @NM00059                                                 08449000
@NM00057 EQU   DECBS04                                                  08450000
@NM00056 EQU   @NM00055+1                                               08451000
DECRSV42 EQU   @NM00055                                                 08452000
DECADRCH EQU   DECBS03+32                                               08453000
DECRSV41 EQU   DECBS03+28                                               08454000
DECRSV40 EQU   DECBS03+26                                               08455000
DECUCBDX EQU   DECBS03+25                                               08456000
DECRSV39 EQU   DECBS03+24                                               08457000
DECCPOLA EQU   DECCPOL+1                                                08458000
DECNMMSG EQU   DECCPOL                                                  08459000
DECRSV38 EQU   DECBS03+16                                               08460000
@NM00054 EQU   DECBS03+12                                               08461000
@NM00053 EQU   DECBS03+8                                                08462000
@NM00052 EQU   DECBS03+6                                                08463000
DECOPCOD EQU   DECBS03+5                                                08464000
DECRSV37 EQU   DECBS03+4                                                08465000
LINEDECB EQU   DECBS03                                                  08466000
DECNAA   EQU   DECNA+1                                                  08467000
DECRSV36 EQU   DECNA                                                    08468000
DECRECPT EQU   DECBS02+24                                               08469000
DECKYADR EQU   DECBS02+20                                               08470000
@NM00051 EQU   DECBS02+16                                               08471000
@NM00050 EQU   DECBS02+12                                               08472000
@NM00049 EQU   DECBS02+8                                                08473000
@NM00048 EQU   DECBS02+6                                                08474000
DECRSV35 EQU   @NM00047                                                 08475000
DECWRADD EQU   @NM00047                                                 08476000
DECSRKEY EQU   @NM00047                                                 08477000
DECOPRD  EQU   @NM00047                                                 08478000
DECTYPR  EQU   DECTYPRU                                                 08479000
DECTYPU  EQU   DECTYPRU                                                 08480000
DECBKLNS EQU   @NM00047                                                 08481000
DECKEYS  EQU   @NM00047                                                 08482000
DECRELBA EQU   @NM00046                                                 08483000
DECRDEX  EQU   @NM00046                                                 08484000
DECDYNBF EQU   @NM00046                                                 08485000
DECACTAD EQU   @NM00046                                                 08486000
DECFDBCK EQU   @NM00046                                                 08487000
DECEXSRC EQU   @NM00046                                                 08488000
DECOFLOW EQU   @NM00046                                                 08489000
DECVERFY EQU   @NM00046                                                 08490000
DECRSV34 EQU   @NM00043+3                                               08491000
DECCCKFF EQU   DECCC3                                                   08492000
DECCCOPT EQU   DECCC3                                                   08493000
DECCCSDK EQU   DECCC3                                                   08494000
DECCCWDI EQU   DECCC3                                                   08495000
DECCCNBK EQU   DECCC3                                                   08496000
DECCCEXS EQU   DECCC3                                                   08497000
DECCCWRI EQU   DECCC3                                                   08498000
DECRSV33 EQU   DECCC3                                                   08499000
DECCCREX EQU   DECCC2                                                   08500000
DECCCUER EQU   DECCC2                                                   08501000
DECCCEOD EQU   DECCC2                                                   08502000
DECCCERR EQU   DECCC2                                                   08503000
DECCCINV EQU   DECCC2                                                   08504000
DECCCNSP EQU   DECCC2                                                   08505000
DECCCRLC EQU   DECCC2                                                   08506000
DECCCRNF EQU   DECCC2                                                   08507000
@NM00044 EQU   @NM00043                                                 08508000
DECEXRKU EQU   DECBEXC2                                                 08509000
DECEXASR EQU   DECBEXC2                                                 08510000
DECRSV32 EQU   DECBEXC2                                                 08511000
DECRSV31 EQU   DECBEXC2                                                 08512000
DECRSV30 EQU   DECBEXC2                                                 08513000
DECRSV29 EQU   DECBEXC2                                                 08514000
DECRSV28 EQU   DECBEXC2                                                 08515000
DECRSV27 EQU   DECBEXC2                                                 08516000
DECEXDUP EQU   DECBEXC1                                                 08517000
DECEXOFL EQU   DECBEXC1                                                 08518000
DECEXUBK EQU   DECBEXC1                                                 08519000
DECEXERR EQU   DECBEXC1                                                 08520000
DECEXINV EQU   DECBEXC1                                                 08521000
DECEXNSP EQU   DECBEXC1                                                 08522000
DECEXRLC EQU   DECBEXC1                                                 08523000
DECEXRNF EQU   DECBEXC1                                                 08524000
DECBKEY  EQU   DECBS01+20                                               08525000
DECBLOGR EQU   DECBS01+16                                               08526000
DECBAREA EQU   DECBS01+12                                               08527000
DECBDCBA EQU   DECBS01+8                                                08528000
DECBLGTH EQU   DECBS01+6                                                08529000
DECRSV26 EQU   DECBTYP2                                                 08530000
DECRSV25 EQU   DECBTYP2                                                 08531000
DECBWRKN EQU   DECBTYP2                                                 08532000
DECBWRK  EQU   DECBTYP2                                                 08533000
DECRSV24 EQU   DECBTYP2                                                 08534000
DECBRDKU EQU   DECBTYP2                                                 08535000
DECRSV23 EQU   DECBTYP2                                                 08536000
DECBRDK  EQU   DECBTYP2                                                 08537000
DECBARS  EQU   DECBTYP1                                                 08538000
DECBLNS  EQU   DECBTYP1                                                 08539000
DECRSV22 EQU   DECBTYP1                                                 08540000
DECRSV21 EQU   DECBTYP1                                                 08541000
DECRSV20 EQU   DECBTYP1                                                 08542000
DECRSV19 EQU   DECBTYP1                                                 08543000
DECRSV18 EQU   DECBTYP1                                                 08544000
DECRSV17 EQU   DECBTYP1                                                 08545000
DECBRBA  EQU   DECBRB+1                                                 08546000
DECRSV16 EQU   DECBECBF                                                 08547000
DECRSV15 EQU   DECBECBF                                                 08548000
DECRSV14 EQU   DECBECBF                                                 08549000
DECRSV13 EQU   DECBECBF                                                 08550000
DECRSV12 EQU   DECBECBF                                                 08551000
DECRSV11 EQU   DECBECBF                                                 08552000
DECBPOST EQU   DECBECBF                                                 08553000
DECBWAIT EQU   DECBECBF                                                 08554000
DECNEXTA EQU   DECNEXT+1                                                08555000
DECRSV10 EQU   DECNEXT                                                  08556000
DECIOBPT EQU   DECB+16                                                  08557000
DECAREA  EQU   DECB+12                                                  08558000
DECDCBAD EQU   DECB+8                                                   08559000
DECLNGTH EQU   DECBPTR+2                                                08560000
DECWRSFR EQU   DECTYPE2                                                 08561000
DECRSV09 EQU   DECTYPE2                                                 08562000
DECWRSZ  EQU   DECTYPE2                                                 08563000
DECRSV08 EQU   DECTYPE2                                                 08564000
DECWRSD  EQU   DECTYPE2                                                 08565000
DECWRSF  EQU   DECTYPE2                                                 08566000
DECRDSB  EQU   DECTYPE2                                                 08567000
DECRDSF  EQU   DECTYPE2                                                 08568000
DECRSV07 EQU   DECTYPE1                                                 08569000
DECRSV06 EQU   DECTYPE1                                                 08570000
DECRSV05 EQU   DECTYPE1                                                 08571000
DECRSV04 EQU   DECTYPE1                                                 08572000
DECRSV03 EQU   DECTYPE1                                                 08573000
DECRSV02 EQU   DECTYPE1                                                 08574000
DECRSV01 EQU   DECTYPE1                                                 08575000
DECLNS   EQU   DECTYPE1                                                 08576000
DECSDECB EQU   DECB                                                     08577000
@NM00042 EQU   IHADCS28+1                                               08578000
@NM00041 EQU   DCBOPTCD                                                 08579000
DCBSRCHD EQU   DCBOPTZ                                                  08580000
@NM00040 EQU   DCBOPTCD                                                 08581000
DCBDEBA  EQU   DCBDEBAD+1                                               08582000
@NM00039 EQU   DCBIFLGS                                                 08583000
DCBIFIOE EQU   DCBIFLGS                                                 08584000
DCBCH12  EQU   DCBIFPCT                                                 08585000
DCBCH9   EQU   DCBIFPCT                                                 08586000
DCBIFEC  EQU   DCBIFLGS                                                 08587000
DCBMFSTI EQU   DCBMFDMD                                                 08588000
DCBMFAWR EQU   DCBMFSTK                                                 08589000
DCBMFUIP EQU   DCBMFTMD                                                 08590000
DCBMFIDW EQU   DCBMFLCP                                                 08591000
DCBMFWRK EQU   DCBMFMVP                                                 08592000
DCBMFRDQ EQU   DCBMFWRT                                                 08593000
DCBMFGTQ EQU   DCBMFPUT                                                 08594000
DCBMFSTL EQU   DCBMACF2                                                 08595000
DCBMFCK  EQU   DCBMFDMG                                                 08596000
DCBMFRDX EQU   DCBMFCHK                                                 08597000
DCBMFDBF EQU   DCBMFSBG                                                 08598000
DCBMFRDI EQU   DCBMFLCG                                                 08599000
DCBMFRDK EQU   DCBMFMVG                                                 08600000
DCBMFWRQ EQU   DCBMFRD                                                  08601000
DCBMFPTQ EQU   DCBMFGET                                                 08602000
DCBMFECP EQU   DCBMACF1                                                 08603000
DCBMRSTI EQU   DCBMRDMD                                                 08604000
DCBMRAWR EQU   DCBMRSTK                                                 08605000
DCBMRUIP EQU   DCBMRTMD                                                 08606000
DCBMRIDW EQU   DCBMRLCP                                                 08607000
DCBMRWRK EQU   DCBMRMVP                                                 08608000
DCBMRRDQ EQU   DCBMRWRT                                                 08609000
DCBMRGTQ EQU   DCBMRPUT                                                 08610000
DCBMRSTL EQU   DCBMACR2                                                 08611000
DCBMRCK  EQU   DCBMRDMG                                                 08612000
DCBPGFXA EQU   DCBMRRDX                                                 08613000
DCBMRDBF EQU   DCBMRSBG                                                 08614000
DCBMRRDI EQU   DCBMRLCG                                                 08615000
DCBMRRDK EQU   DCBMRMVG                                                 08616000
DCBMRWRQ EQU   DCBMRRD                                                  08617000
DCBMRPTQ EQU   DCBMRGET                                                 08618000
DCBMRECP EQU   DCBMACR1                                                 08619000
@NM00038 EQU   DCBIFLG                                                  08620000
DCBIBIOE EQU   DCBIFLG                                                  08621000
DCBICH12 EQU   DCBIBPCT                                                 08622000
DCBICH9  EQU   DCBIBPCT                                                 08623000
DCBIBEC  EQU   DCBIFLG                                                  08624000
DCBOFIOF EQU   DCBOFLGS                                                 08625000
DCBOFUEX EQU   DCBOFLGS                                                 08626000
DCBOFTM  EQU   DCBOFLGS                                                 08627000
DCBOFPPC EQU   DCBOFLGS                                                 08628000
DCBOFEOV EQU   DCBOFLGS                                                 08629000
DCBOFLRB EQU   DCBOFLGS                                                 08630000
DCBOFIOD EQU   DCBOFLWR                                                 08631000
DCBDDNAM EQU   IHADCS24                                                 08632000
DCBEXLSA EQU   DCBEXLST+1                                               08633000
DCBRECKL EQU   DCBRECFM                                                 08634000
DCBRECCC EQU   DCBRECFM                                                 08635000
DCBRECSB EQU   DCBRECFM                                                 08636000
DCBRECBR EQU   DCBRECFM                                                 08637000
DCBRECTO EQU   DCBRECLA                                                 08638000
DCBRECL  EQU   DCBRECLA                                                 08639000
DCBEODA  EQU   DCBEODAD+1                                               08640000
DCBBFA   EQU   DCBBFTEK                                                 08641000
DCBH0    EQU   DCBBFTEK                                                 08642000
DCBBFTKD EQU   DCBBFTEK                                                 08643000
DCBBFTE  EQU   DCBBFT                                                   08644000
DCBBFTKR EQU   DCBBFT                                                   08645000
DCBBFTS  EQU   DCBBFT                                                   08646000
DCBH1    EQU   DCBBFTEK                                                 08647000
DCBSVCXA EQU   DCBSVCXL+1                                               08648000
@NM00037 EQU   DCBSVCXL                                                 08649000
DCBODEBA EQU   DCBIOBAA                                                 08650000
@NM00036 EQU   DCBQSLM                                                  08651000
DCBUPDBT EQU   DCBQSLM                                                  08652000
DCBUPDCM EQU   DCBQSLM                                                  08653000
DCB1DVDS EQU   DCBQSLM                                                  08654000
@NM00035 EQU   DCBDSRG2                                                 08655000
DCBDSGTR EQU   DCBDSRG2                                                 08656000
DCBACBM  EQU   DCBDSRG2                                                 08657000
@NM00034 EQU   DCBDSRG2                                                 08658000
DCBDSGTQ EQU   DCBDSRG2                                                 08659000
DCBDSGTX EQU   DCBDSRG2                                                 08660000
DCBDSGGS EQU   DCBDSRG2                                                 08661000
DCBDSGU  EQU   DCBDSRG1                                                 08662000
DCBDSGPO EQU   DCBDSRG1                                                 08663000
@NM00033 EQU   DCBDSRG1                                                 08664000
@NM00032 EQU   DCBDSRG1                                                 08665000
DCBDSGCX EQU   DCBDSRG1                                                 08666000
DCBDSGDA EQU   DCBDSRG1                                                 08667000
DCBDSGPS EQU   DCBDSRG1                                                 08668000
DCBBUFL  EQU   IHADCS11+8                                               08669000
DCBBUFCA EQU   DCBBUFCB+1                                               08670000
DCBBUFNO EQU   DCBBUFCB                                                 08671000
DCBDEVT  EQU   DCBREL                                                   08672000
DCBKEYLE EQU   DCBRELB                                                  08673000
@NM00031 EQU   IHADCS01+5                                               08674000
@NM00030 EQU   IHADCS01+4                                               08675000
DCBDVTBA EQU   DCBDVTBL+1                                               08676000
@NM00029 EQU   DCBDVTBL                                                 08677000
DCBKEYCN EQU   IHADCS00+4                                               08678000
DCBRELAD EQU   IHADCS00                                                 08679000
@NM00028 EQU   IHADCB                                                   08680000
CDATTR3  EQU   CDENTRY+30                                               08681000
CDAUTH   EQU   CDATTR2                                                  08682000
CDSYSLIB EQU   CDATTR2                                                  08683000
CDOLY    EQU   CDATTR2                                                  08684000
@NM00027 EQU   CDATTR2                                                  08685000
CDRLC    EQU   CDATTR2                                                  08686000
CDXLE    EQU   CDATTR2                                                  08687000
CDREL    EQU   CDATTR2                                                  08688000
CDSPZ    EQU   CDATTR2                                                  08689000
CDNLR    EQU   CDATTR                                                   08690000
CDJPA    EQU   CDATTR                                                   08691000
CDMIN    EQU   CDATTR                                                   08692000
CDNFN    EQU   CDATTR                                                   08693000
CDSER    EQU   CDATTR                                                   08694000
CDREN    EQU   CDATTR                                                   08695000
CDNIC    EQU   CDATTR                                                   08696000
CDNIP    EQU   CDATTR                                                   08697000
@NM00026 EQU   CDENTRY+26                                               08698000
CDUSE    EQU   CDENTRY+24                                               08699000
CDXLMJP  EQU   CDENTRY+20                                               08700000
CDENTPT  EQU   CDENTRY+16                                               08701000
CDRRBP   EQU   CDENTRY+4                                                08702000
CDCHAIN  EQU   CDENTRY                                                  08703000
ASCBEND  EQU   ASCB+208                                                 08704000
ASCBSRBT EQU   ASCB+200                                                 08705000
ASCBSWTL EQU   ASCB+196                                                 08706000
ASCBRS14 EQU   ASCB+195                                                 08707000
ASCBSMCT EQU   ASCB+194                                                 08708000
ASCBRS12 EQU   ASCB+192                                                 08709000
ASCBPCTT EQU   ASCB+188                                                 08710000
ASCBVGTT EQU   ASCB+184                                                 08711000
ASCBLGCB EQU   ASCB+180                                                 08712000
ASCBMCC  EQU   ASCB+168                                                 08713000
ASCBRTWA EQU   ASCB+164                                                 08714000
ASCBIQEA EQU   ASCB+160                                                 08715000
ASCBXMPQ EQU   ASCB+156                                                 08716000
ASCBRS01 EQU   ASCB+154                                                 08717000
ASCBFMCT EQU   ASCB+152                                                 08718000
ASCBOUXB EQU   ASCB+148                                                 08719000
ASCBOUCB EQU   ASCB+144                                                 08720000
ASCBMECB EQU   ASCB+140                                                 08721000
ASCBQECB EQU   ASCB+136                                                 08722000
ASCBCMSB EQU   ASCB+132                                                 08723000
ASCBCMSF EQU   ASCB+128                                                 08724000
ASCBTCBS EQU   ASCB+124                                                 08725000
ASCBNVSC EQU   ASCB+122                                                 08726000
ASCBVSC  EQU   ASCB+120                                                 08727000
ASCBSRBS EQU   ASCB+118                                                 08728000
ASCBSSRB EQU   ASCB+116                                                 08729000
ASCBRV06 EQU   ASCBFLG2                                                 08730000
ASCBRV05 EQU   ASCBFLG2                                                 08731000
ASCBRV04 EQU   ASCBFLG2                                                 08732000
ASCBSNQS EQU   ASCBFLG2                                                 08733000
ASCBS2S  EQU   ASCBFLG2                                                 08734000
ASCBCEXT EQU   ASCBFLG2                                                 08735000
ASCBPXMT EQU   ASCBFLG2                                                 08736000
ASCBXMPT EQU   ASCBFLG2                                                 08737000
ASCBRF07 EQU   ASCBDSP1                                                 08738000
ASCBRF06 EQU   ASCBDSP1                                                 08739000
ASCBRF05 EQU   ASCBDSP1                                                 08740000
ASCBRF04 EQU   ASCBDSP1                                                 08741000
ASCBRF03 EQU   ASCBDSP1                                                 08742000
ASCBRF02 EQU   ASCBDSP1                                                 08743000
ASCBFAIL EQU   ASCBDSP1                                                 08744000
ASCBNOQ  EQU   ASCBDSP1                                                 08745000
ASCBSWCT EQU   ASCB+112                                                 08746000
ASCBASXB EQU   ASCB+108                                                 08747000
ASCBTMCH EQU   ASCB+104                                                 08748000
ASCBNSWP EQU   ASCBFLG1                                                 08749000
ASCBTYP1 EQU   ASCBFLG1                                                 08750000
ASCBSTND EQU   ASCBFLG1                                                 08751000
ASCBABNT EQU   ASCBFLG1                                                 08752000
ASCBTERM EQU   ASCBFLG1                                                 08753000
ASCBS3S  EQU   ASCBFLG1                                                 08754000
ASCBCMSH EQU   ASCBFLG1                                                 08755000
ASCBTOFF EQU   ASCBFLG1                                                 08756000
ASCBRF01 EQU   ASCBRCTF                                                 08757000
ASCBTMLW EQU   ASCBRCTF                                                 08758000
ASCBOUT  EQU   ASCBRCTF                                                 08759000
ASCBWAIT EQU   ASCBRCTF                                                 08760000
ASCBRV08 EQU   ASCBRCTF                                                 08761000
ASCBFQU  EQU   ASCBRCTF                                                 08762000
ASCBFRS  EQU   ASCBRCTF                                                 08763000
ASCBTMNO EQU   ASCBRCTF                                                 08764000
ASCBAFFN EQU   ASCBFW1                                                  08765000
ASCBDUMP EQU   ASCB+96                                                  08766000
ASCBQSVC EQU   ASCB+92                                                  08767000
ASCBUBET EQU   ASCB+88                                                  08768000
ASCBECB  EQU   ASCB+84                                                  08769000
ASCBJSTL EQU   ASCB+80                                                  08770000
ASCBEWST EQU   ASCB+72                                                  08771000
ASCBEJST EQU   ASCB+64                                                  08772000
ASCBTSB  EQU   ASCB+60                                                  08773000
ASCBCSCB EQU   ASCB+56                                                  08774000
ASCBRSM  EQU   ASCB+52                                                  08775000
ASCBLDA  EQU   ASCB+48                                                  08776000
ASCBSTOR EQU   ASCB+44                                                  08777000
ASCBDP   EQU   ASCB+43                                                  08778000
ASCBRV07 EQU   ASCB+42                                                  08779000
ASCBIOSM EQU   ASCB+40                                                  08780000
ASCBSEQN EQU   ASCB+38                                                  08781000
ASCBASID EQU   ASCB+36                                                  08782000
ASCBCPUS EQU   ASCB+32                                                  08783000
ASCBSPL  EQU   ASCB+28                                                  08784000
ASCBLSLQ EQU   ASCB+24                                                  08785000
ASCBFSLQ EQU   ASCB+20                                                  08786000
ASCBIOSP EQU   ASCB+16                                                  08787000
ASCBLOCK EQU   ASCB+12                                                  08788000
ASCBBWDP EQU   ASCB+8                                                   08789000
ASCBFWDP EQU   ASCB+4                                                   08790000
ASCBASCB EQU   ASCB                                                     08791000
ASCBEGIN EQU   ASCB                                                     08792000
IOBERRCT EQU   IOBSTDRD+30                                              08793000
IOBRSV19 EQU   IOBINCAM+1                                               08794000
IOBOLTST EQU   IOBBTAMF                                                 08795000
IOBRFTMG EQU   IOBBTAMF                                                 08796000
IOBRSV17 EQU   IOBBTAMF                                                 08797000
IOBRSV16 EQU   IOBBTAMF                                                 08798000
IOBRSV15 EQU   IOBBTAMF                                                 08799000
IOBRSV14 EQU   IOBBTAMF                                                 08800000
IOBINUSE EQU   IOBBTAMF                                                 08801000
IOBPRMER EQU   IOBBTAMF                                                 08802000
IOBRSTRB EQU   IOBRESTR+1                                               08803000
IOBREPOS EQU   IOBRESTR                                                 08804000
IOBRSV44 EQU   IOBFLAG4                                                 08805000
IOBJES3I EQU   IOBFLAG4                                                 08806000
IOBRSV42 EQU   IOBFLAG4                                                 08807000
IOBRSV41 EQU   IOBFLAG4                                                 08808000
IOBRSV40 EQU   IOBFLAG4                                                 08809000
IOBPMERR EQU   IOBFLAG4                                                 08810000
IOBCC3WE EQU   IOBFLAG4                                                 08811000
IOBGDPOL EQU   IOBFLAG4                                                 08812000
IOBSTRTB EQU   IOBSTART+1                                               08813000
IOBSIOCC EQU   IOBSTART                                                 08814000
IOBCSB7  EQU   IOBCSTAT                                                 08815000
IOBCSB6  EQU   IOBCSTAT                                                 08816000
IOBCSB5  EQU   IOBCSTAT                                                 08817000
IOBCSB4  EQU   IOBCSTAT                                                 08818000
IOBCSB3  EQU   IOBCSTAT                                                 08819000
IOBCSB2  EQU   IOBCSTAT                                                 08820000
IOBCSB1  EQU   IOBCSTAT                                                 08821000
IOBCSB0  EQU   IOBCSTAT                                                 08822000
IOBUSB7  EQU   IOBUSTAT                                                 08823000
IOBUSB6  EQU   IOBUSTAT                                                 08824000
IOBUSB5  EQU   IOBUSTAT                                                 08825000
IOBUSB4  EQU   IOBUSTAT                                                 08826000
IOBUSB3  EQU   IOBUSTAT                                                 08827000
IOBUSB2  EQU   IOBUSTAT                                                 08828000
IOBUSB1  EQU   IOBUSTAT                                                 08829000
IOBUSB0  EQU   IOBUSTAT                                                 08830000
IOBCMDA  EQU   IOBIOCSW                                                 08831000
IOBLOG   EQU   IOBFL3                                                   08832000
IOBJAM   EQU   IOBICL                                                   08833000
IOBMSG   EQU   IOBFL3                                                   08834000
IOBSDR   EQU   IOBCNC                                                   08835000
IOBACU   EQU   IOBFL3                                                   08836000
IOBCDC   EQU   IOBFL3                                                   08837000
IOBICC   EQU   IOBFL3                                                   08838000
IOBCCC   EQU   IOBFL3                                                   08839000
IOBECBPB EQU   IOBECBPT+1                                               08840000
IOBECBCC EQU   IOBECBPT                                                 08841000
IOBS1B7  EQU   IOBSENS1                                                 08842000
IOBS1B6  EQU   IOBSENS1                                                 08843000
IOBS1B5  EQU   IOBSENS1                                                 08844000
IOBS1B4  EQU   IOBSENS1                                                 08845000
IOBS1B3  EQU   IOBSENS1                                                 08846000
IOBS1B2  EQU   IOBSENS1                                                 08847000
IOBS1B1  EQU   IOBSENS1                                                 08848000
IOBS1B0  EQU   IOBSENS1                                                 08849000
IOBSNSC9 EQU   IOBS0B7                                                  08850000
IOBS0B6  EQU   IOBSENS0                                                 08851000
IOBS0B5  EQU   IOBSENS0                                                 08852000
IOBS0B4  EQU   IOBSENS0                                                 08853000
IOBS0B3  EQU   IOBSENS0                                                 08854000
IOBS0B2  EQU   IOBSENS0                                                 08855000
IOBS0B1  EQU   IOBSENS0                                                 08856000
IOBS0B0  EQU   IOBSENS0                                                 08857000
IOBPNCH  EQU   IOBFLAG2                                                 08858000
IOBSTATO EQU   IOBFLAG2                                                 08859000
IOBSKUPD EQU   IOBFLAG2                                                 08860000
IOBALTTR EQU   IOBFLAG2                                                 08861000
IOBRRT2  EQU   IOBRDHA0                                                 08862000
IOBRRT3  EQU   IOBPURGE                                                 08863000
IOBSENSE EQU   IOBFLAG2                                                 08864000
IOBHALT  EQU   IOBFLAG2                                                 08865000
IOBSPSVC EQU   IOBRSTRT                                                 08866000
IOBUNREL EQU   IOBFLAG1                                                 08867000
IOBIOERR EQU   IOBFLAG1                                                 08868000
IOBFCREX EQU   IOBCYCCK                                                 08869000
IOBRPSTN EQU   IOBFLAG1                                                 08870000
IOBERRTN EQU   IOBFLAG1                                                 08871000
IOBCMDCH EQU   IOBFLAG1                                                 08872000
IOBDATCH EQU   IOBFLAG1                                                 08873000
IOBCNOPA EQU   IOBPREFX+12                                              08874000
IOBCICB  EQU   IOBPREFX+8                                               08875000
IOBCECB  EQU   IOBPREFX+4                                               08876000
IOBCONOP EQU   IOBPREFX+3                                               08877000
IOBCINOP EQU   IOBPREFX+2                                               08878000
IOBRSV05 EQU   IOBPREFX+1                                               08879000
IOBPCI   EQU   IOBCFLG1                                                 08880000
IOBRSTCH EQU   IOBCFLG1                                                 08881000
IOBABAPP EQU   IOBCFLG1                                                 08882000
IOBPTST  EQU   IOBCFLG1                                                 08883000
IOBRSV04 EQU   IOBCFLG1                                                 08884000
IOBRSV03 EQU   IOBCFLG1                                                 08885000
IOBRSV02 EQU   IOBCFLG1                                                 08886000
IOBRSV01 EQU   IOBCFLG1                                                 08887000
DEBXSAMB EQU   DEBXTN+28                                                08888000
DEBXOPNJ EQU   DEBXTN+24                                                08889000
DEBXXARG EQU   DEBXTN+20                                                08890000
DEBXMCF2 EQU   DEBXTN+19                                                08891000
DEBXMCF1 EQU   DEBXTN+18                                                08892000
DEBXDSO2 EQU   DEBXTN+17                                                08893000
DEBXDSO1 EQU   DEBXTN+16                                                08894000
DEBXDBPR EQU   DEBXTN+12                                                08895000
DEBXDCBM EQU   DEBXTN+8                                                 08896000
DEBXDSAB EQU   DEBXTN+4                                                 08897000
DEBXRV48 EQU   DEBXTN+3                                                 08898000
DEBXRV47 EQU   DEBXFLG1                                                 08899000
DEBXRV46 EQU   DEBXFLG1                                                 08900000
DEBXRV45 EQU   DEBXFLG1                                                 08901000
DEBXRV44 EQU   DEBXFLG1                                                 08902000
DEBXRV43 EQU   DEBXFLG1                                                 08903000
DEBXDSSI EQU   DEBXFLG1                                                 08904000
DEBXTSKC EQU   DEBXFLG1                                                 08905000
DEBXCDCB EQU   DEBXFLG1                                                 08906000
DEBXLNGH EQU   DEBXTN                                                   08907000
DEBTBLOF EQU   DEBPREFX+14                                              08908000
DEBAMTYP EQU   DEBPREFX+13                                              08909000
DEBLNGTH EQU   DEBPREFX+12                                              08910000
DEBDCBMK EQU   DEBXTNP                                                  08911000
DEBDSCBA EQU   DEBPREFX+1                                               08912000
DEBWKARA EQU   DEBPREFX                                                 08913000
DEBXCEAD EQU   DEBXCEA+1                                                08914000
DEBXCENP EQU   DEBXCEAB                                                 08915000
DEBRSV35 EQU   DEBXCEAB                                                 08916000
DEBRSV34 EQU   DEBXCEAB                                                 08917000
DEBRSV33 EQU   DEBXCEAB                                                 08918000
DEBRSV32 EQU   DEBXCEAB                                                 08919000
DEBCEAD  EQU   DEBCEA+1                                                 08920000
DEBCENP  EQU   DEBCEAB                                                  08921000
DEBRSV31 EQU   DEBCEAB                                                  08922000
DEBRSV30 EQU   DEBCEAB                                                  08923000
DEBRSV29 EQU   DEBCEAB                                                  08924000
DEBRSV28 EQU   DEBCEAB                                                  08925000
DEBPCIAD EQU   DEBPCIA+1                                                08926000
DEBPCINP EQU   DEBPCIAB                                                 08927000
DEBRSV27 EQU   DEBPCIAB                                                 08928000
DEBRSV26 EQU   DEBPCIAB                                                 08929000
DEBRSV25 EQU   DEBPCIAB                                                 08930000
DEBRSV24 EQU   DEBPCIAB                                                 08931000
DEBSIOAD EQU   DEBSIOA+1                                                08932000
DEBSIONP EQU   DEBSIOAB                                                 08933000
DEBFIX   EQU   DEBSIOAB                                                 08934000
DEBIOVR  EQU   DEBSIOAB                                                 08935000
DEBSIOX  EQU   DEBSIOAB                                                 08936000
DEBPGFX  EQU   DEBSIOAB                                                 08937000
DEBEOEAD EQU   DEBEOEA+1                                                08938000
DEBEOENP EQU   DEBEOEAB                                                 08939000
DEBRSV22 EQU   DEBEOEAB                                                 08940000
DEBRSV21 EQU   DEBEOEAB                                                 08941000
DEBRSV20 EQU   DEBEOEAB                                                 08942000
DEBESMVR EQU   DEBEOEAB                                                 08943000
DEBSUBID EQU   DEBSUBNM                                                 08944000
DEBSIOA2 EQU   DEBACS08+24                                              08945000
DEBRPSIO EQU   DEBACS08+20                                              08946000
DEBFREED EQU   DEBACS08+16                                              08947000
@NM00025 EQU   DEBACS08+12                                              08948000
@NM00024 EQU   DEBACS08+8                                               08949000
DEBDISAD EQU   DEBACS08+4                                               08950000
@NM00023 EQU   DEBACS08                                                 08951000
DEBRPSST EQU   DEBACS07+64                                              08952000
DEBARECK EQU   DEBACS07+60                                              08953000
DEBAREWT EQU   DEBACS07+56                                              08954000
DEBACHK  EQU   DEBACS07+52                                              08955000
DEBAWRIT EQU   DEBACS07+48                                              08956000
DEBASETL EQU   DEBACS07+44                                              08957000
DEBAREAD EQU   DEBACS07+40                                              08958000
DEBCRECK EQU   DEBACS07+36                                              08959000
DEBCREWT EQU   DEBACS07+32                                              08960000
DEBCCHK  EQU   DEBACS07+28                                              08961000
DEBCWRIT EQU   DEBACS07+24                                              08962000
DEBCSETL EQU   DEBACS07+20                                              08963000
DEBCREAD EQU   DEBACS07+16                                              08964000
DEBWKPT5 EQU   DEBACS07+12                                              08965000
DEBWKPT4 EQU   DEBACS07+8                                               08966000
DEBGET   EQU   DEBACS07+4                                               08967000
@NM00022 EQU   DEBACS07                                                 08968000
DEBPUT   EQU   DEBACS06+4                                               08969000
DEBDCBFA EQU   DEBACS06                                                 08970000
DEBLUCBB EQU   DEBLUCBA+1                                               08971000
DEBRSV18 EQU   DEBLUCBA                                                 08972000
DEBFUCBB EQU   DEBFUCBA+1                                               08973000
DEBRSV17 EQU   DEBFUCBA                                                 08974000
DEBTCCWB EQU   DEBTCCWA+1                                               08975000
DEBRSV16 EQU   DEBTCCWA                                                 08976000
DEBTBFRB EQU   DEBTBFRA+1                                               08977000
DEBRSV15 EQU   DEBTBFRA                                                 08978000
DEBDBPEF EQU   DEBACS03+8                                               08979000
DEBDBPP  EQU   DEBACS03+4                                               08980000
DEBDTPP  EQU   DEBACS03                                                 08981000
DEBDBPE  EQU   DEBDBLK+1                                                08982000
DEBDBPT  EQU   DEBDBLK                                                  08983000
DEBEXTNM EQU   DEBDSNAM                                                 08984000
DEBLRECL EQU   DEBACSMD+14                                              08985000
DEBBLKSI EQU   DEBACSMD+12                                              08986000
DEBRSV14 EQU   DEBDSNM+4                                                08987000
DEBUTSAB EQU   DEBUTSAA+1                                               08988000
DEBRSV13 EQU   DEBUTSAA                                                 08989000
DEBVOLNM EQU   DEBACSMD+2                                               08990000
DEBVLSEQ EQU   DEBVOLSQ+1                                               08991000
DEBRSV42 EQU   DEBVOLBT                                                 08992000
DEBRSV41 EQU   DEBVOLBT                                                 08993000
DEBRSV40 EQU   DEBVOLBT                                                 08994000
DEBRSV39 EQU   DEBVOLBT                                                 08995000
DEBRSV38 EQU   DEBVOLBT                                                 08996000
DEBRSV37 EQU   DEBVOLBT                                                 08997000
DEBRSV36 EQU   DEBVOLBT                                                 08998000
DEBEXFUL EQU   DEBVOLBT                                                 08999000
DEBNMTRK EQU   DEBDASD+14                                               09000000
DEBENDHH EQU   DEBDASD+12                                               09001000
DEBENDCC EQU   DEBDASD+10                                               09002000
DEBSTRHH EQU   DEBDASD+8                                                09003000
DEBSTRCC EQU   DEBDASD+6                                                09004000
DEBBINUM EQU   DEBDASD+4                                                09005000
DEBUCBA  EQU   DEBUCBAD+1                                               09006000
DEBAPPB  EQU   DEBAPPAD+1                                               09007000
DEBEXSCL EQU   DEBAPPAD                                                 09008000
DEBDCBB  EQU   DEBDCBAD+1                                               09009000
DEBDEBID EQU   DEBPROTG                                                 09010000
DEBECBB  EQU   DEBECBAD+1                                               09011000
DEBPRIOR EQU   DEBECBAD                                                 09012000
DEBUSRPB EQU   DEBUSRPG+1                                               09013000
DEBNMEXT EQU   DEBUSRPG                                                 09014000
DEBRSV05 EQU   DEBBASIC+15                                              09015000
DEBXTNIN EQU   DEBFLGS1                                                 09016000
DEBAPFIN EQU   DEBFLGS1                                                 09017000
DEBF1CEV EQU   DEBFLGS1                                                 09018000
DEBCINDI EQU   DEBFLGS1                                                 09019000
DEBRSV02 EQU   DEBFLGS1                                                 09020000
DEBRSIOA EQU   DEBFLGS1                                                 09021000
DEBEOFDF EQU   DEBFLGS1                                                 09022000
DEBPWCKD EQU   DEBFLGS1                                                 09023000
DEBQSCNT EQU   DEBBASIC+13                                              09024000
DEBACCS  EQU   DEBOPATB                                                 09025000
DEBPOSIT EQU   DEBOPATB                                                 09026000
DEBZERO  EQU   DEBOPATB                                                 09027000
DEBABEND EQU   DEBOPATB                                                 09028000
DEBIRBB  EQU   DEBIRBAD+1                                               09029000
DEBRERR  EQU   DEBOFLGS                                                 09030000
DEBLABEL EQU   DEBOFLGS                                                 09031000
DEBSPLIT EQU   DEBOFLGS                                                 09032000
DEBDCB   EQU   DEBOFLGS                                                 09033000
DEBRLSE  EQU   DEBOFLGS                                                 09034000
DEBEOF   EQU   DEBOFLGS                                                 09035000
DEBDISP  EQU   DEBOFLGS                                                 09036000
DEBDEBB  EQU   DEBDEBAD+1                                               09037000
DEBAMLNG EQU   DEBDEBAD                                                 09038000
DEBNMSUB EQU   DEBTCBAD                                                 09039000
UCBERADR EQU   UCBUCS+12                                                09040000
UCBFCBID EQU   UCBUCS+8                                                 09041000
UCBERCNT EQU   UCBUCS+7                                                 09042000
UCBRSV51 EQU   UCBUCS+6                                                 09043000
UCBFCBPE EQU   UCBFCBOP                                                 09044000
UCBRSV49 EQU   UCBFCBOP                                                 09045000
UCBRSV48 EQU   UCBFCBOP                                                 09046000
UCBRSV47 EQU   UCBFCBOP                                                 09047000
UCBRSV46 EQU   UCBFCBOP                                                 09048000
UCBRSV45 EQU   UCBFCBOP                                                 09049000
UCBRSV44 EQU   UCBFCBOP                                                 09050000
UCBFCBO1 EQU   UCBFCBOP                                                 09051000
UCBUCSPE EQU   UCBUCSOP                                                 09052000
UCBRSV43 EQU   UCBUCSOP                                                 09053000
UCBRSV42 EQU   UCBUCSOP                                                 09054000
UCBRSV41 EQU   UCBUCSOP                                                 09055000
UCBRSV40 EQU   UCBUCSOP                                                 09056000
UCBRSV39 EQU   UCBUCSOP                                                 09057000
UCBUCSO2 EQU   UCBUCSOP                                                 09058000
UCBUCSO1 EQU   UCBUCSOP                                                 09059000
UCBUCSID EQU   UCBUCS                                                   09060000
UCBMDRBA EQU   UCBMDRBF+1                                               09061000
UCBRV075 EQU   UCBMDRBF                                                 09062000
UCBRV074 EQU   UCB3800X+32                                              09063000
UCBIMAGE EQU   UCB3800X+28                                              09064000
UCBFCBNM EQU   UCB3800X+24                                              09065000
UCBCHAR4 EQU   UCB3800X+20                                              09066000
UCBCHAR3 EQU   UCB3800X+16                                              09067000
UCBCHAR2 EQU   UCB3800X+12                                              09068000
UCBCHAR1 EQU   UCB3800X+8                                               09069000
UCBCGMID EQU   UCB3800X+4                                               09070000
UCBBRSTA EQU   UCBACTIV                                                 09071000
UCBRV063 EQU   UCBACTIV                                                 09072000
UCBRV062 EQU   UCBACTIV                                                 09073000
UCBRV061 EQU   UCBACTIV                                                 09074000
UCBRV060 EQU   UCBACTIV                                                 09075000
UCBRV059 EQU   UCBACTIV                                                 09076000
UCBRV058 EQU   UCBACTIV                                                 09077000
UCBRV057 EQU   UCBACTIV                                                 09078000
UCBRV050 EQU   UCB3800X+2                                               09079000
UCBCGMNO EQU   UCB3800X+1                                               09080000
UCBRV083 EQU   UCBOPTNS                                                 09081000
UCBBRSTR EQU   UCBOPTNS                                                 09082000
UCBRV056 EQU   UCBOPTNS                                                 09083000
UCBRV055 EQU   UCBOPTNS                                                 09084000
UCBRV054 EQU   UCBOPTNS                                                 09085000
UCBRV053 EQU   UCBOPTNS                                                 09086000
UCBRV052 EQU   UCBOPTNS                                                 09087000
UCBRV051 EQU   UCBOPTNS                                                 09088000
UCBRV073 EQU   UCB3540X+7                                               09089000
UCBRV072 EQU   UCBDKBYT                                                 09090000
UCBRV071 EQU   UCBDKBYT                                                 09091000
UCBRV070 EQU   UCBDKBYT                                                 09092000
UCBRV069 EQU   UCBDKBYT                                                 09093000
UCBRV068 EQU   UCBDKBYT                                                 09094000
UCBRV067 EQU   UCBDKBYT                                                 09095000
UCBVLVER EQU   UCBDKBYT                                                 09096000
UCBDKAMX EQU   UCBDKBYT                                                 09097000
UCBVLSER EQU   UCB3540X                                                 09098000
UCBRDATA EQU   UCBOCR+4                                                 09099000
UCBFRID  EQU   UCBOCR                                                   09100000
UCBCLN   EQU   UCBMT+14                                                 09101000
UCBERG   EQU   UCBMT+12                                                 09102000
UCBMS    EQU   UCBMT+11                                                 09103000
UCBNB    EQU   UCBMT+10                                                 09104000
UCBPW    EQU   UCBMT+9                                                  09105000
UCBPR    EQU   UCBMT+8                                                  09106000
UCBSIO   EQU   UCBMT+6                                                  09107000
UCBTW    EQU   UCBMT+5                                                  09108000
UCBTR    EQU   UCBMT+4                                                  09109000
UCBTWT   EQU   UCBMT+3                                                  09110000
UCBTRT   EQU   UCBMT+2                                                  09111000
UCBCTD   EQU   UCBMT                                                    09112000
UCBWTOID EQU   UCBCMEXT+17                                              09113000
UCBRV043 EQU   UCBCMEXT+16                                              09114000
UCBASID  EQU   UCBCMEXT+14                                              09115000
UCBMFCNT EQU   UCBCMEXT+12                                              09116000
UCBPMSK  EQU   UCBCMEXT+10                                              09117000
UCBCCWOF EQU   UCBCMEXT+8                                               09118000
UCBRV041 EQU   UCBCMEXT+6                                               09119000
UCBRV036 EQU   UCBFLP1                                                  09120000
UCBRV035 EQU   UCBFLP1                                                  09121000
UCBERLOG EQU   UCBFLP1                                                  09122000
UCBRV033 EQU   UCBFLP1                                                  09123000
UCBINHIO EQU   UCBFLP1                                                  09124000
UCBNSWAP EQU   UCBFLP1                                                  09125000
UCBSHRUP EQU   UCBFLP1                                                  09126000
UCBNSRCH EQU   UCBFLP1                                                  09127000
UCBSNSCT EQU   UCBCMEXT+4                                               09128000
UCBHPDV  EQU   @NM00021                                                 09129000
UCBHALI  EQU   @NM00021                                                 09130000
UCBRSV09 EQU   @NM00021                                                 09131000
UCBRSV08 EQU   @NM00021                                                 09132000
UCBRSV07 EQU   @NM00021                                                 09133000
UCBRSV06 EQU   @NM00021                                                 09134000
UCBRSV05 EQU   @NM00021                                                 09135000
UCBRSV04 EQU   @NM00021                                                 09136000
UCBDTI   EQU   UCBCMEXT+2                                               09137000
UCBSTI   EQU   UCBCMEXT+1                                               09138000
UCBETI   EQU   UCBCMEXT                                                 09139000
UCBEXTP  EQU   UCBEXTPT+1                                               09140000
UCBDDRSW EQU   UCBFLC                                                   09141000
UCBTICBT EQU   UCBFLC                                                   09142000
UCBIVRR  EQU   UCBFLC                                                   09143000
UCBIVRS  EQU   UCBFLC                                                   09144000
UCBITF   EQU   UCBFLC                                                   09145000
UCBUDE   EQU   UCBFLC                                                   09146000
UCBWAA   EQU   UCBFLC                                                   09147000
UCBATTP  EQU   UCBFLC                                                   09148000
UCBUNTYP EQU   UCBTBYT4                                                 09149000
UCBRSV11 EQU   UCBDVCLS                                                 09150000
UCBRSV10 EQU   UCBDVCLS                                                 09151000
UCB3CHAR EQU   UCBDVCLS                                                 09152000
UCB3UREC EQU   UCBDVCLS                                                 09153000
UCB3DISP EQU   UCBDVCLS                                                 09154000
UCB3DACC EQU   UCBDVCLS                                                 09155000
UCB3COMM EQU   UCBDVCLS                                                 09156000
UCB3TAPE EQU   UCBDVCLS                                                 09157000
UCBDVPWR EQU   UCB2OPT7                                                 09158000
UCBVLPWR EQU   UCB2OPT6                                                 09159000
UCB2OPT5 EQU   UCBTBYT2                                                 09160000
UCBRVDEV EQU   UCBRWTAU                                                 09161000
UCBRPS   EQU   UCBDUDN2                                                 09162000
UCBRR    EQU   UCBDUDN1                                                 09163000
UCB2OPT1 EQU   UCBTBYT2                                                 09164000
UCB2OPT0 EQU   UCBTBYT2                                                 09165000
UCB1FEA7 EQU   UCBTBYT1                                                 09166000
UCBD6250 EQU   UCB1FEA6                                                 09167000
UCBD1600 EQU   UCB1FEA5                                                 09168000
UCB1FEA4 EQU   UCBTBYT1                                                 09169000
UCB1FEA3 EQU   UCBTBYT1                                                 09170000
UCB1FEA2 EQU   UCBTBYT1                                                 09171000
UCB1FEA1 EQU   UCBTBYT1                                                 09172000
UCB1FEA0 EQU   UCBTBYT1                                                 09173000
UCBNAME  EQU   UCBOB+13                                                 09174000
UCBRV029 EQU   UCBWGT                                                   09175000
UCBVHRSN EQU   UCBWGT                                                   09176000
UCBVORSN EQU   UCBWGT                                                   09177000
UCBMTPXP EQU   UCBWGT                                                   09178000
UCBREW   EQU   UCBWGT                                                   09179000
UCBPUB   EQU   UCBWGT                                                   09180000
UCBOUT   EQU   UCBWGT                                                   09181000
UCBIN    EQU   UCBWGT                                                   09182000
UCBCPU   EQU   UCBOB+11                                                 09183000
UCBLCI   EQU   UCBOB+10                                                 09184000
UCBCNT   EQU   UCBOB+9                                                  09185000
UCBRV017 EQU   UCBCHM1                                                  09186000
UCBRV016 EQU   UCBCHM1                                                  09187000
UCBRV015 EQU   UCBCHM1                                                  09188000
UCBRV014 EQU   UCBCHM1                                                  09189000
UCBSPB   EQU   UCBPTH1                                                  09190000
UCBPPB   EQU   UCBPTH1                                                  09191000
UCBSPA   EQU   UCBPTH0                                                  09192000
UCBPPA   EQU   UCBPTH0                                                  09193000
UCBSIGP  EQU   UCBFLB                                                   09194000
UCBVALPH EQU   UCBFLB                                                   09195000
UCBCRHSN EQU   UCBFLB                                                   09196000
UCBCRHRV EQU   UCBFLB                                                   09197000
UCBRESVH EQU   UCBFLB                                                   09198000
UCBSPST  EQU   UCBFLB                                                   09199000
UCBASNS  EQU   UCBFLB                                                   09200000
UCBIORST EQU   UCBFLB                                                   09201000
UCBQISCE EQU   UCBFL1                                                   09202000
UCBACTV  EQU   UCBFL1                                                   09203000
UCBSAP   EQU   UCBFL1                                                   09204000
UCBNOTRC EQU   UCBCUB                                                   09205000
UCBPSNS  EQU   UCBFL1                                                   09206000
UCBUSING EQU   UCBPST                                                   09207000
UCBNOTRD EQU   UCBNRY                                                   09208000
UCBBUSYD EQU   UCBBSY                                                   09209000
UCBUA    EQU   UCBCHAN+1                                                09210000
UCBCHA   EQU   UCBCHAN                                                  09211000
UCBDADI  EQU   UCBSTAT                                                  09212000
UCBSYSR  EQU   UCBSTAT                                                  09213000
UCBPRES  EQU   UCBSTAT                                                  09214000
UCBALOC  EQU   UCBSTAT                                                  09215000
UCBUNLD  EQU   UCBSTAT                                                  09216000
UCBRESV  EQU   UCBSTAT                                                  09217000
UCBCHGS  EQU   UCBSTAT                                                  09218000
UCBONLI  EQU   UCBSTAT                                                  09219000
UCBID    EQU   UCBOB+2                                                  09220000
UCBALTPH EQU   UCBFL5                                                   09221000
UCBALTCU EQU   UCBFL5                                                   09222000
UCBNALOC EQU   UCBFL5                                                   09223000
UCBENVRD EQU   UCBFL5                                                   09224000
UCBVSDR  EQU   UCBFL5                                                   09225000
UCBSASK  EQU   UCBFL5                                                   09226000
UCBAMV   EQU   UCBAF                                                    09227000
UCBDCC   EQU   UCBFL5                                                   09228000
UCBMONT  EQU   UCBJBNR                                                  09229000
UCBRV011 EQU   UCBJBNR                                                  09230000
UCBMMSGP EQU   UCBJBNR                                                  09231000
UCBOLDSM EQU   UCBJBNR                                                  09232000
UCBRV003 EQU   UCBJBNR                                                  09233000
UCBDUC   EQU   UCBJBNR                                                  09234000
UCBJES3  EQU   UCBJBNR                                                  09235000
UCBVRDEV EQU   UCBJBNR                                                  09236000
UCBCMSEG EQU   UCBOB                                                    09237000
UCBPFXND EQU   UCB+512                                                  09238000
UCBIOQ   EQU   UCB+508                                                  09239000
UCBLOCK  EQU   UCB+504                                                  09240000
UCBPXST  EQU   UCB+504                                                  09241000
@NM00018 EQU   UCB                                                      09242000
IOSEND   EQU   IOSB+108                                                 09243000
IOSSKR   EQU   IOSEEKA+7                                                09244000
IOSSKH2  EQU   IOSSKHH+1                                                09245000
IOSSKH1  EQU   IOSSKHH                                                  09246000
IOSSKCC  EQU   IOSCCHH                                                  09247000
IOSSKBB  EQU   IOSEEKA+1                                                09248000
IOSSKM   EQU   IOSEEKA                                                  09249000
IOSEEK   EQU   IOSB+92                                                  09250000
IOSMDM   EQU   IOSB+91                                                  09251000
IOSMDB   EQU   IOSB+90                                                  09252000
IOSCKEY7 EQU   IOSCKEY                                                  09253000
IOSCKEY6 EQU   IOSCKEY                                                  09254000
IOSCKEY5 EQU   IOSCKEY                                                  09255000
IOSCKEY4 EQU   IOSCKEY                                                  09256000
@NM00014 EQU   IOSCKEY                                                  09257000
IOSFMSK  EQU   IOSB+88                                                  09258000
IOSCUDEV EQU   IOSPATH+1                                                09259000
@NM00013 EQU   IOSCHN                                                   09260000
IOSPATH3 EQU   IOSCHN                                                   09261000
IOSPATH2 EQU   IOSCHN                                                   09262000
IOSEXP   EQU   IOSCHN                                                   09263000
IOSGDP   EQU   IOSCHN                                                   09264000
IOSAFF   EQU   IOSB+85                                                  09265000
IOSRSS1B EQU   IOSB+84                                                  09266000
IOSVST   EQU   IOSB+76                                                  09267000
IOSRST   EQU   IOSB+72                                                  09268000
IOSDIE   EQU   IOSB+68                                                  09269000
IOSABN   EQU   IOSB+64                                                  09270000
IOSNRM   EQU   IOSB+60                                                  09271000
IOSPCI   EQU   IOSB+56                                                  09272000
IOSERP   EQU   IOSB+52                                                  09273000
IOSPCHN  EQU   IOSB+48                                                  09274000
IOSSNS   EQU   IOSB+42                                                  09275000
IOSAPMSK EQU   IOSB+40                                                  09276000
IOSRES4A EQU   IOSB+36                                                  09277000
IOSUSE   EQU   IOSB+32                                                  09278000
IOSCSWRC EQU   IOSCSW+5                                                 09279000
IOSTSB   EQU   IOSTATUS+1                                               09280000
IOSTSA   EQU   IOSTATUS                                                 09281000
IOSCSWCA EQU   IOSCSW                                                   09282000
IOSCC    EQU   @NM00012                                                 09283000
IOSOPT2X EQU   IOSOPT2                                                  09284000
IOSIGP   EQU   IOSOPT2                                                  09285000
IOSHTP   EQU   IOSOPT2                                                  09286000
IOSRELSE EQU   IOSOPT                                                   09287000
IOSAPR   EQU   IOSOPT                                                   09288000
IOSTSLL  EQU   IOSOPT                                                   09289000
IOSNERP  EQU   IOSOPT                                                   09290000
IOSPSLL  EQU   IOSOPT                                                   09291000
IOSQISCE EQU   IOSOPT                                                   09292000
IOSDEP   EQU   IOSOPT                                                   09293000
IOSBYP   EQU   IOSOPT                                                   09294000
IOSCOD   EQU   IOSB+13                                                  09295000
IOSPKY7  EQU   IOSPKEY                                                  09296000
IOSPGDPX EQU   IOSPKEY                                                  09297000
IOSIDR   EQU   IOSPKEY                                                  09298000
IOSLCL   EQU   IOSPKEY                                                  09299000
@NM00011 EQU   IOSPKEY                                                  09300000
IOSPGAD  EQU   IOSB+8                                                   09301000
IOSASID  EQU   IOSB+6                                                   09302000
IOSPRLVL EQU   IOSB+5                                                   09303000
IOSDVRID EQU   IOSB+4                                                   09304000
IOSPROC  EQU   IOSB+3                                                   09305000
IOSFLC7  EQU   IOSFLC                                                   09306000
IOSCTCNR EQU   IOSFLC                                                   09307000
IOSRWAIT EQU   IOSFLC                                                   09308000
IOSTP    EQU   IOSFLC                                                   09309000
IOSCC3WE EQU   IOSFLC                                                   09310000
IOSVERIF EQU   IOSDVALT                                                 09311000
IOSDVMNT EQU   IOSFLC                                                   09312000
IOSLOG   EQU   IOSFLB                                                   09313000
IOSBDCST EQU   IOSFLB                                                   09314000
IOSMSG   EQU   IOSFLB                                                   09315000
IOSFLB4  EQU   IOSFLB                                                   09316000
IOSFLB3  EQU   IOSFLB                                                   09317000
IOSNOTRS EQU   IOSFLB                                                   09318000
IOSSDR   EQU   IOSFLB                                                   09319000
IOSDIESE EQU   IOSFLB                                                   09320000
IOSIOSB  EQU   IOSFLA                                                   09321000
IOSDOM   EQU   IOSFLA                                                   09322000
IOSEX    EQU   IOSFLA                                                   09323000
IOSSMDB  EQU   IOSFLA                                                   09324000
IOSSMDA  EQU   IOSFLA                                                   09325000
IOSERR   EQU   IOSFLA                                                   09326000
IOSCCHN  EQU   IOSACHN                                                  09327000
IOSDCHN  EQU   IOSACHN                                                  09328000
TRANSMAX EQU   GTFPCT+304                                               09329000
@NM00010 EQU   AUDITFLG+3                                               09330000
AFSLEBLD EQU   AUDITFLG+3                                               09331000
WSERFG06 EQU   AUDITFLG+3                                               09332000
WSERFG05 EQU   AUDITFLG+3                                               09333000
WSERFG04 EQU   AUDITFLG+3                                               09334000
WSERFG03 EQU   AUDITFLG+3                                               09335000
WSERFG02 EQU   AUDITFLG+2                                               09336000
WSERFLAG EQU   AUDITFLG+2                                               09337000
TERMFLAG EQU   AUDITFLG+2                                               09338000
AFXWRIT  EQU   AUDITFLG+2                                               09339000
AFQLWAIT EQU   AUDITFLG+2                                               09340000
AFSLEGET EQU   AUDITFLG+2                                               09341000
AFBUFGET EQU   AUDITFLG+2                                               09342000
AFFEOB   EQU   AUDITFLG+2                                               09343000
AFBLKFIX EQU   AUDITFLG+1                                               09344000
AFEQFIX  EQU   AUDITFLG+1                                               09345000
AFPGRLSE EQU   AUDITFLG+1                                               09346000
AFWRAP   EQU   AUDITFLG+1                                               09347000
AFBUFOFF EQU   AUDITFLG+1                                               09348000
AFLDFX   EQU   AUDITFLG+1                                               09349000
AFCLOSE  EQU   AUDITFLG+1                                               09350000
AFOPEN   EQU   AUDITFLG+1                                               09351000
AFGMBLOK EQU   AUDITFLG                                                 09352000
AFGMSRB  EQU   AUDITFLG                                                 09353000
AFWAIT   EQU   AUDITFLG                                                 09354000
AFTERM   EQU   AUDITFLG                                                 09355000
AFINIT   EQU   AUDITFLG                                                 09356000
AFWWRIT  EQU   AUDITFLG                                                 09357000
AFCWRIT  EQU   AUDITFLG                                                 09358000
AFIWRIT  EQU   AUDITFLG                                                 09359000
EQSHORT  EQU   GTFPCT+292                                               09360000
SLEMAX   EQU   GTFPCT+288                                               09361000
SLECNT   EQU   GTFPCT+284                                               09362000
RQPURGE  EQU   GTFPCT+280                                               09363000
RQTOTAL  EQU   GTFPCT+276                                               09364000
WRTDLST  EQU   GTFPCT+272                                               09365000
NUMOFBUF EQU   GTFPCT+268                                               09366000
SBUFDISA EQU   GTFPCT+264                                               09367000
SLESUSED EQU   GTFPCT+260                                               09368000
EQMIN    EQU   GTFPCT+256                                               09369000
EQLENGTH EQU   GTFPCT+252                                               09370000
WQMAX    EQU   GTFPCT+248                                               09371000
WQLENGTH EQU   GTFPCT+244                                               09372000
QLECBP   EQU   QLOCKECB                                                 09373000
@NM00009 EQU   QLOCKECB                                                 09374000
@NM00008 EQU   QLOCKWRD+3                                               09375000
SCHEDBUF EQU   QLOCKWRD+2                                               09376000
POSTWRIT EQU   QLOCKWRD+1                                               09377000
QLOCK    EQU   QLOCKWRD                                                 09378000
WRITERDD EQU   GTFPCT+228                                               09379000
GTFLOSTR EQU   GTFPCT+224                                               09380000
SRBAVAIL EQU   GTFSSRB                                                  09381000
WRTRERRP EQU   WRTRERR                                                  09382000
@NM00007 EQU   WRTRERR                                                  09383000
TRMWRITP EQU   TRMWRIT                                                  09384000
@NM00006 EQU   TRMWRIT                                                  09385000
GTFCMECB EQU   GTFPCT+208                                               09386000
WRTRCOMP EQU   WRTRCOM                                                  09387000
@NM00005 EQU   WRTRCOM                                                  09388000
TRANSCNT EQU   GTFPCT+200                                               09389000
AHLRDPLQ EQU   GTFPCT+196                                               09390000
SFEOBRTN EQU   GTFPCT+192                                               09391000
CURRBLOK EQU   GTFPCT+184                                               09392000
GBCDS    EQU   NEXTBLOK                                                 09393000
WSMODEND EQU   GTFPCT+176                                               09394000
WSMODBEG EQU   GTFPCT+172                                               09395000
BCBPAGE  EQU   GTFPCT+156                                               09396000
SLEPAGE  EQU   GTFPCT+152                                               09397000
SAVECNT  EQU   GTFPCT+148                                               09398000
SLQHEAD  EQU   GTFPCT+144                                               09399000
HQLENGTH EQU   GTFPCT+140                                               09400000
QTAIL    EQU   GTFPCT+136                                               09401000
HQHEAD   EQU   GTFPCT+132                                               09402000
WQHEAD   EQU   GTFPCT+128                                               09403000
RQHEAD   EQU   GTFPCT+124                                               09404000
EQHEAD   EQU   GTFPCT+120                                               09405000
WPOSTSRB EQU   GTFPCT+116                                               09406000
WTSKTCBA EQU   GTFPCT+112                                               09407000
WRTRTCBA EQU   GTFPCT+108                                               09408000
TRMWTASK EQU   GTFPCT+104                                               09409000
WTSKATTH EQU   GTFPCT+100                                               09410000
WTSKINIT EQU   GTFPCT+96                                                09411000
WTASKECB EQU   GTFPCT+92                                                09412000
WMTABPTR EQU   GTFPCT+88                                                09413000
ATTCHECB EQU   GTFPCT+84                                                09414000
AHLECB   EQU   GTFPCT+80                                                09415000
STOPECBA EQU   GTFPCT+76                                                09416000
ECBADRLT EQU   GTFPCT+72                                                09417000
FIXLEN   EQU   GTFPCT+68                                                09418000
FIXPTR   EQU   GTFPCT+64                                                09419000
INITPTR  EQU   GTFPCT+60                                                09420000
MCQEPTR  EQU   GTFPCT+56                                                09421000
GTFEIDL  EQU   GTFPCT+52                                                09422000
GTFPIBL  EQU   GTFPCT+48                                                09423000
GTFPIFT  EQU   GTFPCT+44                                                09424000
GTFSVCBL EQU   GTFPCT+40                                                09425000
GTFSVCFT EQU   GTFPCT+36                                                09426000
GTFIOBL  EQU   GTFPCT+32                                                09427000
GTFIOFT  EQU   GTFPCT+28                                                09428000
GTFSIOBL EQU   GTFPCT+24                                                09429000
GTFSIOFT EQU   GTFPCT+20                                                09430000
@NM00004 EQU   PCTCATF+1                                                09431000
PCTPIF   EQU   PCTCATF+1                                                09432000
PCTSIOF  EQU   PCTCATF+1                                                09433000
PCTIOF   EQU   PCTCATF+1                                                09434000
PCTSVCF  EQU   PCTCATF+1                                                09435000
PCTRR    EQU   PCTCATF+1                                                09436000
PCTSRM   EQU   PCTCATF+1                                                09437000
PCTRNIO  EQU   PCTCATF+1                                                09438000
PCTUSR   EQU   PCTCATF                                                  09439000
PCTPI    EQU   PCTCATF                                                  09440000
@NM00003 EQU   PCTCATF                                                  09441000
PCTDSP   EQU   PCTCATF                                                  09442000
PCTSIO   EQU   PCTCATF                                                  09443000
PCTIO    EQU   PCTCATF                                                  09444000
PCTEXT   EQU   PCTCATF                                                  09445000
OPTRES3  EQU   GTFOPTS4                                                 09446000
OPTIOSIO EQU   GTFOPTS3                                                 09447000
OPTRES2  EQU   GTFOPTS3                                                 09448000
OPTRR    EQU   GTFOPTS3                                                 09449000
OPTSRM   EQU   GTFOPTS3                                                 09450000
OPTRNIO  EQU   GTFOPTS3                                                 09451000
OPTEXT   EQU   GTFOPTS3                                                 09452000
OPTIOP   EQU   GTFOPTS2                                                 09453000
OPTIO    EQU   GTFOPTS2                                                 09454000
OPTPIP   EQU   GTFOPTS2                                                 09455000
OPTPI    EQU   GTFOPTS2                                                 09456000
OPTSIOP  EQU   GTFOPTS2                                                 09457000
OPTSIO   EQU   GTFOPTS2                                                 09458000
OPTSVCP  EQU   GTFOPTS2                                                 09459000
OPTSVC   EQU   GTFOPTS2                                                 09460000
OPTPCI   EQU   GTFOPTS1                                                 09461000
OPTRES1  EQU   GTFOPTS1                                                 09462000
OPTDSP   EQU   GTFOPTS1                                                 09463000
OPTUSR   EQU   GTFOPTS1                                                 09464000
OPTSYS   EQU   GTFOPTS1                                                 09465000
OPTSYSP  EQU   GTFOPTS1                                                 09466000
OPTSYSM  EQU   GTFOPTS1                                                 09467000
GTFRESV  EQU   GTFSTAT                                                  09468000
GTFMODE  EQU   GTFSTAT                                                  09469000
GTFPCTID EQU   GTFPCT                                                   09470000
CVTLEVL  EQU   CVTRELNO+2                                               09471000
CVTNUMB  EQU   CVTRELNO                                                 09472000
CVTMDL   EQU   CVTFIX+250                                               09473000
@NM00002 EQU   CVTFIX+248                                               09474000
@NM00001 EQU   CVTFIX                                                   09475000
CVTRV482 EQU   CVTXTNT2+128                                             09476000
CVTRV481 EQU   CVTXTNT2+124                                             09477000
CVTRV480 EQU   CVTXTNT2+120                                             09478000
CVTRV479 EQU   CVTXTNT2+118                                             09479000
CVTRV478 EQU   CVTXTNT2+117                                             09480000
CVTRV477 EQU   CVTXTNT2+116                                             09481000
CVTRV476 EQU   CVTXTNT2+115                                             09482000
CVTRV475 EQU   CVTXTNT2+114                                             09483000
CVTRV474 EQU   CVTRV466                                                 09484000
CVTRV473 EQU   CVTRV466                                                 09485000
CVTRV472 EQU   CVTRV466                                                 09486000
CVTRV471 EQU   CVTRV466                                                 09487000
CVTRV470 EQU   CVTRV466                                                 09488000
CVTRV469 EQU   CVTRV466                                                 09489000
CVTRV468 EQU   CVTRV466                                                 09490000
CVTRV467 EQU   CVTRV466                                                 09491000
CVTRV465 EQU   CVTRV457                                                 09492000
CVTRV464 EQU   CVTRV457                                                 09493000
CVTRV463 EQU   CVTRV457                                                 09494000
CVTRV462 EQU   CVTRV457                                                 09495000
CVTRV461 EQU   CVTRV457                                                 09496000
CVTRV460 EQU   CVTRV457                                                 09497000
CVTRV459 EQU   CVTRV457                                                 09498000
CVTRV458 EQU   CVTRV457                                                 09499000
CVTRV456 EQU   CVTXTNT2+108                                             09500000
CVTRV455 EQU   CVTXTNT2+104                                             09501000
CVTRV454 EQU   CVTXTNT2+100                                             09502000
CVTRV453 EQU   CVTXTNT2+96                                              09503000
CVTRV452 EQU   CVTXTNT2+94                                              09504000
CVTRV451 EQU   CVTXTNT2+92                                              09505000
CVTRV450 EQU   CVTXTNT2+90                                              09506000
CVTRV449 EQU   CVTXTNT2+88                                              09507000
CVTRV448 EQU   CVTXTNT2+87                                              09508000
CVTRV447 EQU   CVTXTNT2+86                                              09509000
CVTRV446 EQU   CVTRV438                                                 09510000
CVTRV445 EQU   CVTRV438                                                 09511000
CVTRV444 EQU   CVTRV438                                                 09512000
CVTRV443 EQU   CVTRV438                                                 09513000
CVTRV442 EQU   CVTRV438                                                 09514000
CVTRV441 EQU   CVTRV438                                                 09515000
CVTRV440 EQU   CVTRV438                                                 09516000
CVTRV439 EQU   CVTRV438                                                 09517000
CVTRV437 EQU   CVTRV429                                                 09518000
CVTRV436 EQU   CVTRV429                                                 09519000
CVTRV435 EQU   CVTRV429                                                 09520000
CVTRV434 EQU   CVTRV429                                                 09521000
CVTRV433 EQU   CVTRV429                                                 09522000
CVTRV432 EQU   CVTRV429                                                 09523000
CVTRV431 EQU   CVTRV429                                                 09524000
CVTRV430 EQU   CVTRV429                                                 09525000
CVTRV428 EQU   CVTXTNT2+80                                              09526000
CVTRV427 EQU   CVTXTNT2+76                                              09527000
CVTRV426 EQU   CVTXTNT2+72                                              09528000
CVTRV425 EQU   CVTXTNT2+68                                              09529000
CVTATACT EQU   CVTATCVT                                                 09530000
CVTRV423 EQU   CVTXTNT2+62                                              09531000
CVTRV422 EQU   CVTXTNT2+60                                              09532000
CVTRV421 EQU   CVTXTNT2+58                                              09533000
CVTRV420 EQU   CVTXTNT2+56                                              09534000
CVTRV419 EQU   CVTXTNT2+55                                              09535000
CVTRV418 EQU   CVTXTNT2+54                                              09536000
CVTRV417 EQU   CVTRV409                                                 09537000
CVTRV416 EQU   CVTRV409                                                 09538000
CVTRV415 EQU   CVTRV409                                                 09539000
CVTRV414 EQU   CVTRV409                                                 09540000
CVTRV413 EQU   CVTRV409                                                 09541000
CVTRV412 EQU   CVTRV409                                                 09542000
CVTRV411 EQU   CVTRV409                                                 09543000
CVTRV410 EQU   CVTRV409                                                 09544000
CVTRV408 EQU   CVTRV400                                                 09545000
CVTRV407 EQU   CVTRV400                                                 09546000
CVTRV406 EQU   CVTRV400                                                 09547000
CVTRV405 EQU   CVTRV400                                                 09548000
CVTRV404 EQU   CVTRV400                                                 09549000
CVTRV403 EQU   CVTRV400                                                 09550000
CVTRV402 EQU   CVTRV400                                                 09551000
CVTRV401 EQU   CVTRV400                                                 09552000
CVTICB   EQU   CVTXTNT2+48                                              09553000
CVTSKTA  EQU   CVTXTNT2+44                                              09554000
CVTCCVT  EQU   CVTXTNT2+40                                              09555000
CVTRSV98 EQU   CVTXTNT2+36                                              09556000
CVTRSV97 EQU   CVTXTNT2+34                                              09557000
CVTRSV96 EQU   CVTXTNT2+32                                              09558000
CVTOLTEP EQU   CVTXTNT2+28                                              09559000
CVTQIDA  EQU   CVTQID+1                                                 09560000
CVTRSV95 EQU   CVTQID                                                   09561000
CVTRSV94 EQU   CVTXTNT2+20                                              09562000
CVTRSV93 EQU   CVTXTNT2+16                                              09563000
CVTRSV92 EQU   CVTXTNT2+12                                              09564000
CVTRSV91 EQU   CVTXTNT2+6                                               09565000
CVTRSV9H EQU   CVTFLGBT                                                 09566000
CVTRSV9G EQU   CVTFLGBT                                                 09567000
CVTRSV9F EQU   CVTFLGBT                                                 09568000
CVTRSV9E EQU   CVTFLGBT                                                 09569000
CVTRSV9D EQU   CVTFLGBT                                                 09570000
CVTRSV9C EQU   CVTFLGBT                                                 09571000
CVTVME   EQU   CVTFLGBT                                                 09572000
CVTNPE   EQU   CVTFLGBT                                                 09573000
CVTNUCLS EQU   CVTXTNT2+4                                               09574000
CVTDSSVA EQU   CVTDSSV+1                                                09575000
CVTRSV89 EQU   CVTDSSV                                                  09576000
CVTRSV88 EQU   CVTXTNT1+8                                               09577000
CVTRSV87 EQU   CVTXTNT1+4                                               09578000
CVTFACHN EQU   CVTXTNT1                                                 09579000
CVTRV488 EQU   CVTMAP+412                                               09580000
CVTRV487 EQU   CVTMAP+408                                               09581000
CVTRV486 EQU   CVTMAP+404                                               09582000
CVTRV485 EQU   CVTMAP+400                                               09583000
CVTACTAP EQU   CVTMAP+396                                               09584000
CVTAUTH  EQU   CVTMAP+392                                               09585000
CVTATMCA EQU   CVTATMCT+1                                               09586000
CVTATMST EQU   CVTATMCT                                                 09587000
CVTRSV61 EQU   CVTMAP+384                                               09588000
CVTVOLT1 EQU   CVTVOLM1+1                                               09589000
CVTVOLI1 EQU   CVTVOLF1                                                 09590000
CVTSTOA  EQU   CVTMAP+376                                               09591000
CVTRSV58 EQU   CVTMAP+374                                               09592000
CVTRSV57 EQU   CVTMAP+372                                               09593000
CVTDDCE  EQU   CVTMAP+368                                               09594000
CVTPNWFR EQU   CVTMAP+364                                               09595000
CVTSMF   EQU   CVTMAP+360                                               09596000
CVTSULK  EQU   CVTMAP+358                                               09597000
CVTSLKO  EQU   CVTSYSK                                                  09598000
CVTSLKP  EQU   CVTSYSK                                                  09599000
CVTSLKQ  EQU   CVTSYSK                                                  09600000
CVTSLKR  EQU   CVTSYSK                                                  09601000
CVTRSV56 EQU   CVTSYSK                                                  09602000
CVTRSV55 EQU   CVTSYSK                                                  09603000
CVTRSV54 EQU   CVTSYSK                                                  09604000
CVTRSV53 EQU   CVTSYSK                                                  09605000
CVTRSV52 EQU   CVTA1F1                                                  09606000
CVTRSV51 EQU   CVTA1F1                                                  09607000
CVTRSV50 EQU   CVTA1F1                                                  09608000
CVTRSV49 EQU   CVTA1F1                                                  09609000
CVTRSV48 EQU   CVTA1F1                                                  09610000
CVTRSV47 EQU   CVTA1F1                                                  09611000
CVTSRSW  EQU   CVTA1F1                                                  09612000
CVTPFSW  EQU   CVTA1F1                                                  09613000
CVTPCVT  EQU   CVTMAP+352                                               09614000
CVTRSV46 EQU   CVTMAP+344                                               09615000
CVTRSV45 EQU   CVTMAP+340                                               09616000
CVTRSV44 EQU   CVTMAP+338                                               09617000
CVTRSV43 EQU   CVTMAP+336                                               09618000
CVTHJESA EQU   CVTHJES+1                                                09619000
CVTRSV42 EQU   CVTHJES                                                  09620000
CVTEXT2A EQU   CVTEXT2+1                                                09621000
CVTRSV41 EQU   CVTEXT2                                                  09622000
CVTAPFA  EQU   CVTAPF+1                                                 09623000
CVTRSV40 EQU   CVTAPF                                                   09624000
CVTRV518 EQU   CVTINTLA                                                 09625000
CVTRV517 EQU   CVTERPV                                                  09626000
CVTEORM  EQU   CVTMAP+312                                               09627000
CVTMCHPR EQU   CVTMAP+308                                               09628000
CVTTZ    EQU   CVTMAP+304                                               09629000
CVTJEPS  EQU   CVTMAP+300                                               09630000
CVTJESCT EQU   CVTMAP+296                                               09631000
CVTMODE  EQU   CVTMAP+292                                               09632000
CVTPTRV  EQU   CVTMAP+288                                               09633000
CVTREAL  EQU   CVTMAP+284                                               09634000
CVTRSV39 EQU   CVTMAP+280                                               09635000
CVTRSV38 EQU   CVTMAP+276                                               09636000
CVTDMSRA EQU   CVTDMSR+1                                                09637000
CVTRV634 EQU   CVTDMSRF                                                 09638000
CVTRV633 EQU   CVTDMSRF                                                 09639000
CVTRV632 EQU   CVTDMSRF                                                 09640000
CVTRV631 EQU   CVTDMSRF                                                 09641000
CVTRV630 EQU   CVTDMSRF                                                 09642000
CVTRV629 EQU   CVTDMSRF                                                 09643000
CVTUDUMP EQU   CVTDMSRF                                                 09644000
CVTSDUMP EQU   CVTDMSRF                                                 09645000
CVTQMSGA EQU   CVTQMSG+1                                                09646000
CVTRSV36 EQU   CVTQMSG                                                  09647000
CVTAMFF  EQU   CVTMAP+264                                               09648000
CVTPURGA EQU   CVTPURG+1                                                09649000
CVTRSV35 EQU   CVTPURG                                                  09650000
CVTCBSP  EQU   CVTMAP+256                                               09651000
CVTATERA EQU   CVTATER+1                                                09652000
CVTSYST  EQU   CVTATER                                                  09653000
CVTVOLT2 EQU   CVTTAT                                                   09654000
CVTVOLI2 EQU   CVTVOLF2                                                 09655000
CVTAQAVB EQU   CVTAQAVT+1                                               09656000
CVTRSV34 EQU   CVTTCMFG                                                 09657000
CVTRSV33 EQU   CVTTCMFG                                                 09658000
CVTRSV32 EQU   CVTTCMFG                                                 09659000
CVTRSV31 EQU   CVTTCMFG                                                 09660000
CVTRSV30 EQU   CVTTCMFG                                                 09661000
CVTRSV29 EQU   CVTTCMFG                                                 09662000
CVTRSV28 EQU   CVTTCMFG                                                 09663000
CVTTCRDY EQU   CVTTCMFG                                                 09664000
CVTRSV27 EQU   CVTGTFST                                                 09665000
CVTRNIO  EQU   CVTGTFST                                                 09666000
CVTUSR   EQU   CVTGTFST                                                 09667000
CVTRV318 EQU   CVTFORM                                                  09668000
CVTRV317 EQU   CVTTMODE                                                 09669000
CVTRV316 EQU   CVTSTATE                                                 09670000
CVTRV315 EQU   CVTGTFS                                                  09671000
CVTGTFAV EQU   CVTGTFS                                                  09672000
CVT0SCR1 EQU   CVTMAP+232                                               09673000
CVTRV515 EQU   CVTMAP+228                                               09674000
CVTRMS   EQU   CVTMAP+224                                               09675000
CVTPATCH EQU   CVTMAP+220                                               09676000
CVTTSCE  EQU   CVTMAP+216                                               09677000
CVTLNKSC EQU   CVTMAP+214                                               09678000
CVTQABST EQU   CVTMAP+212                                               09679000
CVTMDLDS EQU   CVTMAP+208                                               09680000
CVTUSER  EQU   CVTMAP+204                                               09681000
CVTABEND EQU   CVTMAP+200                                               09682000
CVTSMCA  EQU   CVTMAP+196                                               09683000
CVTRSV18 EQU   CVTMAP+192                                               09684000
CVTQLPAQ EQU   CVTMAP+188                                               09685000
CVTQCDSR EQU   CVTMAP+184                                               09686000
CVTRSV17 EQU   CVTOPTB                                                  09687000
CVTRSV16 EQU   CVTOPTB                                                  09688000
CVTFP    EQU   CVTOPTB                                                  09689000
CVTAPTHR EQU   CVTOPTB                                                  09690000
CVTNLOG  EQU   CVTOPTB                                                  09691000
CVTTOD   EQU   CVTOPTB                                                  09692000
CVTCTIMS EQU   CVTOPTB                                                  09693000
CVTPROT  EQU   CVTOPTB                                                  09694000
CVTXPFP  EQU   CVTOPTA                                                  09695000
CVTASCII EQU   CVTOPTA                                                  09696000
CVTRSV13 EQU   CVTOPTA                                                  09697000
CVTRSV12 EQU   CVTOPTA                                                  09698000
CVTNIP   EQU   CVTOPTA                                                  09699000
CVTDDR   EQU   CVTOPTA                                                  09700000
CVTAPR   EQU   CVTOPTA                                                  09701000
CVTCCH   EQU   CVTOPTA                                                  09702000
CVTSNCTR EQU   CVTMAP+180                                               09703000
CVTQMWR  EQU   CVTMAP+176                                               09704000
CVTQOCR  EQU   CVTMAP+172                                               09705000
CVT1EF00 EQU   CVTMAP+168                                               09706000
CVTMZ00  EQU   CVTMAP+164                                               09707000
CVTSV76Q EQU   CVTSV76C                                                 09708000
CVTRSV11 EQU   CVTMAP+156                                               09709000
CVT0PT01 EQU   CVTMAP+152                                               09710000
CVTMSER  EQU   CVTMAP+148                                               09711000
CVTRV516 EQU   CVTIERLC                                                 09712000
CVTILCH  EQU   CVTMAP+140                                               09713000
CVT0DS   EQU   CVTMAP+136                                               09714000
CVTFBOSV EQU   CVTMAP+132                                               09715000
CVTNUCB  EQU   CVTMAP+128                                               09716000
CVTIXAVL EQU   CVTMAP+124                                               09717000
CVTSV76M EQU   CVTIOQET                                                 09718000
CVTDCBA  EQU   CVTMAP+117                                               09719000
CVTMVS2  EQU   CVTDCB                                                   09720000
CVT6DAT  EQU   CVTDCB                                                   09721000
CVT4MPS  EQU   CVTDCB                                                   09722000
CVTRSV09 EQU   CVTDCB                                                   09723000
CVT4MS1  EQU   CVTDCB                                                   09724000
CVT2SPS  EQU   CVTDCB                                                   09725000
CVT1SSS  EQU   CVTDCB                                                   09726000
CVTRSV08 EQU   CVTDCB                                                   09727000
CVTSTB   EQU   CVTMAP+112                                               09728000
CVTQTD00 EQU   CVTMAP+108                                               09729000
CVTQTE00 EQU   CVTMAP+104                                               09730000
CVTCUCB  EQU   CVTMAP+100                                               09731000
CVTSJQ   EQU   CVTMAP+96                                                09732000
CVTPBLDL EQU   CVTMAP+92                                                09733000
CVTTPC   EQU   CVTMAP+88                                                09734000
CVTSVDCB EQU   CVTMAP+84                                                09735000
CVTBRET  EQU   CVTMAP+82                                                09736000
CVTEXIT  EQU   CVTMAP+80                                                09737000
CVT0FN00 EQU   CVTMAP+76                                                09738000
CVTDARA  EQU   CVTDAR+1                                                 09739000
CVTRSV07 EQU   CVTFLGS1                                                 09740000
CVTRSV06 EQU   CVTFLGS1                                                 09741000
CVTRSV05 EQU   CVTFLGS1                                                 09742000
CVTRSV04 EQU   CVTFLGS1                                                 09743000
CVTRSV03 EQU   CVTFLGS1                                                 09744000
CVTRSV02 EQU   CVTFLGS1                                                 09745000
CVTRSV01 EQU   CVTFLGS1                                                 09746000
CVTDMPLK EQU   CVTFLGS1                                                 09747000
CVTXITP  EQU   CVTMAP+68                                                09748000
CVTZDTAB EQU   CVTMAP+64                                                09749000
CVTMSLT  EQU   CVTMAP+60                                                09750000
CVTDATE  EQU   CVTMAP+56                                                09751000
CVTBTERM EQU   CVTMAP+52                                                09752000
CVTSYSAD EQU   CVTMAP+48                                                09753000
CVTXTLER EQU   CVTMAP+44                                                09754000
CVTILK2  EQU   CVTMAP+40                                                09755000
CVTILK1  EQU   CVTMAP+36                                                09756000
CVTPRLTV EQU   CVTMAP+32                                                09757000
CVTPCNVT EQU   CVTMAP+28                                                09758000
CVT0VL00 EQU   CVTMAP+24                                                09759000
CVTXAPG  EQU   CVTMAP+20                                                09760000
CVTBUF   EQU   CVTMAP+16                                                09761000
CVTJOB   EQU   CVTMAP+12                                                09762000
CVTLINK  EQU   CVTMAP+8                                                 09763000
CVT0EF00 EQU   CVTMAP+4                                                 09764000
CVTTCBP  EQU   CVTMAP                                                   09765000
CVT      EQU   CVTMAP                                                   09766000
@NM00096 EQU   PSA+3668                                                 09767000
PSASTAK  EQU   PSA+3072                                                 09768000
@NM00095 EQU   PSA+1048                                                 09769000
PSAUSEND EQU   PSA+1048                                                 09770000
PSARV062 EQU   PSA+1044                                                 09771000
PSACDAL  EQU   PSA+1040                                                 09772000
PSAWTCOD EQU   PSA+1036                                                 09773000
PSAATCVT EQU   PSA+1032                                                 09774000
PSAPCPSW EQU   PSA+1024                                                 09775000
PSAPIR2  EQU   PSA+1020                                                 09776000
PSARV059 EQU   PSA+1018                                                 09777000
PSASVC13 EQU   PSA+1016                                                 09778000
PSALSFCC EQU   PSA+1012                                                 09779000
PSASFACC EQU   PSA+1008                                                 09780000
PSASTOP  EQU   PSA+992                                                  09781000
PSASTART EQU   PSA+976                                                  09782000
PSARSPSW EQU   PSA+968                                                  09783000
PSASRPSW EQU   PSA+960                                                  09784000
PSARV045 EQU   PSA+892                                                  09785000
PSARV044 EQU   PSA+888                                                  09786000
PSARV043 EQU   PSA+884                                                  09787000
PSARV042 EQU   PSA+880                                                  09788000
PSARV041 EQU   PSA+876                                                  09789000
PSARV040 EQU   PSA+872                                                  09790000
PSARV025 EQU   PSA+868                                                  09791000
PSADSSED EQU   PSA+868                                                  09792000
PSADSSPR EQU   PSA+864                                                  09793000
PSADSSFW EQU   PSA+860                                                  09794000
PSADSS14 EQU   PSA+856                                                  09795000
PSADSSPP EQU   PSA+848                                                  09796000
PSADSSRP EQU   PSA+840                                                  09797000
PSADSS05 EQU   PSADSSF4                                                 09798000
PSADSS10 EQU   PSADSSF4                                                 09799000
PSADSSVE EQU   PSADSSF4                                                 09800000
PSADSSDE EQU   PSADSSF4                                                 09801000
PSADSSC0 EQU   PSADSSF4                                                 09802000
PSADSSIE EQU   PSADSSF4                                                 09803000
PSADSS12 EQU   PSADSSF4                                                 09804000
PSADSSRC EQU   PSADSSF4                                                 09805000
PSARV057 EQU   PSADSSF3                                                 09806000
PSARV056 EQU   PSADSSF3                                                 09807000
PSARV055 EQU   PSADSSF3                                                 09808000
PSADSSMC EQU   PSADSSF3                                                 09809000
PSADSSRW EQU   PSADSSF3                                                 09810000
PSADSSNM EQU   PSADSSF3                                                 09811000
PSADSSES EQU   PSADSSF3                                                 09812000
PSADSSGP EQU   PSADSSF3                                                 09813000
PSADSSF2 EQU   PSADSSFL+1                                               09814000
PSADSSPI EQU   PSADSSF1                                                 09815000
PSADSSOI EQU   PSADSSF1                                                 09816000
PSADSSSP EQU   PSADSSF1                                                 09817000
PSADSSTP EQU   PSADSSF1                                                 09818000
PSADSSDW EQU   PSADSSF1                                                 09819000
PSADSSDD EQU   PSADSSF1                                                 09820000
PSADSSDM EQU   PSADSSF1                                                 09821000
PSADSSMV EQU   PSADSSF1                                                 09822000
PSADSSTS EQU   PSA+816                                                  09823000
PSADSSWK EQU   PSA+812                                                  09824000
PSADSSR3 EQU   PSA+808                                                  09825000
PSADSSR2 EQU   PSA+804                                                  09826000
PSADSSRS EQU   PSA+800                                                  09827000
PSASTOR  EQU   PSA+796                                                  09828000
PSAVSTAP EQU   PSA+792                                                  09829000
PSAWKVAP EQU   PSA+788                                                  09830000
PSAWKRAP EQU   PSA+784                                                  09831000
PSAMCHIC EQU   PSA+783                                                  09832000
PSARV061 EQU   PSA+782                                                  09833000
PSASYMSK EQU   PSA+781                                                  09834000
PSAMCHFL EQU   PSA+780                                                  09835000
PSACR0   EQU   PSA+776                                                  09836000
PSAPSWSV EQU   PSA+768                                                  09837000
PSALITA  EQU   PSA+764                                                  09838000
PSACLHS  EQU   PSAHLHI                                                  09839000
PSALKR15 EQU   PSALKSA+60                                               09840000
PSALKR14 EQU   PSALKSA+56                                               09841000
PSALKR13 EQU   PSALKSA+52                                               09842000
PSALKR12 EQU   PSALKSA+48                                               09843000
PSALKR11 EQU   PSALKSA+44                                               09844000
PSALKR10 EQU   PSALKSA+40                                               09845000
PSALKR9  EQU   PSALKSA+36                                               09846000
PSALKR8  EQU   PSALKSA+32                                               09847000
PSALKR7  EQU   PSALKSA+28                                               09848000
PSALKR6  EQU   PSALKSA+24                                               09849000
PSALKR5  EQU   PSALKSA+20                                               09850000
PSALKR4  EQU   PSALKSA+16                                               09851000
PSALKR3  EQU   PSALKSA+12                                               09852000
PSALKR2  EQU   PSALKSA+8                                                09853000
PSALKR1  EQU   PSALKSA+4                                                09854000
PSALKR0  EQU   PSALKSA                                                  09855000
PSARV023 EQU   PSACLHT+52                                               09856000
PSALOCAL EQU   PSACLHT+48                                               09857000
PSACMSL  EQU   PSACLHT+44                                               09858000
PSAOPTL  EQU   PSACLHT+40                                               09859000
PSATPACL EQU   PSACLHT+36                                               09860000
PSATPDNL EQU   PSACLHT+32                                               09861000
PSATPNCL EQU   PSACLHT+28                                               09862000
PSAIOSLL EQU   PSACLHT+24                                               09863000
PSAIOSUL EQU   PSACLHT+20                                               09864000
PSAIOSCL EQU   PSACLHT+16                                               09865000
PSAIOSSL EQU   PSACLHT+12                                               09866000
PSASALCL EQU   PSACLHT+8                                                09867000
PSAASML  EQU   PSACLHT+4                                                09868000
PSADISPL EQU   PSACLHT                                                  09869000
PSASRSA  EQU   PSA+636                                                  09870000
PSARV050 EQU   PSA+634                                                  09871000
PSADSSGO EQU   PSA+633                                                  09872000
PSARECUR EQU   PSA+632                                                  09873000
PSAHLHIS EQU   PSA+628                                                  09874000
PSAIPCSA EQU   PSA+624                                                  09875000
@NM00094 EQU   PSA+621                                                  09876000
PSAIPCDM EQU   PSA+620                                                  09877000
PSAIPCD  EQU   PSA+616                                                  09878000
@NM00093 EQU   PSA+613                                                  09879000
PSAIPCRM EQU   PSA+612                                                  09880000
PSAIPCR  EQU   PSA+608                                                  09881000
PSAMCHEX EQU   PSA+600                                                  09882000
PSAMPSW  EQU   PSA+592                                                  09883000
PSAEXPS2 EQU   PSA+584                                                  09884000
PSAEXPS1 EQU   PSA+576                                                  09885000
PSAPIREG EQU   PSA+572                                                  09886000
PSARSREG EQU   PSA+568                                                  09887000
PSAGPREG EQU   PSA+556                                                  09888000
PSARV022 EQU   PSASUP4                                                  09889000
PSARV021 EQU   PSASUP4                                                  09890000
PSARV020 EQU   PSASUP4                                                  09891000
PSARV019 EQU   PSASUP4                                                  09892000
PSARV018 EQU   PSASUP4                                                  09893000
PSARV017 EQU   PSASUP4                                                  09894000
PSARV016 EQU   PSASUP4                                                  09895000
PSARV015 EQU   PSASUP4                                                  09896000
PSARV014 EQU   PSASUP3                                                  09897000
PSARV013 EQU   PSASUP3                                                  09898000
PSARV012 EQU   PSASUP3                                                  09899000
PSAESTA  EQU   PSASUP3                                                  09900000
PSASPR   EQU   PSASUP3                                                  09901000
PSAPSREG EQU   PSASUP3                                                  09902000
PSAPI2   EQU   PSASUP3                                                  09903000
PSAIOSUP EQU   PSASUP3                                                  09904000
PSALCR   EQU   PSASUP2                                                  09905000
PSARTM   EQU   PSASUP2                                                  09906000
PSAACR   EQU   PSASUP2                                                  09907000
PSAIPCE2 EQU   PSASUP2                                                  09908000
PSAIPCES EQU   PSASUP2                                                  09909000
PSAIPCEC EQU   PSASUP2                                                  09910000
PSAGTF   EQU   PSASUP2                                                  09911000
PSAIPCRI EQU   PSASUP2                                                  09912000
PSATYPE6 EQU   PSASUP1                                                  09913000
PSATCTL  EQU   PSASUP1                                                  09914000
PSADISP  EQU   PSASUP1                                                  09915000
PSALOCK  EQU   PSASUP1                                                  09916000
PSAPI    EQU   PSASUP1                                                  09917000
PSAEXT   EQU   PSASUP1                                                  09918000
PSASVC   EQU   PSASUP1                                                  09919000
PSAIO    EQU   PSASUP1                                                  09920000
PSAANEW  EQU   PSA+544                                                  09921000
PSATNEW  EQU   PSA+536                                                  09922000
PSALCCAR EQU   PSA+532                                                  09923000
PSAPCCAR EQU   PSA+524                                                  09924000
PSAPCCAV EQU   PSA+520                                                  09925000
PSACPULA EQU   PSA+518                                                  09926000
PSACPUPA EQU   PSA+516                                                  09927000
PSAPSA   EQU   PSA+512                                                  09928000
FLCHDEND EQU   PSA+512                                                  09929000
FLCCRSAV EQU   FLCMCLA+280                                              09930000
FLCGRSAV EQU   FLCMCLA+216                                              09931000
FLCFPSAV EQU   FLCMCLA+184                                              09932000
FLCFLA   EQU   FLCMCLA+88                                               09933000
FLCRGNCD EQU   FLCMCLA+84                                               09934000
FLCFSAA  EQU   FLCFSA+1                                                 09935000
@NM00092 EQU   FLCFSA                                                   09936000
@NM00091 EQU   FLCMCLA+72                                               09937000
FLCMCIC  EQU   FLCMCLA+64                                               09938000
@NM00090 EQU   FLCMCLA+20                                               09939000
FLCIOAA  EQU   FLCIOA+1                                                 09940000
@NM00089 EQU   FLCIOA                                                   09941000
@NM00088 EQU   FLCMCLA+15                                               09942000
@NM00087 EQU   FLCMCLA+14                                               09943000
@NM00086 EQU   FLCMCLA+12                                               09944000
FLCLCL   EQU   FLCMCLA+8                                                09945000
FLCIOELA EQU   FLCIOEL+1                                                09946000
@NM00085 EQU   FLCIOEL                                                  09947000
FLCCHNID EQU   FLCMCLA                                                  09948000
@NM00084 EQU   PSA+160                                                  09949000
FLCMTRCD EQU   PSA+157                                                  09950000
@NM00083 EQU   PSA+156                                                  09951000
FLCPERA  EQU   FLCPER+1                                                 09952000
@NM00082 EQU   FLCPER                                                   09953000
@NM00081 EQU   PSA+151                                                  09954000
FLCPERCD EQU   PSA+150                                                  09955000
FLCMCNUM EQU   PSA+149                                                  09956000
@NM00080 EQU   PSA+148                                                  09957000
FLCTEAA  EQU   FLCTEA+1                                                 09958000
@NM00079 EQU   FLCTEA                                                   09959000
PSAPIPC  EQU   PSAPICOD                                                 09960000
PSAPIMC  EQU   PSAPICOD                                                 09961000
PSAPIPER EQU   PSAPICOD                                                 09962000
PSARV049 EQU   FLCPICOD                                                 09963000
FLCPILCB EQU   FLCPIILC                                                 09964000
@NM00078 EQU   FLCPIILC                                                 09965000
@NM00077 EQU   PSAEPPSW                                                 09966000
FLCSILCB EQU   FLCSVILC                                                 09967000
@NM00076 EQU   FLCSVILC                                                 09968000
@NM00075 EQU   PSAESPSW                                                 09969000
FLCEICOD EQU   PSAEEPSW+2                                               09970000
PSASPAD  EQU   PSAEEPSW                                                 09971000
@NM00074 EQU   PSA+128                                                  09972000
FLCINPSW EQU   PSA+120                                                  09973000
FLCMNPSW EQU   PSA+112                                                  09974000
FLCPNPSW EQU   PSA+104                                                  09975000
FLCSNPSW EQU   PSA+96                                                   09976000
FLCENPSW EQU   PSA+88                                                   09977000
FLCTRACE EQU   PSA+84                                                   09978000
FLCTIMER EQU   PSA+80                                                   09979000
FLCCVT2  EQU   PSA+76                                                   09980000
FLCCAW   EQU   PSA+72                                                   09981000
FLCCSW   EQU   PSA+64                                                   09982000
FLCIOPSW EQU   PSA+56                                                   09983000
FLCMOPSW EQU   PSA+48                                                   09984000
FLCEOPSW EQU   PSA+24                                                   09985000
@NM00073 EQU   FLCICCW2+4                                               09986000
FLCCVT   EQU   FLCICCW2                                                 09987000
FLCICCW1 EQU   FLCROPSW                                                 09988000
FLCIPPSW EQU   FLCRNPSW                                                 09989000
*                                      END UNREFERENCED COMPONENTS      09990000
@RT00342 EQU   ENDSVC                                                   09991000
@RT00358 EQU   SNOJBNM                                                  09992000
@RF00373 EQU   AHLSADDL                                                 09993000
@RC00376 EQU   AHLSADDL                                                 09994000
@RC00383 EQU   AHLSADDL                                                 09995000
@RT00457 EQU   AHLS1A                                                   09996000
@RT00467 EQU   AHLS1E                                                   09997000
@RC00480 EQU   AHLSVSTK                                                 09998000
AHLS2A   EQU   AHLSVSTK                                                 09999000
@RF00598 EQU   AHLS15E                                                  10000000
@RF00624 EQU   AHLS16B                                                  10001000
@RC00693 EQU   @RC00692                                                 10002000
@RC00731 EQU   AHLSVSTK                                                 10003000
@RC00788 EQU   AHLSVSTK                                                 10004000
@RF00895 EQU   SVDDNCK                                                  10005000
@RC00923 EQU   AHLSVSTK                                                 10006000
@RT01104 EQU   AHLPRM8                                                  10007000
@RT01145 EQU   AHLPRM12                                                 10008000
@RT01185 EQU   AHLS821                                                  10009000
@RT01187 EQU   AHLS822                                                  10010000
@RT01189 EQU   AHLS823                                                  10011000
@RT01191 EQU   AHLS82D                                                  10012000
@RT01346 EQU   AHLS990                                                  10013000
@RT01370 EQU   SVDDNCKB                                                 10014000
@RT01373 EQU   SVDDNCKB                                                 10015000
@RT01375 EQU   SVDDNCKB                                                 10016000
@RT01383 EQU   SVDDNCKC                                                 10017000
@RF01383 EQU   SVDDNCKB                                                 10018000
@RT01392 EQU   SVDSNA                                                   10019000
@RF01471 EQU   @RC01464                                                 10020000
@RT01495 EQU   UNRECERR                                                 10021000
@RT01510 EQU   UNRECERR                                                 10022000
@RT01525 EQU   UNRECERR                                                 10023000
AHLTSVCN EQU   @EL00001                                                 10024000
@PB00005 EQU   @EL00001                                                 10025000
@PB00004 EQU   @PB00005                                                 10026000
@ENDDATA EQU   *                                                        10027000
         END   AHLTSVC,(C'PLS2047',0701,78139)                          10028000
