         TITLE 'ICBVCR00 MSVC SUBTASK CONTROLLER - MVS                 *00001000
                        '                                               00002000
ICBVCR00 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ICBVCR00  77.355'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @11,@SA00001                                        0001 00014000
         LR    @13,@11                                             0001 00015000
*                                                                  0062 00016000
*   /*****************************************************************/ 00017000
*   /*                                                               */ 00018000
*   /* SET UP ADDRESSABILITY AND INITIALIZE VARIABLES        @Y30LB24*/ 00019000
*   /*                                                               */ 00020000
*   /*****************************************************************/ 00021000
*                                                                  0062 00022000
*   VVIPTR=ICBVVICB;                /* INITIALIZE VVI CTL BLK PTR  0062 00023000
*                                                            @Y30LB24*/ 00024000
         L     @11,CVTPTR                                          0062 00025000
         L     @11,CVTEXT2(,@11)                                   0062 00026000
         L     @11,CVTICB(,@11)                                    0062 00027000
         L     VVIPTR,ICBVVICB(,@11)                               0062 00028000
*   RESPECIFY                                                      0063 00029000
*     RVVI BASED(REG1);             /* BASE READ VVI LIST    @Y30LB24*/ 00030000
*                                                                  0063 00031000
*   /*****************************************************************/ 00032000
*   /*                                                               */ 00033000
*   /* THIS LOOP IS MEANT TO CONTINUE UNTIL A WAIT CONDITION IS      */ 00034000
*   /* ENCOUNTERED. CONTROL WILL RETURN TO ICBVCR00 AFTER THE ECB IS */ 00035000
*   /* POSTED.                                               @Y30LB24*/ 00036000
*   /*                                                               */ 00037000
*   /*****************************************************************/ 00038000
*                                                                  0064 00039000
*   DO WHILE LOOP=LOOP;             /* PROCESS LOOP          @Y30LB24*/ 00040000
*                                                                  0064 00041000
         B     @DE00064                                            0064 00042000
@DL00064 DS    0H                                                  0065 00043000
*     /***************************************************************/ 00044000
*     /*                                                             */ 00045000
*     /* IF NEITHER THE HIGH NOR LOW QUEUES HAVE ANY RPLS THEN WAIT  */ 00046000
*     /* UNTIL THE ECB HAS BEEN POSTED AND RETURN THE SAME QUESTION  */ 00047000
*     /* UNTIL ONE OF THE QUEUES HAS AN ADDRESS.             @Y30LB24*/ 00048000
*     /*                                                             */ 00049000
*     /***************************************************************/ 00050000
*                                                                  0065 00051000
*     DO WHILE VVIQRPL2=ZERO&VVIQRPL1=ZERO;/*                @Y30LB24*/ 00052000
         B     @DE00065                                            0065 00053000
@DL00065 DS    0H                                                  0066 00054000
*       VVIECB1=ZERO;               /* INITIALIZE ECB        @Y30LB24*/ 00055000
         SLR   @11,@11                                             0066 00056000
         ST    @11,VVIECB1(,VVIPTR)                                0066 00057000
*       IF VVIQRPL2=ZERO&VVIQRPL1=ZERO THEN/*                @ZM31020   00058000
*                                      CHECK THAT NO RPLV HAS      0067 00059000
*                                                            @ZM31020   00060000
*                                      BEEN ADDED TO THE     @ZM31020   00061000
*                                      QUEUES SINCE THE      @ZM31020   00062000
*                                      ECB WAS CLEARED       @ZM31020*/ 00063000
         C     @11,VVIQRPL2(,VVIPTR)                               0067 00064000
         BNE   @RF00067                                            0067 00065000
         C     @11,VVIQRPL1(,VVIPTR)                               0067 00066000
         BNE   @RF00067                                            0067 00067000
*         DO;                       /*                       @ZM31020*/ 00068000
*           REG1=ADDR(VVIECB1);     /* SET PARM              @ZM31020   00069000
*                                      REGISTER              @ZM31020*/ 00070000
         LA    REG1,VVIECB1(,VVIPTR)                               0069 00071000
*           GEN(WAIT  1,ECB=(REG1));/* WAIT FOR              @ZM31020   00072000
*                                      COMPLETION            @ZM31020*/ 00073000
         WAIT  1,ECB=(REG1)                                             00074000
*         END;                      /*                       @ZM31020*/ 00075000
*     END;                          /*                       @Y30LB24*/ 00076000
@RF00067 DS    0H                                                  0072 00077000
@DE00065 SLR   @11,@11                                             0072 00078000
         C     @11,VVIQRPL2(,VVIPTR)                               0072 00079000
         BNE   @DC00065                                            0072 00080000
         C     @11,VVIQRPL1(,VVIPTR)                               0072 00081000
         BE    @DL00065                                            0072 00082000
@DC00065 DS    0H                                                  0073 00083000
*     VVIPTR=ICBVVICB;              /* INITIALIZE MSVC CTL BLK PTR 0073 00084000
*                                                            @Y30LB24*/ 00085000
         L     @11,CVTPTR                                          0073 00086000
         L     @11,CVTEXT2(,@11)                                   0073 00087000
         L     @11,CVTICB(,@11)                                    0073 00088000
         L     VVIPTR,ICBVVICB(,@11)                               0073 00089000
*     IF VVIQRPL1^=ZERO THEN        /* ENTRY ON HI-QUE?      @Y30LB24*/ 00090000
         L     @11,VVIQRPL1(,VVIPTR)                               0074 00091000
         LTR   @11,@11                                             0074 00092000
         BZ    @RF00074                                            0074 00093000
*       DO;                         /*                       @Y30LB24*/ 00094000
*         OPERAND2=ADDR(VVIQRPL1);  /* SET BACK LEVEL PTR    @Y30LB24*/ 00095000
         LA    @04,VVIQRPL1(,VVIPTR)                               0076 00096000
         LR    OPERAND2,@04                                        0076 00097000
*         RPLSAV=ADDR(VVIQRPL1);    /* SAVE BACK PTR         @Y30LB24*/ 00098000
         LR    RPLSAV,@04                                          0077 00099000
*         RPLVPTR=VVIQRPL1;         /* BASE RPLV             @Y30LB24*/ 00100000
         LR    RPLVPTR,@11                                         0078 00101000
*       END;                        /*                       @Y30LB24*/ 00102000
*     ELSE                          /* OTHERWISE             @Y30LB24*/ 00103000
*       DO;                         /*                       @Y30LB24*/ 00104000
         B     @RC00074                                            0080 00105000
@RF00074 DS    0H                                                  0081 00106000
*         OPERAND2=ADDR(VVIQRPL2);  /* SET BACK LEVEL PTR    @Y30LB24*/ 00107000
         LA    @04,VVIQRPL2(,VVIPTR)                               0081 00108000
         LR    OPERAND2,@04                                        0081 00109000
*         RPLSAV=ADDR(VVIQRPL2);    /* SAVE BACK PTR         @Y30LB24*/ 00110000
         LR    RPLSAV,@04                                          0082 00111000
*         RPLVPTR=VVIQRPL2;         /* BASE RPLV             @Y30LB24*/ 00112000
         L     RPLVPTR,VVIQRPL2(,VVIPTR)                           0083 00113000
*       END;                        /*                       @Y30LB24*/ 00114000
*     DO UNTIL RPLNULL=ZERO;        /* FIND LAST RPL         @Y30LB24*/ 00115000
@RC00074 DS    0H                                                  0085 00116000
@DL00085 DS    0H                                                  0086 00117000
*       RPLNULL=RPLVQPTR;           /* GET CHAINED ELEMENT   @Y30LB24*/ 00118000
         L     @11,RPLVQPTR(,RPLVPTR)                              0086 00119000
         LR    RPLNULL,@11                                         0086 00120000
*       IF RPLVQPTR^=ZERO THEN      /* IF NOT AT LAST RPL    @Y30LB24*/ 00121000
         LTR   @11,@11                                             0087 00122000
         BZ    @RF00087                                            0087 00123000
*         DO;                       /*                       @Y30LB24*/ 00124000
*           OPERAND2=ADDR(RPLVQPTR);/* SET BACK LEVEL PTR    @Y30LB24*/ 00125000
         LR    OPERAND2,RPLVPTR                                    0089 00126000
*           RPLVPTR=RPLVQPTR;       /* BASE RPLV             @Y30LB24*/ 00127000
         LR    RPLVPTR,@11                                         0090 00128000
*         END;                      /*                       @Y30LB24*/ 00129000
*     END;                          /*                       @Y30LB24*/ 00130000
@RF00087 DS    0H                                                  0092 00131000
@DE00085 LTR   RPLNULL,RPLNULL                                     0092 00132000
         BNZ   @DL00085                                            0092 00133000
*     IF RPLVCOMP=OFF THEN          /* NOT COMPLETED?        @Y30LB24*/ 00134000
         TM    RPLVCOMP(RPLVPTR),B'00010000'                       0093 00135000
         BNZ   @RF00093                                            0093 00136000
*       DO;                         /*                       @ZA26243*/ 00137000
*         RPLVPROG=ON;              /* IN PROCESS SW ON      @ZA26243*/ 00138000
         OI    RPLVPROG(RPLVPTR),B'00100000'                       0095 00139000
*         RPLRMSCC=RPLRCODE;        /* SAVE RCODE            @ZA26243*/ 00140000
         MVC   RPLRMSCC(2,RPLVPTR),RPLRCODE(RPLVPTR)               0096 00141000
*         DO I=ONE TO TABLENG;      /* CHECK VALID OPCODE    @Y30LB24*/ 00142000
         LA    I,1                                                 0097 00143000
@DL00097 DS    0H                                                  0098 00144000
*           IF RPLVUOP=ORDOPCOD(I) THEN/* FOUND USER OPCODE? @Y30LB24*/ 00145000
         LA    @11,ORDOPCOD-1(I)                                   0098 00146000
         CLC   RPLVUOP+132(1,RPLVPTR),0(@11)                       0098 00147000
         BNE   @RF00098                                            0098 00148000
*             DO;                   /* YES                   @Y30LB24*/ 00149000
*               IF RPLVDATE=ZERO THEN/* IS DATE ZEROS        @ZA13484*/ 00150000
         ICM   @11,15,RPLVDATE(RPLVPTR)                            0100 00151000
         BNZ   @RF00100                                            0100 00152000
*                 DO;               /*                       @ZA13484*/ 00153000
*                   RPLVDATE=CVTDATE;/* SET CURRENT DATE     @ZA13484*/ 00154000
         L     @11,CVTPTR                                          0102 00155000
         MVC   RPLVDATE(4,RPLVPTR),CVTDATE(@11)                    0102 00156000
*                   RPLVDATE=RPLVDATE&FC;/* SET SIGN         @ZA13484*/ 00157000
         NC    RPLVDATE(4,RPLVPTR),@CB01037                        0103 00158000
*                 END;              /*                       @ZA13484*/ 00159000
*               RPLVVICB=VVIPTR;    /* SET RPLV MSVCB PTR    @Y30LB24*/ 00160000
@RF00100 ST    VVIPTR,RPLVVICB(,RPLVPTR)                           0105 00161000
*               REG1=RPLVPTR;       /* RPL FUNCTION PTR      @Y30LB24*/ 00162000
         LR    REG1,RPLVPTR                                        0106 00163000
*               REG15=BRTABLE(I);   /* SET BRANCH ADDR       @Y30LB24*/ 00164000
         LR    @11,I                                               0107 00165000
         SLA   @11,2                                               0107 00166000
         L     REG15,BRTABLE-4(@11)                                0107 00167000
*               VVIOPCD=RPLVUOP;    /* SAVE ORDER NUM        @ZA26243*/ 00168000
         MVC   VVIOPCD(1,VVIPTR),RPLVUOP+132(RPLVPTR)              0108 00169000
*               GEN(BALR  REG14,REG15);/* CALL FUNCTION      @Y30LB24*/ 00170000
         BALR  REG14,REG15                                              00171000
*               I=TABLENG+ONE;      /* UPDATE INDEX VALUE    @Y30LB24*/ 00172000
         LA    I,22                                                0110 00173000
*               RFY                                                0111 00174000
*                 IFGACB BASED(VVIACBAD);/* SET ACB ADDRESS  @ZM31134*/ 00175000
*               IF VVIACBAD^=ZERO&  /* IS THERE AN ACB       @Y30LB24*/ 00176000
*                   ACBOPEN=ON&     /* ACB OPENED?           @ZM31134*/ 00177000
*                   RPLVACB^=ZERO THEN/* ENDREQ NEEDED?      @Y30LB24*/ 00178000
         SLR   @11,@11                                             0112 00179000
         L     @04,VVIACBAD(,VVIPTR)                               0112 00180000
         CR    @04,@11                                             0112 00181000
         BE    @RF00112                                            0112 00182000
         TM    ACBOPEN(@04),B'00010000'                            0112 00183000
         BNO   @RF00112                                            0112 00184000
         C     @11,RPLVACB(,RPLVPTR)                               0112 00185000
         BE    @RF00112                                            0112 00186000
*                 DO;               /* YES                   @Y30LB24*/ 00187000
*                   RPLVTYP=ZERO;   /* ZERO FIELD            @Y30LB24*/ 00188000
         MVI   RPLVTYP(RPLVPTR),X'00'                              0114 00189000
*                   REG1=ADDR(RPLVSAM);/* SET UP RPL ADDR    @Y30LB24*/ 00190000
         LA    REG1,RPLVSAM(,RPLVPTR)                              0115 00191000
*LENDREQ:                                                          0116 00192000
*                   GEN(ENDREQ  RPL=(REG1));/* ISSUE ENDREQ  @Y30LB24*/ 00193000
LENDREQ  ENDREQ  RPL=(REG1)                                             00194000
*                 END;              /*                       @Y30LB24*/ 00195000
*             END;                  /*                       @Y30LB24*/ 00196000
*           ELSE                    /* OTHERWISE, IF         @Y30LB24*/ 00197000
*             IF I=TABLENG THEN     /* TABLE EXHAUSTED       @Y30LB24*/ 00198000
         B     @RC00098                                            0119 00199000
@RF00098 C     I,@CF00833                                          0119 00200000
         BNE   @RF00119                                            0119 00201000
*               DO;                 /* YES                   @Y30LB24*/ 00202000
*                 RPLRCODE=RCON1;   /* SET FAIL CODE         @Y30LB24*/ 00203000
         MVC   RPLRCODE(2,RPLVPTR),RCON1                           0121 00204000
*                 RPLVRETC=FOUR;    /* SET RETURN CODE       @Y30LB24*/ 00205000
         MVC   RPLVRETC(2,RPLVPTR),@CH00066                        0122 00206000
*               END;                /*                       @Y30LB24*/ 00207000
*         END;                      /*                       @Y30LB24*/ 00208000
@RF00119 DS    0H                                                  0124 00209000
@RC00098 AL    I,@CF00074                                          0124 00210000
         C     I,@CF00833                                          0124 00211000
         BNH   @DL00097                                            0124 00212000
*       END;                        /*                       @ZA26243*/ 00213000
*     RPLVCOMP=ON;                  /* RPL IS COMPLETE       @Y30LB24*/ 00214000
@RF00093 OI    RPLVCOMP(RPLVPTR),B'00010000'                       0126 00215000
*     SAVRCODE=RPLRCODE;            /* SAVE FAIL CODE        @Y30LB24*/ 00216000
         LH    @11,RPLRCODE(,RPLVPTR)                              0127 00217000
         N     @11,@CF01110                                        0127 00218000
         ST    @11,SAVRCODE                                        0127 00219000
*     SAVRETC=RPLVRETC;             /* SAVE RETURN CODE      @Y30LB24*/ 00220000
         LH    @11,RPLVRETC(,RPLVPTR)                              0128 00221000
         N     @11,@CF01110                                        0128 00222000
         ST    @11,SAVRETC                                         0128 00223000
*     IF VVIFLG4=ON&                /* INVENTORY RESERVE HELD      0129 00224000
*                                                            @Y30LB24*/ 00225000
*         VVIIUCB^=ZERO THEN        /* IS THERE A MSVI UCB ADDR    0129 00226000
*                                                            @ZM31134*/ 00227000
         TM    VVIFLG4(VVIPTR),B'00001000'                         0129 00228000
         BNO   @RF00129                                            0129 00229000
         L     @11,VVIIUCB(,VVIPTR)                                0129 00230000
         LTR   @11,@11                                             0129 00231000
         BZ    @RF00129                                            0129 00232000
*       DO;                         /* YES                   @Y30LB24*/ 00233000
*         REG1=RPLVPTR;             /* RPL FUNCTION PTR      @Y30LB24*/ 00234000
         LR    REG1,RPLVPTR                                        0131 00235000
*         REG0=ZERO;                /* SET MSVI DEQ IND      @Y30LB24*/ 00236000
         SLR   REG0,REG0                                           0132 00237000
*         CALL ICBVRR00;            /* CALL R/R MODULE       @Y30LB24*/ 00238000
         L     @15,@CV01032                                        0133 00239000
         BALR  @14,@15                                             0133 00240000
*       END;                        /*                       @Y30LB24*/ 00241000
*     IF VVIFLG5=ON&                /* JOURNAL RESERVE HELD  @Y30LB24*/ 00242000
*         VVIJUCB^=ZERO THEN        /* IS THERE A JRNL UCB ADDR    0135 00243000
*                                                            @ZM31134*/ 00244000
@RF00129 TM    VVIFLG5(VVIPTR),B'00000100'                         0135 00245000
         BNO   @RF00135                                            0135 00246000
         L     @11,VVIJUCB(,VVIPTR)                                0135 00247000
         LTR   @11,@11                                             0135 00248000
         BZ    @RF00135                                            0135 00249000
*       DO;                         /* YES                   @Y30LB24*/ 00250000
*         REG1=RPLVPTR;             /* RPL FUNCTION PTR      @Y30LB24*/ 00251000
         LR    REG1,RPLVPTR                                        0137 00252000
*         REG0=VRRID;               /* SET JRNL DEQ IND      @Y30LB24*/ 00253000
         SLR   REG0,REG0                                           0138 00254000
         IC    REG0,VRRID                                          0138 00255000
*         CALL ICBVRR00;            /* CALL R/R MODULE       @Y30LB24*/ 00256000
         L     @15,@CV01032                                        0139 00257000
         BALR  @14,@15                                             0139 00258000
*       END;                        /*                       @Y30LB24*/ 00259000
*     RPLRCODE=SAVRCODE;            /* RESET FAIL CODE       @Y30LB24*/ 00260000
@RF00135 L     @11,SAVRCODE                                        0141 00261000
         STH   @11,RPLRCODE(,RPLVPTR)                              0141 00262000
*     RPLVRETC=SAVRETC;             /* RESET RETURN CODE     @Y30LB24*/ 00263000
         L     @11,SAVRETC                                         0142 00264000
         STH   @11,RPLVRETC(,RPLVPTR)                              0142 00265000
*     GEN(CS  RPLVPTR,RPLNULL,M0(OPERAND2));/* COMPARE & SWAP      0143 00266000
*                                                            @Y30LB24*/ 00267000
         CS  RPLVPTR,RPLNULL,M0(OPERAND2)                               00268000
*     BC(FOUR,CSFAIL);              /* IF FAIL, BRANCH       @Y30LB24   00269000
*                                      TO CS FAIL RTN        @Y30LB24   00270000
*                                      OTHERWISE CONTINUE    @Y30LB24*/ 00271000
         BC    4,CSFAIL                                            0144 00272000
*                                                                  0145 00273000
*     /***************************************************************/ 00274000
*     /*                                                             */ 00275000
*     /* THIS CODE SHALL NOT BE EXECUTED UNLESS CSFAIL IS DIRECTLY   */ 00276000
*     /* BRANCHED INTO.                                      @Y30LB24*/ 00277000
*     /*                                                             */ 00278000
*     /***************************************************************/ 00279000
*                                                                  0145 00280000
*     IF LOOP^=LOOP THEN            /*                       @Y30LB24*/ 00281000
         B     @RF00145                                            0145 00282000
*CSFAIL:                                                           0146 00283000
*       DO;                         /*                       @Y30LB24*/ 00284000
CSFAIL   DS    0H                                                  0147 00285000
*         OPERAND2=RPLSAV;          /* SET BACK LEVEL PTR    @Y30LB24*/ 00286000
         LR    OPERAND2,RPLSAV                                     0147 00287000
*         RPLVPTR=OPERAND2->RPLVQPTR;/* RESTORE RPLV         @Y30LB24*/ 00288000
         L     RPLVPTR,RPLVQPTR(,OPERAND2)                         0148 00289000
*         DO UNTIL RPLNULL=ZERO;    /* FIND LAST RPL         @Y30LB24*/ 00290000
@DL00149 DS    0H                                                  0150 00291000
*           RPLNULL=RPLVQPTR;       /* GET CHAINED ELEMENT   @Y30LB24*/ 00292000
         L     @11,RPLVQPTR(,RPLVPTR)                              0150 00293000
         LR    RPLNULL,@11                                         0150 00294000
*           IF RPLVQPTR^=ZERO THEN  /* IF NOT AT LAST RPL    @Y30LB24*/ 00295000
         LTR   @11,@11                                             0151 00296000
         BZ    @RF00151                                            0151 00297000
*             DO;                   /* NO LAST               @Y30LB24*/ 00298000
*               OPERAND2=ADDR(RPLVQPTR);/* SET BACK LEVEL PTR      0153 00299000
*                                                            @Y30LB24*/ 00300000
         LR    OPERAND2,RPLVPTR                                    0153 00301000
*               RPLVPTR=RPLVQPTR;   /* BASE RPLV             @Y30LB24*/ 00302000
         LR    RPLVPTR,@11                                         0154 00303000
*             END;                  /*                       @Y30LB24*/ 00304000
*         END;                      /*                       @Y30LB24*/ 00305000
@RF00151 DS    0H                                                  0156 00306000
@DE00149 LTR   RPLNULL,RPLNULL                                     0156 00307000
         BNZ   @DL00149                                            0156 00308000
*         GEN(CS  RPLVPTR,RPLNULL,M0(OPERAND2));/* COMPARE & SWAP  0157 00309000
*                                                            @Y30LB24*/ 00310000
         CS  RPLVPTR,RPLNULL,M0(OPERAND2)                               00311000
*         BC(FOUR,CSFAIL);          /* IF FAIL, BRANCH       @Y30LB24*/ 00312000
         BC    4,CSFAIL                                            0158 00313000
*       END;                        /*                       @Y30LB24*/ 00314000
*                                                                  0160 00315000
*     /***************************************************************/ 00316000
*     /*                                                             */ 00317000
*     /* IF THE REQUESTOR IS WAITING FOR THE RESULTS OF THE FUNCTION,*/ 00318000
*     /* THE ECB IN THE RPLV IS POSTED. IF THE REQUESTOR IS NOT      */ 00319000
*     /* WAITING FOR THE RESULTS OF THE FUNCTION, THE STORAGE FOR THE*/ 00320000
*     /* RPLV IS FREED.                                      @Y30LB24*/ 00321000
*     /*                                                             */ 00322000
*     /***************************************************************/ 00323000
*                                                                  0160 00324000
*     IF RPLVPOST=ON THEN           /* POST RPL?             @Y30LB24*/ 00325000
@RF00145 TM    RPLVPOST(RPLVPTR),B'01000000'                       0160 00326000
         BNO   @RF00160                                            0160 00327000
*       DO;                         /* YES                   @Y30LB24*/ 00328000
*         RPLVRSV1=ADDR(RPLVECB);   /* SET PARM LIST ECB     @Y30LB24*/ 00329000
         LA    @11,RPLVECB(,RPLVPTR)                               0162 00330000
         ST    @11,RPLVRSV1(,RPLVPTR)                              0162 00331000
*         RPLVRSV2=RPLASCBP;        /* SET PARM LIST ASCB    @Y30LB24*/ 00332000
         L     @11,RPLASCBP(,RPLVPTR)                              0163 00333000
         ST    @11,RPLVRSV2(,RPLVPTR)                              0163 00334000
*         RPLVRSV3=ADDR(CVTBRET);   /* PARM LIST ERRADD      @ZA28148*/ 00335000
         L     @11,CVTPTR                                          0164 00336000
         LA    @11,CVTBRET(,@11)                                   0164 00337000
         ST    @11,RPLVRSV3(,RPLVPTR)                              0164 00338000
*         REG1=ADDR(RPLVRSV1);      /* SET PARM REG          @Y30LB24*/ 00339000
         LA    REG1,RPLVRSV1(,RPLVPTR)                             0165 00340000
*         GEN(ICM REG1,M8,EID);     /* INDICATE PARM LIST    @Y30LB24*/ 00341000
         ICM REG1,M8,EID                                                00342000
*         REG0=ZERO;                /* SET POST CODE         @Y30LB24*/ 00343000
         SLR   REG0,REG0                                           0167 00344000
*LPOST:                                                            0168 00345000
*         GEN(SVC   POST);          /* POST USER             @Y30LB24*/ 00346000
LPOST    SVC   POST                                                     00347000
*       END;                        /*                       @Y30LB24*/ 00348000
*     ELSE                          /* NO, FREEMAIN          @Y30LB24*/ 00349000
*       DO;                         /*                       @Y30LB24*/ 00350000
         B     @RC00160                                            0170 00351000
@RF00160 DS    0H                                                  0171 00352000
*         IF RPLVUOP='87'X THEN     /* READ INVENTORY        @Y30LB24*/ 00353000
         CLI   RPLVUOP+132(RPLVPTR),X'87'                          0171 00354000
         BNE   @RF00171                                            0171 00355000
*           DO;                     /* YES                   @Y30LB24*/ 00356000
*             REG1=ADDR(RPLVUTIL);  /* SET ADDR REG          @Y30LB24*/ 00357000
         LA    REG1,RPLVUTIL(,RPLVPTR)                             0173 00358000
*             IF RVVAREA^=ZERO THEN /* BUFFER AVAILABLE      @Y30LB24*/ 00359000
         L     @11,RVVAREA(,REG1)                                  0174 00360000
         LTR   @11,@11                                             0174 00361000
         BZ    @RF00174                                            0174 00362000
*               DO;                 /* YES                   @Y30LB24*/ 00363000
*                 REG0=RVVARLN;     /* SET BUFFER LEN        @Y30LB24*/ 00364000
         LH    REG0,RVVARLN(,REG1)                                 0176 00365000
*                 GEN(ICM REG0,M8,POOL);/* INDICATE SUBPOOL  @Y30LB24*/ 00366000
         ICM REG0,M8,POOL                                               00367000
*                 REG1=RVVAREA;     /* SET BUFFER PTR        @Y30LB24*/ 00368000
         L     REG1,RVVAREA(,REG1)                                 0178 00369000
*LFREM1:                                                           0179 00370000
*                 GEN(FREEMAIN R,LV=(0),A=(1));/* FREEMAIN BUFF    0179 00371000
*                                                            @Y30LB24*/ 00372000
LFREM1   FREEMAIN R,LV=(0),A=(1)                                        00373000
*               END;                /*                       @Y30LB24*/ 00374000
*           END;                    /*                       @Y30LB24*/ 00375000
@RF00174 DS    0H                                                  0182 00376000
*         REG0=RPLVTLEN;            /* SET FREEMAIN LENGTH   @Y30LB24*/ 00377000
@RF00171 LH    REG0,RPLVTLEN(,RPLVPTR)                             0182 00378000
*         GEN(ICM REG0,M8,POOL);    /* INDICATE SUBPOOL 241  @Y30LB24*/ 00379000
         ICM REG0,M8,POOL                                               00380000
*         REG1=RPLVPTR;             /* SET FREEMAIN ADDR     @Y30LB24*/ 00381000
         LR    REG1,RPLVPTR                                        0184 00382000
*LFREM2:                                                           0185 00383000
*         GEN(FREEMAIN R,LV=(0),A=(1));/* FREEMAIN SUBPOOL 241     0185 00384000
*                                                            @Y30LB24*/ 00385000
LFREM2   FREEMAIN R,LV=(0),A=(1)                                        00386000
*       END;                        /*                       @Y30LB24*/ 00387000
*   END;                            /* END PROCESS LOOP      @Y30LB24*/ 00388000
@RC00160 DS    0H                                                  0187 00389000
@DE00064 B     @DL00064                                            0187 00390000
*   END ICBVCR00                    /* END ICBVCR00          @Y30LB24*/ 00391000
*                                                                  0188 00392000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00393000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00394000
*/*%INCLUDE SYSLIB  (IEZSSC  )                                       */ 00395000
*/*%INCLUDE SYSLIB  (IEZVVICB)                                       */ 00396000
*/*%INCLUDE SYSLIB  (IEZRPLV )                                       */ 00397000
*/*%INCLUDE SYSLIB  (IEZRVVI )                                       */ 00398000
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */ 00399000
*                                                                  0188 00400000
*       ;                                                          0188 00401000
@EL00001 L     @13,4(,@13)                                         0188 00402000
@EF00001 DS    0H                                                  0188 00403000
@ER00001 BR    @14                                                 0188 00404000
@DATA    DS    0H                                                       00405000
@CH00066 DC    H'4'                                                     00406000
         DS    0F                                                       00407000
@SA00001 DS    18F                                                      00408000
         DS    0F                                                       00409000
@CF00074 DC    F'1'                                                     00410000
@CF00833 DC    F'21'                                                    00411000
@CF01110 DC    XL4'0000FFFF'                                            00412000
@CV01024 DC    V(ICBVDM00)                                              00413000
@CV01025 DC    V(ICBVMT00)                                              00414000
@CV01026 DC    V(ICBVUT00)                                              00415000
@CV01027 DC    V(ICBVUT03)                                              00416000
@CV01028 DC    V(ICBVSP00)                                              00417000
@CV01029 DC    V(ICBVUT01)                                              00418000
@CV01030 DC    V(ICBVMS00)                                              00419000
@CV01031 DC    V(ICBVIN00)                                              00420000
@CV01032 DC    V(ICBVRR00)                                              00421000
@CV01033 DC    V(ICBVSL00)                                              00422000
@CV01034 DC    V(ICBVEX00)                                              00423000
@CV01035 DC    V(ICBVTM00)                                              00424000
         DS    0D                                                       00425000
SAVRCODE DS    F                                                        00426000
SAVRETC  DS    F                                                        00427000
RVVLEN   DC    AL2(68)                                                  00428000
POOL     DC    AL1(241)                                                 00429000
EID      DC    XL1'80'                                                  00430000
VRRID    DC    XL1'10'                                                  00431000
@CB01037 DC    X'FFFFFFFC'                                              00432000
RCON1    DC    X'0217'                                                  00433000
VCRPATCH DS    CL50                                                     00434000
         ORG   VCRPATCH                                                 00435000
@NM00027 DC    CL20'ICBVCR00 PATCH AREA '                               00436000
@NM00028 DC    XL30'0'                                                  00437000
         ORG   VCRPATCH+50                                              00438000
ORDOPCOD DC    X'02'                                                    00439000
         DC    X'06'                                                    00440000
         DC    X'08'                                                    00441000
         DC    X'09'                                                    00442000
         DC    X'0E'                                                    00443000
         DC    X'14'                                                    00444000
         DC    X'18'                                                    00445000
         DC    X'22'                                                    00446000
         DC    X'28'                                                    00447000
         DC    X'2A'                                                    00448000
         DC    X'2C'                                                    00449000
         DC    X'81'                                                    00450000
         DC    X'82'                                                    00451000
         DC    X'83'                                                    00452000
         DC    X'84'                                                    00453000
         DC    X'85'                                                    00454000
         DC    X'86'                                                    00455000
         DC    X'87'                                                    00456000
         DC    X'88'                                                    00457000
         DC    X'89'                                                    00458000
         DC    X'8A'                                                    00459000
         DS    CL2                                                      00460000
BRTABLE  DC    VL4(ICBVEX00)                                            00461000
         DC    VL4(ICBVDM00)                                            00462000
         DC    VL4(ICBVMT00)                                            00463000
         DC    VL4(ICBVUT03)                                            00464000
         DC    VL4(ICBVUT00)                                            00465000
         DC    VL4(ICBVSP00)                                            00466000
         DC    VL4(ICBVUT00)                                            00467000
         DC    VL4(ICBVSP00)                                            00468000
         DC    2VL4(ICBVUT00)                                           00469000
         DC    VL4(ICBVSP00)                                            00470000
         DC    5VL4(ICBVUT01)                                           00471000
         DC    VL4(ICBVMS00)                                            00472000
         DC    VL4(ICBVUT01)                                            00473000
         DC    VL4(ICBVIN00)                                            00474000
         DC    VL4(ICBVSL00)                                            00475000
         DC    VL4(ICBVTM00)                                            00476000
ICBVCR00 CSECT                                                          00477000
*                                                /*           @Y30LB24* 00478000
M0       EQU   0                                                        00479000
M8       EQU   8                                                        00480000
POST     EQU   2                                                        00481000
ICBVCR00 CSECT                                                          00482000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00483000
@01      EQU   01                                                       00484000
@02      EQU   02                                                       00485000
@03      EQU   03                                                       00486000
@04      EQU   04                                                       00487000
@05      EQU   05                                                       00488000
@06      EQU   06                                                       00489000
@07      EQU   07                                                       00490000
@08      EQU   08                                                       00491000
@09      EQU   09                                                       00492000
@10      EQU   10                                                       00493000
@11      EQU   11                                                       00494000
@12      EQU   12                                                       00495000
@13      EQU   13                                                       00496000
@14      EQU   14                                                       00497000
@15      EQU   15                                                       00498000
REG0     EQU   @00                                                      00499000
REG1     EQU   @01                                                      00500000
I        EQU   @05                                                      00501000
VVIPTR   EQU   @06                                                      00502000
RPLSAV   EQU   @07                                                      00503000
RPLVPTR  EQU   @08                                                      00504000
RPLNULL  EQU   @09                                                      00505000
OPERAND2 EQU   @10                                                      00506000
REG14    EQU   @14                                                      00507000
REG15    EQU   @15                                                      00508000
CVTPTR   EQU   16                                                       00509000
RVVIPTR  EQU   0                                                        00510000
CVTMAP   EQU   0                                                        00511000
CVTDATE  EQU   CVTMAP+56                                                00512000
CVTDAR   EQU   CVTMAP+72                                                00513000
CVTFLGS1 EQU   CVTDAR                                                   00514000
CVTBRET  EQU   CVTMAP+82                                                00515000
CVTDCB   EQU   CVTMAP+116                                               00516000
CVTIOQET EQU   CVTMAP+120                                               00517000
CVTIERLC EQU   CVTMAP+144                                               00518000
CVTHEAD  EQU   CVTMAP+160                                               00519000
CVTSV76C EQU   CVTHEAD                                                  00520000
CVTOPTA  EQU   CVTMAP+182                                               00521000
CVTOPTB  EQU   CVTMAP+183                                               00522000
CVTGTF   EQU   CVTMAP+236                                               00523000
CVTGTFST EQU   CVTGTF                                                   00524000
CVTGTFS  EQU   CVTGTFST                                                 00525000
CVTSTATE EQU   CVTGTFST                                                 00526000
CVTTMODE EQU   CVTGTFST                                                 00527000
CVTFORM  EQU   CVTGTFST                                                 00528000
CVTAQAVT EQU   CVTMAP+240                                               00529000
CVTTCMFG EQU   CVTAQAVT                                                 00530000
CVTVOLM2 EQU   CVTMAP+244                                               00531000
CVTTATA  EQU   CVTVOLM2                                                 00532000
CVTTSKS  EQU   CVTTATA                                                  00533000
CVTVOLF2 EQU   CVTTSKS                                                  00534000
CVTTAT   EQU   CVTTATA+1                                                00535000
CVTATER  EQU   CVTMAP+248                                               00536000
CVTEXT1  EQU   CVTMAP+252                                               00537000
CVTPURG  EQU   CVTMAP+260                                               00538000
CVTQMSG  EQU   CVTMAP+268                                               00539000
CVTDMSR  EQU   CVTMAP+272                                               00540000
CVTRSV37 EQU   CVTDMSR                                                  00541000
CVTDMSRF EQU   CVTRSV37                                                 00542000
CVTERPV  EQU   CVTMAP+316                                               00543000
CVTINTLA EQU   CVTMAP+320                                               00544000
CVTAPF   EQU   CVTMAP+324                                               00545000
CVTEXT2  EQU   CVTMAP+328                                               00546000
CVTHJES  EQU   CVTMAP+332                                               00547000
CVTPGSIA EQU   CVTMAP+348                                               00548000
CVTA1F1  EQU   CVTMAP+356                                               00549000
CVTSYSK  EQU   CVTMAP+357                                               00550000
CVTVOLM1 EQU   CVTMAP+380                                               00551000
CVTVOLF1 EQU   CVTVOLM1                                                 00552000
CVTATMCT EQU   CVTMAP+388                                               00553000
CVTXTNT1 EQU   0                                                        00554000
CVTXTNT2 EQU   0                                                        00555000
CVTDSSV  EQU   CVTXTNT2                                                 00556000
CVTFLGBT EQU   CVTXTNT2+5                                               00557000
CVTQID   EQU   CVTXTNT2+24                                              00558000
CVTICB   EQU   CVTXTNT2+48                                              00559000
CVTRV400 EQU   CVTXTNT2+52                                              00560000
CVTRV409 EQU   CVTXTNT2+53                                              00561000
CVTATCVT EQU   CVTXTNT2+64                                              00562000
CVTRV429 EQU   CVTXTNT2+84                                              00563000
CVTRV438 EQU   CVTXTNT2+85                                              00564000
CVTRV457 EQU   CVTXTNT2+112                                             00565000
CVTRV466 EQU   CVTXTNT2+113                                             00566000
CVTFIX   EQU   0                                                        00567000
CVTRELNO EQU   CVTFIX+252                                               00568000
ICB2SSCB EQU   0                                                        00569000
ICBOPT   EQU   ICB2SSCB+48                                              00570000
ICBFLG   EQU   ICB2SSCB+52                                              00571000
ICBFG1   EQU   ICBFLG                                                   00572000
ICBVVICB EQU   ICB2SSCB+76                                              00573000
ICBTRACE EQU   ICB2SSCB+148                                             00574000
VVICB    EQU   0                                                        00575000
VVIFLGA  EQU   VVICB+15                                                 00576000
VVIFLG4  EQU   VVIFLGA                                                  00577000
VVIFLG5  EQU   VVIFLGA                                                  00578000
VVIACBAD EQU   VVICB+16                                                 00579000
VVIECB1  EQU   VVICB+28                                                 00580000
VVIOPCD  EQU   VVICB+36                                                 00581000
VVIQRPL1 EQU   VVICB+40                                                 00582000
VVIQRPL2 EQU   VVICB+44                                                 00583000
VVIIUCB  EQU   VVICB+76                                                 00584000
VVIJUCB  EQU   VVICB+80                                                 00585000
RPLV     EQU   0                                                        00586000
RPLVQPTR EQU   RPLV                                                     00587000
RPLVECB  EQU   RPLV+4                                                   00588000
RPLTCBPR EQU   RPLV+8                                                   00589000
RPLASCBP EQU   RPLTCBPR                                                 00590000
RPLVVICB EQU   RPLV+12                                                  00591000
RPLVRSV1 EQU   RPLV+16                                                  00592000
RPLVRSV2 EQU   RPLV+20                                                  00593000
RPLVRSV3 EQU   RPLV+24                                                  00594000
RPLFLAGA EQU   RPLV+28                                                  00595000
RPLVPOST EQU   RPLFLAGA                                                 00596000
RPLVPROG EQU   RPLFLAGA                                                 00597000
RPLVCOMP EQU   RPLFLAGA                                                 00598000
RPLVTLEN EQU   RPLV+30                                                  00599000
RPLRCODE EQU   RPLV+32                                                  00600000
RPLVRETC EQU   RPLV+34                                                  00601000
RPLRMSCC EQU   RPLV+36                                                  00602000
RPLVDATE EQU   RPLV+38                                                  00603000
RPLVSAM  EQU   RPLV+56                                                  00604000
RPLVTYP  EQU   RPLVSAM+2                                                00605000
RPLVACB  EQU   RPLVSAM+24                                               00606000
RPLVOPT  EQU   RPLVSAM+40                                               00607000
RPLVUTIL EQU   RPLV+132                                                 00608000
PARMLIST EQU   0                                                        00609000
RPLVUOP  EQU   PARMLIST+4                                               00610000
RVVI     EQU   0                                                        00611000
RVVOPCOD EQU   RVVI+4                                                   00612000
RVVARLN  EQU   RVVI+22                                                  00613000
RVVAREA  EQU   RVVI+24                                                  00614000
RVVFLAGA EQU   RVVI+58                                                  00615000
RVVRMODE EQU   RVVFLAGA                                                 00616000
RVVCHAIN EQU   RVVFLAGA+1                                               00617000
RVVRDRCD EQU   RVVFLAGA+2                                               00618000
RVVRTEST EQU   RVVFLAGA+3                                               00619000
RVVCPYTP EQU   RVVFLAGA+4                                               00620000
RVVSPEC  EQU   RVVFLAGA+5                                               00621000
IFGACB   EQU   0                                                        00622000
ACBCOMN  EQU   IFGACB                                                   00623000
ACBLENG  EQU   ACBCOMN+2                                                00624000
ACBLENG2 EQU   ACBLENG                                                  00625000
ACBAMBL  EQU   ACBCOMN+4                                                00626000
ACBJWA   EQU   ACBAMBL                                                  00627000
ACBMACRF EQU   ACBCOMN+12                                               00628000
ACBMACR1 EQU   ACBMACRF                                                 00629000
ACBADR   EQU   ACBMACR1                                                 00630000
ACBCNV   EQU   ACBMACR1                                                 00631000
ACBMACR2 EQU   ACBMACRF+1                                               00632000
ACBBUFPL EQU   ACBCOMN+20                                               00633000
ACBMACR3 EQU   ACBBUFPL                                                 00634000
ACBRECFM EQU   ACBCOMN+24                                               00635000
ACBCCTYP EQU   ACBCOMN+25                                               00636000
ACBOPT   EQU   ACBCOMN+26                                               00637000
ACBDSORG EQU   ACBOPT                                                   00638000
ACBCROPS EQU   ACBDSORG                                                 00639000
ACBEXLST EQU   ACBCOMN+36                                               00640000
ACBDDNM  EQU   ACBCOMN+40                                               00641000
ACBAMETH EQU   ACBDDNM+3                                                00642000
ACBOFLGS EQU   ACBCOMN+48                                               00643000
ACBOPEN  EQU   ACBOFLGS                                                 00644000
ACBEXFG  EQU   ACBOFLGS                                                 00645000
ACBIOSFG EQU   ACBOFLGS                                                 00646000
ACBINFLG EQU   ACBCOMN+50                                               00647000
ACBUJFCB EQU   ACBCOMN+52                                               00648000
ACBBLKSZ EQU   ACBCOMN+60                                               00649000
CVTS01   EQU   CVTPGSIA                                                 00650000
CVTLPDIA EQU   CVTS01+12                                                00651000
CVTDIRST EQU   CVTLPDIA                                                 00652000
CVTSLIDA EQU   CVTS01+24                                                00653000
CVTCTLFG EQU   CVTS01+50                                                00654000
CVTRV210 EQU   CVTS01+424                                               00655000
CVTRV219 EQU   CVTS01+425                                               00656000
CVTRV228 EQU   CVTS01+426                                               00657000
CVTRV237 EQU   CVTS01+427                                               00658000
CVTMFRTR EQU   CVTS01+452                                               00659000
CVTRV262 EQU   CVTS01+468                                               00660000
CVTRV271 EQU   CVTS01+469                                               00661000
CVTRV280 EQU   CVTS01+470                                               00662000
CVTRV289 EQU   CVTS01+471                                               00663000
CVTGSDA  EQU   CVTS01+600                                               00664000
ICBPTR   EQU   CVTICB                                                   00665000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00666000
CVTRV628 EQU   CVTS01+728                                               00667000
CVTRV627 EQU   CVTS01+724                                               00668000
CVTRV626 EQU   CVTS01+720                                               00669000
CVTRV625 EQU   CVTS01+716                                               00670000
CVTRV624 EQU   CVTS01+712                                               00671000
CVTRV623 EQU   CVTS01+708                                               00672000
CVTRV622 EQU   CVTS01+704                                               00673000
CVTRV621 EQU   CVTS01+700                                               00674000
CVTIHASU EQU   CVTS01+696                                               00675000
CVTRV619 EQU   CVTS01+692                                               00676000
CVTRV618 EQU   CVTS01+688                                               00677000
CVTRV617 EQU   CVTS01+684                                               00678000
CVTRV616 EQU   CVTS01+680                                               00679000
CVTRV615 EQU   CVTS01+676                                               00680000
CVTRV614 EQU   CVTS01+672                                               00681000
CVTRV613 EQU   CVTS01+668                                               00682000
CVTTCASP EQU   CVTS01+664                                               00683000
CVT0PT03 EQU   CVTS01+660                                               00684000
CVT0PT0E EQU   CVTS01+656                                               00685000
CVTRV609 EQU   CVTS01+652                                               00686000
CVTCGK   EQU   CVTS01+648                                               00687000
CVTRAC   EQU   CVTS01+644                                               00688000
CVTRV606 EQU   CVTS01+640                                               00689000
CVTRV605 EQU   CVTS01+636                                               00690000
CVTRV604 EQU   CVTS01+632                                               00691000
CVTEFF02 EQU   CVTS01+628                                               00692000
CVTCBBR  EQU   CVTS01+624                                               00693000
CVTSSCR  EQU   CVTS01+620                                               00694000
CVTEVENT EQU   CVTS01+616                                               00695000
CVTCRCA  EQU   CVTS01+612                                               00696000
CVTTPIO  EQU   CVTS01+608                                               00697000
CVTADV   EQU   CVTS01+604                                               00698000
CVTGSDAB EQU   CVTGSDA                                                  00699000
CVTQV3   EQU   CVTS01+596                                               00700000
CVTQV2   EQU   CVTS01+592                                               00701000
CVTQV1   EQU   CVTS01+588                                               00702000
CVTRPT   EQU   CVTS01+584                                               00703000
CVTSSRB  EQU   CVTS01+580                                               00704000
CVTCSDRL EQU   CVTS01+576                                               00705000
CVTEXP1  EQU   CVTS01+572                                               00706000
CVTRMPMT EQU   CVTS01+568                                               00707000
CVTRMPTT EQU   CVTS01+564                                               00708000
CVTVPSA  EQU   CVTS01+560                                               00709000
CVTVSTOP EQU   CVTS01+556                                               00710000
CVTGTFR8 EQU   CVTS01+552                                               00711000
CVTQUIT  EQU   CVTS01+548                                               00712000
CVTVACR  EQU   CVTS01+544                                               00713000
CVTWTCB  EQU   CVTS01+540                                               00714000
CVTSTPRS EQU   CVTS01+536                                               00715000
CVT0PT02 EQU   CVTS01+532                                               00716000
CVTDARCM EQU   CVTS01+528                                               00717000
CVTIRECM EQU   CVTS01+524                                               00718000
CVTJRECM EQU   CVTS01+520                                               00719000
CVTVEMS0 EQU   CVTS01+516                                               00720000
CVTSPFRR EQU   CVTS01+512                                               00721000
CVTRLSTG EQU   CVTS01+508                                               00722000
CVT0TC0A EQU   CVTS01+504                                               00723000
CVTGMBR  EQU   CVTS01+500                                               00724000
CVTLFRM  EQU   CVTS01+496                                               00725000
CVTRMBR  EQU   CVTS01+492                                               00726000
CVTVIOP  EQU   CVTS01+488                                               00727000
CVTRV307 EQU   CVTS01+486                                               00728000
CVTRV306 EQU   CVTS01+484                                               00729000
CVTRV305 EQU   CVTS01+482                                               00730000
CVTRV304 EQU   CVTS01+480                                               00731000
CVTRV303 EQU   CVTS01+478                                               00732000
CVTRV302 EQU   CVTS01+476                                               00733000
CVTTRCA  EQU   CVTS01+472                                               00734000
CVTRV297 EQU   CVTRV289                                                 00735000
CVTRV296 EQU   CVTRV289                                                 00736000
CVTRV295 EQU   CVTRV289                                                 00737000
CVTRV294 EQU   CVTRV289                                                 00738000
CVTRV293 EQU   CVTRV289                                                 00739000
CVTRV292 EQU   CVTRV289                                                 00740000
CVTRV291 EQU   CVTRV289                                                 00741000
CVTRV290 EQU   CVTRV289                                                 00742000
CVTRV288 EQU   CVTRV280                                                 00743000
CVTRV287 EQU   CVTRV280                                                 00744000
CVTRV286 EQU   CVTRV280                                                 00745000
CVTRV285 EQU   CVTRV280                                                 00746000
CVTRV284 EQU   CVTRV280                                                 00747000
CVTRV283 EQU   CVTRV280                                                 00748000
CVTRV282 EQU   CVTRV280                                                 00749000
CVTRV281 EQU   CVTRV280                                                 00750000
CVTRV279 EQU   CVTRV271                                                 00751000
CVTRV278 EQU   CVTRV271                                                 00752000
CVTRV277 EQU   CVTRV271                                                 00753000
CVTRV276 EQU   CVTRV271                                                 00754000
CVTRV275 EQU   CVTRV271                                                 00755000
CVTRV274 EQU   CVTRV271                                                 00756000
CVTRV273 EQU   CVTRV271                                                 00757000
CVTRV272 EQU   CVTRV271                                                 00758000
CVTRV270 EQU   CVTRV262                                                 00759000
CVTRV269 EQU   CVTRV262                                                 00760000
CVTRV268 EQU   CVTRV262                                                 00761000
CVTRV267 EQU   CVTRV262                                                 00762000
CVTRV266 EQU   CVTRV262                                                 00763000
CVTRV265 EQU   CVTRV262                                                 00764000
CVTRV264 EQU   CVTRV262                                                 00765000
CVTRV263 EQU   CVTRV262                                                 00766000
CVTVFP   EQU   CVTS01+464                                               00767000
CVTVSI   EQU   CVTS01+460                                               00768000
CVTVPSIB EQU   CVTS01+456                                               00769000
CVTMFACT EQU   CVTMFRTR                                                 00770000
CVTMFCTL EQU   CVTS01+448                                               00771000
CVTPVBP  EQU   CVTS01+444                                               00772000
CVTPWI   EQU   CVTS01+440                                               00773000
CVTRV254 EQU   CVTS01+438                                               00774000
CVTRV253 EQU   CVTS01+436                                               00775000
CVTRV252 EQU   CVTS01+434                                               00776000
CVTRV251 EQU   CVTS01+433                                               00777000
CVTRV250 EQU   CVTS01+432                                               00778000
CVTRV249 EQU   CVTS01+431                                               00779000
CVTRV248 EQU   CVTS01+430                                               00780000
CVTRV247 EQU   CVTS01+429                                               00781000
CVTRV246 EQU   CVTS01+428                                               00782000
CVTRV245 EQU   CVTRV237                                                 00783000
CVTRV244 EQU   CVTRV237                                                 00784000
CVTRV243 EQU   CVTRV237                                                 00785000
CVTRV242 EQU   CVTRV237                                                 00786000
CVTRV241 EQU   CVTRV237                                                 00787000
CVTRV240 EQU   CVTRV237                                                 00788000
CVTRV239 EQU   CVTRV237                                                 00789000
CVTRV238 EQU   CVTRV237                                                 00790000
CVTRV236 EQU   CVTRV228                                                 00791000
CVTRV235 EQU   CVTRV228                                                 00792000
CVTRV234 EQU   CVTRV228                                                 00793000
CVTRV233 EQU   CVTRV228                                                 00794000
CVTRV232 EQU   CVTRV228                                                 00795000
CVTRV231 EQU   CVTRV228                                                 00796000
CVTRV230 EQU   CVTRV228                                                 00797000
CVTRV229 EQU   CVTRV228                                                 00798000
CVTRV227 EQU   CVTRV219                                                 00799000
CVTRV226 EQU   CVTRV219                                                 00800000
CVTRV225 EQU   CVTRV219                                                 00801000
CVTRV224 EQU   CVTRV219                                                 00802000
CVTRV223 EQU   CVTRV219                                                 00803000
CVTRV222 EQU   CVTRV219                                                 00804000
CVTRV221 EQU   CVTRV219                                                 00805000
CVTRV220 EQU   CVTRV219                                                 00806000
CVTRV218 EQU   CVTRV210                                                 00807000
CVTRV217 EQU   CVTRV210                                                 00808000
CVTRV216 EQU   CVTRV210                                                 00809000
CVTRV215 EQU   CVTRV210                                                 00810000
CVTRV214 EQU   CVTRV210                                                 00811000
CVTRV213 EQU   CVTRV210                                                 00812000
CVTRV212 EQU   CVTRV210                                                 00813000
CVTRV211 EQU   CVTRV210                                                 00814000
CVTLCCAT EQU   CVTS01+420                                               00815000
CVTPCCAT EQU   CVTS01+416                                               00816000
CVTIPCRP EQU   CVTS01+412                                               00817000
CVTIPCRI EQU   CVTS01+408                                               00818000
CVTIPCDS EQU   CVTS01+404                                               00819000
CVTAIDVT EQU   CVTS01+400                                               00820000
CVTSSAP  EQU   CVTS01+396                                               00821000
CVTEHCIR EQU   CVTS01+392                                               00822000
CVTEHDEF EQU   CVTS01+388                                               00823000
CVTDAIR  EQU   CVTS01+384                                               00824000
CVTPERFM EQU   CVTS01+380                                               00825000
CVT044R2 EQU   CVTS01+376                                               00826000
CVTFETCH EQU   CVTS01+372                                               00827000
CVTRSTWD EQU   CVTS01+368                                               00828000
CVTSPOST EQU   CVTS01+364                                               00829000
CVTIOBP  EQU   CVTS01+360                                               00830000
CVTASMVT EQU   CVTS01+356                                               00831000
CVTRECRQ EQU   CVTS01+352                                               00832000
CVTWSAC  EQU   CVTS01+348                                               00833000
CVTRV149 EQU   CVTS01+344                                               00834000
CVTWSAL  EQU   CVTS01+340                                               00835000
CVTSPSA  EQU   CVTS01+336                                               00836000
CVTGLMN  EQU   CVTS01+332                                               00837000
CVTVEAC0 EQU   CVTS01+328                                               00838000
CVT062R1 EQU   CVTS01+324                                               00839000
CVTRPOST EQU   CVTS01+320                                               00840000
CVTDQIQE EQU   CVTS01+316                                               00841000
CVTCSD   EQU   CVTS01+312                                               00842000
CVTLKRMA EQU   CVTS01+308                                               00843000
CVTRSPIE EQU   CVTS01+304                                               00844000
CVTRENQ  EQU   CVTS01+300                                               00845000
CVTLQCB  EQU   CVTS01+296                                               00846000
CVTFQCB  EQU   CVTS01+292                                               00847000
CVTQCS01 EQU   CVTS01+288                                               00848000
CVTAPFT  EQU   CVTS01+284                                               00849000
CVTPARRL EQU   CVTS01+280                                               00850000
CVTVWAIT EQU   CVTS01+276                                               00851000
CVTGSPL  EQU   CVTS01+272                                               00852000
CVTLSMQ  EQU   CVTS01+268                                               00853000
CVTGSMQ  EQU   CVTS01+264                                               00854000
CVTEXPRO EQU   CVTS01+260                                               00855000
CVTOPCTP EQU   CVTS01+256                                               00856000
CVTSIC   EQU   CVTS01+252                                               00857000
CVTTPIOS EQU   CVTS01+248                                               00858000
CVTRTMS  EQU   CVTS01+244                                               00859000
CVTSDBF  EQU   CVTS01+240                                               00860000
CVTSCBP  EQU   CVTS01+236                                               00861000
CVTSDMP  EQU   CVTS01+232                                               00862000
CVTSV60  EQU   CVTS01+228                                               00863000
CVTRTMCT EQU   CVTS01+224                                               00864000
CVTASCBL EQU   CVTS01+220                                               00865000
CVTASCBH EQU   CVTS01+216                                               00866000
CVTGDA   EQU   CVTS01+212                                               00867000
CVTASVT  EQU   CVTS01+208                                               00868000
CVTVVMDI EQU   CVTS01+204                                               00869000
CVTAQTOP EQU   CVTS01+200                                               00870000
CVTIOSCS EQU   CVTS01+196                                               00871000
CVTSDRM  EQU   CVTS01+192                                               00872000
CVTOPTE  EQU   CVTS01+188                                               00873000
CVTSTXU  EQU   CVTS01+184                                               00874000
CVTQUIS  EQU   CVTS01+180                                               00875000
CVTPARS  EQU   CVTS01+176                                               00876000
CVTS1EE  EQU   CVTS01+172                                               00877000
CVTFRAS  EQU   CVTS01+168                                               00878000
CVTQSAS  EQU   CVTS01+164                                               00879000
CVTCRAS  EQU   CVTS01+160                                               00880000
CVTCRMN  EQU   CVTS01+156                                               00881000
CVTDELCP EQU   CVTS01+152                                               00882000
CVTFRECL EQU   CVTS01+148                                               00883000
CVTGETCL EQU   CVTS01+144                                               00884000
CVTBLDCP EQU   CVTS01+140                                               00885000
CVTAUTHL EQU   CVTS01+136                                               00886000
CVTSCAN  EQU   CVTS01+132                                               00887000
CVTRV144 EQU   CVTS01+130                                               00888000
CVTMAXMP EQU   CVTS01+128                                               00889000
CVTSTCK  EQU   CVTS01+124                                               00890000
CVTRV139 EQU   CVTS01+123                                               00891000
CVTDSSAC EQU   CVTS01+122                                               00892000
CVTRV513 EQU   CVTS01+121                                               00893000
CVTIOSPL EQU   CVTS01+120                                               00894000
CVTPTGT  EQU   CVTS01+116                                               00895000
CVTCSPIE EQU   CVTS01+112                                               00896000
CVTSMFEX EQU   CVTS01+108                                               00897000
CVTOLT0A EQU   CVTS01+104                                               00898000
CVTSRBRT EQU   CVTS01+100                                               00899000
CVTPUTL  EQU   CVTS01+96                                                00900000
CVTASCRL EQU   CVTS01+92                                                00901000
CVTASCRF EQU   CVTS01+88                                                00902000
CVTRV326 EQU   CVTS01+84                                                00903000
CVTRV325 EQU   CVTS01+80                                                00904000
CVTRV324 EQU   CVTS01+76                                                00905000
CVT0VL01 EQU   CVTS01+72                                                00906000
CVTSHRVM EQU   CVTS01+68                                                00907000
CVTRV332 EQU   CVTS01+64                                                00908000
CVTTAS   EQU   CVTS01+60                                                00909000
CVTRSCN  EQU   CVTS01+56                                                00910000
CVTTRAC2 EQU   CVTS01+54                                                00911000
CVTTRACE EQU   CVTS01+52                                                00912000
CVTAPG   EQU   CVTS01+51                                                00913000
CVTSDTRC EQU   CVTCTLFG                                                 00914000
CVTGTRCE EQU   CVTCTLFG                                                 00915000
CVTNOMP  EQU   CVTCTLFG                                                 00916000
CVTRSV79 EQU   CVTCTLFG                                                 00917000
CVTDSTAT EQU   CVTCTLFG                                                 00918000
CVTRSV78 EQU   CVTCTLFG                                                 00919000
CVTRV333 EQU   CVTCTLFG                                                 00920000
CVTRV323 EQU   CVTCTLFG                                                 00921000
CVTSPVLK EQU   CVTS01+49                                                00922000
CVTRSV77 EQU   CVTS01+48                                                00923000
CVTRV331 EQU   CVTS01+44                                                00924000
CVTRV330 EQU   CVTS01+40                                                00925000
CVTRV329 EQU   CVTS01+36                                                00926000
CVTRV328 EQU   CVTS01+32                                                00927000
CVTRV322 EQU   CVTS01+28                                                00928000
CVTSLID  EQU   CVTSLIDA+1                                               00929000
CVTSYLK  EQU   CVTSLIDA                                                 00930000
CVTRV321 EQU   CVTS01+20                                                00931000
CVTRV320 EQU   CVTS01+16                                                00932000
CVTLPDIR EQU   CVTLPDIA+1                                               00933000
CVTRSV69 EQU   CVTDIRST                                                 00934000
CVTRSV68 EQU   CVTDIRST                                                 00935000
CVTRSV67 EQU   CVTDIRST                                                 00936000
CVTRSV66 EQU   CVTDIRST                                                 00937000
CVTRSV65 EQU   CVTDIRST                                                 00938000
CVTRSV64 EQU   CVTDIRST                                                 00939000
CVTRSV63 EQU   CVTDIRST                                                 00940000
CVTDICOM EQU   CVTDIRST                                                 00941000
CVTPVTP  EQU   CVTS01+8                                                 00942000
CVTLPDSR EQU   CVTS01+4                                                 00943000
CVTGETL  EQU   CVTS01                                                   00944000
ACBAPID  EQU   ACBCOMN+72                                               00945000
ACBCBMWA EQU   ACBCOMN+68                                               00946000
ACBUAPTR EQU   ACBCOMN+64                                               00947000
ACBLRECL EQU   ACBCOMN+62                                               00948000
ACBMSGLN EQU   ACBBLKSZ                                                 00949000
ACBBUFSP EQU   ACBCOMN+56                                               00950000
@NM00026 EQU   ACBUJFCB+1                                               00951000
ACBOPTN  EQU   ACBUJFCB                                                 00952000
ACBVVIC  EQU   ACBINFLG                                                 00953000
ACBUCRA  EQU   ACBINFLG                                                 00954000
ACBSCRA  EQU   ACBINFLG                                                 00955000
ACBCAT   EQU   ACBINFLG                                                 00956000
ACBIJRQE EQU   ACBINFLG                                                 00957000
ACBJEPS  EQU   ACBINFLG                                                 00958000
@NM00025 EQU   ACBINFLG                                                 00959000
ACBERFLG EQU   ACBCOMN+49                                               00960000
ACBBUSY  EQU   ACBIOSFG                                                 00961000
ACBLOCK  EQU   ACBEXFG                                                  00962000
@NM00024 EQU   ACBOFLGS                                                 00963000
ACBDSERR EQU   ACBOFLGS                                                 00964000
ACBEOV   EQU   ACBOFLGS                                                 00965000
@NM00023 EQU   ACBOFLGS                                                 00966000
ACBDEB   EQU   ACBDDNM+5                                                00967000
ACBERFL  EQU   ACBDDNM+4                                                00968000
ACBAM    EQU   ACBAMETH                                                 00969000
ACBINFL  EQU   ACBDDNM+2                                                00970000
ACBTIOT  EQU   ACBDDNM                                                  00971000
ACBUEL   EQU   ACBEXLST                                                 00972000
ACBPASSW EQU   ACBCOMN+32                                               00973000
ACBMSGAR EQU   ACBCOMN+28                                               00974000
@NM00022 EQU   ACBDSORG+1                                               00975000
ACBDORGA EQU   ACBDSORG+1                                               00976000
@NM00021 EQU   ACBDSORG                                                 00977000
ACBCRNRE EQU   ACBCROPS                                                 00978000
ACBCRNCK EQU   ACBCROPS                                                 00979000
ACBASA   EQU   ACBCCTYP                                                 00980000
@NM00020 EQU   ACBCCTYP                                                 00981000
ACBRECAF EQU   ACBRECFM                                                 00982000
ACBJBUF  EQU   ACBBUFPL+2                                               00983000
ACBMACR4 EQU   ACBBUFPL+1                                               00984000
@NM00019 EQU   ACBMACR3                                                 00985000
ACBNCFX  EQU   ACBMACR3                                                 00986000
ACBSIS   EQU   ACBMACR3                                                 00987000
ACBDFR   EQU   ACBMACR3                                                 00988000
ACBICI   EQU   ACBMACR3                                                 00989000
ACBGSR   EQU   ACBMACR3                                                 00990000
ACBLSR   EQU   ACBMACR3                                                 00991000
@NM00018 EQU   ACBMACR3                                                 00992000
ACBBUFNI EQU   ACBCOMN+18                                               00993000
ACBBUFND EQU   ACBCOMN+16                                               00994000
ACBSTRNO EQU   ACBCOMN+15                                               00995000
ACBBSTNO EQU   ACBCOMN+14                                               00996000
ACBAIX   EQU   ACBMACR2                                                 00997000
ACBDSN   EQU   ACBMACR2                                                 00998000
ACBRST   EQU   ACBMACR2                                                 00999000
ACBLOGON EQU   ACBMACR2                                                 01000000
ACBSKP   EQU   ACBMACR2                                                 01001000
@NM00017 EQU   ACBMACR2                                                 01002000
ACBUBF   EQU   ACBMACR1                                                 01003000
ACBOUT   EQU   ACBMACR1                                                 01004000
ACBIN    EQU   ACBMACR1                                                 01005000
ACBDIR   EQU   ACBMACR1                                                 01006000
ACBSEQ   EQU   ACBMACR1                                                 01007000
ACBBLK   EQU   ACBCNV                                                   01008000
ACBADD   EQU   ACBADR                                                   01009000
ACBKEY   EQU   ACBMACR1                                                 01010000
ACBINRTN EQU   ACBCOMN+8                                                01011000
ACBIBCT  EQU   ACBJWA                                                   01012000
ACBLEN2  EQU   ACBLENG2                                                 01013000
ACBSTYP  EQU   ACBCOMN+1                                                01014000
ACBID    EQU   ACBCOMN                                                  01015000
@NM00016 EQU   RVVI+64                                                  01016000
RVVSVOL  EQU   RVVSPEC                                                  01017000
RVVSDUP  EQU   RVVSPEC                                                  01018000
RVVSCPY  EQU   RVVSPEC                                                  01019000
RVVSCSN  EQU   RVVSPEC                                                  01020000
RVVSSEQ  EQU   RVVSPEC                                                  01021000
RVVSDTE  EQU   RVVSPEC                                                  01022000
RVVSEXP  EQU   RVVSPEC                                                  01023000
RVVSGRP  EQU   RVVSPEC                                                  01024000
@NM00015 EQU   RVVCPYTP                                                 01025000
RVVCPLHD EQU   RVVCPYTP                                                 01026000
RVVLCOPY EQU   RVVCPYTP                                                 01027000
RVVOBKUP EQU   RVVCPYTP                                                 01028000
RVVLBKUP EQU   RVVCPYTP                                                 01029000
RVVBPLHD EQU   RVVRTEST                                                 01030000
RVVDVOL  EQU   RVVRTEST                                                 01031000
RVVACTV  EQU   RVVRTEST                                                 01032000
RVVINACT EQU   RVVRTEST                                                 01033000
RVVRSTD  EQU   RVVRTEST                                                 01034000
RVVGSVOL EQU   RVVRTEST                                                 01035000
RVVTHOLD EQU   RVVRTEST                                                 01036000
RVVEXPDT EQU   RVVRTEST                                                 01037000
RVVALL   EQU   RVVRDRCD                                                 01038000
RVVCPURC EQU   RVVRDRCD                                                 01039000
RVVCIRCD EQU   RVVRDRCD                                                 01040000
RVVRUNKN EQU   RVVRDRCD                                                 01041000
RVVDUPRC EQU   RVVRDRCD                                                 01042000
RVVCPYRC EQU   RVVRDRCD                                                 01043000
RVVGRPRC EQU   RVVRDRCD                                                 01044000
RVVBVRCD EQU   RVVRDRCD                                                 01045000
@NM00014 EQU   RVVCHAIN                                                 01046000
RVVNGVOL EQU   RVVCHAIN                                                 01047000
RVVGPVOL EQU   RVVCHAIN                                                 01048000
@NM00013 EQU   RVVRMODE                                                 01049000
RVVRDCH  EQU   RVVRMODE                                                 01050000
RVVRDNR  EQU   RVVRMODE                                                 01051000
RVVRDR   EQU   RVVRMODE                                                 01052000
RVVDUPID EQU   RVVI+57                                                  01053000
RVVCPYID EQU   RVVI+56                                                  01054000
RVVRDCSN EQU   RVVI+44                                                  01055000
RVVRDSEQ EQU   RVVI+43                                                  01056000
RVVBLNK1 EQU   RVVI+42                                                  01057000
RVVCDATE EQU   RVVI+38                                                  01058000
RVVEXPIR EQU   RVVI+36                                                  01059000
RVVRTBUF EQU   RVVI+32                                                  01060000
RVVBUFLN EQU   RVVI+30                                                  01061000
@NM00012 EQU   RVVI+28                                                  01062000
RVVGROUP EQU   RVVI+14                                                  01063000
RVVOLUME EQU   RVVI+8                                                   01064000
@NM00011 EQU   RVVOPCOD+1                                               01065000
RVVCODE  EQU   RVVOPCOD                                                 01066000
RVVLNGTH EQU   RVVI                                                     01067000
RPLVULEN EQU   PARMLIST                                                 01068000
RPLVBLN  EQU   RPLVSAM+52                                               01069000
RPLVRLN  EQU   RPLVSAM+48                                               01070000
@NM00010 EQU   RPLVSAM+44                                               01071000
RPLVUPD  EQU   RPLVOPT+1                                                01072000
@NM00009 EQU   RPLVOPT                                                  01073000
RPLVKGE  EQU   RPLVOPT                                                  01074000
@NM00008 EQU   RPLVOPT                                                  01075000
RPLVNEXT EQU   RPLVOPT                                                  01076000
RPLVDIR  EQU   RPLVOPT                                                  01077000
RPLVLOC  EQU   RPLVOPT                                                  01078000
RPLVKEY  EQU   RPLVSAM+36                                               01079000
RPLVBUF  EQU   RPLVSAM+32                                               01080000
@NM00007 EQU   RPLVSAM+28                                               01081000
@NM00006 EQU   RPLVSAM+3                                                01082000
@NM00005 EQU   RPLVSAM                                                  01083000
@NM00004 EQU   RPLV+42                                                  01084000
RPLVRES1 EQU   RPLFLAGA+1                                               01085000
RPLVJRNL EQU   RPLFLAGA                                                 01086000
RPLJRCVY EQU   RPLFLAGA                                                 01087000
RPLVVOP  EQU   RPLFLAGA                                                 01088000
RPLVVIN  EQU   RPLFLAGA                                                 01089000
RPLFTIME EQU   RPLFLAGA                                                 01090000
VVIUNUSD EQU   VVICB+116                                                01091000
VVINUSDC EQU   VVICB+112                                                01092000
VVITPFCH EQU   VVICB+108                                                01093000
VVIDVMEL EQU   VVICB+104                                                01094000
VVIVBSTF EQU   VVICB+100                                                01095000
VVISSOBA EQU   VVICB+96                                                 01096000
VVIVSCRA EQU   VVICB+92                                                 01097000
VVISTPTB EQU   VVICB+88                                                 01098000
VVIDVMTA EQU   VVICB+84                                                 01099000
VVIRES6  EQU   VVICB+72                                                 01100000
VVIRES5  EQU   VVICB+68                                                 01101000
VVIRES4  EQU   VVICB+64                                                 01102000
VVIUCB   EQU   VVICB+60                                                 01103000
VVIVJL   EQU   VVICB+56                                                 01104000
VVIVRR   EQU   VVICB+52                                                 01105000
VVIQLSPL EQU   VVICB+48                                                 01106000
VVIVTRK  EQU   VVICB+37                                                 01107000
VVIVQMP  EQU   VVICB+32                                                 01108000
VVICATAD EQU   VVICB+24                                                 01109000
VVIDCBAD EQU   VVICB+20                                                 01110000
VVIFLG7  EQU   VVIFLGA                                                  01111000
VVIFLG6  EQU   VVIFLGA                                                  01112000
VVIFLG3  EQU   VVIFLGA                                                  01113000
VVIFLG2  EQU   VVIFLGA                                                  01114000
VVIFLG1  EQU   VVIFLGA                                                  01115000
VVIFLG0  EQU   VVIFLGA                                                  01116000
VVIALCON EQU   VVICB+14                                                 01117000
VVICPUID EQU   VVICB+12                                                 01118000
VVIUCAT  EQU   VVICB+4                                                  01119000
VVICID   EQU   VVICB                                                    01120000
ICBLORD  EQU   ICBTRACE+256                                             01121000
ICBOTRC  EQU   ICBTRACE                                                 01122000
ICBRESV  EQU   ICB2SSCB+128                                             01123000
ICBVOLST EQU   ICB2SSCB+124                                             01124000
ICBVSCRA EQU   ICB2SSCB+120                                             01125000
ICBSAMP  EQU   ICB2SSCB+118                                             01126000
ICBRESVD EQU   ICB2SSCB+117                                             01127000
ICBCPUID EQU   ICB2SSCB+112                                             01128000
ICBFAB   EQU   ICB2SSCB+108                                             01129000
ICBMSSC  EQU   ICB2SSCB+104                                             01130000
ICBRSVP  EQU   ICB2SSCB+100                                             01131000
ICBAEAP  EQU   ICB2SSCB+96                                              01132000
ICBSIOBP EQU   ICB2SSCB+92                                              01133000
ICBIATNA EQU   ICB2SSCB+88                                              01134000
ICBIPRGA EQU   ICB2SSCB+84                                              01135000
ICBSRBP  EQU   ICB2SSCB+80                                              01136000
ICBVVIC  EQU   ICB2SSCB+72                                              01137000
ICBSIOP  EQU   ICB2SSCB+68                                              01138000
ICBMEP   EQU   ICB2SSCB+64                                              01139000
ICBIORCI EQU   ICB2SSCB+60                                              01140000
ICB2ACTP EQU   ICB2SSCB+56                                              01141000
ICBFG3   EQU   ICBFLG+2                                                 01142000
ICBFG2   EQU   ICBFLG+1                                                 01143000
@NM00003 EQU   ICBFG1                                                   01144000
ICBMSCA  EQU   ICBFG1                                                   01145000
ICBMSCMP EQU   ICBFG1                                                   01146000
ICBS     EQU   ICBFG1                                                   01147000
ICBB     EQU   ICBFG1                                                   01148000
ICBV     EQU   ICBFG1                                                   01149000
ICBR     EQU   ICBFG1                                                   01150000
ICBI     EQU   ICBFG1                                                   01151000
ICBNVT   EQU   ICBOPT                                                   01152000
ICBVN02P EQU   ICB2SSCB+44                                              01153000
ICBTCB   EQU   ICB2SSCB+40                                              01154000
ICBQHEAD EQU   ICB2SSCB+36                                              01155000
ICBAUCB  EQU   ICB2SSCB+32                                              01156000
ICBPUCB  EQU   ICB2SSCB+28                                              01157000
ICBCOMQ  EQU   ICB2SSCB+24                                              01158000
ICBIOR   EQU   ICB2SSCB+20                                              01159000
ICBCOM   EQU   ICB2SSCB+16                                              01160000
ICBACTV  EQU   ICB2SSCB+12                                              01161000
ICBECB   EQU   ICB2SSCB+8                                               01162000
ICBSSNAM EQU   ICB2SSCB                                                 01163000
CVTLEVL  EQU   CVTRELNO+2                                               01164000
CVTNUMB  EQU   CVTRELNO                                                 01165000
CVTMDL   EQU   CVTFIX+250                                               01166000
@NM00002 EQU   CVTFIX+248                                               01167000
@NM00001 EQU   CVTFIX                                                   01168000
CVTRV482 EQU   CVTXTNT2+128                                             01169000
CVTRV481 EQU   CVTXTNT2+124                                             01170000
CVTRV480 EQU   CVTXTNT2+120                                             01171000
CVTRV479 EQU   CVTXTNT2+118                                             01172000
CVTRV478 EQU   CVTXTNT2+117                                             01173000
CVTRV477 EQU   CVTXTNT2+116                                             01174000
CVTRV476 EQU   CVTXTNT2+115                                             01175000
CVTRV475 EQU   CVTXTNT2+114                                             01176000
CVTRV474 EQU   CVTRV466                                                 01177000
CVTRV473 EQU   CVTRV466                                                 01178000
CVTRV472 EQU   CVTRV466                                                 01179000
CVTRV471 EQU   CVTRV466                                                 01180000
CVTRV470 EQU   CVTRV466                                                 01181000
CVTRV469 EQU   CVTRV466                                                 01182000
CVTRV468 EQU   CVTRV466                                                 01183000
CVTRV467 EQU   CVTRV466                                                 01184000
CVTRV465 EQU   CVTRV457                                                 01185000
CVTRV464 EQU   CVTRV457                                                 01186000
CVTRV463 EQU   CVTRV457                                                 01187000
CVTRV462 EQU   CVTRV457                                                 01188000
CVTRV461 EQU   CVTRV457                                                 01189000
CVTRV460 EQU   CVTRV457                                                 01190000
CVTRV459 EQU   CVTRV457                                                 01191000
CVTRV458 EQU   CVTRV457                                                 01192000
CVTRV456 EQU   CVTXTNT2+108                                             01193000
CVTRV455 EQU   CVTXTNT2+104                                             01194000
CVTRV454 EQU   CVTXTNT2+100                                             01195000
CVTRV453 EQU   CVTXTNT2+96                                              01196000
CVTRV452 EQU   CVTXTNT2+94                                              01197000
CVTRV451 EQU   CVTXTNT2+92                                              01198000
CVTRV450 EQU   CVTXTNT2+90                                              01199000
CVTRV449 EQU   CVTXTNT2+88                                              01200000
CVTRV448 EQU   CVTXTNT2+87                                              01201000
CVTRV447 EQU   CVTXTNT2+86                                              01202000
CVTRV446 EQU   CVTRV438                                                 01203000
CVTRV445 EQU   CVTRV438                                                 01204000
CVTRV444 EQU   CVTRV438                                                 01205000
CVTRV443 EQU   CVTRV438                                                 01206000
CVTRV442 EQU   CVTRV438                                                 01207000
CVTRV441 EQU   CVTRV438                                                 01208000
CVTRV440 EQU   CVTRV438                                                 01209000
CVTRV439 EQU   CVTRV438                                                 01210000
CVTRV437 EQU   CVTRV429                                                 01211000
CVTRV436 EQU   CVTRV429                                                 01212000
CVTRV435 EQU   CVTRV429                                                 01213000
CVTRV434 EQU   CVTRV429                                                 01214000
CVTRV433 EQU   CVTRV429                                                 01215000
CVTRV432 EQU   CVTRV429                                                 01216000
CVTRV431 EQU   CVTRV429                                                 01217000
CVTRV430 EQU   CVTRV429                                                 01218000
CVTRV428 EQU   CVTXTNT2+80                                              01219000
CVTRV427 EQU   CVTXTNT2+76                                              01220000
CVTRV426 EQU   CVTXTNT2+72                                              01221000
CVTRV425 EQU   CVTXTNT2+68                                              01222000
CVTATACT EQU   CVTATCVT                                                 01223000
CVTRV423 EQU   CVTXTNT2+62                                              01224000
CVTRV422 EQU   CVTXTNT2+60                                              01225000
CVTRV421 EQU   CVTXTNT2+58                                              01226000
CVTRV420 EQU   CVTXTNT2+56                                              01227000
CVTRV419 EQU   CVTXTNT2+55                                              01228000
CVTRV418 EQU   CVTXTNT2+54                                              01229000
CVTRV417 EQU   CVTRV409                                                 01230000
CVTRV416 EQU   CVTRV409                                                 01231000
CVTRV415 EQU   CVTRV409                                                 01232000
CVTRV414 EQU   CVTRV409                                                 01233000
CVTRV413 EQU   CVTRV409                                                 01234000
CVTRV412 EQU   CVTRV409                                                 01235000
CVTRV411 EQU   CVTRV409                                                 01236000
CVTRV410 EQU   CVTRV409                                                 01237000
CVTRV408 EQU   CVTRV400                                                 01238000
CVTRV407 EQU   CVTRV400                                                 01239000
CVTRV406 EQU   CVTRV400                                                 01240000
CVTRV405 EQU   CVTRV400                                                 01241000
CVTRV404 EQU   CVTRV400                                                 01242000
CVTRV403 EQU   CVTRV400                                                 01243000
CVTRV402 EQU   CVTRV400                                                 01244000
CVTRV401 EQU   CVTRV400                                                 01245000
CVTSKTA  EQU   CVTXTNT2+44                                              01246000
CVTRSV99 EQU   CVTXTNT2+40                                              01247000
CVTRSV98 EQU   CVTXTNT2+36                                              01248000
CVTRSV97 EQU   CVTXTNT2+34                                              01249000
CVTRSV96 EQU   CVTXTNT2+32                                              01250000
CVTOLTEP EQU   CVTXTNT2+28                                              01251000
CVTQIDA  EQU   CVTQID+1                                                 01252000
CVTRSV95 EQU   CVTQID                                                   01253000
CVTRSV94 EQU   CVTXTNT2+20                                              01254000
CVTRSV93 EQU   CVTXTNT2+16                                              01255000
CVTRSV92 EQU   CVTXTNT2+12                                              01256000
CVTDEBVR EQU   CVTXTNT2+8                                               01257000
CVTRSV91 EQU   CVTXTNT2+6                                               01258000
CVTRSV9H EQU   CVTFLGBT                                                 01259000
CVTRSV9G EQU   CVTFLGBT                                                 01260000
CVTRSV9F EQU   CVTFLGBT                                                 01261000
CVTRSV9E EQU   CVTFLGBT                                                 01262000
CVTRSV9D EQU   CVTFLGBT                                                 01263000
CVTRSV9C EQU   CVTFLGBT                                                 01264000
CVTVME   EQU   CVTFLGBT                                                 01265000
CVTNPE   EQU   CVTFLGBT                                                 01266000
CVTNUCLS EQU   CVTXTNT2+4                                               01267000
CVTDSSVA EQU   CVTDSSV+1                                                01268000
CVTRSV89 EQU   CVTDSSV                                                  01269000
CVTRSV88 EQU   CVTXTNT1+8                                               01270000
CVTRSV87 EQU   CVTXTNT1+4                                               01271000
CVTFACHN EQU   CVTXTNT1                                                 01272000
CVTRV488 EQU   CVTMAP+412                                               01273000
CVTRV487 EQU   CVTMAP+408                                               01274000
CVTRV486 EQU   CVTMAP+404                                               01275000
CVTRV485 EQU   CVTMAP+400                                               01276000
CVTACTAP EQU   CVTMAP+396                                               01277000
CVTAUTH  EQU   CVTMAP+392                                               01278000
CVTATMCA EQU   CVTATMCT+1                                               01279000
CVTATMST EQU   CVTATMCT                                                 01280000
CVTRSV61 EQU   CVTMAP+384                                               01281000
CVTVOLT1 EQU   CVTVOLM1+1                                               01282000
CVTVOLI1 EQU   CVTVOLF1                                                 01283000
CVTSTOA  EQU   CVTMAP+376                                               01284000
CVTRSV58 EQU   CVTMAP+374                                               01285000
CVTRSV57 EQU   CVTMAP+372                                               01286000
CVTDDCE  EQU   CVTMAP+368                                               01287000
CVTPNWFR EQU   CVTMAP+364                                               01288000
CVTSMF   EQU   CVTMAP+360                                               01289000
CVTSULK  EQU   CVTMAP+358                                               01290000
CVTSLKO  EQU   CVTSYSK                                                  01291000
CVTSLKP  EQU   CVTSYSK                                                  01292000
CVTSLKQ  EQU   CVTSYSK                                                  01293000
CVTSLKR  EQU   CVTSYSK                                                  01294000
CVTRSV56 EQU   CVTSYSK                                                  01295000
CVTRSV55 EQU   CVTSYSK                                                  01296000
CVTRSV54 EQU   CVTSYSK                                                  01297000
CVTRSV53 EQU   CVTSYSK                                                  01298000
CVTRSV52 EQU   CVTA1F1                                                  01299000
CVTRSV51 EQU   CVTA1F1                                                  01300000
CVTRSV50 EQU   CVTA1F1                                                  01301000
CVTRSV49 EQU   CVTA1F1                                                  01302000
CVTRSV48 EQU   CVTA1F1                                                  01303000
CVTRSV47 EQU   CVTA1F1                                                  01304000
CVTSRSW  EQU   CVTA1F1                                                  01305000
CVTPFSW  EQU   CVTA1F1                                                  01306000
CVTPCVT  EQU   CVTMAP+352                                               01307000
CVTRSV46 EQU   CVTMAP+344                                               01308000
CVTRSV45 EQU   CVTMAP+340                                               01309000
CVTRSV44 EQU   CVTMAP+338                                               01310000
CVTRSV43 EQU   CVTMAP+336                                               01311000
CVTHJESA EQU   CVTHJES+1                                                01312000
CVTRSV42 EQU   CVTHJES                                                  01313000
CVTEXT2A EQU   CVTEXT2+1                                                01314000
CVTRSV41 EQU   CVTEXT2                                                  01315000
CVTAPFA  EQU   CVTAPF+1                                                 01316000
CVTRSV40 EQU   CVTAPF                                                   01317000
CVTRV518 EQU   CVTINTLA                                                 01318000
CVTRV517 EQU   CVTERPV                                                  01319000
CVTEORM  EQU   CVTMAP+312                                               01320000
CVTMCHPR EQU   CVTMAP+308                                               01321000
CVTTZ    EQU   CVTMAP+304                                               01322000
CVTJEPS  EQU   CVTMAP+300                                               01323000
CVTJESCT EQU   CVTMAP+296                                               01324000
CVTMODE  EQU   CVTMAP+292                                               01325000
CVTPTRV  EQU   CVTMAP+288                                               01326000
CVTREAL  EQU   CVTMAP+284                                               01327000
CVTRSV39 EQU   CVTMAP+280                                               01328000
CVTRSV38 EQU   CVTMAP+276                                               01329000
CVTDMSRA EQU   CVTDMSR+1                                                01330000
CVTRV634 EQU   CVTDMSRF                                                 01331000
CVTRV633 EQU   CVTDMSRF                                                 01332000
CVTRV632 EQU   CVTDMSRF                                                 01333000
CVTRV631 EQU   CVTDMSRF                                                 01334000
CVTRV630 EQU   CVTDMSRF                                                 01335000
CVTRV629 EQU   CVTDMSRF                                                 01336000
CVTUDUMP EQU   CVTDMSRF                                                 01337000
CVTSDUMP EQU   CVTDMSRF                                                 01338000
CVTQMSGA EQU   CVTQMSG+1                                                01339000
CVTRSV36 EQU   CVTQMSG                                                  01340000
CVTAMFF  EQU   CVTMAP+264                                               01341000
CVTPURGA EQU   CVTPURG+1                                                01342000
CVTRSV35 EQU   CVTPURG                                                  01343000
CVTCBSP  EQU   CVTMAP+256                                               01344000
CVTATERA EQU   CVTATER+1                                                01345000
CVTSYST  EQU   CVTATER                                                  01346000
CVTVOLT2 EQU   CVTTAT                                                   01347000
CVTVOLI2 EQU   CVTVOLF2                                                 01348000
CVTAQAVB EQU   CVTAQAVT+1                                               01349000
CVTRSV34 EQU   CVTTCMFG                                                 01350000
CVTRSV33 EQU   CVTTCMFG                                                 01351000
CVTRSV32 EQU   CVTTCMFG                                                 01352000
CVTRSV31 EQU   CVTTCMFG                                                 01353000
CVTRSV30 EQU   CVTTCMFG                                                 01354000
CVTRSV29 EQU   CVTTCMFG                                                 01355000
CVTRSV28 EQU   CVTTCMFG                                                 01356000
CVTTCRDY EQU   CVTTCMFG                                                 01357000
CVTGTFA  EQU   CVTGTF+1                                                 01358000
CVTRSV27 EQU   CVTGTFST                                                 01359000
CVTRNIO  EQU   CVTGTFST                                                 01360000
CVTUSR   EQU   CVTGTFST                                                 01361000
CVTRV318 EQU   CVTFORM                                                  01362000
CVTRV317 EQU   CVTTMODE                                                 01363000
CVTRV316 EQU   CVTSTATE                                                 01364000
CVTRV315 EQU   CVTGTFS                                                  01365000
CVTGTFAV EQU   CVTGTFS                                                  01366000
CVT0SCR1 EQU   CVTMAP+232                                               01367000
CVTRV515 EQU   CVTMAP+228                                               01368000
CVTRMS   EQU   CVTMAP+224                                               01369000
CVTPATCH EQU   CVTMAP+220                                               01370000
CVTTSCE  EQU   CVTMAP+216                                               01371000
CVTLNKSC EQU   CVTMAP+214                                               01372000
CVTQABST EQU   CVTMAP+212                                               01373000
CVTMDLDS EQU   CVTMAP+208                                               01374000
CVTUSER  EQU   CVTMAP+204                                               01375000
CVTABEND EQU   CVTMAP+200                                               01376000
CVTSMCA  EQU   CVTMAP+196                                               01377000
CVTRSV18 EQU   CVTMAP+192                                               01378000
CVTQLPAQ EQU   CVTMAP+188                                               01379000
CVTQCDSR EQU   CVTMAP+184                                               01380000
CVTRSV17 EQU   CVTOPTB                                                  01381000
CVTRSV16 EQU   CVTOPTB                                                  01382000
CVTFP    EQU   CVTOPTB                                                  01383000
CVTAPTHR EQU   CVTOPTB                                                  01384000
CVTNLOG  EQU   CVTOPTB                                                  01385000
CVTTOD   EQU   CVTOPTB                                                  01386000
CVTCTIMS EQU   CVTOPTB                                                  01387000
CVTPROT  EQU   CVTOPTB                                                  01388000
CVTXPFP  EQU   CVTOPTA                                                  01389000
CVTASCII EQU   CVTOPTA                                                  01390000
CVTRSV13 EQU   CVTOPTA                                                  01391000
CVTRSV12 EQU   CVTOPTA                                                  01392000
CVTNIP   EQU   CVTOPTA                                                  01393000
CVTDDR   EQU   CVTOPTA                                                  01394000
CVTAPR   EQU   CVTOPTA                                                  01395000
CVTCCH   EQU   CVTOPTA                                                  01396000
CVTSNCTR EQU   CVTMAP+180                                               01397000
CVTQMWR  EQU   CVTMAP+176                                               01398000
CVTQOCR  EQU   CVTMAP+172                                               01399000
CVT1EF00 EQU   CVTMAP+168                                               01400000
CVTMZ00  EQU   CVTMAP+164                                               01401000
CVTSV76Q EQU   CVTSV76C                                                 01402000
CVTRSV11 EQU   CVTMAP+156                                               01403000
CVT0PT01 EQU   CVTMAP+152                                               01404000
CVTMSER  EQU   CVTMAP+148                                               01405000
CVTRV516 EQU   CVTIERLC                                                 01406000
CVTILCH  EQU   CVTMAP+140                                               01407000
CVT0DS   EQU   CVTMAP+136                                               01408000
CVTFBOSV EQU   CVTMAP+132                                               01409000
CVTNUCB  EQU   CVTMAP+128                                               01410000
CVTIXAVL EQU   CVTMAP+124                                               01411000
CVTSV76M EQU   CVTIOQET                                                 01412000
CVTDCBA  EQU   CVTMAP+117                                               01413000
CVTMVS2  EQU   CVTDCB                                                   01414000
CVT6DAT  EQU   CVTDCB                                                   01415000
CVT4MPS  EQU   CVTDCB                                                   01416000
CVTRSV09 EQU   CVTDCB                                                   01417000
CVT4MS1  EQU   CVTDCB                                                   01418000
CVT2SPS  EQU   CVTDCB                                                   01419000
CVT1SSS  EQU   CVTDCB                                                   01420000
CVTRSV08 EQU   CVTDCB                                                   01421000
CVTSTB   EQU   CVTMAP+112                                               01422000
CVTQTD00 EQU   CVTMAP+108                                               01423000
CVTQTE00 EQU   CVTMAP+104                                               01424000
CVTCUCB  EQU   CVTMAP+100                                               01425000
CVTSJQ   EQU   CVTMAP+96                                                01426000
CVTPBLDL EQU   CVTMAP+92                                                01427000
CVTTPC   EQU   CVTMAP+88                                                01428000
CVTSVDCB EQU   CVTMAP+84                                                01429000
CVTEXIT  EQU   CVTMAP+80                                                01430000
CVT0FN00 EQU   CVTMAP+76                                                01431000
CVTDARA  EQU   CVTDAR+1                                                 01432000
CVTRSV07 EQU   CVTFLGS1                                                 01433000
CVTRSV06 EQU   CVTFLGS1                                                 01434000
CVTRSV05 EQU   CVTFLGS1                                                 01435000
CVTRSV04 EQU   CVTFLGS1                                                 01436000
CVTRSV03 EQU   CVTFLGS1                                                 01437000
CVTRSV02 EQU   CVTFLGS1                                                 01438000
CVTRSV01 EQU   CVTFLGS1                                                 01439000
CVTDMPLK EQU   CVTFLGS1                                                 01440000
CVTXITP  EQU   CVTMAP+68                                                01441000
CVTZDTAB EQU   CVTMAP+64                                                01442000
CVTMSLT  EQU   CVTMAP+60                                                01443000
CVTBTERM EQU   CVTMAP+52                                                01444000
CVTSYSAD EQU   CVTMAP+48                                                01445000
CVTXTLER EQU   CVTMAP+44                                                01446000
CVTILK2  EQU   CVTMAP+40                                                01447000
CVTILK1  EQU   CVTMAP+36                                                01448000
CVTPRLTV EQU   CVTMAP+32                                                01449000
CVTPCNVT EQU   CVTMAP+28                                                01450000
CVT0VL00 EQU   CVTMAP+24                                                01451000
CVTXAPG  EQU   CVTMAP+20                                                01452000
CVTBUF   EQU   CVTMAP+16                                                01453000
CVTJOB   EQU   CVTMAP+12                                                01454000
CVTLINK  EQU   CVTMAP+8                                                 01455000
CVT0EF00 EQU   CVTMAP+4                                                 01456000
CVTTCBP  EQU   CVTMAP                                                   01457000
CVT      EQU   CVTMAP                                                   01458000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01459000
@RF00112 EQU   @RC00098                                                 01460000
@ENDDATA EQU   *                                                        01461000
         END   ICBVCR00,(C'PLS1750',0701,77355)                         01462000
