         TITLE 'IOEDKMSG - VS2 3540 MESSAGE MODULE                     *00001000
                        '                                               00002000
IOEDKMSG CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IOEDKMSG  74.297'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
         ST    @13,@SA00001+4                                      0001 00014000
         LA    @14,@SA00001                                        0001 00015000
         ST    @14,8(,@13)                                         0001 00016000
         LR    @13,@14                                             0001 00017000
*   PARMLPTR = R1;                 /* SAVE PTR TO PARMLIST   @Y30OE62*/ 00018000
         LR    PARMLPTR,R1                                         0072 00019000
*   MSGPTR = MSGLPTR(MSGNDEX);     /* POINT TO MESSAGE       @Y30OE62*/ 00020000
         SLR   @15,@15                                             0073 00021000
         IC    @15,MSGNDEX(,PARMLPTR)                              0073 00022000
         SLA   @15,2                                               0073 00023000
         L     MSGPTR,MSGLPTR-4(@15)                               0073 00024000
*   IF MCODE = WTOR THEN           /* IS IT A WTOR ?         @Y30OE62*/ 00025000
         CLI   MCODE(PARMLPTR),2                                   0074 00026000
         BNE   @RF00074                                            0074 00027000
*     DO;                          /* YES,                   @Y30OE62*/ 00028000
*       TXTNDEX = 12;              /* INDEX TO TEXT          @Y30OE62*/ 00029000
         LA    TXTNDEX,12                                          0076 00030000
*       MLNDEX = 8;                /* INDEX TO MSG LENGTH    @Y30OE62*/ 00031000
         LA    MLNDEX,8                                            0077 00032000
*     END;                                                 /*@Y30OE62*/ 00033000
*   ELSE                           /* NOT A WTOR             @Y30OE62*/ 00034000
*     DO;                                                  /*@Y30OE62*/ 00035000
         B     @RC00074                                            0079 00036000
@RF00074 DS    0H                                                  0080 00037000
*       IF MCODE = WRITECHK THEN   /* IS IT A WRITE ?        @Y30OE62*/ 00038000
         CLI   MCODE(PARMLPTR),3                                   0080 00039000
         BNE   @RF00080                                            0080 00040000
*          TXTNDEX = 8;            /* INDEX TO TEXT          @Y30OE62*/ 00041000
         LA    TXTNDEX,8                                           0081 00042000
*       ELSE                       /* IT'S A WTO             @Y30OE62*/ 00043000
*         TXTNDEX = 4;             /* INDEX TO TEXT          @Y30OE62*/ 00044000
         B     @RC00080                                            0082 00045000
@RF00080 LA    TXTNDEX,4                                           0082 00046000
*       MLNDEX = 0;                /* INDEX TO MSG LENGTH    @Y30OE62*/ 00047000
@RC00080 SLR   MLNDEX,MLNDEX                                       0083 00048000
*     END;                                                 /*@Y30OE62*/ 00049000
*   MSGLNPTR = MSGPTR+MLNDEX;      /* POINT TO MSG LENGTH    @Y30OE62*/ 00050000
@RC00074 LR    MSGLNPTR,MSGPTR                                     0085 00051000
         ALR   MSGLNPTR,MLNDEX                                     0085 00052000
*   MSGBUFF(1:MLEN+TXTNDEX)=MESSAGE;                       /*@Y30OE62*/ 00053000
         LR    @11,TXTNDEX                                         0086 00054000
         AH    @11,MLEN(,MSGLNPTR)                                 0086 00055000
         BCTR  @11,0                                               0086 00056000
         EX    @11,@SM00685                                        0086 00057000
*                                  /* MOVE MESSAGE, FROM     @Y30OE62*/ 00058000
*                                  /* START TO LAST BYTE     @Y30OE62*/ 00059000
*                                  /* OF TEXT, TO BUFFER     @Y30OE62*/ 00060000
*   TXTNPTR = PARMLPTR+12;         /* POINT TO FIRST         @Y30OE62*/ 00061000
         LA    TXTNPTR,12                                          0087 00062000
         ALR   TXTNPTR,PARMLPTR                                    0087 00063000
*                                  /* TEXT ENTRY             @Y30OE62*/ 00064000
*   BFMLPTR = ADDR(MSGBUFF)+MLNDEX;                        /*@Y30OE62*/ 00065000
         LA    BFMLPTR,MSGBUFF                                     0088 00066000
         ALR   BFMLPTR,MLNDEX                                      0088 00067000
*                                  /* POINT TO MSG LENGTH    @Y30OE62*/ 00068000
*                                  /* FIELD IN BUFFER        @Y30OE62*/ 00069000
*   DO WHILE (KEYCHK^= ENDLIST);   /* PROCESS UNTIL END      @Y30OE62*/ 00070000
         B     @DE00089                                            0089 00071000
@DL00089 DS    0H                                                  0090 00072000
*                                  /* PARMLIST INDICATED     @Y30OE62*/ 00073000
*     MTXTPTR = ADDR(MSGBUFF)+TXTNDEX;                     /*@Y30OE62*/ 00074000
         LA    MTXTPTR,MSGBUFF                                     0090 00075000
         ALR   MTXTPTR,TXTNDEX                                     0090 00076000
*                                  /* POINT TO FIRST BYTE    @Y30OE62*/ 00077000
*                                  /* OF MSG TEXT            @Y30OE62*/ 00078000
*     IF KEYCHK ^=SKIPNTRY THEN    /* PROCESS THIS ENTRY?    @Y30OE62*/ 00079000
         CLI   KEYCHK(TXTNPTR),X'00'                               0091 00080000
         BE    @RF00091                                            0091 00081000
*       DO;                        /* YES,                   @Y30OE62*/ 00082000
*         IF LOPBIT = ON THEN      /* HI-ORDER BIT ON?       @Y30OE62*/ 00083000
         TM    LOPBIT(TXTNPTR),B'10000000'                         0093 00084000
         BNO   @RF00093                                            0093 00085000
*           LOPFLAG = ON;          /* TURN ON LOPFLAG        @Y30OE62*/ 00086000
         OI    LOPFLAG,B'10000000'                                 0094 00087000
*         ELSE                     /* IF OFF,                @Z30OE78*/ 00088000
*           LOPFLAG=OFF;           /* TURN OFF LOPFLAG       @Z30OE78*/ 00089000
         B     @RC00093                                            0095 00090000
@RF00093 NI    LOPFLAG,B'01111111'                                 0095 00091000
*         WRKKEY = KEYCHK;         /* MOVE KEY TO WORK AREA  @Y30OE62*/ 00092000
@RC00093 MVC   WRKKEY(1),KEYCHK(TXTNPTR)                           0096 00093000
*         WRKKEY1 = OFF;           /* TURN OFF HI-ORDER BIT  @Y30OE62*/ 00094000
         NI    WRKKEY1,B'01111111'                                 0097 00095000
*         DO MTXTPTR=ADDR(MSGBUFF)+TXTNDEX TO/* SCAN TEXT    @Z30OE78*/ 00096000
*             ADDR(MSGBUFF)+TXTNDEX+MLEN-4/* TO FIND KEY     @Z30OE78*/ 00097000
*             WHILE TXTBYTE^=WRKKEY;                       /*@Z30OE78*/ 00098000
         LA    MTXTPTR,MSGBUFF                                     0098 00099000
         ALR   MTXTPTR,TXTNDEX                                     0098 00100000
         B     @DE00098                                            0098 00101000
@DL00098 CLC   TXTBYTE(1,MTXTPTR),WRKKEY                           0098 00102000
         BE    @DC00098                                            0098 00103000
*         END;                                             /*@Z30OE78*/ 00104000
         AH    MTXTPTR,@CH00041                                    0099 00105000
@DE00098 LA    @11,MSGBUFF                                         0099 00106000
         ALR   @11,TXTNDEX                                         0099 00107000
         AH    @11,MLEN(,MSGLNPTR)                                 0099 00108000
         SH    @11,@CH00143                                        0099 00109000
         CR    MTXTPTR,@11                                         0099 00110000
         BNH   @DL00098                                            0099 00111000
@DC00098 DS    0H                                                  0100 00112000
*         IF TXTBYTE=WRKKEY THEN    /* IF KEY FOUND,         @Z30OE78*/ 00113000
         CLC   TXTBYTE(1,MTXTPTR),WRKKEY                           0100 00114000
         BNE   @RF00100                                            0100 00115000
*                                   /* PROCESS IT, ELSE      @Z30OE78*/ 00116000
*                                   /* IGNORE TEXT           @Z30OE78*/ 00117000
*         IF LOPFLAG = OFF THEN    /* IF LOPFLAG IS OFF,     @Y30OE62*/ 00118000
         TM    LOPFLAG,B'10000000'                                 0101 00119000
         BNZ   @RF00101                                            0101 00120000
*           MSGTEXT(1:NTRYLN-2) = TEXT(1:NTRYLN-2);        /*@Y30OE62*/ 00121000
         SLR   @11,@11                                             0102 00122000
         IC    @11,NTRYLN(,TXTNPTR)                                0102 00123000
         SH    @11,@CH00045                                        0102 00124000
         EX    @11,@SM00689                                        0102 00125000
*                                  /* MOVE TEXT TO MSG       @Y30OE62*/ 00126000
*         ELSE                     /* IF LOPFLAG IS ON,      @Y30OE62*/ 00127000
*           DO;                                            /*@Y30OE62*/ 00128000
         B     @RC00101                                            0103 00129000
@RF00101 DS    0H                                                  0104 00130000
*             DO WHILE (TXTBYTE^=COMMA);                   /*@Y30OE62*/ 00131000
         B     @DE00104                                            0104 00132000
@DL00104 DS    0H                                                  0105 00133000
*                                  /* LOOP TIL FIND COMMA    @Y30OE62*/ 00134000
*               MTXTPTR = MTXTPTR-1;                       /*@Y30OE62*/ 00135000
         BCTR  MTXTPTR,0                                           0105 00136000
*                                  /* MOVE BACK ONE BYTE     @Y30OE62*/ 00137000
*             END;                                         /*@Y30OE62*/ 00138000
@DE00104 CLI   TXTBYTE(MTXTPTR),C','                               0106 00139000
         BNE   @DL00104                                            0106 00140000
*             MSGLEN = MTXTPTR-ADDR(MSGBUFF)-MLNDEX;       /*@Y30OE62*/ 00141000
         LA    @11,MSGBUFF                                         0107 00142000
         LCR   @11,@11                                             0107 00143000
         ALR   @11,MTXTPTR                                         0107 00144000
         SLR   @11,MLNDEX                                          0107 00145000
         STH   @11,MSGLEN(,BFMLPTR)                                0107 00146000
*                                  /* ADJUST MSG LENGTH      @Y30OE62*/ 00147000
*             MSGBUFF(MSGLEN+1+MLNDEX:MLEN+MLNDEX)=BLANKS; /*@Y30OE62*/ 00148000
         AH    @11,@CH00041                                        0108 00149000
         ALR   @11,MLNDEX                                          0108 00150000
         LA    @15,MSGBUFF-1(@11)                                  0108 00151000
         LR    @14,MLNDEX                                          0108 00152000
         AH    @14,MLEN(,MSGLNPTR)                                 0108 00153000
         SLR   @14,@11                                             0108 00154000
         EX    @14,@SM00691                                        0108 00155000
*                                  /* BLANK REST OF MSG,     @Y30OE62*/ 00156000
*                                  /* STARTING WITH COMMA    @Y30OE62*/ 00157000
*           END;                                           /*@Y30OE62*/ 00158000
*         END;                                             /*@Y30OE62*/ 00159000
@RC00101 DS    0H                                                  0110 00160000
@RF00100 DS    0H                                                  0111 00161000
*     TXTNPTR = TXTNPTR+NTRYLN;    /* POINT TO NEXT ENTRY    @Y30OE62*/ 00162000
@RF00091 MVC   @ZT00003+3(1),NTRYLN(TXTNPTR)                       0111 00163000
         AL    TXTNPTR,@ZT00003                                    0111 00164000
*   END;                                                   /*@Y30OE62*/ 00165000
@DE00089 CLI   KEYCHK(TXTNPTR),X'7F'                               0112 00166000
         BNE   @DL00089                                            0112 00167000
*   IF MCODE^=WRITECHK THEN        /* IF WTO OR WTOR, MOVE   @Y30OE62*/ 00168000
         CLI   MCODE(PARMLPTR),3                                   0113 00169000
         BE    @RF00113                                            0113 00170000
*     DO;                          /* ROUT & DESC CODES      @Y30OE62*/ 00171000
*       RDPTR = MSGLNPTR + MLEN;   /* POINT TO ROUT &        @Y30OE62*/ 00172000
         LR    RDPTR,MSGLNPTR                                      0115 00173000
         AH    RDPTR,MLEN(,MSGLNPTR)                               0115 00174000
*                                  /* DESC CODES             @Y30OE62*/ 00175000
*       BFRDPTR = BFMLPTR+MSGLEN;  /* ROUT & DESC CODES      @Y30OE62*/ 00176000
         LR    BFRDPTR,BFMLPTR                                     0116 00177000
         AH    BFRDPTR,MSGLEN(,BFMLPTR)                            0116 00178000
*                                  /* FIELD IN BUFFER        @Y30OE62*/ 00179000
*       BFRTDSC = ROUTDESC;        /* MOVE TO BUFFER         @Y30OE62*/ 00180000
         MVC   BFRTDSC(4,BFRDPTR),ROUTDESC(RDPTR)                  0117 00181000
*     END;                                                 /*@Y30OE62*/ 00182000
*   R1 = ADDR(MSGBUFF);            /* POINT TO BUFFER        @Y30OE62*/ 00183000
@RF00113 LA    R1,MSGBUFF                                          0119 00184000
*   IF MCODE = WTOR THEN           /* IF WTOR,               @Y30OE62*/ 00185000
         CLI   MCODE(PARMLPTR),2                                   0120 00186000
         BNE   @RF00120                                            0120 00187000
*     DO;                                                  /*@Y30OE62*/ 00188000
*       REPLYPTR = ADDR(RPLYAREA);                         /*@Y30OE62*/ 00189000
         LA    @00,RPLYAREA                                        0122 00190000
         ST    @00,REPLYPTR(,PARMLPTR)                             0122 00191000
*                                  /* POINT TO REPLY AREA    @Y30OE62*/ 00192000
*       RPLYAREA = ''B;            /* BLANK REPLY AREA       @Y30OE62*/ 00193000
         XC    RPLYAREA(13),RPLYAREA                               0123 00194000
*                                  /* WITH BINARY ZEROES     @Y30OE62*/ 00195000
*       WAITECB = 0;               /* ZERO OUT ECB           @Y30OE62*/ 00196000
         SLR   @00,@00                                             0124 00197000
         ST    @00,WAITECB                                         0124 00198000
*       GENERATE REFS(WAITECB);                            /*@Y30OE62*/ 00199000
         WTOR MF=(E,(1))          /* ISSUE WTOR             @Y30OE62*/  00200000
         WAIT ECB=WAITECB         /* & WAIT                 @Y30OE62*/  00201000
*     END;                                                 /*@Y30OE62*/ 00202000
*   ELSE                                                           0127 00203000
*     IF MCODE = WRITECHK THEN     /* IF WRITE-CHECK,        @Y30OE62*/ 00204000
         B     @RC00120                                            0127 00205000
@RF00120 CLI   MCODE(PARMLPTR),3                                   0127 00206000
         BNE   @RF00127                                            0127 00207000
*       DO;                                                /*@Y30OE62*/ 00208000
*         DECBREG = DECBPTR;       /* GET DECB PTR           @Y30OE62*/ 00209000
         L     DECBREG,DECBPTR(,PARMLPTR)                          0129 00210000
*         DECBAREA = MSGBUFF;      /* MOVE BUFFER TO AREA    @Y30OE62*/ 00211000
         L     @15,DECBARPT(,DECBREG)                              0130 00212000
         MVC   DECBAREA(88,@15),MSGBUFF                            0130 00213000
*                                  /* POINTED TO BY DECB     @Y30OE62*/ 00214000
*         GENERATE REFS(DECBREG);                          /*@Y30OE62*/ 00215000
         WRITE (DECBREG),SF,MF=E  /* WRITE THE BUFFER       @Y30OE62*/  00216000
         CHECK (DECBREG)          /* CHECK IT               @Y30OE62*/  00217000
*       END;                                               /*@Y30OE62*/ 00218000
*     ELSE                         /* IT'S A WTO             @Y30OE62*/ 00219000
*       GEN (WTO MF=(E,(1)));      /* ISSUE WTO              @Y30OE62*/ 00220000
         B     @RC00127                                            0133 00221000
@RF00127 DS    0H                                                  0133 00222000
         WTO MF=(E,(1))                                                 00223000
*   R1 = PARMLPTR;                 /* POINT TO PARMLIST      @Y30OE62*/ 00224000
@RC00127 DS    0H                                                  0134 00225000
@RC00120 LR    R1,PARMLPTR                                         0134 00226000
*   END IOEDKMSG;                                          /*@Y30OE62*/ 00227000
@EL00001 L     @13,4(,@13)                                         0135 00228000
@EF00001 DS    0H                                                  0135 00229000
@ER00001 LM    @14,@12,12(@13)                                     0135 00230000
         BR    @14                                                 0135 00231000
@DATA    DS    0H                                                       00232000
@CH00041 DC    H'1'                                                     00233000
@CH00045 DC    H'3'                                                     00234000
@CH00143 DC    H'4'                                                     00235000
@SM00685 MVC   MSGBUFF(0),MESSAGE(MSGPTR)                               00236000
@SM00689 MVC   MSGTEXT(0,MTXTPTR),TEXT(TXTNPTR)                         00237000
@SM00691 MVC   0(0,@15),BLANKS                                          00238000
         DS    0F                                                       00239000
@SA00001 DS    18F                                                      00240000
@ZTEMPS  DS    0F                                                       00241000
@ZT00003 DC    F'0'                                                     00242000
@ZTEMPND EQU   *                                                        00243000
@ZLEN    EQU   @ZTEMPND-@ZTEMPS                                         00244000
         DS    0F                                                       00245000
         DS    0D                                                       00246000
BLANKS   DC    CL20' '                                                  00247000
MSGBUFF  DC    CL88' '                                                  00248000
WORKFLAG DC    X'00'                                                    00249000
         ORG   WORKFLAG                                                 00250000
LOPFLAG  DS    BL1                                                      00251000
@NM00001 EQU   WORKFLAG+0                                               00252000
         ORG   WORKFLAG+1                                               00253000
WRKKEY   DS    CL1                                                      00254000
         ORG   WRKKEY                                                   00255000
WRKKEY1  DS    BL1                                                      00256000
@NM00002 EQU   WRKKEY+0                                                 00257000
         ORG   WRKKEY+1                                                 00258000
         DS    CL2                                                      00259000
WAITECB  DC    X'00'                                                    00260000
         DC    XL3'0'                                                   00261000
RPLYAREA DS    CL13                                                     00262000
         DS    CL1                                                      00263000
IEB543I  DS    CL66                                                     00264000
         ORG   IEB543I                                                  00265000
M1LEN    DC    AL2(58+4)                                                00266000
@NM00004 DC    X'8000'                                                  00267000
M1TXT    DS    CL58                                                     00268000
         ORG   M1TXT                                                    00269000
@NM00005 DC    CL8'IEB543I '                                            00270000
@NM00006 DC    X'07'                                                    00271000
@NM00007 DC    CL27'        DD MISSING OR INVAL'                        00272000
@NM00008 DC    CL22'ID FOR DISKETTE READER'                             00273000
         ORG   IEB543I+62                                               00274000
@NM00009 DC    X'0200'                                                  00275000
@NM00010 DC    X'4200'                                                  00276000
         ORG   IEB543I+66                                               00277000
IEB552I  DS    CL62                                                     00278000
         ORG   IEB552I                                                  00279000
M2LEN    DC    AL2(54+4)                                                00280000
@NM00011 DC    X'8000'                                                  00281000
M2TXT    DS    CL54                                                     00282000
         ORG   M2TXT                                                    00283000
@NM00012 DC    CL27'IEB552I INVALID PARAMETERS '                        00284000
@NM00013 DC    CL27'SUPPLIED TO DISKETTE READER'                        00285000
         ORG   IEB552I+58                                               00286000
@NM00014 DC    X'0200'                                                  00287000
@NM00015 DC    X'4200'                                                  00288000
         ORG   IEB552I+62                                               00289000
IEB553I  DS    CL57                                                     00290000
         ORG   IEB553I                                                  00291000
M3LEN    DC    AL2(49+4)                                                00292000
@NM00016 DC    X'8000'                                                  00293000
M3TXT    DS    CL49                                                     00294000
         ORG   M3TXT                                                    00295000
@NM00017 DC    CL27'IEB553I DISKETTE READER UNA'                        00296000
@NM00018 DC    CL22'BLE TO GET TABLE SPACE'                             00297000
         ORG   IEB553I+53                                               00298000
@NM00019 DC    X'0200'                                                  00299000
@NM00020 DC    X'4200'                                                  00300000
         ORG   IEB553I+57                                               00301000
         DS    CL1                                                      00302000
IEB549I  DS    CL53                                                     00303000
         ORG   IEB549I                                                  00304000
M4LEN    DC    AL2(45+4)                                                00305000
@NM00021 DC    X'8000'                                                  00306000
M4TXT    DS    CL45                                                     00307000
         ORG   M4TXT                                                    00308000
@NM00022 DC    CL8'IEB549I '                                            00309000
@NM00023 DC    X'07'                                                    00310000
@NM00024 DC    CL25'        ,DISKETTE READER '                          00311000
@NM00025 DC    CL11'OPEN FAILED'                                        00312000
         ORG   IEB549I+49                                               00313000
@NM00026 DC    X'0200'                                                  00314000
@NM00027 DC    X'4200'                                                  00315000
         ORG   IEB549I+53                                               00316000
         DS    CL1                                                      00317000
IEB550E  DS    CL71                                                     00318000
         ORG   IEB550E                                                  00319000
M5LEN    DC    AL2(63+4)                                                00320000
@NM00028 DC    X'8000'                                                  00321000
M5TXT    DS    CL63                                                     00322000
         ORG   M5TXT                                                    00323000
@NM00029 DC    CL8'IEB550E '                                            00324000
@NM00030 DC    CL23'JOB NUMBER LIMIT EXCEED'                            00325000
@NM00031 DC    CL15'ED READING JOB '                                    00326000
@NM00032 DC    X'0B'                                                    00327000
@NM00033 DC    CL7' '                                                   00328000
@NM00034 DC    CL6' FROM '                                              00329000
@NM00035 DC    X'08'                                                    00330000
@NM00036 DC    CL2' '                                                   00331000
         ORG   IEB550E+67                                               00332000
@NM00037 DC    X'0200'                                                  00333000
@NM00038 DC    X'4200'                                                  00334000
         ORG   IEB550E+71                                               00335000
         DS    CL1                                                      00336000
IEB544E  DS    CL80                                                     00337000
         ORG   IEB544E                                                  00338000
M6LEN    DC    AL2(72+4)                                                00339000
@NM00039 DC    X'8000'                                                  00340000
M6TXT    DS    CL72                                                     00341000
         ORG   M6TXT                                                    00342000
@NM00040 DC    CL8'IEB544E '                                            00343000
@NM00041 DC    CL20'ASSOCIATED DATA SET '                               00344000
@NM00042 DC    CL27'LIMIT EXCEEDED READING JOB '                        00345000
@NM00043 DC    X'0B'                                                    00346000
@NM00044 DC    CL7' '                                                   00347000
@NM00045 DC    CL6' FROM '                                              00348000
@NM00046 DC    X'08'                                                    00349000
@NM00047 DC    CL2' '                                                   00350000
         ORG   IEB544E+76                                               00351000
@NM00048 DC    X'0200'                                                  00352000
@NM00049 DC    X'4200'                                                  00353000
         ORG   IEB544E+80                                               00354000
IEB545I  DS    CL54                                                     00355000
         ORG   IEB545I                                                  00356000
M7LEN    DC    AL2(46+4)                                                00357000
@NM00050 DC    X'8000'                                                  00358000
M7TXT    DS    CL46                                                     00359000
         ORG   M7TXT                                                    00360000
@NM00051 DC    CL23'IEB545I FOLLOWING DATA '                            00361000
@NM00052 DC    CL20'SET(S) NOT FOUND ON '                               00362000
@NM00053 DC    X'08'                                                    00363000
@NM00054 DC    CL2' '                                                   00364000
         ORG   IEB545I+50                                               00365000
@NM00055 DC    X'0200'                                                  00366000
@NM00056 DC    X'4200'                                                  00367000
         ORG   IEB545I+54                                               00368000
IEB546I  DS    CL62                                                     00369000
         ORG   IEB546I                                                  00370000
M8LEN    DC    AL2(54+4)                                                00371000
@NM00057 DC    X'8000'                                                  00372000
M8TXT    DS    CL54                                                     00373000
         ORG   M8TXT                                                    00374000
@NM00058 DC    CL15'IEB546I DSNAME='                                    00375000
@NM00059 DC    X'06'                                                    00376000
@NM00060 DC    CL16'       ,JOBNAME='                                   00377000
@NM00061 DC    X'0B'                                                    00378000
@NM00062 DC    CL15'       ,VOLSER='                                    00379000
@NM00063 DC    X'01'                                                    00380000
@NM00064 DC    CL5' '                                                   00381000
         ORG   IEB546I+58                                               00382000
@NM00065 DC    X'0200'                                                  00383000
@NM00066 DC    X'4200'                                                  00384000
         ORG   IEB546I+62                                               00385000
         DS    CL2                                                      00386000
IEB547D  DS    CL47                                                     00387000
         ORG   IEB547D                                                  00388000
REPLN9   DC    AL1(5)                                                   00389000
REPAD9   DC    AL3(RPLYAREA)                                            00390000
ECBAD9   DC    AL4(WAITECB)                                             00391000
M9LEN    DC    AL2(31+4)                                                00392000
@NM00067 DC    X'8000'                                                  00393000
M9TXT    DS    CL31                                                     00394000
         ORG   M9TXT                                                    00395000
@NM00068 DC    CL22'IEB547D REPLY ''RETRY'' '                           00396000
@NM00069 DC    CL9'OR ''GO'''                                           00397000
         ORG   IEB547D+43                                               00398000
@NM00070 DC    X'0200'                                                  00399000
@NM00071 DC    X'8200'                                                  00400000
         ORG   IEB547D+47                                               00401000
         DS    CL1                                                      00402000
IEB548E  DS    CL53                                                     00403000
         ORG   IEB548E                                                  00404000
M10LEN   DC    AL2(45+4)                                                00405000
@NM00072 DC    X'8000'                                                  00406000
M10TXT   DS    CL45                                                     00407000
         ORG   M10TXT                                                   00408000
@NM00073 DC    CL8'IEB548E '                                            00409000
@NM00074 DC    X'08'                                                    00410000
@NM00075 DC    CL16'   INPUT ERROR, '                                   00411000
@NM00076 DC    CL12'READING JOB '                                       00412000
@NM00077 DC    X'0B'                                                    00413000
@NM00078 DC    CL7' '                                                   00414000
         ORG   IEB548E+49                                               00415000
@NM00079 DC    X'0200'                                                  00416000
@NM00080 DC    X'4240'                                                  00417000
         ORG   IEB548E+53                                               00418000
         DS    CL1                                                      00419000
IEB551I  DS    CL88                                                     00420000
         ORG   IEB551I                                                  00421000
M11BDW   DC    AL2(80+8)                                                00422000
@NM00081 DC    X'0000'                                                  00423000
M11RDW   DC    AL2(80+4)                                                00424000
@NM00082 DC    X'0000'                                                  00425000
M11TXT   DS    CL80                                                     00426000
         ORG   M11TXT                                                   00427000
@NM00083 DC    CL21'//* IEB551I DATA SET '                              00428000
@NM00084 DC    CL21'NOT AVAILABLE - CODE='                              00429000
@NM00085 DC    X'0D'                                                    00430000
@NM00086 DC    CL37' '                                                  00431000
         ORG   IEB551I+88                                               00432000
IEB554E  DS    CL76                                                     00433000
         ORG   IEB554E                                                  00434000
M12LEN   DC    AL2(68+4)                                                00435000
@NM00087 DC    X'8000'                                                  00436000
M12TXT   DS    CL68                                                     00437000
         ORG   M12TXT                                                   00438000
@NM00088 DC    CL8'IEB554E '                                            00439000
@NM00089 DC    X'07'                                                    00440000
@NM00090 DC    CL25'       , DISKETTE READER '                          00441000
@NM00091 DC    CL11'I/O ERROR, '                                        00442000
@NM00092 DC    CL15'PROCESSING JOB '                                    00443000
@NM00093 DC    X'0B'                                                    00444000
@NM00094 DC    CL7' '                                                   00445000
         ORG   IEB554E+72                                               00446000
@NM00095 DC    X'0200'                                                  00447000
@NM00096 DC    X'4240'                                                  00448000
         ORG   IEB554E+76                                               00449000
         DS    CL2                                                      00450000
IEB540D  DS    CL60                                                     00451000
         ORG   IEB540D                                                  00452000
REPLN13  DC    AL1(1)                                                   00453000
REPAD13  DC    AL3(RPLYAREA)                                            00454000
ECBAD13  DC    AL4(WAITECB)                                             00455000
M13LEN   DC    AL2(44+4)                                                00456000
@NM00097 DC    X'8000'                                                  00457000
M13TXT   DS    CL44                                                     00458000
         ORG   M13TXT                                                   00459000
@NM00098 DC    CL25'IEB540D DISKETTE SEQUENCE'                          00460000
@NM00099 DC    CL7' ERROR,'                                             00461000
@NM00100 DC    X'08'                                                    00462000
@NM00101 DC    CL3'  ,'                                                 00463000
@NM00102 DC    X'06'                                                    00464000
@NM00103 DC    CL7' '                                                   00465000
         ORG   IEB540D+56                                               00466000
@NM00104 DC    X'0200'                                                  00467000
@NM00105 DC    X'8200'                                                  00468000
         ORG   IEB540D+60                                               00469000
IEB530I  DS    CL48                                                     00470000
         ORG   IEB530I                                                  00471000
M14LEN   DC    AL2(40+4)                                                00472000
@NM00106 DC    X'8000'                                                  00473000
M14TXT   DS    CL40                                                     00474000
         ORG   M14TXT                                                   00475000
@NM00107 DC    CL26'IEB530I INVALID VOL1 LABEL'                         00476000
@NM00108 DC    CL4' ON '                                                00477000
@NM00109 DC    X'08'                                                    00478000
@NM00110 DC    CL3'  ,'                                                 00479000
@NM00111 DC    X'01'                                                    00480000
@NM00112 DC    CL5' '                                                   00481000
         ORG   IEB530I+44                                               00482000
@NM00113 DC    X'0200'                                                  00483000
@NM00114 DC    X'4200'                                                  00484000
         ORG   IEB530I+48                                               00485000
IEB531I  DS    CL55                                                     00486000
         ORG   IEB531I                                                  00487000
M15LEN   DC    AL2(47+4)                                                00488000
@NM00115 DC    X'8000'                                                  00489000
M15TXT   DS    CL47                                                     00490000
         ORG   M15TXT                                                   00491000
@NM00116 DC    CL25'IEB531I INVALID HDR1 FOR '                          00492000
@NM00117 DC    X'06'                                                    00493000
@NM00118 DC    CL11'        ON '                                        00494000
@NM00119 DC    X'01'                                                    00495000
@NM00120 DC    CL6'     ,'                                              00496000
@NM00121 DC    X'08'                                                    00497000
@NM00122 DC    CL2' '                                                   00498000
         ORG   IEB531I+51                                               00499000
@NM00123 DC    X'0200'                                                  00500000
@NM00124 DC    X'4200'                                                  00501000
         ORG   IEB531I+55                                               00502000
         DS    CL1                                                      00503000
IEB541D  DS    CL36                                                     00504000
         ORG   IEB541D                                                  00505000
REPLN16  DC    AL1(1)                                                   00506000
REPAD16  DC    AL3(RPLYAREA)                                            00507000
ECBAD16  DC    AL4(WAITECB)                                             00508000
M16LEN   DC    AL2(20+4)                                                00509000
@NM00125 DC    X'8000'                                                  00510000
M16TXT   DS    CL20                                                     00511000
         ORG   M16TXT                                                   00512000
@NM00126 DC    CL10'IEB541D M '                                         00513000
@NM00127 DC    X'08'                                                    00514000
@NM00128 DC    CL3'  ,'                                                 00515000
@NM00129 DC    X'01'                                                    00516000
@NM00130 DC    CL5' '                                                   00517000
         ORG   IEB541D+32                                               00518000
@NM00131 DC    X'0200'                                                  00519000
@NM00132 DC    X'8200'                                                  00520000
         ORG   IEB541D+36                                               00521000
IEB542D  DS    CL71                                                     00522000
         ORG   IEB542D                                                  00523000
REPLN17  DC    AL1(12)                                                  00524000
REPAD17  DC    AL3(RPLYAREA)                                            00525000
ECBAD17  DC    AL4(WAITECB)                                             00526000
M17LEN   DC    AL2(55+4)                                                00527000
@NM00133 DC    X'8000'                                                  00528000
M17TXT   DS    CL55                                                     00529000
         ORG   M17TXT                                                   00530000
@NM00134 DC    CL15'IEB542D SECURE '                                    00531000
@NM00135 DC    X'0A'                                                    00532000
@NM00136 DC    CL11'        ON '                                        00533000
@NM00137 DC    X'08'                                                    00534000
@NM00138 DC    CL3'  ,'                                                 00535000
@NM00139 DC    X'01'                                                    00536000
@NM00140 DC    CL6'     ,'                                              00537000
@NM00141 DC    X'0B'                                                    00538000
@NM00142 DC    CL8'       ,'                                            00539000
@NM00143 DC    X'06'                                                    00540000
@NM00144 DC    CL7' '                                                   00541000
         ORG   IEB542D+67                                               00542000
@NM00145 DC    X'0200'                                                  00543000
@NM00146 DC    X'8280'                                                  00544000
         ORG   IEB542D+71                                               00545000
         DS    CL1                                                      00546000
IEB555E  DS    CL47                                                     00547000
         ORG   IEB555E                                                  00548000
M18LEN   DC    AL2(39+4)                                                00549000
@NM00147 DC    X'8000'                                                  00550000
M18TXT   DS    CL39                                                     00551000
         ORG   M18TXT                                                   00552000
@NM00148 DC    CL8'IEB555E '                                            00553000
@NM00149 DC    CL26'DISKETTE READER DIRECTORY '                         00554000
@NM00150 DC    CL5'ERROR'                                               00555000
         ORG   IEB555E+43                                               00556000
@NM00151 DC    X'0200'                                                  00557000
@NM00152 DC    X'4200'                                                  00558000
         ORG   IEB555E+47                                               00559000
         DS    CL1                                                      00560000
IEB570I  DS    CL53                                                     00561000
         ORG   IEB570I                                                  00562000
M19LEN   DC    AL2(45+4)                                                00563000
@NM00153 DC    X'8000'                                                  00564000
M19TXT   DS    CL45                                                     00565000
         ORG   M19TXT                                                   00566000
@NM00154 DC    CL8'IEB570I '                                            00567000
@NM00155 DC    X'08'                                                    00568000
@NM00156 DC    CL3'  ,'                                                 00569000
@NM00157 DC    X'01'                                                    00570000
@NM00158 DC    CL26'      NON-SCRATCH DISKETTE'                         00571000
@NM00159 DC    CL6' FOUND'                                              00572000
         ORG   IEB570I+49                                               00573000
@NM00160 DC    X'0200'                                                  00574000
@NM00161 DC    X'4200'                                                  00575000
         ORG   IEB570I+53                                               00576000
         DS    CL1                                                      00577000
IEB571I  DS    CL78                                                     00578000
         ORG   IEB571I                                                  00579000
M20LEN   DC    AL2(70+4)                                                00580000
@NM00162 DC    X'8000'                                                  00581000
M20TXT   DS    CL70                                                     00582000
         ORG   M20TXT                                                   00583000
@NM00163 DC    CL8'IEB571I '                                            00584000
@NM00164 DC    X'0B'                                                    00585000
@NM00165 DC    CL8'       ,'                                            00586000
@NM00166 DC    X'06'                                                    00587000
@NM00167 DC    CL18'        ON VOL(S) '                                 00588000
@NM00168 DC    X'01'                                                    00589000
@NM00169 DC    CL6'     ,'                                              00590000
@NM00170 DC    X'02'                                                    00591000
@NM00171 DC    CL6'     ,'                                              00592000
@NM00172 DC    X'03'                                                    00593000
@NM00173 DC    CL6'     ,'                                              00594000
@NM00174 DC    X'04'                                                    00595000
@NM00175 DC    CL6'     ,'                                              00596000
@NM00176 DC    X'05'                                                    00597000
@NM00177 DC    CL5' '                                                   00598000
         ORG   IEB571I+74                                               00599000
@NM00178 DC    X'0200'                                                  00600000
@NM00179 DC    X'4200'                                                  00601000
         ORG   IEB571I+78                                               00602000
IEB572E  DS    CL56                                                     00603000
         ORG   IEB572E                                                  00604000
M21LEN   DC    AL2(48+4)                                                00605000
@NM00180 DC    X'8000'                                                  00606000
M21TXT   DS    CL48                                                     00607000
         ORG   M21TXT                                                   00608000
@NM00181 DC    CL8'IEB572E '                                            00609000
@NM00182 DC    X'08'                                                    00610000
@NM00183 DC    CL26'   DISKETTE WRITER CLOSED,'                         00611000
@NM00184 DC    CL13' OUTPUT ERROR'                                      00612000
         ORG   IEB572E+52                                               00613000
@NM00185 DC    X'0200'                                                  00614000
@NM00186 DC    X'4240'                                                  00615000
         ORG   IEB572E+56                                               00616000
IEB573E  DS    CL61                                                     00617000
         ORG   IEB573E                                                  00618000
M22LEN   DC    AL2(53+4)                                                00619000
@NM00187 DC    X'8000'                                                  00620000
M22TXT   DS    CL53                                                     00621000
         ORG   M22TXT                                                   00622000
@NM00188 DC    CL21'IEB573E DATA SET NOT '                              00623000
@NM00189 DC    CL16'WRITTEN FOR,JOB='                                   00624000
@NM00190 DC    X'0B'                                                    00625000
@NM00191 DC    CL14'       ,CLASS='                                     00626000
@NM00192 DC    X'09'                                                    00627000
         ORG   IEB573E+57                                               00628000
@NM00193 DC    X'0200'                                                  00629000
@NM00194 DC    X'4200'                                                  00630000
         ORG   IEB573E+61                                               00631000
         DS    CL1                                                      00632000
IEB574I  DS    CL65                                                     00633000
         ORG   IEB574I                                                  00634000
M23LEN   DC    AL2(57+4)                                                00635000
@NM00195 DC    X'8000'                                                  00636000
M23TXT   DS    CL57                                                     00637000
         ORG   M23TXT                                                   00638000
@NM00196 DC    CL19'IEB574I IEFRDER DD '                                00639000
@NM00197 DC    CL11'MISSING OR '                                        00640000
@NM00198 DC    CL27'INVALID FOR DISKETTE WRITER'                        00641000
         ORG   IEB574I+61                                               00642000
@NM00199 DC    X'0200'                                                  00643000
@NM00200 DC    X'4200'                                                  00644000
         ORG   IEB574I+65                                               00645000
         DS    CL1                                                      00646000
IEB575A  DS    CL81                                                     00647000
         ORG   IEB575A                                                  00648000
REPLN24  DC    AL1(12)                                                  00649000
REPAD24  DC    AL3(RPLYAREA)                                            00650000
ECBAD24  DC    AL4(WAITECB)                                             00651000
M24LEN   DC    AL2(65+4)                                                00652000
@NM00201 DC    X'8000'                                                  00653000
M24TXT   DS    CL65                                                     00654000
         ORG   M24TXT                                                   00655000
@NM00202 DC    CL25'IEB575A SPECIFY SECURITY '                          00656000
@NM00203 DC    CL11'FOR DSNAME='                                        00657000
@NM00204 DC    X'06'                                                    00658000
@NM00205 DC    CL12'       ,JOB='                                       00659000
@NM00206 DC    X'0B'                                                    00660000
@NM00207 DC    CL12'       , ON '                                       00661000
@NM00208 DC    X'08'                                                    00662000
@NM00209 DC    CL2' '                                                   00663000
         ORG   IEB575A+77                                               00664000
@NM00210 DC    X'0200'                                                  00665000
@NM00211 DC    X'8280'                                                  00666000
         ORG   IEB575A+81                                               00667000
         DS    CL1                                                      00668000
IEB576I  DS    CL64                                                     00669000
         ORG   IEB576I                                                  00670000
M25LEN   DC    AL2(56+4)                                                00671000
@NM00212 DC    X'8000'                                                  00672000
M25TXT   DS    CL56                                                     00673000
         ORG   M25TXT                                                   00674000
@NM00213 DC    CL23'IEB576I SYSIO ERROR ON '                            00675000
@NM00214 DC    X'06'                                                    00676000
@NM00215 DC    CL16'        FOR JOB '                                   00677000
@NM00216 DC    X'0B'                                                    00678000
@NM00217 DC    CL12'       , ON '                                       00679000
@NM00218 DC    X'08'                                                    00680000
@NM00219 DC    CL2' '                                                   00681000
         ORG   IEB576I+60                                               00682000
@NM00220 DC    X'0200'                                                  00683000
@NM00221 DC    X'4240'                                                  00684000
         ORG   IEB576I+64                                               00685000
IEB577E  DS    CL58                                                     00686000
         ORG   IEB577E                                                  00687000
M26LEN   DC    AL2(50+4)                                                00688000
@NM00222 DC    X'8000'                                                  00689000
M26TXT   DS    CL50                                                     00690000
         ORG   M26TXT                                                   00691000
@NM00223 DC    CL8'IEB577E '                                            00692000
@NM00224 DC    X'08'                                                    00693000
@NM00225 DC    CL25'   DISKETTE WRITER ENDED,'                          00694000
@NM00226 DC    X'0C'                                                    00695000
@NM00227 DC    CL15'          ERROR'                                    00696000
         ORG   IEB577E+54                                               00697000
@NM00228 DC    X'0200'                                                  00698000
@NM00229 DC    X'4200'                                                  00699000
         ORG   IEB577E+58                                               00700000
IEB578I  DS    CL71                                                     00701000
         ORG   IEB578I                                                  00702000
M27LEN   DC    AL2(63+4)                                                00703000
@NM00230 DC    X'8000'                                                  00704000
M27TXT   DS    CL63                                                     00705000
         ORG   M27TXT                                                   00706000
@NM00231 DC    CL8'IEB578I '                                            00707000
@NM00232 DC    X'08'                                                    00708000
@NM00233 DC    CL22'   DUPLICATE DATA SET '                             00709000
@NM00234 DC    CL11'IDENTIFIER '                                        00710000
@NM00235 DC    X'06'                                                    00711000
@NM00236 DC    CL12'        FOR '                                       00712000
@NM00237 DC    X'0B'                                                    00713000
@NM00238 DC    CL7' '                                                   00714000
         ORG   IEB578I+67                                               00715000
@NM00239 DC    X'0200'                                                  00716000
@NM00240 DC    X'4200'                                                  00717000
         ORG   IEB578I+71                                               00718000
         DS    CL1                                                      00719000
IEB579I  DS    CL66                                                     00720000
         ORG   IEB579I                                                  00721000
M28LEN   DC    AL2(58+4)                                                00722000
@NM00241 DC    X'8000'                                                  00723000
M28TXT   DS    CL58                                                     00724000
         ORG   M28TXT                                                   00725000
@NM00242 DC    CL16'IEB579I INVALID '                                   00726000
@NM00243 DC    CL19'PARAMETERS SUPPLIED'                                00727000
@NM00244 DC    CL23' TO THE DISKETTE WRITER'                            00728000
         ORG   IEB579I+62                                               00729000
@NM00245 DC    X'0200'                                                  00730000
@NM00246 DC    X'4200'                                                  00731000
         ORG   IEB579I+66                                               00732000
IEB580I  DS    CL44                                                     00733000
         ORG   IEB580I                                                  00734000
M29LEN   DC    AL2(36+4)                                                00735000
@NM00247 DC    X'8000'                                                  00736000
M29TXT   DS    CL36                                                     00737000
         ORG   M29TXT                                                   00738000
@NM00248 DC    CL20'IEB580I OPEN ERROR -'                               00739000
@NM00249 DC    CL16' DISKETTE WRITER'                                   00740000
         ORG   IEB580I+40                                               00741000
@NM00250 DC    X'0200'                                                  00742000
@NM00251 DC    X'4200'                                                  00743000
         ORG   IEB580I+44                                               00744000
IEB581E  DS    CL48                                                     00745000
         ORG   IEB581E                                                  00746000
M30LEN   DC    AL2(40+4)                                                00747000
@NM00252 DC    X'8000'                                                  00748000
M30TXT   DS    CL40                                                     00749000
         ORG   M30TXT                                                   00750000
@NM00253 DC    CL8'IEB581E '                                            00751000
@NM00254 DC    X'0E'                                                    00752000
@NM00255 DC    CL27'                     ERROR,'                        00753000
@NM00256 DC    X'0D'                                                    00754000
@NM00257 DC    CL3' '                                                   00755000
         ORG   IEB581E+44                                               00756000
@NM00258 DC    X'0200'                                                  00757000
@NM00259 DC    X'0020'                                                  00758000
         ORG   IEB581E+48                                               00759000
IEB556E  DS    CL62                                                     00760000
         ORG   IEB556E                                                  00761000
M31LEN   DC    AL2(54+4)                                                00762000
@NM00260 DC    X'8000'                                                  00763000
M31TXT   DS    CL54                                                     00764000
         ORG   M31TXT                                                   00765000
@NM00261 DC    CL22'IEB556E DSID KEYWORD '                              00766000
@NM00262 DC    CL12'ENCOUNTERED '                                       00767000
@NM00263 DC    CL12'READING JOB '                                       00768000
@NM00264 DC    X'0B'                                                    00769000
@NM00265 DC    CL7' '                                                   00770000
         ORG   IEB556E+58                                               00771000
@NM00266 DC    X'0200'                                                  00772000
@NM00267 DC    X'4200'                                                  00773000
         ORG   IEB556E+62                                               00774000
MSGLPTR  DC    AL4(IEB543I)                                             00775000
         DC    AL4(IEB552I)                                             00776000
         DC    AL4(IEB553I)                                             00777000
         DC    AL4(IEB549I)                                             00778000
         DC    AL4(IEB550E)                                             00779000
         DC    AL4(IEB544E)                                             00780000
         DC    AL4(IEB545I)                                             00781000
         DC    AL4(IEB546I)                                             00782000
         DC    AL4(IEB547D)                                             00783000
         DC    AL4(IEB548E)                                             00784000
         DC    AL4(IEB551I)                                             00785000
         DC    AL4(IEB554E)                                             00786000
         DC    AL4(IEB540D)                                             00787000
         DC    AL4(IEB530I)                                             00788000
         DC    AL4(IEB531I)                                             00789000
         DC    AL4(IEB541D)                                             00790000
         DC    AL4(IEB542D)                                             00791000
         DC    AL4(IEB555E)                                             00792000
         DC    AL4(IEB570I)                                             00793000
         DC    AL4(IEB571I)                                             00794000
         DC    AL4(IEB572E)                                             00795000
         DC    AL4(IEB573E)                                             00796000
         DC    AL4(IEB574I)                                             00797000
         DC    AL4(IEB575A)                                             00798000
         DC    AL4(IEB576I)                                             00799000
         DC    AL4(IEB577E)                                             00800000
         DC    AL4(IEB578I)                                             00801000
         DC    AL4(IEB579I)                                             00802000
         DC    AL4(IEB580I)                                             00803000
         DC    AL4(IEB581E)                                             00804000
         DC    AL4(IEB556E)                                             00805000
IOEDKMSG CSECT                                                          00806000
MT3540AR DC    50X'FF'            /* ZAPAREA                @Y30OE62*/  00807000
IOEDKMSG CSECT                                                          00808000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00809000
@01      EQU   01                                                       00810000
@02      EQU   02                                                       00811000
@03      EQU   03                                                       00812000
@04      EQU   04                                                       00813000
@05      EQU   05                                                       00814000
@06      EQU   06                                                       00815000
@07      EQU   07                                                       00816000
@08      EQU   08                                                       00817000
@09      EQU   09                                                       00818000
@10      EQU   10                                                       00819000
@11      EQU   11                                                       00820000
@12      EQU   12                                                       00821000
@13      EQU   13                                                       00822000
@14      EQU   14                                                       00823000
@15      EQU   15                                                       00824000
BFRDPTR  EQU   @09                                                      00825000
RDPTR    EQU   @08                                                      00826000
BFMLPTR  EQU   @10                                                      00827000
MLNDEX   EQU   @09                                                      00828000
TXTNDEX  EQU   @08                                                      00829000
R1       EQU   @01                                                      00830000
PARMLPTR EQU   @02                                                      00831000
MSGPTR   EQU   @03                                                      00832000
TXTNPTR  EQU   @04                                                      00833000
MSGLNPTR EQU   @05                                                      00834000
MTXTPTR  EQU   @06                                                      00835000
DECBREG  EQU   @07                                                      00836000
PARMLIST EQU   0                                                        00837000
MSGNDEX  EQU   PARMLIST                                                 00838000
MCODE    EQU   PARMLIST+1                                               00839000
DECBPTR  EQU   PARMLIST+4                                               00840000
REPLYPTR EQU   PARMLIST+8                                               00841000
TXTENTRY EQU   0                                                        00842000
NTRYLN   EQU   TXTENTRY                                                 00843000
KEYCHK   EQU   TXTENTRY+1                                               00844000
LOPBIT   EQU   KEYCHK                                                   00845000
TEXT     EQU   TXTENTRY+2                                               00846000
MESSAGE  EQU   0                                                        00847000
MLEN     EQU   0                                                        00848000
TXTBYTE  EQU   0                                                        00849000
MSGTEXT  EQU   0                                                        00850000
MSGLEN   EQU   0                                                        00851000
ROUTDESC EQU   0                                                        00852000
BFRTDSC  EQU   0                                                        00853000
DECBDECB EQU   0                                                        00854000
DECBARPT EQU   DECBDECB+12                                              00855000
DECBAREA EQU   0                                                        00856000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00857000
@NM00003 EQU   DECBDECB                                                 00858000
KEE      EQU   KEYCHK                                                   00859000
RSVRD    EQU   PARMLIST+2                                               00860000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00861000
@ENDDATA EQU   *                                                        00862000
         END   IOEDKMSG,(C'PLS1425',0603,74297)                         00863000
