         TITLE 'ISDADCK1 PRINT ROUTINE FOR DCK TLX                     *00001000
                        '                                               00002000
ISDADCK1 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(8)                                              0001 00007000
         DC    C'ISDADCK1'                                         0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @11,0                                               0001 00011000
@PSTART  LA    @12,4095(,@11)                                      0001 00012000
         USING @PSTART,@11                                         0001 00013000
         USING @PSTART+4095,@12                                    0001 00014000
         L     @00,@SIZDATD                                        0001 00015000
         ISDAGSPC R,LV=(0)                                              00016000
         LR    @10,@01                                             0001 00017000
         USING @DATD,@10                                           0001 00018000
         ST    @13,@SA00001+4                                      0001 00019000
         LM    @00,@01,20(@13)                                     0001 00020000
         ST    @10,8(,@13)                                         0001 00021000
         LR    @13,@10                                             0001 00022000
         MVC   @PC00001(4),0(@01)                                  0001 00023000
*                                                                  0028 00024000
*      /* HOUSEKEEPING                                       @Y30LB54*/ 00025000
*                                                                  0028 00026000
*   CVTPTR=WORKPTR;                 /*                       @Y30LB54*/ 00027000
         L     @15,@PC00001                                        0028 00028000
         L     CVTPTR,WORKPTR(,@15)                                0028 00029000
*   LPARMPTR=PARMPTR;               /* BASE FOR PARMS        @Y30LB54*/ 00030000
         L     LPARMPTR,PARMPTR(,CVTPTR)                           0029 00031000
*   DCKWKPTR=DCK00PTR;              /* SET LOCAL PTR TO WORK @ZM30975*/ 00032000
         L     DCKWKPTR,DCK00PTR(,CVTPTR)                          0030 00033000
*   RETCODE=0;                      /*                       @Y30LB54*/ 00034000
*                                                                  0031 00035000
         SLR   @15,@15                                             0031 00036000
         LR    RETCODE,@15                                         0031 00037000
*   /*****************************************************************/ 00038000
*   /*                                                               */ 00039000
*   /* TEST TO DETERMINE IF WE PRODUCE THIS REPORT                   */ 00040000
*   /*                                                               */ 00041000
*   /*****************************************************************/ 00042000
*                                                                  0032 00043000
*   IF COUNTRP8=0 THEN                                             0032 00044000
         C     @15,COUNTRP8(,DCKWKPTR)                             0032 00045000
         BE    @RT00032                                            0032 00046000
*     ;                             /*                       @Y30LB54*/ 00047000
*   ELSE                                                           0034 00048000
*                                                                  0034 00049000
*     /***************************************************************/ 00050000
*     /*                                                             */ 00051000
*     /* DCK MAIN PROCESSOR                                          */ 00052000
*     /*                                                             */ 00053000
*     /***************************************************************/ 00054000
*                                                                  0034 00055000
*     DO LIBCTR=1 TO 4 BY 1;        /* PROCESS 4 LIBRARIES   @Y30LB54*/ 00056000
         LA    @15,1                                               0034 00057000
         ST    @15,LIBCTR(,DCKWKPTR)                               0034 00058000
@DL00034 DS    0H                                                  0035 00059000
*       BITHDCTR=0;                 /* RESET BIT HEADER COUNT@Y30LB54*/ 00060000
         SLR   @15,@15                                             0035 00061000
         ST    @15,BITHDCTR(,DCKWKPTR)                             0035 00062000
*       IF LIBPTR(LIBCTR)^=0 THEN   /* NO REPORT NEEDED FOR THIS CS     00063000
*                                                            @Y30LB54*/ 00064000
         L     @15,LIBCTR(,DCKWKPTR)                               0036 00065000
         SLA   @15,2                                               0036 00066000
         L     @15,LIBPTR-5(@15,DCKWKPTR)                          0036 00067000
         LA    @15,0(,@15)                                         0036 00068000
         LTR   @15,@15                                             0036 00069000
         BZ    @RF00036                                            0036 00070000
*         DO;                       /*                       @Y30LB54*/ 00071000
*           CALL RPT8HDR;           /* GET THE HEADER PORTION OF THE    00072000
*                                      REPORT                @Y30LB54*/ 00073000
         BAL   @14,RPT8HDR                                         0038 00074000
*           DO BYTECTR=1 TO 4 BY 1; /* WE WILL DISPLAY 4 BYTES WORTH    00075000
*                                      OF DATA               @Y30LB54*/ 00076000
         LA    @15,1                                               0039 00077000
         ST    @15,BYTECTR(,DCKWKPTR)                              0039 00078000
@DL00039 DS    0H                                                  0040 00079000
*             CALL RPT8BYTE;        /*                       @Y30LB54*/ 00080000
         BAL   @14,RPT8BYTE                                        0040 00081000
*             DO BITCTR=1 TO 8 BY 1;/* WE WILL DISPLAY 8 BITS PER  0041 00082000
*                                      BYTE                  @Y30LB54*/ 00083000
         LA    @15,1                                               0041 00084000
         ST    @15,BITCTR(,DCKWKPTR)                               0041 00085000
@DL00041 DS    0H                                                  0042 00086000
*               CALL RPT8BIT;       /*                       @Y30LB54*/ 00087000
         BAL   @14,RPT8BIT                                         0042 00088000
*             END;                  /*                       @Y30LB54*/ 00089000
         LA    @15,1                                               0043 00090000
         AL    @15,BITCTR(,DCKWKPTR)                               0043 00091000
         ST    @15,BITCTR(,DCKWKPTR)                               0043 00092000
         CH    @15,@CH00071                                        0043 00093000
         BNH   @DL00041                                            0043 00094000
*           END;                    /*                       @Y30LB54*/ 00095000
         LA    @15,1                                               0044 00096000
         AL    @15,BYTECTR(,DCKWKPTR)                              0044 00097000
         ST    @15,BYTECTR(,DCKWKPTR)                              0044 00098000
         CH    @15,@CH00051                                        0044 00099000
         BNH   @DL00039                                            0044 00100000
*           LINE(1:30)='|-----------------------------';/*   @Y30LB54*/ 00101000
         MVC   LINE(30,CVTPTR),@CC00246                            0045 00102000
*           LINE(30:84)=                                           0046 00103000
*'|-----|-----|-----|-----|-----|-----|-----|-----|-----|';/*@Y30LB54*/ 00104000
         MVC   LINE+29(55,CVTPTR),@CC00250                         0046 00105000
*           CALL ISDAPRT0(WORKPTR); /*                       @Y30LB54*/ 00106000
         L     @15,@PC00001                                        0047 00107000
         ST    @15,@AL00001                                        0047 00108000
         L     @15,@CV00042                                        0047 00109000
         LA    @01,@AL00001                                        0047 00110000
         BALR  @14,@15                                             0047 00111000
*         END;                      /*                       @Y30LB54*/ 00112000
*       ELSE                                                       0049 00113000
*         ;                         /*                       @Y30LB54*/ 00114000
@RF00036 DS    0H                                                  0050 00115000
*     END;                          /*                       @Y30LB54*/ 00116000
         LA    @15,1                                               0050 00117000
         AL    @15,LIBCTR(,DCKWKPTR)                               0050 00118000
         ST    @15,LIBCTR(,DCKWKPTR)                               0050 00119000
         CH    @15,@CH00051                                        0050 00120000
         BNH   @DL00034                                            0050 00121000
*                                                                  0051 00122000
*   /*****************************************************************/ 00123000
*   /*                                                               */ 00124000
*   /* TEST TO DETERMINE IF WE PRODUCE THIS REPORT                   */ 00125000
*   /*                                                               */ 00126000
*   /*****************************************************************/ 00127000
*                                                                  0051 00128000
*   IF COUNTRP9=0 THEN                                             0051 00129000
@RT00032 ICM   @15,15,COUNTRP9(DCKWKPTR)                           0051 00130000
         BZ    @RT00051                                            0051 00131000
*     ;                             /*                       @Y30LB54*/ 00132000
*   ELSE                                                           0053 00133000
*                                                                  0053 00134000
*     /***************************************************************/ 00135000
*     /*                                                             */ 00136000
*     /* TLX MAIN PROCESSOR                                          */ 00137000
*     /*                                                             */ 00138000
*     /***************************************************************/ 00139000
*                                                                  0053 00140000
*     DO;                           /*                       @Y30LB54*/ 00141000
*       DO LIBCTR=1 TO 4 BY 1;      /* PROCESS 4 LIBRARIES   @Y30LB54*/ 00142000
         LA    @15,1                                               0054 00143000
         ST    @15,LIBCTR(,DCKWKPTR)                               0054 00144000
@DL00054 DS    0H                                                  0055 00145000
*         BITHDCTR=0;               /* RESET BIT HEADER COUNT@Y30LB54*/ 00146000
         SLR   @15,@15                                             0055 00147000
         ST    @15,BITHDCTR(,DCKWKPTR)                             0055 00148000
*         IF LIBPTR(LIBCTR)^=0 THEN                                0056 00149000
         L     @15,LIBCTR(,DCKWKPTR)                               0056 00150000
         SLA   @15,2                                               0056 00151000
         L     @15,LIBPTR-5(@15,DCKWKPTR)                          0056 00152000
         LA    @15,0(,@15)                                         0056 00153000
         LTR   @15,@15                                             0056 00154000
         BZ    @RF00056                                            0056 00155000
*           DO;                     /*                       @Y30LB54*/ 00156000
*             CALL RPT9HDR;         /*                       @Y30LB54*/ 00157000
         BAL   @14,RPT9HDR                                         0058 00158000
*             DO VALCTR=0 TO 31 BY 1;/* PROCESS 31LINES      @Y30LB54*/ 00159000
         SLR   @15,@15                                             0059 00160000
         ST    @15,VALCTR(,DCKWKPTR)                               0059 00161000
@DL00059 DS    0H                                                  0060 00162000
*               CALL RPT9DATA;      /*                       @Y30LB54*/ 00163000
         BAL   @14,RPT9DATA                                        0060 00164000
*             END;                  /*                       @Y30LB54*/ 00165000
         LA    @15,1                                               0061 00166000
         AL    @15,VALCTR(,DCKWKPTR)                               0061 00167000
         ST    @15,VALCTR(,DCKWKPTR)                               0061 00168000
         CH    @15,@CH00040                                        0061 00169000
         BNH   @DL00059                                            0061 00170000
*             LINE=' ----------------------------------------';    0062 00171000
         MVI   LINE+41(CVTPTR),C' '                                0062 00172000
         MVC   LINE+42(90,CVTPTR),LINE+41(CVTPTR)                  0062 00173000
         MVC   LINE(41,CVTPTR),@CC00256                            0062 00174000
*             LINE(42:81)='---------------------    ---------------';   00175000
         MVC   LINE+41(40,CVTPTR),@CC00262                         0063 00176000
*             LINE(82:123)='------------------------------------------' 00177000
*                 ;                 /*                       @ZA00691*/ 00178000
         MVC   LINE+81(42,CVTPTR),@CC00267                         0064 00179000
*             LINE(124:127)='----'; /*                       @ZA00691*/ 00180000
         MVC   LINE+123(4,CVTPTR),@CC00273                         0065 00181000
*             CALL ISDAPRT0(WORKPTR);/*                      @Y30LB54*/ 00182000
         L     @15,@PC00001                                        0066 00183000
         ST    @15,@AL00001                                        0066 00184000
         L     @15,@CV00042                                        0066 00185000
         LA    @01,@AL00001                                        0066 00186000
         BALR  @14,@15                                             0066 00187000
*             ANSI='0';             /* DOUBLE SPACE OUTPUT   @Y30LB54*/ 00188000
         MVI   ANSI(CVTPTR),C'0'                                   0067 00189000
*             LINE=' INDEX PGM IS MSS BYTE 22(BITS 0-4)';  /*@ZM30975*/ 00190000
         MVI   LINE+35(CVTPTR),C' '                                0068 00191000
         MVC   LINE+36(96,CVTPTR),LINE+35(CVTPTR)                  0068 00192000
         MVC   LINE(35,CVTPTR),@CC00274                            0068 00193000
*             LINE(67:101)='THREAD PGM IS MSS BYTE 31(BITS 0-4)'; /*    00194000
*                                                            @ZA00691*/ 00195000
         MVC   LINE+66(35,CVTPTR),@CC00279                         0069 00196000
*             CALL ISDAPRT0(WORKPTR);/*                      @Y30LB54*/ 00197000
         L     @15,@PC00001                                        0070 00198000
         ST    @15,@AL00001                                        0070 00199000
         L     @15,@CV00042                                        0070 00200000
         LA    @01,@AL00001                                        0070 00201000
         BALR  @14,@15                                             0070 00202000
*             LINE=' U = NORMAL INDEXER PROGRAM STEP AT END OF UNLOAD'; 00203000
         MVI   LINE+49(CVTPTR),C' '                                0071 00204000
         MVC   LINE+50(82,CVTPTR),LINE+49(CVTPTR)                  0071 00205000
         MVC   LINE(49,CVTPTR),@CC00282                            0071 00206000
*             LINE(67:113)='U = NORMAL THREAD PROGRAM STEP AT END OF UN 00207000
*OAD';                              /* PRINT U MESSAGE       @ZA00691*/ 00208000
         MVC   LINE+66(47,CVTPTR),@CC00287                         0072 00209000
*             CALL ISDAPRT0(WORKPTR);/* PRINT IT             @ZA00691*/ 00210000
         L     @15,@PC00001                                        0073 00211000
         ST    @15,@AL00001                                        0073 00212000
         L     @15,@CV00042                                        0073 00213000
         LA    @01,@AL00001                                        0073 00214000
         BALR  @14,@15                                             0073 00215000
*             LINE=' L = NORMAL INDEXER PROGRAM STEP AT END OF LOAD';   00216000
         MVI   LINE+47(CVTPTR),C' '                                0074 00217000
         MVC   LINE+48(84,CVTPTR),LINE+47(CVTPTR)                  0074 00218000
         MVC   LINE(47,CVTPTR),@CC00291                            0074 00219000
*             LINE(67:111)='L = NORMAL THREAD PROGRAM STEP AT END OF LO 00220000
*D';                                /* PRINT L MESSAGE       @ZA00691*/ 00221000
         MVC   LINE+66(45,CVTPTR),@CC00296                         0075 00222000
*             CALL ISDAPRT0(WORKPTR);/* PRINT IT             @ZA00691*/ 00223000
         L     @15,@PC00001                                        0076 00224000
         ST    @15,@AL00001                                        0076 00225000
         L     @15,@CV00042                                        0076 00226000
         LA    @01,@AL00001                                        0076 00227000
         BALR  @14,@15                                             0076 00228000
*           END;                    /*                       @Y30LB54*/ 00229000
*         ELSE                                                     0078 00230000
*           ;                       /*                       @Y30LB54*/ 00231000
@RF00056 DS    0H                                                  0079 00232000
*       END;                        /*                       @Y30LB54*/ 00233000
         LA    @15,1                                               0079 00234000
         AL    @15,LIBCTR(,DCKWKPTR)                               0079 00235000
         ST    @15,LIBCTR(,DCKWKPTR)                               0079 00236000
         CH    @15,@CH00051                                        0079 00237000
         BNH   @DL00054                                            0079 00238000
*     END;                          /*                       @Y30LB54*/ 00239000
*                                                                  0081 00240000
*   /*****************************************************************/ 00241000
*   /*                                                               */ 00242000
*   /* ALL REPORTS PRODUCED AT THIS POINT                            */ 00243000
*   /*                                                               */ 00244000
*   /*****************************************************************/ 00245000
*                                                                  0081 00246000
*   IF COUNTRP8=0&COUNTRP9=0 THEN                                  0081 00247000
@RT00051 SLR   @15,@15                                             0081 00248000
         C     @15,COUNTRP8(,DCKWKPTR)                             0081 00249000
         BNE   @RF00081                                            0081 00250000
         C     @15,COUNTRP9(,DCKWKPTR)                             0081 00251000
         BNE   @RF00081                                            0081 00252000
*     RETCODE=8;                    /* NO INPUT TO BE PROCESSED    0082 00253000
*                                                            @Y30LB54*/ 00254000
         LA    RETCODE,8                                           0082 00255000
*   ELSE                                                           0083 00256000
*     IF COUNTRP9=0&CDCKTLX='03'X THEN /* DCK,TLX REQUESTED  @ZM30975*/ 00257000
         B     @RC00081                                            0083 00258000
@RF00081 ICM   @15,15,COUNTRP9(DCKWKPTR)                           0083 00259000
         BNZ   @RF00083                                            0083 00260000
         CLI   CDCKTLX(LPARMPTR),X'03'                             0083 00261000
         BNE   @RF00083                                            0083 00262000
*       RETCODE=16;                 /* NO DATA FOR TLX       @ZM30975*/ 00263000
         LA    RETCODE,16                                          0084 00264000
*     ELSE;                         /* RETCODE OK            @ZM30975*/ 00265000
*                                                                  0085 00266000
@RF00083 DS    0H                                                  0086 00267000
*   /*****************************************************************/ 00268000
*   /*                                                               */ 00269000
*   /*                                                               */ 00270000
*   /*****************************************************************/ 00271000
*                                                                  0086 00272000
*   CALL FREECORE;                  /* FREE ALL CORE         @Y30LB54*/ 00273000
@RC00081 BAL   @14,FREECORE                                        0086 00274000
*   RETURN CODE(RETCODE);           /*                       @Y30LB54*/ 00275000
         L     @13,4(,@13)                                         0087 00276000
         L     @00,@SIZDATD                                        0087 00277000
         LR    @01,@10                                             0087 00278000
         ISDAFSPC R,LV=(0),A=(1)                                        00279000
         LR    @15,@04                                             0087 00280000
         L     @14,12(,@13)                                        0087 00281000
         LM    @00,@12,20(@13)                                     0087 00282000
         BR    @14                                                 0087 00283000
*                                                                  0088 00284000
*   /*****************************************************************/ 00285000
*   /*                                                               */ 00286000
*   /* PRODUCE DCK MAIN HEADERS                                      */ 00287000
*   /*                                                               */ 00288000
*   /*****************************************************************/ 00289000
*                                                                  0088 00290000
*RPT8HDR:                                                          0088 00291000
*   PROC;                           /*                       @Y30LB54*/ 00292000
RPT8HDR  STM   @14,@12,@SA00002                                    0088 00293000
*   LINE=' ';                       /* CLEAR LINE            @Y30LB54*/ 00294000
         MVI   LINE+1(CVTPTR),C' '                                 0089 00295000
         MVC   LINE+2(130,CVTPTR),LINE+1(CVTPTR)                   0089 00296000
         MVI   LINE(CVTPTR),C' '                                   0089 00297000
*   LINE(53:55)='MSF';              /*                       @Y30LB54*/ 00298000
         MVC   LINE+52(3,CVTPTR),@CC00308                          0090 00299000
*   LINE(1:35)='REPORT 8 - DRD DEVICE CHECK SUMMARY';/*      @ZM30730*/ 00300000
         MVC   LINE(35,CVTPTR),@CC00310                            0091 00301000
*   LINE(78:114)='(DATA FROM MSS FORMAT 4, SA FORMAT 9)';/*  @Y30LB54*/ 00302000
         MVC   LINE+77(37,CVTPTR),@CC00315                         0092 00303000
*   ANSI='1';                       /* EJECT                 @Y30LB54*/ 00304000
         MVI   ANSI(CVTPTR),C'1'                                   0093 00305000
*   FULLWD1=57;                     /* POSITION TO PUT CONVERTED DATA   00306000
*                                                            @Y30LB54*/ 00307000
         LA    @05,57                                              0094 00308000
         ST    @05,FULLWD1(,DCKWKPTR)                              0094 00309000
*   KICKPTR=LIBPTR(LIBCTR);         /* ESTABLISH COUNTER BASE@Y30LB54*/ 00310000
         L     @15,LIBCTR(,DCKWKPTR)                               0095 00311000
         SLA   @15,2                                               0095 00312000
         L     @14,LIBPTR-5(@15,DCKWKPTR)                          0095 00313000
         LA    @14,0(,@14)                                         0095 00314000
         ST    @14,KICKPTR(,DCKWKPTR)                              0095 00315000
*   LIBNO(LIBCTR)=LIBNO(LIBCTR)-1;  /* ADJUST FOR TRUE READOUT     0096 00316000
*                                                            @Y30LB54*/ 00317000
         SLR   @14,@14                                             0096 00318000
         IC    @14,LIBNO-4(@15,DCKWKPTR)                           0096 00319000
         BCTR  @14,0                                               0096 00320000
         STC   @14,LIBNO-4(@15,DCKWKPTR)                           0096 00321000
*   FOURBITS=LIBNO(LIBCTR)&'0F'X;   /* PICK OFF BOTTOM HALF  @Y30LB54*/ 00322000
         ST    @15,@TF00001                                        0097 00323000
         ALR   @15,DCKWKPTR                                        0097 00324000
         MVC   FOURBITS(1,DCKWKPTR),LIBNO-4(@15)                   0097 00325000
         NI    FOURBITS(DCKWKPTR),X'0F'                            0097 00326000
*   FOURBITS=FOURBITS+1;            /*                       @Y30LB54*/ 00327000
         LA    @15,1                                               0098 00328000
         SLR   @09,@09                                             0098 00329000
         IC    @09,FOURBITS(,DCKWKPTR)                             0098 00330000
         ALR   @09,@15                                             0098 00331000
         STC   @09,FOURBITS(,DCKWKPTR)                             0098 00332000
*   LINE(FULLWD1:FULLWD1)=HEXREP(FOURBITS);/*                @Y30LB54*/ 00333000
         ALR   @05,CVTPTR                                          0099 00334000
         LA    @08,HEXREP-1(@09)                                   0099 00335000
         MVC   LINE-1(1,@05),0(@08)                                0099 00336000
*   LIBNO(LIBCTR)=LIBNO(LIBCTR)+1;  /* ALLOW FOR START AT 0  @Y30LB54*/ 00337000
         ALR   @14,@15                                             0100 00338000
         L     @05,@TF00001                                        0100 00339000
         STC   @14,LIBNO-4(@05,DCKWKPTR)                           0100 00340000
*   CALL ISDAPRT0(WORKPTR);         /*                       @Y30LB54*/ 00341000
         L     @05,@PC00001                                        0101 00342000
         ST    @05,@AL00001                                        0101 00343000
         L     @15,@CV00042                                        0101 00344000
         LA    @01,@AL00001                                        0101 00345000
         BALR  @14,@15                                             0101 00346000
*   ANSI='0';                       /* DOUBLE SPACE          @Y30LB54*/ 00347000
         MVI   ANSI(CVTPTR),C'0'                                   0102 00348000
*   LINE = ' ';                     /*BLANK LINE             @ZM02889*/ 00349000
         MVI   LINE+1(CVTPTR),C' '                                 0103 00350000
         MVC   LINE+2(130,CVTPTR),LINE+1(CVTPTR)                   0103 00351000
         MVI   LINE(CVTPTR),C' '                                   0103 00352000
*   CALL ISDAPRT0(WORKPTR);         /*PRINT IT               @ZM02889*/ 00353000
         L     @05,@PC00001                                        0104 00354000
         ST    @05,@AL00001                                        0104 00355000
         L     @15,@CV00042                                        0104 00356000
         LA    @01,@AL00001                                        0104 00357000
         BALR  @14,@15                                             0104 00358000
*   LINE(47:54) = 'DRD SSID';       /*SUB HEADING            @ZM02889*/ 00359000
         MVC   LINE+46(8,CVTPTR),@CC00322                          0105 00360000
*   ANSI = ' ';                     /*SINGLE SPACE           @ZM02889*/ 00361000
         MVI   ANSI(CVTPTR),C' '                                   0106 00362000
*   CALL ISDAPRT0(WORKPTR);         /*PRINT IT               @ZM02889*/ 00363000
         L     @05,@PC00001                                        0107 00364000
         ST    @05,@AL00001                                        0107 00365000
         L     @15,@CV00042                                        0107 00366000
         LA    @01,@AL00001                                        0107 00367000
         BALR  @14,@15                                             0107 00368000
*   LINE='|             ';          /*                       @Y30LB54*/ 00369000
         MVI   LINE+14(CVTPTR),C' '                                0108 00370000
         MVC   LINE+15(117,CVTPTR),LINE+14(CVTPTR)                 0108 00371000
         MVC   LINE(14,CVTPTR),@CC00323                            0108 00372000
*   LINE(30:84)=                                                   0109 00373000
*       '|  200|  201|  202|  203|  204|  205|  206|  207|TOTAL|'; 0109 00374000
         MVC   LINE+29(55,CVTPTR),@CC00325                         0109 00375000
*   DO CTR=34 TO 76 BY 6;           /* INSERT MSF NUMBERS IN SSID  0110 00376000
*                                                            @Y30LB54*/ 00377000
         LA    @05,34                                              0110 00378000
         ST    @05,CTR(,DCKWKPTR)                                  0110 00379000
@DL00110 DS    0H                                                  0111 00380000
*     LINE(CTR)=HEXREP(FOURBITS);   /*                       @Y30LB54*/ 00381000
         L     @05,CTR(,DCKWKPTR)                                  0111 00382000
         ALR   @05,CVTPTR                                          0111 00383000
         SLR   @01,@01                                             0111 00384000
         IC    @01,FOURBITS(,DCKWKPTR)                             0111 00385000
         LA    @15,HEXREP-1(@01)                                   0111 00386000
         MVC   LINE-1(1,@05),0(@15)                                0111 00387000
*   END;                                                   /*@Y30LB54*/ 00388000
         LA    @05,6                                               0112 00389000
         AL    @05,CTR(,DCKWKPTR)                                  0112 00390000
         ST    @05,CTR(,DCKWKPTR)                                  0112 00391000
         CH    @05,@CH00330                                        0112 00392000
         BNH   @DL00110                                            0112 00393000
*   CALL ISDAPRT0(WORKPTR);         /*                       @Y30LB54*/ 00394000
         L     @05,@PC00001                                        0113 00395000
         ST    @05,@AL00001                                        0113 00396000
         L     @15,@CV00042                                        0113 00397000
         LA    @01,@AL00001                                        0113 00398000
         BALR  @14,@15                                             0113 00399000
*   RETURN CODE(RETCODE);           /*                       @Y30LB54*/ 00400000
         LR    @15,RETCODE                                         0114 00401000
         L     @14,@SA00002                                        0114 00402000
         LM    @00,@12,@SA00002+8                                  0114 00403000
         BR    @14                                                 0114 00404000
*   END RPT8HDR;                    /*                       @Y30LB54*/ 00405000
*                                                                  0116 00406000
*   /*****************************************************************/ 00407000
*   /*                                                               */ 00408000
*   /* PRODUCE BYTE HEADER                                           */ 00409000
*   /*                                                               */ 00410000
*   /*****************************************************************/ 00411000
*                                                                  0116 00412000
*RPT8BYTE:                                                         0116 00413000
*   PROC;                           /*                       @Y30LB54*/ 00414000
RPT8BYTE STM   @14,@12,@SA00003                                    0116 00415000
*   DCL                                                            0117 00416000
*     1 BYTEHDR8(4) STATIC LOCAL,                                  0117 00417000
*      2 * CHAR(13) INIT('1 MSS BYTE 18','2 MSS BYTE 19','3 MSS BYTE 20 00418000
*            );                     /* HEADERS FOR REPORT    @Y30LB54*/ 00419000
*   LINE(1:30)='|-----------------------------';/*           @Y30LB54*/ 00420000
         MVC   LINE(30,CVTPTR),@CC00246                            0118 00421000
*   LINE(30:84)=                                                   0119 00422000
*       '|-----|-----|-----|-----|-----|-----|-----|-----|-----|'; 0119 00423000
         MVC   LINE+29(55,CVTPTR),@CC00250                         0119 00424000
*   CALL ISDAPRT0(WORKPTR);         /*                       @Y30LB54*/ 00425000
         L     @05,@PC00001                                        0120 00426000
         ST    @05,@AL00001                                        0120 00427000
         L     @15,@CV00042                                        0120 00428000
         LA    @01,@AL00001                                        0120 00429000
         BALR  @14,@15                                             0120 00430000
*   LINE='|              ';         /*                       @Y30LB54*/ 00431000
         MVI   LINE+15(CVTPTR),C' '                                0121 00432000
         MVC   LINE+16(116,CVTPTR),LINE+15(CVTPTR)                 0121 00433000
         MVC   LINE(15,CVTPTR),@CC00343                            0121 00434000
*   LINE(30:84)=                                                   0122 00435000
*       '|     |     |     |     |     |     |     |     |     |'; 0122 00436000
         MVC   LINE+29(55,CVTPTR),@CC00345                         0122 00437000
*   IF BYTECTR=1 THEN                                              0123 00438000
         CLC   BYTECTR(4,DCKWKPTR),@CF00048                        0123 00439000
         BNE   @RF00123                                            0123 00440000
*     LINE(1:27)='|SA SENSE BYTE 0 MSS BYTE 4';/*            @YE0LB54   00441000
*                                                            @Y30LB54*/ 00442000
         MVC   LINE(27,CVTPTR),@CC00350                            0124 00443000
*   ELSE                                                           0125 00444000
*     DO;                                                  /*@Y30LB54*/ 00445000
         B     @RC00123                                            0125 00446000
@RF00123 DS    0H                                                  0126 00447000
*       LINE(2:15)='DRD SENSE BYTE';/* @Y300LB54             @Y30LB54*/ 00448000
         MVC   LINE+1(14,CVTPTR),@CC00353                          0126 00449000
*       LINE(17:29)=BYTEHDR8(BYTECTR-1);/*                   @Y30LB54*/ 00450000
         L     @05,BYTECTR(,DCKWKPTR)                              0127 00451000
         MH    @05,@CH00336                                        0127 00452000
         LA    @01,BYTEHDR8-26(@05)                                0127 00453000
         MVC   LINE+16(13,CVTPTR),0(@01)                           0127 00454000
*     END;                          /*                       @Y30LB54*/ 00455000
*   CALL ISDAPRT0(WORKPTR);         /*                       @Y30LB54*/ 00456000
@RC00123 L     @05,@PC00001                                        0129 00457000
         ST    @05,@AL00001                                        0129 00458000
         L     @15,@CV00042                                        0129 00459000
         LA    @01,@AL00001                                        0129 00460000
         BALR  @14,@15                                             0129 00461000
*   RETURN CODE(RETCODE);           /*                       @Y30LB54*/ 00462000
         LR    @15,RETCODE                                         0130 00463000
         L     @14,@SA00003                                        0130 00464000
         LM    @00,@12,@SA00003+8                                  0130 00465000
         BR    @14                                                 0130 00466000
*   END RPT8BYTE;                   /*                       @Y30LB54*/ 00467000
*                                                                  0132 00468000
*   /*****************************************************************/ 00469000
*   /*                                                               */ 00470000
*   /* PROCESS BITS FOR DCK REPORT                                   */ 00471000
*   /*                                                               */ 00472000
*   /*****************************************************************/ 00473000
*                                                                  0132 00474000
*RPT8BIT:                                                          0132 00475000
*   PROC;                           /*                       @Y30LB54*/ 00476000
*                                                                  0132 00477000
RPT8BIT  STM   @14,@12,@SA00004                                    0132 00478000
*   /*****************************************************************/ 00479000
*   /*                                                               */ 00480000
*   /* DCK BIT HEADERS                                               */ 00481000
*   /*                                                               */ 00482000
*   /*****************************************************************/ 00483000
*                                                                  0133 00484000
*   DCL                                                            0133 00485000
*     BIT8HDR(8) CHAR(27) BASED(TEMPPTR);/*                  @Y30LB54*/ 00486000
*   DCL                                                            0134 00487000
*     1 BITHDR8 STATIC LOCAL,                                      0134 00488000
*      2 BIT80(8) CHAR(27) INIT('BIT 0 COMMAND REJECT',            0134 00489000
*            'BIT 1 INTERVENTION REQUIRED','BIT 2 BUS OUT PARITY', 0134 00490000
*            'BIT 3 EQUIPMENT CHECK','BIT 4 DATA CHECK',           0134 00491000
*            'BIT 5 OVERRUN (NOT USED)','BIT 6 NOT USED',          0134 00492000
*            'BIT 7 ENVIRONMENTAL DATA'),                          0134 00493000
*      2 BIT8A(8) CHAR(27) INIT('BIT 0 ERROR TIMEOUT',             0134 00494000
*            'BIT 1 SERVO CHECK','BIT 2 CABLE CHECK',              0134 00495000
*            'BIT 3 WRITE DISABLE','BIT 4 OV/UV CHECK',            0134 00496000
*            'BIT 5 VACUUM CHECK','BIT 6 PNEUMATIC CHECK',         0134 00497000
*            'BIT 7 WRITE DRIVER CHECK'),                          0134 00498000
*      2 BIT8B(8) CHAR(27) INIT('BIT 0 CARTRIDGE ENTRY',           0134 00499000
*            'BIT 1 CARTRIDGE EXIT','BIT 2 SEARCH CHECK',          0134 00500000
*            'BIT 3 INDEXER CHECK',                        /*@ZM31107*/ 00501000
*            'BIT 4 THREAD/LOAD CHECK','BIT 5 UNLOAD CHECK',       0134 00502000
*            'BIT 6 B/O PARITY CHECK','BIT 7 TAG BUS PARITY CHECK'),    00503000
*      2 BIT8C(8) CHAR(27) INIT('BIT 0 NOT USED',          /*@ZM31107*/ 00504000
*            'BIT 1 SPOOL OVERCURRENT','BIT 2 SPOOL RUNAWAY/TACH', 0134 00505000
*            'BIT 3 DGC CHECK','BIT 4 ROTOR/TACH CHECK',           0134 00506000
*            'BIT 5 IHC/LIFTER CHECK','BIT 6 CAPSTAN CURRENT/TACH',     00507000
*            'BIT 7 CAPSTAN RUNAWAY/TACH');                /*@ZM31107*/ 00508000
*   B8HDR(1)=ADDR(BIT80);           /*                       @Y30LB54*/ 00509000
         LA    @05,BIT80                                           0135 00510000
         ST    @05,B8HDR(,DCKWKPTR)                                0135 00511000
*   B8HDR(2)=ADDR(BIT8A);           /*                       @Y30LB54*/ 00512000
         LA    @05,BIT8A                                           0136 00513000
         ST    @05,B8HDR+4(,DCKWKPTR)                              0136 00514000
*   B8HDR(3)=ADDR(BIT8B);           /*                       @Y30LB54*/ 00515000
         LA    @05,BIT8B                                           0137 00516000
         ST    @05,B8HDR+8(,DCKWKPTR)                              0137 00517000
*   B8HDR(4)=ADDR(BIT8C);           /*                       @Y30LB54*/ 00518000
         LA    @05,BIT8C                                           0138 00519000
         ST    @05,B8HDR+12(,DCKWKPTR)                             0138 00520000
*   TOTROW=0;                       /* RESET ROW COUNTERS    @Y30LB54*/ 00521000
         SLR   @05,@05                                             0139 00522000
         STH   @05,TOTROW(,DCKWKPTR)                               0139 00523000
*   LINE=' ';                       /*                       @Y30LB54*/ 00524000
         MVI   LINE+1(CVTPTR),C' '                                 0140 00525000
         MVC   LINE+2(130,CVTPTR),LINE+1(CVTPTR)                   0140 00526000
         MVI   LINE(CVTPTR),C' '                                   0140 00527000
*   LINE(30:84)=                                                   0141 00528000
*       '|     |     |     |     |     |     |     |     |     |'; 0141 00529000
         MVC   LINE+29(55,CVTPTR),@CC00345                         0141 00530000
*   TEMPPTR=B8HDR(BYTECTR);         /*                       @Y30LB54*/ 00531000
         L     @05,BYTECTR(,DCKWKPTR)                              0142 00532000
         SLA   @05,2                                               0142 00533000
         L     @05,B8HDR-4(@05,DCKWKPTR)                           0142 00534000
         ST    @05,TEMPPTR(,DCKWKPTR)                              0142 00535000
*   LINE(1:1)='|';                  /*                       @Y30LB54*/ 00536000
         MVI   LINE(CVTPTR),C'|'                                   0143 00537000
*   LINE(3:29)=BIT8HDR(BITCTR);     /*                       @Y30LB54*/ 00538000
         L     @15,BITCTR(,DCKWKPTR)                               0144 00539000
         MH    @15,@CH00349                                        0144 00540000
         ALR   @05,@15                                             0144 00541000
         AL    @05,@CF00509                                        0144 00542000
         MVC   LINE+2(27,CVTPTR),BIT8HDR(@05)                      0144 00543000
*   CTR1=31;                        /* REPORT POSITION OF FIRST    0145 00544000
*                                      COUNTER               @Y30LB54*/ 00545000
         MVC   CTR1(4,DCKWKPTR),@CF00040                           0145 00546000
*   DO CTR=1 TO 8 BY 1;             /*                       @Y30LB54*/ 00547000
         LA    @05,1                                               0146 00548000
         ST    @05,CTR(,DCKWKPTR)                                  0146 00549000
@DL00146 DS    0H                                                  0147 00550000
*/*KICKPTR WAS SET UP BY RPT8HDR                             @Y30LB54*/ 00551000
*                                                                  0147 00552000
*     EDREC=EDPAT;                  /* MOVE IN PATTERN       @Y30LB54*/ 00553000
         MVC   EDREC(8,DCKWKPTR),EDPAT                             0147 00554000
*     TOTROW=TOTROW+COUNTER(CTR);   /* INCREMENT ROW COUNTERS@Y30LB54*/ 00555000
         L     @05,CTR(,DCKWKPTR)                                  0148 00556000
         ALR   @05,@05                                             0148 00557000
         L     @01,KICKPTR(,DCKWKPTR)                              0148 00558000
         AL    @01,@CF00510                                        0148 00559000
         LH    @15,COUNTER(@05,@01)                                0148 00560000
         LH    @14,TOTROW(,DCKWKPTR)                               0148 00561000
         ALR   @14,@15                                             0148 00562000
         STH   @14,TOTROW(,DCKWKPTR)                               0148 00563000
*     TOTFINL(CTR)=TOTFINL(CTR)+COUNTER(CTR);/*              @Y30LB54*/ 00564000
         LH    @14,TOTFINL-2(@05,DCKWKPTR)                         0149 00565000
         ALR   @14,@15                                             0149 00566000
         STH   @14,TOTFINL-2(@05,DCKWKPTR)                         0149 00567000
*     TOTGRND=TOTGRND+COUNTER(CTR); /* INCREMENT GRAND TOTAL COUNTER    00568000
*                                                            @Y30LB54*/ 00569000
         LH    @05,TOTGRND(,DCKWKPTR)                              0150 00570000
         ALR   @05,@15                                             0150 00571000
         STH   @05,TOTGRND(,DCKWKPTR)                              0150 00572000
*     CVD(COUNTER(CTR),CHAR4);      /*                       @Y30LB54*/ 00573000
         CVD   @15,@TS00001                                        0151 00574000
         MVC   CHAR4(4,DCKWKPTR),@TS00001+4                        0151 00575000
*     CHAR4(4)=CHAR4(4)|'0F'X;      /* PROTECT US FROM JUNK  @Y30LB54*/ 00576000
         OI    CHAR4+3(DCKWKPTR),X'0F'                             0152 00577000
*     ED(EDREC,CHAR4);              /* FORMAT OUTPUT         @Y30LB54*/ 00578000
         ED    EDREC(8,DCKWKPTR),CHAR4(DCKWKPTR)                   0153 00579000
*     LINE(CTR1:CTR1+4)=EDREC(4:8); /* MOVE FORMATTED OUPUT TO LINE     00580000
*                                                            @Y30LB54*/ 00581000
         L     @05,CTR1(,DCKWKPTR)                                 0154 00582000
         ALR   @05,CVTPTR                                          0154 00583000
         MVC   LINE-1(5,@05),EDREC+3(DCKWKPTR)                     0154 00584000
*     CTR1=CTR1+6;                  /* NEXT PRINT POSITION   @Y30LB54*/ 00585000
         L     @05,CTR1(,DCKWKPTR)                                 0155 00586000
         AH    @05,@CH00141                                        0155 00587000
         ST    @05,CTR1(,DCKWKPTR)                                 0155 00588000
*   END;                            /*                       @Y30LB54*/ 00589000
         LA    @05,1                                               0156 00590000
         AL    @05,CTR(,DCKWKPTR)                                  0156 00591000
         ST    @05,CTR(,DCKWKPTR)                                  0156 00592000
         CH    @05,@CH00071                                        0156 00593000
         BNH   @DL00146                                            0156 00594000
*   EDREC=EDPAT;                    /* MOVE IN EDIT PATTERN  @Y30LB54*/ 00595000
         MVC   EDREC(8,DCKWKPTR),EDPAT                             0157 00596000
*   CVD(TOTROW,CHAR4);              /* MAKE IT PRINTABLE     @Y30LB54*/ 00597000
         LH    @05,TOTROW(,DCKWKPTR)                               0158 00598000
         CVD   @05,@TS00001                                        0158 00599000
         MVC   CHAR4(4,DCKWKPTR),@TS00001+4                        0158 00600000
*   CHAR4(4)=CHAR4(4)|'0F'X;        /* PROTECT SIGN          @Y30LB54*/ 00601000
         OI    CHAR4+3(DCKWKPTR),X'0F'                             0159 00602000
*   ED(EDREC,CHAR4);                /*                       @Y30LB54*/ 00603000
         ED    EDREC(8,DCKWKPTR),CHAR4(DCKWKPTR)                   0160 00604000
*   LINE(CTR1:CTR1+4)=EDREC(4:8);   /*                       @Y30LB54*/ 00605000
         L     @05,CTR1(,DCKWKPTR)                                 0161 00606000
         ALR   @05,CVTPTR                                          0161 00607000
         MVC   LINE-1(5,@05),EDREC+3(DCKWKPTR)                     0161 00608000
*   KICKPTR=KICKPTR+16;             /* SET NEW BASE FOR NEXT COUNTER    00609000
*                                                            @Y30LB54*/ 00610000
         LA    @05,16                                              0162 00611000
         AL    @05,KICKPTR(,DCKWKPTR)                              0162 00612000
         ST    @05,KICKPTR(,DCKWKPTR)                              0162 00613000
*   CALL ISDAPRT0(WORKPTR);         /*                       @Y30LB54*/ 00614000
         L     @05,@PC00001                                        0163 00615000
         ST    @05,@AL00001                                        0163 00616000
         L     @15,@CV00042                                        0163 00617000
         LA    @01,@AL00001                                        0163 00618000
         BALR  @14,@15                                             0163 00619000
*   RETURN CODE(RETCODE);           /*                       @Y30LB54*/ 00620000
         LR    @15,RETCODE                                         0164 00621000
         L     @14,@SA00004                                        0164 00622000
         LM    @00,@12,@SA00004+8                                  0164 00623000
         BR    @14                                                 0164 00624000
*   END RPT8BIT;                    /*                       @Y30LB54*/ 00625000
*                                                                  0166 00626000
*   /*****************************************************************/ 00627000
*   /*                                                               */ 00628000
*   /* PRODUCE TLX MAIN HEADERS                                      */ 00629000
*   /*                                                               */ 00630000
*   /*****************************************************************/ 00631000
*                                                                  0166 00632000
*RPT9HDR:                                                          0166 00633000
*   PROC;                           /*                       @Y30LB54*/ 00634000
RPT9HDR  STM   @14,@12,@SA00005                                    0166 00635000
*   TOTGRND=0;                      /* RESET GRAND TOTAL     @Y30LB54*/ 00636000
         SLR   @05,@05                                             0167 00637000
         STH   @05,TOTGRND(,DCKWKPTR)                              0167 00638000
*   SDARPTID=TLXID;                 /* MOVE REPORT 2 ID      @ZM30730*/ 00639000
         MVC   SDARPTID(3,CVTPTR),@CC00149                         0168 00640000
*   LINE=' ';                       /* CLEAR LINE            @Y30LB54*/ 00641000
         MVI   LINE+1(CVTPTR),C' '                                 0169 00642000
         MVC   LINE+2(130,CVTPTR),LINE+1(CVTPTR)                   0169 00643000
         MVI   LINE(CVTPTR),C' '                                   0169 00644000
*   LINE(65:67)='MSF';              /*                       @ZM30730*/ 00645000
         MVC   LINE+64(3,CVTPTR),@CC00308                          0170 00646000
*LINE(1:55)='REPORT 9 - DRD INDEX PGM AND THREAD PGM COUNTER SUMMARY';  00647000
         MVC   LINE(55,CVTPTR),@CC00442                            0171 00648000
*   LINE(81:117)='(DATA FROM MSS FORMAT 4, SA FORMAT 9)';/*  @ZM30730*/ 00649000
         MVC   LINE+80(37,CVTPTR),@CC00315                         0172 00650000
*   ANSI='1';                       /* EJECT LINE            @Y30LB54*/ 00651000
         MVI   ANSI(CVTPTR),C'1'                                   0173 00652000
*   FULLWD1=69;                     /* POSITION TO PUT CONVERSION  0174 00653000
*                                      INTO                  @ZM30730*/ 00654000
         LA    @05,69                                              0174 00655000
         ST    @05,FULLWD1(,DCKWKPTR)                              0174 00656000
*   KICKPTR=LIBPTR(LIBCTR);         /* BASE FOR COUNTERS     @Y30LB54*/ 00657000
         L     @15,LIBCTR(,DCKWKPTR)                               0175 00658000
         SLA   @15,2                                               0175 00659000
         L     @14,LIBPTR-5(@15,DCKWKPTR)                          0175 00660000
         LA    @14,0(,@14)                                         0175 00661000
         ST    @14,KICKPTR(,DCKWKPTR)                              0175 00662000
*   KICKPTR=KICKPTR+512;            /* OFFSET FOR SECOND SET OF    0176 00663000
*                                      REPORTS               @Y30LB54*/ 00664000
         AH    @14,@CH00448                                        0176 00665000
         ST    @14,KICKPTR(,DCKWKPTR)                              0176 00666000
*   LIBNO(LIBCTR)=LIBNO(LIBCTR)-1;  /* ADJUST TO SHOW READL NO     0177 00667000
*                                                            @Y30LB54*/ 00668000
         SLR   @14,@14                                             0177 00669000
         IC    @14,LIBNO-4(@15,DCKWKPTR)                           0177 00670000
         BCTR  @14,0                                               0177 00671000
         STC   @14,LIBNO-4(@15,DCKWKPTR)                           0177 00672000
*   FOURBITS=LIBNO(LIBCTR)&'0F'X;   /* PICK OFF BOTTOM HALF  @Y30LB54*/ 00673000
         ST    @15,@TF00001                                        0178 00674000
         ALR   @15,DCKWKPTR                                        0178 00675000
         MVC   FOURBITS(1,DCKWKPTR),LIBNO-4(@15)                   0178 00676000
         NI    FOURBITS(DCKWKPTR),X'0F'                            0178 00677000
*   FOURBITS=FOURBITS+1;            /*                       @Y30LB54*/ 00678000
         LA    @15,1                                               0179 00679000
         SLR   @09,@09                                             0179 00680000
         IC    @09,FOURBITS(,DCKWKPTR)                             0179 00681000
         ALR   @09,@15                                             0179 00682000
         STC   @09,FOURBITS(,DCKWKPTR)                             0179 00683000
*   LINE(FULLWD1:FULLWD1)=HEXREP(FOURBITS);/*                @Y30LB54*/ 00684000
         ALR   @05,CVTPTR                                          0180 00685000
         LA    @08,HEXREP-1(@09)                                   0180 00686000
         MVC   LINE-1(1,@05),0(@08)                                0180 00687000
*   LIBNO(LIBCTR)=LIBNO(LIBCTR)+1;  /* ALLOW FOR 0 START     @Y30LB54*/ 00688000
         ALR   @14,@15                                             0181 00689000
         L     @05,@TF00001                                        0181 00690000
         STC   @14,LIBNO-4(@05,DCKWKPTR)                           0181 00691000
*   CALL ISDAPRT0(WORKPTR);         /*                       @Y30LB54*/ 00692000
         L     @05,@PC00001                                        0182 00693000
         ST    @05,@AL00001                                        0182 00694000
         L     @15,@CV00042                                        0182 00695000
         LA    @01,@AL00001                                        0182 00696000
         BALR  @14,@15                                             0182 00697000
*   ANSI='0';                       /* DOUBLE SPACE OUTPUT   @Y30LB54*/ 00698000
         MVI   ANSI(CVTPTR),C'0'                                   0183 00699000
*   LINE='  INDEX             DRD SSID';        /*           @ZA00691*/ 00700000
         MVI   LINE+28(CVTPTR),C' '                                0184 00701000
         MVC   LINE+29(103,CVTPTR),LINE+28(CVTPTR)                 0184 00702000
         MVC   LINE(28,CVTPTR),@CC00449                            0184 00703000
*   LINE(67:93)=' THREAD            DRD SSID'; /*            @ZA00691*/ 00704000
         MVC   LINE+66(27,CVTPTR),@CC00453                         0185 00705000
*   CALL ISDAPRT0(WORKPTR);         /*                       @Y30LB54*/ 00706000
         L     @05,@PC00001                                        0186 00707000
         ST    @05,@AL00001                                        0186 00708000
         L     @15,@CV00042                                        0186 00709000
         LA    @01,@AL00001                                        0186 00710000
         BALR  @14,@15                                             0186 00711000
*   ANSI=' ';                       /* SINGLE SPACE OUTPUT   @Y30LB54*/ 00712000
         MVI   ANSI(CVTPTR),C' '                                   0187 00713000
*   LINE=' |PGM  |  200|  201|  202|  203|  204|  205|  206|  207|TOTAL 00714000
*';                                 /*                       @ZA00691*/ 00715000
         MVI   LINE+62(CVTPTR),C' '                                0188 00716000
         MVC   LINE+63(69,CVTPTR),LINE+62(CVTPTR)                  0188 00717000
         MVC   LINE(62,CVTPTR),@CC00456                            0188 00718000
*   LINE(67:127)=                                                  0189 00719000
*       '|PGM  |  200|  201|  202|  203|  204|  205|  206|  207|TOTAL|' 00720000
*       ;                           /*                       @ZA00691*/ 00721000
         MVC   LINE+66(61,CVTPTR),@CC00461                         0189 00722000
*   DO CTR=12 TO 58 BY 6;           /* INSERT MSF NUMBER IN SSID   0190 00723000
*                                                            @ZA00691*/ 00724000
         LA    @05,12                                              0190 00725000
         ST    @05,CTR(,DCKWKPTR)                                  0190 00726000
@DL00190 DS    0H                                                  0191 00727000
*     LINE(CTR)=HEXREP(FOURBITS);   /*                       @Y30LB54*/ 00728000
         L     @05,CTR(,DCKWKPTR)                                  0191 00729000
         ALR   @05,CVTPTR                                          0191 00730000
         SLR   @01,@01                                             0191 00731000
         IC    @01,FOURBITS(,DCKWKPTR)                             0191 00732000
         LA    @15,HEXREP-1(@01)                                   0191 00733000
         MVC   LINE-1(1,@05),0(@15)                                0191 00734000
*   END;                                                   /*@Y30LB54*/ 00735000
         LA    @05,6                                               0192 00736000
         AL    @05,CTR(,DCKWKPTR)                                  0192 00737000
         ST    @05,CTR(,DCKWKPTR)                                  0192 00738000
         CH    @05,@CH00466                                        0192 00739000
         BNH   @DL00190                                            0192 00740000
*   DO CTR=77 TO 120 BY 6;          /* INSERT MSF NUMBER IN SSID   0193 00741000
*                                                            @ZA00691*/ 00742000
         LA    @05,77                                              0193 00743000
         ST    @05,CTR(,DCKWKPTR)                                  0193 00744000
@DL00193 DS    0H                                                  0194 00745000
*     LINE(CTR)=HEXREP(FOURBITS);   /*                       @Y30LB54*/ 00746000
         L     @05,CTR(,DCKWKPTR)                                  0194 00747000
         ALR   @05,CVTPTR                                          0194 00748000
         SLR   @01,@01                                             0194 00749000
         IC    @01,FOURBITS(,DCKWKPTR)                             0194 00750000
         LA    @15,HEXREP-1(@01)                                   0194 00751000
         MVC   LINE-1(1,@05),0(@15)                                0194 00752000
*   END;                            /*                       @Y30LB54*/ 00753000
         LA    @05,6                                               0195 00754000
         AL    @05,CTR(,DCKWKPTR)                                  0195 00755000
         ST    @05,CTR(,DCKWKPTR)                                  0195 00756000
         CH    @05,@CH00468                                        0195 00757000
         BNH   @DL00193                                            0195 00758000
*   CALL ISDAPRT0(WORKPTR);         /*                       @Y30LB54*/ 00759000
         L     @05,@PC00001                                        0196 00760000
         ST    @05,@AL00001                                        0196 00761000
         L     @15,@CV00042                                        0196 00762000
         LA    @01,@AL00001                                        0196 00763000
         BALR  @14,@15                                             0196 00764000
*   LINE=' |-----|-----|-----|-----|-----|-----|-----|-----|-----|----- 00765000
*';                                 /*                       @ZA00691*/ 00766000
         MVI   LINE+62(CVTPTR),C' '                                0197 00767000
         MVC   LINE+63(69,CVTPTR),LINE+62(CVTPTR)                  0197 00768000
         MVC   LINE(62,CVTPTR),@CC00469                            0197 00769000
*   LINE(67:127)=                                                  0198 00770000
*       '|-----|-----|-----|-----|-----|-----|-----|-----|-----|-----|' 00771000
*       ;                           /*                       @ZA00691*/ 00772000
         MVC   LINE+66(61,CVTPTR),@CC00474                         0198 00773000
*   CALL ISDAPRT0(WORKPTR);         /*                       @Y30LB54*/ 00774000
         L     @05,@PC00001                                        0199 00775000
         ST    @05,@AL00001                                        0199 00776000
         L     @15,@CV00042                                        0199 00777000
         LA    @01,@AL00001                                        0199 00778000
         BALR  @14,@15                                             0199 00779000
*   RETURN CODE(RETCODE);           /*                       @Y30LB54*/ 00780000
         LR    @15,RETCODE                                         0200 00781000
         L     @14,@SA00005                                        0200 00782000
         LM    @00,@12,@SA00005+8                                  0200 00783000
         BR    @14                                                 0200 00784000
*   END RPT9HDR;                    /*                       @Y30LB54*/ 00785000
*                                                                  0202 00786000
*   /*****************************************************************/ 00787000
*   /*                                                               */ 00788000
*   /* TLX DATA LINES                                                */ 00789000
*   /*                                                               */ 00790000
*   /*****************************************************************/ 00791000
*                                                                  0202 00792000
*RPT9DATA:                                                         0202 00793000
*   PROC;                           /*                       @Y30LB54*/ 00794000
RPT9DATA STM   @14,@12,@SA00006                                    0202 00795000
*   CHAR4=VALCTR;                   /* PICK UP VALUE WORKING ON    0203 00796000
*                                                            @Y30LB54*/ 00797000
         MVC   CHAR4(4,DCKWKPTR),VALCTR(DCKWKPTR)                  0203 00798000
*   LINE=' |';                      /*                       @ZA00691*/ 00799000
         MVI   LINE+2(CVTPTR),C' '                                 0204 00800000
         MVC   LINE+3(129,CVTPTR),LINE+2(CVTPTR)                   0204 00801000
         MVC   LINE(2,CVTPTR),@CC00482                             0204 00802000
*   LINE(8:62)='|     |     |     |     |     |     |     |     |     | 00803000
*       ;                           /*                       @ZA00691*/ 00804000
         MVC   LINE+7(55,CVTPTR),@CC00345                          0205 00805000
*   LINE(67:127)=                                                  0206 00806000
*       '|     |     |     |     |     |     |     |     |     |     |' 00807000
*        ;                                /*                 @ZA00691*/ 00808000
         MVC   LINE+66(61,CVTPTR),@CC00484                         0206 00809000
*   FIVEBITS=CHAR4(4);              /* MOVE COUNTER          @ZMTPM01*/ 00810000
         MVC   FIVEBITS(1,DCKWKPTR),CHAR4+3(DCKWKPTR)              0207 00811000
*   INDEXPGM=ZERO5;                 /* INIT TO ALL ZEROS     @ZM30975*/ 00812000
         MVC   INDEXPGM(5,CVTPTR),@CC00155                         0208 00813000
*   IF FIVEBITS(4)='1'B THEN        /* IS BIT ON             @ZM30975*/ 00814000
         TM    FIVEBITS(DCKWKPTR),B'00010000'                      0209 00815000
         BNO   @RF00209                                            0209 00816000
*     INDEXPGM(1)=CHAR1;            /* YES, SET TO ONE       @ZMTPM01*/ 00817000
         MVI   INDEXPGM(CVTPTR),C'1'                               0210 00818000
*   ELSE;                           /* NO, LEAVE AS ZERO     @ZM30975*/ 00819000
@RF00209 DS    0H                                                  0212 00820000
*   IF FIVEBITS(5)='1'B THEN        /* IS BIT ON             @ZM30975*/ 00821000
         TM    FIVEBITS(DCKWKPTR),B'00001000'                      0212 00822000
         BNO   @RF00212                                            0212 00823000
*     INDEXPGM(2)=CHAR1;            /* YES, SET TO ONE       @ZMTPM01*/ 00824000
         MVI   INDEXPGM+1(CVTPTR),C'1'                             0213 00825000
*   ELSE;                           /* NO, LEAVE AS ZERO     @ZM30975*/ 00826000
@RF00212 DS    0H                                                  0215 00827000
*   IF FIVEBITS(6)='1'B THEN        /* IS BIT ON             @ZM30975*/ 00828000
         TM    FIVEBITS(DCKWKPTR),B'00000100'                      0215 00829000
         BNO   @RF00215                                            0215 00830000
*     INDEXPGM(3)=CHAR1;            /* YES, SET TO ONE       @ZMTPM01*/ 00831000
         MVI   INDEXPGM+2(CVTPTR),C'1'                             0216 00832000
*   ELSE;                           /* NO, LEAVE AS ZERO     @ZM30975*/ 00833000
@RF00215 DS    0H                                                  0218 00834000
*   IF FIVEBITS(7)='1'B THEN        /* IS BIT ON             @ZM30975*/ 00835000
         TM    FIVEBITS(DCKWKPTR),B'00000010'                      0218 00836000
         BNO   @RF00218                                            0218 00837000
*     INDEXPGM(4)=CHAR1;            /* YES, SET TO ONE       @ZMTPM01*/ 00838000
         MVI   INDEXPGM+3(CVTPTR),C'1'                             0219 00839000
*   ELSE;                           /* NO, LEAVE AS ZERO     @ZM30975*/ 00840000
@RF00218 DS    0H                                                  0221 00841000
*   IF FIVEBITS(8)='1'B THEN        /* IS BIT ON             @ZM30975*/ 00842000
         TM    FIVEBITS(DCKWKPTR),B'00000001'                      0221 00843000
         BNO   @RF00221                                            0221 00844000
*     INDEXPGM(5)=CHAR1;            /* YES, SET TO ONE       @ZMTPM01*/ 00845000
         MVI   INDEXPGM+4(CVTPTR),C'1'                             0222 00846000
*   ELSE;                           /* NO, LEAVE AS ZERO     @ZM30975*/ 00847000
@RF00221 DS    0H                                                  0224 00848000
*   THREDPGM=INDEXPGM;              /* SET THREAD PGM COUNT  @ZM30975*/ 00849000
         MVC   THREDPGM(5,CVTPTR),INDEXPGM(CVTPTR)                 0224 00850000
*   IF INDEXPGM=IUNORM THEN         /* NORMAL UNLOAD INDEX   @ZA00691*/ 00851000
         CLC   INDEXPGM(5,CVTPTR),@CC00163                         0225 00852000
         BNE   @RF00225                                            0225 00853000
*     ULI=UNLOAD;                   /* YES, MOVE U           @ZA00691*/ 00854000
         MVI   ULI(CVTPTR),C'U'                                    0226 00855000
*   ELSE                                                           0227 00856000
*     IF INDEXPGM=ILNORM THEN       /* NORMAL LOAD INDEX     @ZA00691*/ 00857000
         B     @RC00225                                            0227 00858000
@RF00225 CLC   INDEXPGM(5,CVTPTR),@CC00165                         0227 00859000
         BNE   @RF00227                                            0227 00860000
*       ULI=LOAD;                   /* YES, MOVE L           @ZA00691*/ 00861000
         MVI   ULI(CVTPTR),C'L'                                    0228 00862000
*     ELSE;                         /* ABNORMAL INDEX STEP   @ZA00691*/ 00863000
@RF00227 DS    0H                                                  0230 00864000
*   IF THREDPGM=TUNORM THEN         /* NORMAL UNLOAD THREAD  @ZA00691*/ 00865000
@RC00225 CLC   THREDPGM(5,CVTPTR),@CC00155                         0230 00866000
         BNE   @RF00230                                            0230 00867000
*     ULT=UNLOAD;                   /* MOVE U                @ZA00691*/ 00868000
         MVI   ULT(CVTPTR),C'U'                                    0231 00869000
*   ELSE                                                           0232 00870000
*     IF THREDPGM=TLNORM THEN       /* NORMAL LOAD THREAD    @ZA00691*/ 00871000
         B     @RC00230                                            0232 00872000
@RF00230 CLC   THREDPGM(5,CVTPTR),@CC00168                         0232 00873000
         BNE   @RF00232                                            0232 00874000
*       ULT=LOAD;                   /* YES, MOVE L           @ZA00691*/ 00875000
         MVI   ULT(CVTPTR),C'L'                                    0233 00876000
*     ELSE;                         /* ABNORMAL THREAD STEP  @ZA00691*/ 00877000
@RF00232 DS    0H                                                  0235 00878000
*   FULLWD1=9;                      /* STARTING LOCATION OF PRINT  0235 00879000
*                                      COUNTER               @ZA00691*/ 00880000
@RC00230 MVC   FULLWD1(4,DCKWKPTR),@CF00491                        0235 00881000
*   DO CTR1=1 TO 2 BY 1;            /*                       @Y30LB54*/ 00882000
         LA    @15,1                                               0236 00883000
         ST    @15,CTR1(,DCKWKPTR)                                 0236 00884000
@DL00236 DS    0H                                                  0237 00885000
*     TOTROW=0;                     /* ZERO ROW COUNTERS     @Y30LB54*/ 00886000
         SLR   @15,@15                                             0237 00887000
         STH   @15,TOTROW(,DCKWKPTR)                               0237 00888000
*     DO CTR=1 TO 8 BY 1;           /*                       @Y30LB54*/ 00889000
*                                                                  0238 00890000
         LA    @15,1                                               0238 00891000
         ST    @15,CTR(,DCKWKPTR)                                  0238 00892000
@DL00238 DS    0H                                                  0239 00893000
*       /*************************************************************/ 00894000
*       /*                                                           */ 00895000
*       /* KICKPTR WAS SET UP BY RPT8HDR AND MODIFIED BY RPT8BIT     */ 00896000
*       /*                                                           */ 00897000
*       /*************************************************************/ 00898000
*                                                                  0239 00899000
*       EDREC=EDPAT;                /* MOVE IN PATTERN       @Y30LB54*/ 00900000
         MVC   EDREC(8,DCKWKPTR),EDPAT                             0239 00901000
*       TOTROW=TOTROW+COUNTER(CTR); /* INCREMENT ROW COUNTER @Y30LB54*/ 00902000
         L     @15,CTR(,DCKWKPTR)                                  0240 00903000
         ALR   @15,@15                                             0240 00904000
         L     @01,KICKPTR(,DCKWKPTR)                              0240 00905000
         AL    @01,@CF00510                                        0240 00906000
         LH    @15,COUNTER(@15,@01)                                0240 00907000
         LH    @14,TOTROW(,DCKWKPTR)                               0240 00908000
         ALR   @14,@15                                             0240 00909000
         STH   @14,TOTROW(,DCKWKPTR)                               0240 00910000
*       CVD(COUNTER(CTR),CHAR4);    /* CONVERT COUNTER INTO PACKED 0241 00911000
*                                      DEC                   @Y30LB54*/ 00912000
         CVD   @15,@TS00001                                        0241 00913000
         MVC   CHAR4(4,DCKWKPTR),@TS00001+4                        0241 00914000
*       CHAR4(4)=CHAR4(4)|'0F'X;    /* PROTECT US FROM JUNK  @Y30LB54*/ 00915000
         OI    CHAR4+3(DCKWKPTR),X'0F'                             0242 00916000
*       ED(EDREC,CHAR4);            /* FORMAT OUTPUT         @Y30LB54*/ 00917000
         ED    EDREC(8,DCKWKPTR),CHAR4(DCKWKPTR)                   0243 00918000
*       LINE(FULLWD1:FULLWD1+4)=EDREC(4:8);/* MOVE DATA TO PRINT AREA   00919000
*                                                            @Y30LB54*/ 00920000
         L     @15,FULLWD1(,DCKWKPTR)                              0244 00921000
         ALR   @15,CVTPTR                                          0244 00922000
         MVC   LINE-1(5,@15),EDREC+3(DCKWKPTR)                     0244 00923000
*       FULLWD1=FULLWD1+6;          /* NEXT PRINT POSITION   @Y30LB54*/ 00924000
         L     @15,FULLWD1(,DCKWKPTR)                              0245 00925000
         AH    @15,@CH00141                                        0245 00926000
         ST    @15,FULLWD1(,DCKWKPTR)                              0245 00927000
*     END;                          /*                       @Y30LB54*/ 00928000
         LA    @15,1                                               0246 00929000
         AL    @15,CTR(,DCKWKPTR)                                  0246 00930000
         ST    @15,CTR(,DCKWKPTR)                                  0246 00931000
         CH    @15,@CH00071                                        0246 00932000
         BNH   @DL00238                                            0246 00933000
*     EDREC=EDPAT;                  /* MOVE IN EDIT PATTERN  @Y30LB54*/ 00934000
         MVC   EDREC(8,DCKWKPTR),EDPAT                             0247 00935000
*     CVD(TOTROW,CHAR4);            /* MAKE IT PRINTABLE     @Y30LB54*/ 00936000
         LH    @15,TOTROW(,DCKWKPTR)                               0248 00937000
         CVD   @15,@TS00001                                        0248 00938000
         MVC   CHAR4(4,DCKWKPTR),@TS00001+4                        0248 00939000
*     CHAR4(4)=CHAR4(4)|'0F'X;      /*                       @Y30LB54*/ 00940000
         OI    CHAR4+3(DCKWKPTR),X'0F'                             0249 00941000
*     ED(EDREC,CHAR4);              /*                       @Y30LB54*/ 00942000
         ED    EDREC(8,DCKWKPTR),CHAR4(DCKWKPTR)                   0250 00943000
*     LINE(FULLWD1:FULLWD1+4)=EDREC(4:8);/*                  @Y30LB54*/ 00944000
         L     @15,FULLWD1(,DCKWKPTR)                              0251 00945000
         ALR   @15,CVTPTR                                          0251 00946000
         MVC   LINE-1(5,@15),EDREC+3(DCKWKPTR)                     0251 00947000
*     FULLWD1=FULLWD1+17;           /* SKIP OVER PGM NO      @ZA00691*/ 00948000
         L     @15,FULLWD1(,DCKWKPTR)                              0252 00949000
         AH    @15,@CH00355                                        0252 00950000
         ST    @15,FULLWD1(,DCKWKPTR)                              0252 00951000
*     KICKPTR=KICKPTR+16;           /* SET NEW BASE FOR COUNTERS   0253 00952000
*                                                            @Y30LB54*/ 00953000
         LA    @15,16                                              0253 00954000
         AL    @15,KICKPTR(,DCKWKPTR)                              0253 00955000
         ST    @15,KICKPTR(,DCKWKPTR)                              0253 00956000
*   END;                            /*                       @Y30LB54*/ 00957000
         LA    @15,1                                               0254 00958000
         AL    @15,CTR1(,DCKWKPTR)                                 0254 00959000
         ST    @15,CTR1(,DCKWKPTR)                                 0254 00960000
         CH    @15,@CH00046                                        0254 00961000
         BNH   @DL00236                                            0254 00962000
*   CALL ISDAPRT0(WORKPTR);         /*                       @Y30LB54*/ 00963000
         L     @15,@PC00001                                        0255 00964000
         ST    @15,@AL00001                                        0255 00965000
         L     @15,@CV00042                                        0255 00966000
         LA    @01,@AL00001                                        0255 00967000
         BALR  @14,@15                                             0255 00968000
*   END RPT9DATA;                   /*                       @Y30LB54*/ 00969000
@EL00006 DS    0H                                                  0256 00970000
@EF00006 DS    0H                                                  0256 00971000
@ER00006 LM    @14,@12,@SA00006                                    0256 00972000
         BR    @14                                                 0256 00973000
*                                                                  0257 00974000
*   /*****************************************************************/ 00975000
*   /*                                                               */ 00976000
*   /* FREE ALL OUTSTANDING CORE                                     */ 00977000
*   /*                                                               */ 00978000
*   /*****************************************************************/ 00979000
*                                                                  0257 00980000
*FREECORE:                                                         0257 00981000
*   PROC;                                                  /*@Y30LB54*/ 00982000
FREECORE STM   @14,@12,@SA00007                                    0257 00983000
*   DO CTR1=1 TO 4 BY 1;            /*                       @Y30LB54*/ 00984000
         LA    @15,1                                               0258 00985000
         ST    @15,CTR1(,DCKWKPTR)                                 0258 00986000
@DL00258 DS    0H                                                  0259 00987000
*     IF LIBPTR(CTR1)^=0 THEN       /* FREE ALL CORE ALREADY OBTAINED   00988000
*                                                            @Y30LB54*/ 00989000
         L     @15,CTR1(,DCKWKPTR)                                 0259 00990000
         SLA   @15,2                                               0259 00991000
         L     @15,LIBPTR-5(@15,DCKWKPTR)                          0259 00992000
         LA    @15,0(,@15)                                         0259 00993000
         LTR   @15,@15                                             0259 00994000
         BZ    @RF00259                                            0259 00995000
*       DO;                         /*                       @Y30LB54*/ 00996000
*         SPNO=0;                   /*                       @Y30LB54*/ 00997000
         MVI   SPNO(CVTPTR),X'00'                                  0261 00998000
*         CORELEN=512+1024;         /* FILL IN LENGTH OF AREA@Y30LB54*/ 00999000
         MVC   CORELEN(3,CVTPTR),@CF00507+1                        0262 01000000
*         COREADDR=LIBPTR(CTR1);    /* FILL IN ADDRESS OF AREA     0263 01001000
*                                                            @Y30LB54*/ 01002000
         ST    @15,COREADDR(,CVTPTR)                               0263 01003000
*         CALL ISDAFREE(WORKPTR);   /*                       @Y30LB54*/ 01004000
         L     @15,@PC00001                                        0264 01005000
         ST    @15,@AL00001                                        0264 01006000
         L     @15,@CV00041                                        0264 01007000
         LA    @01,@AL00001                                        0264 01008000
         BALR  @14,@15                                             0264 01009000
*         LIBPTR(CTR1)=0;           /* DELETE GOTTEN CORE PTR@Y30LB54*/ 01010000
         L     @15,CTR1(,DCKWKPTR)                                 0265 01011000
         SLA   @15,2                                               0265 01012000
         ALR   @15,DCKWKPTR                                        0265 01013000
         SLR   @14,@14                                             0265 01014000
         STCM  @14,7,LIBPTR-4(@15)                                 0265 01015000
*       END;                        /*                       @Y30LB54*/ 01016000
*     ELSE                                                         0267 01017000
*       ;                           /*                       @Y30LB54*/ 01018000
@RF00259 DS    0H                                                  0268 01019000
*   END;                            /*                       @Y30LB54*/ 01020000
         LA    @15,1                                               0268 01021000
         AL    @15,CTR1(,DCKWKPTR)                                 0268 01022000
         ST    @15,CTR1(,DCKWKPTR)                                 0268 01023000
         CH    @15,@CH00051                                        0268 01024000
         BNH   @DL00258                                            0268 01025000
*   SPNO=0;                         /* FREE WORKING CORE ALSO@Y30LB54*/ 01026000
         MVI   SPNO(CVTPTR),X'00'                                  0269 01027000
*   CORELEN=LENGTH(WORKCORE);       /* FILL IN LENGTH OF AREA@Y30LB54*/ 01028000
         MVC   CORELEN(3,CVTPTR),@CF00508+1                        0270 01029000
*   COREADDR=DCK00PTR;              /* FILL IN LOCATION ADDRESS    0271 01030000
*                                                            @Y30LB54*/ 01031000
         MVC   COREADDR(4,CVTPTR),DCK00PTR(CVTPTR)                 0271 01032000
*   CALL ISDAFREE(WORKPTR);         /*                       @Y30LB54*/ 01033000
         L     @03,@PC00001                                        0272 01034000
         ST    @03,@AL00001                                        0272 01035000
         L     @15,@CV00041                                        0272 01036000
         LA    @01,@AL00001                                        0272 01037000
         BALR  @14,@15                                             0272 01038000
*   DCK00PTR=0;                     /* TELL THE WORLD WE QUIT@Y30LB54*/ 01039000
         SLR   @03,@03                                             0273 01040000
         ST    @03,DCK00PTR(,CVTPTR)                               0273 01041000
*   END FREECORE;                                          /*@Y30LB54*/ 01042000
@EL00007 DS    0H                                                  0274 01043000
@EF00007 DS    0H                                                  0274 01044000
@ER00007 LM    @14,@12,@SA00007                                    0274 01045000
         BR    @14                                                 0274 01046000
*   END ISDADCK1                    /*                       @Y30LB54*/ 01047000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 01048000
*/*%INCLUDE SYSLIB  (ISDAPRMS)                                        * 01049000
*/*%INCLUDE SYSLIB  (ISDACVT )                                        * 01050000
*;                                                                 0275 01051000
@DATA    DS    0H                                                       01052000
@CH00046 DC    H'2'                                                     01053000
@CH00051 DC    H'4'                                                     01054000
@CH00141 DC    H'6'                                                     01055000
@CH00071 DC    H'8'                                                     01056000
@CH00336 DC    H'13'                                                    01057000
@CH00355 DC    H'17'                                                    01058000
@CH00349 DC    H'27'                                                    01059000
@CH00466 DC    H'58'                                                    01060000
@CH00330 DC    H'76'                                                    01061000
@CH00468 DC    H'120'                                                   01062000
@CH00448 DC    H'512'                                                   01063000
@DATD    DSECT                                                          01064000
         DS    0F                                                       01065000
@SA00001 DS    18F                                                      01066000
@PC00001 DS    1F                                                       01067000
@SA00007 DS    0F                                                       01068000
@SA00006 DS    0F                                                       01069000
@SA00005 DS    0F                                                       01070000
@SA00004 DS    0F                                                       01071000
@SA00003 DS    0F                                                       01072000
@SA00002 DS    0F                                                       01073000
         DS    15F                                                      01074000
@AL00001 DS    1A                                                       01075000
@TF00001 DS    F                                                        01076000
ISDADCK1 CSECT                                                          01077000
         DS    0F                                                       01078000
@CF00048 DC    F'1'                                                     01079000
@CF00491 DC    F'9'                                                     01080000
@CF00040 DC    F'31'                                                    01081000
@CH00040 EQU   @CF00040+2                                               01082000
@CF00508 DC    F'149'                                                   01083000
@CF00507 DC    F'1536'                                                  01084000
@CF00509 DC    F'-27'                                                   01085000
@CF00510 DC    F'-2'                                                    01086000
@DATD    DSECT                                                          01087000
         DS    0D                                                       01088000
         DS    0D                                                       01089000
@TS00001 DS    CL8                                                      01090000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01091000
@ENDDATD EQU   *                                                        01092000
ISDADCK1 CSECT                                                          01093000
         NOPR  ((@ENDDATD-@DATD)/161*16)                                01094000
         DS    0F                                                       01095000
@SIZDATD DC    AL1(0)                                                   01096000
         DC    AL3(@ENDDATD-@DATD)                                      01097000
@CV00041 DC    V(ISDAFREE)                                              01098000
@CV00042 DC    V(ISDAPRT0)                                              01099000
         DS    0D                                                       01100000
@CC00456 DC    C' |PGM  |  200|  201|  202|  203|  204|  205|  206|  20C01101000
               7|TOTAL|'                                                01102000
@CC00469 DC    C' |-----|-----|-----|-----|-----|-----|-----|-----|----C01103000
               -|-----|'                                                01104000
@CC00461 DC    C'|PGM  |  200|  201|  202|  203|  204|  205|  206|  207C01105000
               |TOTAL|'                                                 01106000
@CC00474 DC    C'|-----|-----|-----|-----|-----|-----|-----|-----|-----C01107000
               |-----|'                                                 01108000
@CC00484 DC    C'|     |     |     |     |     |     |     |     |     C01109000
               |     |'                                                 01110000
@CC00250 EQU   @CC00474                                                 01111000
@CC00325 DC    C'|  200|  201|  202|  203|  204|  205|  206|  207|TOTALC01112000
               |'                                                       01113000
@CC00345 EQU   @CC00484                                                 01114000
@CC00442 DC    C'REPORT 9 - DRD INDEX PGM AND THREAD PGM COUNTER SUMMARC01115000
               Y'                                                       01116000
@CC00282 DC    C' U = NORMAL INDEXER PROGRAM STEP AT END OF UNLOAD'     01117000
@CC00287 DC    C'U = NORMAL THREAD PROGRAM STEP AT END OF UNLOAD'       01118000
@CC00291 DC    C' L = NORMAL INDEXER PROGRAM STEP AT END OF LOAD'       01119000
@CC00296 DC    C'L = NORMAL THREAD PROGRAM STEP AT END OF LOAD'         01120000
@CC00267 DC    C'------------------------------------------'            01121000
@CC00256 DC    C' ----------------------------------------'             01122000
@CC00262 DC    C'---------------------    ---------------'              01123000
@CC00315 DC    C'(DATA FROM MSS FORMAT 4, SA FORMAT 9)'                 01124000
@CC00274 DC    C' INDEX PGM IS MSS BYTE 22(BITS 0-4)'                   01125000
@CC00279 DC    C'THREAD PGM IS MSS BYTE 31(BITS 0-4)'                   01126000
@CC00310 DC    C'REPORT 8 - DRD DEVICE CHECK SUMMARY'                   01127000
@CC00246 DC    C'|-----------------------------'                        01128000
@CC00449 DC    C'  INDEX             DRD SSID'                          01129000
@CC00350 DC    C'|SA SENSE BYTE 0 MSS BYTE 4'                           01130000
@CC00453 DC    C' THREAD            DRD SSID'                           01131000
@CC00343 DC    C'|              '                                       01132000
@CC00323 EQU   @CC00343                                                 01133000
@CC00353 DC    C'DRD SENSE BYTE'                                        01134000
@CC00322 DC    C'DRD SSID'                                              01135000
@CC00155 DC    C'00000'                                                 01136000
@CC00163 DC    C'10011'                                                 01137000
@CC00165 DC    C'11100'                                                 01138000
@CC00168 DC    C'10001'                                                 01139000
@CC00273 EQU   @CC00267                                                 01140000
@CC00149 DC    C'TLX'                                                   01141000
@CC00308 DC    C'MSF'                                                   01142000
@CC00482 EQU   @CC00456                                                 01143000
EDPAT    DC    X'4020202020202120'                                      01144000
BITHDR8  DS    CL864                                                    01145000
         ORG   BITHDR8                                                  01146000
BIT80    DC    CL27'BIT 0 COMMAND REJECT'                               01147000
         DC    CL27'BIT 1 INTERVENTION REQUIRED'                        01148000
         DC    CL27'BIT 2 BUS OUT PARITY'                               01149000
         DC    CL27'BIT 3 EQUIPMENT CHECK'                              01150000
         DC    CL27'BIT 4 DATA CHECK'                                   01151000
         DC    CL27'BIT 5 OVERRUN (NOT USED)'                           01152000
         DC    CL27'BIT 6 NOT USED'                                     01153000
         DC    CL27'BIT 7 ENVIRONMENTAL DATA'                           01154000
BIT8A    DC    CL27'BIT 0 ERROR TIMEOUT'                                01155000
         DC    CL27'BIT 1 SERVO CHECK'                                  01156000
         DC    CL27'BIT 2 CABLE CHECK'                                  01157000
         DC    CL27'BIT 3 WRITE DISABLE'                                01158000
         DC    CL27'BIT 4 OV/UV CHECK'                                  01159000
         DC    CL27'BIT 5 VACUUM CHECK'                                 01160000
         DC    CL27'BIT 6 PNEUMATIC CHECK'                              01161000
         DC    CL27'BIT 7 WRITE DRIVER CHECK'                           01162000
BIT8B    DC    CL27'BIT 0 CARTRIDGE ENTRY'                              01163000
         DC    CL27'BIT 1 CARTRIDGE EXIT'                               01164000
         DC    CL27'BIT 2 SEARCH CHECK'                                 01165000
         DC    CL27'BIT 3 INDEXER CHECK'                                01166000
         DC    CL27'BIT 4 THREAD/LOAD CHECK'                            01167000
         DC    CL27'BIT 5 UNLOAD CHECK'                                 01168000
         DC    CL27'BIT 6 B/O PARITY CHECK'                             01169000
         DC    CL27'BIT 7 TAG BUS PARITY CHECK'                         01170000
BIT8C    DC    CL27'BIT 0 NOT USED'                                     01171000
         DC    CL27'BIT 1 SPOOL OVERCURRENT'                            01172000
         DC    CL27'BIT 2 SPOOL RUNAWAY/TACH'                           01173000
         DC    CL27'BIT 3 DGC CHECK'                                    01174000
         DC    CL27'BIT 4 ROTOR/TACH CHECK'                             01175000
         DC    CL27'BIT 5 IHC/LIFTER CHECK'                             01176000
         DC    CL27'BIT 6 CAPSTAN CURRENT/TACH'                         01177000
         DC    CL27'BIT 7 CAPSTAN RUNAWAY/TACH'                         01178000
         ORG   BITHDR8+864                                              01179000
PATCH    DC    50X'00'                                                  01180000
HEXREP   DC    CL1'0'                                                   01181000
         DC    CL1'1'                                                   01182000
         DC    CL1'2'                                                   01183000
         DC    CL1'3'                                                   01184000
         DC    CL1'4'                                                   01185000
         DC    CL1'5'                                                   01186000
         DC    CL1'6'                                                   01187000
         DC    CL1'7'                                                   01188000
         DC    CL1'8'                                                   01189000
         DC    CL1'9'                                                   01190000
         DC    CL1'A'                                                   01191000
         DC    CL1'B'                                                   01192000
         DC    CL1'C'                                                   01193000
         DC    CL1'D'                                                   01194000
         DC    CL1'E'                                                   01195000
         DC    CL1'F'                                                   01196000
BYTEHDR8 DS    CL13                                                     01197000
         ORG   BYTEHDR8+0                                               01198000
@NM00003 DC    CL13'1 MSS BYTE 18'                                      01199000
         ORG   BYTEHDR8+13                                              01200000
         ORG   BYTEHDR8+13                                              01201000
         DC    CL13'2 MSS BYTE 19'                                      01202000
         ORG   BYTEHDR8+26                                              01203000
         ORG   BYTEHDR8+26                                              01204000
         DC    CL13'3 MSS BYTE 20'                                      01205000
         ORG   BYTEHDR8+52                                              01206000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01207000
@01      EQU   01                                                       01208000
@02      EQU   02                                                       01209000
@03      EQU   03                                                       01210000
@04      EQU   04                                                       01211000
@05      EQU   05                                                       01212000
@06      EQU   06                                                       01213000
@07      EQU   07                                                       01214000
@08      EQU   08                                                       01215000
@09      EQU   09                                                       01216000
@10      EQU   10                                                       01217000
@11      EQU   11                                                       01218000
@12      EQU   12                                                       01219000
@13      EQU   13                                                       01220000
@14      EQU   14                                                       01221000
@15      EQU   15                                                       01222000
DCKWKPTR EQU   @03                                                      01223000
RETCODE  EQU   @04                                                      01224000
LPARMPTR EQU   @05                                                      01225000
CVTPTR   EQU   @02                                                      01226000
R0       EQU   @00                                                      01227000
R1       EQU   @00                                                      01228000
R15      EQU   @15                                                      01229000
ISDAPRMS EQU   0                                                        01230000
CINPUT   EQU   ISDAPRMS                                                 01231000
CSTART   EQU   ISDAPRMS+2                                               01232000
CEND     EQU   ISDAPRMS+6                                               01233000
CFSCONLY EQU   ISDAPRMS+13                                              01234000
CSSIDF   EQU   ISDAPRMS+17                                              01235000
CSERIAL  EQU   ISDAPRMS+21                                              01236000
CREPORTS EQU   ISDAPRMS+33                                              01237000
CDCKTLX  EQU   CREPORTS+6                                               01238000
ISDACVT  EQU   0                                                        01239000
CVTPTRS0 EQU   ISDACVT                                                  01240000
PARMPTR  EQU   CVTPTRS0+8                                               01241000
DCK00PTR EQU   CVTPTRS0+64                                              01242000
GET0CALL EQU   ISDACVT+100                                              01243000
SPNOLEN  EQU   GET0CALL                                                 01244000
SPNO     EQU   SPNOLEN                                                  01245000
CORELEN  EQU   SPNOLEN+1                                                01246000
COREADDR EQU   GET0CALL+4                                               01247000
HEXPCALL EQU   ISDACVT+108                                              01248000
PRT0CALL EQU   ISDACVT+120                                              01249000
OUTLINE  EQU   PRT0CALL                                                 01250000
ANSI     EQU   OUTLINE                                                  01251000
LINE     EQU   OUTLINE+1                                                01252000
SDARPTID EQU   PRT0CALL+133                                             01253000
SDADATD  EQU   ISDACVT+256                                              01254000
PRTDATD  EQU   ISDACVT+416                                              01255000
COUNTER  EQU   0                                                        01256000
WORKCORE EQU   0                                                        01257000
LIBTAB   EQU   WORKCORE+4                                               01258000
LIBNO    EQU   LIBTAB                                                   01259000
LIBPTR   EQU   LIBTAB+1                                                 01260000
FULLWD1  EQU   WORKCORE+20                                              01261000
KICKPTR  EQU   WORKCORE+32                                              01262000
CTR      EQU   WORKCORE+52                                              01263000
CTR1     EQU   WORKCORE+56                                              01264000
CHAR4    EQU   WORKCORE+60                                              01265000
COUNTRP8 EQU   WORKCORE+64                                              01266000
COUNTRP9 EQU   WORKCORE+68                                              01267000
LIBCTR   EQU   WORKCORE+72                                              01268000
BYTECTR  EQU   WORKCORE+76                                              01269000
BITCTR   EQU   WORKCORE+80                                              01270000
BITHDCTR EQU   WORKCORE+84                                              01271000
TEMPPTR  EQU   WORKCORE+88                                              01272000
VALCTR   EQU   WORKCORE+92                                              01273000
B8HDR    EQU   WORKCORE+96                                              01274000
TOTFINL  EQU   WORKCORE+112                                             01275000
TOTROW   EQU   WORKCORE+128                                             01276000
TOTGRND  EQU   WORKCORE+130                                             01277000
FOURBITS EQU   WORKCORE+132                                             01278000
FIVEBITS EQU   FOURBITS                                                 01279000
EDREC    EQU   WORKCORE+140                                             01280000
BIT8HDR  EQU   0                                                        01281000
WORKPTR  EQU   0                                                        01282000
INDEXPGM EQU   LINE+2                                                   01283000
THREDPGM EQU   LINE+67                                                  01284000
ULI      EQU   LINE                                                     01285000
ULT      EQU   LINE+65                                                  01286000
*                                      START UNREFERENCED COMPONENTS    01287000
ENDAREA  EQU   WORKCORE+148                                             01288000
DATAWORK EQU   WORKCORE+139                                             01289000
DATA09   EQU   WORKCORE+137                                             01290000
DATA08   EQU   WORKCORE+133                                             01291000
PTRBYTE  EQU   WORKCORE+48                                              01292000
PTRSSID  EQU   WORKCORE+44                                              01293000
PTRLIB   EQU   WORKCORE+40                                              01294000
PTRRPT   EQU   WORKCORE+36                                              01295000
DATALIB  EQU   WORKCORE+28                                              01296000
DATASSID EQU   WORKCORE+24                                              01297000
LOGPTR   EQU   WORKCORE                                                 01298000
COUNT    EQU   COUNTER                                                  01299000
PRTSA001 EQU   PRTDATD                                                  01300000
SDATEMPS EQU   SDADATD+136                                              01301000
SDASA002 EQU   SDADATD+76                                               01302000
SDAPC001 EQU   SDADATD+72                                               01303000
SDASA001 EQU   SDADATD                                                  01304000
DUMPIDNO EQU   HEXPCALL+8                                               01305000
DUMPLEN  EQU   HEXPCALL+4                                               01306000
DUMPADDR EQU   HEXPCALL                                                 01307000
WORKCALL EQU   CVTPTRS0+96                                              01308000
GEN00PTR EQU   CVTPTRS0+92                                              01309000
CNFG0PTR EQU   CVTPTRS0+88                                              01310000
PWR00PTR EQU   CVTPTRS0+84                                              01311000
APR00PTR EQU   CVTPTRS0+80                                              01312000
DRC00PTR EQU   CVTPTRS0+76                                              01313000
DAT00PTR EQU   CVTPTRS0+72                                              01314000
CSB00PTR EQU   CVTPTRS0+68                                              01315000
EQC00PTR EQU   CVTPTRS0+60                                              01316000
FSC00PTR EQU   CVTPTRS0+56                                              01317000
DHE00PTR EQU   CVTPTRS0+52                                              01318000
SUM00PTR EQU   CVTPTRS0+48                                              01319000
PAD00PTR EQU   CVTPTRS0+44                                              01320000
DCS00PTR EQU   CVTPTRS0+40                                              01321000
LOG00PTR EQU   CVTPTRS0+36                                              01322000
HIST0PTR EQU   CVTPTRS0+32                                              01323000
PRT00PTR EQU   CVTPTRS0+28                                              01324000
GET00PTR EQU   CVTPTRS0+24                                              01325000
TYPE0PTR EQU   CVTPTRS0+20                                              01326000
PARM0PTR EQU   CVTPTRS0+16                                              01327000
SDA00PTR EQU   CVTPTRS0+12                                              01328000
SDATAPTR EQU   CVTPTRS0+4                                               01329000
DATAPTR  EQU   CVTPTRS0                                                 01330000
CTRACE   EQU   ISDAPRMS+48                                              01331000
CGEN     EQU   ISDAPRMS+47                                              01332000
CDETAIL  EQU   ISDAPRMS+46                                              01333000
CPERIOD  EQU   ISDAPRMS+45                                              01334000
CPWR     EQU   CREPORTS+11                                              01335000
CAPRSUU  EQU   CREPORTS+10                                              01336000
CDRC     EQU   CREPORTS+9                                               01337000
CDAT     EQU   CREPORTS+8                                               01338000
CCSBCSF  EQU   CREPORTS+7                                               01339000
CEQC     EQU   CREPORTS+5                                               01340000
CFSC     EQU   CREPORTS+4                                               01341000
CDHEDHU  EQU   CREPORTS+3                                               01342000
CSUM     EQU   CREPORTS+2                                               01343000
CPAD     EQU   CREPORTS+1                                               01344000
CDCS     EQU   CREPORTS                                                 01345000
CSERNO   EQU   CSERIAL+4                                                01346000
@NM00002 EQU   CSERIAL+3                                                01347000
CIBM     EQU   CSERIAL                                                  01348000
CRATIO   EQU   ISDAPRMS+19                                              01349000
CSSID    EQU   CSSIDF                                                   01350000
@NM00001 EQU   CSSIDF                                                   01351000
CFSC34   EQU   CFSCONLY+2                                               01352000
CFSC12   EQU   CFSCONLY                                                 01353000
CTYPE    EQU   ISDAPRMS+11                                              01354000
CSUMMARY EQU   ISDAPRMS+10                                              01355000
CENDDAY  EQU   CEND+2                                                   01356000
CENDYEAR EQU   CEND                                                     01357000
CSTDAY   EQU   CSTART+2                                                 01358000
CSTYEAR  EQU   CSTART                                                   01359000
CHISTIN  EQU   CINPUT+1                                                 01360000
CLOGIN   EQU   CINPUT                                                   01361000
*                                      END UNREFERENCED COMPONENTS      01362000
@ENDDATA EQU   *                                                        01363000
         END   ISDADCK1,(C'PLS2103',0603,75267)                         01364000
