*        %GOTO BSLSCB;                                               /* 00200022
         MACRO                                                          00400020
         TSCBD                                                          00800020
.*A 000000-999999                                              @X02X5X0 00802010
.*A384000                                                       SA53606 00805010
.*A452000                                                        S21101 00810020
.*C012000                                                        S21101 00820020
.*D460000                                                        S21101 00830020
.*A140000                                                        A42363 01000021
.*D168000                                                        S22026 01030022
.*C028000,108000,112000                                          S22026 01060022
.*A078000,110000,114000,130000,143500,158000,287000,434000       S22026 01090022
.*A442000,450000,474000,498000,524800-527200                     S22026 01120022
.*A552400-555600                                                 S22026 01150022
.*A056000                                                        A44887 01200021
.*C616000,864100                                                SA67142 01300054
.*A204000,825100                                               @OY13632 01320010
.*A160000,865000                                                 X03039 01350010
.*A624000,865000                                               @Y17XAXF 01370010
.*       UPDATED 11/5/74                                       @X02X5XE 01400010
.*       BILINGUAL CONVERSION OF THE SCB DSECT WAS DONE FOR      S22024 01470022
IEDQSCB  DSECT                                                          01600020
         SPACE                                                          02000020
SCBSTATE DS    XL1 .                    STATUS BITS                     02400020
*                        BIT DEFINITIONS                                02800022
SCBTRANP EQU   X'80' .                  MESSAGE IN TRANSPARENT MODE     03200020
SCBMGFMN EQU   X'40' .                  MSGFORM REQUESTED               03600020
SCBMGFMF EQU   X'BF' .                  MSGFORM NOT REQUESTED           04000020
SCBSEQIN EQU   X'40' .                  SEQUENCE IN HAS BEEN EXECUTED   04400020
*                                       CURRENT MESSAGE                 04800020
SCBLCK1N EQU   X'20' .                  FIRST LOCK BIT                  05200020
SCBLCK1F EQU   X'DF' .                  MSG NOT BEING RCVD IN LOCK      05600020
SCBERSDS EQU   X'10' .                  SCREEN ERASURE REQUESTED A44887 05800021
SCBMSGLN EQU   X'08' .                  MESSAGE LOCK                    06000020
SCBMSGLF EQU   X'F7' .                  EXTENDED LOCK                   06400020
SCBCKPT  EQU   X'04' .                  CHECKPOINT REQUESTED            06800020
SCBPRER  EQU   X'02' .                  PREVIOUS EOB/ETB ERROR          07200020
SCBCODE  EQU   X'01' .                  TRANSLATION REQUESTED           07600020
*                                                                       07800022
SCBDESTQ DS    AL3 .                    POINTER TO DESTINATION QCB      08000020
SCBSNDCT DS    0XL1 .                   MSGLIMIT ON THE SEND SIDE       08400020
SCBRCVCT DS    XL1 .                    MSGLIMIT ON THE RECEIVE SIDE    08800020
SCBMACR  DS    0AL3 .                   FIRST/NEXT IN/OUTMSG MACRO TO   09200020
*                                       BE EXECUTED                     09600020
SCBMBHEN DS    AL3 .                    ADDR MULT BFR HDR ENTRY         10000020
SCBPRI   DS    XL1 .                    PRIORITY INDEX TO QCB           10400020
SCBBKFCT DS    0XL3 .                   CNT OF MSG LNTH FOR BRK  S22026 10800022
         DS    XL1 .                                             S22026 11000022
SCBEOBSZ DS    0H .                     SIZE OF LOGICAL BLOCKS   S22026 11200022
SCBCTBSZ DS    H .                      SIZE OF CTB              S22026 11400022
SCBSALEV DS    0XL1 .                   SIMULATED ATTN LEVEL REQ    TSO 11600020
SCBQTYPE DS    XL1 .                                                    12000020
*                                       THIS MESSAGE HAS BEEN           12400020
*                                       QUEUED ON                       12800020
*                        BIT DEFINITIONS                                13000022
SCBNREUS EQU   X'10' .                  NON-REUSEABLE DISK QUEUES       13200020
SCBREUS  EQU   X'20' .                  REUSEABLE DISK QUEUES           13600020
SCBCOREQ EQU   X'40' .                  CORE QUEUES                     14000020
SCBNORCL EQU   X'80' .                  A RECALL FROM BD HAS     A42363 14060021
*                                       FAILED TO GET A BUFFER   A42363 14120021
*                                       BECAUSE THE MESSAGE HAD  A42363 14180021
*                                       ALREADY BEEN REMOVED FROMA42363 14240021
*                                       THE CORE QUEUE           A42363 14300021
SCBCONC  EQU   X'08' .                  CONC SCB                 S22026 14350022
SCBNOFF  EQU   X'04' .                  REUS HAS UPDATED SCBFEFO        14400020
SCBBBFTM EQU   X'02' .                  BUFFERRED TERMINAL SCB          14800020
SCBBFMM  EQU   X'01' .                  BUFFERRED TERMINAL IN MIDDLE    15200020
*                                       OF MESSAGE                      15600020
*                                                                       15800022
SCBMRFPL DS    AL3 .                    ADDR OF FORWARD PARAMETER LIST  16000020
SCBRNNME DS    0CL8 .                   NAME OF THE NCP          X03039 16200010
SCBERRST DS    0F .                     ERROR WORD BITS                 16400020
SCBERR1  DS    XL1 .                    FIRST BYTE                      17200020
*                        BIT DEFINITIONS                                17600020
SCBHDRRN EQU   X'80' .                  INCOMPLETE HEADER               18000020
SCBHDRRF EQU   X'7F' .                  NOT INCOMPLETE HEADER           18400020
SCBNOLOG EQU   SCBHDRRN .               INVALID LOGON MESSAGE       TSO 18800020
SCBORIGN EQU   X'40' .                  INVALID ORIGIN ON               19200020
SCBORIGF EQU   X'BF' .                  ORIGIN IS VALID                 19600020
SCBHANG  EQU   SCBORIGN .               LOGON REQUESTS HANGUP MSG   TSO 20000020
SCBNOTRM EQU   X'20' .                  NOT A TSO TERMINAL          TSO 20400020
SCBRVITX EQU   X'20'                    RVI TO TEXT RECEIVED   @OY13632 20600010
SCBSEQHN EQU   X'10' .                  SEQUENCE HIGH ON                20800020
SCBSEQHF EQU   X'EF' .                  SEQUENCE NOT HIGH               21200020
SCBNOTSO EQU   SCBSEQHN .               TSO NOT IN SYSTEM           TSO 21600020
SCBSEQLN EQU   X'08' .                  SEQUENCE LOW ON                 22000020
SCBSEQLF EQU   X'F7' .                  SEQUENCE NOT LOW                22400020
SCBNOVAC EQU   SCBSEQLN .               TOO MANY TSO USERS          TSO 22800020
SCBNOBFN EQU   X'02' .                  INSUFFICIENT BUFFERS            23600020
SCBCUTFN EQU   X'01' .                  CUTOFF ERROR                    24000020
SCBCUTFF EQU   X'FE' .                  NO CUTOFF ERROR                 24400020
SCBRVISL EQU   SCBCUTFN .               RVI TO SEL BUFRD TERM           24800020
*                                                                       25200020
SCBERR2  DS    XL1 .                    SECOND BYTE                     25600020
*                        BIT DEFINITIONS                                26000020
SCBCRMIN EQU   X'80' .                  CORE MINIMUM PASSED             26400020
SCBCRMAX EQU   X'40' .                  CORE MAXIMUM PASSED             26800020
SCBCODER EQU   X'20' .                  ERROR IN DYNAMIC TRANSLATE TSO  27200020
SCBALN   EQU   X'10' .                  AUTOMATIC LINE NUMBERING    TSO 27600020
SCBOLTR  EQU   X'08' .                  TOTE NOT IN SYSTEM              28000020
SCBABRTN EQU   X'04' .                  ABORT - BSC TERMINAL            28400020
SCBRRJN  EQU   X'04' .                  REQUEST REJECT - SNA     X03039 28500010
SCBFRWDN EQU   X'02' .                  'FORWARD' ERROR                 28600020
SCBSOHE  EQU   X'01' .                  SOH % E,C,R MESSAGE      S99238 28700022
*                                                                       28800020
SCBERR3  DS    XL1 .                    THIRD BYTE                      29200020
*                        BIT DEFINITIONS                                29600020
SCBLOSTN EQU   X'80' .                  MESSAGE LOST (OVERLAID)         30000020
SCBLOSTF EQU   X'7F' .                  MESSAGE PROCESSED               30400020
SCBXPI   EQU   SCBLOSTN .               ATTENTION - SEND !I         TSO 30800020
SCBTMIDN EQU   X'40' .                  ID FROM TERMINAL INVALID        31200020
SCBTMIDF EQU   X'BF' .                  TERMINAL IDENT OK               31600020
SCBXPD   EQU   SCBTMIDN .               ATTENTION - SEND !D         TSO 32000020
SCBTMINN EQU   X'20' .                  TERMINAL INOPERATIVE            32400020
SCBTMINF EQU   X'DF' .                  TERMINAL FUNCTIONAL             32800020
SCBSATTN EQU   X'10' .                  SIMULATED ATTENTION REC'VED TSO 33200020
SCBUSERN EQU   X'08' .                  USER ERROR ON                   33600020
SCBUSERF EQU   X'F7' .                  NO USER ERROR                   34000020
SCBFORMN EQU   X'04' .                  FORMAT ERROR-BSC MESSAGE        34400020
SCBFIERN EQU   X'04' .                  FUNCTION INTRP ERR - SNA X03039 34600010
SCBATTN  EQU   X'02' .                  HARDWARE ATTENTION          TSO 34800020
SCBTHRSN EQU   X'02' .                  THRESH REACHED ON CORE Q S22025 35000000
SCBXCEPN EQU   X'01' .                  UNIT EXCEPTION                  35200020
SCBXCEPF EQU   X'FE' .                  NO UNIT EXCEPTION               35600020
SCBPERRN EQU   X'01' .                  PATH ERROR - SNA         X03039 35800010
*                                                                       36000020
SCBERR4  DS    XL1 .                    FOURTH BYTE                     36400020
*                        BIT DEFINITIONS                                36800020
SCBSLCTN EQU   X'80' .                  ERROR DURING SELECTION          37200020
SCBSLCTF EQU   X'7F' .                  NO SELECTION ERROR              37600020
SCBTXTTN EQU   X'40' .                  ERROR DURING TEXT TRANSFER      38000020
SCBTXTTF EQU   X'BF' .                  NO TEXT TRANSFER ERROR          38400020
SCBAPERR EQU   X'40' .                  SET BY IGG02046 IF      SA53606 38480022
*                                       PARTIAL MESSAGE IS SENT SA53606 38560022
*                                       TO MH BY ABENDING       SA53606 38640022
*                                       APPLICATION PROGRAM     SA53606 38720022
SCBCONNN EQU   X'20' .                  ERROR IN CONNECT/DISCONNECT     38800020
SCBCONNF EQU   X'DF' .                  NO CONNECT/DISCONNECT ERROR     39200020
SCBTRMLN EQU   X'10' .                  TERMINAL ERROR                  39600020
SCBTRMLF EQU   X'EF' .                  NOT TERMINAL ERROR              40000020
SCBCTLUN EQU   X'04' .                  ERROR IN CONTROL UNIT           41200020
SCBCTLUF EQU   X'FB' .                  NO CONTROL UNIT ERROR           41600020
SCBCPMEN EQU   X'04' .                  CPM ERROR - SNA          X03039 41800010
SCBCHANN EQU   X'02' .                  ERROR IN CHANNEL                42000020
SCBCHANF EQU   X'FD' .                  NO CHANNEL ERROR                42400020
SCBSTERN EQU   X'02' .                  STATE ERROR - SNA        X03039 42600010
SCBUNDFN EQU   X'01' .                  UNDEFINED ERROR                 42800020
SCBUNDFF EQU   X'FE' .                  NO UNDEFINED ERROR              43200020
*                                                                       43400022
SCBMRFSD DS    H .                      MULT RT FIRST SECNDRY DEST      43600020
SCBEOBAC DS    0H .                     ACCUM COUNT BETWEEN BLOCKS      44000020
SCBCTBAC DS    0H .                     COUNT OF DATA INSERTED   S22026 44200022
SCBDLPTR DS    0H .                     DISTRUBUTION LIST PTR    S22025 44400000
SCBCRLEN DS    XL1 .                    LENGTH OF CHAR STRING    S22025 44500000
SCBENDCR DS    XL1 .                    ITB CHAR SPECIFIED       S22025 44600000
SCBBSCFM DS    XL1 .                    MSGFORM DYNAMIC BLK CHANGES     44800020
*                        BIT DEFINITIONS                                45000022
SCBTRNSP EQU   X'80' .                  RECEIVEING TRANSPARENT          45200020
SCBNONTR EQU   X'40' .                  RECEIVEING NON-TRANSPARENT      45250020
SCBRCVTX EQU   X'20' .                  ETX RECEVIED FROM BSC           45600020
SCBCNTEN EQU   X'10' .                  FOR SCHEDULER TO DETERMINS21101 46000020
*                                         NEXT OPERATION         S21101 46050020
SCBDATEN EQU   X'08' .                  AUTO DATE/TIME EXECUTED  S22065 46120022
*                                       INPUT ONLY               S99238 46190022
SCBNPDTR EQU   X'08' .                  NO PADDING TRANSPARENT   S99238 46260022
*                                       OUTPUT ONLY              S99238 46330022
SCBNOEOT EQU   X'02' .                  BSC DIAL NO EOT BEFORE READ     46400020
SCBMLMTN EQU   X'01' .                  MSGLIMIT HAS BEEN EXCEEDED      46800020
SCBMLMTF EQU   X'FE' .                  MSGLIMIT NOT EXCEEDED           47200020
*                                                                       47400022
SCBMBSSA DS    XL7 .                    MULT BFR SCAN SAVE AREA         47600020
SCBCPBNO DS    XL1 .                    NUMBER OF NEXT SEQUENTIAL CPB   48000020
*                                       TO BE READ FROM DISK            48400020
SCBDCHDR DS    AL3 .                    DISK ADDR CURRENT HEADER        48800020
SCBDESTL DS    XL1 .                    LENGTH OF DESTINATION NAMES     49200020
SCBCCHDR DS    AL3 .                    CORE ADDR CURRENT HEADER        49600020
SCBCTBSV DS    0XL1 .                   CTBFORM PARMS SAVED      S22026 49700022
SCBBCTR  DS    0XL1 .                   COUNTER OF BLKS REQ      S22025 49800000
SCBITBSZ DS    XL1 .                    SIZE OF LOGICAL SUBBLOCKS       50000020
SCBSCSEG DS    0AL3 .                   CURRENT SEGMENT BEING READ      50400020
SCBDNSEG DS    AL3 .                    DISK ADDR NEXT SEGMENT          50800020
*                                       FROM DISK TO SEND               51200020
SCBHBFNO DS    XL1 .                    NUMBER OF BUFFERS IN MULTI HDR  51600020
SCBSCHDR DS    0AL3 .                   CURRENT HEADER BEING SENT       52000020
SCBCLSEG DS    AL3 .                    CORE ADDR LAST MSG SEGMENT      52400020
SCBCTBFL DS    0XL1 .                   CONC FLAG BYTE           S22026 52440022
*                        BIT DEFINITIONS                         S22026 52480022
SCBCTBND EQU   X'80' .                  CTB END REACHED .        S22026 52520022
*                                                                S22026 52560022
SCBBLKCT DS    0XL1 .                   NO. OF BLKS REQUESTED    S22025 52600000
SCBITBAC DS    XL1 .                    ACCUM COUNT BETWEEN ITBS        52800020
SCBFEFO  DS    0AL3 .                   SAVED FEFO POINTER              53200020
SCBDCSEG DS    AL3 .                    DISK ADDR CURRENT SEGMENT       53600020
SCBDEOB  DS    F .                      DISK INFO ON LAST EOB           54000020
SCBSRCE  DS    H .                      MSG BFR SOURCE SAVED            54400020
SCBSIZE  DS    H .                      MSG BFR SIZE SAVED              54800020
SCBSTAT1 DS    XL1 .                    STATUS BYTE                     55200020
*                        BIT DEFINITIONS                         S22026 55240022
SCBCBGN  EQU   X'80' .                  CONC MSG BEGIN           S22026 55280022
SCBCEND  EQU   X'40' .                  CONC MSG END             S22026 55320022
SCBNIDLE EQU   X'20' .                  INDICATES THAT BUFFERS   S22026 55360022
*                                       ARE NOT TO BE HOOKED IN  S22026 55400022
*                                       IDLES LOOP YET           S22026 55440022
SCBNOPST EQU   X'10' .                  INDICATES THAT BUFFERS   S22026 55480022
*                                       SHOULD NOT BE POSTED     S22026 55520022
*                                                                S22026 55560022
SCBXTRA  DS    0AL3 .                   ADDR ADDL RCDS SAVED            55600020
SCBCORE  DS    AL3 .                    ADDR RCD IN CORE Q SAVED        56000020
SCBOSEQ  DS    0H .                     SEQUENCE OUT NUMBER             56400020
SCBSCAN  DS    H .                      SCAN POINTER                    56800020
SCBTQBCK DS    0XL3 .                   TEXT SEGMENT CHAIN SAVED        57200020
SCBNTXT  DS    AL3 .                    ADDR NEXT TEST SEG SAVED        57600020
SCBCRCD  DS    AL3 .                    ADDR CURR SEGMENT SAVED         58000020
SCBNHDR  DS    0AL3 .                   ADDR NEXT HDR SEG SAVED         58400020
SCBCHDR  DS    AL3 .                    ADDR CURR HDR SEG SAVED         58800020
SCBNXCPB DS    0AL1 .                   NEXT CPB NUMBER FROM DISK       59200020
*                                       IF ZERO - NO MULTIPLE ROUTING   59600020
SCBCCSEG DS    AL3 .                    CORE ADDR CURRENT SEGMENT       60000020
SCBEOB   DS    H .                      POINTER TO FIRST EOB SAVED      60400020
SCBUNTCT DS    AL1 .                    COUNT IN DISK RECORD OF FIRST   60800020
*                                       BYTE OF DATA                    61200020
SCBTRANS DS    AL3 .                    ADDR OF CODE MACRO      SA67142 61600054
*                                       PARAMETER LIST          SA67142 61800054
SCBRGSAV DS    0F .                     SAVE AREA FOR USER MH REGISTERS 62000020
*                                       IF SPECIFIED ON INTRO           62400020
SCBSCBL  EQU   *-IEDQSCB                LENGTH OF SCB          @Y17XAXF 62600010
*                                                                       62800020
*       *************************************************************   63200020
*   0   *     STATE    *                   DESTQ                    *   63600020
*       *************************************************************   64000020
*   4   *  SNDCT/RCVCT *                 MACR/MBHEN                 *   64400020
*       *************************************************************   64800020
*   8   *     PRI      *                   BKFCT                    *   65200020
*       *************************************************************   65600020
*  12   *     QTYPE    *                   MRFPL                    *   66000020
*       *************************************************************   66400020
*  16   *                           ERRST                           *   66800020
*       *************************************************************   67200020
*  20   *            MRFSD            *            DLPTR            *   67600020
*       *************************************************************   68000020
*  24   *     BSCFM    *                   MBSSA                    *   68400020
*       *************************************************************   68800020
*  28   *                           MBSSA                           *   69200020
*       *************************************************************   69600020
*  32   *     CPBNO    *                   DCHDR                    *   70000020
*       *************************************************************   70400020
*  36   *     DESTL    *                   CCHDR                    *   70800020
*       *************************************************************   71200020
*  40   *     ITBSZ    *                 SCSEG/DNSEG                *   71600020
*       *************************************************************   72000020
*  44   *     HBFNO    *                 SCHDR/CLSEG                *   72400020
*       *************************************************************   72800020
*  48   *     ITBAC    *                 FEFO/DCSEG                 *   73200020
*       *************************************************************   73600020
*  52   *                          DEOB                             *   74000020
*       *************************************************************   74400020
*  56   *            SRCE             *            SIZE             *   74800020
*       *************************************************************   75200020
*  60   *     STAT1    *                 XTRA/CORE                  *   75600020
*       *************************************************************   76000020
*  64   *         OSEQ/SCAN           *          NTXT/TQBCK         *   76400020
*       *************************************************************   76800020
*  68   *  NTXT/TQBCK  *                   CRCD                     *   77200020
*       *************************************************************   77600020
*  72   *                NHDR/CHDR                   *     CCSEG    *   78000020
*       *************************************************************   78400020
*  76   *            CCSEG            *             EOB             *   78800020
*       *************************************************************   79200020
*  80   *     UNTCT    *                   TRANS                    *   79600020
*       *************************************************************   80000020
*                                                                       80400020
         MEND  , */                                                     80800022
*%BSLSCB  :  ;                                                          80830022
*DECLARE                                                                80860022
*  1 IEDQSCB  BASED(IEDQSPTR),                                          80890022
*   2 SCBSTATE    CHAR(1),               /* STATUS BITS              */ 80920022
*    3 SCBTRANP    BIT(1),               /* MESSAGE IN TRANSPARENT      80950022
*                                           MODE                     */ 80980022
*    3 SCBSEQIN    BIT(1),               /* SEQUENCE IN HAS BEEN        81010022
*                                           EXECUTED CURRENT MESSAGE */ 81040022
*     4 SCBMGFMN    BIT(1),              /* MSGFORM REQUESTED        */ 81070022
*    3 SCBLCK1N    BIT(1),               /* FIRST LOCK BIT           */ 81100022
*    3 SCBERSDS    BIT(1),               /* SCREEN ERASURE REQ A44887*/ 81130022
*    3 SCBMSGLN    BIT(1),               /* MESSAGE LOCK             */ 81160022
*    3 SCBCKPT     BIT(1),               /* CHECKPOINT REQUESTED     */ 81190022
*    3 SCBPRER     BIT(1),               /* PREVIOUS EOB/ETB ERROR   */ 81220022
*    3 SCBCODE     BIT(1),               /* TRANSLATION REQUESTED    */ 81250022
*   2 SCBDESTQ    PTR(24)  BDY(BYTE),    /* POINTER TO DEST QCB      */ 81280022
*   2 SCBRCVCT    CHAR(1),               /* RECEIVE MSGLIMIT         */ 81310022
*    3 SCBSNDCT    CHAR(1),              /* SEND MSGLIMIT            */ 81340022
*   2 SCBMBHEN    PTR(24)  BDY(BYTE),    /* ADDR MULT BFR HDR ENTRY  */ 81370022
*    3 SCBMACR     PTR(24)  BDY(BYTE),   /* FIRST/NEXT IN/OUTMSG        81400022
*                                           MACRO TO BE EXECUTED     */ 81430022
*   2 SCBPRI      PTR(8),                /* PRIORITY INDEX TO QCB       81460022
*                                                              S22024*/ 81490022
*   2 SCBBKFCT    PTR(24)  BDY(BYTE),    /* MSG LENGTH COUNT FOR        81520022
*                                           BREAK              S22026*/ 81550022
*    3 *           PTR(8),               /*                    S22026*/ 81580022
*    3 SCBEOBSZ    FIXED(15) BDY(BYTE),  /* SIZE OF LOGICAL BLOCKS      81610022
*                                                              S22026*/ 81640022
*     4 SCBCTBSZ    FIXED(15) BDY(BYTE), /* SIZE OF CTB        S22026*/ 81670022
*   2 SCBSALEV    CHAR(1),               /* SIMULATED ATTN LEVEL REQ    81700022
*                                           TSO                      */ 81730022
*    3 SCBQTYPE    CHAR(1),              /* THIS MESSAGE HAS BEEN       81760022
*                                           QUEUED ON                */ 81790022
*     4 SCBNORCL    BIT(1),              /* A RECALL FROM BD HAS FAILED 81820022
*                                           TO GET A BUFFER BECAUSE THE 81850022
*                                           MESSAGE HAD ALREADY BEEN    81880022
*                                           REMOVED FROM THE CORE       81910022
*                                           QUEUE              A42363*/ 81940022
*     4 SCBCOREQ    BIT(1),              /* CORE QUEUES              */ 81970022
*     4 SCBREUS     BIT(1),              /* REUSEABLE DISK QUEUES    */ 82000022
*     4 SCBNREUS    BIT(1),              /* NON-REUSEABLE DISK QUEUES*/ 82030022
*     4 SCBCONC     BIT(1),              /* CONC SCB           S22026*/ 82060022
*     4 SCBNOFF     BIT(1),              /* REUS HAS UPDATED SCBFEFO */ 82090022
*     4 SCBBBFTM    BIT(1),              /* BUFFERRED TERMINAL SCB   */ 82120022
*     4 SCBBFMM     BIT(1),              /* BUFFERRED TERMINAL IN       82150022
*                                           MIDDLE OF MESSAGE        */ 82180022
*   2 SCBMRFPL    PTR(24)  BDY(BYTE),    /* ADDR OF FORWARD             82210022
*                                           PARAMETER LIST           */ 82240022
*   2 SCBERRST    FIXED(31),             /* ERROR WORD BITS          */ 82270022
*    3 SCBERR1     CHAR(1),              /* FIRST BYTE BIT              82300022
*                                           DEFINITIONS              */ 82330022
*     4 SCBHDRRN    BIT(1),              /* INCOMPLETE HEADER        */ 82360022
*      5 SCBNOLOG    BIT(1),             /* INVALID LOGON MSG  TSO   */ 82390022
*     4 SCBORIGN    BIT(1),              /* INVALID ORIGIN ON        */ 82420022
*      5 SCBHANG     BIT(1),             /* LOGON REQUEST HANGUP MSG    82450022
*                                                              TSO   */ 82480022
*     4 SCBNOTRM    BIT(1),              /* NOT A TSO TERMINAL  TSO  */ 82510022
*      5 SCBRVITX    BIT(1),            /*RVI TO TEXT REC    @OY13632*/ 82520010
*     4 SCBSEQHN    BIT(1),              /* SEQUENCE HIGH ON         */ 82540022
*      5 SCBNOTSO    BIT(1),             /* TSO NOT IN SYSTEM  TSO   */ 82570022
*     4 SCBSEQLN    BIT(1),              /* SEQUENCE LOW ON          */ 82600022
*      5 SCBNOVAC    BIT(1),             /* TOO MANY TSO USERS TSO   */ 82630022
*     4 *           BIT(1),              /* RESERVED                 */ 82660022
*     4 SCBNOBFN    BIT(1),              /* INSUFFICIENT BUFFERS     */ 82690022
*     4 SCBCUTFN    BIT(1),              /* CUTOFF ERROR             */ 82720022
*      5 SCBRVISL    BIT(1),             /* RVI TO SEL BUFRD TERM    */ 82750022
*    3 SCBERR2     CHAR(1),              /* SECOND BYTE BIT             82780022
*                                           DEFINITIONS              */ 82810022
*     4 SCBCRMIN    BIT(1),              /* CORE MINIMUM PASSED      */ 82840022
*     4 SCBCRMAX    BIT(1),              /* CORE MAXIMUM PASSED      */ 82870022
*     4 SCBCODER    BIT(1),              /* ERROR IN DYNAMIC            82900022
*                                           TRANSLATE          TSO   */ 82930022
*     4 SCBALN      BIT(1),              /* AUTOMATIC LINE              82960022
*                                           NUMBERING          TSO   */ 82990022
*     4 SCBOLTR     BIT(1),              /* TOTE NOT IN SYSTEM       */ 83020022
*     4 SCBABRTN    BIT(1),              /* ABORT - BSC TERMINAL     */ 83050022
*      5 SCBRRJN     BIT(1),             /* REQUEST REJECT -            83060010
*                                           SNA                X03039*/ 83070010
*     4 SCBFRWDN    BIT(1),              /* 'FORWARD' ERROR          */ 83080022
*     4 SCBSOHE BIT(1),                 /* SOH % E,C,R, MSG    S99238*/ 83110022
*    3 SCBERR3     CHAR(1),              /* THIRD BYTE BIT              83140022
*                                           DEFINITIONS              */ 83170022
*     4 SCBLOSTN    BIT(1),              /* MESSAGE LOST (OVERLAID)  */ 83200022
*      5 SCBXPI      BIT(1),             /* ATTENTION - SEND I TSO   */ 83230022
*     4 SCBTMIDN    BIT(1),              /* ID FROM TERMINAL INVALID */ 83260022
*      5 SCBXPD      BIT(1),             /* ATTENTION - SEND D TSO   */ 83290022
*     4 SCBTMINN    BIT(1),              /* TERMINAL INOPERATIVE     */ 83320022
*     4 SCBSATTN    BIT(1),              /* SIMULATED ATTENTION         83350022
*                                           RECEIVED           TSO   */ 83380022
*     4 SCBUSERN    BIT(1),              /* USER ERROR ON            */ 83410022
*     4 SCBFORMN    BIT(1),              /* FORMAT ERROR - BSC MSG   */ 83440022
*      5 SCBFIERN    BIT(1),             /* FUNCTION INTERPRETER        83450010
*                                           ERROR - SNA        X03039*/ 83460010
*     4 SCBATTN     BIT(1),              /* HARDWARE ATTENTION TSO   */ 83470022
*      5 SCBTHRSN    BIT(1),             /* CORE Q THRESH REACHED       83500022
*                                                              S22025*/ 83530022
*     4 SCBXCEPN    BIT(1),              /* UNIT EXCEPTION           */ 83560022
*      5 SCBPERRN    BIT(1),             /* PATH ERROR - SNA   X03039*/ 83570010
*    3 SCBERR4     CHAR(1),              /* FOURTH BYTE BIT             83590022
*                                           DEFINITIONS              */ 83620022
*     4 SCBSLCTN    BIT(1),              /* ERROR DURING SELECTION   */ 83650022
*     4 SCBTXTTN    BIT(1),              /* ERROR DURING TEXT           83680022
*                                           TRANSFER                 */ 83710022
*      5 SCBAPERR  BIT(1),              /* SET BY IGG02046 IF           83740022
*                                       PARTIAL MSG IS SENT TO MH       83770022
*                                       BY ABENDING APPLICATION         83800022
*                                       PROGRAM               SA53610*/ 83830022
*     4 SCBCONNN    BIT(1),              /* ERROR IN CONNECT OR         83860022
*                                           DISCONNECT               */ 83890022
*     4 SCBTRMLN    BIT(1),              /* TERMINAL ERROR           */ 83920022
*     4 *           BIT(1),              /* RESERVED                 */ 83950022
*     4 SCBCTLUN    BIT(1),              /* ERROR IN CONTROL UNIT    */ 83980022
*      5 SCBCPMEN    BIT(1),             /* CPM ERROR - SNA    X03039*/ 83990010
*     4 SCBCHANN    BIT(1),              /* ERROR IN CHANNEL         */ 84010022
*      5 SCBSTERN    BIT(1),             /* STATE ERROR - SNA  X03039*/ 84020010
*     4 SCBUNDFN    BIT(1),              /* UNDEFINED ERROR          */ 84040022
*   2 SCBMRFSD    FIXED(15),             /* MULT RT FIRST SECNDRY       84070022
*                                           DESTINATION              */ 84100022
*   2 SCBDLPTR    FIXED(15),             /* DISTR LIST PTR     S22025*/ 84130022
*    3 SCBEOBAC    FIXED(15),            /* ACCUMULATED COUNT           84160022
*                                           BETWEEN BLOCKS           */ 84190022
*     4 SCBCTBAC  FIXED(15),             /* COUNT OF DATA INSERTED      84220022
*                                                              S22026*/ 84250022
*      5 SCBCRLEN    CHAR(1),            /* LENGTH OF CHAR STRING       84280022
*                                                              S22025*/ 84310022
*      5 SCBENDCR    CHAR(1),            /* ITB CHAR SPECIFIED S22025*/ 84340022
*   2 SCBBSCFM    CHAR(1),               /* MSGFORM DYNAMIC BLK CHGS */ 84370022
*    3 SCBTRNSP    BIT(1),               /* RECEIVING TRANSPARENT    */ 84400022
*    3 SCBNONTR    BIT(1),               /* RECEIVING NON-TRANSPARENT*/ 84430022
*    3 SCBRCVTX    BIT(1),               /* ETX RECEIVED FROM BSC    */ 84460022
*    3 SCBCNTEN    BIT(1),               /* FOR SCHEDULER TO            84490022
*                                           DETERMINE NEXT              84520022
*                                           OPERATION          S21101*/ 84550022
*    3 SCBDATEN    BIT(1),               /* AUTO DATE/TIME EXECUTED     84580022
*                                                              S22025*/ 84610022
*                                       /* INPUT ONLY          S99238*/ 84640022
*     4 SCBNPDTR    BIT(1),             /* NO PADDING TRANSPARENT       84670022
*                                       OUTPUT ONLY            S99238*/ 84700022
*    3 *           BIT(1),               /* RESERVED                 */ 84730022
*    3 SCBNOEOT    BIT(1),               /* BSC DIAL NO EOT BEFORE      84760022
*                                           READ                     */ 84790022
*    3 SCBMLMTN    BIT(1),               /* MSGLIMIT EXCEEDED        */ 84820022
*   2 SCBMBSSA    CHAR(7),               /* MULT BFR SCAN SAVE AREA  */ 84850022
*   2 SCBCPBNO    PTR(8),                /* NEXT SEQUENTIAL CPB NO. TO  84880022
*                                           BE READ FROM DISK        */ 84910022
*   2 SCBDCHDR    PTR(24)  BDY(BYTE),    /* DISK ADDR CURRENT HDR    */ 84940022
*   2 SCBDESTL    PTR(8),                /* DEST NAME LENGTH         */ 84970022
*   2 SCBCCHDR    PTR(24)  BDY(BYTE),    /* CORE ADDR CURRENT HDR    */ 85000022
*   2 SCBITBSZ    PTR(8),                /* LOGICAL SUBBLOCK SIZE    */ 85030022
*    3 SCBCTBSV    CHAR(1),              /* CTBFORM PARMS SAVED         85060022
*                                                              S22026*/ 85090022
*     4 SCBBCTR     CHAR(1),             /* COUNTER OF BLOCKS REQ       85120022
*                                                              S22025*/ 85150022
*   2 SCBDNSEG    PTR(24)  BDY(BYTE),    /* DISK ADDR NEXT SEGMENT      85180022
*                                           FROM DISK TO SEND        */ 85210022
*    3 SCBSCSEG    PTR(24)  BDY(BYTE),   /* CURRENT SEGMENT GEING       85240022
*                                           READ                     */ 85270022
*   2 SCBHBFNO    CHAR(1),               /* MULTI-HDR BUFFER COUNT   */ 85300022
*   2 SCBCLSEG    PTR(24)  BDY(BYTE),    /* CORE ADDR LAST MSG SEG   */ 85330022
*    3 SCBSCHDR    PTR(24)  BDY(BYTE),   /* CURRENT HEADER BEING SENT*/ 85360022
*   2 SCBITBAC    PTR(8),                /* ACCUM COUNT BETWEEN ITBS */ 85390022
*    3 SCBCTBFL    CHAR(1),              /* CONC FLAG BYTE     S22026*/ 85420022
*     4 SCBBLKCT    CHAR(1),             /* NO. OF BLKS REQUESTED       85450022
*                                                              S22025*/ 85480022
*      5 SCBCTBND    BIT(1),             /* CTB END REACHED    S22026*/ 85510022
*   2 SCBDCSEG    PTR(24)  BDY(BYTE),    /* DISK ADDR CURRENT SEGMENT*/ 85540022
*    3 SCBFEFO     PTR(24)  BDY(BYTE),   /* SAVED FEFO POINTER       */ 85570022
*   2 SCBDEOB     FIXED(31),             /* DISK INFO ON LAST EOB    */ 85600022
*   2 SCBSRCE     FIXED(15),             /* MSG BFR SOURCE SAVED     */ 85630022
*   2 SCBSIZE     FIXED(15),             /* MSG BFR SIZE SAVED       */ 85660022
*   2 SCBSTAT1    CHAR(1),               /* STATUS BYTE              */ 85690022
*    3 SCBCBGN     BIT(1),               /* CONC MSG BEGIN     S22026*/ 85720022
*    3 SCBCEND     BIT(1),               /* CONC MSG END       S22026*/ 85750022
*    3 SCBNIDLE    BIT(1),               /* BFRS NOT TO BE HOOKED INTO  85780022
*                                           IDLES LOOP YET     S22026*/ 85810022
*    3 SCBNOPST    BIT(1),               /* BFRS SHOULD NOT BE POSTED   85840022
*                                                              S22026*/ 85870022
*   2 SCBCORE     PTR(24)  BDY(BYTE),    /* ADDR RCD IN CORE Q SAVED */ 85900022
*    3 SCBXTRA     PTR(24)  BDY(BYTE),   /* ADDR ADDL RCDS SAVED     */ 85930022
*   2 SCBSCAN     FIXED(15),             /* SCAN POINTER             */ 85960022
*    3 SCBOSEQ     FIXED(15),            /* SEQUENCE OUT NUMBER      */ 85990022
*   2 SCBNTXT     PTR(24)  BDY(BYTE),    /* ADDR NEXT TEST SEG SAVED */ 86020022
*    3 SCBTQBCK    CHAR(3),              /* TEXT SEG SHAIN SAVED     */ 86050022
*   2 SCBCRCD     PTR(24)  BDY(BYTE),    /* ADDR CURR SEG SAVED      */ 86080022
*   2 SCBCHDR     PTR(24)  BDY(BYTE),    /* ADDR CURR HDR SEG SAVED  */ 86110022
*    3 SCBNHDR     PTR(24)  BDY(BYTE),   /* ADDR NEXT HDR SEG SAVED  */ 86140022
*   2 SCBCCSEG    PTR(24)  BDY(BYTE),    /* CORE ADDR CURRENT SEGMENT*/ 86170022
*    3 SCBNXCPB    PTR(8),               /* NEXT CPB NUMBER FROM        86200022
*                                           DISK.  IF ZERO - NO         86230022
*                                           MULTIPLE ROUTING         */ 86260022
*   2 SCBEOB      FIXED(15),             /* POINTER TO FIRST EOB        86290022
*                                           SAVED                    */ 86320022
*   2 SCBUNTCT    PTR(8),                /* OFFSET INTO DISK RECORD OF  86350022
*                                           NEXT BYTE TO MOVE  S22024*/ 86380022
*   2 SCBTRANS    PTR(24)  BDY(BYTE),    /* ADDR OF CODE MACRO          86410054
*                                           PARAMETER LIST    SA67142*/ 86420054
*   2 SCBEND      CHAR(0);               /* END OF BASE SCB  @YM07716*/ 86430010
* DCL SCBRGSAV  CHAR(*) DEF(SCBEND);     /* SAVE AREA FOR USER MH       86440010
*                                           REGISTERS IF SPECIFIED      86470022
*                                           ON INTRO         @YM07716*/ 86500010
*%SCBSCBL='LENGTH(IEDQSCB)';            /* LENGTH OF SCB     @Y17XAXF*/ 86505010
*                                                                       86530022
*                                                                       86560022
*/*     ************************************************************ */ 86590022
*/* 0   *     STATE    *                   DESTQ                     */ 86620022
*/*     ************************************************************ */ 86650022
*/* 4   *  SNDCT/RCVCT *                 MACR/MBHEN                  */ 86680022
*/*     ************************************************************ */ 86710022
*/* 8   *     PRI      *                   BKFCT                     */ 86740022
*/*     ************************************************************ */ 86770022
*/* 2   *     QTYPE    *                   MRFPL                     */ 86800022
*/*     ************************************************************ */ 86830022
*/* 6   *                           ERRST                            */ 86860022
*/*     ************************************************************ */ 86890022
*/* 0   *            MRFSD            *            DLPTR             */ 86920022
*/*     ************************************************************ */ 86950022
*/* 4   *     BSCFM    *                   MBSSA                     */ 86980022
*/*     ************************************************************ */ 87010022
*/* 8   *                           MBSSA                            */ 87040022
*/*     ************************************************************ */ 87070022
*/* 2   *     CPBNO    *                   DCHDR                     */ 87100022
*/*     ************************************************************ */ 87130022
*/* 6   *     DESTL    *                   CCHDR                     */ 87160022
*/*     ************************************************************ */ 87190022
*/* 0   *     ITBSZ    *                 SCSEG/DNSEG                 */ 87220022
*/*     ************************************************************ */ 87250022
*/* 4   *     HBFNO    *                 SCHDR/CLSEG                 */ 87280022
*/*     ************************************************************ */ 87310022
*/* 8   *     ITBAC    *                 FEFO/DCSEG                  */ 87340022
*/*     ************************************************************ */ 87370022
*/* 2   *                          DEOB                              */ 87400022
*/*     ************************************************************ */ 87430022
*/* 6   *            SRCE             *            SIZE              */ 87460022
*/*     ************************************************************ */ 87490022
*/* 0   *     STAT1    *                 XTRA/CORE                   */ 87520022
*/*     ************************************************************ */ 87550022
*/* 4   *         OSEQ/SCAN           *          NTXT/TQBCK          */ 87580022
*/*     ************************************************************ */ 87610022
*/* 8   *  NTXT/TQBCK  *                   CRCD                      */ 87640022
*/*     ************************************************************ */ 87670022
*/* 2   *                NHDR/CHDR                   *     CCSEG     */ 87700022
*/*     ************************************************************ */ 87730022
*/* 6   *            CCSEG            *             EOB              */ 87760022
*/*     ************************************************************ */ 87790022
*/* 0   *     UNTCT    *                   TRANS                     */ 87820022
*/*     ************************************************************ */ 87850022
*/*                                                                  */ 87880022
