         TITLE 'IGC0N10D, TOTE CLEANUP RESPONSE PROC'                   00001000
IGC0N10D CSECT ,                                                01S0001 00002000
@PROLOG  BALR  @12,0                                            01S0001 00003000
@PSTART  DS    0H                                               01S0001 00004000
         USING @PSTART,@12                                      01S0001 00005000
*                                   /*                                  00006000
IGC0N10D IEDHJN AFTERHJN,HJN           MODULE IDENTIFICATION MACRO      00007000
*   ROPCAVT=RPARM;                  /* SET THE BASE POINTER FOR THE     00008000
*                                      OPERATOR CONTROL ADDRESS 02S0326 00009000
*                                      VECTOR TABLE                  */ 00010000
         LR    ROPCAVT,RPARM                                    02S0326 00011000
*   REG10=OPCWORK;                  /* SET THE BASE REGISTER TO BE      00012000
*                                      USED FOR ADDRESSING AUTOMATIC    00013000
*                                      DATA WITH THE POINTER TO THE     00014000
*                                      OPERATOR CONTROL RESIDENT WORK   00015000
*                                      AREA                          */ 00016000
         L     REG10,OPCWORK(,ROPCAVT)                          02S0327 00017000
*   GEN REFS(REG10) NOSETS;                                     02S0328 00018000
*                                   /*                                  00019000
         USING @DATD,REG10             INFORM THE ASSEMBLER OF THE      00020000
*                                      BASE REGISTER TO BE USED FOR     00021000
*                                      ADDRESSING AUTOMATIC DATA        00022000
*   RSAVE=ADDR(OPCSAVE);            /* SET THE SAVE AREA POINTER        00023000
*                                      REGISTER WITH THE POINTER TO     00024000
*                                      THE OPERATOR CONTROL SAVE AREA*/ 00025000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          02S0329 00026000
*                                                               02S0330 00027000
*   /*****************************************************************/ 00028000
*   /*                                                               */ 00029000
*   /* PROCESS: THIS SEGMENT DOES THE PROCESSING THAT IS NECESSARY TO*/ 00030000
*   /* PERFORM THE FUNCTION OF THE MODULE.                           */ 00031000
*   /*                                                               */ 00032000
*   /*****************************************************************/ 00033000
*                                                               02S0330 00034000
*                                                               03S0330 00035000
*   /*****************************************************************/ 00036000
*   /*                                                               */ 00037000
*   /* PROCESS.INITIAL: THIS SEGMENT DOES THE INITIAL PROCESSING.    */ 00038000
*   /*                                                               */ 00039000
*   /*****************************************************************/ 00040000
*                                                               03S0330 00041000
*   DO;                                                         03S0330 00042000
*     RAVT=OPCAVTPT;                /* SET THE BASE POINTER FOR THE     00043000
*                                      TCAM ADDRESS VECTOR TABLE     */ 00044000
         L     RAVT,OPCAVTPT(,ROPCAVT)                          03S0331 00045000
*     ROPCE=OPCCOPCE;               /* SET THE BASE POINTER FOR THE     00046000
*                                      OPERATOR CONTROL ELEMENT      */ 00047000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         03S0332 00048000
*   END;                                                        03S0333 00049000
*   RFY                                                         02S0334 00050000
*     IEDREQD BASED(ROPCE);         /* SET BASE FOR ELEMENT          */ 00051000
*   OPCCOPCE=OPCEPTR;               /* SET UP OLD OPCE AS CURRENT    */ 00052000
         L     @11,OPCEPTR(,ROPCE)                              02S0335 00053000
         ST    @11,OPCCOPCE(,ROPCAVT)                           02S0335 00054000
*   OPCMODID=RTNWTG;                /* SET UP THE CALLER'S ID        */ 00055000
         MVC   OPCMODID(2,ROPCAVT),RTNWTG(ROPCE)                02S0336 00056000
*   RPARM=ROPCE;                    /* POINT RPARM TO ELEMENT        */ 00057000
         LR    RPARM,ROPCE                                      02S0337 00058000
*   CALL FREEBUF;                   /* AND FREE THE ELEMENT          */ 00059000
         L     @15,OPCFREBF(,ROPCAVT)                           02S0338 00060000
         BALR  @14,@15                                          02S0338 00061000
*   ROPCE=OPCCOPCE;                 /* SETUP ORIG OPCE AS CURRENT       00062000
*                                                            @YM08158*/ 00063000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         02S0339 00064000
*   REG01=OPCMODID;                 /* SET INVOKER'S RETURN MODULE ID   00065000
*                                                            @YM08158*/ 00066000
         SLR   REG01,REG01                                      02S0340 00067000
         ICM   REG01,3,OPCMODID(ROPCAVT)                        02S0340 00068000
*   CALL TOTCHECK;                  /* SEE IF MORE TO CLEAN UP  02S0341 00069000
*                                                            @YM08158*/ 00070000
         L     @15,OPCTOTCK(,ROPCAVT)                           02S0341 00071000
         BALR  @14,@15                                          02S0341 00072000
*   IF REG00^=0                     /* IF MORE CLEANUP REQ'D @YM08158*/ 00073000
*     THEN                                                      02S0342 00074000
         LTR   REG00,REG00                                      02S0342 00075000
         BZ    @RF00342                                         02S0342 00076000
*     DO;                           /*                       @YM08158*/ 00077000
*       OPCMODID=CNTLMOD;           /* RELINQUISH CONTROL    @YM08158*/ 00078000
         MVC   OPCMODID(2,ROPCAVT),@CC01525                     02S0344 00079000
*       REG00=''B;                  /* CLEAR REG00 FOR EXIT TO 00       00080000
*                                                            @YM08158*/ 00081000
         SLR   REG00,REG00                                      02S0345 00082000
*     END;                          /*                       @YM08158*/ 00083000
*   ELSE                                                        02S0347 00084000
*     ;                             /*                       @YM08158*/ 00085000
@RF00342 DS    0H                                               02S0348 00086000
*                                                               02S0348 00087000
*   /*****************************************************************/ 00088000
*   /*                                                               */ 00089000
*   /* EPILOGUE: THIS SEGMENT COMPLETES THE EPILOGUE CODE THAT WAS   */ 00090000
*   /* ALTERED BY THE EXTERNAL PROCEDURE STATEMENT. THE XCTL SYSTEM  */ 00091000
*   /* MACRO INSTRUCTION IS USED BY THIS SEGMENT TO TRANSFER CONTROL */ 00092000
*   /* TO THE NEXT MODULE THAT IS TO BE EXECUTED.                    */ 00093000
*   /*                                                               */ 00094000
*   /*****************************************************************/ 00095000
*                                                               02S0348 00096000
*   RFY                                                         02S0348 00097000
*     REG01 RSTD;                   /* RESTRICT THE ARGUMENT REGISTER   00098000
*                                      TO BE USED TO CONTAIN THE        00099000
*                                      POINTER TO THE OPERATOR  02S0348 00100000
*                                      CONTROL ADDRESS VECTOR TABLE     00101000
*                                      FROM USE BY THE COMPILER      */ 00102000
*   REG01=ROPCAVT;                  /* SET THE ARGUMENT REGISTER IN     00103000
*                                      PREPARATION TO TRANSFERRING      00104000
*                                      CONTROL TO THE NEXT MODULE    */ 00105000
         LR    REG01,ROPCAVT                                    02S0349 00106000
*   DO;                             /* IEDXCTL                       */ 00107000
*     GEN EXIT REFS(ROPCAVT,OPCTRACE,OPCXCTL) NOSEQFLOW;        02S0351 00108000
*                                   /*                                  00109000
         LA    15,OPCXCTL(,ROPCAVT)   POINT TO OPCXCTL LIST             00110000
         EX    0,OPCTRACE(,ROPCAVT)    INVOKE XCTL TRACE                00111000
         XCTL  SF=(E,(15))             XCTL TO NEXT MODULE              00112000
*   END;                            /* END OF IEDXCTL        @OZ35627*/ 00113000
*   END IGC0N10D                                                01S0353 00114000
*                                                               01S0353 00115000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00116000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00117000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 00118000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 00119000
*/*%INCLUDE SYSLIB  (TREQD   )                                       */ 00120000
*/*%INCLUDE SYSUT5  (RFY     )                                       */ 00121000
*/*%INCLUDE SYSUT5  (DCL     )                                       */ 00122000
*/*%INCLUDE SYSUT5  (PROLOGUE)                                       */ 00123000
*/*%INCLUDE SYSUT5  (PROCESS )                                       */ 00124000
*/*%INCLUDE SYSUT5  (INITIAL )                                       */ 00125000
*/*%INCLUDE SYSUT5  (EPILOGUE)                                       */ 00126000
*                                                               01S0353 00127000
*       ;                                                       01S0353 00128000
@DATA    DS    0H                                                       00129000
@DATD    DSECT                                                          00130000
         DS    0F                                                       00131000
IGC0N10D CSECT                                                          00132000
         DS    0F                                                       00133000
@DATD    DSECT                                                          00134000
         DS    0D                                                       00135000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00136000
@ENDDATD EQU   *                                                        00137000
IGC0N10D CSECT                                                          00138000
         DS    0F                                                       00139000
@SIZDATD DC    AL1(0)                                                   00140000
         DC    AL3(@ENDDATD-@DATD)                                      00141000
         DS    0D                                                       00142000
@CC01525 DC    C'00'                                                    00143000
PATCH    DC    XL104'0'                                                 00144000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00145000
@01      EQU   01                                                       00146000
@02      EQU   02                                                       00147000
@03      EQU   03                                                       00148000
@04      EQU   04                                                       00149000
@05      EQU   05                                                       00150000
@06      EQU   06                                                       00151000
@07      EQU   07                                                       00152000
@08      EQU   08                                                       00153000
@09      EQU   09                                                       00154000
@10      EQU   10                                                       00155000
@11      EQU   11                                                       00156000
@12      EQU   12                                                       00157000
@13      EQU   13                                                       00158000
@14      EQU   14                                                       00159000
@15      EQU   15                                                       00160000
ROPCE    EQU   @03                                                      00161000
ROPCAVT  EQU   @02                                                      00162000
RAVT     EQU   @04                                                      00163000
REG00    EQU   @00                                                      00164000
REG01    EQU   @01                                                      00165000
RPARM    EQU   @01                                                      00166000
REG10    EQU   @10                                                      00167000
RSAVE    EQU   @13                                                      00168000
RDCB     EQU   @10                                                      00169000
REG02    EQU   @02                                                      00170000
REG03    EQU   @03                                                      00171000
REG04    EQU   @04                                                      00172000
REG05    EQU   @05                                                      00173000
REG06    EQU   @06                                                      00174000
REG07    EQU   @07                                                      00175000
REG08    EQU   @08                                                      00176000
REG09    EQU   @09                                                      00177000
REG11    EQU   @11                                                      00178000
REG13    EQU   @13                                                      00179000
REG14    EQU   @14                                                      00180000
REG15    EQU   @15                                                      00181000
RLCB     EQU   @09                                                      00182000
RLGB     EQU   @10                                                      00183000
ROPRE    EQU   @03                                                      00184000
RPRF     EQU   @06                                                      00185000
RQCB     EQU   @07                                                      00186000
RSIB     EQU   @05                                                      00187000
RTRM     EQU   @08                                                      00188000
IEDQAVTD EQU   0                                                        00189000
AVTSAVEX EQU   IEDQAVTD+288                                             00190000
AVTREADD EQU   IEDQAVTD+380                                             00191000
AVTBUFSW EQU   IEDQAVTD+384                                             00192000
@NM00004 EQU   IEDQAVTD+388                                             00193000
AVTCKFLG EQU   @NM00004                                                 00194000
AVTBASE  EQU   IEDQAVTD+412                                             00195000
AVTPKF   EQU   AVTBASE                                                  00196000
AVTHG02  EQU   IEDQAVTD+528                                             00197000
AVTDISP  EQU   IEDQAVTD+552                                             00198000
AVTHD    EQU   IEDQAVTD+556                                             00199000
AVTSCOPT EQU   AVTHD                                                    00200000
AVTSAVTP EQU   IEDQAVTD+612                                             00201000
AVTSAVTF EQU   AVTSAVTP                                                 00202000
AVTCKPEL EQU   IEDQAVTD+652                                             00203000
AVTCKRMV EQU   AVTCKPEL                                                 00204000
AVTCKELF EQU   IEDQAVTD+680                                             00205000
AVTCKBYT EQU   IEDQAVTD+691                                             00206000
AVTHG01  EQU   IEDQAVTD+692                                             00207000
AVTCKLNK EQU   IEDQAVTD+696                                             00208000
AVTCRELE EQU   IEDQAVTD+708                                             00209000
AVTCCELE EQU   AVTCRELE                                                 00210000
AVTCLRHI EQU   IEDQAVTD+716                                             00211000
AVTADBUF EQU   IEDQAVTD+720                                             00212000
AVTSYSER EQU   IEDQAVTD+728                                             00213000
AVTBFRFG EQU   IEDQAVTD+784                                             00214000
AVTCKPQB EQU   IEDQAVTD+804                                             00215000
AVTCKPTB EQU   AVTCKPQB                                                 00216000
AVTCKPEC EQU   AVTCKPQB+4                                               00217000
AVTCKPCC EQU   AVTCKPEC                                                 00218000
AVTOPCQB EQU   IEDQAVTD+816                                             00219000
AVTOPCOB EQU   AVTOPCQB                                                 00220000
AVTOPCEC EQU   AVTOPCQB+4                                               00221000
AVTOPCCC EQU   AVTOPCEC                                                 00222000
AVTOLTQB EQU   IEDQAVTD+828                                             00223000
AVTCWFL1 EQU   IEDQAVTD+924                                             00224000
AVTCWFL2 EQU   IEDQAVTD+925                                             00225000
AVTSUBT  EQU   IEDQAVTD+948                                             00226000
AVTIOTR  EQU   IEDQAVTD+949                                             00227000
AVTBIT1  EQU   IEDQAVTD+1050                                            00228000
AVTBIT2  EQU   IEDQAVTD+1051                                            00229000
AVTBIT3  EQU   IEDQAVTD+1052                                            00230000
AVTBIT4  EQU   IEDQAVTD+1136                                            00231000
@NM00083 EQU   IEDQAVTD+1232                                            00232000
IEDQAPTR EQU   0                                                        00233000
IEDNSVTD EQU   0                                                        00234000
SAVTDIAG EQU   IEDNSVTD                                                 00235000
SAVTDIAF EQU   SAVTDIAG                                                 00236000
SAVTLUSQ EQU   IEDNSVTD+88                                              00237000
SAVTSCLU EQU   IEDNSVTD+168                                             00238000
SAVTTCPU EQU   IEDNSVTD+238                                             00239000
SAVTZELM EQU   IEDNSVTD+270                                             00240000
SAVTRDRV EQU   IEDNSVTD+284                                             00241000
SAVTCKQB EQU   IEDNSVTD+300                                             00242000
SAVTCKTB EQU   SAVTCKQB                                                 00243000
SAVTCKEC EQU   SAVTCKQB+4                                               00244000
SAVTCKCC EQU   SAVTCKEC                                                 00245000
SAVTNETF EQU   IEDNSVTD+324                                             00246000
SAVTCDRV EQU   IEDNSVTD+332                                             00247000
IEDQOPCE EQU   0                                                        00248000
OCELEM   EQU   IEDQOPCE+4                                               00249000
OCUNIT   EQU   IEDQOPCE+8                                               00250000
OCRUDEST EQU   OCUNIT                                                   00251000
OCCKPKEY EQU   OCRUDEST                                                 00252000
OCSCAN   EQU   OCCKPKEY                                                 00253000
@NM00107 EQU   OCRUDEST+1                                               00254000
OCUNITBF EQU   @NM00107+2                                               00255000
OCOPTCDE EQU   IEDQOPCE+12                                              00256000
OCSWITCH EQU   IEDQOPCE+13                                              00257000
OCFLAG   EQU   IEDQOPCE+14                                              00258000
OCRLN    EQU   IEDQOPCE+15                                              00259000
OCCIB    EQU   IEDQOPCE+16                                              00260000
OCMSTSAV EQU   OCCIB                                                    00261000
OCDEST   EQU   OCMSTSAV                                                 00262000
OCLINENO EQU   IEDQOPCE+22                                              00263000
OCTIOT   EQU   OCLINENO                                                 00264000
OCWTGB   EQU   OCTIOT                                                   00265000
OCTRUNIT EQU   IEDQOPCE+24                                              00266000
OCRSID   EQU   OCTRUNIT                                                 00267000
OCALSTAT EQU   OCRSID                                                   00268000
OCFNAALL EQU   OCALSTAT                                                 00269000
OCFLAG1  EQU   OCRSID+1                                                 00270000
OCPARM   EQU   IEDQOPCE+28                                              00271000
OCBACKUP EQU   IEDQOPCE+32                                              00272000
OCBUFNED EQU   OCBACKUP                                                 00273000
OCCOUNT1 EQU   OCBUFNED                                                 00274000
OCBUFGOT EQU   OCBACKUP+2                                               00275000
OCCOUNT2 EQU   OCBUFGOT                                                 00276000
OCMODNME EQU   IEDQOPCE+40                                              00277000
OCIPLWA  EQU   OCMODNME                                                 00278000
OCPTRSAV EQU   OCMODNME+4                                               00279000
OCCKDATA EQU   IEDQOPCE+48                                              00280000
OCRSTGTM EQU   OCCKDATA                                                 00281000
OC379RRT EQU   OCRSTGTM                                                 00282000
OCNCP    EQU   OCRSTGTM+2                                               00283000
OCOID    EQU   IEDQOPCE+56                                              00284000
IEDQOPCN EQU   0                                                        00285000
OCLDNME  EQU   IEDQOPCN                                                 00286000
OCLINTTE EQU   OCLDNME                                                  00287000
OCREQFLG EQU   OCLINTTE+2                                               00288000
OCPREFLG EQU   OCLINTTE+3                                               00289000
IEDQOPCD EQU   0                                                        00290000
OPCAVTPT EQU   IEDQOPCD+8                                               00291000
OPCCOPCE EQU   IEDQOPCD+12                                              00292000
OPCTRACE EQU   IEDQOPCD+32                                              00293000
OPCSAVE  EQU   IEDQOPCD+56                                              00294000
OPCWORK  EQU   IEDQOPCD+140                                             00295000
OPCAQCTL EQU   IEDQOPCD+180                                             00296000
OPCXCTL  EQU   IEDQOPCD+204                                             00297000
OPCLDNME EQU   IEDQOPCD+212                                             00298000
OPCMODID EQU   OPCLDNME+3                                               00299000
OPCFREBF EQU   IEDQOPCD+280                                             00300000
OPCSPEC  EQU   IEDQOPCD+300                                             00301000
OPCTOTCK EQU   IEDQOPCD+360                                             00302000
OPCPWCOB EQU   IEDQOPCD+368                                             00303000
OPCPWQCB EQU   OPCPWCOB                                                 00304000
OPCPWECB EQU   OPCPWCOB+4                                               00305000
OPCSESS  EQU   IEDQOPCD+384                                             00306000
OPCSFLAG EQU   OPCSESS                                                  00307000
OPCSENSE EQU   OPCSESS+8                                                00308000
OPCSNSSY EQU   OPCSENSE                                                 00309000
OPCSNSUS EQU   OPCSENSE+2                                               00310000
OPCPCID  EQU   IEDQOPCD+456                                             00311000
OPCUNIQP EQU   OPCPCID+2                                                00312000
OPCSESSF EQU   IEDQOPCD+464                                             00313000
IEDREQD  EQU   0                                                        00314000
REQROUTE EQU   IEDREQD+12                                               00315000
REQRCDS  EQU   IEDREQD+14                                               00316000
REQDATA  EQU   IEDREQD+16                                               00317000
FREEBUF  EQU   0                                                        00318000
TOTCHECK EQU   0                                                        00319000
@NM00114 EQU   OCCKDATA                                                 00320000
@NM00116 EQU   OCCIB                                                    00321000
@NM00117 EQU   @NM00116+1                                               00322000
OCCKPKY1 EQU   OCCKPKEY                                                 00323000
OCCKPTYP EQU   OCCKPKY1                                                 00324000
OCICACTN EQU   OCMODNME                                                 00325000
OCICDADR EQU   OCICACTN                                                 00326000
OCICSW   EQU   OCICDADR+3                                               00327000
@NM00122 EQU   OCBACKUP                                                 00328000
@NM00123 EQU   OCCKDATA                                                 00329000
OCMSGFLG EQU   OCPREFLG                                                 00330000
OCBKUP1  EQU   OCMODNME                                                 00331000
@NM00127 EQU   OCMODNME                                                 00332000
OCBKUP2  EQU   OCCKDATA                                                 00333000
OCBKUP3  EQU   OCLDNME                                                  00334000
OCRESPTR EQU   OCBKUP3+4                                                00335000
OCDIALLN EQU   OCRESPTR                                                 00336000
OCIPLDMP EQU   OCLDNME+4                                                00337000
OPCAQWD  EQU   OPCAQCTL                                                 00338000
OPCAQWD1 EQU   OPCAQWD                                                  00339000
OPCAQWD2 EQU   OPCAQWD+4                                                00340000
OPCAQWD3 EQU   OPCAQWD+8                                                00341000
REQLDATA EQU   REQDATA                                                  00342000
REQSDATA EQU   REQDATA                                                  00343000
@NM00154 EQU   REQDATA                                                  00344000
REQDATA1 EQU   @NM00154+4                                               00345000
@NM00155 EQU   REQDATA                                                  00346000
REQDATA2 EQU   @NM00155+8                                               00347000
@NM00156 EQU   REQDATA1                                                 00348000
@NM00157 EQU   REQDATA1                                                 00349000
REQCDE   EQU   @NM00157                                                 00350000
@NM00158 EQU   REQDATA2                                                 00351000
REQSTFLG EQU   @NM00158                                                 00352000
REQSTALL EQU   REQSTFLG                                                 00353000
@NM00161 EQU   REQDATA1                                                 00354000
REQHIPRT EQU   @NM00161+6                                               00355000
REQHIPRP EQU   @NM00161+12                                              00356000
REQHIAR  EQU   @NM00161+16                                              00357000
@NM00163 EQU   REQHIAR                                                  00358000
REQHILSP EQU   @NM00163+4                                               00359000
@NM00164 EQU   REQHIAR                                                  00360000
@NM00165 EQU   REQHIAR                                                  00361000
@NM00166 EQU   REQDATA1                                                 00362000
REQTPMA  EQU   @NM00166                                                 00363000
@NM00167 EQU   REQDATA1                                                 00364000
SAVAREA  EQU   REQDATA                                                  00365000
RTNWTG   EQU   SAVAREA+2                                                00366000
OPCEPTR  EQU   SAVAREA+4                                                00367000
OCLINRRT EQU   OCTRUNIT                                                 00368000
OCPCID   EQU   OCBACKUP                                                 00369000
OCRSNCDE EQU   OCALSTAT                                                 00370000
OCSENSE  EQU   OCBACKUP                                                 00371000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00372000
TTCINSAV EQU   SAVAREA                                                  00373000
REQOPCPT EQU   @NM00167                                                 00374000
REQTPMT  EQU   REQTPMA+2                                                00375000
REQTPMI  EQU   REQTPMA                                                  00376000
REQHISAP EQU   @NM00165+8                                               00377000
REQHISRP EQU   @NM00165+4                                               00378000
REQHISAT EQU   @NM00165+2                                               00379000
REQHISRT EQU   @NM00165                                                 00380000
REQHIRRP EQU   @NM00164                                                 00381000
REQHITRT EQU   @NM00163+8                                               00382000
REQHIOSP EQU   REQHILSP                                                 00383000
REQHITRP EQU   @NM00163                                                 00384000
REQHIAPP EQU   REQHIPRP                                                 00385000
REQHIRSP EQU   @NM00161+8                                               00386000
REQHIAPT EQU   REQHIPRT                                                 00387000
REQHIRST EQU   @NM00161+4                                               00388000
@NM00162 EQU   @NM00161+1                                               00389000
REQHITYP EQU   @NM00161                                                 00390000
REQPUCPB EQU   @NM00158+12                                              00391000
REQPUBFR EQU   @NM00158+8                                               00392000
REQFRBFR EQU   @NM00158+4                                               00393000
REQFRCPB EQU   @NM00158+2                                               00394000
@NM00160 EQU   @NM00158+1                                               00395000
@NM00159 EQU   REQSTFLG                                                 00396000
REQSTBFR EQU   REQSTALL                                                 00397000
REQSTCPB EQU   REQSTALL                                                 00398000
REQSTCLR EQU   REQSTFLG                                                 00399000
REQCDEA2 EQU   @NM00157+8                                               00400000
REQCDEA1 EQU   @NM00157+4                                               00401000
REQCDENA EQU   REQCDE+2                                                 00402000
REQCDEIN EQU   REQCDE                                                   00403000
REQUPTYP EQU   @NM00156+32                                              00404000
REQTTEP1 EQU   @NM00156+28                                              00405000
REQSIT2  EQU   @NM00156+24                                              00406000
REQNAME2 EQU   @NM00156+16                                              00407000
REQSIT1  EQU   @NM00156+12                                              00408000
REQNAME1 EQU   @NM00156+4                                               00409000
REQTNT2  EQU   @NM00156+2                                               00410000
REQTNT1  EQU   @NM00156                                                 00411000
REQNAME  EQU   @NM00155                                                 00412000
REQRTN   EQU   @NM00154                                                 00413000
REQSTNT  EQU   REQSDATA+4                                               00414000
REQSTTE  EQU   REQSDATA                                                 00415000
REQLSIBX EQU   REQLDATA+2                                               00416000
REQLTNT  EQU   REQLDATA                                                 00417000
OPCAQLST EQU   OPCAQWD3+1                                               00418000
OPCAQRQ3 EQU   OPCAQWD3                                                 00419000
OPCAQSEC EQU   OPCAQWD2+1                                               00420000
OPCAQRQ2 EQU   OPCAQWD2                                                 00421000
OPCAQFST EQU   OPCAQWD1+1                                               00422000
OPCAQREQ EQU   OPCAQWD1                                                 00423000
@NM00130 EQU   OCIPLDMP                                                 00424000
OCACTRQ  EQU   OCIPLDMP                                                 00425000
OCDACRQ  EQU   OCIPLDMP                                                 00426000
OCIPLRQ  EQU   OCIPLDMP                                                 00427000
OCDMPRQ  EQU   OCIPLDMP                                                 00428000
@NM00129 EQU   OCRESPTR+2                                               00429000
OCOHNATA EQU   OCDIALLN                                                 00430000
OCRRTPTR EQU   OCBKUP3                                                  00431000
@NM00128 EQU   OCBKUP2+4                                                00432000
OCNHITTC EQU   OCBKUP2+2                                                00433000
OCLINTTC EQU   OCBKUP2                                                  00434000
OCCSIB   EQU   @NM00127                                                 00435000
@NM00126 EQU   OCBKUP1+6                                                00436000
OCTARTTC EQU   OCBKUP1+4                                                00437000
OCSRTTC  EQU   OCBKUP1+2                                                00438000
OCRSTTC  EQU   OCBKUP1                                                  00439000
@NM00125 EQU   OCMSGFLG                                                 00440000
OCRRT    EQU   OCMSGFLG                                                 00441000
OCNAME   EQU   OCMSGFLG                                                 00442000
OCLU1TTE EQU   @NM00123+5                                               00443000
OCSFLAG  EQU   @NM00123+4                                               00444000
OCLU2TTI EQU   @NM00123+2                                               00445000
OCLU1TTI EQU   @NM00123                                                 00446000
OCDISTLN EQU   @NM00122+6                                               00447000
OCDISTAD EQU   @NM00122+2                                               00448000
OCDISTNA EQU   @NM00122                                                 00449000
OCICINAC EQU   OCICSW                                                   00450000
@NM00121 EQU   OCICSW                                                   00451000
OCICATST EQU   OCICDADR+1                                               00452000
OCICTYPE EQU   OCICDADR                                                 00453000
@NM00120 EQU   OCCKPKY1                                                 00454000
OCCKPENV EQU   OCCKPKY1                                                 00455000
OCCKPRST EQU   OCCKPTYP                                                 00456000
OCCKPNCP EQU   OCCKPTYP                                                 00457000
OCCKPINC EQU   OCCKPTYP                                                 00458000
@NM00119 EQU   @NM00116+2                                               00459000
@NM00118 EQU   @NM00117                                                 00460000
OCTSTAT  EQU   @NM00117                                                 00461000
OCREASON EQU   @NM00116                                                 00462000
@NM00115 EQU   @NM00114+4                                               00463000
OCOIDEP  EQU   @NM00114                                                 00464000
REQRCD2  EQU   REQRCDS+1                                                00465000
REQRCD1  EQU   REQRCDS                                                  00466000
REQSWTCH EQU   REQROUTE+1                                               00467000
REQFLAG  EQU   REQROUTE                                                 00468000
REQRQCBA EQU   IEDREQD+9                                                00469000
REQRPRI  EQU   IEDREQD+8                                                00470000
REQLINK  EQU   IEDREQD+5                                                00471000
REQPRI   EQU   IEDREQD+4                                                00472000
REQQCBA  EQU   IEDREQD+1                                                00473000
REQTYPE  EQU   IEDREQD                                                  00474000
OPCBOTTM EQU   IEDQOPCD+3644                                            00475000
@NM00153 EQU   IEDQOPCD+1948                                            00476000
@NM00152 EQU   IEDQOPCD+1860                                            00477000
@NM00151 EQU   IEDQOPCD+1772                                            00478000
@NM00150 EQU   IEDQOPCD+1696                                            00479000
@NM00149 EQU   IEDQOPCD+1620                                            00480000
OPCDSRWT EQU   IEDQOPCD+1616                                            00481000
@NM00148 EQU   IEDQOPCD+1532                                            00482000
@NM00147 EQU   IEDQOPCD+1336                                            00483000
@NM00146 EQU   IEDQOPCD+1328                                            00484000
@NM00145 EQU   IEDQOPCD+528                                             00485000
OPCRSTRS EQU   IEDQOPCD+524                                             00486000
OPCSAVES EQU   IEDQOPCD+520                                             00487000
OPCRSPBD EQU   IEDQOPCD+516                                             00488000
OPCNFY03 EQU   IEDQOPCD+512                                             00489000
OPCNFY01 EQU   IEDQOPCD+508                                             00490000
OPCURC   EQU   IEDQOPCD+504                                             00491000
OPCCINBD EQU   IEDQOPCD+500                                             00492000
OPCCRKEY EQU   IEDQOPCD+496                                             00493000
OPCDRSET EQU   IEDQOPCD+492                                             00494000
OPCDRCLN EQU   IEDQOPCD+488                                             00495000
OPCDRDEL EQU   IEDQOPCD+484                                             00496000
OPCDRLOD EQU   IEDQOPCD+480                                             00497000
OPCDRLOC EQU   IEDQOPCD+476                                             00498000
OPCDRCVT EQU   IEDQOPCD+472                                             00499000
OPCDRFST EQU   IEDQOPCD+468                                             00500000
OPCLSABC EQU   IEDQOPCD+466                                             00501000
@NM00144 EQU   IEDQOPCD+465                                             00502000
@NM00143 EQU   OPCSESSF                                                 00503000
OPCUNIQV EQU   OPCUNIQP+2                                               00504000
OPCUNIQU EQU   OPCUNIQP                                                 00505000
OPCOSSCP EQU   OPCPCID                                                  00506000
@NM00142 EQU   IEDQOPCD+452                                             00507000
@NM00141 EQU   IEDQOPCD+448                                             00508000
OPCSDUPU EQU   IEDQOPCD+444                                             00509000
OPCSDULU EQU   IEDQOPCD+440                                             00510000
OPCSDRVT EQU   IEDQOPCD+436                                             00511000
OPCSDRET EQU   IEDQOPCD+432                                             00512000
OPCSDHSY EQU   IEDQOPCD+428                                             00513000
OPCSDENQ EQU   IEDQOPCD+424                                             00514000
OPCSDDIA EQU   IEDQOPCD+420                                             00515000
OPCSDAPU EQU   IEDQOPCD+416                                             00516000
OPCSDALU EQU   IEDQOPCD+412                                             00517000
OPCCSKEY EQU   IEDQOPCD+408                                             00518000
OPCSSKEY EQU   IEDQOPCD+404                                             00519000
OPCPRTTE EQU   IEDQOPCD+400                                             00520000
OPCLU2TT EQU   OPCSESS+14                                               00521000
OPCLU1TT EQU   OPCSESS+12                                               00522000
OPCSNSU2 EQU   OPCSNSUS+1                                               00523000
OPCSNSU1 EQU   OPCSNSUS                                                 00524000
OPCSNSMN EQU   OPCSNSSY+1                                               00525000
OPCSNSMJ EQU   OPCSNSSY                                                 00526000
OPCCSIB  EQU   OPCSESS+4                                                00527000
OPCCTTE  EQU   OPCSESS+1                                                00528000
@NM00140 EQU   OPCSFLAG                                                 00529000
OPCISQUD EQU   OPCSFLAG                                                 00530000
OPCERRST EQU   OPCSFLAG                                                 00531000
OPCISRSP EQU   OPCSFLAG                                                 00532000
OPCISQUE EQU   OPCSFLAG                                                 00533000
OPCRAPMH EQU   OPCSFLAG                                                 00534000
OPCRAPI  EQU   OPCSFLAG                                                 00535000
OPCGTSIB EQU   IEDQOPCD+380                                             00536000
@NM00139 EQU   OPCPWCOB+9                                               00537000
@NM00138 EQU   OPCPWCOB+8                                               00538000
@NM00137 EQU   OPCPWECB+1                                               00539000
OPCPWCCC EQU   OPCPWECB                                                 00540000
OPCPWCHN EQU   OPCPWQCB+1                                               00541000
OPCPWVTO EQU   OPCPWQCB                                                 00542000
OPCWAITV EQU   IEDQOPCD+364                                             00543000
OPCAPXTL EQU   IEDQOPCD+356                                             00544000
OPCDECR  EQU   IEDQOPCD+352                                             00545000
OPCBUFWT EQU   IEDQOPCD+348                                             00546000
OPCWRKSP EQU   IEDQOPCD+320                                             00547000
OPCADGOT EQU   IEDQOPCD+318                                             00548000
OPCRQCNT EQU   IEDQOPCD+316                                             00549000
OPPOLSTP EQU   IEDQOPCD+312                                             00550000
OPCCKCIB EQU   IEDQOPCD+308                                             00551000
OPCEND   EQU   IEDQOPCD+307                                             00552000
OPCSTCBS EQU   IEDQOPCD+306                                             00553000
OPCHNEND EQU   IEDQOPCD+302                                             00554000
OPCOQSW  EQU   IEDQOPCD+301                                             00555000
@NM00136 EQU   OPCSPEC                                                  00556000
@NM00135 EQU   OPCSPEC                                                  00557000
@NM00134 EQU   OPCSPEC                                                  00558000
@NM00133 EQU   OPCSPEC                                                  00559000
OPCFRMCA EQU   OPCSPEC                                                  00560000
OPCRSTRT EQU   OPCSPEC                                                  00561000
OPCPART  EQU   OPCSPEC                                                  00562000
OPCALTD  EQU   OPCSPEC                                                  00563000
OPCBFEND EQU   IEDQOPCD+296                                             00564000
OPCBFIRS EQU   IEDQOPCD+292                                             00565000
OPCAVBUF EQU   IEDQOPCD+290                                             00566000
OPCIPLCT EQU   IEDQOPCD+289                                             00567000
OPCCLNTS EQU   IEDQOPCD+288                                             00568000
OPCHA8   EQU   IEDQOPCD+286                                             00569000
OPCBFREQ EQU   IEDQOPCD+284                                             00570000
OPCGETBF EQU   IEDQOPCD+276                                             00571000
OPCNEXT  EQU   IEDQOPCD+272                                             00572000
OPCFMDFC EQU   IEDQOPCD+268                                             00573000
OPCSCNC  EQU   IEDQOPCD+264                                             00574000
OPCHORTG EQU   IEDQOPCD+260                                             00575000
OPCHORT  EQU   IEDQOPCD+256                                             00576000
OPCCKPTL EQU   IEDQOPCD+252                                             00577000
OPCCKPTF EQU   IEDQOPCD+248                                             00578000
OPCWAITA EQU   IEDQOPCD+244                                             00579000
OPCWAITR EQU   IEDQOPCD+240                                             00580000
OPCWAITP EQU   IEDQOPCD+236                                             00581000
OPCWAITO EQU   IEDQOPCD+232                                             00582000
OPCWAITN EQU   IEDQOPCD+228                                             00583000
OPCWAITL EQU   IEDQOPCD+224                                             00584000
OPCWAITC EQU   IEDQOPCD+220                                             00585000
@NM00132 EQU   OPCLDNME+5                                               00586000
@NM00131 EQU   OPCLDNME                                                 00587000
OPCWAIT  EQU   IEDQOPCD+192                                             00588000
OPCCKERB EQU   IEDQOPCD+164                                             00589000
OPCBFERB EQU   IEDQOPCD+148                                             00590000
OPCFLAG2 EQU   IEDQOPCD+147                                             00591000
OPCFLAG1 EQU   IEDQOPCD+146                                             00592000
OPCWRKSZ EQU   IEDQOPCD+144                                             00593000
OPCRSAVE EQU   IEDQOPCD+132                                             00594000
OPCQCBAD EQU   IEDQOPCD+128                                             00595000
OPCTRMWA EQU   IEDQOPCD+52                                              00596000
OPCPSTWT EQU   IEDQOPCD+48                                              00597000
OPCTNTEA EQU   IEDQOPCD+44                                              00598000
OPCPGCK  EQU   IEDQOPCD+40                                              00599000
OPCLCB   EQU   IEDQOPCD+36                                              00600000
OPCIPLAD EQU   IEDQOPCD+28                                              00601000
OPCTOFLK EQU   IEDQOPCD+24                                              00602000
OPCOPTLK EQU   IEDQOPCD+20                                              00603000
OPCDCBLK EQU   IEDQOPCD+16                                              00604000
OPCDOUBL EQU   IEDQOPCD                                                 00605000
@NM00124 EQU   OCLDNME+6                                                00606000
OC1SQID  EQU   OCLDNME+4                                                00607000
OCWAITPC EQU   OCPREFLG                                                 00608000
OCSRCCLN EQU   OCPREFLG                                                 00609000
OCREMCON EQU   OCPREFLG                                                 00610000
OCCLNUP  EQU   OCPREFLG                                                 00611000
OCTOTEP  EQU   OCPREFLG                                                 00612000
OCREPOST EQU   OCPREFLG                                                 00613000
OCRSPSNT EQU   OCPREFLG                                                 00614000
OCBFREQ  EQU   OCPREFLG                                                 00615000
OCIDLE   EQU   OCREQFLG                                                 00616000
OCFORCE  EQU   OCREQFLG                                                 00617000
OCDCARD  EQU   OCREQFLG                                                 00618000
OCPARTAL EQU   OCREQFLG                                                 00619000
OCADNCP  EQU   OCREQFLG                                                 00620000
OCRMPORQ EQU   OCREQFLG                                                 00621000
OCCDLACT EQU   OCREQFLG                                                 00622000
OCFLUSHZ EQU   OCREQFLG                                                 00623000
OCRESPCT EQU   OCLINTTE                                                 00624000
@NM00113 EQU   IEDQOPCE+60                                              00625000
OCURC    EQU   OCOID                                                    00626000
OCCKPTWA EQU   OCCKDATA+4                                               00627000
OCSRCTTC EQU   OCNCP                                                    00628000
OCCKDAT2 EQU   OC379RRT+1                                               00629000
OCCKDAT1 EQU   OC379RRT                                                 00630000
OCECHOPT EQU   OCPTRSAV                                                 00631000
OCPUADR  EQU   OCIPLWA+2                                                00632000
OCWTGSAV EQU   OCIPLWA                                                  00633000
OCDVRDCT EQU   OCBACKUP+6                                               00634000
@NM00112 EQU   OCBACKUP+4                                               00635000
OCBUFRET EQU   OCCOUNT2                                                 00636000
OCBUFUSD EQU   OCCOUNT1                                                 00637000
OCWTG    EQU   IEDQOPCE+30                                              00638000
OCRESNUM EQU   OCPARM                                                   00639000
OCSEQ    EQU   OCTRUNIT+2                                               00640000
OCTYPTRM EQU   OCFLAG1                                                  00641000
OCNONE   EQU   OCALSTAT                                                 00642000
OCSOME   EQU   OCALSTAT                                                 00643000
OCALLFLG EQU   OCALSTAT                                                 00644000
OCACTREQ EQU   OCALSTAT                                                 00645000
OCREDRVE EQU   OCALSTAT                                                 00646000
OCSEQIND EQU   OCALSTAT                                                 00647000
OCDACTIP EQU   OCFNAALL                                                 00648000
OCRENTRD EQU   OCALSTAT                                                 00649000
OCDIALX  EQU   OCWTGB                                                   00650000
OCTRMTBL EQU   IEDQOPCE+20                                              00651000
OCATNDX  EQU   OCMSTSAV+2                                               00652000
OCREQVAL EQU   OCDEST+1                                                 00653000
OCCONID  EQU   OCDEST                                                   00654000
OCLOCAD  EQU   OCRLN                                                    00655000
OCRESP   EQU   OCFLAG                                                   00656000
OCATTACH EQU   OCFLAG                                                   00657000
OCSSCP   EQU   OCFLAG                                                   00658000
OCOUTPUT EQU   OCFLAG                                                   00659000
OCLINE   EQU   OCFLAG                                                   00660000
OCMPP    EQU   OCFLAG                                                   00661000
OCTOTE   EQU   OCFLAG                                                   00662000
OCCONSOL EQU   OCFLAG                                                   00663000
@NM00111 EQU   OCSWITCH                                                 00664000
OCQUCKN  EQU   OCSWITCH                                                 00665000
OCPRIFLG EQU   OCOPTCDE                                                 00666000
@NM00110 EQU   OCUNITBF                                                 00667000
OCINVTIC EQU   OCUNITBF                                                 00668000
@NM00109 EQU   OCUNITBF                                                 00669000
@NM00108 EQU   @NM00107                                                 00670000
@NM00106 EQU   OCSCAN                                                   00671000
OCNOTUCB EQU   OCSCAN                                                   00672000
OCNONAME EQU   OCSCAN                                                   00673000
OCALLRLN EQU   OCSCAN                                                   00674000
OCDDNAME EQU   OCSCAN                                                   00675000
OCDDNRLN EQU   OCSCAN                                                   00676000
OCADDR   EQU   OCSCAN                                                   00677000
OCELMPTR EQU   OCELEM+1                                                 00678000
OCELMPRI EQU   OCELEM                                                   00679000
OCLINK   EQU   IEDQOPCE                                                 00680000
SAVTSMAX EQU   IEDNSVTD+500                                             00681000
SAVTSINO EQU   IEDNSVTD+498                                             00682000
SAVTAMAX EQU   IEDNSVTD+496                                             00683000
SAVTAENO EQU   IEDNSVTD+494                                             00684000
SAVTAINO EQU   IEDNSVTD+492                                             00685000
SAVTNMAX EQU   IEDNSVTD+490                                             00686000
SAVTNENO EQU   IEDNSVTD+488                                             00687000
SAVTNINO EQU   IEDNSVTD+486                                             00688000
SAVTRSZE EQU   IEDNSVTD+484                                             00689000
SAVTRMAX EQU   IEDNSVTD+482                                             00690000
SAVTRENO EQU   IEDNSVTD+480                                             00691000
SAVTRINO EQU   IEDNSVTD+478                                             00692000
SAVTRMIN EQU   IEDNSVTD+476                                             00693000
SAVTPMID EQU   IEDNSVTD+474                                             00694000
SAVTRRTC EQU   IEDNSVTD+472                                             00695000
SAVTLUSG EQU   IEDNSVTD+468                                             00696000
SAVTACNQ EQU   IEDNSVTD+464                                             00697000
SAVTCM20 EQU   IEDNSVTD+460                                             00698000
SAVTCFDC EQU   IEDNSVTD+456                                             00699000
SAVTCMOT EQU   IEDNSVTD+452                                             00700000
SAVTCMIN EQU   IEDNSVTD+448                                             00701000
SAVTCPCH EQU   IEDNSVTD+444                                             00702000
SAVTCRGT EQU   IEDNSVTD+440                                             00703000
SAVTNALC EQU   IEDNSVTD+436                                             00704000
SAVTATCT EQU   IEDNSVTD+434                                             00705000
SAVTCRIU EQU   IEDNSVTD+432                                             00706000
SAVTCRHI EQU   IEDNSVTD+430                                             00707000
SAVTCRIB EQU   IEDNSVTD+428                                             00708000
SAVTLCQ  EQU   IEDNSVTD+424                                             00709000
SAVTDRSR EQU   IEDNSVTD+420                                             00710000
SAVTATPT EQU   IEDNSVTD+416                                             00711000
SAVTCSMI EQU   IEDNSVTD+412                                             00712000
SAVTNXCR EQU   IEDNSVTD+408                                             00713000
SAVTCRPT EQU   IEDNSVTD+404                                             00714000
SAVTCIPH EQU   IEDNSVTD+400                                             00715000
SAVTBTCO EQU   IEDNSVTD+396                                             00716000
SAVTBTCI EQU   IEDNSVTD+392                                             00717000
SAVTBPCO EQU   IEDNSVTD+388                                             00718000
SAVTBPCI EQU   IEDNSVTD+384                                             00719000
SAVTLLCB EQU   IEDNSVTD+380                                             00720000
SAVTSCF0 EQU   IEDNSVTD+376                                             00721000
SAVTLSNY EQU   IEDNSVTD+372                                             00722000
SAVTLSZP EQU   IEDNSVTD+368                                             00723000
SAVTOMSU EQU   IEDNSVTD+364                                             00724000
SAVTGTSB EQU   IEDNSVTD+360                                             00725000
SAVTHIBL EQU   IEDNSVTD+356                                             00726000
SAVTHISY EQU   IEDNSVTD+352                                             00727000
SAVTNAX2 EQU   IEDNSVTD+348                                             00728000
SAVTCDRU EQU   IEDNSVTD+344                                             00729000
SAVTPOLC EQU   IEDNSVTD+342                                             00730000
SAVTPOLM EQU   IEDNSVTD+340                                             00731000
SAVTPOLR EQU   IEDNSVTD+336                                             00732000
SAVTCDRN EQU   SAVTCDRV                                                 00733000
SAVTPOLL EQU   IEDNSVTD+328                                             00734000
SAVTPOLN EQU   IEDNSVTD+326                                             00735000
@NM00105 EQU   IEDNSVTD+325                                             00736000
@NM00104 EQU   SAVTNETF                                                 00737000
SAVTSDIS EQU   SAVTNETF                                                 00738000
SAVTROUT EQU   SAVTNETF                                                 00739000
SAVTNETW EQU   SAVTNETF                                                 00740000
SAVTDIAL EQU   IEDNSVTD+320                                             00741000
SAVTRQUT EQU   IEDNSVTD+316                                             00742000
SAVTBITN EQU   IEDNSVTD+312                                             00743000
@NM00103 EQU   SAVTCKQB+8                                               00744000
@NM00102 EQU   SAVTCKEC+1                                               00745000
@NM00101 EQU   SAVTCKCC                                                 00746000
SAVTCKPO EQU   SAVTCKCC                                                 00747000
SAVTCKWA EQU   SAVTCKCC                                                 00748000
SAVTCKCH EQU   SAVTCKTB+1                                               00749000
SAVTCKVT EQU   SAVTCKTB                                                 00750000
@NM00100 EQU   IEDNSVTD+297                                             00751000
SAVTRDFG EQU   SAVTRDRV+12                                              00752000
@NM00099 EQU   SAVTRDRV+5                                               00753000
SAVTRDPY EQU   SAVTRDRV+4                                               00754000
SAVTRDQB EQU   SAVTRDRV+1                                               00755000
SAVTRDKY EQU   SAVTRDRV                                                 00756000
SAVTNID  EQU   IEDNSVTD+280                                             00757000
SAVTDVAS EQU   IEDNSVTD+276                                             00758000
SAVTPLSZ EQU   IEDNSVTD+274                                             00759000
@NM00098 EQU   IEDNSVTD+273                                             00760000
SAVTSUBL EQU   IEDNSVTD+272                                             00761000
@NM00097 EQU   SAVTZELM+1                                               00762000
SAVTSUBM EQU   SAVTZELM                                                 00763000
SAVTMHDX EQU   IEDNSVTD+268                                             00764000
SAVTNAT1 EQU   IEDNSVTD+266                                             00765000
SAVTSH20 EQU   IEDNSVTD+264                                             00766000
SAVTLCBS EQU   IEDNSVTD+260                                             00767000
SAVTRNMP EQU   IEDNSVTD+256                                             00768000
SAVTTNTX EQU   IEDNSVTD+252                                             00769000
SAVTNAX  EQU   IEDNSVTD+248                                             00770000
SAVTSUBV EQU   IEDNSVTD+247                                             00771000
SAVTSUBA EQU   IEDNSVTD+246                                             00772000
SAVTSIBC EQU   IEDNSVTD+244                                             00773000
SAVTBSM  EQU   IEDNSVTD+240                                             00774000
SAVTSCPT EQU   SAVTTCPU                                                 00775000
SAVTRQTG EQU   IEDNSVTD+236                                             00776000
SAVTRQCH EQU   IEDNSVTD+232                                             00777000
SAVTMAND EQU   IEDNSVTD+228                                             00778000
SAVTSPLN EQU   IEDNSVTD+224                                             00779000
SAVTNADL EQU   IEDNSVTD+222                                             00780000
SAVTNATL EQU   IEDNSVTD+220                                             00781000
SAVTMHTB EQU   IEDNSVTD+216                                             00782000
SAVTSSMH EQU   IEDNSVTD+212                                             00783000
SAVTQRS  EQU   IEDNSVTD+208                                             00784000
SAVTRQIN EQU   IEDNSVTD+204                                             00785000
SAVTDFCO EQU   IEDNSVTD+200                                             00786000
SAVTSAO  EQU   IEDNSVTD+196                                             00787000
SAVTSARI EQU   IEDNSVTD+192                                             00788000
SAVTSAC  EQU   IEDNSVTD+188                                             00789000
SAVTSAI  EQU   IEDNSVTD+184                                             00790000
SAVTCSCI EQU   IEDNSVTD+180                                             00791000
SAVTSSRP EQU   IEDNSVTD+176                                             00792000
SAVTSSRQ EQU   IEDNSVTD+172                                             00793000
SAVTEP   EQU   SAVTSCLU                                                 00794000
SAVTXTRQ EQU   IEDNSVTD+164                                             00795000
SAVTMVBF EQU   IEDNSVTD+160                                             00796000
@NM00096 EQU   IEDNSVTD+148                                             00797000
SAVTIPCQ EQU   IEDNSVTD+144                                             00798000
@NM00095 EQU   IEDNSVTD+136                                             00799000
SAVTXFMI EQU   IEDNSVTD+132                                             00800000
@NM00094 EQU   IEDNSVTD+124                                             00801000
SAVTXFMO EQU   IEDNSVTD+120                                             00802000
@NM00093 EQU   IEDNSVTD+116                                             00803000
SAVTSSSR EQU   IEDNSVTD+112                                             00804000
SAVTSCPQ EQU   IEDNSVTD+108                                             00805000
SAVTSLCB EQU   IEDNSVTD+104                                             00806000
SAVTLUSR EQU   IEDNSVTD+100                                             00807000
@NM00092 EQU   SAVTLUSQ+8                                               00808000
SAVTLUSP EQU   SAVTLUSQ+4                                               00809000
SAVTLUSB EQU   SAVTLUSQ                                                 00810000
@NM00091 EQU   IEDNSVTD+84                                              00811000
SAVTSAT  EQU   IEDNSVTD+80                                              00812000
SAVTNAT  EQU   IEDNSVTD+76                                              00813000
SAVTCLUP EQU   IEDNSVTD+72                                              00814000
SAVTPIUT EQU   IEDNSVTD+68                                              00815000
SAVTRNTA EQU   IEDNSVTD+64                                              00816000
SAVTDNIR EQU   IEDNSVTD+60                                              00817000
SAVTCNIR EQU   IEDNSVTD+56                                              00818000
SAVTFLDH EQU   IEDNSVTD+52                                              00819000
SAVTSRTN EQU   IEDNSVTD+48                                              00820000
SAVTSREQ EQU   IEDNSVTD+44                                              00821000
SAVTFAIL EQU   IEDNSVTD+42                                              00822000
SAVTSUSE EQU   IEDNSVTD+40                                              00823000
SAVTSIB  EQU   IEDNSVTD+36                                              00824000
SAVTPRTN EQU   IEDNSVTD+32                                              00825000
@NM00090 EQU   IEDNSVTD+28                                              00826000
SAVTWH20 EQU   IEDNSVTD+26                                              00827000
SAVTPWT  EQU   IEDNSVTD+24                                              00828000
SAVTPRTQ EQU   IEDNSVTD+20                                              00829000
SAVTPREQ EQU   IEDNSVTD+16                                              00830000
SAVTPH20 EQU   IEDNSVTD+14                                              00831000
SAVTPUSE EQU   IEDNSVTD+12                                              00832000
SAVTPLCB EQU   IEDNSVTD+8                                               00833000
SAVTPOOL EQU   IEDNSVTD+4                                               00834000
SAVTPRMT EQU   SAVTDIAF                                                 00835000
SAVTVIRT EQU   SAVTDIAF                                                 00836000
AVTTVT   EQU   IEDQAVTD+1268                                            00837000
AVTSITS  EQU   IEDQAVTD+1264                                            00838000
AVTMSUHI EQU   IEDQAVTD+1260                                            00839000
AVTSITU  EQU   IEDQAVTD+1256                                            00840000
AVTSITP  EQU   IEDQAVTD+1252                                            00841000
AVTPADDR EQU   IEDQAVTD+1248                                            00842000
@NM00089 EQU   IEDQAVTD+1246                                            00843000
AVTCPBNO EQU   IEDQAVTD+1244                                            00844000
AVTHRESS EQU   IEDQAVTD+1243                                            00845000
@NM00088 EQU   IEDQAVTD+1242                                            00846000
@NM00087 EQU   IEDQAVTD+1241                                            00847000
@NM00086 EQU   IEDQAVTD+1240                                            00848000
@NM00085 EQU   IEDQAVTD+1237                                            00849000
@NM00084 EQU   IEDQAVTD+1236                                            00850000
AVTHRESE EQU   @NM00083                                                 00851000
AVTRADDR EQU   IEDQAVTD+1228                                            00852000
AVTNADDR EQU   IEDQAVTD+1224                                            00853000
AVTHRESN EQU   IEDQAVTD+1220                                            00854000
AVTVOLRN EQU   IEDQAVTD+1216                                            00855000
AVTTOTNN EQU   IEDQAVTD+1212                                            00856000
AVTTRCYN EQU   IEDQAVTD+1208                                            00857000
AVTRCTRN EQU   IEDQAVTD+1204                                            00858000
AVTNOVON EQU   IEDQAVTD+1200                                            00859000
AVTADEBN EQU   IEDQAVTD+1196                                            00860000
AVTVOLRR EQU   IEDQAVTD+1192                                            00861000
AVTTOTNR EQU   IEDQAVTD+1188                                            00862000
AVTTRCYR EQU   IEDQAVTD+1184                                            00863000
AVTRCTRR EQU   IEDQAVTD+1180                                            00864000
AVTNOVOR EQU   IEDQAVTD+1176                                            00865000
AVTADEBR EQU   IEDQAVTD+1172                                            00866000
AVTLODPT EQU   IEDQAVTD+1168                                            00867000
AVTIOBN  EQU   IEDQAVTD+1164                                            00868000
AVTIOBR  EQU   IEDQAVTD+1160                                            00869000
AVTCPBPT EQU   IEDQAVTD+1156                                            00870000
AVTFCPB  EQU   IEDQAVTD+1152                                            00871000
@NM00082 EQU   IEDQAVTD+1148                                            00872000
AVTINCPQ EQU   IEDQAVTD+1144                                            00873000
@NM00081 EQU   IEDQAVTD+1140                                            00874000
@NM00080 EQU   IEDQAVTD+1137                                            00875000
@NM00079 EQU   AVTBIT4                                                  00876000
@NM00078 EQU   AVTBIT4                                                  00877000
@NM00077 EQU   AVTBIT4                                                  00878000
@NM00076 EQU   AVTBIT4                                                  00879000
@NM00075 EQU   AVTBIT4                                                  00880000
@NM00074 EQU   AVTBIT4                                                  00881000
@NM00073 EQU   AVTBIT4                                                  00882000
AVTRUFTN EQU   AVTBIT4                                                  00883000
@NM00072 EQU   IEDQAVTD+1132                                            00884000
AVTNOBFQ EQU   IEDQAVTD+1128                                            00885000
@NM00071 EQU   IEDQAVTD+1124                                            00886000
AVTDKENQ EQU   IEDQAVTD+1120                                            00887000
@NM00070 EQU   IEDQAVTD+1116                                            00888000
AVTDKAPQ EQU   IEDQAVTD+1112                                            00889000
AVTCOPY  EQU   IEDQAVTD+1108                                            00890000
AVTIA    EQU   IEDQAVTD+1104                                            00891000
AVTFL    EQU   IEDQAVTD+1100                                            00892000
@NM00069 EQU   IEDQAVTD+1096                                            00893000
AVTNCPBQ EQU   IEDQAVTD+1092                                            00894000
AVTTOTNC EQU   IEDQAVTD+1088                                            00895000
AVTCMAX  EQU   IEDQAVTD+1084                                            00896000
AVTCMIN  EQU   IEDQAVTD+1080                                            00897000
AVTHM02  EQU   IEDQAVTD+1076                                            00898000
AVTOPCIN EQU   IEDQAVTD+1074                                            00899000
AVTDCTLN EQU   IEDQAVTD+1072                                            00900000
AVTOPMSK EQU   IEDQAVTD+1068                                            00901000
AVTDDFT  EQU   IEDQAVTD+1064                                            00902000
AVTSTEAL EQU   IEDQAVTD+1060                                            00903000
AVTOPTN  EQU   IEDQAVTD+1056                                            00904000
AVTDSKCT EQU   IEDQAVTD+1054                                            00905000
AVTCKRST EQU   IEDQAVTD+1053                                            00906000
AVTSTAN  EQU   AVTBIT3                                                  00907000
AVTSTACN EQU   AVTBIT3                                                  00908000
AVTSTAIN EQU   AVTBIT3                                                  00909000
AVTSTAYN EQU   AVTBIT3                                                  00910000
AVTOLTBN EQU   AVTBIT3                                                  00911000
AVTTSAB  EQU   AVTBIT3                                                  00912000
AVTRFULN EQU   AVTBIT3                                                  00913000
AVTRECVN EQU   AVTBIT3                                                  00914000
@NM00068 EQU   AVTBIT2                                                  00915000
@NM00067 EQU   AVTBIT2                                                  00916000
AVTOPEIN EQU   AVTBIT2                                                  00917000
AVTSTRTN EQU   AVTBIT2                                                  00918000
AVTTOPOL EQU   AVTBIT2                                                  00919000
AVTCOPYN EQU   AVTBIT2                                                  00920000
AVTREUSN EQU   AVTBIT2                                                  00921000
AVTEXTSC EQU   AVTBIT2                                                  00922000
AVTDISKN EQU   AVTBIT1                                                  00923000
AVTQUCKN EQU   AVTBIT1                                                  00924000
AVTCLOSN EQU   AVTBIT1                                                  00925000
AVTREADN EQU   AVTBIT1                                                  00926000
AVTDLAYN EQU   AVTBIT1                                                  00927000
AVTAQTAN EQU   AVTBIT1                                                  00928000
AVTTSON  EQU   AVTBIT1                                                  00929000
AVTAPLKN EQU   AVTBIT1                                                  00930000
AVTDUMBR EQU   IEDQAVTD+1048                                            00931000
AVTDLQX  EQU   IEDQAVTD+1046                                            00932000
AVTINTLV EQU   IEDQAVTD+1044                                            00933000
AVTSMCNT EQU   IEDQAVTD+1042                                            00934000
AVTAVFCT EQU   IEDQAVTD+1040                                            00935000
AVTOPCON EQU   IEDQAVTD+1038                                            00936000
AVTOPCNT EQU   IEDQAVTD+1036                                            00937000
AVTLNCNT EQU   IEDQAVTD+1034                                            00938000
AVTKEYLE EQU   IEDQAVTD+1032                                            00939000
AVTHA16  EQU   IEDQAVTD+1030                                            00940000
AVTHA7   EQU   IEDQAVTD+1028                                            00941000
AVTHA4   EQU   IEDQAVTD+1026                                            00942000
AVTHA3   EQU   IEDQAVTD+1024                                            00943000
AVTHA2   EQU   IEDQAVTD+1022                                            00944000
AVTGETMS EQU   IEDQAVTD+1021                                            00945000
@NM00066 EQU   IEDQAVTD+1020                                            00946000
AVTGETMD EQU   IEDQAVTD+1016                                            00947000
AVTGETMN EQU   IEDQAVTD+1012                                            00948000
AVTCWTOT EQU   IEDQAVTD+1008                                            00949000
AVTCWINT EQU   IEDQAVTD+956                                             00950000
AVTDTRAP EQU   IEDQAVTD+952                                             00951000
@NM00065 EQU   IEDQAVTD+950                                             00952000
@NM00064 EQU   AVTIOTR                                                  00953000
AVTIOTRH EQU   AVTIOTR                                                  00954000
AVTIOTRE EQU   AVTIOTR                                                  00955000
@NM00063 EQU   AVTSUBT                                                  00956000
AVTSUBPT EQU   AVTSUBT                                                  00957000
AVTSUBON EQU   AVTSUBT                                                  00958000
AVTAFE30 EQU   IEDQAVTD+944                                             00959000
AVTAFE20 EQU   IEDQAVTD+940                                             00960000
AVTAFE10 EQU   IEDQAVTD+936                                             00961000
AVTCWEC2 EQU   IEDQAVTD+932                                             00962000
AVTCWPM2 EQU   IEDQAVTD+928                                             00963000
AVTCWTS2 EQU   IEDQAVTD+927                                             00964000
AVTCWTS1 EQU   IEDQAVTD+926                                             00965000
AVTCWCLD EQU   AVTCWFL2                                                 00966000
AVTCWRAP EQU   AVTCWFL2                                                 00967000
@NM00062 EQU   AVTCWFL2                                                 00968000
@NM00061 EQU   AVTCWFL2                                                 00969000
@NM00060 EQU   AVTCWFL2                                                 00970000
@NM00059 EQU   AVTCWFL2                                                 00971000
@NM00058 EQU   AVTCWFL2                                                 00972000
AVTCWACT EQU   AVTCWFL2                                                 00973000
@NM00057 EQU   AVTCWFL1                                                 00974000
@NM00056 EQU   AVTCWFL1                                                 00975000
@NM00055 EQU   AVTCWFL1                                                 00976000
@NM00054 EQU   AVTCWFL1                                                 00977000
@NM00053 EQU   AVTCWFL1                                                 00978000
@NM00052 EQU   AVTCWFL1                                                 00979000
@NM00051 EQU   AVTCWFL1                                                 00980000
AVTCOMWN EQU   AVTCWFL1                                                 00981000
AVTCWEC1 EQU   IEDQAVTD+920                                             00982000
AVTCWPM1 EQU   IEDQAVTD+916                                             00983000
AVTCAREA EQU   IEDQAVTD+912                                             00984000
AVTFZERO EQU   IEDQAVTD+908                                             00985000
AVTCADDR EQU   IEDQAVTD+904                                             00986000
AVTCOREC EQU   IEDQAVTD+900                                             00987000
@NM00050 EQU   IEDQAVTD+892                                             00988000
AVTCPBCB EQU   IEDQAVTD+888                                             00989000
@NM00049 EQU   IEDQAVTD+880                                             00990000
AVTDSIOB EQU   IEDQAVTD+876                                             00991000
@NM00048 EQU   IEDQAVTD+868                                             00992000
AVTCPRMB EQU   IEDQAVTD+864                                             00993000
@NM00047 EQU   IEDQAVTD+856                                             00994000
AVTCLOSB EQU   IEDQAVTD+852                                             00995000
@NM00046 EQU   IEDQAVTD+844                                             00996000
AVTACTIB EQU   IEDQAVTD+840                                             00997000
@NM00045 EQU   IEDQAVTD+836                                             00998000
AVTOLTEB EQU   IEDQAVTD+832                                             00999000
AVTOLTCH EQU   AVTOLTQB+1                                               01000000
AVTOLTVT EQU   AVTOLTQB                                                 01001000
@NM00044 EQU   AVTOPCQB+8                                               01002000
@NM00043 EQU   AVTOPCEC+1                                               01003000
@NM00042 EQU   AVTOPCCC                                                 01004000
AVTOPCPO EQU   AVTOPCCC                                                 01005000
AVTOPCWA EQU   AVTOPCCC                                                 01006000
AVTOPCCH EQU   AVTOPCOB+1                                               01007000
AVTOPCVT EQU   AVTOPCOB                                                 01008000
@NM00041 EQU   AVTCKPQB+9                                               01009000
AVTCKPTS EQU   AVTCKPQB+8                                               01010000
@NM00040 EQU   AVTCKPEC+1                                               01011000
@NM00039 EQU   AVTCKPCC                                                 01012000
AVTCKPPO EQU   AVTCKPCC                                                 01013000
AVTCKPWA EQU   AVTCKPCC                                                 01014000
AVTCKPCH EQU   AVTCKPTB+1                                               01015000
AVTCKPVT EQU   AVTCKPTB                                                 01016000
@NM00038 EQU   IEDQAVTD+796                                             01017000
AVTBFRTB EQU   IEDQAVTD+792                                             01018000
@NM00037 EQU   IEDQAVTD+788                                             01019000
AVTSELCH EQU   IEDQAVTD+785                                             01020000
AVTBFRTN EQU   AVTBFRFG                                                 01021000
AVTBFREB EQU   IEDQAVTD+780                                             01022000
AVTTIMQ  EQU   IEDQAVTD+776                                             01023000
@NM00036 EQU   IEDQAVTD+772                                             01024000
AVTIMQPS EQU   IEDQAVTD+768                                             01025000
AVTINOUT EQU   IEDQAVTD+766                                             01026000
AVTREFTM EQU   IEDQAVTD+764                                             01027000
@NM00035 EQU   IEDQAVTD+752                                             01028000
AVTDELYB EQU   IEDQAVTD+748                                             01029000
AVTOCQPT EQU   IEDQAVTD+744                                             01030000
AVTTSOPT EQU   IEDQAVTD+740                                             01031000
AVTSUPPT EQU   IEDQAVTD+736                                             01032000
AVTCBQCB EQU   IEDQAVTD+732                                             01033000
AVTMSGS  EQU   IEDQAVTD+729                                             01034000
@NM00034 EQU   AVTSYSER                                                 01035000
@NM00033 EQU   AVTSYSER                                                 01036000
@NM00032 EQU   AVTSYSER                                                 01037000
@NM00031 EQU   AVTSYSER                                                 01038000
@NM00030 EQU   AVTSYSER                                                 01039000
@NM00029 EQU   AVTSYSER                                                 01040000
AVTCMAXN EQU   AVTSYSER                                                 01041000
AVTCMINN EQU   AVTSYSER                                                 01042000
AVT2260L EQU   IEDQAVTD+724                                             01043000
AVTABEPL EQU   AVTADBUF                                                 01044000
AVTHFF   EQU   AVTCLRHI+2                                               01045000
@NM00028 EQU   AVTCLRHI                                                 01046000
AVTCCLNK EQU   AVTCRELE+5                                               01047000
AVTCCPRI EQU   AVTCRELE+4                                               01048000
AVTCCQCB EQU   AVTCCELE+1                                               01049000
AVTCCKEY EQU   AVTCCELE                                                 01050000
AVTDELAD EQU   IEDQAVTD+704                                             01051000
AVTDELEM EQU   IEDQAVTD+700                                             01052000
AVTBSX   EQU   AVTCKLNK                                                 01053000
AVTOPETR EQU   AVTHG01                                                  01054000
@NM00027 EQU   AVTCKBYT                                                 01055000
AVTCKONQ EQU   AVTCKBYT                                                 01056000
@NM00026 EQU   AVTCKBYT                                                 01057000
@NM00025 EQU   AVTCKBYT                                                 01058000
@NM00024 EQU   AVTCKBYT                                                 01059000
@NM00023 EQU   AVTCKBYT                                                 01060000
@NM00022 EQU   AVTCKBYT                                                 01061000
@NM00021 EQU   AVTCKBYT                                                 01062000
AVTOPERT EQU   IEDQAVTD+690                                             01063000
AVTOPXCL EQU   IEDQAVTD+688                                             01064000
AVTOPERL EQU   IEDQAVTD+687                                             01065000
@NM00020 EQU   IEDQAVTD+686                                             01066000
AVTCKTIM EQU   IEDQAVTD+684                                             01067000
AVTCKELV EQU   IEDQAVTD+682                                             01068000
AVTCPRCD EQU   IEDQAVTD+681                                             01069000
AVTWARMN EQU   AVTCKELF                                                 01070000
AVTCRTLN EQU   AVTCKELF                                                 01071000
AVTCPIPN EQU   AVTCKELF                                                 01072000
AVTCCLCN EQU   AVTCKELF                                                 01073000
AVTCINCN EQU   AVTCKELF                                                 01074000
@NM00019 EQU   AVTCKELF                                                 01075000
AVTCMCPN EQU   AVTCKELF                                                 01076000
AVTNQBCK EQU   AVTCKELF                                                 01077000
AVTCKQAD EQU   IEDQAVTD+677                                             01078000
AVTSCBSZ EQU   IEDQAVTD+676                                             01079000
@NM00018 EQU   IEDQAVTD+672                                             01080000
AVTCKELE EQU   IEDQAVTD+668                                             01081000
@NM00017 EQU   AVTCKPEL+8                                               01082000
AVTCKRLK EQU   AVTCKPEL+5                                               01083000
AVTCKRPR EQU   AVTCKPEL+4                                               01084000
AVTCKRMQ EQU   AVTCKRMV+1                                               01085000
AVTCKRKY EQU   AVTCKRMV                                                 01086000
AVTHK    EQU   IEDQAVTD+648                                             01087000
AVTHI    EQU   IEDQAVTD+644                                             01088000
AVTIOT   EQU   IEDQAVTD+640                                             01089000
AVTNX    EQU   IEDQAVTD+636                                             01090000
AVTTONE  EQU   IEDQAVTD+632                                             01091000
AVTA3TL  EQU   IEDQAVTD+628                                             01092000
AVTDMECB EQU   IEDQAVTD+624                                             01093000
AVTABEND EQU   IEDQAVTD+618                                             01094000
AVTPLCBN EQU   IEDQAVTD+616                                             01095000
@NM00016 EQU   AVTSAVTP+1                                               01096000
@NM00015 EQU   AVTSAVTF                                                 01097000
AVTRAPI  EQU   AVTSAVTF                                                 01098000
AVTLCLST EQU   AVTSAVTF                                                 01099000
AVT370X  EQU   AVTSAVTF                                                 01100000
AVTSNA   EQU   AVTSAVTF                                                 01101000
AVTONSNA EQU   AVTSAVTF                                                 01102000
AVTVTMCP EQU   AVTSAVTF                                                 01103000
AVTTRNOS EQU   IEDQAVTD+608                                             01104000
AVTCMBSS EQU   IEDQAVTD+604                                             01105000
AVTRCV   EQU   IEDQAVTD+600                                             01106000
AVTSEND  EQU   IEDQAVTD+596                                             01107000
AVTCSCH  EQU   IEDQAVTD+592                                             01108000
AVTQ1    EQU   IEDQAVTD+588                                             01109000
AVTE7    EQU   IEDQAVTD+584                                             01110000
AVTHB    EQU   IEDQAVTD+580                                             01111000
AVTR1    EQU   IEDQAVTD+576                                             01112000
AVTBZ    EQU   IEDQAVTD+572                                             01113000
AVTEZ    EQU   IEDQAVTD+568                                             01114000
AVTEC    EQU   IEDQAVTD+564                                             01115000
AVTEW    EQU   IEDQAVTD+560                                             01116000
AVTNDIAL EQU   AVTSCOPT                                                 01117000
AVTN2741 EQU   AVTSCOPT                                                 01118000
AVTCONCO EQU   AVTSCOPT                                                 01119000
AVTCONC  EQU   AVTSCOPT                                                 01120000
AVTCMBUF EQU   AVTSCOPT                                                 01121000
AVTAPDMP EQU   AVTSCOPT                                                 01122000
@NM00014 EQU   AVTSCOPT                                                 01123000
AVTHA    EQU   AVTDISP                                                  01124000
AVTEA    EQU   IEDQAVTD+548                                             01125000
AVTAX    EQU   IEDQAVTD+544                                             01126000
AVTA3    EQU   IEDQAVTD+540                                             01127000
AVTGD    EQU   IEDQAVTD+536                                             01128000
AVTAL    EQU   IEDQAVTD+532                                             01129000
AVTOLTST EQU   AVTHG02                                                  01130000
AVTE8    EQU   IEDQAVTD+524                                             01131000
AVTUI    EQU   IEDQAVTD+520                                             01132000
AVTCOMPT EQU   IEDQAVTD+516                                             01133000
AVTCRSRF EQU   IEDQAVTD+512                                             01134000
@NM00013 EQU   IEDQAVTD+508                                             01135000
AVTKA02  EQU   IEDQAVTD+504                                             01136000
AVTOPTPT EQU   IEDQAVTD+500                                             01137000
AVTPCBPT EQU   IEDQAVTD+496                                             01138000
AVTECBAD EQU   IEDQAVTD+492                                             01139000
AVTOPECA EQU   IEDQAVTD+488                                             01140000
AVTOLECA EQU   IEDQAVTD+484                                             01141000
AVTCKECA EQU   IEDQAVTD+480                                             01142000
AVTCWECA EQU   IEDQAVTD+476                                             01143000
AVTCWTCB EQU   IEDQAVTD+472                                             01144000
AVTOLTCB EQU   IEDQAVTD+468                                             01145000
AVTOCTCB EQU   IEDQAVTD+464                                             01146000
AVTCKTCB EQU   IEDQAVTD+460                                             01147000
AVTAS    EQU   IEDQAVTD+456                                             01148000
AVTNOLBF EQU   IEDQAVTD+454                                             01149000
AVTNCKPR EQU   IEDQAVTD+453                                             01150000
AVTCIB   EQU   IEDQAVTD+452                                             01151000
AVTSPLPT EQU   IEDQAVTD+448                                             01152000
AVTMVBFR EQU   IEDQAVTD+444                                             01153000
AVTSBTA  EQU   IEDQAVTD+440                                             01154000
AVTRARTN EQU   IEDQAVTD+436                                             01155000
AVTBSCAN EQU   IEDQAVTD+432                                             01156000
AVTRDYA  EQU   IEDQAVTD+428                                             01157000
AVTRNMPT EQU   IEDQAVTD+424                                             01158000
AVTDISTR EQU   IEDQAVTD+420                                             01159000
AVTPARM3 EQU   IEDQAVTD+416                                             01160000
@NM00012 EQU   AVTPKF                                                   01161000
@NM00011 EQU   AVTPKF                                                   01162000
@NM00010 EQU   AVTPKF                                                   01163000
AVTFTCHF EQU   AVTPKF                                                   01164000
@NM00009 EQU   AVTPKF                                                   01165000
@NM00008 EQU   AVTPKF                                                   01166000
@NM00007 EQU   AVTPKF                                                   01167000
@NM00006 EQU   AVTPKF                                                   01168000
AVTPARM  EQU   IEDQAVTD+408                                             01169000
AVTEXS2A EQU   IEDQAVTD+402                                             01170000
AVTEXA2S EQU   IEDQAVTD+396                                             01171000
AVTOCGET EQU   IEDQAVTD+392                                             01172000
AVTCKAVT EQU   @NM00004+1                                               01173000
@NM00005 EQU   AVTCKFLG                                                 01174000
AVTCKHLT EQU   AVTCKFLG                                                 01175000
AVTCKREQ EQU   AVTCKFLG                                                 01176000
AVTCKENV EQU   AVTCKFLG                                                 01177000
AVTCKNAC EQU   AVTCKFLG                                                 01178000
AVTCKTAC EQU   AVTCKFLG                                                 01179000
AVTBUENT EQU   IEDQAVTD+386                                             01180000
@NM00003 EQU   IEDQAVTD+385                                             01181000
AVTFULLT EQU   AVTBUFSW                                                 01182000
AVTUNCON EQU   AVTBUFSW                                                 01183000
AVTTRAPI EQU   AVTBUFSW                                                 01184000
@NM00002 EQU   AVTBUFSW                                                 01185000
AVTBUFTR EQU   AVTREADD                                                 01186000
AVTREADY EQU   IEDQAVTD+376                                             01187000
AVTRACE  EQU   IEDQAVTD+372                                             01188000
AVTTCB   EQU   IEDQAVTD+368                                             01189000
AVTPASWD EQU   IEDQAVTD+360                                             01190000
AVTCTLCH EQU   IEDQAVTD+352                                             01191000
AVTDOUBL EQU   IEDQAVTD+344                                             01192000
AVTDOUBX EQU   IEDQAVTD+336                                             01193000
AVTDPARM EQU   IEDQAVTD+332                                             01194000
AVTCSTCS EQU   IEDQAVTD+328                                             01195000
AVTDLQ   EQU   AVTSAVEX+32                                              01196000
@NM00001 EQU   AVTSAVEX                                                 01197000
AVTSAVE4 EQU   IEDQAVTD+216                                             01198000
AVTSAVE3 EQU   IEDQAVTD+144                                             01199000
AVTSAVE2 EQU   IEDQAVTD+72                                              01200000
AVTSAVE1 EQU   IEDQAVTD                                                 01201000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01202000
@ENDDATA EQU   *                                                        01203000
         END   IGC0N10D                                                 01204000
