         TITLE 'IGCA310D, PROCESS TERMINATE-SELF,SESSION ENDED         *00001000
                        '                                               00002000
IGCA310D CSECT ,                                                   0001 00003000
@PROLOG  DS    0H                                                  0002 00004000
*                                                                  0545 00005000
         USING  *,RBASE                                                 00006000
         LR     RBASE,RF            SET UP ADDRESSIBILITY               00007000
IGCA310D IEDHJN START,HJN                                               00008000
*/*                                                                  */ 00009000
*                                                                  0546 00010000
*                                   /* INITIALIZATION                */ 00011000
*   ROPCAVT=RPARM;                  /* OP CONTROL AVT ADDRESS        */ 00012000
         LR    ROPCAVT,RPARM                                       0546 00013000
*   RPRF=OPCCOPCE;                  /* CURRENT ELEMENT ADDRESS       */ 00014000
         L     RPRF,OPCCOPCE(,ROPCAVT)                             0547 00015000
*   RAVT=OPCAVTPT;                  /* TCAM AVT ADDRESS              */ 00016000
         L     RAVT,OPCAVTPT(,ROPCAVT)                             0548 00017000
*   RWORK=OPCWORK;                  /* OP CONTROL WORK AREA          */ 00018000
         L     RWORK,OPCWORK(,ROPCAVT)                             0549 00019000
*   RSAVE=ADDR(OPCSAVE);            /* OP CONTROL SAVE AREA          */ 00020000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                             0550 00021000
*   WKNSPSW=OFF;                    /* INIT SWITCH           @YM07369*/ 00022000
         NI    WKNSPSW(RWORK),B'11011111'                          0551 00023000
*/*                                                                  */ 00024000
*                                                                  0552 00025000
*   IF PRFPRI=PRIHIFLG THEN         /* ELEMENT AN OPCE       @YM07369*/ 00026000
         CLI   PRFPRI(IEDQPPTR),X'E9'                              0552 00027000
         BNE   @RF00552                                            0552 00028000
*     CALL DISCARD;                 /* FREE THE ELEMENT      @YM07369*/ 00029000
         BAL   @14,DISCARD                                         0553 00030000
*   ELSE                            /* THIS IS INIT-         @YM07369*/ 00031000
*     DO;                           /* SELF BUFFER           @YM07369*/ 00032000
         B     @RC00552                                            0554 00033000
@RF00552 DS    0H                                                  0555 00034000
*       IF PRFPRI=PRISSPIU THEN     /* ELEMENT AN PIU                */ 00035000
         CLI   PRFPRI(IEDQPPTR),X'E5'                              0555 00036000
         BNE   @RF00555                                            0555 00037000
*         DO;                                                      0556 00038000
*           WKPIUPTR=ADDR(PRFPIUO)+PRFPIUO;/* ADDRESS OF THE PIU   0557 00039000
*                                      WITHIN THE TCAM BUFFER        */ 00040000
         LA    @09,PRFPIUO(,IEDQPPTR)                              0557 00041000
         SLR   @07,@07                                             0557 00042000
         IC    @07,PRFPIUO(,IEDQPPTR)                              0557 00043000
         ALR   @09,@07                                             0557 00044000
         ST    @09,WKPIUPTR(,RWORK)                                0557 00045000
*           RPARM=TTHTAG;           /* REG1 HAS TNT OF SLU... SET UP    00046000
*                                      BY IEDLUS                     */ 00047000
         SLR   RPARM,RPARM                                         0558 00048000
         ICM   RPARM,3,TTHTAG(@09)                                 0558 00049000
*           CALL IEDQTNT;           /* GET TTE FOR SECONDARY LU      */ 00050000
         L     @15,AVTRNMPT(,RAVT)                                 0559 00051000
         BALR  @14,@15                                             0559 00052000
*           RTRM=RPARM-LENGTH(IEDNTRM);/* SAVE SLU'S TTE             */ 00053000
         LR    RTRM,RPARM                                          0560 00054000
         SL    RTRM,@CF01669                                       0560 00055000
*           CALL SESSEND;           /* PROCESS SESSION ENDED         */ 00056000
         BAL   @14,SESSEND                                         0561 00057000
*         END;                                                     0562 00058000
*       ELSE                                                       0563 00059000
*         DO;                                                      0563 00060000
         B     @RC00555                                            0563 00061000
@RF00555 DS    0H                                                  0564 00062000
*           WKTMSPTR=ADDR(PRFSUNIT)+AVTHDRSZ+PRFISIZE;/* POINTER TO     00063000
*                                      TERM- SELF DATA               */ 00064000
         LA    @09,PRFSUNIT(,IEDQPPTR)                             0564 00065000
         AL    @09,@CF00443                                        0564 00066000
         SLR   @07,@07                                             0564 00067000
         IC    @07,PRFISIZE(,IEDQPPTR)                             0564 00068000
         ALR   @09,@07                                             0564 00069000
         ST    @09,WKTMSPTR(,RWORK)                                0564 00070000
*           WKSLUTNT=PRFSRCE;       /* TNT OF SECONDARY LU           */ 00071000
         LH    @09,PRFSRCE(,IEDQPPTR)                              0565 00072000
         STH   @09,WKSLUTNT(,RWORK)                                0565 00073000
*           RPARM=PRFSRCE;          /* TNT OF SECONDARY LU           */ 00074000
         LR    RPARM,@09                                           0566 00075000
*           CALL IEDQTNT;           /* GET TTE OF SECONDARY LU       */ 00076000
         L     @15,AVTRNMPT(,RAVT)                                 0567 00077000
         BALR  @14,@15                                             0567 00078000
*           RTRM=RPARM-LENGTH(IEDNTRM);/* SAVE TTE OF SECONDARY LU   */ 00079000
         LR    RTRM,RPARM                                          0568 00080000
         SL    RTRM,@CF01669                                       0568 00081000
*           CALL TERMSELF;          /* PROCESS TERMINATE-SELF COMMAND*/ 00082000
         BAL   @14,TERMSELF                                        0569 00083000
*         END;                                                     0570 00084000
*     END;                          /*                       @YM07369*/ 00085000
@RC00555 DS    0H                                                  0572 00086000
*/*                                                                  */ 00087000
*                                                                  0572 00088000
*   RPARM=ROPCAVT;                  /* OP CONTROL AVT ADDRESS        */ 00089000
@RC00552 LR    RPARM,ROPCAVT                                       0572 00090000
*   GEN REFS(ROPCAVT,OPCXCTL) EXIT NOSEQFLOW;                      0573 00091000
         XCTL  SF=(E,OPCXCTL(ROPCAVT))                                  00092000
*BLDCTERM:                                                         0574 00093000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0574 00094000
*                                                                  0574 00095000
BLDCTERM DS    0H                                                  0575 00096000
*/********************************************************************/ 00097000
*/*     THIS ROUTINE BUILDS A CTERM REQUEST IN PIU FORMAT. THE       */ 00098000
*/*     TH, RH AND ALL CTERM FIELDS ARE SET UP. ALSO THE PRIORITY    */ 00099000
*/*     AND THE QCB FIELDS OF THE BUFFER ARE SET UP FOR THE TPOST    */ 00100000
*/********************************************************************/ 00101000
*                                                                  0575 00102000
*   WKSAVE2=RE;                                                    0575 00103000
*                                                                  0575 00104000
         ST    RE,WKSAVE2(,RWORK)                                  0575 00105000
*/*                                                                  */ 00106000
*                                                                  0576 00107000
*   WKCTMBFR->PRFPIUO=1;            /* SET UP OFFSET TO TH           */ 00108000
         L     @09,WKCTMBFR(,RWORK)                                0576 00109000
         LA    @07,1                                               0576 00110000
         STC   @07,PRFPIUO(,@09)                                   0576 00111000
*/*                                                                  */ 00112000
*                                                                  0577 00113000
*                                   /* POINTER TO CTERM PIU          */ 00114000
*   WKCTMPIU=ADDR(WKCTMBFR->PRFPIUO)+WKCTMBFR->PRFPIUO;            0577 00115000
         LA    @09,PRFPIUO(,@09)                                   0577 00116000
         ALR   @09,@07                                             0577 00117000
         ST    @09,WKCTMPIU(,RWORK)                                0577 00118000
*   WKCTMPIU->TTHBYTE0=THCON;       /* PARTIALLY SET UP TH           */ 00119000
         MVI   TTHBYTE0(@09),X'1C'                                 0578 00120000
*   WKCTMPIU->TTHBYTE1=0;           /* PARTIALLY SET UP TH           */ 00121000
         MVI   TTHBYTE1(@09),X'00'                                 0579 00122000
*   WKCTMPIU->TTHOAF=SAVTSCPT;      /* SET SSCP AS OAF               */ 00123000
         L     @07,AVTSAVTP(,RAVT)                                 0580 00124000
         MVC   TTHOAF(2,@09),SAVTSCPT(@07)                         0580 00125000
*   WKCTMPIU->TTHDAF=WKPLUTNT;      /* SET PLU AS DAF                */ 00126000
         MVC   TTHDAF(2,@09),WKPLUTNT(RWORK)                       0581 00127000
*   WKCTMPIU->TTHDCF=LENGTH(IEDRH)+LENGTH(XCTMCMD);/* DATA COUNT   0582 00128000
*                                      FIELD                         */ 00129000
         MVC   TTHDCF(2,@09),@CH00568                              0582 00130000
*   WKCTMPIU->TTHTAG=WKSLUTNT;      /* SET TNT OFFSET IN TAG FLD     */ 00131000
         MVC   TTHTAG(2,@09),WKSLUTNT(RWORK)                       0583 00132000
*   WKCTMPIU->PIURH=CTERMRH;        /* SET UP CTERM RH               */ 00133000
         MVC   PIURH(3,@09),@CB01953                               0584 00134000
*/*                                                                  */ 00135000
*                                                                  0585 00136000
*                                   /* SET UP CTERM FIELDS           */ 00137000
*   WKCTMRU=ADDR(WKCTMPIU->PIURU);  /* CTERM RU POINTER              */ 00138000
         LA    @09,PIURU(,@09)                                     0585 00139000
         ST    @09,WKCTMRU(,RWORK)                                 0585 00140000
*   XCTMCODE=CD1XCTM;               /* SET UP COMMAND CODE           */ 00141000
         MVC   XCTMCODE(3,@09),@CB00746                            0586 00142000
*   XCTMFMT=0;                      /* SET UP FORMAT                 */ 00143000
         MVI   XCTMFMT(@09),X'00'                                  0587 00144000
*   XCTMTYPE=0;                     /* INIT TYPE FIELD       @YM08991*/ 00145000
         MVI   XCTMTYPE(@09),X'00'                                 0588 00146000
*   IF WKTERM=XTMSTRMF THEN         /* FORCED TERMINATE      @YM08991*/ 00147000
         TM    WKTERM(RWORK),B'00010000'                           0589 00148000
         BNZ   @RF00589                                            0589 00149000
*     XCTMTERM=XCTMTRMF;            /* YES, TYPE=FORCED      @YM08991*/ 00150000
         NI    XCTMTERM(@09),B'00101111'                           0590 00151000
         OI    XCTMTERM(@09),B'00100000'                           0590 00152000
*   ELSE                            /* NO,                   @YM08991*/ 00153000
*     XCTMTERM=XCTMTRMO;            /* TYPE=ORDERLY          @YM08991*/ 00154000
         B     @RC00589                                            0591 00155000
@RF00589 L     @09,WKCTMRU(,RWORK)                                 0591 00156000
         NI    XCTMTERM(@09),B'00011111'                           0591 00157000
         OI    XCTMTERM(@09),B'00010000'                           0591 00158000
*   XCTMRSN=0;                      /* SET UP REASON                 */ 00159000
@RC00589 L     @09,WKCTMRU(,RWORK)                                 0592 00160000
         MVI   XCTMRSN(@09),X'00'                                  0592 00161000
*   XCTMRQID=0;                     /* SET UP REQUESTOR ID FIELD     */ 00162000
         MVI   XCTMRQID(@09),X'00'                                 0593 00163000
*   XCTMPWRD=0;                     /* SET UP PASSWORD FIELD         */ 00164000
         MVI   XCTMPWRD(@09),X'00'                                 0594 00165000
*/*                                                                  */ 00166000
*                                                                  0595 00167000
*   RPARM=WKSLUTNT;                 /* SECONDARY LU'S TNT            */ 00168000
         LH    RPARM,WKSLUTNT(,RWORK)                              0595 00169000
         N     RPARM,@CF02042                                      0595 00170000
*   CALL IEDIAP04;                  /* CONVERT TNT TO NET ADDR       */ 00171000
         L     @09,AVTSAVTP(,RAVT)                                 0596 00172000
         L     @15,SAVTTNTX(,@09)                                  0596 00173000
         BALR  @14,@15                                             0596 00174000
*   XCTMSNA=RF;                     /* SET UP SLU'S NET ADDR         */ 00175000
         L     @09,WKCTMRU(,RWORK)                                 0597 00176000
         STCM  RF,3,XCTMSNA(@09)                                   0597 00177000
*/*                                                                  */ 00178000
*                                                                  0598 00179000
*   RE=WKSAVE2;                     /* RESTORE REG14                 */ 00180000
         L     RE,WKSAVE2(,RWORK)                                  0598 00181000
*   END BLDCTERM;                   /* RETURN TO CALLER              */ 00182000
@EL00002 DS    0H                                                  0599 00183000
@EF00002 DS    0H                                                  0599 00184000
@ER00002 BR    @14                                                 0599 00185000
*BLDRESP:                                                          0600 00186000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0600 00187000
*                                                                  0600 00188000
BLDRESP  DS    0H                                                  0601 00189000
*   /*****************************************************************/ 00190000
*   /*                                                               */ 00191000
*   /* THIS ROUTINE BUILDS A RESPONSE TO THE TERMINATE SELF REQUEST  */ 00192000
*   /* IF WKSENSE CONTAINS ZEROS A POSITIVE RESPONSE IS BUILT.       */ 00193000
*   /* OTHERWISE, A NEGATIVE RESPONSE IS BUILT IS BUILT.             */ 00194000
*   /*                                                               */ 00195000
*   /*****************************************************************/ 00196000
*                                                                  0601 00197000
*   WKSAVE2=RE;                     /* SAVE REG 14                   */ 00198000
         ST    RE,WKSAVE2(,RWORK)                                  0601 00199000
*/*                                                                  */ 00200000
*                                                                  0602 00201000
*   PRFPIUO=1;                      /* OFFSET TO PIU                 */ 00202000
         LA    @09,1                                               0602 00203000
         STC   @09,PRFPIUO(,IEDQPPTR)                              0602 00204000
*   WKTMSRSP=ADDR(PRFPIUO)+PRFPIUO; /* ADDRESS OF PIU                */ 00205000
         LA    @07,PRFPIUO(,IEDQPPTR)                              0603 00206000
         ALR   @07,@09                                             0603 00207000
         ST    @07,WKTMSRSP(,RWORK)                                0603 00208000
*   WKTMSRH=ADDR(WKTMSRSP->PIURH);  /* ADDRESS OF RH                 */ 00209000
         LA    @09,PIURH(,@07)                                     0604 00210000
         ST    @09,WKTMSRH(,RWORK)                                 0604 00211000
*/*                                                                  */ 00212000
*                                                                  0605 00213000
*   IF(WKTMSRH->TRHDR1=ON|WKTMSRH->TRHDR2=ON)&/* RSP REQ'D   @YM06067*/ 00214000
*       (WKTMSRH->TRHER=OFF|WKSENSE^=0) THEN/* FOR REQUEST   @YM06067*/ 00215000
         TM    TRHDR1(@09),B'10100000'                             0605 00216000
         BZ    @RF00605                                            0605 00217000
         TM    TRHER(@09),B'00010000'                              0605 00218000
         BZ    @RT00605                                            0605 00219000
         ICM   @09,15,WKSENSE(RWORK)                               0605 00220000
         BZ    @RF00605                                            0605 00221000
@RT00605 DS    0H                                                  0606 00222000
*     DO;                           /* SEND RESPONSE         @YM06067   00223000
*                                      SET UP TH AND RH              */ 00224000
*       WKTMSRSP->TTHBYTE0=THCON;   /* SET UP FIRST BYTE             */ 00225000
         L     @09,WKTMSRSP(,RWORK)                                0607 00226000
         MVI   TTHBYTE0(@09),X'1C'                                 0607 00227000
*       WKTMSRSP->TTHBYTE1=0;       /* SET UP SECOND BYTE            */ 00228000
         MVI   TTHBYTE1(@09),X'00'                                 0608 00229000
*       WKTMSRSP->TTHDAF=WKSLUTNT;  /* SET UP DESTINATION            */ 00230000
         MVC   TTHDAF(2,@09),WKSLUTNT(RWORK)                       0609 00231000
*       WKTMSRSP->TTHOAF=SAVTSCPT;  /* SET UP ORIGIN                 */ 00232000
         L     @07,AVTSAVTP(,RAVT)                                 0610 00233000
         MVC   TTHOAF(2,@09),SAVTSCPT(@07)                         0610 00234000
*       WKTMSRSP->TTHSNF=PRF1SQID;  /* SET UP SEQUENCE NO            */ 00235000
         LR    @07,IEDQPPTR                                        0611 00236000
         SL    @07,@CF00045                                        0611 00237000
         MVC   TTHSNF(2,@09),PRF1SQID(@07)                         0611 00238000
*       WKTMSRSP->PIURH=PRF1RH;     /* SET UP RH                     */ 00239000
         MVC   PIURH(3,@09),PRF1RH(@07)                            0612 00240000
*       WKTMSRH->TRHTYPE=ON;        /* SET RESPONSE BIT ON           */ 00241000
         L     @09,WKTMSRH(,RWORK)                                 0613 00242000
         OI    TRHTYPE(@09),B'10000000'                            0613 00243000
*       IF PRF1USS=ON THEN          /* ORIGINALLY UNFORMATED?        */ 00244000
         TM    PRF1USS(@07),B'00001000'                            0614 00245000
         BNO   @RF00614                                            0614 00246000
*         WKTMSRH->TRHFI=OFF;       /* MARK UNFORMATTED              */ 00247000
         NI    TRHFI(@09),B'11110111'                              0615 00248000
*/*                                                                  */ 00249000
*                                                                  0616 00250000
*       IF WKSENSE=0 THEN           /* GOOD RESP TO BE BUILT         */ 00251000
@RF00614 ICM   @09,15,WKSENSE(RWORK)                               0616 00252000
         BNZ   @RF00616                                            0616 00253000
*         DO;                                                      0617 00254000
*           WKTMSRSP->COMMAND=CD1XTMS;/* SET UP COMMAND CODE         */ 00255000
         L     @09,WKTMSRSP(,RWORK)                                0618 00256000
         MVC   COMMAND(3,@09),@CB00740                             0618 00257000
*           WKTMSRSP->TTHDCF=LENGTH(XTMSCODE)+LENGTH(IEDRH);/* DATA     00258000
*                                      COUNT                         */ 00259000
         MVC   TTHDCF(2,@09),@CH00071                              0619 00260000
*           IF PRF1USS=ON THEN      /* ORIGINALLY UNFORMATED         */ 00261000
         LR    @07,IEDQPPTR                                        0620 00262000
         AL    @07,@CF02045                                        0620 00263000
         TM    PRF1USS-3(@07),B'00001000'                          0620 00264000
         BNO   @RF00620                                            0620 00265000
*             WKTMSRSP->TTHDCF=LENGTH(IEDRH);/* DON'T RETURN DATA    */ 00266000
         MVC   TTHDCF(2,@09),@CH00066                              0621 00267000
*         END;                                                     0622 00268000
*       ELSE                        /* NEGATIVE RESPONSE             */ 00269000
*         DO;                                                      0623 00270000
         B     @RC00616                                            0623 00271000
@RF00616 DS    0H                                                  0624 00272000
*           WKTMSRH->TRHER=ON;      /* SET ERROR RESPONSE            */ 00273000
         L     @09,WKTMSRH(,RWORK)                                 0624 00274000
         OI    TRHER(@09),B'00010000'                              0624 00275000
*           WKTMSRH->TRHSDI=ON;     /* SET SENSE INCLUDED            */ 00276000
         OI    TRHSDI(@09),B'00000100'                             0625 00277000
*           WKTMSRSP->TTHDCF=LENGTH(IEDRH)+LENGTH(TMSERRSP);/* DATA     00278000
*                                      COUNT                         */ 00279000
         L     @09,WKTMSRSP(,RWORK)                                0626 00280000
         MVC   TTHDCF(2,@09),@CH01146                              0626 00281000
*           WKTMSRSP->TMSCMD=CD1XTMS;/* SET UP COMMAND CODE          */ 00282000
         MVC   TMSCMD(3,@09),@CB00740                              0627 00283000
*           WKTMSRSP->TMSSENSE=WKSENSE;/* SET UP SENSE               */ 00284000
         MVC   TMSSENSE(4,@09),WKSENSE(RWORK)                      0628 00285000
*           IF PRF1USS=ON THEN      /* ORIGINALLY UNFORMATED         */ 00286000
         LR    @07,IEDQPPTR                                        0629 00287000
         AL    @07,@CF02045                                        0629 00288000
         TM    PRF1USS-3(@07),B'00001000'                          0629 00289000
         BNO   @RF00629                                            0629 00290000
*             DO;                   /*                       @YM06472*/ 00291000
*               WKTMSRSP->TTHDCF=LENGTH(IEDRH)+LENGTH(IEDSNSD);/*  0631 00292000
*                                      DON'T RETURN COMMAND          */ 00293000
         MVC   TTHDCF(2,@09),@CH00573                              0631 00294000
*               CALL NSPBLD;        /* BUILD N. S. PROC      @YM06472*/ 00295000
         BAL   @14,NSPBLD                                          0632 00296000
*             END;                  /*                       @YM06472*/ 00297000
*         END;                                                     0634 00298000
@RF00629 DS    0H                                                  0635 00299000
*       IEDPF2=IEDPF2&&IEDPF2;      /* CLEAR PREFIX          @YM05723*/ 00300000
@RC00616 LR    @09,IEDQPPTR                                        0635 00301000
         SL    @09,@CF00045                                        0635 00302000
         XC    IEDPF2(8,@09),IEDPF2(@09)                           0635 00303000
*       PRF2TNTI=ON;                /* INDICATE PIU CONTAINS TNT   0636 00304000
*                                      OFFSETS               @YM05723*/ 00305000
         OI    PRF2TNTI(@09),B'10000000'                           0636 00306000
*       PRFPRI=PRIOUTBD;            /* SET PRIORITY                  */ 00307000
         MVI   PRFPRI(IEDQPPTR),X'E4'                              0637 00308000
*       PRFQCBA=SAVTDFCO;           /* SET QCB ADDRESS               */ 00309000
         L     @09,AVTSAVTP(,RAVT)                                 0638 00310000
         MVC   PRFQCBA(3,IEDQPPTR),SAVTDFCO+1(@09)                 0638 00311000
*     END;                          /*                       @YM06067*/ 00312000
*   ELSE                                                           0640 00313000
*     DO;                           /* ELSE RETURN BUFFER    @YM06067*/ 00314000
         B     @RC00605                                            0640 00315000
@RF00605 DS    0H                                                  0641 00316000
*       PRFNBUNT=0;                 /* TO TCAM BUF RTN       @YM06067*/ 00317000
         MVI   PRFNBUNT(IEDQPPTR),X'00'                            0641 00318000
*       PRFPRI=PRIBFRTB;            /* NOT TO OP CTL BUF     @YM06067*/ 00319000
         MVI   PRFPRI(IEDQPPTR),X'E0'                              0642 00320000
*       PRFQCBA=ADDR(AVTBFRTB);     /* RET RETURN            @YM06067*/ 00321000
         LA    @09,AVTBFRTB(,RAVT)                                 0643 00322000
         STCM  @09,7,PRFQCBA(IEDQPPTR)                             0643 00323000
*     END;                          /*                       @YM06067*/ 00324000
*/*                                                                  */ 00325000
*                                                                  0645 00326000
*   RE=WKSAVE2;                     /* RESTORE REG 14                */ 00327000
@RC00605 L     RE,WKSAVE2(,RWORK)                                  0645 00328000
*   END BLDRESP;                    /* RETURN TO CALLLER             */ 00329000
@EL00003 DS    0H                                                  0646 00330000
@EF00003 DS    0H                                                  0646 00331000
@ER00003 BR    @14                                                 0646 00332000
*DISCARD:                                                          0647 00333000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0647 00334000
*                                                                  0647 00335000
DISCARD  DS    0H                                                  0648 00336000
*   /*****************************************************************/ 00337000
*   /*                                                               */ 00338000
*   /* THIS ROUTINE FREES THE OPCE AND ATTACHED N.S PROC RESPONSE    */ 00339000
*   /*                                                               */ 00340000
*   /*****************************************************************/ 00341000
*                                                                  0648 00342000
*   WKSAVE1=RE;                     /* SAVE REG 14           @YM07369*/ 00343000
         ST    RE,WKSAVE1(,RWORK)                                  0648 00344000
*/*                                                          @YM07369*/ 00345000
*                                                                  0649 00346000
*   RPARM=ROPCE;                    /* ADDR OF OPCE          @YM07369*/ 00347000
         LR    RPARM,ROPCE                                         0649 00348000
*   CALL FREEBUF;                   /* FREE N.S.PROC RSP     @YM07369*/ 00349000
         L     @15,OPCFREBF(,ROPCAVT)                              0650 00350000
         BALR  @14,@15                                             0650 00351000
*   OPCMODID=DSPOPCTL;              /* XCTL TO '00'          @YM07369*/ 00352000
         MVC   OPCMODID(2,ROPCAVT),@CC01937                        0651 00353000
*   RZERO=0;                        /* CLEAR REG 0           @YM07369*/ 00354000
         SLR   RZERO,RZERO                                         0652 00355000
*/*                                                          @YM07369*/ 00356000
*                                                                  0653 00357000
*   RE=WKSAVE1;                     /* RESTORE REG 14        @YM07369*/ 00358000
         L     RE,WKSAVE1(,RWORK)                                  0653 00359000
*   END DISCARD;                    /* RETURN TO CALLER      @YM07369*/ 00360000
@EL00004 DS    0H                                                  0654 00361000
@EF00004 DS    0H                                                  0654 00362000
@ER00004 BR    @14                                                 0654 00363000
*ERRORCHK:                                                         0655 00364000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0655 00365000
ERRORCHK DS    0H                                                  0656 00366000
*   WKSAVE2=RE;                     /* SAVE REG 14                   */ 00367000
         ST    RE,WKSAVE2(,RWORK)                                  0656 00368000
*/*                                                                  */ 00369000
*                                                                  0657 00370000
*   IF WKFOUND=ON THEN              /* SUCESSFUL                     */ 00371000
         TM    WKFOUND(RWORK),B'10000000'                          0657 00372000
         BNO   @RF00657                                            0657 00373000
*/*                                                                  */ 00374000
*                                                                  0658 00375000
*                                   /* SIB EXISTS FOR LU-LU SESSION  */ 00376000
*     IF TRMSIBPT>0&TRMSIBPT->SIBINDEX^=SAVTSCPT THEN              0658 00377000
*                                                                  0658 00378000
         SLR   @09,@09                                             0658 00379000
         ICM   @09,7,TRMSIBPT(RTRM)                                0658 00380000
         LTR   @09,@09                                             0658 00381000
         BNP   @RF00658                                            0658 00382000
         L     @07,AVTSAVTP(,RAVT)                                 0658 00383000
         CLC   SIBINDEX(2,@09),SAVTSCPT(@07)                       0658 00384000
         BE    @RF00658                                            0658 00385000
*/*                                                                  */ 00386000
*                                                                  0659 00387000
*       IF TRMSIBPT->SIBINDEX=WKPLUTNT THEN/* IN SESSION WITH      0659 00388000
*                                      TERMINAL SPECIFIED IN REQUEST */ 00389000
         CLC   SIBINDEX(2,@09),WKPLUTNT(RWORK)                     0659 00390000
         BNE   @RF00659                                            0659 00391000
*         IF TRMSIBPT->SIBTERM=OFF THEN/* NO TERMINATE IN PROGRESS   */ 00392000
         TM    SIBTERM(@09),B'01000000'                            0660 00393000
         BNZ   @RF00660                                            0660 00394000
*           DO;                                                    0661 00395000
*             TRMSIBPT->SIBTERM=ON; /* SET TERM IN PROGRESS          */ 00396000
         OI    SIBTERM(@09),B'01000000'                            0662 00397000
*/*                                                                  */ 00398000
*                                                                  0663 00399000
*             IF TRMSIBPT->SIBSSTAT=SIBSACTV THEN/* SIB STATE ACTIVE */ 00400000
         TM    SIBSSTAT(@09),B'00011100'                           0663 00401000
         BNO   @RF00663                                            0663 00402000
*               WKCTERM=ON;         /* SEND GOOD RSP AND CTERM       */ 00403000
         OI    WKCTERM(RWORK),B'01000000'                          0664 00404000
*             ELSE                                                 0665 00405000
*               ;                   /* LU-LU SESSION GOING DOWN    0665 00406000
*                                      BECAUSE OF TCAM FUNCTION SEND    00407000
*                                      GOOD RSP BUT NO CTERM         */ 00408000
@RF00663 DS    0H                                                  0666 00409000
*           END;                                                   0666 00410000
*         ELSE                      /* TERMINATE IS IN PROGRESS      */ 00411000
*           WKSENSE=NMODESNS;       /* SEND ERROR RESPONSE           */ 00412000
         B     @RC00660                                            0667 00413000
@RF00660 MVC   WKSENSE(4,RWORK),NMODESNS                           0667 00414000
*       ELSE                        /* NOT IN SESSION WITH TERMINAL     00415000
*                                      SPECIFIED                     */ 00416000
*         WKSENSE=SESERSNS;         /* SEND ERROR RESPONSE           */ 00417000
         B     @RC00659                                            0668 00418000
@RF00659 MVC   WKSENSE(4,RWORK),SESERSNS                           0668 00419000
*     ELSE                          /* NO LU-LU SESSION EXISTS       */ 00420000
*       WKSENSE=NACTVSNS;           /* SEND ERROR RESPONSE           */ 00421000
         B     @RC00658                                            0669 00422000
@RF00658 MVC   WKSENSE(4,RWORK),NACTVSNS                           0669 00423000
*   ELSE                            /* NOT ABLE TO RESLOVE THE NAME     00424000
*                                      FROM TERM-SELF                */ 00425000
*     WKSENSE=SESERSNS;             /* SEND ERROR RESPONSE           */ 00426000
         B     @RC00657                                            0670 00427000
@RF00657 MVC   WKSENSE(4,RWORK),SESERSNS                           0670 00428000
*/*                                                                  */ 00429000
*                                                                  0671 00430000
*   RE=WKSAVE2;                     /* RESTORE REG 14                */ 00431000
@RC00657 L     RE,WKSAVE2(,RWORK)                                  0671 00432000
*   END ERRORCHK;                   /* RETURN TO CALLER              */ 00433000
@EL00005 DS    0H                                                  0672 00434000
@EF00005 DS    0H                                                  0672 00435000
@ER00005 BR    @14                                                 0672 00436000
*NAMESRCH:                                                         0673 00437000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0673 00438000
*                                                                  0673 00439000
NAMESRCH DS    0H                                                  0674 00440000
*   /*****************************************************************/ 00441000
*   /*                                                               */ 00442000
*   /* THIS ROUTINE TRIES TO FIND A TNT OFFSET FOR A GIVEN TERMINAL  */ 00443000
*   /* NAME. FIRST THE MH TABLE IS SCANED TO DETERMINE IF THE NAME IS*/ 00444000
*   /* THERE. IF THE NAME IS NOT IN THE MH TABLE THEN IEDQA1 IS      */ 00445000
*   /* CALLED TO SCAN THE TERMINAL TABLE. IF THE NAME IS FOUND IT IS */ 00446000
*   /* SAVED IN A LOCAL FIELD AND A SWITCH SET TO INDICATE THIS.     */ 00447000
*   /*                                                               */ 00448000
*   /*****************************************************************/ 00449000
*                                                                  0674 00450000
*   WKSAVE2=RE;                     /* SAVE REG 14                   */ 00451000
         ST    RE,WKSAVE2(,RWORK)                                  0674 00452000
*/*                                                                  */ 00453000
*                                                                  0675 00454000
*                                   /* INITIALIZATION                */ 00455000
*   WKPLUTNT=SAVTMHDX;              /* MH TABLE FIRST TNT OFFSET     */ 00456000
         L     @09,AVTSAVTP(,RAVT)                                 0675 00457000
         LH    @07,SAVTMHDX(,@09)                                  0675 00458000
         N     @07,@CF02042                                        0675 00459000
         STH   @07,WKPLUTNT(,RWORK)                                0675 00460000
*   WKTABPTR=SAVTMHTB;              /* MH TABLE FIRST ENTRY ADDR     */ 00461000
         L     @09,SAVTMHTB(,@09)                                  0676 00462000
         ST    @09,WKTABPTR(,RWORK)                                0676 00463000
*/*                                                                  */ 00464000
*                                                                  0677 00465000
*                                   /* MATCH NOT FOUND AND NOT END OF   00466000
*                                      TABLE                         */ 00467000
*   DO WHILE WKFOUND=OFF&WKTABPTR->ENDDATA^=NOTFOUND;              0677 00468000
         B     @DE00677                                            0677 00469000
@DL00677 DS    0H                                                  0678 00470000
*     IF WKTABPTR->MHNAME=WKNAME THEN/* NAMES MATCH                  */ 00471000
         L     @09,WKTABPTR(,RWORK)                                0678 00472000
         CLC   MHNAME(8,@09),WKNAME(RWORK)                         0678 00473000
         BNE   @RF00678                                            0678 00474000
*       WKFOUND=ON;                 /* SET FOUND SWITCH ON           */ 00475000
         OI    WKFOUND(RWORK),B'10000000'                          0679 00476000
*     ELSE                          /* NAMES DON'T MATCH             */ 00477000
*       DO;                                                        0680 00478000
         B     @RC00678                                            0680 00479000
@RF00678 DS    0H                                                  0681 00480000
*         WKPLUTNT=WKPLUTNT+1;      /* ADD 1 TO TNT COUNTER          */ 00481000
         LA    @09,1                                               0681 00482000
         LH    @07,WKPLUTNT(,RWORK)                                0681 00483000
         N     @07,@CF02042                                        0681 00484000
         ALR   @09,@07                                             0681 00485000
         STH   @09,WKPLUTNT(,RWORK)                                0681 00486000
*         WKTABPTR=WKTABPTR+LENGTH(IEDMHTD);/* BUMP TO NEXT ENTRY    */ 00487000
         LA    @09,12                                              0682 00488000
         AL    @09,WKTABPTR(,RWORK)                                0682 00489000
         ST    @09,WKTABPTR(,RWORK)                                0682 00490000
*       END;                                                       0683 00491000
*   END;                                                           0684 00492000
@RC00678 DS    0H                                                  0684 00493000
@DE00677 TM    WKFOUND(RWORK),B'10000000'                          0684 00494000
         BNZ   @DC00677                                            0684 00495000
         L     @09,WKTABPTR(,RWORK)                                0684 00496000
         CLI   ENDDATA(@09),255                                    0684 00497000
         BNE   @DL00677                                            0684 00498000
@DC00677 DS    0H                                                  0685 00499000
*   IF WKFOUND=OFF THEN             /* MATCH MOT FOUND               */ 00500000
         TM    WKFOUND(RWORK),B'10000000'                          0685 00501000
         BNZ   @RF00685                                            0685 00502000
*     DO;                                                          0686 00503000
*       RZERO=TNTENLEN;             /* GET TNT ENTRY LENGTH          */ 00504000
         L     @09,AVTRNMPT(,RAVT)                                 0687 00505000
         SLR   RZERO,RZERO                                         0687 00506000
         IC    RZERO,TNTENLEN(,@09)                                0687 00507000
*       RPARM=ADDR(WKNAME);         /* ADDRESS OF THE NAME           */ 00508000
         LA    RPARM,WKNAME(,RWORK)                                0688 00509000
*       RF=A1VCON;                  /* VCON FOR IEDQA1               */ 00510000
         L     @09,AVTMSGS-1(,RAVT)                                0689 00511000
         L     RF,A1VCON(,@09)                                     0689 00512000
*       GEN(BAL  RE,4(RF));         /* FIND TNT FOR THIS NAME        */ 00513000
         BAL  RE,4(RF)                                                  00514000
*       IF RF>0 THEN                /* SUCESSFUL ... YES             */ 00515000
         LTR   RF,RF                                               0691 00516000
         BNP   @RF00691                                            0691 00517000
*         DO;                                                      0692 00518000
*           WKFOUND=ON;             /* SET FOUND SWITCH              */ 00519000
         OI    WKFOUND(RWORK),B'10000000'                          0693 00520000
*           WKPLUTNT=RF;            /* SAVE THE TNT OFFSET           */ 00521000
         STH   RF,WKPLUTNT(,RWORK)                                 0694 00522000
*         END;                                                     0695 00523000
*     END;                                                         0696 00524000
*                                                                  0696 00525000
@RF00691 DS    0H                                                  0697 00526000
*/*                                                                  */ 00527000
*                                                                  0697 00528000
*   RE=WKSAVE2;                     /* RESTORE REG 14                */ 00529000
@RF00685 L     RE,WKSAVE2(,RWORK)                                  0697 00530000
*   END NAMESRCH;                   /* RETURN TO CALLER              */ 00531000
@EL00006 DS    0H                                                  0698 00532000
@EF00006 DS    0H                                                  0698 00533000
@ER00006 BR    @14                                                 0698 00534000
*NSPBLD:                                                           0699 00535000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0699 00536000
*                                                                  0699 00537000
NSPBLD   DS    0H                                                  0700 00538000
*   /*****************************************************************/ 00539000
*   /*                                                               */ 00540000
*   /* THIS ROUTINE BUILDS A N. S. PROC ERROR TO AN UNFORMATTED      */ 00541000
*   /* SYSTEM SERVICE REQUEST. THE N.S.PROC ERROR WILL BE CONVERTED  */ 00542000
*   /* INTO A USS REPLY ON THE SSCP MH.                              */ 00543000
*   /*                                                               */ 00544000
*   /*****************************************************************/ 00545000
*                                                                  0700 00546000
*   WKSAVE3=RE;                     /* SAVE REG 14           @YM07369*/ 00547000
         ST    RE,WKSAVE3(,RWORK)                                  0700 00548000
*/*                                                          @YM07369*/ 00549000
*                                                                  0701 00550000
*   WKNSPSW=ON;                     /* NSP SWITCH=ON         @YM07369*/ 00551000
         OI    WKNSPSW(RWORK),B'00100000'                          0701 00552000
*   RPARM=2;                        /* GET 2 UNITS           @YM07369*/ 00553000
         LA    RPARM,2                                             0702 00554000
*   CALL ALLOCBUF;                  /* GET A BUFFER          @YM07369*/ 00555000
         L     @15,OPCGETBF(,ROPCAVT)                              0703 00556000
         BALR  @14,@15                                             0703 00557000
*   OPCCOPCE=RPARM;                 /* CURRENT ELEMENT       @YM07369*/ 00558000
         ST    RPARM,OPCCOPCE(,ROPCAVT)                            0704 00559000
*   ROPCE=RPARM;                    /* OPCE ADDRESS          @YM07369*/ 00560000
         LR    ROPCE,RPARM                                         0705 00561000
*   OCELMPRI=PRIHIFLG;              /* SET PRIORITY          @YM07369*/ 00562000
         MVI   OCELMPRI(ROPCE),X'E9'                               0706 00563000
*   OCACTREQ=ON;                    /* '02' INDICATOR        @YM07369*/ 00564000
         OI    OCACTREQ(ROPCE),B'00001000'                         0707 00565000
*   OCWTG=THISMOD;                  /* RETURN TO 'A3'        @YM07369*/ 00566000
         MVC   OCWTG(2,ROPCE),@CC01941                             0708 00567000
*/*                                                          @YM07369*/ 00568000
*                                                                  0709 00569000
*   PRURHTH=NSPRHTH;                /* SET UP RH TH          @YM07369*/ 00570000
         L     @09,OCUNIT(,ROPCE)                                  0709 00571000
         LR    @07,@09                                             0709 00572000
         SL    @07,@CF00045                                        0709 00573000
         MVC   PRURHTH(4,@07),@CB01955                             0709 00574000
*   PRUTTCIN=WKSLUTNT;              /* DESTINATION           @YM07369*/ 00575000
         LH    @11,WKSLUTNT(,RWORK)                                0710 00576000
         N     @11,@CF02042                                        0710 00577000
         STH   @11,PRUTTCIN(,@09)                                  0710 00578000
*   PRUDATCT=XNSPLEN;               /* DATA LENGTH           @YM07369*/ 00579000
         MVC   PRUDATCT(2,@09),@CH01866                            0711 00580000
*   PRUTHUSS=ON;                    /* CONVERT INDICATOR     @YM07369*/ 00581000
         OI    PRUTHUSS(@07),B'00000010'                           0712 00582000
*   XNSPCODE=CD1XNSP;               /* SET COMMAND CODE      @YM07369*/ 00583000
         AL    @09,@CF00239                                        0713 00584000
         MVC   XNSPCODE(3,@09),@CB00748                            0713 00585000
*   XNSPRSN='31'X;                  /* SET REASON            @YM07369*/ 00586000
         MVI   XNSPRSN(@09),X'31'                                  0714 00587000
*   XNSPPTYP=0;                     /* ZERO NAME FIELD       @YM07369*/ 00588000
         MVI   XNSPPTYP(@09),X'00'                                 0715 00589000
*   XNSPSTYP=0;                     /* ZERO NAME FIELD       @YM07369*/ 00590000
         MVI   XNSPSTYP(@09),X'00'                                 0716 00591000
*   XNSPSENS=0;                     /* ZERO SENSE FIELD      @YM07369*/ 00592000
         SLR   @07,@07                                             0717 00593000
         STCM  @07,15,XNSPSENS(@09)                                0717 00594000
*   XNSPSKEY=0;                     /* ZERO SESSION KEY      @YM07369*/ 00595000
         MVI   XNSPSKEY(@09),X'00'                                 0718 00596000
*/*                                                          @YM07369*/ 00597000
*                                                                  0719 00598000
*   RE=WKSAVE3;                     /* RESTORE REG 14        @YM07369*/ 00599000
         L     RE,WKSAVE3(,RWORK)                                  0719 00600000
*   END NSPBLD;                     /* RETURN TO CALLER      @YM07369*/ 00601000
@EL00007 DS    0H                                                  0720 00602000
@EF00007 DS    0H                                                  0720 00603000
@ER00007 BR    @14                                                 0720 00604000
*SESSEND:                                                          0721 00605000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0721 00606000
*                                                                  0721 00607000
SESSEND  DS    0H                                                  0722 00608000
*   /*****************************************************************/ 00609000
*   /*                                                               */ 00610000
*   /* THIS ROUTINE PROCESSES A SESSION ENDED REQUEST. A CHECK IS    */ 00611000
*   /* MADE TO DETERMINE IF REQUEST DISCONTACT WAS RECEIVED. IF      */ 00612000
*   /* RECEIVED THE ELEMENT IS PASSED TO IGCAA10D. OTHERWISE, THE    */ 00613000
*   /* ELEMENT IS FREED AND CONTROL PASSED TO IGC0010D. IN BOTH CASES*/ 00614000
*   /* THE LU-LU SIB IS FREED.                                       */ 00615000
*   /*                                                               */ 00616000
*   /*****************************************************************/ 00617000
*                                                                  0722 00618000
*   WKSAVE1=RE;                     /* SAVE REG 14                   */ 00619000
         ST    RE,WKSAVE1(,RWORK)                                  0722 00620000
*/*                                                                  */ 00621000
*                                                                  0723 00622000
*   IF TRMSIBPT->SIBRDSCN=ON THEN   /* REQ DISCONTACT RECEIVED       */ 00623000
         SLR   @09,@09                                             0723 00624000
         ICM   @09,7,TRMSIBPT(RTRM)                                0723 00625000
         TM    SIBRDSCN(@09),B'00100000'                           0723 00626000
         BNO   @RF00723                                            0723 00627000
*     OPCMODID=RQDSCMOD;            /* SEND ELEMENT TO IGCAA10D      */ 00628000
         MVC   OPCMODID(2,ROPCAVT),@CC01943                        0724 00629000
*   ELSE                            /* REQ DISCONTACT NOT RECEIVED   */ 00630000
*     DO;                                                          0725 00631000
         B     @RC00723                                            0725 00632000
@RF00723 DS    0H                                                  0726 00633000
*       RPARM=RPRF;                 /* BUFFER TO BE FREED            */ 00634000
         LR    RPARM,RPRF                                          0726 00635000
*       CALL FREEBUF;               /* FREE THE BUFFER               */ 00636000
         L     @15,OPCFREBF(,ROPCAVT)                              0727 00637000
         BALR  @14,@15                                             0727 00638000
*       RZERO=0;                    /* CLEAR REG ZERO                */ 00639000
         SLR   RZERO,RZERO                                         0728 00640000
*       OPCMODID=DSPOPCTL;          /* RETURN TO 00                  */ 00641000
         MVC   OPCMODID(2,ROPCAVT),@CC01937                        0729 00642000
*     END;                                                         0730 00643000
*                                                                  0730 00644000
*/*                                                                  */ 00645000
*                                                                  0731 00646000
*                                   /* FREE THE SIB                  */ 00647000
*   REQTYPE=REQSFREE;               /* INDICATOR TO FREE SIB         */ 00648000
@RC00723 LA    @09,89                                              0731 00649000
         ALR   @09,RWORK                                           0731 00650000
         MVI   REQTYPE(@09),X'04'                                  0731 00651000
*   REQQCBA=SAVTXTRQ;               /* POSTWAIT QCB                  */ 00652000
         L     @07,AVTSAVTP(,RAVT)                                 0732 00653000
         MVC   REQQCBA(3,@09),SAVTXTRQ+1(@07)                      0732 00654000
*   REQPRI=PRISIBRQ;                /* FREE SIB PRIORITY             */ 00655000
         MVI   REQPRI(@09),X'E5'                                   0733 00656000
*   REQRQCBA=ADDR(OPCPWQCB);        /* OP COB QCB            @YM08403*/ 00657000
         LA    @07,OPCPWQCB(,ROPCAVT)                              0734 00658000
         STCM  @07,7,REQRQCBA(@09)                                 0734 00659000
*   REQRPRI=PRISIBRQ;               /* RETURN PRIORITY               */ 00660000
         MVI   REQRPRI(@09),X'E5'                                  0735 00661000
*   REQSTTE=RTRM+LENGTH(IEDNTRM);   /* TTE FOR THE SLU               */ 00662000
         LA    @07,14                                              0736 00663000
         ALR   @07,RTRM                                            0736 00664000
         ST    @07,REQSTTE(,@09)                                   0736 00665000
*   REQSTNT=TRMSIBPT->SIBINDEX;     /* INDEX OF ORIGINATOR           */ 00666000
         SLR   @07,@07                                             0737 00667000
         ICM   @07,7,TRMSIBPT(RTRM)                                0737 00668000
         LH    @07,SIBINDEX(,@07)                                  0737 00669000
         N     @07,@CF02042                                        0737 00670000
         STH   @07,REQSTNT(,@09)                                   0737 00671000
*/*                                                                  */ 00672000
*                                                                  0738 00673000
*   RPARM=ADDR(WKREQELE);           /* ADDRESS OF REQUEST ELE        */ 00674000
         LA    RPARM,WKREQELE(,RWORK)                              0738 00675000
*   CALL POSTWAIT;                  /* FREE THE SIB                  */ 00676000
         L     @15,OPCPSTWT(,ROPCAVT)                              0739 00677000
         BALR  @14,@15                                             0739 00678000
*/*                                                                  */ 00679000
*/*                                                                  */ 00680000
*                                                                  0740 00681000
*   RE=WKSAVE1;                     /* RESTORE REG 14                */ 00682000
         L     RE,WKSAVE1(,RWORK)                                  0740 00683000
*   END SESSEND;                    /* RETURN TO CALLER              */ 00684000
@EL00008 DS    0H                                                  0741 00685000
@EF00008 DS    0H                                                  0741 00686000
@ER00008 BR    @14                                                 0741 00687000
*TERMSELF:                                                         0742 00688000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0742 00689000
*                                                                  0742 00690000
TERMSELF DS    0H                                                  0743 00691000
*/********************************************************************/ 00692000
*/*      THIS ROUTINE PROCESSES THE TERMINATE-SELF COMMAND.          */ 00693000
*/*      THERE ARE TWO CASES TO CONSIDER WHEN THE TERMINATE-         */ 00694000
*/*      SELF REQUEST ARRIVES.                                       */ 00695000
*/*      1. SOME ERROR CONDITION EXISTS TO PREVENT THE PROCESSING    */ 00696000
*/*         OF THE TERMINATE-SELF. (NAME IN THE TERM-SELF CANNOT     */ 00697000
*/*         BE RESOLVED, NO LU-LU SIB EXISTS, NOT IN SESSION WITH    */ 00698000
*/*         THE NAME SPECIFIED IN TERM-SELF, OR A TERMINATE IS       */ 00699000
*/*         ALREADY IN PROGRESS.                                     */ 00700000
*/*        A. BUILD AN ERROR RESPONSE AND TPOST TO IEDDFOUT.         */ 00701000
*/*        B. IF USS REQUEST BUILD OPCE WITH ATTACHED N. S.  @YM07369*/ 00702000
*/*           PROCEDURE REQUEST.                             @YM07369*/ 00703000
*/*                                                                  */ 00704000
*/*      2. NO ERROR CONDITIONS.                                     */ 00705000
*/*         A. BUILD A POSITIVE RESPONSE AND TPOST TO IEDDFOUT.      */ 00706000
*/*         B. SET TERMINATE IN PROGRESS  IN THE SIB                 */ 00707000
*/*         C. DETERMINE IF A CTERM IS NEEDED (SOME CONDITIONS IN    */ 00708000
*/*            TCAM (IEDHALT, ETC) WILL CAUSE SESSION TERMINATION    */ 00709000
*/*         D. IF NEEDED BUILD CTERM REQUEST AND TPOST TO IEDLUS.    */ 00710000
*/*                                                                  */ 00711000
*/********************************************************************/ 00712000
*/*                                                                  */ 00713000
*                                                                  0743 00714000
*   WKSAVE1=RE;                     /* SAVE REG 14                   */ 00715000
         ST    RE,WKSAVE1(,RWORK)                                  0743 00716000
*/*                                                                  */ 00717000
*                                                                  0744 00718000
*   WKSENSE=0;                      /* INITIALIZE SENSE              */ 00719000
         SLR   @09,@09                                             0744 00720000
         STCM  @09,15,WKSENSE(RWORK)                               0744 00721000
*   WKCTERM=OFF;                    /* INITIALIZE CTERM SWITCH       */ 00722000
*   WKFOUND=OFF;                    /* FOUND SWITCH                  */ 00723000
         NI    WKCTERM(RWORK),B'00111111'                          0746 00724000
*   IF XTMSTERM=XTMSTRMF THEN       /* FORCED TERMINATE      @YM08991*/ 00725000
         L     @09,WKTMSPTR(,RWORK)                                0747 00726000
         TM    XTMSTERM(@09),B'00100000'                           0747 00727000
         BNZ   @RF00747                                            0747 00728000
*     WKTERM=XTMSTRMF;              /* YES, SET FORCED       @YM08991*/ 00729000
         NI    WKTERM(RWORK),B'11101111'                           0748 00730000
*   ELSE                            /* NO, ...               @YM08991*/ 00731000
*     WKTERM=XTMSTRMO;              /* SET ORDERLY           @YM08991*/ 00732000
         B     @RC00747                                            0749 00733000
@RF00747 OI    WKTERM(RWORK),B'00010000'                           0749 00734000
*   WKNAME='';                      /* INITIALIZE NAME FIELD         */ 00735000
@RC00747 MVI   WKNAME(RWORK),C' '                                  0750 00736000
         MVC   WKNAME+1(7,RWORK),WKNAME(RWORK)                     0750 00737000
*/*                                                                  */ 00738000
*                                                                  0751 00739000
*   IF XTMSPTYP^=0&                 /* NAME TYPE SPECIFIED           */ 00740000
*       XTMSPLEN>8 THEN             /* LU NAME > 8 CHARACTERS        */ 00741000
         L     @09,WKTMSPTR(,RWORK)                                0751 00742000
         CLI   XTMSPTYP(@09),0                                     0751 00743000
         BE    @RF00751                                            0751 00744000
         CLI   XTMSPLEN(@09),8                                     0751 00745000
         BNH   @RF00751                                            0751 00746000
*     WKSENSE=SESERSNS;             /* SET UP SENSE                  */ 00747000
         MVC   WKSENSE(4,RWORK),SESERSNS                           0752 00748000
*   ELSE                                                           0753 00749000
*     IF XTMSPTYP^=0&               /* NAME TYPE SPECIFIED           */ 00750000
*         XTMSPLEN^=0 THEN          /* OR NAME SPECIFIED             */ 00751000
         B     @RC00751                                            0753 00752000
@RF00751 L     @09,WKTMSPTR(,RWORK)                                0753 00753000
         CLI   XTMSPTYP(@09),0                                     0753 00754000
         BE    @RF00753                                            0753 00755000
         CLI   XTMSPLEN(@09),0                                     0753 00756000
         BE    @RF00753                                            0753 00757000
*       DO;                                                        0754 00758000
*         PLMVFLG1=0;               /* CLEAR FLAGS                   */ 00759000
         LA    @07,65                                              0755 00760000
         ALR   @07,RWORK                                           0755 00761000
         MVI   PLMVFLG1(@07),X'00'                                 0755 00762000
*         PLMVTU=ADDR(WKNAME);      /* TARG UNIT=WORK AREA           */ 00763000
         LA    @11,WKNAME(,RWORK)                                  0756 00764000
         ST    @11,PLMVTU(,@07)                                    0756 00765000
*         PLMVTD=ADDR(WKNAME);      /* TARG DATA=WORK AREA           */ 00766000
         ST    @11,PLMVTD(,@07)                                    0757 00767000
*         PLMVSU=RPRF;              /* SOURCE UNIT = TERM-SELF       */ 00768000
         ST    RPRF,PLMVSU(,@07)                                   0758 00769000
*         PLMVSD=ADDR(XTMSPNME);    /* SOURCE DATA = NAME            */ 00770000
         LA    @11,XTMSPNME(,@09)                                  0759 00771000
         ST    @11,PLMVSD(,@07)                                    0759 00772000
*         PLMVLNTH=XTMSPLEN;        /* SET LENGTH FOR MOVE           */ 00773000
         SLR   @11,@11                                             0760 00774000
         IC    @11,XTMSPLEN(,@09)                                  0760 00775000
         STH   @11,PLMVLNTH(,@07)                                  0760 00776000
*         PLMVTCTG=ON;              /* INDICATE TARG CONTIGUOUS      */ 00777000
         OI    PLMVTCTG(@07),B'00100000'                           0761 00778000
*         RPARM=ADDR(WKMVBFR);      /* ADDRESS OF PARAMETER LIST     */ 00779000
         LA    RPARM,WKMVBFR(,RWORK)                               0762 00780000
*         CALL IEDMVBFR;            /* MOVE LU NAME FROM TERM- SELF     00781000
*                                      TO WORKAREA                   */ 00782000
         L     @09,AVTSAVTP(,RAVT)                                 0763 00783000
         L     @15,SAVTMVBF(,@09)                                  0763 00784000
         BALR  @14,@15                                             0763 00785000
*         CALL NAMESRCH;            /* RESOLVE NAME TO TNT           */ 00786000
         BAL   @14,NAMESRCH                                        0764 00787000
*       END;                                                       0765 00788000
*     ELSE                                                         0766 00789000
*       IF TRMSIBPT>0 THEN          /* ANY SIBS ON CHAIN             */ 00790000
         B     @RC00753                                            0766 00791000
@RF00753 SLR   @09,@09                                             0766 00792000
         ICM   @09,7,TRMSIBPT(RTRM)                                0766 00793000
         LTR   @09,@09                                             0766 00794000
         BNP   @RF00766                                            0766 00795000
*         DO;                                                      0767 00796000
*           WKPLUTNT=TRMSIBPT->SIBINDEX;/* GET TNT INDEX OUT OF SIB  */ 00797000
         LH    @09,SIBINDEX(,@09)                                  0768 00798000
         N     @09,@CF02042                                        0768 00799000
         STH   @09,WKPLUTNT(,RWORK)                                0768 00800000
*           WKFOUND=ON;             /* SET FOUND SWITCH              */ 00801000
         OI    WKFOUND(RWORK),B'10000000'                          0769 00802000
*         END;                                                     0770 00803000
*   CALL ERRORCHK;                  /* CHECK FOR ERRORS              */ 00804000
@RF00766 DS    0H                                                  0771 00805000
@RC00753 DS    0H                                                  0771 00806000
@RC00751 BAL   @14,ERRORCHK                                        0771 00807000
*   CALL BLDRESP;                   /* BUILD THE RESPONSE            */ 00808000
         BAL   @14,BLDRESP                                         0772 00809000
*   IF WKCTERM=ON THEN              /* CTERM TO BE BUILT             */ 00810000
         TM    WKCTERM(RWORK),B'01000000'                          0773 00811000
         BNO   @RF00773                                            0773 00812000
*     DO;                           /* YES                           */ 00813000
*       RPARM=1;                    /* SET UP NO OF UNITS            */ 00814000
         LA    RPARM,1                                             0775 00815000
*       CALL ALLOCBUF;              /* GET A BUFFER                  */ 00816000
         L     @15,OPCGETBF(,ROPCAVT)                              0776 00817000
         BALR  @14,@15                                             0776 00818000
*       WKCTMBFR=RPARM;             /* SAVE BUFFER ADDRESS           */ 00819000
         ST    RPARM,WKCTMBFR(,RWORK)                              0777 00820000
*       CALL BLDCTERM;              /* BUILD A CTERM                 */ 00821000
         BAL   @14,BLDCTERM                                        0778 00822000
*       WKCTMBFR->PRFPRI=PRISSPIU;  /* SET PRIORITY                  */ 00823000
         L     @09,WKCTMBFR(,RWORK)                                0779 00824000
         MVI   PRFPRI(@09),X'E5'                                   0779 00825000
*       WKCTMBFR->PRFQCBA=ADDR(SAVTLUSQ);/* QCB FOR IEDLUS           */ 00826000
         L     @07,AVTSAVTP(,RAVT)                                 0780 00827000
         LA    @07,SAVTLUSQ(,@07)                                  0780 00828000
         STCM  @07,7,PRFQCBA(@09)                                  0780 00829000
*       PRFLINK=WKCTMBFR;           /* LINK RSP BUFFER TO CTERM    0781 00830000
*                                      BUFFER                        */ 00831000
         STCM  @09,7,PRFLINK(IEDQPPTR)                             0781 00832000
*/*                                                                  */ 00833000
*                                                                  0782 00834000
*                                   /* PARAMETER LIST FOR SVC        */ 00835000
*       OPCAQREQ=PSTCHAIN;          /* TPOST A CHAIN                 */ 00836000
         MVI   OPCAQREQ(ROPCAVT),X'B4'                             0782 00837000
*       OPCAQFST=RPRF;              /* RESPONSE BUFFER               */ 00838000
         STCM  RPRF,7,OPCAQFST(ROPCAVT)                            0783 00839000
*       OPCAQSEC=WKCTMBFR;          /* CTERM BUFFER                  */ 00840000
         STCM  @09,7,OPCAQSEC(ROPCAVT)                             0784 00841000
*     END;                                                         0785 00842000
*                                                                  0785 00843000
*/*                                                                  */ 00844000
*                                                                  0786 00845000
*   ELSE                            /* NO CTERM TO BE BUILT          */ 00846000
*     DO;                                                          0786 00847000
         B     @RC00773                                            0786 00848000
@RF00773 DS    0H                                                  0787 00849000
*       OPCAQREQ=TPOST;             /* SET UP FOR TPOST              */ 00850000
         MVI   OPCAQREQ(ROPCAVT),X'0C'                             0787 00851000
*       OPCAQFST=RPRF;              /* RESPONSE BUFFER ADDRESS       */ 00852000
         STCM  RPRF,7,OPCAQFST(ROPCAVT)                            0788 00853000
*       OPCAQRQ2=ENDLIST;           /* SET END OF LIST               */ 00854000
         MVI   OPCAQRQ2(ROPCAVT),X'80'                             0789 00855000
*       OPCAQSEC=RPRF;              /* RESPONSE BUFFER ADDRESS       */ 00856000
         STCM  RPRF,7,OPCAQSEC(ROPCAVT)                            0790 00857000
*     END;                                                         0791 00858000
*   WKFREBF=0;                      /* CLEAR SAVED UNITS ADDRESS     */ 00859000
@RC00773 SLR   @09,@09                                             0792 00860000
         ST    @09,WKFREBF(,RWORK)                                 0792 00861000
*   IF PRFTI0>3 THEN                /* EXTRA UNITS                   */ 00862000
         L     @09,PRFTI0-1(,IEDQPPTR)                             0793 00863000
         LA    @09,0(,@09)                                         0793 00864000
         C     @09,@CF00066                                        0793 00865000
         BNH   @RF00793                                            0793 00866000
*     DO;                                                          0794 00867000
*       WKFREBF=PRFTI0;             /* ADDRESS OF UNITS              */ 00868000
         ST    @09,WKFREBF(,RWORK)                                 0795 00869000
*       PRFTIC=PRFINTIC;            /* SET INVALID TIC               */ 00870000
         MVC   PRFTIC(4,IEDQPPTR),@CB01366                         0796 00871000
*     END;                                                         0797 00872000
*   RPARM=ADDR(OPCAQCTL);           /* PARAMETER LIST ADDRESS        */ 00873000
@RF00793 LA    RPARM,OPCAQCTL(,ROPCAVT)                            0798 00874000
*   SVC(102);                       /* TPOST CINIT BUFFER            */ 00875000
         SVC   102                                                 0799 00876000
*/*                                                                  */ 00877000
*                                                                  0800 00878000
*   IF WKFREBF>0 THEN               /* EXCESS UNITS TO FREE          */ 00879000
         L     @09,WKFREBF(,RWORK)                                 0800 00880000
         LTR   @09,@09                                             0800 00881000
         BNP   @RF00800                                            0800 00882000
*     DO;                                                          0801 00883000
*       RPARM=WKFREBF;              /* UNIT ADDRESS                  */ 00884000
         LR    RPARM,@09                                           0802 00885000
*       CALL FREEBUF;               /* FREE THE UNITS                */ 00886000
         L     @15,OPCFREBF(,ROPCAVT)                              0803 00887000
         BALR  @14,@15                                             0803 00888000
*     END;                                                         0804 00889000
*   IF WKNSPSW=OFF THEN             /* N. S. PROC NOT        @YM07369*/ 00890000
@RF00800 TM    WKNSPSW(RWORK),B'00100000'                          0805 00891000
         BNZ   @RF00805                                            0805 00892000
*     DO;                           /* BUILT                 @YM07369*/ 00893000
*       OPCMODID=DSPOPCTL;          /* PASS CONTROL TO '00"          */ 00894000
         MVC   OPCMODID(2,ROPCAVT),@CC01937                        0807 00895000
*       RZERO=0;                    /* CLEAR REG 0                   */ 00896000
         SLR   RZERO,RZERO                                         0808 00897000
*     END;                          /*                       @YM07369*/ 00898000
*   ELSE                            /*                       @YMO7369*/ 00899000
*     OPCMODID=RUDISP;              /* PASS TO IGC0210D      @YM07369*/ 00900000
         B     @RC00805                                            0810 00901000
@RF00805 MVC   OPCMODID(2,ROPCAVT),@CC01939                        0810 00902000
*/*                                                                  */ 00903000
*                                                                  0811 00904000
*   RE=WKSAVE1;                     /* RESTORE REG 14                */ 00905000
@RC00805 L     RE,WKSAVE1(,RWORK)                                  0811 00906000
*   END TERMSELF;                   /* RETURN TO CALLER              */ 00907000
@EL00009 DS    0H                                                  0812 00908000
@EF00009 DS    0H                                                  0812 00909000
@ER00009 BR    @14                                                 0812 00910000
*   END IGCA310D                                                   0813 00911000
*                                                                  0813 00912000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00913000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00914000
*/*%INCLUDE SYSLIB  (TCD1D   )                                       */ 00915000
*/*%INCLUDE SYSLIB  (TMHTABD )                                       */ 00916000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 00917000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 00918000
*/*%INCLUDE SYSLIB  (TPIUD   )                                       */ 00919000
*/*%INCLUDE SYSLIB  (TPLMVD  )                                       */ 00920000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 00921000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 00922000
*/*%INCLUDE SYSLIB  (TPRUD   )                                       */ 00923000
*/*%INCLUDE SYSLIB  (TREQD   )                                       */ 00924000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 00925000
*/*%INCLUDE SYSLIB  (TSIBD   )                                       */ 00926000
*/*%INCLUDE SYSLIB  (TSNSD   )                                       */ 00927000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 00928000
*/*%INCLUDE SYSLIB  (TTNTD   )                                       */ 00929000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00930000
*/*%INCLUDE SYSLIB  (TXCTMD  )                                       */ 00931000
*/*%INCLUDE SYSLIB  (TXNSPD  )                                       */ 00932000
*/*%INCLUDE SYSLIB  (TXXTMSD )                                       */ 00933000
*/*%INCLUDE SYSLIB  (TXSNDD  )                                       */ 00934000
*                                                                  0813 00935000
*       ;                                                          0813 00936000
@DATA    DS    0H                                                       00937000
@CH00071 DC    H'6'                                                     00938000
@CH00573 DC    H'7'                                                     00939000
@CH01146 DC    H'10'                                                    00940000
@CH01866 DC    H'11'                                                    00941000
@CH00568 DC    H'13'                                                    00942000
         DS    0F                                                       00943000
         DS    0F                                                       00944000
@CF00066 DC    F'3'                                                     00945000
@CH00066 EQU   @CF00066+2                                               00946000
@CF00045 DC    F'8'                                                     00947000
@CF00239 DC    F'12'                                                    00948000
@CF01669 DC    F'14'                                                    00949000
@CF02045 DC    F'-5'                                                    00950000
@CF02042 DC    XL4'0000FFFF'                                            00951000
@CF00443 DC    XL4'1E'                                                  00952000
         DS    0D                                                       00953000
@CC01937 DC    C'00'                                                    00954000
@CC01939 DC    C'02'                                                    00955000
@CC01941 DC    C'A3'                                                    00956000
@CC01943 DC    C'AA'                                                    00957000
@CB01366 DC    X'08000002'                                              00958000
@CB01955 DC    X'0B80001C'                                              00959000
@CB00740 DC    X'010683'                                                00960000
@CB00746 DC    X'010602'                                                00961000
@CB00748 DC    X'010604'                                                00962000
@CB01953 DC    X'0B0000'                                                00963000
NACTVSNS DS    CL4                                                      00964000
         ORG   NACTVSNS                                                 00965000
@NM00177 DC    X'08'                                                    00966000
@NM00178 DC    X'16'                                                    00967000
@NM00179 DC    AL2(0)                                                   00968000
         ORG   NACTVSNS+4                                               00969000
NMODESNS DS    CL4                                                      00970000
         ORG   NMODESNS                                                 00971000
@NM00180 DC    X'08'                                                    00972000
@NM00181 DC    X'09'                                                    00973000
@NM00182 DC    AL2(0)                                                   00974000
         ORG   NMODESNS+4                                               00975000
SESERSNS DS    CL4                                                      00976000
         ORG   SESERSNS                                                 00977000
@NM00183 DC    X'08'                                                    00978000
@NM00184 DC    X'1E'                                                    00979000
@NM00185 DC    AL2(0)                                                   00980000
         ORG   SESERSNS+4                                               00981000
PATCH    DC    100X'00'                                                 00982000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00983000
@01      EQU   01                                                       00984000
@02      EQU   02                                                       00985000
@03      EQU   03                                                       00986000
@04      EQU   04                                                       00987000
@05      EQU   05                                                       00988000
@06      EQU   06                                                       00989000
@07      EQU   07                                                       00990000
@08      EQU   08                                                       00991000
@09      EQU   09                                                       00992000
@10      EQU   10                                                       00993000
@11      EQU   11                                                       00994000
@12      EQU   12                                                       00995000
@13      EQU   13                                                       00996000
@14      EQU   14                                                       00997000
@15      EQU   15                                                       00998000
IEDQAPTR EQU   @04                                                      00999000
ROPCAVT  EQU   @02                                                      01000000
ROPCE    EQU   @03                                                      01001000
IEDQPPTR EQU   @06                                                      01002000
RTRM     EQU   @08                                                      01003000
RAVT     EQU   @04                                                      01004000
RZERO    EQU   @00                                                      01005000
RPARM    EQU   @01                                                      01006000
RWORK    EQU   @05                                                      01007000
RPRF     EQU   @06                                                      01008000
IEDQTPTR EQU   @08                                                      01009000
RBASE    EQU   @12                                                      01010000
RSAVE    EQU   @13                                                      01011000
RE       EQU   @14                                                      01012000
RF       EQU   @15                                                      01013000
IEDQAVTD EQU   0                                                        01014000
AVTSAVEX EQU   IEDQAVTD+288                                             01015000
@NM00003 EQU   IEDQAVTD+388                                             01016000
AVTCKFLG EQU   @NM00003                                                 01017000
AVTBASE  EQU   IEDQAVTD+412                                             01018000
AVTPKF   EQU   AVTBASE                                                  01019000
AVTRNMPT EQU   IEDQAVTD+424                                             01020000
AVTOSECB EQU   IEDQAVTD+492                                             01021000
AVTECB1  EQU   AVTOSECB                                                 01022000
AVTHG02  EQU   IEDQAVTD+528                                             01023000
AVTDISP  EQU   IEDQAVTD+552                                             01024000
AVTHD    EQU   IEDQAVTD+556                                             01025000
AVTSCOPT EQU   AVTHD                                                    01026000
AVTSAVTP EQU   IEDQAVTD+612                                             01027000
AVTSAVTF EQU   AVTSAVTP                                                 01028000
AVTCKPEL EQU   IEDQAVTD+652                                             01029000
AVTCKRMV EQU   AVTCKPEL                                                 01030000
AVTCKELF EQU   IEDQAVTD+680                                             01031000
AVTCKBYT EQU   IEDQAVTD+691                                             01032000
AVTHG01  EQU   IEDQAVTD+692                                             01033000
AVTCKLNK EQU   IEDQAVTD+696                                             01034000
AVTCRELE EQU   IEDQAVTD+708                                             01035000
AVTCCELE EQU   AVTCRELE                                                 01036000
AVTCLRHI EQU   IEDQAVTD+716                                             01037000
AVTADBUF EQU   IEDQAVTD+720                                             01038000
AVTSYSER EQU   IEDQAVTD+728                                             01039000
AVTMSGS  EQU   IEDQAVTD+729                                             01040000
AVTBFRTB EQU   IEDQAVTD+792                                             01041000
AVTCKPQB EQU   IEDQAVTD+804                                             01042000
AVTCKPTB EQU   AVTCKPQB                                                 01043000
AVTCKPEC EQU   AVTCKPQB+4                                               01044000
AVTCKPCC EQU   AVTCKPEC                                                 01045000
AVTOPCQB EQU   IEDQAVTD+816                                             01046000
AVTOPCOB EQU   AVTOPCQB                                                 01047000
AVTOPCEC EQU   AVTOPCQB+4                                               01048000
AVTOPCCC EQU   AVTOPCEC                                                 01049000
AVTOLTQB EQU   IEDQAVTD+828                                             01050000
AVTCWFL1 EQU   IEDQAVTD+924                                             01051000
AVTCWFL2 EQU   IEDQAVTD+925                                             01052000
AVTSUBT  EQU   IEDQAVTD+948                                             01053000
AVTIOTR  EQU   IEDQAVTD+949                                             01054000
AVTBIT1  EQU   IEDQAVTD+1050                                            01055000
AVTBIT2  EQU   IEDQAVTD+1051                                            01056000
AVTBIT3  EQU   IEDQAVTD+1052                                            01057000
AVTBIT4  EQU   IEDQAVTD+1136                                            01058000
@NM00085 EQU   IEDQAVTD+1232                                            01059000
IEDNSVTD EQU   0                                                        01060000
SAVTDIAG EQU   IEDNSVTD                                                 01061000
SAVTDIAF EQU   SAVTDIAG                                                 01062000
SAVTLUSQ EQU   IEDNSVTD+88                                              01063000
SAVTMVBF EQU   IEDNSVTD+160                                             01064000
SAVTXTRQ EQU   IEDNSVTD+164                                             01065000
SAVTDFCO EQU   IEDNSVTD+200                                             01066000
SAVTMHTB EQU   IEDNSVTD+216                                             01067000
SAVTTCPU EQU   IEDNSVTD+238                                             01068000
SAVTSCPT EQU   SAVTTCPU                                                 01069000
SAVTTNTX EQU   IEDNSVTD+252                                             01070000
SAVTMHDX EQU   IEDNSVTD+268                                             01071000
SAVTZELM EQU   IEDNSVTD+270                                             01072000
SAVTRDRV EQU   IEDNSVTD+284                                             01073000
SAVTCKQB EQU   IEDNSVTD+300                                             01074000
SAVTCKTB EQU   SAVTCKQB                                                 01075000
SAVTCKEC EQU   SAVTCKQB+4                                               01076000
SAVTCKCC EQU   SAVTCKEC                                                 01077000
IEDMHTD  EQU   0                                                        01078000
MHNAME   EQU   IEDMHTD                                                  01079000
IEDQMHTP EQU   0                                                        01080000
IEDQOPCD EQU   0                                                        01081000
OPCAVTPT EQU   IEDQOPCD+8                                               01082000
OPCCOPCE EQU   IEDQOPCD+12                                              01083000
OPCPSTWT EQU   IEDQOPCD+48                                              01084000
OPCSAVE  EQU   IEDQOPCD+56                                              01085000
OPCWORK  EQU   IEDQOPCD+140                                             01086000
OPCAQCTL EQU   IEDQOPCD+180                                             01087000
OPCXCTL  EQU   IEDQOPCD+204                                             01088000
OPCLDNME EQU   IEDQOPCD+212                                             01089000
OPCMODID EQU   OPCLDNME+3                                               01090000
OPCGETBF EQU   IEDQOPCD+276                                             01091000
OPCFREBF EQU   IEDQOPCD+280                                             01092000
OPCSPEC  EQU   IEDQOPCD+300                                             01093000
OPCPWCOB EQU   IEDQOPCD+368                                             01094000
OPCPWQCB EQU   OPCPWCOB                                                 01095000
OPCPWECB EQU   OPCPWCOB+4                                               01096000
IEDQOPCE EQU   0                                                        01097000
OCELEM   EQU   IEDQOPCE+4                                               01098000
OCELMPRI EQU   OCELEM                                                   01099000
OCUNIT   EQU   IEDQOPCE+8                                               01100000
OCRUDEST EQU   OCUNIT                                                   01101000
OCCKPKEY EQU   OCRUDEST                                                 01102000
OCSCAN   EQU   OCCKPKEY                                                 01103000
OCOPTCDE EQU   IEDQOPCE+12                                              01104000
OCSWITCH EQU   IEDQOPCE+13                                              01105000
OCFLAG   EQU   IEDQOPCE+14                                              01106000
@NM00122 EQU   IEDQOPCE+16                                              01107000
OCDEST   EQU   @NM00122                                                 01108000
OCREQVAL EQU   OCDEST+1                                                 01109000
OCLINENO EQU   IEDQOPCE+22                                              01110000
OCTIOT   EQU   OCLINENO                                                 01111000
OCTRUNIT EQU   IEDQOPCE+24                                              01112000
OCRSID   EQU   OCTRUNIT                                                 01113000
OCALSTAT EQU   OCRSID                                                   01114000
OCACTREQ EQU   OCALSTAT                                                 01115000
OCPARM   EQU   IEDQOPCE+28                                              01116000
OCWTG    EQU   IEDQOPCE+30                                              01117000
OCBACKUP EQU   IEDQOPCE+32                                              01118000
OCMODNME EQU   IEDQOPCE+40                                              01119000
OCIPLWA  EQU   OCMODNME                                                 01120000
OCCKDATA EQU   IEDQOPCE+48                                              01121000
OCRSTGTM EQU   OCCKDATA                                                 01122000
IEDQOPCN EQU   0                                                        01123000
OCLDNME  EQU   IEDQOPCN                                                 01124000
OCLINTTE EQU   OCLDNME                                                  01125000
OCREQFLG EQU   OCLINTTE+2                                               01126000
OCPREFLG EQU   OCLINTTE+3                                               01127000
IEDPIU   EQU   0                                                        01128000
PIUTH    EQU   IEDPIU                                                   01129000
PIURH    EQU   IEDPIU+10                                                01130000
PIURU    EQU   IEDPIU+13                                                01131000
IEDPLMV  EQU   0                                                        01132000
PLMVTU   EQU   IEDPLMV                                                  01133000
PLMVTD   EQU   IEDPLMV+4                                                01134000
PLMVSU   EQU   IEDPLMV+8                                                01135000
PLMVSD   EQU   IEDPLMV+12                                               01136000
PLMVLNTH EQU   IEDPLMV+16                                               01137000
PLMVFLG1 EQU   IEDPLMV+18                                               01138000
PLMVTCTG EQU   PLMVFLG1                                                 01139000
IEDPLMVP EQU   0                                                        01140000
IEDQPRF  EQU   0                                                        01141000
PRFRCB   EQU   IEDQPRF                                                  01142000
PRFKEY   EQU   PRFRCB                                                   01143000
PRFQCBA  EQU   PRFRCB+1                                                 01144000
PRFPRI   EQU   PRFRCB+4                                                 01145000
PRFLINK  EQU   PRFRCB+5                                                 01146000
PRFTIC   EQU   IEDQPRF+8                                                01147000
PRFTICC  EQU   PRFTIC                                                   01148000
PRFTI0   EQU   PRFTIC+1                                                 01149000
PRFNBUNT EQU   IEDQPRF+12                                               01150000
PRFSUNIT EQU   PRFNBUNT                                                 01151000
PRFPLQCB EQU   PRFSUNIT                                                 01152000
PRFPIUO  EQU   PRFPLQCB                                                 01153000
@NM00140 EQU   IEDQPRF+16                                               01154000
PRFSVFFO EQU   @NM00140                                                 01155000
PRFSRCE  EQU   PRFSVFFO                                                 01156000
PRFSTAT1 EQU   IEDQPRF+20                                               01157000
PRFEOFN  EQU   PRFSTAT1                                                 01158000
PRFCORE  EQU   IEDQPRF+21                                               01159000
PRFXTRA  EQU   PRFCORE                                                  01160000
PRFSCAN  EQU   IEDQPRF+24                                               01161000
PRFISIZE EQU   PRFSCAN+1                                                01162000
PRFTQBCK EQU   IEDQPRF+26                                               01163000
PRFNTXT  EQU   PRFTQBCK                                                 01164000
PRFEOBOF EQU   PRFNTXT                                                  01165000
PRFCHDR  EQU   IEDQPRF+32                                               01166000
PRFHQBCK EQU   IEDQPRF+35                                               01167000
IEDPF1   EQU   0                                                        01168000
PRF1RH   EQU   IEDPF1                                                   01169000
PRF1FLG1 EQU   IEDPF1+3                                                 01170000
PRF1USS  EQU   PRF1FLG1                                                 01171000
PRF1WD2  EQU   IEDPF1+4                                                 01172000
PRF1SEQP EQU   PRF1WD2                                                  01173000
PRF1SQID EQU   PRF1SEQP                                                 01174000
PRF1TAG1 EQU   PRF1SQID                                                 01175000
IEDPF2   EQU   0                                                        01176000
PRF2FLG2 EQU   IEDPF2                                                   01177000
PRF2TNTI EQU   PRF2FLG2                                                 01178000
PRF2WD2  EQU   IEDPF2+4                                                 01179000
IEDPRUQD EQU   0                                                        01180000
PRUTTCIN EQU   IEDPRUQD                                                 01181000
PRUDATCT EQU   IEDPRUQD+2                                               01182000
PRUTIC   EQU   IEDPRUQD+8                                               01183000
PRUDATA  EQU   IEDPRUQD+12                                              01184000
IEDPRUQP EQU   0                                                        01185000
IEDPRUND EQU   0                                                        01186000
PRURHTH  EQU   IEDPRUND                                                 01187000
PRURH    EQU   PRURHTH                                                  01188000
PRURHFG0 EQU   PRURH                                                    01189000
PRURHFG1 EQU   PRURH+1                                                  01190000
PRURHFG2 EQU   PRURH+2                                                  01191000
PRUTH    EQU   PRURHTH+3                                                01192000
PRUFIDN  EQU   PRUTH                                                    01193000
PRUTHUSS EQU   PRUFIDN                                                  01194000
IEDREQD  EQU   0                                                        01195000
REQTYPE  EQU   IEDREQD                                                  01196000
REQQCBA  EQU   IEDREQD+1                                                01197000
REQPRI   EQU   IEDREQD+4                                                01198000
REQRPRI  EQU   IEDREQD+8                                                01199000
REQRQCBA EQU   IEDREQD+9                                                01200000
REQROUTE EQU   IEDREQD+12                                               01201000
REQRCDS  EQU   IEDREQD+14                                               01202000
REQDATA  EQU   IEDREQD+16                                               01203000
IEDRH    EQU   0                                                        01204000
TRHBYTE0 EQU   IEDRH                                                    01205000
TRHTYPE  EQU   TRHBYTE0                                                 01206000
TRHFI    EQU   TRHBYTE0                                                 01207000
TRHSDI   EQU   TRHBYTE0                                                 01208000
TRHBYTE1 EQU   IEDRH+1                                                  01209000
TRHDR1   EQU   TRHBYTE1                                                 01210000
TRHDR2   EQU   TRHBYTE1                                                 01211000
TRHER    EQU   TRHBYTE1                                                 01212000
TRHBYTE2 EQU   IEDRH+2                                                  01213000
IEDSIBD  EQU   0                                                        01214000
SIBINDEX EQU   IEDSIBD+8                                                01215000
SIBSESSN EQU   IEDSIBD+10                                               01216000
SIBSSTAT EQU   SIBSESSN                                                 01217000
SIBPACIN EQU   IEDSIBD+11                                               01218000
SIBSEQN  EQU   IEDSIBD+12                                               01219000
SIBSTAT1 EQU   IEDSIBD+16                                               01220000
SIBSTAT2 EQU   IEDSIBD+17                                               01221000
SIBTERM  EQU   SIBSTAT2                                                 01222000
SIBRDSCN EQU   SIBSTAT2                                                 01223000
SIBBIND  EQU   IEDSIBD+20                                               01224000
SIBBIND1 EQU   SIBBIND                                                  01225000
SIBBIND2 EQU   SIBBIND+1                                                01226000
SIBBIND3 EQU   SIBBIND+2                                                01227000
SIBSTAT0 EQU   IEDSIBD+23                                               01228000
IEDSNSD  EQU   0                                                        01229000
SNSSYSTM EQU   IEDSNSD                                                  01230000
SNSUSER  EQU   IEDSNSD+2                                                01231000
SNSPTR   EQU   0                                                        01232000
IEDTH    EQU   0                                                        01233000
TTHBYTE0 EQU   IEDTH                                                    01234000
TTHBYTE1 EQU   IEDTH+1                                                  01235000
TTHDAF   EQU   IEDTH+2                                                  01236000
TTHOAF   EQU   IEDTH+4                                                  01237000
TTHSNF   EQU   IEDTH+6                                                  01238000
TTHTAG   EQU   TTHSNF                                                   01239000
TTHTAG1  EQU   TTHTAG                                                   01240000
TTHDCF   EQU   IEDTH+8                                                  01241000
IEDQTNTD EQU   0                                                        01242000
IEDQTCDE EQU   IEDQTNTD                                                 01243000
TNTENLEN EQU   IEDQTNTD+40                                              01244000
IEDQTDCE EQU   IEDQTNTD+46                                              01245000
IEDQNPTR EQU   0                                                        01246000
IEDTNTA  EQU   0                                                        01247000
IEDTRM   EQU   0                                                        01248000
IEDNTRM  EQU   IEDTRM                                                   01249000
TRMBYTE4 EQU   IEDNTRM                                                  01250000
TRMBYTE3 EQU   IEDNTRM+1                                                01251000
TRMBYTE2 EQU   IEDNTRM+2                                                01252000
TRMINPG  EQU   TRMBYTE2                                                 01253000
TRMBYTE1 EQU   IEDNTRM+3                                                01254000
TRMSCPRQ EQU   TRMBYTE1                                                 01255000
TRMBYTE0 EQU   IEDNTRM+6                                                01256000
TRMSIBPT EQU   IEDNTRM+7                                                01257000
IEDQTRM  EQU   IEDTRM+14                                                01258000
TRMSTATE EQU   IEDQTRM                                                  01259000
TRMLOG   EQU   TRMSTATE                                                 01260000
TRMINSEQ EQU   IEDQTRM+4                                                01261000
TLISTCNT EQU   TRMINSEQ                                                 01262000
TRMOUTSQ EQU   IEDQTRM+6                                                01263000
TLISTEN  EQU   TRMOUTSQ                                                 01264000
TRMDSORG EQU   TLISTEN                                                  01265000
TRMALTD  EQU   IEDQTRM+8                                                01266000
TRMDEVFL EQU   IEDQTRM+10                                               01267000
TRMSTAT  EQU   IEDQTRM+12                                               01268000
IEDXCTMD EQU   0                                                        01269000
XCTMCMD  EQU   IEDXCTMD                                                 01270000
XCTMCODE EQU   XCTMCMD                                                  01271000
XCTMFMT  EQU   XCTMCMD+3                                                01272000
XCTMTYPE EQU   XCTMCMD+4                                                01273000
XCTMTERM EQU   XCTMTYPE                                                 01274000
XCTMSNA  EQU   XCTMCMD+5                                                01275000
XCTMRSN  EQU   XCTMCMD+7                                                01276000
XCTMRQID EQU   XCTMCMD+8                                                01277000
XCTMPWRD EQU   XCTMCMD+9                                                01278000
XCTMPTR  EQU   0                                                        01279000
IEDXNSPD EQU   0                                                        01280000
XNSPCMD  EQU   IEDXNSPD                                                 01281000
XNSPCODE EQU   XNSPCMD                                                  01282000
XNSPRSN  EQU   XNSPCMD+3                                                01283000
XNSPPLUN EQU   XNSPCMD+4                                                01284000
XNSPPTYP EQU   XNSPPLUN                                                 01285000
XNSPSLUN EQU   XNSPCMD+5                                                01286000
XNSPSTYP EQU   XNSPSLUN                                                 01287000
XNSPSENS EQU   XNSPCMD+6                                                01288000
XNSPSKEY EQU   XNSPCMD+10                                               01289000
XNSPPTR  EQU   0                                                        01290000
IEDXTMSD EQU   0                                                        01291000
XTMSCODE EQU   IEDXTMSD                                                 01292000
XTMSTYPE EQU   IEDXTMSD+3                                               01293000
XTMSTERM EQU   XTMSTYPE                                                 01294000
XTMSPLUN EQU   IEDXTMSD+4                                               01295000
XTMSPTYP EQU   XTMSPLUN                                                 01296000
XTMSPLEN EQU   XTMSPLUN+1                                               01297000
XTMSPNME EQU   XTMSPLUN+2                                               01298000
XTMSPTR  EQU   0                                                        01299000
IEDXSNDD EQU   0                                                        01300000
XSNDCMD  EQU   IEDXSNDD                                                 01301000
XSNDCODE EQU   XSNDCMD                                                  01302000
XSNDPTR  EQU   0                                                        01303000
ALLOCBUF EQU   0                                                        01304000
FREEBUF  EQU   0                                                        01305000
IEDIAP04 EQU   0                                                        01306000
IEDMVBFR EQU   0                                                        01307000
IEDQTNT  EQU   0                                                        01308000
POSTWAIT EQU   0                                                        01309000
ENDDATA  EQU   0                                                        01310000
WKAREA   EQU   0                                                        01311000
WKSAVE1  EQU   WKAREA                                                   01312000
WKSAVE2  EQU   WKAREA+4                                                 01313000
WKSAVE3  EQU   WKAREA+8                                                 01314000
WKCTMBFR EQU   WKAREA+12                                                01315000
WKCTMPIU EQU   WKAREA+16                                                01316000
WKCTMRU  EQU   WKAREA+20                                                01317000
WKPIUPTR EQU   WKAREA+24                                                01318000
WKTMSPTR EQU   WKAREA+28                                                01319000
WKTMSRSP EQU   WKAREA+32                                                01320000
WKTMSRH  EQU   WKAREA+36                                                01321000
WKTABPTR EQU   WKAREA+40                                                01322000
WKFREBF  EQU   WKAREA+44                                                01323000
WKPLUTNT EQU   WKAREA+48                                                01324000
WKSLUTNT EQU   WKAREA+50                                                01325000
WKSWITCH EQU   WKAREA+52                                                01326000
WKFOUND  EQU   WKSWITCH                                                 01327000
WKCTERM  EQU   WKSWITCH                                                 01328000
WKNSPSW  EQU   WKSWITCH                                                 01329000
WKTERM   EQU   WKSWITCH                                                 01330000
WKSENSE  EQU   WKAREA+53                                                01331000
WKNAME   EQU   WKAREA+57                                                01332000
WKMVBFR  EQU   WKAREA+65                                                01333000
WKREQELE EQU   WKAREA+89                                                01334000
VCONTBL  EQU   0                                                        01335000
A1VCON   EQU   VCONTBL+8                                                01336000
SIBPTR   EQU   0                                                        01337000
TNTCODE  EQU   0                                                        01338000
TNTDCODE EQU   0                                                        01339000
TNTFIRST EQU   0                                                        01340000
OPCAQWD  EQU   OPCAQCTL                                                 01341000
OPCAQWD1 EQU   OPCAQWD                                                  01342000
OPCAQREQ EQU   OPCAQWD1                                                 01343000
OPCAQFST EQU   OPCAQWD1+1                                               01344000
OPCAQWD2 EQU   OPCAQWD+4                                                01345000
OPCAQRQ2 EQU   OPCAQWD2                                                 01346000
OPCAQSEC EQU   OPCAQWD2+1                                               01347000
OPCAQWD3 EQU   OPCAQWD+8                                                01348000
OCCKPKY1 EQU   OCCKPKEY                                                 01349000
OCCKPTYP EQU   OCCKPKY1                                                 01350000
OCICACTN EQU   OCMODNME                                                 01351000
OCICDADR EQU   OCICACTN                                                 01352000
OCICSW   EQU   OCICDADR+3                                               01353000
REQLDATA EQU   REQDATA                                                  01354000
REQSDATA EQU   REQDATA                                                  01355000
REQSTTE  EQU   REQSDATA                                                 01356000
REQSTNT  EQU   REQSDATA+4                                               01357000
TRMPRE1  EQU   TRMBYTE4                                                 01358000
TRMNCP1  EQU   TRMBYTE4                                                 01359000
TRMPRE   EQU   TRMBYTE3                                                 01360000
TRMNCP   EQU   TRMBYTE3                                                 01361000
TRMPU    EQU   TRMBYTE3                                                 01362000
TRMLU    EQU   TRMBYTE3                                                 01363000
TRMLINK  EQU   TRMBYTE3                                                 01364000
COMMAND  EQU   PIURU                                                    01365000
TMSERRSP EQU   PIURU                                                    01366000
TMSSENSE EQU   TMSERRSP                                                 01367000
TMSCMD   EQU   TMSERRSP+4                                               01368000
OCCIB    EQU   OCREQVAL                                                 01369000
PRFSHDR  EQU   IEDQPRF+42                                               01370000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01371000
@NM00172 EQU   TRMLINK                                                  01372000
TRMLSTAT EQU   TRMLINK                                                  01373000
TRMLINT  EQU   TRMLINK                                                  01374000
TRMEPMOD EQU   TRMLINK                                                  01375000
TRMLULOG EQU   TRMLU                                                    01376000
TRMINERR EQU   TRMLU                                                    01377000
TRMLUREQ EQU   TRMLU                                                    01378000
TRMSESRQ EQU   TRMLU                                                    01379000
TRMTDIFF EQU   TRMLU                                                    01380000
TRMLUTM  EQU   TRMLU                                                    01381000
TRMLUIT  EQU   TRMLU                                                    01382000
TRMAUTO  EQU   TRMLU                                                    01383000
TRMPCONT EQU   TRMPU                                                    01384000
@NM00171 EQU   TRMPU                                                    01385000
TRMNCONT EQU   TRMNCP                                                   01386000
TRMQUCKN EQU   TRMNCP                                                   01387000
TRMSLOWN EQU   TRMNCP                                                   01388000
TRMSYGEN EQU   TRMNCP                                                   01389000
TRMNCPCL EQU   TRMNCP                                                   01390000
TRMIPLDM EQU   TRMNCP                                                   01391000
TRMINOUT EQU   TRMPRE                                                   01392000
TRMRDOUT EQU   TRMPRE                                                   01393000
TRMNLOUT EQU   TRMPRE                                                   01394000
TRMWROUT EQU   TRMPRE                                                   01395000
TRMASNXI EQU   TRMPRE                                                   01396000
TRMSTMM  EQU   TRMPRE                                                   01397000
TRMCMODE EQU   TRMPRE                                                   01398000
TRMSTPND EQU   TRMPRE                                                   01399000
@NM00170 EQU   TRMNCP1                                                  01400000
TRMINOP  EQU   TRMNCP1                                                  01401000
TRMLYNCH EQU   TRMPRE1                                                  01402000
TRMSPOUT EQU   TRMPRE1                                                  01403000
TRMERLCK EQU   TRMPRE1                                                  01404000
TRMQNPL  EQU   TRMPRE1                                                  01405000
TRMSPACT EQU   TRMPRE1                                                  01406000
TRMOCNI  EQU   TRMPRE1                                                  01407000
TRMSESSN EQU   TRMPRE1                                                  01408000
TRMCONT  EQU   TRMPRE1                                                  01409000
REQLTNT  EQU   REQLDATA                                                 01410000
OCICINAC EQU   OCICSW                                                   01411000
@NM00128 EQU   OCICSW                                                   01412000
OCICATST EQU   OCICDADR+1                                               01413000
OCICTYPE EQU   OCICDADR                                                 01414000
@NM00127 EQU   OCCKPKY1                                                 01415000
OCCKPENV EQU   OCCKPKY1                                                 01416000
OCCKPRST EQU   OCCKPTYP                                                 01417000
OCCKPNCP EQU   OCCKPTYP                                                 01418000
OCCKPINC EQU   OCCKPTYP                                                 01419000
OPCAQLST EQU   OPCAQWD3+1                                               01420000
OPCAQRQ3 EQU   OPCAQWD3                                                 01421000
@NM00186 EQU   VCONTBL                                                  01422000
@NM00176 EQU   WKSWITCH                                                 01423000
XSNDSNA  EQU   XSNDCMD+6                                                01424000
XSNDPNA  EQU   XSNDCMD+4                                                01425000
XSNDKEY  EQU   XSNDCMD+3                                                01426000
XSNDREQ  EQU   XSNDCODE+2                                               01427000
XSNDSESS EQU   XSNDCODE+1                                               01428000
XSNDNETS EQU   XSNDCODE                                                 01429000
@NM00175 EQU   XTMSTYPE                                                 01430000
@NM00174 EQU   XTMSTYPE                                                 01431000
XTMSREQ  EQU   XTMSCODE+2                                               01432000
XTMSSESS EQU   XTMSCODE+1                                               01433000
XTMSNETS EQU   XTMSCODE                                                 01434000
XNSPSNME EQU   XNSPCMD+11                                               01435000
XNSPREQ  EQU   XNSPCODE+2                                               01436000
XNSPSESS EQU   XNSPCODE+1                                               01437000
XNSPNETS EQU   XNSPCODE                                                 01438000
XCTMPSWD EQU   XCTMPWRD+1                                               01439000
XCTMPLEN EQU   XCTMPWRD                                                 01440000
XCTMRID  EQU   XCTMRQID+1                                               01441000
XCTMRLEN EQU   XCTMRQID                                                 01442000
@NM00173 EQU   XCTMTYPE                                                 01443000
XCTMREQ  EQU   XCTMCODE+2                                               01444000
XCTMSESS EQU   XCTMCODE+1                                               01445000
XCTMNETS EQU   XCTMCODE                                                 01446000
TRMOPT   EQU   IEDTRM+34                                                01447000
TRMOPTBL EQU   IEDQTRM+18                                               01448000
TRMOPNO  EQU   IEDQTRM+17                                               01449000
TRMCHCIN EQU   IEDQTRM+16                                               01450000
TRMSENSE EQU   TRMSTAT+3                                                01451000
TRMTEMPR EQU   TRMSTAT+2                                                01452000
TRMSIO   EQU   TRMSTAT                                                  01453000
@NM00169 EQU   TRMDEVFL+1                                               01454000
TRMTPIN  EQU   TRMDEVFL+1                                               01455000
TRMNCPI  EQU   TRMDEVFL+1                                               01456000
TRMRNTRM EQU   TRMDEVFL+1                                               01457000
@NM00168 EQU   TRMDEVFL+1                                               01458000
TRMLMD   EQU   TRMDEVFL+1                                               01459000
TRMCONC  EQU   TRMDEVFL+1                                               01460000
TRMTSOB  EQU   TRMDEVFL                                                 01461000
TRMBFDY  EQU   TRMDEVFL                                                 01462000
TRMTBLK  EQU   TRMDEVFL                                                 01463000
TRMSBLK  EQU   TRMDEVFL                                                 01464000
TRMBLKS  EQU   TRMDEVFL                                                 01465000
TRMADDC  EQU   TRMDEVFL                                                 01466000
TRMDDIG  EQU   TRMDEVFL                                                 01467000
TRMBUFS  EQU   TRMDEVFL                                                 01468000
TRMPRILK EQU   TRMALTD                                                  01469000
TRMLGB   EQU   TRMDSORG                                                 01470000
TRMUTERM EQU   TLISTCNT                                                 01471000
TRMDESTQ EQU   IEDQTRM+1                                                01472000
TRMSCNYN EQU   TRMSTATE                                                 01473000
TRMOPTFN EQU   TRMSTATE                                                 01474000
TRMHELDN EQU   TRMSTATE                                                 01475000
TRMACPTN EQU   TRMSTATE                                                 01476000
TRMPREF  EQU   TRMSTATE                                                 01477000
TRMPROC  EQU   TRMLOG                                                   01478000
TRMLIST  EQU   TRMLOG                                                   01479000
TRMLINE  EQU   TRMSTATE                                                 01480000
TRMSUBST EQU   IEDNTRM+12                                               01481000
TRMTYPE  EQU   IEDNTRM+11                                               01482000
TRMRLMCT EQU   IEDNTRM+10                                               01483000
TRMCOHTG EQU   TRMSIBPT+1                                               01484000
TRMGPCNT EQU   TRMSIBPT                                                 01485000
TRMBUFRD EQU   TRMBYTE0                                                 01486000
TRMSNA   EQU   TRMBYTE0                                                 01487000
TRMGP    EQU   TRMBYTE0                                                 01488000
TRMDIAL  EQU   TRMBYTE0                                                 01489000
@NM00167 EQU   TRMBYTE0                                                 01490000
TRMOUTPT EQU   TRMBYTE0                                                 01491000
TRMINPUT EQU   TRMBYTE0                                                 01492000
TRMUDEF  EQU   TRMBYTE0                                                 01493000
TRMCOHRT EQU   IEDNTRM+4                                                01494000
TRMSTOTE EQU   TRMBYTE1                                                 01495000
TRMCKPRN EQU   TRMBYTE1                                                 01496000
TRMTSATN EQU   TRMBYTE1                                                 01497000
TRMTRACE EQU   TRMBYTE1                                                 01498000
TRMSWBCK EQU   TRMBYTE1                                                 01499000
TRMAUTOC EQU   TRMBYTE1                                                 01500000
TRMINPTP EQU   TRMBYTE1                                                 01501000
TRMWTNEG EQU   TRMSCPRQ                                                 01502000
TRMWRBRK EQU   TRMBYTE2                                                 01503000
TRMNOSND EQU   TRMBYTE2                                                 01504000
TRMPREP  EQU   TRMBYTE2                                                 01505000
TRMGPACT EQU   TRMBYTE2                                                 01506000
TRMANDL  EQU   TRMBYTE2                                                 01507000
TRMCLOSN EQU   TRMINPG                                                  01508000
TRMREMB  EQU   TRMBYTE2                                                 01509000
TRMRSACT EQU   TRMBYTE2                                                 01510000
TNTTRMAD EQU   IEDTNTA                                                  01511000
TNTLEN   EQU   IEDQTNTD+44                                              01512000
TNTMIDEN EQU   IEDQTNTD+41                                              01513000
TNTSRCHX EQU   IEDQTNTD+38                                              01514000
TTHTAG2  EQU   TTHTAG+1                                                 01515000
@NM00166 EQU   TTHTAG1                                                  01516000
TTHTAGS  EQU   TTHTAG1                                                  01517000
TTHEFI   EQU   TTHBYTE0                                                 01518000
@NM00165 EQU   TTHBYTE0                                                 01519000
TTHEBIU  EQU   TTHBYTE0                                                 01520000
TTHBBIU  EQU   TTHBYTE0                                                 01521000
TTHFTYPE EQU   TTHBYTE0                                                 01522000
SNSUSR2  EQU   SNSUSER+1                                                01523000
SNSUSR1  EQU   SNSUSER                                                  01524000
SNSMIN   EQU   SNSSYSTM+1                                               01525000
SNSMAJ   EQU   SNSSYSTM                                                 01526000
SIBLUTYP EQU   SIBSTAT0                                                 01527000
SIBCD    EQU   SIBSTAT0                                                 01528000
@NM00164 EQU   SIBBIND3                                                 01529000
SIBCRES  EQU   SIBBIND3                                                 01530000
SIBSPKR  EQU   SIBBIND3                                                 01531000
SIBRECOV EQU   SIBBIND3                                                 01532000
SIBFMODE EQU   SIBBIND3                                                 01533000
SIBALT   EQU   SIBBIND2                                                 01534000
SIBBTERM EQU   SIBBIND2                                                 01535000
SIBBRACK EQU   SIBBIND2                                                 01536000
SIBFMUSE EQU   SIBBIND2                                                 01537000
SIBSEBI  EQU   SIBBIND2                                                 01538000
SIBSCMP  EQU   SIBBIND2                                                 01539000
SIBSEXC  EQU   SIBBIND2                                                 01540000
SIBSDEF  EQU   SIBBIND2                                                 01541000
SIBSRQM  EQU   SIBBIND1                                                 01542000
SIBSCHNG EQU   SIBBIND1                                                 01543000
SIBPEBI  EQU   SIBBIND1                                                 01544000
SIBPCMP  EQU   SIBBIND1                                                 01545000
SIBPEXC  EQU   SIBBIND1                                                 01546000
SIBPDEF  EQU   SIBBIND1                                                 01547000
SIBPRQM  EQU   SIBBIND1                                                 01548000
SIBPCHN  EQU   SIBBIND1                                                 01549000
SIBFMPRO EQU   IEDSIBD+19                                               01550000
SIBTSPRO EQU   IEDSIBD+18                                               01551000
@NM00163 EQU   SIBSTAT2                                                 01552000
SIBDACLU EQU   SIBSTAT2                                                 01553000
SIBUSS   EQU   SIBSTAT2                                                 01554000
SIBBSTAT EQU   SIBSTAT1                                                 01555000
SIBRTRP  EQU   SIBSTAT1                                                 01556000
SIBFTERM EQU   SIBSTAT1                                                 01557000
SIBRQEND EQU   SIBSTAT1                                                 01558000
SIBRQSHT EQU   SIBSTAT1                                                 01559000
SIBSEQO  EQU   SIBSEQN+2                                                01560000
SIBSEQI  EQU   SIBSEQN                                                  01561000
SIBNCNT  EQU   SIBPACIN                                                 01562000
SIBMCNT  EQU   SIBPACIN                                                 01563000
SIBDSTAT EQU   SIBSESSN                                                 01564000
SIBINBIU EQU   SIBSESSN                                                 01565000
SIBSHUTC EQU   SIBSESSN                                                 01566000
SIBLGOFF EQU   SIBSESSN                                                 01567000
SIBCHAIN EQU   IEDSIBD+4                                                01568000
SIBRUSEG EQU   IEDSIBD                                                  01569000
@NM00162 EQU   TRHBYTE2                                                 01570000
@NM00161 EQU   TRHBYTE2                                                 01571000
@NM00160 EQU   TRHBYTE2                                                 01572000
TRHCSI   EQU   TRHBYTE2                                                 01573000
@NM00159 EQU   TRHBYTE2                                                 01574000
TRHCDI   EQU   TRHBYTE2                                                 01575000
TRHEB    EQU   TRHBYTE2                                                 01576000
TRHBB    EQU   TRHBYTE2                                                 01577000
TRHPI    EQU   TRHBYTE1                                                 01578000
@NM00158 EQU   TRHBYTE1                                                 01579000
@NM00157 EQU   TRHBYTE1                                                 01580000
@NM00156 EQU   TRHBYTE1                                                 01581000
@NM00155 EQU   TRHBYTE1                                                 01582000
TRHEC    EQU   TRHBYTE0                                                 01583000
TRHBC    EQU   TRHBYTE0                                                 01584000
@NM00154 EQU   TRHBYTE0                                                 01585000
TRHRUCAT EQU   TRHBYTE0                                                 01586000
REQRCD2  EQU   REQRCDS+1                                                01587000
REQRCD1  EQU   REQRCDS                                                  01588000
REQSWTCH EQU   REQROUTE+1                                               01589000
REQFLAG  EQU   REQROUTE                                                 01590000
REQLINK  EQU   IEDREQD+5                                                01591000
@NM00153 EQU   IEDPRUND+4                                               01592000
PRUTHEFI EQU   PRUFIDN                                                  01593000
PRUTHEIU EQU   PRUFIDN                                                  01594000
PRUTHBIU EQU   PRUFIDN                                                  01595000
PRUTHTYE EQU   PRUFIDN                                                  01596000
@NM00152 EQU   PRURHFG2                                                 01597000
PRURHCSI EQU   PRURHFG2                                                 01598000
@NM00151 EQU   PRURHFG2                                                 01599000
PRURHCDI EQU   PRURHFG2                                                 01600000
PRURHEB  EQU   PRURHFG2                                                 01601000
PRURHBB  EQU   PRURHFG2                                                 01602000
PRURHPI  EQU   PRURHFG1                                                 01603000
@NM00150 EQU   PRURHFG1                                                 01604000
PRURHER  EQU   PRURHFG1                                                 01605000
PRURHDR2 EQU   PRURHFG1                                                 01606000
@NM00149 EQU   PRURHFG1                                                 01607000
PRURHDR1 EQU   PRURHFG1                                                 01608000
PRURHEC  EQU   PRURHFG0                                                 01609000
PRURHBC  EQU   PRURHFG0                                                 01610000
PRURHSDI EQU   PRURHFG0                                                 01611000
PRURHFI  EQU   PRURHFG0                                                 01612000
@NM00148 EQU   PRURHFG0                                                 01613000
PRURUCAT EQU   PRURHFG0                                                 01614000
PRURHTYP EQU   PRURHFG0                                                 01615000
PRUNUNIT EQU   PRUTIC+1                                                 01616000
@NM00147 EQU   PRUTIC                                                   01617000
@NM00146 EQU   IEDPRUQD+4                                               01618000
PRF2SEQP EQU   PRF2WD2                                                  01619000
@NM00145 EQU   IEDPF2+1                                                 01620000
@NM00144 EQU   PRF2FLG2                                                 01621000
PRF2TERM EQU   PRF2FLG2                                                 01622000
PRF2SMI  EQU   PRF2FLG2                                                 01623000
PRF2FORM EQU   PRF2FLG2                                                 01624000
PRF1RULN EQU   PRF1SEQP+2                                               01625000
PRF1TAG2 EQU   PRF1SQID+1                                               01626000
@NM00143 EQU   PRF1TAG1                                                 01627000
PRF1TAGS EQU   PRF1TAG1                                                 01628000
@NM00142 EQU   PRF1FLG1                                                 01629000
PRF1LOGD EQU   PRF1FLG1                                                 01630000
PRF1FORM EQU   PRF1FLG1                                                 01631000
PRF1EXPI EQU   PRF1FLG1                                                 01632000
PRF1FIDI EQU   PRF1FLG1                                                 01633000
PRFDEST  EQU   IEDQPRF+40                                               01634000
PRFISEQ  EQU   IEDQPRF+38                                               01635000
PRFSTXT  EQU   PRFHQBCK                                                 01636000
PRFNHDR  EQU   PRFCHDR                                                  01637000
PRFCRCD  EQU   IEDQPRF+29                                               01638000
PRFSVSEQ EQU   PRFNTXT+1                                                01639000
PRFSVPRI EQU   PRFEOBOF                                                 01640000
@NM00141 EQU   PRFSCAN                                                  01641000
PRFEOB   EQU   PRFXTRA+1                                                01642000
PRFSTSO  EQU   PRFXTRA                                                  01643000
PRFNHDRN EQU   PRFSTAT1                                                 01644000
PRFNLSTN EQU   PRFSTAT1                                                 01645000
PRFLOCK  EQU   PRFEOFN                                                  01646000
PRFDUPLN EQU   PRFSTAT1                                                 01647000
PRFTSMSG EQU   PRFSTAT1                                                 01648000
PRFITCPN EQU   PRFSTAT1                                                 01649000
PRFERMGN EQU   PRFSTAT1                                                 01650000
PRFCNCLN EQU   PRFSTAT1                                                 01651000
PRFSVFLG EQU   @NM00140+3                                               01652000
PRFSIZE  EQU   PRFSVFFO+2                                               01653000
PRFLCB   EQU   IEDQPRF+13                                               01654000
@NM00139 EQU   PRFTICC                                                  01655000
@NM00138 EQU   PRFTICC                                                  01656000
@NM00137 EQU   PRFTICC                                                  01657000
PRFTICON EQU   PRFTICC                                                  01658000
@NM00136 EQU   PRFTICC                                                  01659000
@NM00135 EQU   PRFTICC                                                  01660000
PRFBFMM  EQU   PRFTICC                                                  01661000
PRFEOMSG EQU   PRFTICC                                                  01662000
PRFCOUNT EQU   PRFLINK+1                                                01663000
@NM00134 EQU   PRFLINK                                                  01664000
PRFFLAGS EQU   PRFPRI                                                   01665000
PRFIOADR EQU   PRFQCBA                                                  01666000
PRFOPCDE EQU   PRFKEY                                                   01667000
PLMVUNCA EQU   IEDPLMV+20                                               01668000
PLMVFLG2 EQU   IEDPLMV+19                                               01669000
@NM00133 EQU   PLMVFLG1                                                 01670000
PLMVSCTG EQU   PLMVFLG1                                                 01671000
PLMVUNCF EQU   PLMVFLG1                                                 01672000
@NM00132 EQU   OCLDNME+4                                                01673000
@NM00131 EQU   OCPREFLG                                                 01674000
OCTOTEP  EQU   OCPREFLG                                                 01675000
OCREPOST EQU   OCPREFLG                                                 01676000
OCRSPSNT EQU   OCPREFLG                                                 01677000
OCBFREQ  EQU   OCPREFLG                                                 01678000
OCIDLE   EQU   OCREQFLG                                                 01679000
OCFORCE  EQU   OCREQFLG                                                 01680000
OCDCARD  EQU   OCREQFLG                                                 01681000
OCPARTAL EQU   OCREQFLG                                                 01682000
OCADNCP  EQU   OCREQFLG                                                 01683000
@NM00130 EQU   OCREQFLG                                                 01684000
@NM00129 EQU   OCREQFLG                                                 01685000
OCFLUSHZ EQU   OCREQFLG                                                 01686000
OCRESPCT EQU   OCLINTTE                                                 01687000
OCCKPTWA EQU   OCCKDATA+4                                               01688000
@NM00126 EQU   OCRSTGTM+2                                               01689000
OCCKDAT2 EQU   OCRSTGTM+1                                               01690000
OCCKDAT1 EQU   OCRSTGTM                                                 01691000
OCPTRSAV EQU   OCMODNME+4                                               01692000
OCPUADR  EQU   OCIPLWA+2                                                01693000
OCWTGSAV EQU   OCIPLWA                                                  01694000
OCDVRDCT EQU   OCBACKUP+6                                               01695000
OCNCP    EQU   OCBACKUP+4                                               01696000
OCBUFGOT EQU   OCBACKUP+2                                               01697000
OCBUFNED EQU   OCBACKUP                                                 01698000
OCRESNUM EQU   OCPARM                                                   01699000
OCSEQ    EQU   OCTRUNIT+2                                               01700000
@NM00125 EQU   OCRSID+1                                                 01701000
OCNONE   EQU   OCALSTAT                                                 01702000
OCSOME   EQU   OCALSTAT                                                 01703000
OCALLFLG EQU   OCALSTAT                                                 01704000
OCREDRVE EQU   OCALSTAT                                                 01705000
OCSEQIND EQU   OCALSTAT                                                 01706000
@NM00124 EQU   OCALSTAT                                                 01707000
OCRENTRD EQU   OCALSTAT                                                 01708000
OCWTGB   EQU   OCTIOT                                                   01709000
OCTRMTBL EQU   IEDQOPCE+20                                              01710000
@NM00123 EQU   @NM00122+2                                               01711000
OCCONID  EQU   OCDEST                                                   01712000
OCRLN    EQU   IEDQOPCE+15                                              01713000
OCRESP   EQU   OCFLAG                                                   01714000
OCATTACH EQU   OCFLAG                                                   01715000
OCSSCP   EQU   OCFLAG                                                   01716000
OCOUTPUT EQU   OCFLAG                                                   01717000
OCLINE   EQU   OCFLAG                                                   01718000
OCMPP    EQU   OCFLAG                                                   01719000
OCTOTE   EQU   OCFLAG                                                   01720000
OCCONSOL EQU   OCFLAG                                                   01721000
@NM00121 EQU   OCSWITCH                                                 01722000
OCQUCKN  EQU   OCSWITCH                                                 01723000
OCPRIFLG EQU   OCOPTCDE                                                 01724000
@NM00120 EQU   OCRUDEST+1                                               01725000
@NM00119 EQU   OCSCAN                                                   01726000
OCNOTUCB EQU   OCSCAN                                                   01727000
OCNONAME EQU   OCSCAN                                                   01728000
OCALLRLN EQU   OCSCAN                                                   01729000
OCDDNAME EQU   OCSCAN                                                   01730000
OCDDNRLN EQU   OCSCAN                                                   01731000
OCADDR   EQU   OCSCAN                                                   01732000
OCELMPTR EQU   OCELEM+1                                                 01733000
OCLINK   EQU   IEDQOPCE                                                 01734000
OPCBOTTM EQU   IEDQOPCD+1184                                            01735000
@NM00118 EQU   IEDQOPCD+1100                                            01736000
@NM00117 EQU   IEDQOPCD+948                                             01737000
@NM00116 EQU   IEDQOPCD+940                                             01738000
@NM00115 EQU   IEDQOPCD+380                                             01739000
@NM00114 EQU   OPCPWCOB+9                                               01740000
@NM00113 EQU   OPCPWCOB+8                                               01741000
@NM00112 EQU   OPCPWECB+1                                               01742000
OPCPWCCC EQU   OPCPWECB                                                 01743000
OPCPWCHN EQU   OPCPWQCB+1                                               01744000
OPCPWVTO EQU   OPCPWQCB                                                 01745000
OPCWAITV EQU   IEDQOPCD+364                                             01746000
OPCTOTCK EQU   IEDQOPCD+360                                             01747000
OPCAPXTL EQU   IEDQOPCD+356                                             01748000
OPCDECR  EQU   IEDQOPCD+352                                             01749000
OPCBUFWT EQU   IEDQOPCD+348                                             01750000
OPCWRKSP EQU   IEDQOPCD+320                                             01751000
OPCADGOT EQU   IEDQOPCD+318                                             01752000
OPCRQCNT EQU   IEDQOPCD+316                                             01753000
OPPOLSTP EQU   IEDQOPCD+312                                             01754000
OPCCKCIB EQU   IEDQOPCD+308                                             01755000
OPCEND   EQU   IEDQOPCD+307                                             01756000
OPCSTCBS EQU   IEDQOPCD+306                                             01757000
OPCHNEND EQU   IEDQOPCD+302                                             01758000
OPCOQSW  EQU   IEDQOPCD+301                                             01759000
@NM00111 EQU   OPCSPEC                                                  01760000
@NM00110 EQU   OPCSPEC                                                  01761000
@NM00109 EQU   OPCSPEC                                                  01762000
@NM00108 EQU   OPCSPEC                                                  01763000
OPCFRMCA EQU   OPCSPEC                                                  01764000
OPCRSTRT EQU   OPCSPEC                                                  01765000
OPCPART  EQU   OPCSPEC                                                  01766000
OPCALTD  EQU   OPCSPEC                                                  01767000
OPCBFEND EQU   IEDQOPCD+296                                             01768000
OPCBFIRS EQU   IEDQOPCD+292                                             01769000
OPCAVBUF EQU   IEDQOPCD+290                                             01770000
OPCIPLCT EQU   IEDQOPCD+289                                             01771000
OPCCLNTS EQU   IEDQOPCD+288                                             01772000
OPCHA8   EQU   IEDQOPCD+286                                             01773000
OPCBFREQ EQU   IEDQOPCD+284                                             01774000
OPCNEXT  EQU   IEDQOPCD+272                                             01775000
OPCFMDFC EQU   IEDQOPCD+268                                             01776000
OPCSCNC  EQU   IEDQOPCD+264                                             01777000
OPCHORTG EQU   IEDQOPCD+260                                             01778000
OPCHORT  EQU   IEDQOPCD+256                                             01779000
OPCCKPTL EQU   IEDQOPCD+252                                             01780000
OPCCKPTF EQU   IEDQOPCD+248                                             01781000
OPCWAITA EQU   IEDQOPCD+244                                             01782000
OPCWAITR EQU   IEDQOPCD+240                                             01783000
OPCWAITP EQU   IEDQOPCD+236                                             01784000
OPCWAITO EQU   IEDQOPCD+232                                             01785000
OPCWAITN EQU   IEDQOPCD+228                                             01786000
OPCWAITL EQU   IEDQOPCD+224                                             01787000
OPCWAITC EQU   IEDQOPCD+220                                             01788000
@NM00107 EQU   OPCLDNME+5                                               01789000
@NM00106 EQU   OPCLDNME                                                 01790000
OPCWAIT  EQU   IEDQOPCD+192                                             01791000
OPCCKERB EQU   IEDQOPCD+164                                             01792000
OPCBFERB EQU   IEDQOPCD+148                                             01793000
OPCFLAG2 EQU   IEDQOPCD+147                                             01794000
OPCFLAG1 EQU   IEDQOPCD+146                                             01795000
OPCWRKSZ EQU   IEDQOPCD+144                                             01796000
OPCRSAVE EQU   IEDQOPCD+132                                             01797000
OPCQCBAD EQU   IEDQOPCD+128                                             01798000
OPCTRMWA EQU   IEDQOPCD+52                                              01799000
OPCTNTEA EQU   IEDQOPCD+44                                              01800000
OPCPGCK  EQU   IEDQOPCD+40                                              01801000
OPCLCB   EQU   IEDQOPCD+36                                              01802000
@NM00105 EQU   IEDQOPCD+32                                              01803000
OPCIPLAD EQU   IEDQOPCD+28                                              01804000
OPCTOFLK EQU   IEDQOPCD+24                                              01805000
OPCOPTLK EQU   IEDQOPCD+20                                              01806000
OPCDCBLK EQU   IEDQOPCD+16                                              01807000
OPCDOUBL EQU   IEDQOPCD                                                 01808000
MHENTRY  EQU   IEDMHTD+8                                                01809000
MHTABEND EQU   MHNAME                                                   01810000
SAVTBITN EQU   IEDNSVTD+312                                             01811000
@NM00104 EQU   SAVTCKQB+8                                               01812000
@NM00103 EQU   SAVTCKEC+1                                               01813000
@NM00102 EQU   SAVTCKCC                                                 01814000
SAVTCKPO EQU   SAVTCKCC                                                 01815000
SAVTCKWA EQU   SAVTCKCC                                                 01816000
SAVTCKCH EQU   SAVTCKTB+1                                               01817000
SAVTCKVT EQU   SAVTCKTB                                                 01818000
@NM00101 EQU   IEDNSVTD+297                                             01819000
SAVTRDFG EQU   SAVTRDRV+12                                              01820000
@NM00100 EQU   SAVTRDRV+5                                               01821000
SAVTRDPY EQU   SAVTRDRV+4                                               01822000
SAVTRDQB EQU   SAVTRDRV+1                                               01823000
SAVTRDKY EQU   SAVTRDRV                                                 01824000
SAVTNID  EQU   IEDNSVTD+280                                             01825000
SAVTDVAS EQU   IEDNSVTD+276                                             01826000
SAVTPLSZ EQU   IEDNSVTD+274                                             01827000
@NM00099 EQU   IEDNSVTD+273                                             01828000
SAVTSUBL EQU   IEDNSVTD+272                                             01829000
@NM00098 EQU   SAVTZELM+1                                               01830000
SAVTSUBM EQU   SAVTZELM                                                 01831000
SAVTNAT1 EQU   IEDNSVTD+266                                             01832000
SAVTSH20 EQU   IEDNSVTD+264                                             01833000
SAVTLCBS EQU   IEDNSVTD+260                                             01834000
SAVTRNMP EQU   IEDNSVTD+256                                             01835000
SAVTNAX  EQU   IEDNSVTD+248                                             01836000
SAVTSUBV EQU   IEDNSVTD+247                                             01837000
SAVTSUBA EQU   IEDNSVTD+246                                             01838000
SAVTSIBC EQU   IEDNSVTD+244                                             01839000
SAVTBSM  EQU   IEDNSVTD+240                                             01840000
SAVTRQTG EQU   IEDNSVTD+236                                             01841000
SAVTRQCH EQU   IEDNSVTD+232                                             01842000
SAVTMAND EQU   IEDNSVTD+228                                             01843000
SAVTSPLN EQU   IEDNSVTD+224                                             01844000
SAVTNADL EQU   IEDNSVTD+222                                             01845000
SAVTNATL EQU   IEDNSVTD+220                                             01846000
SAVTSSMH EQU   IEDNSVTD+212                                             01847000
SAVTQRS  EQU   IEDNSVTD+208                                             01848000
SAVTRQIN EQU   IEDNSVTD+204                                             01849000
SAVTSAO  EQU   IEDNSVTD+196                                             01850000
SAVTSARI EQU   IEDNSVTD+192                                             01851000
SAVTSAC  EQU   IEDNSVTD+188                                             01852000
SAVTSAI  EQU   IEDNSVTD+184                                             01853000
SAVTCSCI EQU   IEDNSVTD+180                                             01854000
SAVTSSRP EQU   IEDNSVTD+176                                             01855000
SAVTSSRQ EQU   IEDNSVTD+172                                             01856000
SAVTSCLU EQU   IEDNSVTD+168                                             01857000
@NM00097 EQU   IEDNSVTD+148                                             01858000
SAVTIPCQ EQU   IEDNSVTD+144                                             01859000
@NM00096 EQU   IEDNSVTD+136                                             01860000
SAVTXFMI EQU   IEDNSVTD+132                                             01861000
@NM00095 EQU   IEDNSVTD+124                                             01862000
SAVTXFMO EQU   IEDNSVTD+120                                             01863000
@NM00094 EQU   IEDNSVTD+116                                             01864000
SAVTSSSR EQU   IEDNSVTD+112                                             01865000
SAVTSCPQ EQU   IEDNSVTD+108                                             01866000
SAVTSLCB EQU   IEDNSVTD+104                                             01867000
SAVTLUSR EQU   IEDNSVTD+100                                             01868000
@NM00093 EQU   SAVTLUSQ+8                                               01869000
SAVTLUSP EQU   SAVTLUSQ+4                                               01870000
SAVTLUSB EQU   SAVTLUSQ                                                 01871000
@NM00092 EQU   IEDNSVTD+84                                              01872000
SAVTSAT  EQU   IEDNSVTD+80                                              01873000
SAVTNAT  EQU   IEDNSVTD+76                                              01874000
SAVTCLUP EQU   IEDNSVTD+72                                              01875000
SAVTPIUT EQU   IEDNSVTD+68                                              01876000
SAVTRNTA EQU   IEDNSVTD+64                                              01877000
SAVTDNIR EQU   IEDNSVTD+60                                              01878000
SAVTCNIR EQU   IEDNSVTD+56                                              01879000
SAVTFLDH EQU   IEDNSVTD+52                                              01880000
SAVTSRTN EQU   IEDNSVTD+48                                              01881000
SAVTSREQ EQU   IEDNSVTD+44                                              01882000
SAVTFAIL EQU   IEDNSVTD+42                                              01883000
SAVTSUSE EQU   IEDNSVTD+40                                              01884000
SAVTSIB  EQU   IEDNSVTD+36                                              01885000
SAVTPRTN EQU   IEDNSVTD+32                                              01886000
@NM00091 EQU   IEDNSVTD+28                                              01887000
SAVTWH20 EQU   IEDNSVTD+26                                              01888000
SAVTPWT  EQU   IEDNSVTD+24                                              01889000
SAVTPRTQ EQU   IEDNSVTD+20                                              01890000
SAVTPREQ EQU   IEDNSVTD+16                                              01891000
SAVTPH20 EQU   IEDNSVTD+14                                              01892000
SAVTPUSE EQU   IEDNSVTD+12                                              01893000
SAVTPLCB EQU   IEDNSVTD+8                                               01894000
SAVTPOOL EQU   IEDNSVTD+4                                               01895000
SAVTPRMT EQU   SAVTDIAF                                                 01896000
SAVTVIRT EQU   SAVTDIAF                                                 01897000
AVTCPBNO EQU   IEDQAVTD+1244                                            01898000
AVTHRESS EQU   IEDQAVTD+1243                                            01899000
@NM00090 EQU   IEDQAVTD+1242                                            01900000
@NM00089 EQU   IEDQAVTD+1241                                            01901000
@NM00088 EQU   IEDQAVTD+1240                                            01902000
@NM00087 EQU   IEDQAVTD+1237                                            01903000
@NM00086 EQU   IEDQAVTD+1236                                            01904000
AVTHRESE EQU   @NM00085                                                 01905000
AVTRADDR EQU   IEDQAVTD+1228                                            01906000
AVTNADDR EQU   IEDQAVTD+1224                                            01907000
AVTHRESN EQU   IEDQAVTD+1220                                            01908000
AVTVOLRN EQU   IEDQAVTD+1216                                            01909000
AVTTOTNN EQU   IEDQAVTD+1212                                            01910000
AVTTRCYN EQU   IEDQAVTD+1208                                            01911000
AVTRCTRN EQU   IEDQAVTD+1204                                            01912000
AVTNOVON EQU   IEDQAVTD+1200                                            01913000
AVTADEBN EQU   IEDQAVTD+1196                                            01914000
AVTVOLRR EQU   IEDQAVTD+1192                                            01915000
AVTTOTNR EQU   IEDQAVTD+1188                                            01916000
AVTTRCYR EQU   IEDQAVTD+1184                                            01917000
AVTRCTRR EQU   IEDQAVTD+1180                                            01918000
AVTNOVOR EQU   IEDQAVTD+1176                                            01919000
AVTADEBR EQU   IEDQAVTD+1172                                            01920000
AVTLODPT EQU   IEDQAVTD+1168                                            01921000
AVTIOBN  EQU   IEDQAVTD+1164                                            01922000
AVTIOBR  EQU   IEDQAVTD+1160                                            01923000
AVTCPBPT EQU   IEDQAVTD+1156                                            01924000
AVTFCPB  EQU   IEDQAVTD+1152                                            01925000
@NM00084 EQU   IEDQAVTD+1148                                            01926000
AVTINCPQ EQU   IEDQAVTD+1144                                            01927000
@NM00083 EQU   IEDQAVTD+1140                                            01928000
@NM00082 EQU   IEDQAVTD+1137                                            01929000
@NM00081 EQU   AVTBIT4                                                  01930000
@NM00080 EQU   AVTBIT4                                                  01931000
@NM00079 EQU   AVTBIT4                                                  01932000
@NM00078 EQU   AVTBIT4                                                  01933000
@NM00077 EQU   AVTBIT4                                                  01934000
@NM00076 EQU   AVTBIT4                                                  01935000
@NM00075 EQU   AVTBIT4                                                  01936000
AVTRUFTN EQU   AVTBIT4                                                  01937000
@NM00074 EQU   IEDQAVTD+1132                                            01938000
AVTNOBFQ EQU   IEDQAVTD+1128                                            01939000
@NM00073 EQU   IEDQAVTD+1124                                            01940000
AVTDKENQ EQU   IEDQAVTD+1120                                            01941000
@NM00072 EQU   IEDQAVTD+1116                                            01942000
AVTDKAPQ EQU   IEDQAVTD+1112                                            01943000
AVTCOPY  EQU   IEDQAVTD+1108                                            01944000
AVTIA    EQU   IEDQAVTD+1104                                            01945000
AVTFL    EQU   IEDQAVTD+1100                                            01946000
@NM00071 EQU   IEDQAVTD+1096                                            01947000
AVTNCPBQ EQU   IEDQAVTD+1092                                            01948000
AVTTOTNC EQU   IEDQAVTD+1088                                            01949000
AVTCMAX  EQU   IEDQAVTD+1084                                            01950000
AVTCMIN  EQU   IEDQAVTD+1080                                            01951000
AVTHM02  EQU   IEDQAVTD+1076                                            01952000
AVTOPCIN EQU   IEDQAVTD+1074                                            01953000
AVTDCTLN EQU   IEDQAVTD+1072                                            01954000
AVTOPMSK EQU   IEDQAVTD+1068                                            01955000
AVTDDFT  EQU   IEDQAVTD+1064                                            01956000
AVTSTEAL EQU   IEDQAVTD+1060                                            01957000
AVTOPTN  EQU   IEDQAVTD+1056                                            01958000
AVTDSKCT EQU   IEDQAVTD+1054                                            01959000
AVTCKRST EQU   IEDQAVTD+1053                                            01960000
AVTSTAN  EQU   AVTBIT3                                                  01961000
AVTSTACN EQU   AVTBIT3                                                  01962000
AVTSTAIN EQU   AVTBIT3                                                  01963000
AVTSTAYN EQU   AVTBIT3                                                  01964000
AVTOLTBN EQU   AVTBIT3                                                  01965000
AVTTSAB  EQU   AVTBIT3                                                  01966000
AVTRFULN EQU   AVTBIT3                                                  01967000
AVTRECVN EQU   AVTBIT3                                                  01968000
@NM00070 EQU   AVTBIT2                                                  01969000
@NM00069 EQU   AVTBIT2                                                  01970000
AVTOPEIN EQU   AVTBIT2                                                  01971000
AVTSTRTN EQU   AVTBIT2                                                  01972000
AVTTOPOL EQU   AVTBIT2                                                  01973000
AVTCOPYN EQU   AVTBIT2                                                  01974000
AVTREUSN EQU   AVTBIT2                                                  01975000
AVTEXTSC EQU   AVTBIT2                                                  01976000
AVTDISKN EQU   AVTBIT1                                                  01977000
AVTQUCKN EQU   AVTBIT1                                                  01978000
AVTCLOSN EQU   AVTBIT1                                                  01979000
AVTREADN EQU   AVTBIT1                                                  01980000
AVTDLAYN EQU   AVTBIT1                                                  01981000
AVTAQTAN EQU   AVTBIT1                                                  01982000
AVTTSON  EQU   AVTBIT1                                                  01983000
AVTAPLKN EQU   AVTBIT1                                                  01984000
AVTDUMBR EQU   IEDQAVTD+1048                                            01985000
AVTDLQX  EQU   IEDQAVTD+1046                                            01986000
AVTINTLV EQU   IEDQAVTD+1044                                            01987000
AVTSMCNT EQU   IEDQAVTD+1042                                            01988000
AVTAVFCT EQU   IEDQAVTD+1040                                            01989000
AVTOPCON EQU   IEDQAVTD+1038                                            01990000
AVTOPCNT EQU   IEDQAVTD+1036                                            01991000
AVTLNCNT EQU   IEDQAVTD+1034                                            01992000
AVTKEYLE EQU   IEDQAVTD+1032                                            01993000
AVTHA16  EQU   IEDQAVTD+1030                                            01994000
AVTHA7   EQU   IEDQAVTD+1028                                            01995000
AVTHA4   EQU   IEDQAVTD+1026                                            01996000
AVTHA3   EQU   IEDQAVTD+1024                                            01997000
AVTHA2   EQU   IEDQAVTD+1022                                            01998000
AVTGETMS EQU   IEDQAVTD+1021                                            01999000
@NM00068 EQU   IEDQAVTD+1020                                            02000000
AVTGETMD EQU   IEDQAVTD+1016                                            02001000
AVTGETMN EQU   IEDQAVTD+1012                                            02002000
AVTCWTOT EQU   IEDQAVTD+1008                                            02003000
AVTCWINT EQU   IEDQAVTD+956                                             02004000
AVTDTRAP EQU   IEDQAVTD+952                                             02005000
@NM00067 EQU   IEDQAVTD+950                                             02006000
@NM00066 EQU   AVTIOTR                                                  02007000
AVTIOTRH EQU   AVTIOTR                                                  02008000
AVTIOTRE EQU   AVTIOTR                                                  02009000
@NM00065 EQU   AVTSUBT                                                  02010000
AVTSUBPT EQU   AVTSUBT                                                  02011000
AVTSUBON EQU   AVTSUBT                                                  02012000
AVTAFE30 EQU   IEDQAVTD+944                                             02013000
AVTAFE20 EQU   IEDQAVTD+940                                             02014000
AVTAFE10 EQU   IEDQAVTD+936                                             02015000
AVTCWEC2 EQU   IEDQAVTD+932                                             02016000
AVTCWPM2 EQU   IEDQAVTD+928                                             02017000
AVTCWTS2 EQU   IEDQAVTD+927                                             02018000
AVTCWTS1 EQU   IEDQAVTD+926                                             02019000
AVTCWCLD EQU   AVTCWFL2                                                 02020000
AVTCWRAP EQU   AVTCWFL2                                                 02021000
@NM00064 EQU   AVTCWFL2                                                 02022000
@NM00063 EQU   AVTCWFL2                                                 02023000
@NM00062 EQU   AVTCWFL2                                                 02024000
@NM00061 EQU   AVTCWFL2                                                 02025000
@NM00060 EQU   AVTCWFL2                                                 02026000
AVTCWACT EQU   AVTCWFL2                                                 02027000
@NM00059 EQU   AVTCWFL1                                                 02028000
@NM00058 EQU   AVTCWFL1                                                 02029000
@NM00057 EQU   AVTCWFL1                                                 02030000
@NM00056 EQU   AVTCWFL1                                                 02031000
@NM00055 EQU   AVTCWFL1                                                 02032000
@NM00054 EQU   AVTCWFL1                                                 02033000
@NM00053 EQU   AVTCWFL1                                                 02034000
AVTCOMWN EQU   AVTCWFL1                                                 02035000
AVTCWEC1 EQU   IEDQAVTD+920                                             02036000
AVTCWPM1 EQU   IEDQAVTD+916                                             02037000
AVTCAREA EQU   IEDQAVTD+912                                             02038000
AVTFZERO EQU   IEDQAVTD+908                                             02039000
AVTCADDR EQU   IEDQAVTD+904                                             02040000
AVTCOREC EQU   IEDQAVTD+900                                             02041000
@NM00052 EQU   IEDQAVTD+892                                             02042000
AVTCPBCB EQU   IEDQAVTD+888                                             02043000
@NM00051 EQU   IEDQAVTD+880                                             02044000
AVTDSIOB EQU   IEDQAVTD+876                                             02045000
@NM00050 EQU   IEDQAVTD+868                                             02046000
AVTCPRMB EQU   IEDQAVTD+864                                             02047000
@NM00049 EQU   IEDQAVTD+856                                             02048000
AVTCLOSB EQU   IEDQAVTD+852                                             02049000
@NM00048 EQU   IEDQAVTD+844                                             02050000
AVTACTIB EQU   IEDQAVTD+840                                             02051000
@NM00047 EQU   IEDQAVTD+836                                             02052000
AVTOLTEB EQU   IEDQAVTD+832                                             02053000
AVTOLTCH EQU   AVTOLTQB+1                                               02054000
AVTOLTVT EQU   AVTOLTQB                                                 02055000
@NM00046 EQU   AVTOPCQB+8                                               02056000
@NM00045 EQU   AVTOPCEC+1                                               02057000
@NM00044 EQU   AVTOPCCC                                                 02058000
AVTOPCPO EQU   AVTOPCCC                                                 02059000
AVTOPCWA EQU   AVTOPCCC                                                 02060000
AVTOPCCH EQU   AVTOPCOB+1                                               02061000
AVTOPCVT EQU   AVTOPCOB                                                 02062000
@NM00043 EQU   AVTCKPQB+9                                               02063000
AVTCKPTS EQU   AVTCKPQB+8                                               02064000
@NM00042 EQU   AVTCKPEC+1                                               02065000
@NM00041 EQU   AVTCKPCC                                                 02066000
AVTCKPPO EQU   AVTCKPCC                                                 02067000
AVTCKPWA EQU   AVTCKPCC                                                 02068000
AVTCKPCH EQU   AVTCKPTB+1                                               02069000
AVTCKPVT EQU   AVTCKPTB                                                 02070000
@NM00040 EQU   IEDQAVTD+796                                             02071000
@NM00039 EQU   IEDQAVTD+784                                             02072000
AVTBFREB EQU   IEDQAVTD+780                                             02073000
AVTTIMQ  EQU   IEDQAVTD+776                                             02074000
@NM00038 EQU   IEDQAVTD+772                                             02075000
AVTIMQPS EQU   IEDQAVTD+768                                             02076000
AVTINOUT EQU   IEDQAVTD+766                                             02077000
AVTREFTM EQU   IEDQAVTD+764                                             02078000
@NM00037 EQU   IEDQAVTD+752                                             02079000
AVTDELYB EQU   IEDQAVTD+748                                             02080000
AVTOCQPT EQU   IEDQAVTD+744                                             02081000
AVTTSOPT EQU   IEDQAVTD+740                                             02082000
AVTSUPPT EQU   IEDQAVTD+736                                             02083000
AVTCBQCB EQU   IEDQAVTD+732                                             02084000
@NM00036 EQU   AVTSYSER                                                 02085000
@NM00035 EQU   AVTSYSER                                                 02086000
@NM00034 EQU   AVTSYSER                                                 02087000
@NM00033 EQU   AVTSYSER                                                 02088000
@NM00032 EQU   AVTSYSER                                                 02089000
@NM00031 EQU   AVTSYSER                                                 02090000
AVTCMAXN EQU   AVTSYSER                                                 02091000
AVTCMINN EQU   AVTSYSER                                                 02092000
AVT2260L EQU   IEDQAVTD+724                                             02093000
AVTABEPL EQU   AVTADBUF                                                 02094000
AVTHFF   EQU   AVTCLRHI+2                                               02095000
@NM00030 EQU   AVTCLRHI                                                 02096000
AVTCCLNK EQU   AVTCRELE+5                                               02097000
AVTCCPRI EQU   AVTCRELE+4                                               02098000
AVTCCQCB EQU   AVTCCELE+1                                               02099000
AVTCCKEY EQU   AVTCCELE                                                 02100000
AVTDELAD EQU   IEDQAVTD+704                                             02101000
AVTDELEM EQU   IEDQAVTD+700                                             02102000
AVTBSX   EQU   AVTCKLNK                                                 02103000
AVTOPETR EQU   AVTHG01                                                  02104000
@NM00029 EQU   AVTCKBYT                                                 02105000
AVTCKONQ EQU   AVTCKBYT                                                 02106000
@NM00028 EQU   AVTCKBYT                                                 02107000
@NM00027 EQU   AVTCKBYT                                                 02108000
@NM00026 EQU   AVTCKBYT                                                 02109000
@NM00025 EQU   AVTCKBYT                                                 02110000
@NM00024 EQU   AVTCKBYT                                                 02111000
@NM00023 EQU   AVTCKBYT                                                 02112000
AVTOPERT EQU   IEDQAVTD+690                                             02113000
AVTOPXCL EQU   IEDQAVTD+688                                             02114000
AVTOPERL EQU   IEDQAVTD+687                                             02115000
@NM00022 EQU   IEDQAVTD+686                                             02116000
AVTCKTIM EQU   IEDQAVTD+684                                             02117000
AVTCKELV EQU   IEDQAVTD+682                                             02118000
AVTCPRCD EQU   IEDQAVTD+681                                             02119000
AVTWARMN EQU   AVTCKELF                                                 02120000
AVTCRTLN EQU   AVTCKELF                                                 02121000
AVTCPIPN EQU   AVTCKELF                                                 02122000
AVTCCLCN EQU   AVTCKELF                                                 02123000
AVTCINCN EQU   AVTCKELF                                                 02124000
@NM00021 EQU   AVTCKELF                                                 02125000
AVTCMCPN EQU   AVTCKELF                                                 02126000
AVTNQBCK EQU   AVTCKELF                                                 02127000
AVTCKQAD EQU   IEDQAVTD+677                                             02128000
AVTSCBSZ EQU   IEDQAVTD+676                                             02129000
@NM00020 EQU   IEDQAVTD+672                                             02130000
AVTCKELE EQU   IEDQAVTD+668                                             02131000
@NM00019 EQU   AVTCKPEL+8                                               02132000
AVTCKRLK EQU   AVTCKPEL+5                                               02133000
AVTCKRPR EQU   AVTCKPEL+4                                               02134000
AVTCKRMQ EQU   AVTCKRMV+1                                               02135000
AVTCKRKY EQU   AVTCKRMV                                                 02136000
AVTHK    EQU   IEDQAVTD+648                                             02137000
AVTHI    EQU   IEDQAVTD+644                                             02138000
AVTIOT   EQU   IEDQAVTD+640                                             02139000
AVTNX    EQU   IEDQAVTD+636                                             02140000
AVTTONE  EQU   IEDQAVTD+632                                             02141000
AVTA3TL  EQU   IEDQAVTD+628                                             02142000
AVTDMECB EQU   IEDQAVTD+624                                             02143000
AVTABEND EQU   IEDQAVTD+618                                             02144000
AVTPLCBN EQU   IEDQAVTD+616                                             02145000
@NM00018 EQU   AVTSAVTP+1                                               02146000
@NM00017 EQU   AVTSAVTF                                                 02147000
AVTSNA   EQU   AVTSAVTF                                                 02148000
AVTONSNA EQU   AVTSAVTF                                                 02149000
AVTVTMCP EQU   AVTSAVTF                                                 02150000
@NM00016 EQU   IEDQAVTD+608                                             02151000
AVTCMBSS EQU   IEDQAVTD+604                                             02152000
AVTRCV   EQU   IEDQAVTD+600                                             02153000
AVTSEND  EQU   IEDQAVTD+596                                             02154000
AVTCSCH  EQU   IEDQAVTD+592                                             02155000
AVTQ1    EQU   IEDQAVTD+588                                             02156000
AVTE7    EQU   IEDQAVTD+584                                             02157000
AVTHB    EQU   IEDQAVTD+580                                             02158000
AVTR1    EQU   IEDQAVTD+576                                             02159000
AVTBZ    EQU   IEDQAVTD+572                                             02160000
AVTEZ    EQU   IEDQAVTD+568                                             02161000
AVTEC    EQU   IEDQAVTD+564                                             02162000
AVTEW    EQU   IEDQAVTD+560                                             02163000
AVTNDIAL EQU   AVTSCOPT                                                 02164000
AVTN2741 EQU   AVTSCOPT                                                 02165000
AVTCONCO EQU   AVTSCOPT                                                 02166000
AVTCONC  EQU   AVTSCOPT                                                 02167000
AVTCMBUF EQU   AVTSCOPT                                                 02168000
AVTAPDMP EQU   AVTSCOPT                                                 02169000
@NM00015 EQU   AVTSCOPT                                                 02170000
AVTHA    EQU   AVTDISP                                                  02171000
AVTEA    EQU   IEDQAVTD+548                                             02172000
AVTAX    EQU   IEDQAVTD+544                                             02173000
AVTA3    EQU   IEDQAVTD+540                                             02174000
AVTGD    EQU   IEDQAVTD+536                                             02175000
AVTAL    EQU   IEDQAVTD+532                                             02176000
AVTOLTST EQU   AVTHG02                                                  02177000
AVTE8    EQU   IEDQAVTD+524                                             02178000
AVTUI    EQU   IEDQAVTD+520                                             02179000
AVTCOMPT EQU   IEDQAVTD+516                                             02180000
AVTCRSRF EQU   IEDQAVTD+512                                             02181000
@NM00014 EQU   IEDQAVTD+508                                             02182000
AVTKA02  EQU   IEDQAVTD+504                                             02183000
AVTOPTPT EQU   IEDQAVTD+500                                             02184000
AVTPCBPT EQU   IEDQAVTD+496                                             02185000
@NM00013 EQU   AVTECB1                                                  02186000
AVTCOMP  EQU   AVTECB1                                                  02187000
@NM00012 EQU   AVTECB1                                                  02188000
AVTOPECA EQU   IEDQAVTD+488                                             02189000
AVTOLECA EQU   IEDQAVTD+484                                             02190000
AVTCKECA EQU   IEDQAVTD+480                                             02191000
AVTCWECA EQU   IEDQAVTD+476                                             02192000
AVTCWTCB EQU   IEDQAVTD+472                                             02193000
AVTOLTCB EQU   IEDQAVTD+468                                             02194000
AVTOCTCB EQU   IEDQAVTD+464                                             02195000
AVTCKTCB EQU   IEDQAVTD+460                                             02196000
AVTAS    EQU   IEDQAVTD+456                                             02197000
AVTNOLBF EQU   IEDQAVTD+454                                             02198000
AVTNCKPR EQU   IEDQAVTD+453                                             02199000
AVTCIB   EQU   IEDQAVTD+452                                             02200000
AVTSPLPT EQU   IEDQAVTD+448                                             02201000
AVTMVBFR EQU   IEDQAVTD+444                                             02202000
AVTSBTA  EQU   IEDQAVTD+440                                             02203000
AVTRARTN EQU   IEDQAVTD+436                                             02204000
AVTBSCAN EQU   IEDQAVTD+432                                             02205000
AVTRDYA  EQU   IEDQAVTD+428                                             02206000
AVTDISTR EQU   IEDQAVTD+420                                             02207000
AVTPARM3 EQU   IEDQAVTD+416                                             02208000
@NM00011 EQU   AVTPKF                                                   02209000
@NM00010 EQU   AVTPKF                                                   02210000
@NM00009 EQU   AVTPKF                                                   02211000
AVTFTCHF EQU   AVTPKF                                                   02212000
@NM00008 EQU   AVTPKF                                                   02213000
@NM00007 EQU   AVTPKF                                                   02214000
@NM00006 EQU   AVTPKF                                                   02215000
@NM00005 EQU   AVTPKF                                                   02216000
AVTPARM  EQU   IEDQAVTD+408                                             02217000
AVTEXS2A EQU   IEDQAVTD+402                                             02218000
AVTEXA2S EQU   IEDQAVTD+396                                             02219000
AVTOCGET EQU   IEDQAVTD+392                                             02220000
AVTCKAVT EQU   @NM00003+1                                               02221000
@NM00004 EQU   AVTCKFLG                                                 02222000
AVTCKHLT EQU   AVTCKFLG                                                 02223000
AVTCKREQ EQU   AVTCKFLG                                                 02224000
AVTCKENV EQU   AVTCKFLG                                                 02225000
AVTCKNAC EQU   AVTCKFLG                                                 02226000
AVTCKTAC EQU   AVTCKFLG                                                 02227000
@NM00002 EQU   IEDQAVTD+384                                             02228000
AVTREADD EQU   IEDQAVTD+380                                             02229000
AVTREADY EQU   IEDQAVTD+376                                             02230000
AVTRACE  EQU   IEDQAVTD+372                                             02231000
AVTTCB   EQU   IEDQAVTD+368                                             02232000
AVTPASWD EQU   IEDQAVTD+360                                             02233000
AVTCTLCH EQU   IEDQAVTD+352                                             02234000
AVTDOUBL EQU   IEDQAVTD+344                                             02235000
AVTDOUBX EQU   IEDQAVTD+336                                             02236000
AVTDPARM EQU   IEDQAVTD+332                                             02237000
AVTCSTCS EQU   IEDQAVTD+328                                             02238000
AVTDLQ   EQU   AVTSAVEX+32                                              02239000
@NM00001 EQU   AVTSAVEX                                                 02240000
AVTSAVE4 EQU   IEDQAVTD+216                                             02241000
AVTSAVE3 EQU   IEDQAVTD+144                                             02242000
AVTSAVE2 EQU   IEDQAVTD+72                                              02243000
AVTSAVE1 EQU   IEDQAVTD                                                 02244000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02245000
@RF00620 EQU   @RC00616                                                 02246000
@RC00658 EQU   @RC00657                                                 02247000
@RC00659 EQU   @RC00658                                                 02248000
@RC00660 EQU   @RC00659                                                 02249000
@ENDDATA EQU   *                                                        02250000
         END   IGCA310D,(C'PLS2339',0701,77145)                         02251000
