         TITLE 'IGCAA10D, PROCESS REQUEST DISCONTACT                   *00001000
                        '                                               00002000
IGCAA10D CSECT ,                                                   0001 00003000
@PROLOG  DS    0H                                                  0002 00004000
*                                                                  0459 00005000
         USING  *,RBASE                                                 00006000
         LR     RBASE,RF                 /* SET UP ADDRESSIBILITY    */ 00007000
IGCAA10D IEDHJN START,HJN                                               00008000
*/*                                                                  */ 00009000
*                                                                  0460 00010000
*                                   /* INITIALIZATION                */ 00011000
*   ROPCAVT=RPARM;                  /* OP CONTROL AVT ADDRESS        */ 00012000
         LR    ROPCAVT,RPARM                                       0460 00013000
*   RELEMENT=OPCCOPCE;              /* CURRENT ELEMENT ADDRESS       */ 00014000
         L     RELEMENT,OPCCOPCE(,ROPCAVT)                         0461 00015000
*   RAVT=OPCAVTPT;                  /* TCAM AVT ADDRESS              */ 00016000
         L     RAVT,OPCAVTPT(,ROPCAVT)                             0462 00017000
*   RWORK=OPCWORK;                  /* OP CONTROL WORK AREA          */ 00018000
         L     RWORK,OPCWORK(,ROPCAVT)                             0463 00019000
*   RSAVE=ADDR(OPCSAVE);            /* OP CONTROL SAVE AREA          */ 00020000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                             0464 00021000
*/*                                                                  */ 00022000
*                                                                  0465 00023000
*   IF RELEMENT->PRFPRI=PRISSBUF THEN/* ELEMENT A BUFFER             */ 00024000
         CLI   PRFPRI(RELEMENT),X'E2'                              0465 00025000
         BNE   @RF00465                                            0465 00026000
*     CALL BUFFER;                  /* PROCESS REQUEST DISCONTACT    */ 00027000
         BAL   @14,BUFFER                                          0466 00028000
*/*                                                                  */ 00029000
*                                                                  0467 00030000
*   ELSE                                                           0467 00031000
*     DO;                                                          0467 00032000
         B     @RC00465                                            0467 00033000
@RF00465 DS    0H                                                  0468 00034000
*       WKPUTNT=0;                  /* CLEAR FIELD FOR PU TNT        */ 00035000
         SLR   @09,@09                                             0468 00036000
         STH   @09,WKPUTNT(,RWORK)                                 0468 00037000
*       IF RELEMENT->PRFPRI=PRISSPIU THEN/* ELEMENT A PIU - SESSION     00038000
*                                      ENDED OR BIND FAILED          */ 00039000
         CLI   PRFPRI(RELEMENT),X'E5'                              0469 00040000
         BNE   @RF00469                                            0469 00041000
*         DO;                                                      0470 00042000
*           RPRF=RELEMENT;          /* ADDRESSIBILITY TO BUFFER      */ 00043000
         LR    RPRF,RELEMENT                                       0471 00044000
*           WKPIUPTR=ADDR(PRFPIUO)+PRFPIUO;/* ADDRESSIBILITY TO PIU  */ 00045000
         LA    @09,PRFPIUO(,RPRF)                                  0472 00046000
         SLR   @07,@07                                             0472 00047000
         IC    @07,PRFPIUO(,RPRF)                                  0472 00048000
         ALR   @09,@07                                             0472 00049000
         ST    @09,WKPIUPTR(,RWORK)                                0472 00050000
*           WKOAFTNT=TTHTAG;        /* SAVE SLU'S TNT OFFSET         */ 00051000
         MVC   WKOAFTNT(2,RWORK),TTHTAG(@09)                       0473 00052000
*           CALL NRMLPROC;          /* PROCESS NORMAL REQUEST      0474 00053000
*                                      DISCONTACT                    */ 00054000
         BAL   @14,NRMLPROC                                        0474 00055000
*         END;                                                     0475 00056000
*                                                                  0475 00057000
*/*                                                                  */ 00058000
*                                                                  0476 00059000
*       ELSE                                                       0476 00060000
*         IF RELEMENT->PRFTI0>3&    /* OPCE WITH ATTACHED            */ 00061000
*             PRUDATA(1:3)=CD1XNSP THEN/* N. S. PROC RESPONSE        */ 00062000
         B     @RC00469                                            0476 00063000
@RF00469 CLC   PRFTI0(3,RELEMENT),@CF00066+1                       0476 00064000
         BNH   @RF00476                                            0476 00065000
         L     @09,OCUNIT(,ROPCE)                                  0476 00066000
         CLC   PRUDATA(3,@09),@CB00744                             0476 00067000
         BNE   @RF00476                                            0476 00068000
*           DO;                                                    0477 00069000
*             WKOAFTNT=OCTRMTBL;    /* SAVE ORIGIN'S TNT OFFSET      */ 00070000
         LH    @09,OCTRMTBL(,ROPCE)                                0478 00071000
         N     @09,@CF01800                                        0478 00072000
         STH   @09,WKOAFTNT(,RWORK)                                0478 00073000
*             CALL NRMLPROC;        /* PROCESS FOR NORMAL REQUEST  0479 00074000
*                                      DISCONTACT                    */ 00075000
         BAL   @14,NRMLPROC                                        0479 00076000
*           END;                                                   0480 00077000
*         ELSE                      /* THIS IS AN OPCE FROM OPERATOR    00078000
*                                      SERVICES OR CHKPT             */ 00079000
*           IF OCPARM>0&            /* THIS HAS'NT BEEN CHKPTED AND  */ 00080000
*               OCPARM^=MSG539 THEN /* GOOD RESP TO DEACTIVATE       */ 00081000
         B     @RC00476                                            0481 00082000
@RF00476 SLR   @09,@09                                             0481 00083000
         LH    @07,OCPARM(,ROPCE)                                  0481 00084000
         CR    @07,@09                                             0481 00085000
         BNH   @RF00481                                            0481 00086000
         C     @07,@CF01753                                        0481 00087000
         BE    @RF00481                                            0481 00088000
*             DO;                   /* CHECKPOINT THE GOOD RSP       */ 00089000
*               OCPARM=0;           /* CLEAR OCPARM                  */ 00090000
         STH   @09,OCPARM(,ROPCE)                                  0483 00091000
*               OCWTG=THISMOD;      /* RETURN TO THIS MODULE         */ 00092000
         MVC   OCWTG(2,ROPCE),@CC01762                             0484 00093000
*               OPCMODID=CHKPTMOD;  /* PASS TO IGC0610D              */ 00094000
         MVC   OPCMODID(2,ROPCAVT),@CC01764                        0485 00095000
*             END;                                                 0486 00096000
*                                                                  0486 00097000
*/*                                                                  */ 00098000
*                                                                  0487 00099000
*           ELSE                    /* BAD RESP OR OPCE RETURNING  0487 00100000
*                                      FROM CHECKPOINT               */ 00101000
*             DO;                                                  0487 00102000
         B     @RC00481                                            0487 00103000
@RF00481 DS    0H                                                  0488 00104000
*               RPARM=OPCCOPCE;     /* SET UP TO FREE THE BUFFER     */ 00105000
         L     RPARM,OPCCOPCE(,ROPCAVT)                            0488 00106000
*               CALL FREEBUF;       /* FREE THE BUFFER               */ 00107000
         L     @15,OPCFREBF(,ROPCAVT)                              0489 00108000
         BALR  @14,@15                                             0489 00109000
*               RZERO=0;            /* CLEAR REG 0                   */ 00110000
         SLR   RZERO,RZERO                                         0490 00111000
*               OPCMODID=DSPOPCTL;  /* PASS TO IGC0010D              */ 00112000
         MVC   OPCMODID(2,ROPCAVT),@CC01768                        0491 00113000
*             END;                                                 0492 00114000
*     END;                                                         0493 00115000
*                                                                  0493 00116000
@RC00481 DS    0H                                                  0493 00117000
@RC00476 DS    0H                                                  0493 00118000
@RC00469 DS    0H                                                  0494 00119000
*/*                                                                  */ 00120000
*                                                                  0494 00121000
*   RPARM=ROPCAVT;                  /* OP CONTROL AVT ADDRESS        */ 00122000
@RC00465 LR    RPARM,ROPCAVT                                       0494 00123000
*   GEN REFS(ROPCAVT,OPCXCTL) EXIT;                                0495 00124000
         XCTL  SF=(E,OPCXCTL(ROPCAVT))                                  00125000
*BLDDEACT:                                                         0496 00126000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0496 00127000
*                                                                  0496 00128000
@EL00001 DS    0H                                                  0496 00129000
@EF00001 DS    0H                                                  0496 00130000
@ER00001 BR    @14                                                 0496 00131000
BLDDEACT DS    0H                                                  0497 00132000
*   /*****************************************************************/ 00133000
*   /*                                                               */ 00134000
*   /* THIS ROUTINE BUILDS A DEACTIVATE OPCE AND SEND IT TO OPERATOR */ 00135000
*   /* SERVICES. IF THE ORIGINAL BUFFER CONTAINS MORE THAN ONE UNIT  */ 00136000
*   /* THE EXCESS UNITS ARE FREED.                                   */ 00137000
*   /*                                                               */ 00138000
*   /*****************************************************************/ 00139000
*                                                                  0497 00140000
*   WKSAVE1=RE;                     /* SAVE REG 14                   */ 00141000
         ST    RE,WKSAVE1(,RWORK)                                  0497 00142000
*/*                                                                  */ 00143000
*                                                                  0498 00144000
*   IF RELEMENT->PRFTI0>3 THEN      /* EXCESS UNITS                  */ 00145000
         L     @09,PRFTI0-1(,RELEMENT)                             0498 00146000
         LA    @09,0(,@09)                                         0498 00147000
         C     @09,@CF00066                                        0498 00148000
         BNH   @RF00498                                            0498 00149000
*     DO;                                                          0499 00150000
*       RPARM=RELEMENT->PRFTI0;     /* ADDRESS OF UNITS TO FREE      */ 00151000
         LR    RPARM,@09                                           0500 00152000
*       CALL FREEBUF;               /* FREE THE BUFFER               */ 00153000
         L     @15,OPCFREBF(,ROPCAVT)                              0501 00154000
         BALR  @14,@15                                             0501 00155000
*     END;                                                         0502 00156000
*                                                                  0502 00157000
*/*                                                                  */ 00158000
*                                                                  0503 00159000
*   IEDQOPCE=''B;                   /* CLEAR OPCE                    */ 00160000
@RF00498 XC    IEDQOPCE(56,ROPCE),IEDQOPCE(ROPCE)                  0503 00161000
*   IEDQOPCN=''B;                   /* CLEAR NEGATIVE PREFIX         */ 00162000
         LR    @09,ROPCE                                           0504 00163000
         AL    @09,@CF01801                                        0504 00164000
         XC    IEDQOPCN(8,@09),IEDQOPCN(@09)                       0504 00165000
*   OCUNIT=PRFINTIC;                /* SET INVALID TIC       @YM07992*/ 00166000
         MVC   OCUNIT(4,ROPCE),@CF01225                            0505 00167000
*   OCTRMTBL=WKPUTNT;               /* PU'S TNT OFFSET               */ 00168000
         LH    @09,WKPUTNT(,RWORK)                                 0506 00169000
         N     @09,@CF01800                                        0506 00170000
         STH   @09,OCTRMTBL(,ROPCE)                                0506 00171000
*   OCSWITCH=OCDEACTE;              /* DEACTIVATE REQUEST            */ 00172000
         MVI   OCSWITCH(ROPCE),X'23'                               0507 00173000
*   OCOPTCDE=OCMODIFY;              /* MODIFY REQUEST                */ 00174000
         MVI   OCOPTCDE(ROPCE),X'44'                               0508 00175000
*   OCWTG=THISMOD;                  /* RETURN TO THIS MODULE         */ 00176000
         MVC   OCWTG(2,ROPCE),@CC01762                             0509 00177000
*   OPCMODID=OPSERV;                /* PASS TO OP SERVICES           */ 00178000
         MVC   OPCMODID(2,ROPCAVT),@CC01766                        0510 00179000
*/*                                                                  */ 00180000
*                                                                  0511 00181000
*   RE=WKSAVE1;                     /* RESTORE REG 14                */ 00182000
         L     RE,WKSAVE1(,RWORK)                                  0511 00183000
*   END BLDDEACT;                   /* RETURN TO CALLER              */ 00184000
@EL00002 DS    0H                                                  0512 00185000
@EF00002 DS    0H                                                  0512 00186000
@ER00002 BR    @14                                                 0512 00187000
*BLDRESP:                                                          0513 00188000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0513 00189000
*                                                                  0513 00190000
BLDRESP  DS    0H                                                  0514 00191000
*   /*****************************************************************/ 00192000
*   /*                                                               */ 00193000
*   /* THIS ROUTINE BUILDS A POSITIVE TO REQUEST DISCONTACT AND SENDS*/ 00194000
*   /* IT VIA SVC 102                                                */ 00195000
*   /*                                                               */ 00196000
*   /*****************************************************************/ 00197000
*                                                                  0514 00198000
*   WKSAVE2=RE;                     /* SAVE REG 14                   */ 00199000
         ST    RE,WKSAVE2(,RWORK)                                  0514 00200000
*   RPARM=1;                        /* SET UP TO GET A BUFFER        */ 00201000
         LA    RPARM,1                                             0515 00202000
*   CALL ALLOCBUF;                  /* GET A BUFFER                  */ 00203000
         L     @15,OPCGETBF(,ROPCAVT)                              0516 00204000
         BALR  @14,@15                                             0516 00205000
*   WKBUFPTR=RPARM;                 /* SAVE BUFFER ADDRESS           */ 00206000
         ST    RPARM,WKBUFPTR(,RWORK)                              0517 00207000
*   WKNEGPTR=WKBUFPTR-LENGTH(IEDPF2);/* NEG PREFIX ADDRESS           */ 00208000
         LA    @09,8                                               0518 00209000
         L     @07,WKBUFPTR(,RWORK)                                0518 00210000
         LR    @11,@07                                             0518 00211000
         SLR   @11,@09                                             0518 00212000
         ST    @11,WKNEGPTR(,RWORK)                                0518 00213000
*   WKBUFPTR->PRFPIUO=1;            /* OFFSET TO PIU                 */ 00214000
         LA    @10,1                                               0519 00215000
         STC   @10,PRFPIUO(,@07)                                   0519 00216000
*   WKPIUPTR=ADDR(WKBUFPTR->PRFPIUO)+WKBUFPTR->PRFPIUO;/* PIU ADDR   */ 00217000
         LA    @09,PRFPIUO(,@07)                                   0520 00218000
         ALR   @09,@10                                             0520 00219000
         ST    @09,WKPIUPTR(,RWORK)                                0520 00220000
*   WKPIURH=ADDR(PIURH);            /* ADDRESS OF RH                 */ 00221000
         LA    @10,PIURH(,@09)                                     0521 00222000
         ST    @10,WKPIURH(,RWORK)                                 0521 00223000
*/*                                                                  */ 00224000
*                                                                  0522 00225000
*                                   /* SET UP TH AND RH              */ 00226000
*   TTHBYTE0=THCON;                 /* SET UP FIRST BYTE             */ 00227000
         MVI   TTHBYTE0(@09),X'1C'                                 0522 00228000
*   TTHBYTE1=0;                     /* SET UP SECOND BYTE            */ 00229000
         MVI   TTHBYTE1(@09),X'00'                                 0523 00230000
*   TTHDAF=WKOAFTNT;                /* SET UP DESTINATION            */ 00231000
         MVC   TTHDAF(2,@09),WKOAFTNT(RWORK)                       0524 00232000
*   TTHOAF=SAVTSCPT;                /* SET UP ORIGIN                 */ 00233000
         L     @07,AVTSAVTP(,RAVT)                                 0525 00234000
         MVC   TTHOAF(2,@09),SAVTSCPT(@07)                         0525 00235000
*   TTHDCF=LENGTH(IEDRH)+LENGTH(XRDCCODE);/* SET UP DATA COUNT       */ 00236000
         MVC   TTHDCF(2,@09),@CH00071                              0526 00237000
*   TTHSNF=PRF1SQID;                /* SET UP SEQUENCE NO            */ 00238000
         LA    @07,8                                               0527 00239000
         LCR   @07,@07                                             0527 00240000
         ALR   @07,RPRF                                            0527 00241000
         MVC   TTHSNF(2,@09),PRF1SQID(@07)                         0527 00242000
*   PIURH=PRF1RH;                   /* SET UP RH                     */ 00243000
         MVC   PIURH(3,@09),PRF1RH(@07)                            0528 00244000
*   WKPIURH->TRHTYPE=ON;            /* SET RESPONSE BIT ON           */ 00245000
         OI    TRHTYPE(@10),B'10000000'                            0529 00246000
*/*                                                                  */ 00247000
*                                                                  0530 00248000
*   PIURU(1:3)=CD1XRDC;             /* SET UP COMMAND CODE           */ 00249000
         MVC   PIURU(3,@09),@CB00732                               0530 00250000
*   WKNEGPTR->PRF2TNTI=ON;          /* INDICATE PIU CONTAINS TNT   0531 00251000
*                                      OFFSETS                       */ 00252000
         OI    PRF2TNTI(@11),B'10000000'                           0531 00253000
*   WKBUFPTR->PRFPRI=PRIOUTBD;      /* SET PRIORITY                  */ 00254000
         L     @09,WKBUFPTR(,RWORK)                                0532 00255000
         MVI   PRFPRI(@09),X'E4'                                   0532 00256000
*   WKBUFPTR->PRFQCBA=SAVTDFCO;     /* SET QCB ADDRESS               */ 00257000
         L     @07,AVTSAVTP(,RAVT)                                 0533 00258000
         MVC   PRFQCBA(3,@09),SAVTDFCO+1(@07)                      0533 00259000
*   OPCAQREQ=TPOST;                 /* TPOST ERROR RESPONSE          */ 00260000
         MVI   OPCAQREQ(ROPCAVT),X'0C'                             0534 00261000
*   OPCAQFST=WKBUFPTR;              /* ERROR RESPONSE BUFFER         */ 00262000
         STCM  @09,7,OPCAQFST(ROPCAVT)                             0535 00263000
*   OPCAQRQ2=ENDLIST;               /* END OF LIST CONSTANT          */ 00264000
         MVI   OPCAQRQ2(ROPCAVT),X'80'                             0536 00265000
*   OPCAQSEC=WKBUFPTR;              /* ERROR RESPONSE BUFFER         */ 00266000
         STCM  @09,7,OPCAQSEC(ROPCAVT)                             0537 00267000
*   RPARM=ADDR(OPCAQCTL);           /* SET UP PARM LIST              */ 00268000
         LA    RPARM,OPCAQCTL(,ROPCAVT)                            0538 00269000
*   SVC(102);                       /* TPOST RESPONSE                */ 00270000
         SVC   102                                                 0539 00271000
*/*                                                                  */ 00272000
*                                                                  0540 00273000
*   RE=WKSAVE2;                     /* RESTORE REG 14                */ 00274000
         L     RE,WKSAVE2(,RWORK)                                  0540 00275000
*   END BLDRESP;                    /* RETURN TO CALLER              */ 00276000
@EL00003 DS    0H                                                  0541 00277000
@EF00003 DS    0H                                                  0541 00278000
@ER00003 BR    @14                                                 0541 00279000
*BUFFER:                                                           0542 00280000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0542 00281000
*                                                                  0542 00282000
BUFFER   DS    0H                                                  0543 00283000
*   /*****************************************************************/ 00284000
*   /*                                                               */ 00285000
*   /* THIS ROUTINE CONTAINS ALL THE PROCESSING NECESSARY WHEN A     */ 00286000
*   /* REQUEST DISCONTACT BUFFER ARRIVES.                            */ 00287000
*   /*                                                               */ 00288000
*   /*****************************************************************/ 00289000
*                                                                  0543 00290000
*   WKSAVE3=RE;                     /* SAVE REG 14                   */ 00291000
         ST    RE,WKSAVE3(,RWORK)                                  0543 00292000
*/*                                                                  */ 00293000
*                                                                  0544 00294000
*   RPRF=RELEMENT;                  /* BUFFER ADDRESS                */ 00295000
         LR    RPRF,RELEMENT                                       0544 00296000
*   RPARM=PRFSRCE;                  /* RESOURCE TNT OFFSET           */ 00297000
         LH    @09,PRFSRCE(,RPRF)                                  0545 00298000
         LR    RPARM,@09                                           0545 00299000
*   WKPUTNT=PRFSRCE;                /* SAVE TNT OFFSET               */ 00300000
         STH   @09,WKPUTNT(,RWORK)                                 0546 00301000
*   WKOAFTNT=PRFSRCE;               /* SAVE TNT OFFSET               */ 00302000
         STH   @09,WKOAFTNT(,RWORK)                                0547 00303000
*   CALL IEDQTNT;                   /* GET TTE ADDRESS               */ 00304000
         L     @15,AVTRNMPT(,RAVT)                                 0548 00305000
         BALR  @14,@15                                             0548 00306000
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* TERM ENTRY ADDRESSIBILITY     */ 00307000
         LR    RTRM,RPARM                                          0549 00308000
         SL    RTRM,@CF01548                                       0549 00309000
*/*                                                                  */ 00310000
*                                                                  0550 00311000
*   IF TRMSIBPT>0&                  /* SIB EXIST ?                   */ 00312000
*       TRMSIBPT->SIBSSTAT=SIBSACTV THEN/* AND IN ACTIVE STATE       */ 00313000
         SLR   @09,@09                                             0550 00314000
         ICM   @09,7,TRMSIBPT(RTRM)                                0550 00315000
         LTR   @09,@09                                             0550 00316000
         BNP   @RF00550                                            0550 00317000
         TM    SIBSSTAT(@09),B'00011100'                           0550 00318000
         BNO   @RF00550                                            0550 00319000
*     DO;                           /* YES                           */ 00320000
*       IF(TRHDR1=ON|TRHDR2=ON)&    /* RESPONSE REQUIRED FOR ...     */ 00321000
*           TRHER=OFF THEN          /* FOR THIS REQUEST              */ 00322000
         LR    @09,RPRF                                            0552 00323000
         SL    @09,@CF00045                                        0552 00324000
         TM    TRHDR1(@09),B'10100000'                             0552 00325000
         BZ    @RF00552                                            0552 00326000
         TM    TRHER(@09),B'00010000'                              0552 00327000
         BNZ   @RF00552                                            0552 00328000
*         CALL BLDRESP;             /* SEND POSITIVE RESPONSE        */ 00329000
         BAL   @14,BLDRESP                                         0553 00330000
*       CALL RQDISCON;              /* CONTINUE PROCESSING           */ 00331000
@RF00552 BAL   @14,RQDISCON                                        0554 00332000
*     END;                                                         0555 00333000
*                                                                  0555 00334000
*/*                                                                  */ 00335000
*                                                                  0556 00336000
*   ELSE                            /* NO SIB EXISTS                 */ 00337000
*     DO;                                                          0556 00338000
         B     @RC00550                                            0556 00339000
@RF00550 DS    0H                                                  0557 00340000
*       RPARM=OPCCOPCE;             /* SET UP TO FREE BUFFER         */ 00341000
         L     RPARM,OPCCOPCE(,ROPCAVT)                            0557 00342000
*       CALL FREEBUF;               /* FREE THE BUFFER               */ 00343000
         L     @15,OPCFREBF(,ROPCAVT)                              0558 00344000
         BALR  @14,@15                                             0558 00345000
*       RZERO=0;                    /* CLEAR REG 0                   */ 00346000
         SLR   RZERO,RZERO                                         0559 00347000
*       OPCMODID=DSPOPCTL;          /* PASS CONTROL TO '00'          */ 00348000
         MVC   OPCMODID(2,ROPCAVT),@CC01768                        0560 00349000
*     END;                                                         0561 00350000
*                                                                  0561 00351000
*/*                                                                  */ 00352000
*                                                                  0562 00353000
*   RE=WKSAVE3;                     /* RESTORE REG 14                */ 00354000
@RC00550 L     RE,WKSAVE3(,RWORK)                                  0562 00355000
*   END BUFFER;                                                    0563 00356000
@EL00004 DS    0H                                                  0563 00357000
@EF00004 DS    0H                                                  0563 00358000
@ER00004 BR    @14                                                 0563 00359000
*CASCADE:                                                          0564 00360000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0564 00361000
*                                                                  0564 00362000
CASCADE  DS    0H                                                  0565 00363000
*   /*****************************************************************/ 00364000
*   /*                                                               */ 00365000
*   /* THIS ROUTINE SEARCHES THE HIERARCHY. IT COUNTS ALL LU-LU SIBS */ 00366000
*   /* FOUND, SETS SIBTERM IN SSCP SIBS AND SET SIBRDSCN IN LU-LU    */ 00367000
*   /* SIBS.                                                         */ 00368000
*   /*                                                               */ 00369000
*   /*****************************************************************/ 00370000
*                                                                  0565 00371000
*   WKSAVE4=RE;                     /* SAVE REG 14                   */ 00372000
         ST    RE,WKSAVE4(,RWORK)                                  0565 00373000
*   WKLUCNT=0;                      /* INITIALIZE LU COUNT           */ 00374000
         SLR   @09,@09                                             0566 00375000
         ST    @09,WKLUCNT(,RWORK)                                 0566 00376000
*   WKCURRNT=RTRM;                  /* SET UP CURRENT TTE            */ 00377000
         ST    RTRM,WKCURRNT(,RWORK)                               0567 00378000
*   WKORIGNL=RTRM;                  /* SAVE ORIGINAL TTE             */ 00379000
         ST    RTRM,WKORIGNL(,RWORK)                               0568 00380000
*/*                                                                  */ 00381000
*                                                                  0569 00382000
*   DO UNTIL WKCURRNT=WKORIGNL;     /* HIERARCHY SEARCH ENDED NO - 0569 00383000
*                                      CONTINUE                      */ 00384000
@DL00569 DS    0H                                                  0570 00385000
*     IF TRMSUBST>0 THEN            /* THIS IS A PU THAT HAS         */ 00386000
         CLC   TRMSUBST(2,RTRM),@CH00882                           0570 00387000
         BNH   @RF00570                                            0570 00388000
*       DO;                         /* "ATTACHED" LU'S               */ 00389000
*         IF WKPUTNT=0 THEN         /* NEED TO SAVE PU'S TNT         */ 00390000
         LH    @09,WKPUTNT(,RWORK)                                 0572 00391000
         N     @09,@CF01800                                        0572 00392000
         LTR   @09,@09                                             0572 00393000
         BNZ   @RF00572                                            0572 00394000
*           WKPUTNT=WKSAVTNT;       /* YES SAVE PU TNT OFFSET        */ 00395000
         LH    @09,WKSAVTNT(,RWORK)                                0573 00396000
         N     @09,@CF01800                                        0573 00397000
         STH   @09,WKPUTNT(,RWORK)                                 0573 00398000
*         RPARM=TRMSUBST;           /* GET TTE FOR SUBSTRUCT         */ 00399000
@RF00572 LH    RPARM,TRMSUBST(,RTRM)                               0574 00400000
         N     RPARM,@CF01800                                      0574 00401000
*       END;                                                       0575 00402000
*                                                                  0575 00403000
*/*                                                                  */ 00404000
*                                                                  0576 00405000
*     ELSE                                                         0576 00406000
*       IF TRMTYPE=TRMPUNT THEN     /* IS THIS A PU                  */ 00407000
         B     @RC00570                                            0576 00408000
@RF00570 CLI   TRMTYPE(RTRM),X'18'                                 0576 00409000
         BNE   @RF00576                                            0576 00410000
*         RPARM=WKPUTNT;            /* SAVE THE TNT                  */ 00411000
         LH    RPARM,WKPUTNT(,RWORK)                               0577 00412000
         N     RPARM,@CF01800                                      0577 00413000
*       ELSE                                                       0578 00414000
*         DO;                                                      0578 00415000
         B     @RC00576                                            0578 00416000
@RF00576 DS    0H                                                  0579 00417000
*           WKSAVTNT=TRMCOHRT;      /* SAVE THE TNT                  */ 00418000
         LH    @09,TRMCOHRT(,RTRM)                                 0579 00419000
         N     @09,@CF01800                                        0579 00420000
         STH   @09,WKSAVTNT(,RWORK)                                0579 00421000
*           RPARM=TRMCOHRT;         /* GET TTE FOR COHORT            */ 00422000
         LR    RPARM,@09                                           0580 00423000
*         END;                                                     0581 00424000
*                                                                  0581 00425000
*/*                                                                  */ 00426000
*                                                                  0582 00427000
*     CALL IEDQTNT;                 /* GET THE TTE ADDRESS           */ 00428000
@RC00576 DS    0H                                                  0582 00429000
@RC00570 L     @15,AVTRNMPT(,RAVT)                                 0582 00430000
         BALR  @14,@15                                             0582 00431000
*     RTRM=RPARM-LENGTH(IEDNTRM);   /* BACK UP TO PREFIX             */ 00432000
         LR    RTRM,RPARM                                          0583 00433000
         SL    RTRM,@CF01548                                       0583 00434000
*     WKCURRNT=RTRM;                /* SAVE CURRENT TTE      @YM07992*/ 00435000
         ST    RTRM,WKCURRNT(,RWORK)                               0584 00436000
*     WKSIBPTR=TRMSIBPT;            /* SET UP SIB POINTER            */ 00437000
         SLR   @09,@09                                             0585 00438000
         ICM   @09,7,TRMSIBPT(RTRM)                                0585 00439000
         ST    @09,WKSIBPTR(,RWORK)                                0585 00440000
*/*                                                                  */ 00441000
*                                                                  0586 00442000
*     IF WKSIBPTR>0 THEN            /* ANY SIBS EXIST                */ 00443000
         LTR   @09,@09                                             0586 00444000
         BNP   @RF00586                                            0586 00445000
*       DO;                                                        0587 00446000
*         IF SIBINDEX^=SAVTSCPT THEN/* THIS IS LU-LU SIB             */ 00447000
         L     @07,AVTSAVTP(,RAVT)                                 0588 00448000
         CLC   SIBINDEX(2,@09),SAVTSCPT(@07)                       0588 00449000
         BE    @RF00588                                            0588 00450000
*           DO;                                                    0589 00451000
*             WKLUCNT=WKLUCNT+1;    /* ADD 1 TO LU COUNT             */ 00452000
         LA    @07,1                                               0590 00453000
         AL    @07,WKLUCNT(,RWORK)                                 0590 00454000
         ST    @07,WKLUCNT(,RWORK)                                 0590 00455000
*             SIBRDSCN=ON;          /* SET REQ DISCONTACT ON         */ 00456000
         OI    SIBRDSCN(@09),B'00100000'                           0591 00457000
*             WKSIBPTR=SIBCHAIN;    /* GET NEXT SIB                  */ 00458000
         L     @09,SIBCHAIN(,@09)                                  0592 00459000
         ST    @09,WKSIBPTR(,RWORK)                                0592 00460000
*           END;                                                   0593 00461000
*         SIBTERM=ON;               /* SET TERM IN PROGRESS          */ 00462000
@RF00588 L     @09,WKSIBPTR(,RWORK)                                0594 00463000
         OI    SIBTERM(@09),B'01000000'                            0594 00464000
*       END;                                                       0595 00465000
*   END;                                                           0596 00466000
*                                                                  0596 00467000
@RF00586 DS    0H                                                  0596 00468000
@DE00569 CLC   WKCURRNT(4,RWORK),WKORIGNL(RWORK)                   0596 00469000
         BNE   @DL00569                                            0596 00470000
*/*                                                                  */ 00471000
*                                                                  0597 00472000
*   RE=WKSAVE4;                     /* RESTORE REG 14                */ 00473000
         L     RE,WKSAVE4(,RWORK)                                  0597 00474000
*   END CASCADE;                    /* RETURN TO CALLER              */ 00475000
@EL00005 DS    0H                                                  0598 00476000
@EF00005 DS    0H                                                  0598 00477000
@ER00005 BR    @14                                                 0598 00478000
*NRMLPROC:                                                         0599 00479000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0599 00480000
*                                                                  0599 00481000
NRMLPROC DS    0H                                                  0600 00482000
*   /*****************************************************************/ 00483000
*   /*                                                               */ 00484000
*   /* THIS ROUTINE PROCESSES REQUEST DISCONTACTS THAT ARE OF THE    */ 00485000
*   /* NORMAL TYPE. IF THERE ARE NO LU-LU SIBS IN THE HIERARCHY A    */ 00486000
*   /* DEACTIVATE REQUEST IS SENT TO OPERATOR SERVICES. IF THERE ARE */ 00487000
*   /* LU-LU SIBS THE INPUT ELEMENT IS FREED AND CONTROL PASSED TO   */ 00488000
*   /* IGC0010D.                                                     */ 00489000
*   /*                                                               */ 00490000
*   /*****************************************************************/ 00491000
*                                                                  0600 00492000
*   WKSAVE5=RE;                     /* SAVE REG 14                   */ 00493000
         ST    RE,WKSAVE5(,RWORK)                                  0600 00494000
*/*                                                                  */ 00495000
*                                                                  0601 00496000
*   RPARM=WKOAFTNT;                 /* SET UP TO GET TTE ADDR        */ 00497000
         LH    RPARM,WKOAFTNT(,RWORK)                              0601 00498000
         N     RPARM,@CF01800                                      0601 00499000
*   CALL IEDQTNT;                   /* GET TTE ADDRESS               */ 00500000
         L     @15,AVTRNMPT(,RAVT)                                 0602 00501000
         BALR  @14,@15                                             0602 00502000
*   RPARM=RPARM-LENGTH(IEDNTRM);    /* BACK UP TO PREFIX             */ 00503000
         SL    RPARM,@CF01548                                      0603 00504000
*   RTRM=RPARM;                     /* SAVE TTE ADDRESS              */ 00505000
         LR    RTRM,RPARM                                          0604 00506000
*   CALL CASCADE;                   /* SEARCH THE HIERARCHY          */ 00507000
         BAL   @14,CASCADE                                         0605 00508000
*/*                                                                  */ 00509000
*                                                                  0606 00510000
*   IF WKLUCNT>0 THEN               /* ANY LU-LU SIBS...YES          */ 00511000
         L     @09,WKLUCNT(,RWORK)                                 0606 00512000
         LTR   @09,@09                                             0606 00513000
         BNP   @RF00606                                            0606 00514000
*     DO;                                                          0607 00515000
*       RPARM=OPCCOPCE;             /* SET UP TO FREE BUFFER         */ 00516000
         L     RPARM,OPCCOPCE(,ROPCAVT)                            0608 00517000
*       CALL FREEBUF;               /* FREE THE BUFFER               */ 00518000
         L     @15,OPCFREBF(,ROPCAVT)                              0609 00519000
         BALR  @14,@15                                             0609 00520000
*       RZERO=0;                    /* CLEAR REG 0                   */ 00521000
         SLR   RZERO,RZERO                                         0610 00522000
*       OPCMODID=DSPOPCTL;          /* PASS CONTROL TO '00'          */ 00523000
         MVC   OPCMODID(2,ROPCAVT),@CC01768                        0611 00524000
*     END;                                                         0612 00525000
*   ELSE                                                           0613 00526000
*     CALL BLDDEACT;                /* BUILD DEACTIVATE REQUEST      */ 00527000
         B     @RC00606                                            0613 00528000
@RF00606 BAL   @14,BLDDEACT                                        0613 00529000
*/*                                                                  */ 00530000
*                                                                  0614 00531000
*   RE=WKSAVE5;                     /* RESTORE REG 14                */ 00532000
@RC00606 L     RE,WKSAVE5(,RWORK)                                  0614 00533000
*/*                                                                  */ 00534000
*                                                                  0615 00535000
*   END NRMLPROC;                   /* RETURN TO CALLER              */ 00536000
@EL00006 DS    0H                                                  0615 00537000
@EF00006 DS    0H                                                  0615 00538000
@ER00006 BR    @14                                                 0615 00539000
*RQDISCON:                                                         0616 00540000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0616 00541000
*                                                                  0616 00542000
RQDISCON DS    0H                                                  0617 00543000
*   /*****************************************************************/ 00544000
*   /*                                                               */ 00545000
*   /* THIS ROUTINE PROCESSES THE REQUEST DISCONTACT BUFFER. THE     */ 00546000
*   /* APPROPRIATE SUBROUTINE IS CALLED FOR THE NORMAL AND IMMEDIATE */ 00547000
*   /* TYPES OF REQUEST DISCONTACT.                                  */ 00548000
*   /*                                                               */ 00549000
*   /*****************************************************************/ 00550000
*                                                                  0617 00551000
*   WKSAVE6=RE;                     /* SAVE REG 14                   */ 00552000
         ST    RE,WKSAVE6(,RWORK)                                  0617 00553000
*/*                                                                  */ 00554000
*                                                                  0618 00555000
*   WKRUPTR=ADDR(PRFSUNIT)+PRFISIZE+AVTHDRSZ;/* RU POINTER           */ 00556000
         LA    @09,PRFSUNIT(,RPRF)                                 0618 00557000
         SLR   @07,@07                                             0618 00558000
         IC    @07,PRFISIZE(,RPRF)                                 0618 00559000
         ALR   @09,@07                                             0618 00560000
         AL    @09,@CF00439                                        0618 00561000
         ST    @09,WKRUPTR(,RWORK)                                 0618 00562000
*   IF XRDCTYPE=TYPIMMDE THEN       /* IMMEDIATE TYPE                */ 00563000
         CLI   XRDCTYPE(@09),X'80'                                 0619 00564000
         BNE   @RF00619                                            0619 00565000
*     CALL BLDDEACT;                /* BUILD DEACTIVATE              */ 00566000
         BAL   @14,BLDDEACT                                        0620 00567000
*   ELSE                                                           0621 00568000
*     CALL NRMLPROC;                /* PROCESS NORMAL TYPE           */ 00569000
         B     @RC00619                                            0621 00570000
@RF00619 BAL   @14,NRMLPROC                                        0621 00571000
*/*                                                                  */ 00572000
*                                                                  0622 00573000
*   RE=WKSAVE6;                     /* RESTORE REG 14                */ 00574000
@RC00619 L     RE,WKSAVE6(,RWORK)                                  0622 00575000
*   END RQDISCON;                   /* RETURN TO CALLER              */ 00576000
@EL00007 DS    0H                                                  0623 00577000
@EF00007 DS    0H                                                  0623 00578000
@ER00007 BR    @14                                                 0623 00579000
*   END IGCAA10D                                                   0624 00580000
*                                                                  0624 00581000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00582000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00583000
*/*%INCLUDE SYSLIB  (TCD1D   )                                       */ 00584000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 00585000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 00586000
*/*%INCLUDE SYSLIB  (TPIUD   )                                       */ 00587000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 00588000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 00589000
*/*%INCLUDE SYSLIB  (TPRUD   )                                       */ 00590000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 00591000
*/*%INCLUDE SYSLIB  (TSIBD   )                                       */ 00592000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 00593000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00594000
*                                                                  0624 00595000
*       ;                                                          0624 00596000
@DATA    DS    0H                                                       00597000
@CH00882 DC    H'0'                                                     00598000
@CH00071 DC    H'6'                                                     00599000
         DS    0F                                                       00600000
         DS    0F                                                       00601000
@CF00066 DC    F'3'                                                     00602000
@CF00045 DC    F'8'                                                     00603000
@CF01548 DC    F'14'                                                    00604000
@CF01753 DC    F'539'                                                   00605000
@CF01801 DC    F'-8'                                                    00606000
@CF01225 DC    XL4'08000002'                                            00607000
@CF01800 DC    XL4'0000FFFF'                                            00608000
@CF00439 DC    XL4'1E'                                                  00609000
         DS    0D                                                       00610000
@CC01762 DC    C'AA'                                                    00611000
@CC01764 DC    C'06'                                                    00612000
@CC01766 DC    C'FC'                                                    00613000
@CC01768 DC    C'00'                                                    00614000
@CB00732 DC    X'01021B'                                                00615000
@CB00744 DC    X'010604'                                                00616000
PATCH    DC    100X'00'                                                 00617000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00618000
@01      EQU   01                                                       00619000
@02      EQU   02                                                       00620000
@03      EQU   03                                                       00621000
@04      EQU   04                                                       00622000
@05      EQU   05                                                       00623000
@06      EQU   06                                                       00624000
@07      EQU   07                                                       00625000
@08      EQU   08                                                       00626000
@09      EQU   09                                                       00627000
@10      EQU   10                                                       00628000
@11      EQU   11                                                       00629000
@12      EQU   12                                                       00630000
@13      EQU   13                                                       00631000
@14      EQU   14                                                       00632000
@15      EQU   15                                                       00633000
IEDQAPTR EQU   @04                                                      00634000
ROPCAVT  EQU   @02                                                      00635000
ROPCE    EQU   @03                                                      00636000
RTRM     EQU   @08                                                      00637000
RAVT     EQU   @04                                                      00638000
RPRF     EQU   @06                                                      00639000
RZERO    EQU   @00                                                      00640000
RPARM    EQU   @01                                                      00641000
RELEMENT EQU   @03                                                      00642000
RWORK    EQU   @05                                                      00643000
RBASE    EQU   @12                                                      00644000
RSAVE    EQU   @13                                                      00645000
RE       EQU   @14                                                      00646000
RF       EQU   @15                                                      00647000
IEDQAVTD EQU   0                                                        00648000
AVTSAVEX EQU   IEDQAVTD+288                                             00649000
@NM00003 EQU   IEDQAVTD+388                                             00650000
AVTCKFLG EQU   @NM00003                                                 00651000
AVTBASE  EQU   IEDQAVTD+412                                             00652000
AVTPKF   EQU   AVTBASE                                                  00653000
AVTRNMPT EQU   IEDQAVTD+424                                             00654000
AVTHG02  EQU   IEDQAVTD+528                                             00655000
AVTDISP  EQU   IEDQAVTD+552                                             00656000
AVTHD    EQU   IEDQAVTD+556                                             00657000
AVTSCOPT EQU   AVTHD                                                    00658000
AVTSAVTP EQU   IEDQAVTD+612                                             00659000
AVTSAVTF EQU   AVTSAVTP                                                 00660000
AVTCKPEL EQU   IEDQAVTD+652                                             00661000
AVTCKRMV EQU   AVTCKPEL                                                 00662000
AVTCKELF EQU   IEDQAVTD+680                                             00663000
AVTCKBYT EQU   IEDQAVTD+691                                             00664000
AVTHG01  EQU   IEDQAVTD+692                                             00665000
AVTCKLNK EQU   IEDQAVTD+696                                             00666000
AVTCRELE EQU   IEDQAVTD+708                                             00667000
AVTCCELE EQU   AVTCRELE                                                 00668000
AVTCLRHI EQU   IEDQAVTD+716                                             00669000
AVTADBUF EQU   IEDQAVTD+720                                             00670000
AVTSYSER EQU   IEDQAVTD+728                                             00671000
AVTCKPQB EQU   IEDQAVTD+804                                             00672000
AVTCKPTB EQU   AVTCKPQB                                                 00673000
AVTCKPEC EQU   AVTCKPQB+4                                               00674000
AVTCKPCC EQU   AVTCKPEC                                                 00675000
AVTOPCQB EQU   IEDQAVTD+816                                             00676000
AVTOPCOB EQU   AVTOPCQB                                                 00677000
AVTOPCEC EQU   AVTOPCQB+4                                               00678000
AVTOPCCC EQU   AVTOPCEC                                                 00679000
AVTOLTQB EQU   IEDQAVTD+828                                             00680000
AVTCWFL1 EQU   IEDQAVTD+924                                             00681000
AVTCWFL2 EQU   IEDQAVTD+925                                             00682000
AVTSUBT  EQU   IEDQAVTD+948                                             00683000
AVTIOTR  EQU   IEDQAVTD+949                                             00684000
AVTBIT1  EQU   IEDQAVTD+1050                                            00685000
AVTBIT2  EQU   IEDQAVTD+1051                                            00686000
AVTBIT3  EQU   IEDQAVTD+1052                                            00687000
AVTBIT4  EQU   IEDQAVTD+1136                                            00688000
@NM00083 EQU   IEDQAVTD+1232                                            00689000
IEDNSVTD EQU   0                                                        00690000
SAVTDIAG EQU   IEDNSVTD                                                 00691000
SAVTDIAF EQU   SAVTDIAG                                                 00692000
SAVTLUSQ EQU   IEDNSVTD+88                                              00693000
SAVTDFCO EQU   IEDNSVTD+200                                             00694000
SAVTTCPU EQU   IEDNSVTD+238                                             00695000
SAVTSCPT EQU   SAVTTCPU                                                 00696000
SAVTZELM EQU   IEDNSVTD+270                                             00697000
SAVTRDRV EQU   IEDNSVTD+284                                             00698000
SAVTCKQB EQU   IEDNSVTD+300                                             00699000
SAVTCKTB EQU   SAVTCKQB                                                 00700000
SAVTCKEC EQU   SAVTCKQB+4                                               00701000
SAVTCKCC EQU   SAVTCKEC                                                 00702000
IEDQOPCD EQU   0                                                        00703000
OPCAVTPT EQU   IEDQOPCD+8                                               00704000
OPCCOPCE EQU   IEDQOPCD+12                                              00705000
OPCSAVE  EQU   IEDQOPCD+56                                              00706000
OPCWORK  EQU   IEDQOPCD+140                                             00707000
OPCAQCTL EQU   IEDQOPCD+180                                             00708000
OPCXCTL  EQU   IEDQOPCD+204                                             00709000
OPCLDNME EQU   IEDQOPCD+212                                             00710000
OPCMODID EQU   OPCLDNME+3                                               00711000
OPCGETBF EQU   IEDQOPCD+276                                             00712000
OPCFREBF EQU   IEDQOPCD+280                                             00713000
OPCSPEC  EQU   IEDQOPCD+300                                             00714000
IEDQOPCE EQU   0                                                        00715000
OCELEM   EQU   IEDQOPCE+4                                               00716000
OCUNIT   EQU   IEDQOPCE+8                                               00717000
OCRUDEST EQU   OCUNIT                                                   00718000
OCCKPKEY EQU   OCRUDEST                                                 00719000
OCSCAN   EQU   OCCKPKEY                                                 00720000
OCOPTCDE EQU   IEDQOPCE+12                                              00721000
OCSWITCH EQU   IEDQOPCE+13                                              00722000
OCFLAG   EQU   IEDQOPCE+14                                              00723000
@NM00118 EQU   IEDQOPCE+16                                              00724000
OCDEST   EQU   @NM00118                                                 00725000
OCREQVAL EQU   OCDEST+1                                                 00726000
OCTRMTBL EQU   IEDQOPCE+20                                              00727000
OCLINENO EQU   IEDQOPCE+22                                              00728000
OCTIOT   EQU   OCLINENO                                                 00729000
OCTRUNIT EQU   IEDQOPCE+24                                              00730000
OCRSID   EQU   OCTRUNIT                                                 00731000
OCALSTAT EQU   OCRSID                                                   00732000
OCPARM   EQU   IEDQOPCE+28                                              00733000
OCWTG    EQU   IEDQOPCE+30                                              00734000
OCBACKUP EQU   IEDQOPCE+32                                              00735000
OCMODNME EQU   IEDQOPCE+40                                              00736000
OCIPLWA  EQU   OCMODNME                                                 00737000
OCCKDATA EQU   IEDQOPCE+48                                              00738000
OCRSTGTM EQU   OCCKDATA                                                 00739000
IEDQOPCN EQU   0                                                        00740000
OCLDNME  EQU   IEDQOPCN                                                 00741000
OCLINTTE EQU   OCLDNME                                                  00742000
OCREQFLG EQU   OCLINTTE+2                                               00743000
OCPREFLG EQU   OCLINTTE+3                                               00744000
IEDPIU   EQU   0                                                        00745000
PIUTH    EQU   IEDPIU                                                   00746000
PIURH    EQU   IEDPIU+10                                                00747000
PIURU    EQU   IEDPIU+13                                                00748000
IEDQPRF  EQU   0                                                        00749000
PRFRCB   EQU   IEDQPRF                                                  00750000
PRFKEY   EQU   PRFRCB                                                   00751000
PRFQCBA  EQU   PRFRCB+1                                                 00752000
PRFPRI   EQU   PRFRCB+4                                                 00753000
PRFLINK  EQU   PRFRCB+5                                                 00754000
PRFTIC   EQU   IEDQPRF+8                                                00755000
PRFTICC  EQU   PRFTIC                                                   00756000
PRFTI0   EQU   PRFTIC+1                                                 00757000
PRFNBUNT EQU   IEDQPRF+12                                               00758000
PRFSUNIT EQU   PRFNBUNT                                                 00759000
PRFPLQCB EQU   PRFSUNIT                                                 00760000
PRFPIUO  EQU   PRFPLQCB                                                 00761000
@NM00135 EQU   IEDQPRF+16                                               00762000
PRFSVFFO EQU   @NM00135                                                 00763000
PRFSRCE  EQU   PRFSVFFO                                                 00764000
PRFSTAT1 EQU   IEDQPRF+20                                               00765000
PRFEOFN  EQU   PRFSTAT1                                                 00766000
PRFCORE  EQU   IEDQPRF+21                                               00767000
PRFXTRA  EQU   PRFCORE                                                  00768000
PRFSCAN  EQU   IEDQPRF+24                                               00769000
PRFISIZE EQU   PRFSCAN+1                                                00770000
PRFTQBCK EQU   IEDQPRF+26                                               00771000
PRFNTXT  EQU   PRFTQBCK                                                 00772000
PRFEOBOF EQU   PRFNTXT                                                  00773000
PRFCHDR  EQU   IEDQPRF+32                                               00774000
PRFHQBCK EQU   IEDQPRF+35                                               00775000
IEDQPPTR EQU   0                                                        00776000
IEDPF1   EQU   0                                                        00777000
PRF1RH   EQU   IEDPF1                                                   00778000
PRF1FLG1 EQU   IEDPF1+3                                                 00779000
PRF1WD2  EQU   IEDPF1+4                                                 00780000
PRF1SEQP EQU   PRF1WD2                                                  00781000
PRF1SQID EQU   PRF1SEQP                                                 00782000
PRF1TAG1 EQU   PRF1SQID                                                 00783000
IEDPF2   EQU   0                                                        00784000
PRF2FLG2 EQU   IEDPF2                                                   00785000
PRF2TNTI EQU   PRF2FLG2                                                 00786000
PRF2WD2  EQU   IEDPF2+4                                                 00787000
IEDPRUQD EQU   0                                                        00788000
PRUTIC   EQU   IEDPRUQD+8                                               00789000
PRUDATA  EQU   IEDPRUQD+12                                              00790000
IEDPRUQP EQU   0                                                        00791000
IEDPRUND EQU   0                                                        00792000
PRURHTH  EQU   IEDPRUND                                                 00793000
PRURH    EQU   PRURHTH                                                  00794000
PRURHFG0 EQU   PRURH                                                    00795000
PRURHFG1 EQU   PRURH+1                                                  00796000
PRURHFG2 EQU   PRURH+2                                                  00797000
PRUTH    EQU   PRURHTH+3                                                00798000
PRUFIDN  EQU   PRUTH                                                    00799000
IEDRH    EQU   0                                                        00800000
TRHBYTE0 EQU   IEDRH                                                    00801000
TRHTYPE  EQU   TRHBYTE0                                                 00802000
TRHBYTE1 EQU   IEDRH+1                                                  00803000
TRHDR1   EQU   TRHBYTE1                                                 00804000
TRHDR2   EQU   TRHBYTE1                                                 00805000
TRHER    EQU   TRHBYTE1                                                 00806000
TRHBYTE2 EQU   IEDRH+2                                                  00807000
IEDSIBD  EQU   0                                                        00808000
SIBCHAIN EQU   IEDSIBD+4                                                00809000
SIBINDEX EQU   IEDSIBD+8                                                00810000
SIBSESSN EQU   IEDSIBD+10                                               00811000
SIBSSTAT EQU   SIBSESSN                                                 00812000
SIBPACIN EQU   IEDSIBD+11                                               00813000
SIBSEQN  EQU   IEDSIBD+12                                               00814000
SIBSTAT1 EQU   IEDSIBD+16                                               00815000
SIBSTAT2 EQU   IEDSIBD+17                                               00816000
SIBTERM  EQU   SIBSTAT2                                                 00817000
SIBRDSCN EQU   SIBSTAT2                                                 00818000
SIBBIND  EQU   IEDSIBD+20                                               00819000
SIBBIND1 EQU   SIBBIND                                                  00820000
SIBBIND2 EQU   SIBBIND+1                                                00821000
SIBBIND3 EQU   SIBBIND+2                                                00822000
SIBSTAT0 EQU   IEDSIBD+23                                               00823000
IEDTH    EQU   0                                                        00824000
TTHBYTE0 EQU   IEDTH                                                    00825000
TTHBYTE1 EQU   IEDTH+1                                                  00826000
TTHDAF   EQU   IEDTH+2                                                  00827000
TTHOAF   EQU   IEDTH+4                                                  00828000
TTHSNF   EQU   IEDTH+6                                                  00829000
TTHTAG   EQU   TTHSNF                                                   00830000
TTHTAG1  EQU   TTHTAG                                                   00831000
TTHDCF   EQU   IEDTH+8                                                  00832000
IEDTRM   EQU   0                                                        00833000
IEDNTRM  EQU   IEDTRM                                                   00834000
TRMBYTE4 EQU   IEDNTRM                                                  00835000
TRMBYTE3 EQU   IEDNTRM+1                                                00836000
TRMBYTE2 EQU   IEDNTRM+2                                                00837000
TRMINPG  EQU   TRMBYTE2                                                 00838000
TRMBYTE1 EQU   IEDNTRM+3                                                00839000
TRMSCPRQ EQU   TRMBYTE1                                                 00840000
TRMCOHRT EQU   IEDNTRM+4                                                00841000
TRMBYTE0 EQU   IEDNTRM+6                                                00842000
TRMSIBPT EQU   IEDNTRM+7                                                00843000
TRMTYPE  EQU   IEDNTRM+11                                               00844000
TRMSUBST EQU   IEDNTRM+12                                               00845000
IEDQTRM  EQU   IEDTRM+14                                                00846000
TRMSTATE EQU   IEDQTRM                                                  00847000
TRMLOG   EQU   TRMSTATE                                                 00848000
TRMINSEQ EQU   IEDQTRM+4                                                00849000
TLISTCNT EQU   TRMINSEQ                                                 00850000
TRMOUTSQ EQU   IEDQTRM+6                                                00851000
TLISTEN  EQU   TRMOUTSQ                                                 00852000
TRMDSORG EQU   TLISTEN                                                  00853000
TRMALTD  EQU   IEDQTRM+8                                                00854000
TRMDEVFL EQU   IEDQTRM+10                                               00855000
TRMSTAT  EQU   IEDQTRM+12                                               00856000
ALLOCBUF EQU   0                                                        00857000
FREEBUF  EQU   0                                                        00858000
IEDQTNT  EQU   0                                                        00859000
WKAREA   EQU   0                                                        00860000
WKSAVE1  EQU   WKAREA                                                   00861000
WKSAVE2  EQU   WKAREA+4                                                 00862000
WKSAVE3  EQU   WKAREA+8                                                 00863000
WKSAVE4  EQU   WKAREA+12                                                00864000
WKSAVE5  EQU   WKAREA+16                                                00865000
WKSAVE6  EQU   WKAREA+20                                                00866000
WKPIUPTR EQU   WKAREA+24                                                00867000
WKBUFPTR EQU   WKAREA+28                                                00868000
WKNEGPTR EQU   WKAREA+32                                                00869000
WKPIURH  EQU   WKAREA+36                                                00870000
WKSIBPTR EQU   WKAREA+40                                                00871000
WKRUPTR  EQU   WKAREA+44                                                00872000
WKLUCNT  EQU   WKAREA+48                                                00873000
WKCURRNT EQU   WKAREA+52                                                00874000
WKORIGNL EQU   WKAREA+56                                                00875000
WKOAFTNT EQU   WKAREA+60                                                00876000
WKPUTNT  EQU   WKAREA+62                                                00877000
WKSAVTNT EQU   WKAREA+64                                                00878000
XRDCCMD  EQU   0                                                        00879000
XRDCCODE EQU   XRDCCMD                                                  00880000
XRDCTYPE EQU   XRDCCMD+3                                                00881000
SIBPTR   EQU   0                                                        00882000
OPCAQWD  EQU   OPCAQCTL                                                 00883000
OPCAQWD1 EQU   OPCAQWD                                                  00884000
OPCAQREQ EQU   OPCAQWD1                                                 00885000
OPCAQFST EQU   OPCAQWD1+1                                               00886000
OPCAQWD2 EQU   OPCAQWD+4                                                00887000
OPCAQRQ2 EQU   OPCAQWD2                                                 00888000
OPCAQSEC EQU   OPCAQWD2+1                                               00889000
OPCAQWD3 EQU   OPCAQWD+8                                                00890000
OCCKPKY1 EQU   OCCKPKEY                                                 00891000
OCCKPTYP EQU   OCCKPKY1                                                 00892000
OCICACTN EQU   OCMODNME                                                 00893000
OCICDADR EQU   OCICACTN                                                 00894000
OCICSW   EQU   OCICDADR+3                                               00895000
TRMPRE1  EQU   TRMBYTE4                                                 00896000
TRMPRE   EQU   TRMBYTE3                                                 00897000
TRMNCP   EQU   TRMBYTE3                                                 00898000
TRMPU    EQU   TRMBYTE3                                                 00899000
TRMLU    EQU   TRMBYTE3                                                 00900000
TRMLINK  EQU   TRMBYTE3                                                 00901000
OCCIB    EQU   OCREQVAL                                                 00902000
PRFSHDR  EQU   IEDQPRF+42                                               00903000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00904000
@NM00167 EQU   TRMLINK                                                  00905000
TRMLSTAT EQU   TRMLINK                                                  00906000
TRMLINT  EQU   TRMLINK                                                  00907000
TRMEPMOD EQU   TRMLINK                                                  00908000
TRMLULOG EQU   TRMLU                                                    00909000
TRMINERR EQU   TRMLU                                                    00910000
TRMLUREQ EQU   TRMLU                                                    00911000
TRMSESRQ EQU   TRMLU                                                    00912000
TRMTDIFF EQU   TRMLU                                                    00913000
TRMLUTM  EQU   TRMLU                                                    00914000
TRMLUIT  EQU   TRMLU                                                    00915000
TRMAUTO  EQU   TRMLU                                                    00916000
TRMPCONT EQU   TRMPU                                                    00917000
@NM00166 EQU   TRMPU                                                    00918000
TRMNCONT EQU   TRMNCP                                                   00919000
TRMQUCKN EQU   TRMNCP                                                   00920000
TRMSLOWN EQU   TRMNCP                                                   00921000
TRMSYGEN EQU   TRMNCP                                                   00922000
TRMNCPCL EQU   TRMNCP                                                   00923000
TRMIPLDM EQU   TRMNCP                                                   00924000
TRMINOUT EQU   TRMPRE                                                   00925000
TRMRDOUT EQU   TRMPRE                                                   00926000
TRMNLOUT EQU   TRMPRE                                                   00927000
TRMWROUT EQU   TRMPRE                                                   00928000
TRMASNXI EQU   TRMPRE                                                   00929000
TRMSTMM  EQU   TRMPRE                                                   00930000
TRMCMODE EQU   TRMPRE                                                   00931000
TRMSTPND EQU   TRMPRE                                                   00932000
TRMLYNCH EQU   TRMPRE1                                                  00933000
TRMSPOUT EQU   TRMPRE1                                                  00934000
TRMERLCK EQU   TRMPRE1                                                  00935000
TRMQNPL  EQU   TRMPRE1                                                  00936000
TRMSPACT EQU   TRMPRE1                                                  00937000
TRMOCNI  EQU   TRMPRE1                                                  00938000
TRMSESSN EQU   TRMPRE1                                                  00939000
TRMCONT  EQU   TRMPRE1                                                  00940000
OCICINAC EQU   OCICSW                                                   00941000
@NM00124 EQU   OCICSW                                                   00942000
OCICATST EQU   OCICDADR+1                                               00943000
OCICTYPE EQU   OCICDADR                                                 00944000
@NM00123 EQU   OCCKPKY1                                                 00945000
OCCKPENV EQU   OCCKPKY1                                                 00946000
OCCKPRST EQU   OCCKPTYP                                                 00947000
OCCKPNCP EQU   OCCKPTYP                                                 00948000
OCCKPINC EQU   OCCKPTYP                                                 00949000
OPCAQLST EQU   OPCAQWD3+1                                               00950000
OPCAQRQ3 EQU   OPCAQWD3                                                 00951000
TRMOPT   EQU   IEDTRM+34                                                00952000
TRMOPTBL EQU   IEDQTRM+18                                               00953000
TRMOPNO  EQU   IEDQTRM+17                                               00954000
TRMCHCIN EQU   IEDQTRM+16                                               00955000
TRMSENSE EQU   TRMSTAT+3                                                00956000
TRMTEMPR EQU   TRMSTAT+2                                                00957000
TRMSIO   EQU   TRMSTAT                                                  00958000
@NM00165 EQU   TRMDEVFL+1                                               00959000
TRMTPIN  EQU   TRMDEVFL+1                                               00960000
TRMNCPI  EQU   TRMDEVFL+1                                               00961000
TRMRNTRM EQU   TRMDEVFL+1                                               00962000
@NM00164 EQU   TRMDEVFL+1                                               00963000
TRMLMD   EQU   TRMDEVFL+1                                               00964000
TRMCONC  EQU   TRMDEVFL+1                                               00965000
TRMTSOB  EQU   TRMDEVFL                                                 00966000
TRMBFDY  EQU   TRMDEVFL                                                 00967000
TRMTBLK  EQU   TRMDEVFL                                                 00968000
TRMSBLK  EQU   TRMDEVFL                                                 00969000
TRMBLKS  EQU   TRMDEVFL                                                 00970000
TRMADDC  EQU   TRMDEVFL                                                 00971000
TRMDDIG  EQU   TRMDEVFL                                                 00972000
TRMBUFS  EQU   TRMDEVFL                                                 00973000
TRMPRILK EQU   TRMALTD                                                  00974000
TRMLGB   EQU   TRMDSORG                                                 00975000
TRMUTERM EQU   TLISTCNT                                                 00976000
TRMDESTQ EQU   IEDQTRM+1                                                00977000
TRMSCNYN EQU   TRMSTATE                                                 00978000
TRMOPTFN EQU   TRMSTATE                                                 00979000
TRMHELDN EQU   TRMSTATE                                                 00980000
TRMACPTN EQU   TRMSTATE                                                 00981000
TRMPREF  EQU   TRMSTATE                                                 00982000
TRMPROC  EQU   TRMLOG                                                   00983000
TRMLIST  EQU   TRMLOG                                                   00984000
TRMLINE  EQU   TRMSTATE                                                 00985000
TRMRLMCT EQU   IEDNTRM+10                                               00986000
TRMCOHTG EQU   TRMSIBPT+1                                               00987000
TRMGPCNT EQU   TRMSIBPT                                                 00988000
TRMBUFRD EQU   TRMBYTE0                                                 00989000
TRMSNA   EQU   TRMBYTE0                                                 00990000
TRMGP    EQU   TRMBYTE0                                                 00991000
TRMDIAL  EQU   TRMBYTE0                                                 00992000
@NM00163 EQU   TRMBYTE0                                                 00993000
TRMOUTPT EQU   TRMBYTE0                                                 00994000
TRMINPUT EQU   TRMBYTE0                                                 00995000
TRMUDEF  EQU   TRMBYTE0                                                 00996000
TRMSTOTE EQU   TRMBYTE1                                                 00997000
TRMCKPRN EQU   TRMBYTE1                                                 00998000
TRMTSATN EQU   TRMBYTE1                                                 00999000
TRMTRACE EQU   TRMBYTE1                                                 01000000
TRMSWBCK EQU   TRMBYTE1                                                 01001000
TRMAUTOC EQU   TRMBYTE1                                                 01002000
TRMINPTP EQU   TRMBYTE1                                                 01003000
TRMWTNEG EQU   TRMSCPRQ                                                 01004000
TRMWRBRK EQU   TRMBYTE2                                                 01005000
TRMNOSND EQU   TRMBYTE2                                                 01006000
TRMPREP  EQU   TRMBYTE2                                                 01007000
TRMGPACT EQU   TRMBYTE2                                                 01008000
TRMANDL  EQU   TRMBYTE2                                                 01009000
TRMCLOSN EQU   TRMINPG                                                  01010000
TRMREMB  EQU   TRMBYTE2                                                 01011000
TRMRSACT EQU   TRMBYTE2                                                 01012000
TTHTAG2  EQU   TTHTAG+1                                                 01013000
@NM00162 EQU   TTHTAG1                                                  01014000
TTHTAGS  EQU   TTHTAG1                                                  01015000
TTHEFI   EQU   TTHBYTE0                                                 01016000
@NM00161 EQU   TTHBYTE0                                                 01017000
TTHEBIU  EQU   TTHBYTE0                                                 01018000
TTHBBIU  EQU   TTHBYTE0                                                 01019000
TTHFTYPE EQU   TTHBYTE0                                                 01020000
SIBLUTYP EQU   SIBSTAT0                                                 01021000
SIBCD    EQU   SIBSTAT0                                                 01022000
@NM00160 EQU   SIBBIND3                                                 01023000
SIBCRES  EQU   SIBBIND3                                                 01024000
SIBSPKR  EQU   SIBBIND3                                                 01025000
SIBRECOV EQU   SIBBIND3                                                 01026000
SIBFMODE EQU   SIBBIND3                                                 01027000
SIBALT   EQU   SIBBIND2                                                 01028000
SIBBTERM EQU   SIBBIND2                                                 01029000
SIBBRACK EQU   SIBBIND2                                                 01030000
SIBFMUSE EQU   SIBBIND2                                                 01031000
SIBSEBI  EQU   SIBBIND2                                                 01032000
SIBSCMP  EQU   SIBBIND2                                                 01033000
SIBSEXC  EQU   SIBBIND2                                                 01034000
SIBSDEF  EQU   SIBBIND2                                                 01035000
SIBSRQM  EQU   SIBBIND1                                                 01036000
SIBSCHNG EQU   SIBBIND1                                                 01037000
SIBPEBI  EQU   SIBBIND1                                                 01038000
SIBPCMP  EQU   SIBBIND1                                                 01039000
SIBPEXC  EQU   SIBBIND1                                                 01040000
SIBPDEF  EQU   SIBBIND1                                                 01041000
SIBPRQM  EQU   SIBBIND1                                                 01042000
SIBPCHN  EQU   SIBBIND1                                                 01043000
SIBFMPRO EQU   IEDSIBD+19                                               01044000
SIBTSPRO EQU   IEDSIBD+18                                               01045000
@NM00159 EQU   SIBSTAT2                                                 01046000
SIBDACLU EQU   SIBSTAT2                                                 01047000
SIBUSS   EQU   SIBSTAT2                                                 01048000
SIBBSTAT EQU   SIBSTAT1                                                 01049000
SIBRTRP  EQU   SIBSTAT1                                                 01050000
@NM00158 EQU   SIBSTAT1                                                 01051000
SIBRQEND EQU   SIBSTAT1                                                 01052000
SIBRQSHT EQU   SIBSTAT1                                                 01053000
SIBSEQO  EQU   SIBSEQN+2                                                01054000
SIBSEQI  EQU   SIBSEQN                                                  01055000
SIBNCNT  EQU   SIBPACIN                                                 01056000
SIBMCNT  EQU   SIBPACIN                                                 01057000
SIBDSTAT EQU   SIBSESSN                                                 01058000
SIBINBIU EQU   SIBSESSN                                                 01059000
SIBSHUTC EQU   SIBSESSN                                                 01060000
SIBLGOFF EQU   SIBSESSN                                                 01061000
SIBRUSEG EQU   IEDSIBD                                                  01062000
@NM00157 EQU   TRHBYTE2                                                 01063000
@NM00156 EQU   TRHBYTE2                                                 01064000
@NM00155 EQU   TRHBYTE2                                                 01065000
TRHCSI   EQU   TRHBYTE2                                                 01066000
@NM00154 EQU   TRHBYTE2                                                 01067000
TRHCDI   EQU   TRHBYTE2                                                 01068000
TRHEB    EQU   TRHBYTE2                                                 01069000
TRHBB    EQU   TRHBYTE2                                                 01070000
TRHPI    EQU   TRHBYTE1                                                 01071000
@NM00153 EQU   TRHBYTE1                                                 01072000
@NM00152 EQU   TRHBYTE1                                                 01073000
@NM00151 EQU   TRHBYTE1                                                 01074000
@NM00150 EQU   TRHBYTE1                                                 01075000
TRHEC    EQU   TRHBYTE0                                                 01076000
TRHBC    EQU   TRHBYTE0                                                 01077000
TRHSDI   EQU   TRHBYTE0                                                 01078000
TRHFI    EQU   TRHBYTE0                                                 01079000
@NM00149 EQU   TRHBYTE0                                                 01080000
TRHRUCAT EQU   TRHBYTE0                                                 01081000
@NM00148 EQU   IEDPRUND+4                                               01082000
PRUTHEFI EQU   PRUFIDN                                                  01083000
PRUTHUSS EQU   PRUFIDN                                                  01084000
PRUTHEIU EQU   PRUFIDN                                                  01085000
PRUTHBIU EQU   PRUFIDN                                                  01086000
PRUTHTYE EQU   PRUFIDN                                                  01087000
@NM00147 EQU   PRURHFG2                                                 01088000
PRURHCSI EQU   PRURHFG2                                                 01089000
@NM00146 EQU   PRURHFG2                                                 01090000
PRURHCDI EQU   PRURHFG2                                                 01091000
PRURHEB  EQU   PRURHFG2                                                 01092000
PRURHBB  EQU   PRURHFG2                                                 01093000
PRURHPI  EQU   PRURHFG1                                                 01094000
@NM00145 EQU   PRURHFG1                                                 01095000
PRURHER  EQU   PRURHFG1                                                 01096000
PRURHDR2 EQU   PRURHFG1                                                 01097000
@NM00144 EQU   PRURHFG1                                                 01098000
PRURHDR1 EQU   PRURHFG1                                                 01099000
PRURHEC  EQU   PRURHFG0                                                 01100000
PRURHBC  EQU   PRURHFG0                                                 01101000
PRURHSDI EQU   PRURHFG0                                                 01102000
PRURHFI  EQU   PRURHFG0                                                 01103000
@NM00143 EQU   PRURHFG0                                                 01104000
PRURUCAT EQU   PRURHFG0                                                 01105000
PRURHTYP EQU   PRURHFG0                                                 01106000
PRUNUNIT EQU   PRUTIC+1                                                 01107000
@NM00142 EQU   PRUTIC                                                   01108000
@NM00141 EQU   IEDPRUQD+4                                               01109000
PRUDATCT EQU   IEDPRUQD+2                                               01110000
PRUTTCIN EQU   IEDPRUQD                                                 01111000
PRF2SEQP EQU   PRF2WD2                                                  01112000
@NM00140 EQU   IEDPF2+1                                                 01113000
@NM00139 EQU   PRF2FLG2                                                 01114000
PRF2SMI  EQU   PRF2FLG2                                                 01115000
PRF2FORM EQU   PRF2FLG2                                                 01116000
PRF1RULN EQU   PRF1SEQP+2                                               01117000
PRF1TAG2 EQU   PRF1SQID+1                                               01118000
@NM00138 EQU   PRF1TAG1                                                 01119000
PRF1TAGS EQU   PRF1TAG1                                                 01120000
@NM00137 EQU   PRF1FLG1                                                 01121000
PRF1LOGD EQU   PRF1FLG1                                                 01122000
PRF1USS  EQU   PRF1FLG1                                                 01123000
PRF1FORM EQU   PRF1FLG1                                                 01124000
PRF1EXPI EQU   PRF1FLG1                                                 01125000
PRF1FIDI EQU   PRF1FLG1                                                 01126000
PRFDEST  EQU   IEDQPRF+40                                               01127000
PRFISEQ  EQU   IEDQPRF+38                                               01128000
PRFSTXT  EQU   PRFHQBCK                                                 01129000
PRFNHDR  EQU   PRFCHDR                                                  01130000
PRFCRCD  EQU   IEDQPRF+29                                               01131000
PRFSVSEQ EQU   PRFNTXT+1                                                01132000
PRFSVPRI EQU   PRFEOBOF                                                 01133000
@NM00136 EQU   PRFSCAN                                                  01134000
PRFEOB   EQU   PRFXTRA+1                                                01135000
PRFSTSO  EQU   PRFXTRA                                                  01136000
PRFNHDRN EQU   PRFSTAT1                                                 01137000
PRFNLSTN EQU   PRFSTAT1                                                 01138000
PRFLOCK  EQU   PRFEOFN                                                  01139000
PRFDUPLN EQU   PRFSTAT1                                                 01140000
PRFTSMSG EQU   PRFSTAT1                                                 01141000
PRFITCPN EQU   PRFSTAT1                                                 01142000
PRFERMGN EQU   PRFSTAT1                                                 01143000
PRFCNCLN EQU   PRFSTAT1                                                 01144000
PRFSVFLG EQU   @NM00135+3                                               01145000
PRFSIZE  EQU   PRFSVFFO+2                                               01146000
PRFLCB   EQU   IEDQPRF+13                                               01147000
@NM00134 EQU   PRFTICC                                                  01148000
@NM00133 EQU   PRFTICC                                                  01149000
@NM00132 EQU   PRFTICC                                                  01150000
PRFTICON EQU   PRFTICC                                                  01151000
@NM00131 EQU   PRFTICC                                                  01152000
@NM00130 EQU   PRFTICC                                                  01153000
PRFBFMM  EQU   PRFTICC                                                  01154000
PRFEOMSG EQU   PRFTICC                                                  01155000
PRFCOUNT EQU   PRFLINK+1                                                01156000
@NM00129 EQU   PRFLINK                                                  01157000
PRFFLAGS EQU   PRFPRI                                                   01158000
PRFIOADR EQU   PRFQCBA                                                  01159000
PRFOPCDE EQU   PRFKEY                                                   01160000
@NM00128 EQU   OCLDNME+4                                                01161000
@NM00127 EQU   OCPREFLG                                                 01162000
OCTOTEP  EQU   OCPREFLG                                                 01163000
OCREPOST EQU   OCPREFLG                                                 01164000
OCRSPSNT EQU   OCPREFLG                                                 01165000
OCBFREQ  EQU   OCPREFLG                                                 01166000
OCIDLE   EQU   OCREQFLG                                                 01167000
OCFORCE  EQU   OCREQFLG                                                 01168000
OCDCARD  EQU   OCREQFLG                                                 01169000
OCPARTAL EQU   OCREQFLG                                                 01170000
OCADNCP  EQU   OCREQFLG                                                 01171000
@NM00126 EQU   OCREQFLG                                                 01172000
@NM00125 EQU   OCREQFLG                                                 01173000
OCFLUSHZ EQU   OCREQFLG                                                 01174000
OCRESPCT EQU   OCLINTTE                                                 01175000
OCCKPTWA EQU   OCCKDATA+4                                               01176000
@NM00122 EQU   OCRSTGTM+2                                               01177000
OCCKDAT2 EQU   OCRSTGTM+1                                               01178000
OCCKDAT1 EQU   OCRSTGTM                                                 01179000
OCPTRSAV EQU   OCMODNME+4                                               01180000
OCPUADR  EQU   OCIPLWA+2                                                01181000
OCWTGSAV EQU   OCIPLWA                                                  01182000
OCDVRDCT EQU   OCBACKUP+6                                               01183000
OCNCP    EQU   OCBACKUP+4                                               01184000
OCBUFGOT EQU   OCBACKUP+2                                               01185000
OCBUFNED EQU   OCBACKUP                                                 01186000
OCRESNUM EQU   OCPARM                                                   01187000
OCSEQ    EQU   OCTRUNIT+2                                               01188000
@NM00121 EQU   OCRSID+1                                                 01189000
OCNONE   EQU   OCALSTAT                                                 01190000
OCSOME   EQU   OCALSTAT                                                 01191000
OCALLFLG EQU   OCALSTAT                                                 01192000
OCACTREQ EQU   OCALSTAT                                                 01193000
OCREDRVE EQU   OCALSTAT                                                 01194000
OCSEQIND EQU   OCALSTAT                                                 01195000
@NM00120 EQU   OCALSTAT                                                 01196000
OCRENTRD EQU   OCALSTAT                                                 01197000
OCWTGB   EQU   OCTIOT                                                   01198000
@NM00119 EQU   @NM00118+2                                               01199000
OCCONID  EQU   OCDEST                                                   01200000
OCRLN    EQU   IEDQOPCE+15                                              01201000
OCRESP   EQU   OCFLAG                                                   01202000
OCATTACH EQU   OCFLAG                                                   01203000
OCSSCP   EQU   OCFLAG                                                   01204000
OCOUTPUT EQU   OCFLAG                                                   01205000
OCLINE   EQU   OCFLAG                                                   01206000
OCMPP    EQU   OCFLAG                                                   01207000
OCTOTE   EQU   OCFLAG                                                   01208000
OCCONSOL EQU   OCFLAG                                                   01209000
@NM00117 EQU   OCSWITCH                                                 01210000
OCQUCKN  EQU   OCSWITCH                                                 01211000
OCPRIFLG EQU   OCOPTCDE                                                 01212000
@NM00116 EQU   OCRUDEST+1                                               01213000
@NM00115 EQU   OCSCAN                                                   01214000
OCNOTUCB EQU   OCSCAN                                                   01215000
OCNONAME EQU   OCSCAN                                                   01216000
OCALLRLN EQU   OCSCAN                                                   01217000
OCDDNAME EQU   OCSCAN                                                   01218000
OCDDNRLN EQU   OCSCAN                                                   01219000
OCADDR   EQU   OCSCAN                                                   01220000
OCELMPTR EQU   OCELEM+1                                                 01221000
OCELMPRI EQU   OCELEM                                                   01222000
OCLINK   EQU   IEDQOPCE                                                 01223000
OPCBOTTM EQU   IEDQOPCD+1172                                            01224000
@NM00114 EQU   IEDQOPCD+1088                                            01225000
@NM00113 EQU   IEDQOPCD+936                                             01226000
@NM00112 EQU   IEDQOPCD+928                                             01227000
@NM00111 EQU   IEDQOPCD+368                                             01228000
OPCWAITV EQU   IEDQOPCD+364                                             01229000
OPCTOTCK EQU   IEDQOPCD+360                                             01230000
OPCAPXTL EQU   IEDQOPCD+356                                             01231000
OPCDECR  EQU   IEDQOPCD+352                                             01232000
OPCBUFWT EQU   IEDQOPCD+348                                             01233000
OPCWRKSP EQU   IEDQOPCD+320                                             01234000
OPCADGOT EQU   IEDQOPCD+318                                             01235000
OPCRQCNT EQU   IEDQOPCD+316                                             01236000
OPPOLSTP EQU   IEDQOPCD+312                                             01237000
OPCCKCIB EQU   IEDQOPCD+308                                             01238000
OPCEND   EQU   IEDQOPCD+307                                             01239000
OPCSTCBS EQU   IEDQOPCD+306                                             01240000
OPCHNEND EQU   IEDQOPCD+302                                             01241000
OPCOQSW  EQU   IEDQOPCD+301                                             01242000
@NM00110 EQU   OPCSPEC                                                  01243000
@NM00109 EQU   OPCSPEC                                                  01244000
@NM00108 EQU   OPCSPEC                                                  01245000
@NM00107 EQU   OPCSPEC                                                  01246000
OPCFRMCA EQU   OPCSPEC                                                  01247000
OPCRSTRT EQU   OPCSPEC                                                  01248000
OPCPART  EQU   OPCSPEC                                                  01249000
OPCALTD  EQU   OPCSPEC                                                  01250000
OPCBFEND EQU   IEDQOPCD+296                                             01251000
OPCBFIRS EQU   IEDQOPCD+292                                             01252000
OPCAVBUF EQU   IEDQOPCD+290                                             01253000
@NM00106 EQU   IEDQOPCD+289                                             01254000
OPCCLNTS EQU   IEDQOPCD+288                                             01255000
OPCHA8   EQU   IEDQOPCD+286                                             01256000
OPCBFREQ EQU   IEDQOPCD+284                                             01257000
OPCNEXT  EQU   IEDQOPCD+272                                             01258000
OPCFMDFC EQU   IEDQOPCD+268                                             01259000
OPCSCNC  EQU   IEDQOPCD+264                                             01260000
OPCHORTG EQU   IEDQOPCD+260                                             01261000
OPCHORT  EQU   IEDQOPCD+256                                             01262000
OPCCKPTL EQU   IEDQOPCD+252                                             01263000
OPCCKPTF EQU   IEDQOPCD+248                                             01264000
OPCWAITA EQU   IEDQOPCD+244                                             01265000
OPCWAITR EQU   IEDQOPCD+240                                             01266000
OPCWAITP EQU   IEDQOPCD+236                                             01267000
OPCWAITO EQU   IEDQOPCD+232                                             01268000
OPCWAITN EQU   IEDQOPCD+228                                             01269000
OPCWAITL EQU   IEDQOPCD+224                                             01270000
OPCWAITC EQU   IEDQOPCD+220                                             01271000
@NM00105 EQU   OPCLDNME+5                                               01272000
@NM00104 EQU   OPCLDNME                                                 01273000
OPCWAIT  EQU   IEDQOPCD+192                                             01274000
OPCCKERB EQU   IEDQOPCD+164                                             01275000
OPCBFERB EQU   IEDQOPCD+148                                             01276000
OPCFLAG2 EQU   IEDQOPCD+147                                             01277000
OPCFLAG1 EQU   IEDQOPCD+146                                             01278000
OPCWRKSZ EQU   IEDQOPCD+144                                             01279000
OPCRSAVE EQU   IEDQOPCD+132                                             01280000
OPCQCBAD EQU   IEDQOPCD+128                                             01281000
OPCTRMWA EQU   IEDQOPCD+52                                              01282000
OPCPSTWT EQU   IEDQOPCD+48                                              01283000
OPCTNTEA EQU   IEDQOPCD+44                                              01284000
OPCPGCK  EQU   IEDQOPCD+40                                              01285000
OPCLCB   EQU   IEDQOPCD+36                                              01286000
@NM00103 EQU   IEDQOPCD+32                                              01287000
OPCIPLAD EQU   IEDQOPCD+28                                              01288000
OPCTOFLK EQU   IEDQOPCD+24                                              01289000
OPCOPTLK EQU   IEDQOPCD+20                                              01290000
OPCDCBLK EQU   IEDQOPCD+16                                              01291000
OPCDOUBL EQU   IEDQOPCD                                                 01292000
SAVTBITN EQU   IEDNSVTD+312                                             01293000
@NM00102 EQU   SAVTCKQB+8                                               01294000
@NM00101 EQU   SAVTCKEC+1                                               01295000
@NM00100 EQU   SAVTCKCC                                                 01296000
SAVTCKPO EQU   SAVTCKCC                                                 01297000
SAVTCKWA EQU   SAVTCKCC                                                 01298000
SAVTCKCH EQU   SAVTCKTB+1                                               01299000
SAVTCKVT EQU   SAVTCKTB                                                 01300000
@NM00099 EQU   IEDNSVTD+297                                             01301000
SAVTRDFG EQU   SAVTRDRV+12                                              01302000
@NM00098 EQU   SAVTRDRV+5                                               01303000
SAVTRDPY EQU   SAVTRDRV+4                                               01304000
SAVTRDQB EQU   SAVTRDRV+1                                               01305000
SAVTRDKY EQU   SAVTRDRV                                                 01306000
SAVTNID  EQU   IEDNSVTD+280                                             01307000
SAVTDVAS EQU   IEDNSVTD+276                                             01308000
SAVTPLSZ EQU   IEDNSVTD+274                                             01309000
@NM00097 EQU   IEDNSVTD+273                                             01310000
SAVTSUBL EQU   IEDNSVTD+272                                             01311000
@NM00096 EQU   SAVTZELM+1                                               01312000
SAVTSUBM EQU   SAVTZELM                                                 01313000
SAVTMHDX EQU   IEDNSVTD+268                                             01314000
SAVTNAT1 EQU   IEDNSVTD+266                                             01315000
SAVTSH20 EQU   IEDNSVTD+264                                             01316000
SAVTLCBS EQU   IEDNSVTD+260                                             01317000
SAVTRNMP EQU   IEDNSVTD+256                                             01318000
SAVTTNTX EQU   IEDNSVTD+252                                             01319000
SAVTNAX  EQU   IEDNSVTD+248                                             01320000
SAVTSUBV EQU   IEDNSVTD+247                                             01321000
SAVTSUBA EQU   IEDNSVTD+246                                             01322000
SAVTSIBC EQU   IEDNSVTD+244                                             01323000
SAVTBSM  EQU   IEDNSVTD+240                                             01324000
SAVTRQTG EQU   IEDNSVTD+236                                             01325000
SAVTRQCH EQU   IEDNSVTD+232                                             01326000
SAVTMAND EQU   IEDNSVTD+228                                             01327000
SAVTSPLN EQU   IEDNSVTD+224                                             01328000
SAVTNADL EQU   IEDNSVTD+222                                             01329000
SAVTNATL EQU   IEDNSVTD+220                                             01330000
SAVTMHTB EQU   IEDNSVTD+216                                             01331000
SAVTSSMH EQU   IEDNSVTD+212                                             01332000
SAVTQRS  EQU   IEDNSVTD+208                                             01333000
SAVTRQIN EQU   IEDNSVTD+204                                             01334000
SAVTSAO  EQU   IEDNSVTD+196                                             01335000
SAVTSARI EQU   IEDNSVTD+192                                             01336000
SAVTSAC  EQU   IEDNSVTD+188                                             01337000
SAVTSAI  EQU   IEDNSVTD+184                                             01338000
SAVTCSCI EQU   IEDNSVTD+180                                             01339000
SAVTSSRP EQU   IEDNSVTD+176                                             01340000
SAVTSSRQ EQU   IEDNSVTD+172                                             01341000
SAVTSCLU EQU   IEDNSVTD+168                                             01342000
SAVTXTRQ EQU   IEDNSVTD+164                                             01343000
SAVTMVBF EQU   IEDNSVTD+160                                             01344000
@NM00095 EQU   IEDNSVTD+148                                             01345000
SAVTIPCQ EQU   IEDNSVTD+144                                             01346000
@NM00094 EQU   IEDNSVTD+136                                             01347000
SAVTXFMI EQU   IEDNSVTD+132                                             01348000
@NM00093 EQU   IEDNSVTD+124                                             01349000
SAVTXFMO EQU   IEDNSVTD+120                                             01350000
@NM00092 EQU   IEDNSVTD+116                                             01351000
SAVTSSSR EQU   IEDNSVTD+112                                             01352000
SAVTSCPQ EQU   IEDNSVTD+108                                             01353000
SAVTSLCB EQU   IEDNSVTD+104                                             01354000
SAVTLUSR EQU   IEDNSVTD+100                                             01355000
@NM00091 EQU   SAVTLUSQ+8                                               01356000
SAVTLUSP EQU   SAVTLUSQ+4                                               01357000
SAVTLUSB EQU   SAVTLUSQ                                                 01358000
@NM00090 EQU   IEDNSVTD+84                                              01359000
SAVTSAT  EQU   IEDNSVTD+80                                              01360000
SAVTNAT  EQU   IEDNSVTD+76                                              01361000
SAVTCLUP EQU   IEDNSVTD+72                                              01362000
SAVTPIUT EQU   IEDNSVTD+68                                              01363000
SAVTRNTA EQU   IEDNSVTD+64                                              01364000
SAVTDNIR EQU   IEDNSVTD+60                                              01365000
SAVTCNIR EQU   IEDNSVTD+56                                              01366000
SAVTFLDH EQU   IEDNSVTD+52                                              01367000
SAVTSRTN EQU   IEDNSVTD+48                                              01368000
SAVTSREQ EQU   IEDNSVTD+44                                              01369000
SAVTFAIL EQU   IEDNSVTD+42                                              01370000
SAVTSUSE EQU   IEDNSVTD+40                                              01371000
SAVTSIB  EQU   IEDNSVTD+36                                              01372000
SAVTPRTN EQU   IEDNSVTD+32                                              01373000
@NM00089 EQU   IEDNSVTD+28                                              01374000
SAVTWH20 EQU   IEDNSVTD+26                                              01375000
SAVTPWT  EQU   IEDNSVTD+24                                              01376000
SAVTPRTQ EQU   IEDNSVTD+20                                              01377000
SAVTPREQ EQU   IEDNSVTD+16                                              01378000
SAVTPH20 EQU   IEDNSVTD+14                                              01379000
SAVTPUSE EQU   IEDNSVTD+12                                              01380000
SAVTPLCB EQU   IEDNSVTD+8                                               01381000
SAVTPOOL EQU   IEDNSVTD+4                                               01382000
SAVTPRMT EQU   SAVTDIAF                                                 01383000
SAVTVIRT EQU   SAVTDIAF                                                 01384000
AVTCPBNO EQU   IEDQAVTD+1244                                            01385000
AVTHRESS EQU   IEDQAVTD+1243                                            01386000
@NM00088 EQU   IEDQAVTD+1242                                            01387000
@NM00087 EQU   IEDQAVTD+1241                                            01388000
@NM00086 EQU   IEDQAVTD+1240                                            01389000
@NM00085 EQU   IEDQAVTD+1237                                            01390000
@NM00084 EQU   IEDQAVTD+1236                                            01391000
AVTHRESE EQU   @NM00083                                                 01392000
AVTRADDR EQU   IEDQAVTD+1228                                            01393000
AVTNADDR EQU   IEDQAVTD+1224                                            01394000
AVTHRESN EQU   IEDQAVTD+1220                                            01395000
AVTVOLRN EQU   IEDQAVTD+1216                                            01396000
AVTTOTNN EQU   IEDQAVTD+1212                                            01397000
AVTTRCYN EQU   IEDQAVTD+1208                                            01398000
AVTRCTRN EQU   IEDQAVTD+1204                                            01399000
AVTNOVON EQU   IEDQAVTD+1200                                            01400000
AVTADEBN EQU   IEDQAVTD+1196                                            01401000
AVTVOLRR EQU   IEDQAVTD+1192                                            01402000
AVTTOTNR EQU   IEDQAVTD+1188                                            01403000
AVTTRCYR EQU   IEDQAVTD+1184                                            01404000
AVTRCTRR EQU   IEDQAVTD+1180                                            01405000
AVTNOVOR EQU   IEDQAVTD+1176                                            01406000
AVTADEBR EQU   IEDQAVTD+1172                                            01407000
AVTLODPT EQU   IEDQAVTD+1168                                            01408000
AVTIOBN  EQU   IEDQAVTD+1164                                            01409000
AVTIOBR  EQU   IEDQAVTD+1160                                            01410000
AVTCPBPT EQU   IEDQAVTD+1156                                            01411000
AVTFCPB  EQU   IEDQAVTD+1152                                            01412000
@NM00082 EQU   IEDQAVTD+1148                                            01413000
AVTINCPQ EQU   IEDQAVTD+1144                                            01414000
@NM00081 EQU   IEDQAVTD+1140                                            01415000
@NM00080 EQU   IEDQAVTD+1137                                            01416000
@NM00079 EQU   AVTBIT4                                                  01417000
@NM00078 EQU   AVTBIT4                                                  01418000
@NM00077 EQU   AVTBIT4                                                  01419000
@NM00076 EQU   AVTBIT4                                                  01420000
@NM00075 EQU   AVTBIT4                                                  01421000
@NM00074 EQU   AVTBIT4                                                  01422000
@NM00073 EQU   AVTBIT4                                                  01423000
AVTRUFTN EQU   AVTBIT4                                                  01424000
@NM00072 EQU   IEDQAVTD+1132                                            01425000
AVTNOBFQ EQU   IEDQAVTD+1128                                            01426000
@NM00071 EQU   IEDQAVTD+1124                                            01427000
AVTDKENQ EQU   IEDQAVTD+1120                                            01428000
@NM00070 EQU   IEDQAVTD+1116                                            01429000
AVTDKAPQ EQU   IEDQAVTD+1112                                            01430000
AVTCOPY  EQU   IEDQAVTD+1108                                            01431000
AVTIA    EQU   IEDQAVTD+1104                                            01432000
AVTFL    EQU   IEDQAVTD+1100                                            01433000
@NM00069 EQU   IEDQAVTD+1096                                            01434000
AVTNCPBQ EQU   IEDQAVTD+1092                                            01435000
AVTTOTNC EQU   IEDQAVTD+1088                                            01436000
AVTCMAX  EQU   IEDQAVTD+1084                                            01437000
AVTCMIN  EQU   IEDQAVTD+1080                                            01438000
AVTHM02  EQU   IEDQAVTD+1076                                            01439000
AVTOPCIN EQU   IEDQAVTD+1074                                            01440000
AVTDCTLN EQU   IEDQAVTD+1072                                            01441000
AVTOPMSK EQU   IEDQAVTD+1068                                            01442000
AVTDDFT  EQU   IEDQAVTD+1064                                            01443000
AVTSTEAL EQU   IEDQAVTD+1060                                            01444000
AVTOPTN  EQU   IEDQAVTD+1056                                            01445000
AVTDSKCT EQU   IEDQAVTD+1054                                            01446000
AVTCKRST EQU   IEDQAVTD+1053                                            01447000
AVTSTAN  EQU   AVTBIT3                                                  01448000
AVTSTACN EQU   AVTBIT3                                                  01449000
AVTSTAIN EQU   AVTBIT3                                                  01450000
AVTSTAYN EQU   AVTBIT3                                                  01451000
AVTOLTBN EQU   AVTBIT3                                                  01452000
AVTTSAB  EQU   AVTBIT3                                                  01453000
AVTRFULN EQU   AVTBIT3                                                  01454000
AVTRECVN EQU   AVTBIT3                                                  01455000
@NM00068 EQU   AVTBIT2                                                  01456000
@NM00067 EQU   AVTBIT2                                                  01457000
AVTOPEIN EQU   AVTBIT2                                                  01458000
AVTSTRTN EQU   AVTBIT2                                                  01459000
AVTTOPOL EQU   AVTBIT2                                                  01460000
AVTCOPYN EQU   AVTBIT2                                                  01461000
AVTREUSN EQU   AVTBIT2                                                  01462000
AVTEXTSC EQU   AVTBIT2                                                  01463000
AVTDISKN EQU   AVTBIT1                                                  01464000
AVTQUCKN EQU   AVTBIT1                                                  01465000
AVTCLOSN EQU   AVTBIT1                                                  01466000
AVTREADN EQU   AVTBIT1                                                  01467000
AVTDLAYN EQU   AVTBIT1                                                  01468000
AVTAQTAN EQU   AVTBIT1                                                  01469000
AVTTSON  EQU   AVTBIT1                                                  01470000
AVTAPLKN EQU   AVTBIT1                                                  01471000
AVTDUMBR EQU   IEDQAVTD+1048                                            01472000
AVTDLQX  EQU   IEDQAVTD+1046                                            01473000
AVTINTLV EQU   IEDQAVTD+1044                                            01474000
AVTSMCNT EQU   IEDQAVTD+1042                                            01475000
AVTAVFCT EQU   IEDQAVTD+1040                                            01476000
AVTOPCON EQU   IEDQAVTD+1038                                            01477000
AVTOPCNT EQU   IEDQAVTD+1036                                            01478000
AVTLNCNT EQU   IEDQAVTD+1034                                            01479000
AVTKEYLE EQU   IEDQAVTD+1032                                            01480000
AVTHA16  EQU   IEDQAVTD+1030                                            01481000
AVTHA7   EQU   IEDQAVTD+1028                                            01482000
AVTHA4   EQU   IEDQAVTD+1026                                            01483000
AVTHA3   EQU   IEDQAVTD+1024                                            01484000
AVTHA2   EQU   IEDQAVTD+1022                                            01485000
AVTGETMS EQU   IEDQAVTD+1021                                            01486000
@NM00066 EQU   IEDQAVTD+1020                                            01487000
AVTGETMD EQU   IEDQAVTD+1016                                            01488000
AVTGETMN EQU   IEDQAVTD+1012                                            01489000
AVTCWTOT EQU   IEDQAVTD+1008                                            01490000
AVTCWINT EQU   IEDQAVTD+956                                             01491000
AVTDTRAP EQU   IEDQAVTD+952                                             01492000
@NM00065 EQU   IEDQAVTD+950                                             01493000
@NM00064 EQU   AVTIOTR                                                  01494000
AVTIOTRH EQU   AVTIOTR                                                  01495000
AVTIOTRE EQU   AVTIOTR                                                  01496000
@NM00063 EQU   AVTSUBT                                                  01497000
AVTSUBPT EQU   AVTSUBT                                                  01498000
AVTSUBON EQU   AVTSUBT                                                  01499000
AVTAFE30 EQU   IEDQAVTD+944                                             01500000
AVTAFE20 EQU   IEDQAVTD+940                                             01501000
AVTAFE10 EQU   IEDQAVTD+936                                             01502000
AVTCWEC2 EQU   IEDQAVTD+932                                             01503000
AVTCWPM2 EQU   IEDQAVTD+928                                             01504000
AVTCWTS2 EQU   IEDQAVTD+927                                             01505000
AVTCWTS1 EQU   IEDQAVTD+926                                             01506000
AVTCWCLD EQU   AVTCWFL2                                                 01507000
AVTCWRAP EQU   AVTCWFL2                                                 01508000
@NM00062 EQU   AVTCWFL2                                                 01509000
@NM00061 EQU   AVTCWFL2                                                 01510000
@NM00060 EQU   AVTCWFL2                                                 01511000
@NM00059 EQU   AVTCWFL2                                                 01512000
@NM00058 EQU   AVTCWFL2                                                 01513000
AVTCWACT EQU   AVTCWFL2                                                 01514000
@NM00057 EQU   AVTCWFL1                                                 01515000
@NM00056 EQU   AVTCWFL1                                                 01516000
@NM00055 EQU   AVTCWFL1                                                 01517000
@NM00054 EQU   AVTCWFL1                                                 01518000
@NM00053 EQU   AVTCWFL1                                                 01519000
@NM00052 EQU   AVTCWFL1                                                 01520000
@NM00051 EQU   AVTCWFL1                                                 01521000
AVTCOMWN EQU   AVTCWFL1                                                 01522000
AVTCWEC1 EQU   IEDQAVTD+920                                             01523000
AVTCWPM1 EQU   IEDQAVTD+916                                             01524000
AVTCAREA EQU   IEDQAVTD+912                                             01525000
AVTFZERO EQU   IEDQAVTD+908                                             01526000
AVTCADDR EQU   IEDQAVTD+904                                             01527000
AVTCOREC EQU   IEDQAVTD+900                                             01528000
@NM00050 EQU   IEDQAVTD+892                                             01529000
AVTCPBCB EQU   IEDQAVTD+888                                             01530000
@NM00049 EQU   IEDQAVTD+880                                             01531000
AVTDSIOB EQU   IEDQAVTD+876                                             01532000
@NM00048 EQU   IEDQAVTD+868                                             01533000
AVTCPRMB EQU   IEDQAVTD+864                                             01534000
@NM00047 EQU   IEDQAVTD+856                                             01535000
AVTCLOSB EQU   IEDQAVTD+852                                             01536000
@NM00046 EQU   IEDQAVTD+844                                             01537000
AVTACTIB EQU   IEDQAVTD+840                                             01538000
@NM00045 EQU   IEDQAVTD+836                                             01539000
AVTOLTEB EQU   IEDQAVTD+832                                             01540000
AVTOLTCH EQU   AVTOLTQB+1                                               01541000
AVTOLTVT EQU   AVTOLTQB                                                 01542000
@NM00044 EQU   AVTOPCQB+8                                               01543000
@NM00043 EQU   AVTOPCEC+1                                               01544000
@NM00042 EQU   AVTOPCCC                                                 01545000
AVTOPCPO EQU   AVTOPCCC                                                 01546000
AVTOPCWA EQU   AVTOPCCC                                                 01547000
AVTOPCCH EQU   AVTOPCOB+1                                               01548000
AVTOPCVT EQU   AVTOPCOB                                                 01549000
@NM00041 EQU   AVTCKPQB+9                                               01550000
AVTCKPTS EQU   AVTCKPQB+8                                               01551000
@NM00040 EQU   AVTCKPEC+1                                               01552000
@NM00039 EQU   AVTCKPCC                                                 01553000
AVTCKPPO EQU   AVTCKPCC                                                 01554000
AVTCKPWA EQU   AVTCKPCC                                                 01555000
AVTCKPCH EQU   AVTCKPTB+1                                               01556000
AVTCKPVT EQU   AVTCKPTB                                                 01557000
@NM00038 EQU   IEDQAVTD+796                                             01558000
AVTBFRTB EQU   IEDQAVTD+792                                             01559000
@NM00037 EQU   IEDQAVTD+784                                             01560000
AVTBFREB EQU   IEDQAVTD+780                                             01561000
AVTTIMQ  EQU   IEDQAVTD+776                                             01562000
@NM00036 EQU   IEDQAVTD+772                                             01563000
AVTIMQPS EQU   IEDQAVTD+768                                             01564000
AVTINOUT EQU   IEDQAVTD+766                                             01565000
AVTREFTM EQU   IEDQAVTD+764                                             01566000
@NM00035 EQU   IEDQAVTD+752                                             01567000
AVTDELYB EQU   IEDQAVTD+748                                             01568000
AVTOCQPT EQU   IEDQAVTD+744                                             01569000
AVTTSOPT EQU   IEDQAVTD+740                                             01570000
AVTSUPPT EQU   IEDQAVTD+736                                             01571000
AVTCBQCB EQU   IEDQAVTD+732                                             01572000
AVTMSGS  EQU   IEDQAVTD+729                                             01573000
@NM00034 EQU   AVTSYSER                                                 01574000
@NM00033 EQU   AVTSYSER                                                 01575000
@NM00032 EQU   AVTSYSER                                                 01576000
@NM00031 EQU   AVTSYSER                                                 01577000
@NM00030 EQU   AVTSYSER                                                 01578000
@NM00029 EQU   AVTSYSER                                                 01579000
AVTCMAXN EQU   AVTSYSER                                                 01580000
AVTCMINN EQU   AVTSYSER                                                 01581000
AVT2260L EQU   IEDQAVTD+724                                             01582000
AVTABEPL EQU   AVTADBUF                                                 01583000
AVTHFF   EQU   AVTCLRHI+2                                               01584000
@NM00028 EQU   AVTCLRHI                                                 01585000
AVTCCLNK EQU   AVTCRELE+5                                               01586000
AVTCCPRI EQU   AVTCRELE+4                                               01587000
AVTCCQCB EQU   AVTCCELE+1                                               01588000
AVTCCKEY EQU   AVTCCELE                                                 01589000
AVTDELAD EQU   IEDQAVTD+704                                             01590000
AVTDELEM EQU   IEDQAVTD+700                                             01591000
AVTBSX   EQU   AVTCKLNK                                                 01592000
AVTOPETR EQU   AVTHG01                                                  01593000
@NM00027 EQU   AVTCKBYT                                                 01594000
AVTCKONQ EQU   AVTCKBYT                                                 01595000
@NM00026 EQU   AVTCKBYT                                                 01596000
@NM00025 EQU   AVTCKBYT                                                 01597000
@NM00024 EQU   AVTCKBYT                                                 01598000
@NM00023 EQU   AVTCKBYT                                                 01599000
@NM00022 EQU   AVTCKBYT                                                 01600000
@NM00021 EQU   AVTCKBYT                                                 01601000
AVTOPERT EQU   IEDQAVTD+690                                             01602000
AVTOPXCL EQU   IEDQAVTD+688                                             01603000
AVTOPERL EQU   IEDQAVTD+687                                             01604000
@NM00020 EQU   IEDQAVTD+686                                             01605000
AVTCKTIM EQU   IEDQAVTD+684                                             01606000
AVTCKELV EQU   IEDQAVTD+682                                             01607000
AVTCPRCD EQU   IEDQAVTD+681                                             01608000
AVTWARMN EQU   AVTCKELF                                                 01609000
AVTCRTLN EQU   AVTCKELF                                                 01610000
AVTCPIPN EQU   AVTCKELF                                                 01611000
AVTCCLCN EQU   AVTCKELF                                                 01612000
AVTCINCN EQU   AVTCKELF                                                 01613000
@NM00019 EQU   AVTCKELF                                                 01614000
AVTCMCPN EQU   AVTCKELF                                                 01615000
AVTCRDYN EQU   AVTCKELF                                                 01616000
AVTCKQAD EQU   IEDQAVTD+677                                             01617000
AVTSCBSZ EQU   IEDQAVTD+676                                             01618000
@NM00018 EQU   IEDQAVTD+672                                             01619000
AVTCKELE EQU   IEDQAVTD+668                                             01620000
@NM00017 EQU   AVTCKPEL+8                                               01621000
AVTCKRLK EQU   AVTCKPEL+5                                               01622000
AVTCKRPR EQU   AVTCKPEL+4                                               01623000
AVTCKRMQ EQU   AVTCKRMV+1                                               01624000
AVTCKRKY EQU   AVTCKRMV                                                 01625000
AVTHK    EQU   IEDQAVTD+648                                             01626000
AVTHI    EQU   IEDQAVTD+644                                             01627000
AVTIOT   EQU   IEDQAVTD+640                                             01628000
AVTNX    EQU   IEDQAVTD+636                                             01629000
AVTTONE  EQU   IEDQAVTD+632                                             01630000
AVTA3TL  EQU   IEDQAVTD+628                                             01631000
AVTDMECB EQU   IEDQAVTD+624                                             01632000
AVTABEND EQU   IEDQAVTD+618                                             01633000
AVTPLCBN EQU   IEDQAVTD+616                                             01634000
@NM00016 EQU   AVTSAVTP+1                                               01635000
@NM00015 EQU   AVTSAVTF                                                 01636000
AVTSNA   EQU   AVTSAVTF                                                 01637000
AVTONSNA EQU   AVTSAVTF                                                 01638000
AVTVTMCP EQU   AVTSAVTF                                                 01639000
@NM00014 EQU   IEDQAVTD+608                                             01640000
AVTCMBSS EQU   IEDQAVTD+604                                             01641000
AVTRCV   EQU   IEDQAVTD+600                                             01642000
AVTSEND  EQU   IEDQAVTD+596                                             01643000
AVTCSCH  EQU   IEDQAVTD+592                                             01644000
AVTQ1    EQU   IEDQAVTD+588                                             01645000
AVTE7    EQU   IEDQAVTD+584                                             01646000
AVTHB    EQU   IEDQAVTD+580                                             01647000
AVTR1    EQU   IEDQAVTD+576                                             01648000
AVTBZ    EQU   IEDQAVTD+572                                             01649000
AVTEZ    EQU   IEDQAVTD+568                                             01650000
AVTEC    EQU   IEDQAVTD+564                                             01651000
AVTEW    EQU   IEDQAVTD+560                                             01652000
AVTNDIAL EQU   AVTSCOPT                                                 01653000
AVTN2741 EQU   AVTSCOPT                                                 01654000
AVTCONCO EQU   AVTSCOPT                                                 01655000
AVTCONC  EQU   AVTSCOPT                                                 01656000
AVTCMBUF EQU   AVTSCOPT                                                 01657000
AVTAPDMP EQU   AVTSCOPT                                                 01658000
@NM00013 EQU   AVTSCOPT                                                 01659000
AVTHA    EQU   AVTDISP                                                  01660000
AVTEA    EQU   IEDQAVTD+548                                             01661000
AVTAX    EQU   IEDQAVTD+544                                             01662000
AVTA3    EQU   IEDQAVTD+540                                             01663000
AVTGD    EQU   IEDQAVTD+536                                             01664000
AVTAL    EQU   IEDQAVTD+532                                             01665000
AVTOLTST EQU   AVTHG02                                                  01666000
AVTE8    EQU   IEDQAVTD+524                                             01667000
AVTUI    EQU   IEDQAVTD+520                                             01668000
AVTCOMPT EQU   IEDQAVTD+516                                             01669000
AVTCRSRF EQU   IEDQAVTD+512                                             01670000
@NM00012 EQU   IEDQAVTD+508                                             01671000
AVTKA02  EQU   IEDQAVTD+504                                             01672000
AVTOPTPT EQU   IEDQAVTD+500                                             01673000
AVTPCBPT EQU   IEDQAVTD+496                                             01674000
AVTOSECB EQU   IEDQAVTD+492                                             01675000
AVTOPECA EQU   IEDQAVTD+488                                             01676000
AVTOLECA EQU   IEDQAVTD+484                                             01677000
AVTCKECA EQU   IEDQAVTD+480                                             01678000
AVTCWECA EQU   IEDQAVTD+476                                             01679000
AVTCWTCB EQU   IEDQAVTD+472                                             01680000
AVTOLTCB EQU   IEDQAVTD+468                                             01681000
AVTOCTCB EQU   IEDQAVTD+464                                             01682000
AVTCKTCB EQU   IEDQAVTD+460                                             01683000
AVTAS    EQU   IEDQAVTD+456                                             01684000
AVTNOLBF EQU   IEDQAVTD+454                                             01685000
AVTNCKPR EQU   IEDQAVTD+453                                             01686000
AVTCIB   EQU   IEDQAVTD+452                                             01687000
AVTSPLPT EQU   IEDQAVTD+448                                             01688000
AVTMVBFR EQU   IEDQAVTD+444                                             01689000
AVTSBTA  EQU   IEDQAVTD+440                                             01690000
AVTRARTN EQU   IEDQAVTD+436                                             01691000
AVTBSCAN EQU   IEDQAVTD+432                                             01692000
AVTRDYA  EQU   IEDQAVTD+428                                             01693000
AVTDISTR EQU   IEDQAVTD+420                                             01694000
AVTPARM3 EQU   IEDQAVTD+416                                             01695000
@NM00011 EQU   AVTPKF                                                   01696000
@NM00010 EQU   AVTPKF                                                   01697000
@NM00009 EQU   AVTPKF                                                   01698000
AVTFTCHF EQU   AVTPKF                                                   01699000
@NM00008 EQU   AVTPKF                                                   01700000
@NM00007 EQU   AVTPKF                                                   01701000
@NM00006 EQU   AVTPKF                                                   01702000
@NM00005 EQU   AVTPKF                                                   01703000
AVTPARM  EQU   IEDQAVTD+408                                             01704000
AVTEXS2A EQU   IEDQAVTD+402                                             01705000
AVTEXA2S EQU   IEDQAVTD+396                                             01706000
AVTOCGET EQU   IEDQAVTD+392                                             01707000
AVTCKAVT EQU   @NM00003+1                                               01708000
@NM00004 EQU   AVTCKFLG                                                 01709000
AVTCKHLT EQU   AVTCKFLG                                                 01710000
AVTCKREQ EQU   AVTCKFLG                                                 01711000
AVTCKENV EQU   AVTCKFLG                                                 01712000
AVTCKNAC EQU   AVTCKFLG                                                 01713000
AVTCKTAC EQU   AVTCKFLG                                                 01714000
@NM00002 EQU   IEDQAVTD+384                                             01715000
AVTREADD EQU   IEDQAVTD+380                                             01716000
AVTREADY EQU   IEDQAVTD+376                                             01717000
AVTRACE  EQU   IEDQAVTD+372                                             01718000
AVTTCB   EQU   IEDQAVTD+368                                             01719000
AVTPASWD EQU   IEDQAVTD+360                                             01720000
AVTCTLCH EQU   IEDQAVTD+352                                             01721000
AVTDOUBL EQU   IEDQAVTD+344                                             01722000
AVTDOUBX EQU   IEDQAVTD+336                                             01723000
AVTDPARM EQU   IEDQAVTD+332                                             01724000
AVTCSTCS EQU   IEDQAVTD+328                                             01725000
AVTDLQ   EQU   AVTSAVEX+32                                              01726000
@NM00001 EQU   AVTSAVEX                                                 01727000
AVTSAVE4 EQU   IEDQAVTD+216                                             01728000
AVTSAVE3 EQU   IEDQAVTD+144                                             01729000
AVTSAVE2 EQU   IEDQAVTD+72                                              01730000
AVTSAVE1 EQU   IEDQAVTD                                                 01731000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01732000
@PB00007 EQU   @EL00001                                                 01733000
@PB00006 EQU   @PB00007                                                 01734000
@PB00005 EQU   @PB00006                                                 01735000
@PB00004 EQU   @PB00005                                                 01736000
@PB00003 EQU   @PB00004                                                 01737000
@PB00002 EQU   @PB00003                                                 01738000
@ENDDATA EQU   *                                                        01739000
         END   IGCAA10D,(C'PLS2025',0701,76363)                         01740000
