         TITLE 'IGCC110D, 3705 CLEANUP LOAD 2                          *00001000
                        '                                               00002000
IGCC110D CSECT ,                                                01S0001 00003000
@PROLOG  DS    0H                                               01S0002 00004000
*                                                               02S0724 00005000
*   /*****************************************************************/ 00006000
*   /*                                                               */ 00007000
*   /* PROLOGUE: THIS SEGMENT COMPLETES THE PROLOGUE CODE THAT WAS   */ 00008000
*   /* ALTERED BY THE MODULE PROCEDURE STATEMENT.                    */ 00009000
*   /*                                                               */ 00010000
*   /*****************************************************************/ 00011000
*                                                               02S0724 00012000
*   RBASE=REG15;                    /* SET THE CODE BASE REGISTER       00013000
*                                      WITH THE ENTRY POINT ADDRESS     00014000
*                                      OF THE MODULE                 */ 00015000
         LR    RBASE,REG15                                      02S0724 00016000
*   GEN REFS(RBASE) NOSETS;                                     02S0725 00017000
*                                   /*                                  00018000
         USING IGCC110D,RBASE          INFORM THE ASSEMBLER OF THE      00019000
*                                      BASE REGISTER TO BE USED FOR     00020000
*                                      ADDRESSING CODE                  00021000
*   GEN NOREFS NOSETS;                                          02S0726 00022000
*                                   /*                                  00023000
IGCC110D IEDHJN AFTERHJN               MODULE IDENTIFICATION MACRO      00024000
*   RFY                                                         02S0727 00025000
*     REG15 UNRSTD;                 /* RELEASE THE REGISTER     02S0727 00026000
*                                      RESTRICTED AT ENTRY TO THE       00027000
*                                      MODULE THAT WAS USED TO  02S0727 00028000
*                                      CONTAIN THE ENTRY POINT  02S0727 00029000
*                                      ADDRESS OF THE MODULE         */ 00030000
*                                                               02S0728 00031000
*   /*****************************************************************/ 00032000
*   /*                                                               */ 00033000
*   /* PROCESS: THIS SEGMENT DOES THE PROCESSING THAT IS NECESSARY TO*/ 00034000
*   /* PERFORM THE FUNCTION OF THE MODULE.                           */ 00035000
*   /*                                                               */ 00036000
*   /*****************************************************************/ 00037000
*                                                               02S0728 00038000
*                                                               03S0728 00039000
*   /*****************************************************************/ 00040000
*   /*                                                               */ 00041000
*   /* PROCESS.INITIAL: THIS SEGMENT DOES THE INITIAL PROCESSING.    */ 00042000
*   /*                                                               */ 00043000
*   /*****************************************************************/ 00044000
*                                                               03S0728 00045000
*   ROPCAVT=RPARM;                  /* OP CTL AVT BASE               */ 00046000
         LR    ROPCAVT,RPARM                                    03S0728 00047000
*   RAVT=OPCAVTPT;                  /* TCAM AVT BASE                 */ 00048000
         L     RAVT,OPCAVTPT(,ROPCAVT)                          03S0729 00049000
*   RSAVE=ADDR(OPCSAVE);            /* OP CTL SAVE AREA              */ 00050000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          03S0730 00051000
*   ROPCE=OPCCOPCE;                 /* OPCE/CUR BASE                 */ 00052000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         03S0731 00053000
*   OPCMODID=DACDEST;               /* ASSUME EXIT TO DEACTIVATE     */ 00054000
         MVC   OPCMODID(2,ROPCAVT),DACDEST                      02S0732 00055000
*   IF OCELMPRI=PRILOFLG THEN       /* IF A REDRIVE ELEMENT OR IN       00056000
*                                      FROM IGCC010D                 */ 00057000
         CLI   OCELMPRI(ROPCE),X'D0'                            02S0733 00058000
         BNE   @RF00733                                         02S0733 00059000
*     DO;                                                       02S0734 00060000
*                                                               03S0735 00061000
*       /*************************************************************/ 00062000
*       /*                                                           */ 00063000
*       /* PROCESS.RSPSRCH: THIS SEGMENT SEARCHES RESPONSE CHAINS AND*/ 00064000
*       /* GENERATES RESPONSES (NEGATIVE RESPONSES TO FID0 AND PATH  */ 00065000
*       /* ERROR TO FID1) FOR SELECTED OPCES ON THE WAIT CHAINS.     */ 00066000
*       /* THESE RESPONSES ARE TPOSTED TO AVTOPCOB FOR PROCESSING    */ 00067000
*       /*                                                           */ 00068000
*       /*************************************************************/ 00069000
*                                                               03S0735 00070000
*                                                               03S0735 00071000
*       /*************************************************************/ 00072000
*       /*                                                           */ 00073000
*       /* WHEN ENTERED RCUR=@REDRIVE ELEMENT (CUR), CURELEM=@BUFFER */ 00074000
*       /*                                                           */ 00075000
*       /*************************************************************/ 00076000
*                                                               03S0735 00077000
*       RFY                                                     03S0735 00078000
*        (RPRF,                                                 03S0735 00079000
*         RCHAIN) RSTD;                                         03S0735 00080000
*       IF CURNCURE=ON THEN         /* IF REPOST TO IEDNCU REQUESTED    00081000
*                                      ...                   @YM07310*/ 00082000
         TM    CURNCURE(RCUR),B'00010000'                       03S0736 00083000
         BNO   @RF00736                                         03S0736 00084000
*         DO;                       /* ... REPOST THE CUR TO IEDNCU     00085000
*                                                            @YM07310*/ 00086000
*           CURPRI=PRICUREQ;        /* PRIORITY FOR ELEMENT TO IEDNCU*/ 00087000
         MVI   CURPRI(RCUR),X'C4'                               03S0738 00088000
*           CURQCB=SAVTCLUP;        /* QCB                           */ 00089000
         L     @09,AVTSAVTP(,RAVT)                              03S0739 00090000
         MVC   CURQCB(3,RCUR),SAVTCLUP+1(@09)                   03S0739 00091000
*           RPARM=RCUR;             /* PARAMETER TO POST ROUTINE        00092000
*                                                            @XM05700*/ 00093000
         LR    RPARM,RCUR                                       03S0740 00094000
*           CALL TPOSTELM;          /* TPOST ELEMENT TO IEDNCU       */ 00095000
         BAL   @14,TPOSTELM                                     03S0741 00096000
*           OPCMODID=DISPDEST;      /* EXIT TO OP CTL DISPATCHER        00097000
*                                                            @YM07310*/ 00098000
         MVC   OPCMODID(2,ROPCAVT),DISPDEST                     03S0742 00099000
*         END;                      /*                       @YM07310*/ 00100000
*       ELSE                        /*                       @YM07310*/ 00101000
*         DO;                       /*                       @YM07310*/ 00102000
         B     @RC00736                                         03S0744 00103000
@RF00736 DS    0H                                               03S0745 00104000
*           CURPIUCT=0;             /* INITIALIZE PIU POSTED COUNTER */ 00105000
         SLR   @09,@09                                          03S0745 00106000
         STH   @09,CURPIUCT(,RCUR)                              03S0745 00107000
*           IF CURSWCH=CURFDACT THEN/* IF THIS IS A FORCE DEACT ...     00108000
*                                                            @YM07711*/ 00109000
         CLI   CURSWCH(RCUR),X'37'                              03S0746 00110000
         BNE   @RF00746                                         03S0746 00111000
*             RPRF=ADDR(CURTTCIN)-(ADDR(PRFSRCE)-ADDR(IEDQPRF));/*      00112000
*                                      TREAT CUR AS A TEMPORARY 03S0747 00113000
*                                      BUFFER FOR THE SEARCH ROUTINE    00114000
*                                                            @YM07711*/ 00115000
         LA    @09,CURTTCIN(,RCUR)                              03S0747 00116000
         SL    @09,@CF00175                                     03S0747 00117000
         LR    RPRF,@09                                         03S0747 00118000
*           ELSE                    /*                       @YM07711*/ 00119000
*             RPRF=CURELEM;         /* INIT BUFFER STRUCTURE BASE    */ 00120000
         B     @RC00746                                         03S0748 00121000
@RF00746 L     RPRF,CURELEM-1(,RCUR)                            03S0748 00122000
         LA    RPRF,0(,RPRF)                                    03S0748 00123000
*           DO UNTIL                /* LOOP UNTIL ...                */ 00124000
*                 CURF1ID=ON        /* ... END OF CHAIN      @YM07132*/ 00125000
*                 |CURPIUCT=10      /* ... OR 10 PIUS HAVE BEEN 03S0749 00126000
*                                      POSTED TO PATH CONTROL ...    */ 00127000
*                 |CURPIUCT=>(AVTAVFCT/2);/* ... OR PIUS EQUAL TO 1/2   00128000
*                                      THE AVAILABLE UNITS HAVE BEEN    00129000
*                                      POSTED                        */ 00130000
@RC00746 DS    0H                                               03S0749 00131000
@DL00749 DS    0H                                               03S0750 00132000
*             IF OPCWAITN=0         /* IF FID0 RESPONSE WAIT CHAIN IS   00133000
*                                      EMPTY ...                     */ 00134000
*                 |CURF0FIN=ON THEN /* ... OR FINISHED PROCESSING       00135000
*                                      FID0                          */ 00136000
         L     @09,OPCWAITN(,ROPCAVT)                           03S0750 00137000
         LTR   @09,@09                                          03S0750 00138000
         BZ    @RT00750                                         03S0750 00139000
         TM    CURF0FIN(RCUR),B'10000000'                       03S0750 00140000
         BNO   @RF00750                                         03S0750 00141000
@RT00750 DS    0H                                               03S0751 00142000
*               DO;                                             03S0751 00143000
*                 IF OPCSCNC=0      /* IF FID1 (SEQUENCED) RESPONSE     00144000
*                                      WAIT CHAIN EMPTY ...          */ 00145000
*                     |CURF1SEQ=ON THEN/* ... OR FINISH PROCESSING      00146000
*                                      FID1 SEQUENCED RESPONSE       */ 00147000
         L     @09,OPCSCNC(,ROPCAVT)                            03S0752 00148000
         LTR   @09,@09                                          03S0752 00149000
         BZ    @RT00752                                         03S0752 00150000
         TM    CURF1SEQ(RCUR),B'01000000'                       03S0752 00151000
         BNO   @RF00752                                         03S0752 00152000
@RT00752 DS    0H                                               03S0753 00153000
*                   DO;                                         03S0753 00154000
*                     IF OPCFMDFC=0 /* IF FID1 (ID) RESPONSE WAIT       00155000
*                                      CHAIN EMPTY ...               */ 00156000
*                         |CURF1ID=ON THEN/* ... OR FINISH PROCESS      00157000
*                                      FID1 ID                       */ 00158000
         L     @09,OPCFMDFC(,ROPCAVT)                           03S0754 00159000
         LTR   @09,@09                                          03S0754 00160000
         BZ    @RT00754                                         03S0754 00161000
         TM    CURF1ID(RCUR),B'00100000'                        03S0754 00162000
         BNO   @RF00754                                         03S0754 00163000
@RT00754 DS    0H                                               03S0755 00164000
*                       DO;                                     03S0755 00165000
*                         CURF1ID=ON;/* SIGNAL ALL CHAINS PROCESSED  */ 00166000
         OI    CURF1ID(RCUR),B'00100000'                        03S0756 00167000
*                         OPCMODID=DACDEST;/* ELIMINATE REPOST FOR      00168000
*                                      RESPONSE HANDLING             */ 00169000
         MVC   OPCMODID(2,ROPCAVT),DACDEST                      03S0757 00170000
*                       END;                                    03S0758 00171000
*                     ELSE          /* PROCESS FID1 ID RESPONSE WAIT    00172000
*                                      CHAIN                         */ 00173000
*                       DO;                                     03S0759 00174000
         B     @RC00754                                         03S0759 00175000
@RF00754 DS    0H                                               03S0760 00176000
*                         RCHAIN=OPCFMDFC;/* INIT WAIT CHAIN PTR     */ 00177000
         L     RCHAIN,OPCFMDFC(,ROPCAVT)                        03S0760 00178000
*                         CALL SEARCH;                          03S0761 00179000
         BAL   @14,SEARCH                                       03S0761 00180000
*                         IF CURENDCH=ON THEN/* IF END OF CHAIN      */ 00181000
         TM    CURENDCH(RCUR),B'00010000'                       03S0762 00182000
         BNO   @RF00762                                         03S0762 00183000
*                           DO;                                 03S0763 00184000
*                             CURF1ID=ON;/* INDICATE FID1 ID RESPONSE   00185000
*                                      WAIT CHAIN FINISH             */ 00186000
         OI    CURF1ID(RCUR),B'00100000'                        03S0764 00187000
*                             OPCMODID=DACDEST;/* ELIMINATE REPOST      00188000
*                                      FOR RESPONSE HANDLING         */ 00189000
         MVC   OPCMODID(2,ROPCAVT),DACDEST                      03S0765 00190000
*                           END;                                03S0766 00191000
*                       END;                                    03S0767 00192000
*                   END;                                        03S0768 00193000
*                 ELSE              /* PROCESS FID1 SEQUENCED   03S0769 00194000
*                                      RESPONSE WAIT CHAIN           */ 00195000
*                   DO;                                         03S0769 00196000
         B     @RC00752                                         03S0769 00197000
@RF00752 DS    0H                                               03S0770 00198000
*                     RCHAIN=OPCSCNC;/* INITIALIZE WAIT CHAIN PTR    */ 00199000
         L     RCHAIN,OPCSCNC(,ROPCAVT)                         03S0770 00200000
*                     CALL SEARCH;                              03S0771 00201000
         BAL   @14,SEARCH                                       03S0771 00202000
*                     IF CURENDCH=ON THEN/* IF END OF CHAIN          */ 00203000
         TM    CURENDCH(RCUR),B'00010000'                       03S0772 00204000
         BNO   @RF00772                                         03S0772 00205000
*                       CURF1SEQ=ON;/* INDICATE FID1 SEQUENCED  03S0773 00206000
*                                      RESPONSE CHAIN FINISH PROC    */ 00207000
         OI    CURF1SEQ(RCUR),B'01000000'                       03S0773 00208000
*                   END;                                        03S0774 00209000
*               END;                                            03S0775 00210000
*             ELSE                  /* PROCESS FID0 RESPONSE WAIT       00211000
*                                      CHAIN                         */ 00212000
*               DO;                                             03S0776 00213000
         B     @RC00750                                         03S0776 00214000
@RF00750 DS    0H                                               03S0777 00215000
*                 RCHAIN=OPCWAITN;  /* INITIALIZE WAIT CHAIN PTR     */ 00216000
         L     RCHAIN,OPCWAITN(,ROPCAVT)                        03S0777 00217000
*                 CALL SEARCH;                                  03S0778 00218000
         BAL   @14,SEARCH                                       03S0778 00219000
*                 IF CURENDCH=ON THEN/* IF END OF CHAIN              */ 00220000
         TM    CURENDCH(RCUR),B'00010000'                       03S0779 00221000
         BNO   @RF00779                                         03S0779 00222000
*                   CURF0FIN=ON;    /* INDICATE FID0 RESPONSE WAIT      00223000
*                                      CHAIN FINISH PROCESS          */ 00224000
         OI    CURF0FIN(RCUR),B'10000000'                       03S0780 00225000
*               END;                                            03S0781 00226000
@RF00779 DS    0H                                               03S0782 00227000
*           END;                                                03S0782 00228000
@RC00750 DS    0H                                               03S0782 00229000
@DE00749 TM    CURF1ID(RCUR),B'00100000'                        03S0782 00230000
         BO    @DC00749                                         03S0782 00231000
         LH    @09,CURPIUCT(,RCUR)                              03S0782 00232000
         C     @09,@CF03101                                     03S0782 00233000
         BE    @DC00749                                         03S0782 00234000
         LH    @10,AVTAVFCT(,RAVT)                              03S0782 00235000
         SRDA  @10,32                                           03S0782 00236000
         D     @10,@CF00065                                     03S0782 00237000
         CR    @09,@11                                          03S0782 00238000
         BL    @DL00749                                         03S0782 00239000
@DC00749 DS    0H                                               03S0783 00240000
*                                                               04S0783 00241000
*           /*********************************************************/ 00242000
*           /*                                                       */ 00243000
*           /* PROCESS.RSPSRCH.DISPO: THIS SEGMENT SCHEDULES         */ 00244000
*           /* DISPOSITION OF THE CUR AND SCHEDULES WHERE- TO-GO     */ 00245000
*           /*                                                       */ 00246000
*           /*********************************************************/ 00247000
*                                                               04S0783 00248000
*           IF CURSWCH=CURFDACT THEN/* IF THIS IS A FORCE DEACT 04S0783 00249000
*                                      REQUEST ...           @YM07711*/ 00250000
         CLI   CURSWCH(RCUR),X'37'                              04S0783 00251000
         BNE   @RF00783                                         04S0783 00252000
*             DO;                   /* ... SET UP TO FORWARD CUR TO     00253000
*                                      IEDNCU IN TCAM TASK   @YM07711*/ 00254000
*               CURPRI=PRICUREQ;    /* SET PROPER PRIORITY   @YM07711*/ 00255000
         MVI   CURPRI(RCUR),X'C4'                               04S0785 00256000
*               RPARM=ADDR(OPCAQCTL);/* ADDRESS OF PARAMETER LIST       00257000
*                                                            @YM07711*/ 00258000
         LA    RPARM,OPCAQCTL(,ROPCAVT)                         04S0786 00259000
*               OPCAQWD1=ROPCE;     /* ADDRESS OF ELEMENT TO    04S0787 00260000
*                                      PARAMETER LIST        @YM07711*/ 00261000
         ST    ROPCE,OPCAQWD1(,ROPCAVT)                         04S0787 00262000
*               OPCAQWD2=ROPCE;     /* ADDRESS OF LAST ELEMENT TO       00263000
*                                      PARAMETER LIST        @YM07711*/ 00264000
         ST    ROPCE,OPCAQWD2(,ROPCAVT)                         04S0788 00265000
*               OPCAQREQ=TPOST;     /* TYPE OF REQUEST = TPOST  04S0789 00266000
*                                                            @YM07711*/ 00267000
         MVI   OPCAQREQ(ROPCAVT),X'0C'                          04S0789 00268000
*               OPCAQRQ2=ENDLIS2;   /* MARK END OF PARAMETER LIST       00269000
*                                                            @YM07711*/ 00270000
         MVI   OPCAQRQ2(ROPCAVT),X'80'                          04S0790 00271000
*               GEN(AQCTL);         /* ISSUE SVC 102         @YM07711*/ 00272000
         AQCTL                                                          00273000
*               OPCMODID=DISPDEST;  /* PROCESSING COMPLETED, EXIT       00274000
*                                                            @YM07711*/ 00275000
         MVC   OPCMODID(2,ROPCAVT),DISPDEST                     04S0792 00276000
*             END;                  /*                       @YM07711*/ 00277000
*           ELSE                    /*                       @YM07711*/ 00278000
*             IF OPCMODID=DISPDEST THEN/* IF EXIT REQUIRED TO   04S0794 00279000
*                                      IGC0010D                      */ 00280000
         B     @RC00783                                         04S0794 00281000
@RF00783 CLC   OPCMODID(2,ROPCAVT),DISPDEST                     04S0794 00282000
         BNE   @RF00794                                         04S0794 00283000
*               DO;                                             04S0795 00284000
*                 CURQCB=ADDR(AVTOPCOB);/* QCB                       */ 00285000
         LA    @09,AVTOPCOB(,RAVT)                              04S0796 00286000
         STCM  @09,7,CURQCB(RCUR)                               04S0796 00287000
*                 RPARM=RCUR;       /* ADDRESS OF ELEMENT TO TPOST   */ 00288000
         LR    RPARM,RCUR                                       04S0797 00289000
*                 CALL TPOSTELM;    /* TPOST ELEMENT TO AVTOPCOB     */ 00290000
         BAL   @14,TPOSTELM                                     04S0798 00291000
*               END;                                            04S0799 00292000
*             ELSE                  /* NO EXIT TO IGC0010D - MEANS      00293000
*                                      ALL CHAINS FINISHED           */ 00294000
*               DO;                                             04S0800 00295000
         B     @RC00794                                         04S0800 00296000
@RF00794 DS    0H                                               04S0801 00297000
*                                                               05S0801 00298000
*                 /***************************************************/ 00299000
*                 /*                                                 */ 00300000
*                 /* PROCESS.RSPSRCH.DISPO.ANSCHANI: THIS SEGMENT    */ 00301000
*                 /* PROCESSES ANS AND/OR CHANNEL INOP CONDITIONS    */ 00302000
*                 /*                                                 */ 00303000
*                 /***************************************************/ 00304000
*                                                               05S0801 00305000
*                 RFY                                           05S0801 00306000
*                  (RRUDATA,                                    05S0801 00307000
*                   RPRF,                                       05S0801 00308000
*                   RLCB) RSTD;     /*                       @YM08988*/ 00309000
*                 RPRF=CURELEM;     /* POINT TO INPUTTED BUFFER      */ 00310000
         L     RPRF,CURELEM-1(,RCUR)                            05S0802 00311000
         LA    RPRF,0(,RPRF)                                    05S0802 00312000
*                 RRUDATA=AVTHDRSZ+ADDR(PRFSUNIT)+PRFISIZE;/* ADDRESS   00313000
*                                      OF RU DATA                    */ 00314000
         LA    RRUDATA,PRFSUNIT(,RPRF)                          05S0803 00315000
         AL    RRUDATA,@CF00452                                 05S0803 00316000
         SLR   @07,@07                                          05S0803 00317000
         IC    @07,PRFISIZE(,RPRF)                              05S0803 00318000
         ALR   RRUDATA,@07                                      05S0803 00319000
*                 RFY                                           05S0804 00320000
*                   IEDRH BASED(ADDR(PRF1RH));                  05S0804 00321000
*                 IF TRHSDI=ON THEN /* IF SENSE DATA INCLUDED        */ 00322000
         LR    @07,RPRF                                         05S0805 00323000
         AL    @07,@CF03163                                     05S0805 00324000
         TM    TRHSDI(@07),B'00000100'                          05S0805 00325000
         BNO   @RF00805                                         05S0805 00326000
*                   RRUDATA=RRUDATA+4;/* ADJUST START OF RUDATA      */ 00327000
         AL    RRUDATA,@CF00256                                 05S0806 00328000
*                 RFY                                           05S0807 00329000
*                   IEDRH BASED;                                05S0807 00330000
@RF00805 DS    0H                                               05S0808 00331000
*                 RTRM=CURTRM-LENGTH(IEDNTRM);/* TRM ADDRESS         */ 00332000
         L     RTRM,CURTRM(,RCUR)                               05S0808 00333000
         SL    RTRM,@CF02443                                    05S0808 00334000
*                 IF TRMTYPE=TRMLNCP THEN/* ANS OR INOP FOR NCP (CHAN   00335000
*                                      INOP)                         */ 00336000
         CLI   TRMTYPE(RTRM),X'0F'                              05S0809 00337000
         BNE   @RF00809                                         05S0809 00338000
*                   DO;                                         05S0810 00339000
*                     IF RUDATA3=INOP THEN/* IF INOP ON THE NCP ...     00340000
*                                                            @YM07712*/ 00341000
         CLC   RUDATA3(3,RRUDATA),INOP                          05S0811 00342000
         BNE   @RF00811                                         05S0811 00343000
*                       CURSWCH=CURCINOP;/* ... INDICATE INOP TO        00344000
*                                      IEDNCU                @YM07712*/ 00345000
         MVI   CURSWCH(RCUR),X'38'                              05S0812 00346000
*                     ELSE          /* ELSE ITS ANS          @YM07712*/ 00347000
*                       CURSWCH=CURCUREQ;/* INDICATE ANS TO IEDNCU      00348000
*                                                            @YM07712*/ 00349000
         B     @RC00811                                         05S0813 00350000
@RF00811 MVI   CURSWCH(RCUR),X'39'                              05S0813 00351000
*                     CALL GETLCBNA;                            05S0814 00352000
@RC00811 BAL   @14,GETLCBNA                                     05S0814 00353000
*                                                               06S0815 00354000
*                     /***********************************************/ 00355000
*                     /*                                             */ 00356000
*                     /* PROCESS.RSPSRCH.DISPO.ANSCHANI.SETREQST:    */ 00357000
*                     /* THIS SEGMENT SETS IPL - DUMP - ACTIVATE -   */ 00358000
*                     /* DEACTIVATE REQUESTS AS NEEDED               */ 00359000
*                     /*                                             */ 00360000
*                     /***********************************************/ 00361000
*                                                               06S0815 00362000
*                     RFY                                       06S0815 00363000
*                      (REG15,                                  06S0815 00364000
*                       REG00) RSTD;/*                       @YM08988*/ 00365000
*                     LCBDACRQ=ON;  /* SET DEACTIVATE REQUEST        */ 00366000
         OI    LCBDACRQ(RLCB),B'01000000'                       06S0816 00367000
*                     TRMINOP=ON;   /* FORCE IDENTICAL PROCESSING FOR   00368000
*                                      ANSC AND INOP         @YM08120*/ 00369000
         OI    TRMINOP(RTRM),B'10000000'                        06S0817 00370000
*                     IF(LCBUSUC=ON&LCBEQUCK=ON)|/* IF EQUIPMENT        00371000
*                                      CHECK OR ..           @ZM47867*/ 00372000
*                         (LCBSIOC1=ON&LCBSIOC2=ON) THEN/* IF SIO       00373000
*                                      COND CODE 3           @ZM47856*/ 00374000
         TM    LCBUSUC(RLCB),B'00000010'                        06S0818 00375000
         BNO   @GL00006                                         06S0818 00376000
         TM    LCBEQUCK(RLCB),B'00010000'                       06S0818 00377000
         BO    @RT00818                                         06S0818 00378000
@GL00006 TM    LCBSIOC1(RLCB),B'00110000'                       06S0818 00379000
         BNO   @RF00818                                         06S0818 00380000
@RT00818 DS    0H                                               06S0819 00381000
*                       DO;         /*                       @ZM47856*/ 00382000
*                         LCBACTRQ=OFF;/* TURN OFF ACTIVATE REQUEST     00383000
*                                      FLAG                  @ZM47856*/ 00384000
*                         LCBIPLRQ=OFF;/* TURN OFF IPL REQUEST FLAG     00385000
*                                                            @ZM47856*/ 00386000
*                         LCBDMPRQ=OFF;/* TURN OFF DUMP REQUEST FLAG    00387000
*                                                             @ZM4756*/ 00388000
         NI    LCBACTRQ(RLCB),B'01001111'                       06S0822 00389000
*                       END;        /* ZM47856                       */ 00390000
*                     ELSE          /* ZM47856                       */ 00391000
*                       DO;         /* ZM47856                       */ 00392000
         B     @RC00818                                         06S0824 00393000
@RF00818 DS    0H                                               06S0825 00394000
*                         IF TRMSYGEN=ON THEN/* IF ACTIVE=YES   06S0825 00395000
*                                                            @YM08445*/ 00396000
         TM    TRMSYGEN(RTRM),B'00100000'                       06S0825 00397000
         BNO   @RF00825                                         06S0825 00398000
*                           LCBACTRQ=ON;/* REQUEST ACTIVATE          */ 00399000
         OI    LCBACTRQ(RLCB),B'00010000'                       06S0826 00400000
*                         REG00=TRMNCPIM;/* MASK                     */ 00401000
@RF00825 LA    REG00,8                                          06S0827 00402000
*                         RPARM=RTRM+LENGTH(IEDNTRM);/* TTE ADDRESS     00403000
*                                      IS PARAMETER          @YM08004*/ 00404000
         LA    RPARM,14                                         06S0828 00405000
         ALR   RPARM,RTRM                                       06S0828 00406000
*                         CALL IEDQTL;                          06S0829 00407000
         L     @15,AVTDDFT(,RAVT)                               06S0829 00408000
         BALR  @14,@15                                          06S0829 00409000
*                         RFY                                   06S0830 00410000
*                           IEDNCP BASED(REG15);                06S0830 00411000
*                         IF CURSWCH=CURCINOP/* IF INOP ...  @YM08120*/ 00412000
*                             &(LCBINTRQ=ON/* ... AND IPL REQUIRED      00413000
*                                      ...                           */ 00414000
*                             |LCBNOTIN=ON) THEN/* ... OR       06S0831 00415000
*                                      INTERVENTION REQUIRED         */ 00416000
         CLI   CURSWCH(RCUR),X'38'                              06S0831 00417000
         BNE   @RF00831                                         06S0831 00418000
         TM    LCBINTRQ(RLCB),B'01000010'                       06S0831 00419000
         BZ    @RF00831                                         06S0831 00420000
*                           DO;                                 06S0832 00421000
*                             NCPIPLD=OFF;/* RESET IPLED FLAG        */ 00422000
         NI    NCPIPLD(REG15),B'11110111'                       06S0833 00423000
*                             IF NCPDAUTO=ON THEN/* IF AUTO DUMP        00424000
*                                      SPECIFIED                     */ 00425000
         TM    NCPDAUTO(REG15),B'01000000'                      06S0834 00426000
         BNO   @RF00834                                         06S0834 00427000
*                               LCBDMPRQ=ON;/* REQUEST DUMP          */ 00428000
         OI    LCBDMPRQ(RLCB),B'10000000'                       06S0835 00429000
*                             IF NCPIAUTO=ON THEN/* IF AUTO IPL 06S0836 00430000
*                                      SPECIFIED                     */ 00431000
@RF00834 TM    NCPIAUTO(REG15),B'10000000'                      06S0836 00432000
         BNO   @RF00836                                         06S0836 00433000
*                               LCBIPLRQ=ON;/* REQUEST IPL           */ 00434000
         OI    LCBIPLRQ(RLCB),B'00100000'                       06S0837 00435000
*                             ELSE                              06S0838 00436000
*                               LCBACTRQ=OFF;/* RESET ACTIVATE  06S0838 00437000
*                                      REQUEST                       */ 00438000
         B     @RC00836                                         06S0838 00439000
@RF00836 NI    LCBACTRQ(RLCB),B'11101111'                       06S0838 00440000
*                           END;                                06S0839 00441000
@RC00836 DS    0H                                               06S0840 00442000
*                         RFY                                   06S0840 00443000
*                           IEDNCP BASED;                       06S0840 00444000
@RF00831 DS    0H                                               06S0841 00445000
*                       END;        /*                       @ZM47856*/ 00446000
*                     RFY                                       06S0842 00447000
*                      (REG15,                                  06S0842 00448000
*                       REG00) UNRSTD;/*                     @YM08988*/ 00449000
@RC00818 DS    0H                                               06S0843 00450000
*                     IF LCBDMPRQ=ON THEN/* IF 3705 DUMP WAS    05S0843 00451000
*                                      REQUESTED                     */ 00452000
         TM    LCBDMPRQ(RLCB),B'10000000'                       05S0843 00453000
         BNO   @RF00843                                         05S0843 00454000
*                       DO;                                     05S0844 00455000
*                                                               06S0845 00456000
*                         /*******************************************/ 00457000
*                         /*                                         */ 00458000
*                         /* PROCESS.RSPSRCH.DISPO.ANSCHANI.INVOKDMP:*/ 00459000
*                         /* THIS SEGMENT BUILDS AN OPCE AS INPUT TO */ 00460000
*                         /* THE IPL/DUMP PROCESSOR TO INVOKE A DUMP */ 00461000
*                         /* OF THE 3705                             */ 00462000
*                         /*                                         */ 00463000
*                         /*******************************************/ 00464000
*                                                               06S0845 00465000
*                         RFY                                   06S0845 00466000
*                           REG00 RSTD;                         06S0845 00467000
*                         RPARM=RCUR;/* ADDRESS OF UNIT TO BUILD OPCE   00468000
*                                                            @YM09048*/ 00469000
         LR    RPARM,RCUR                                       06S0846 00470000
*                         REG00=0;  /* SIGNAL LCB OK                 */ 00471000
         SLR   REG00,REG00                                      06S0847 00472000
*                         CALL OPCEBLD;                         06S0848 00473000
         BAL   @14,OPCEBLD                                      06S0848 00474000
*                         OCSWITCH=OCDMPC;/* IDENTIFY DUMP REQUEST TO   00475000
*                                      IGCMH10D                      */ 00476000
         MVI   OCSWITCH(ROPCE),X'0A'                            06S0849 00477000
*                         OCWTG=''B;/* CLEAR WHERE TO GO FIELD       */ 00478000
         XC    OCWTG(2,ROPCE),OCWTG(ROPCE)                      06S0850 00479000
*                         RPARM=OCTRMTBL;/* TTCIN FOR ROUTINE   06S0851 00480000
*                                                            @YM08988*/ 00481000
         LH    RPARM,OCTRMTBL(,ROPCE)                           06S0851 00482000
         N     RPARM,@CF03167                                   06S0851 00483000
*                         CALL IEDQTNT;/* FIND TRM           @YM08988*/ 00484000
         L     @15,AVTRNMPT(,RAVT)                              06S0852 00485000
         BALR  @14,@15                                          06S0852 00486000
*                         RTRM=RPARM-LENGTH(IEDNTRM);/* BACK UP TO      00487000
*                                      BEGINNING             @YM08988*/ 00488000
         LA    @07,14                                           06S0853 00489000
         LR    RTRM,RPARM                                       06S0853 00490000
         SLR   RTRM,@07                                         06S0853 00491000
*                         RFY                                   06S0854 00492000
*                           IEDCUREQ BASED(RPARM);/* RESET BASE FOR     00493000
*                                      CUR ELEM              @YM08988*/ 00494000
*                         RPARM=RPRF;/* UNIT FOR THE CLEANUP REQUEST    00495000
*                                      ELEMENT               @YM09048*/ 00496000
         LR    RPARM,RPRF                                       06S0855 00497000
*                         OPCECLR=''B;/* CLEAR ENTIRE UNIT   @YM09048*/ 00498000
         LR    @15,RPARM                                        06S0856 00499000
         AL    @15,@CF03163                                     06S0856 00500000
         XC    OPCECLR(64,@15),OPCECLR(@15)                     06S0856 00501000
*                         CURSWCH=CURCINOP;/* SWITCH SETTING @YM08988*/ 00502000
         MVI   CURSWCH(RPARM),X'38'                             06S0857 00503000
*                         CURFLG2=0;/* CLEAR FLAG            @YM08988*/ 00504000
         MVI   CURFLG2(RPARM),X'00'                             06S0858 00505000
*                         CURTTCIN=OCTRMTBL;/* TTCIN         @YM08988*/ 00506000
         LH    @15,OCTRMTBL(,ROPCE)                             06S0859 00507000
         N     @15,@CF03167                                     06S0859 00508000
         STH   @15,CURTTCIN(,RPARM)                             06S0859 00509000
*                         CURTRM=RTRM+LENGTH(IEDNTRM);/* TTE BASE       00510000
*                                                            @YM08988*/ 00511000
         ALR   @07,RTRM                                         06S0860 00512000
         ST    @07,CURTRM(,RPARM)                               06S0860 00513000
*                         CURPRI=PRICUREQ;/* PRIORITY FOR ELEMENT TO    00514000
*                                      IEDNCU                @YM08988*/ 00515000
         MVI   CURPRI(RPARM),X'C4'                              06S0861 00516000
*                         CURQCB=SAVTCLUP;/* QCB             @YM08988*/ 00517000
         L     @07,AVTSAVTP(,RAVT)                              06S0862 00518000
         MVC   CURQCB(3,RPARM),SAVTCLUP+1(@07)                  06S0862 00519000
*                         CALL TPOSTELM;/* TPOST ELEMENT TO IEDNCU      00520000
*                                                            @YM08988*/ 00521000
         BAL   @14,TPOSTELM                                     06S0863 00522000
*                         RFY                                   06S0864 00523000
*                           IEDCUREQ BASED(RCUR);/* RESET BASE  06S0864 00524000
*                                                            @YM08988*/ 00525000
*                         RFY                                   06S0865 00526000
*                           REG00 UNRSTD;                       06S0865 00527000
*                         OPCMODID=DMPDEST;/* SCHEDULE EXIT TO DUMP     00528000
*                                      PROCESSOR                     */ 00529000
         MVC   OPCMODID(2,ROPCAVT),DMPDEST                      05S0866 00530000
*                       END;                                    05S0867 00531000
*                   END;                                        05S0868 00532000
@RF00843 DS    0H                                               05S0869 00533000
*               END;                                            04S0869 00534000
@RF00809 DS    0H                                               04S0870 00535000
*         END;                      /*                       @YM07310*/ 00536000
@RC00794 DS    0H                                               03S0870 00537000
@RC00783 DS    0H                                               03S0871 00538000
*       RFY                                                     03S0871 00539000
*        (RPRF,                                                 03S0871 00540000
*         RCHAIN) UNRSTD;                                       03S0871 00541000
@RC00736 DS    0H                                               03S0872 00542000
*     END;                                                      02S0872 00543000
*   IF OPCMODID=DISPDEST            /* IF EXIT ...                   */ 00544000
*       |OPCMODID=DMPDEST THEN                                  02S0873 00545000
@RF00733 CLC   OPCMODID(2,ROPCAVT),DISPDEST                     02S0873 00546000
         BE    @RT00873                                         02S0873 00547000
         CLC   OPCMODID(2,ROPCAVT),DMPDEST                      02S0873 00548000
         BE    @RT00873                                         02S0873 00549000
*     ;                             /* ... DETERMINED                */ 00550000
*   ELSE                            /* EXIT NOT DETERMINED           */ 00551000
*     DO;                                                       02S0875 00552000
*       RFY                                                     02S0876 00553000
*        (RRUDATA) RSTD;            /*                       @YM08988*/ 00554000
*       IF OCELMPRI=PRICULCB|       /* IF RETURN ...         @YM07783*/ 00555000
*           OCSWITCH=OCTOFC THEN    /* ... FROM DEACTIVATE   @YM08004*/ 00556000
         CLI   OCELMPRI(ROPCE),X'C0'                            02S0877 00557000
         BE    @RT00877                                         02S0877 00558000
         CLI   OCSWITCH(ROPCE),X'23'                            02S0877 00559000
         BNE   @RF00877                                         02S0877 00560000
@RT00877 DS    0H                                               02S0878 00561000
*         DO;                                                   02S0878 00562000
*                                                               03S0879 00563000
*           /*********************************************************/ 00564000
*           /*                                                       */ 00565000
*           /* PROCESS.LOWIN: THIS SEGMENT PROCESSES THE LOW PRIORITY*/ 00566000
*           /* CLEANUP REQUEST ELEMENT THAT IS ATTACHED TO THE INPUT */ 00567000
*           /* OPCE ONLY FROM NCP DEACTIVATION THAT SIGNALS TCAM TASK*/ 00568000
*           /* CLEANUP AND DEACTIVATE COMPLETE. WHEN ENTERED,        */ 00569000
*           /* OPCCOPCE=ADDRESS OF OPCE, OCUNIT=ADDRESS OF CLEANUP   */ 00570000
*           /* REQUEST ELEMENT.                              @ZM45403*/ 00571000
*           /*                                                       */ 00572000
*           /*********************************************************/ 00573000
*                                                               03S0879 00574000
*           RFY                                                 03S0879 00575000
*             IEDQOPCE BASED(OPCCOPCE);                         03S0879 00576000
*           RFY                                                 03S0880 00577000
*            (RLCB,                                             03S0880 00578000
*             REG00) RSTD;          /*                       @YM08988*/ 00579000
*           OPCMODID=DISPDEST;      /* ASSUME EXIT TO IGC0010D       */ 00580000
         MVC   OPCMODID(2,ROPCAVT),DISPDEST                     03S0881 00581000
*           RPARM=OCTRMTBL;         /* GET TTCIN FROM OPCE   @ZM45403*/ 00582000
         L     @15,OPCCOPCE(,ROPCAVT)                           03S0882 00583000
         LH    RPARM,OCTRMTBL(,@15)                             03S0882 00584000
         N     RPARM,@CF03167                                   03S0882 00585000
*           CALL IEDQTNT;           /* GO GET TTE ADDR       @ZM45403*/ 00586000
         L     @15,AVTRNMPT(,RAVT)                              03S0883 00587000
         BALR  @14,@15                                          03S0883 00588000
*           RTRM=RPARM-LENGTH(IEDNTRM);/* SET UP BASE REG CORRECTLY     00589000
*                                                            @ZM46793*/ 00590000
         LR    RTRM,RPARM                                       03S0884 00591000
         SL    RTRM,@CF02443                                    03S0884 00592000
*           IF TRMTYPE=TRMLNCP THEN /* IF INOP/ANS ON THE NCP ...       00593000
*                                                            @YM07829*/ 00594000
         CLI   TRMTYPE(RTRM),X'0F'                              03S0885 00595000
         BNE   @RF00885                                         03S0885 00596000
*             DO;                   /* PROCESS ANY IPL OR ACTIVATE      00597000
*                                      REQUEST PENDING       @YM07829*/ 00598000
*               RCUR=OCUNIT;        /* CUR ADDRESSABILITY    @ZM45403*/ 00599000
         L     @15,OPCCOPCE(,ROPCAVT)                           03S0887 00600000
         L     RCUR,OCUNIT(,@15)                                03S0887 00601000
*               CALL GETLCB;                                    03S0888 00602000
         BAL   @14,GETLCB                                       03S0888 00603000
*               LCBDACRQ=OFF;       /* RESET DEACTIVATE REQUEST      */ 00604000
         NI    LCBDACRQ(RLCB),B'10111111'                       03S0889 00605000
*               IF LCBIPLRQ=ON THEN /* IF AN IPL REQUESTED   @YM07829*/ 00606000
         TM    LCBIPLRQ(RLCB),B'00100000'                       03S0890 00607000
         BNO   @RF00890                                         03S0890 00608000
*                 DO;                                           03S0891 00609000
*                   OCSWITCH=OCIPLC;/* IDENTIFY OPCE TO IPL          */ 00610000
         L     @15,OPCCOPCE(,ROPCAVT)                           03S0892 00611000
         MVI   OCSWITCH(@15),X'11'                              03S0892 00612000
*                   OCWTG=''B;      /* NO RETURN                     */ 00613000
         XC    OCWTG(2,@15),OCWTG(@15)                          03S0893 00614000
*                   OPCMODID=DMPDEST;/* SCHEDULE XCTL TO IPL         */ 00615000
         MVC   OPCMODID(2,ROPCAVT),DMPDEST                      03S0894 00616000
*                 END;                                          03S0895 00617000
*               ELSE                                            03S0896 00618000
*                 IF LCBACTRQ=ON THEN/* IF AN ACTIVATE REQUESTED        00619000
*                                                            @YM07829*/ 00620000
         B     @RC00890                                         03S0896 00621000
@RF00890 TM    LCBACTRQ(RLCB),B'00010000'                       03S0896 00622000
         BNO   @RF00896                                         03S0896 00623000
*                   DO;                                         03S0897 00624000
*                     OCSWITCH=OCTOFA;/* IDENTIFY OPCE TO ACTIVATE   */ 00625000
         L     @15,OPCCOPCE(,ROPCAVT)                           03S0898 00626000
         MVI   OCSWITCH(@15),X'22'                              03S0898 00627000
*                     OCWTG=''B;    /* NO ROUTING NEEDED             */ 00628000
         XC    OCWTG(2,@15),OCWTG(@15)                          03S0899 00629000
*                     OPCMODID=ACTDEST;/* SCHEDULE XCTL TO IGCFA10D  */ 00630000
         MVC   OPCMODID(2,ROPCAVT),ACTDEST                      03S0900 00631000
*                   END;                                        03S0901 00632000
*               RPARM=RCUR;         /* ADDRESS OF ELEMENT TO FREE       00633000
*                                                            @YM08988*/ 00634000
@RF00896 DS    0H                                               03S0902 00635000
@RC00890 LR    RPARM,RCUR                                       03S0902 00636000
*               RPARM->PRFTIC=PRFINTIC;/* INDICATE LAST UNIT TO FREE    00637000
*                                                            @YM08988*/ 00638000
         MVC   PRFTIC(4,RPARM),@CB01989                         03S0903 00639000
*               IF OPCMODID=DISPDEST THEN/* IF EXIT TO IGC0010D 03S0904 00640000
*                                                            @YM08988*/ 00641000
         CLC   OPCMODID(2,ROPCAVT),DISPDEST                     03S0904 00642000
         BNE   @RF00904                                         03S0904 00643000
*                 DO;               /*                       @YM08988*/ 00644000
*                   IF OCATTACH=ON THEN/* IF ATTACHED OPCE(S)   03S0906 00645000
*                                                            @YM08988*/ 00646000
         L     @15,OPCCOPCE(,ROPCAVT)                           03S0906 00647000
         TM    OCATTACH(@15),B'00000010'                        03S0906 00648000
         BNO   @RF00906                                         03S0906 00649000
*                     OPCNEXT=OCELEM;/* SCHEDULE AS NEXT     @YM08988*/ 00650000
         L     @15,OCELEM(,@15)                                 03S0907 00651000
         ST    @15,OPCNEXT(,ROPCAVT)                            03S0907 00652000
*                   RPARM=OPCCOPCE; /* ADDRESS OF ELEMENT TO FREE TO    00653000
*                                      CHAIN                 @YM08988*/ 00654000
@RF00906 L     RPARM,OPCCOPCE(,ROPCAVT)                         03S0908 00655000
*                   RPARM->PRFTIC=RCUR;/* ADD CUR ELEMENT    @YM08988*/ 00656000
         ST    RCUR,PRFTIC(,RPARM)                              03S0909 00657000
*                 END;              /*                       @YM08988*/ 00658000
*               ELSE                /* ELSE AN IPL IS TO BE DONE        00659000
*                                                            @YM08988*/ 00660000
*                 OCUNIT=PRFINTIC;  /* INITIALIZE OPCE TIC FIELD        00661000
*                                                            @YM08988*/ 00662000
         B     @RC00904                                         03S0911 00663000
@RF00904 L     @15,OPCCOPCE(,ROPCAVT)                           03S0911 00664000
         MVC   OCUNIT(4,@15),@CF01989                           03S0911 00665000
*               CALL FREEBUFF;      /*                       @YM08988*/ 00666000
@RC00904 L     @15,OPCFREBF(,ROPCAVT)                           03S0912 00667000
         BALR  @14,@15                                          03S0912 00668000
*             END;                  /*                       @YM07829*/ 00669000
*           ELSE                    /* ELSE THIS IS AN NCP RESOURCE     00670000
*                                      INOP                  @YM07829*/ 00671000
*             DO;                   /* SCHEDULE REACTIVATE OF THIS      00672000
*                                      RESOURCE              @YM07829*/ 00673000
         B     @RC00885                                         03S0914 00674000
@RF00885 DS    0H                                               03S0915 00675000
*               OCSWITCH=OCTOFA;    /* IDENTIFY OPCE TO ACTIVATE     */ 00676000
         L     @15,OPCCOPCE(,ROPCAVT)                           03S0915 00677000
         MVI   OCSWITCH(@15),X'22'                              03S0915 00678000
*               OCWTG=''B;          /* NO ROUTING NEEDED             */ 00679000
         XC    OCWTG(2,@15),OCWTG(@15)                          03S0916 00680000
*               OPCMODID=ACTDEST;   /* SCHEDULE XCTL TO IGCFA10D     */ 00681000
         MVC   OPCMODID(2,ROPCAVT),ACTDEST                      03S0917 00682000
*             END;                  /*                       @YM07829*/ 00683000
*           RFY                                                 03S0919 00684000
*             REG00 UNRSTD;                                     03S0919 00685000
@RC00885 DS    0H                                               03S0920 00686000
*           RFY                                                 03S0920 00687000
*             IEDQOPCE BASED(ROPCE);                            03S0920 00688000
*         END;                                                  02S0921 00689000
*       ELSE                                                    02S0922 00690000
*         DO;                                                   02S0922 00691000
         B     @RC00877                                         02S0922 00692000
@RF00877 DS    0H                                               02S0923 00693000
*                                                               03S0923 00694000
*           /*********************************************************/ 00695000
*           /*                                                       */ 00696000
*           /* PROCESS.SCHDDACT: THIS SEGMENT SCHEDULES DEACTIVATION */ 00697000
*           /* OF EFFECTED RESOURCE AND BUILDS A CLEANUP REQUEST     */ 00698000
*           /* ELEMENT AND TPOSTS IT TO IEDNCU                       */ 00699000
*           /*                                                       */ 00700000
*           /*********************************************************/ 00701000
*                                                               03S0923 00702000
*           RFY                                                 03S0923 00703000
*            (RLCB,                                             03S0923 00704000
*             REG00) RSTD;          /*                       @YM08988*/ 00705000
*           RFY                                                 03S0924 00706000
*             IEDCUREQ BASED(RPARM);                            03S0924 00707000
*           IF OCSWITCH=OCDMPC THEN /* IF INPUT FROM DUMP            */ 00708000
         CLI   OCSWITCH(ROPCE),X'0A'                            03S0925 00709000
         BNE   @RF00925                                         03S0925 00710000
*             DO;                                               03S0926 00711000
*               OCSWITCH=OCTOFC;    /* IDENTIFY OPCE TO DEACTIVATE   */ 00712000
         MVI   OCSWITCH(ROPCE),X'23'                            03S0927 00713000
*               OCWTG=CU2DEST;      /* SCHEDULE RETURN ROUTING       */ 00714000
         MVC   OCWTG(2,ROPCE),CU2DEST                           03S0928 00715000
*               RPARM=1;            /* REQUEST ONE UNIT      @OX19283*/ 00716000
         LA    RPARM,1                                          03S0929 00717000
*               CALL ALLOCBUF;      /* ALLOCATE A CLEANUP REQUEST       00718000
*                                      ELEMENT               @OX19283*/ 00719000
         L     @15,OPCGETBF(,ROPCAVT)                           03S0930 00720000
         BALR  @14,@15                                          03S0930 00721000
*               CURTTCIN=OCTRMTBL;  /* SET UP TTCIN IN CLEANUP ELE      00722000
*                                                            @OX19283*/ 00723000
         LH    @15,OCTRMTBL(,ROPCE)                             03S0931 00724000
         N     @15,@CF03167                                     03S0931 00725000
         STH   @15,CURTTCIN(,RPARM)                             03S0931 00726000
*               ROPCE=RPARM;        /* SAVE ADDR TO CLEANUP ELE 03S0932 00727000
*                                                            @OX19283*/ 00728000
         LR    ROPCE,RPARM                                      03S0932 00729000
*               CURSWCH=CURCINOP;   /* SWITCH SETTING        @OX19283*/ 00730000
         MVI   CURSWCH(RPARM),X'38'                             03S0933 00731000
*               CURFLG2=0;          /* ZERO FLAGS            @OX19283*/ 00732000
         MVI   CURFLG2(RPARM),X'00'                             03S0934 00733000
*               CURFLG3=0;          /* ZERO FLAGS            @OX19283*/ 00734000
         MVI   CURFLG3(RPARM),X'00'                             03S0935 00735000
*               RPARM=CURTTCIN;     /* TTCIN FOR IEDQTNT     @OX19283*/ 00736000
         LR    RPARM,@15                                        03S0936 00737000
*               CALL IEDQTNT;       /* GET TRM ADDRESS       @OX19283*/ 00738000
         L     @15,AVTRNMPT(,RAVT)                              03S0937 00739000
         BALR  @14,@15                                          03S0937 00740000
*               ROPCE->CURTRM=RPARM;/* SAVE TRMADDR FOR NCU  @OX19283*/ 00741000
         ST    RPARM,CURTRM(,ROPCE)                             03S0938 00742000
*               RPARM=ROPCE;        /* RESTORE CLEANUP ELE ADDR 03S0939 00743000
*                                                            @OX19283*/ 00744000
         LR    RPARM,ROPCE                                      03S0939 00745000
*               ROPCE=OPCCOPCE;     /* RESTORE DEACT ELEMENT ADDR       00746000
*                                                            @OX19283*/ 00747000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         03S0940 00748000
*             END;                                              03S0941 00749000
*           ELSE                    /* INOP/ANS              @YM07712*/ 00750000
*             DO;                                               03S0942 00751000
         B     @RC00925                                         03S0942 00752000
@RF00925 DS    0H                                               03S0943 00753000
*               RPARM=RCUR->CURELEM;/* ADDR OF INOP/ANS BUFFER  03S0943 00754000
*                                                            @YM07712*/ 00755000
         L     RPARM,CURELEM-1(,RCUR)                           03S0943 00756000
         LA    RPARM,0(,RPARM)                                  03S0943 00757000
*               REG00=1;            /* SIGNAL LCB NOT FOR DEVICE     */ 00758000
         LA    REG00,1                                          03S0944 00759000
*               CALL OPCEBLD;       /* BUILD OPCE IN INOP BUFFER     */ 00760000
         BAL   @14,OPCEBLD                                      03S0945 00761000
*               ROPCE=RPARM;        /* ADDRESSABILITY TO BUILT OPCE  */ 00762000
         LR    ROPCE,RPARM                                      03S0946 00763000
*               RPARM=OPCCOPCE;     /* ADDRESSABILITY TO CLEAN UP       00764000
*                                      REQUEST ELEMENT               */ 00765000
         L     RPARM,OPCCOPCE(,ROPCAVT)                         03S0947 00766000
*               OPCCOPCE=ROPCE;     /* CURRENT ELEMENT FOR DEACTIVATE*/ 00767000
         ST    ROPCE,OPCCOPCE(,ROPCAVT)                         03S0948 00768000
*               OCSWITCH=OCTOFC;    /* IDENTIFY OPCE TO DEACTIVATE   */ 00769000
         MVI   OCSWITCH(ROPCE),X'23'                            03S0949 00770000
*               OCWTG=CU2DEST;      /* RETURN ROUTING                */ 00771000
         MVC   OCWTG(2,ROPCE),CU2DEST                           03S0950 00772000
*               IF TRMTYPE^=TRMLNCP THEN/* IF NOT NCP THEN ...  03S0951 00773000
*                                                            @YM07712*/ 00774000
         CLI   TRMTYPE(RTRM),X'0F'                              03S0951 00775000
         BE    @RF00951                                         03S0951 00776000
*                 CURSWCH=CURCUREQ; /* SWITCH SETTING                */ 00777000
         MVI   CURSWCH(RPARM),X'39'                             03S0952 00778000
*               ELSE                                            03S0953 00779000
*                 ;                 /* ELSE CURSWCH WAS SET UP  03S0953 00780000
*                                      PROPERLY EARLIER      @YM07712*/ 00781000
@RF00951 DS    0H                                               03S0954 00782000
*             END;                  /*                       @OX19283*/ 00783000
*           CURPRI=PRICUREQ;        /* PRIORITY FOR ELEMENT TO IEDNCU*/ 00784000
@RC00925 MVI   CURPRI(RPARM),X'C4'                              03S0955 00785000
*           CURQCB=SAVTCLUP;        /* QCB                           */ 00786000
         L     @15,AVTSAVTP(,RAVT)                              03S0956 00787000
         MVC   CURQCB(3,RPARM),SAVTCLUP+1(@15)                  03S0956 00788000
*           CALL TPOSTELM;          /* TPOST ELEMENT TO IEDNCU       */ 00789000
         BAL   @14,TPOSTELM                                     03S0957 00790000
*           OPCMODID=DACDEST;       /* SET EXIT TO DEACTIVATE        */ 00791000
         MVC   OPCMODID(2,ROPCAVT),DACDEST                      03S0958 00792000
*           RFY                                                 03S0959 00793000
*             IEDCUREQ BASED(RCUR);                             03S0959 00794000
*           RFY                                                 03S0960 00795000
*             REG00 UNRSTD;                                     03S0960 00796000
*         END;                                                  02S0961 00797000
*     END;                                                      02S0962 00798000
@RC00877 DS    0H                                               02S0963 00799000
*                                                               02S0963 00800000
*   /*****************************************************************/ 00801000
*   /*                                                               */ 00802000
*   /* EPILOGUE: THIS SEGMENT COMPLETES THE EPILOGUE CODE THAT WAS   */ 00803000
*   /* ALTERED BY THE MODULE PROCEDURE STATEMENT. THE XCTL ASSEMBLER */ 00804000
*   /* MACRO INSTRUCTION IS USED BY THIS SEGMENT TO TRANSFER CONTROL */ 00805000
*   /* TO THE NEXT MODULE THAT IS TO BE EXECUTED.                    */ 00806000
*   /*                                                               */ 00807000
*   /*****************************************************************/ 00808000
*                                                               02S0963 00809000
*   RFY                                                         02S0963 00810000
*     REG00 RSTD;                                               02S0963 00811000
@RT00873 DS    0H                                               02S0964 00812000
*   RPARM=ROPCAVT;                  /* SET THE PARAMETER REGISTER IN    00813000
*                                      PREPARATION TO TRANSFERRING      00814000
*                                      CONTROL TO THE NEXT MODULE    */ 00815000
         LR    RPARM,ROPCAVT                                    02S0964 00816000
*   IF OPCMODID=DISPDEST THEN       /* IF EXIT REQUIRED TO IGC0010D  */ 00817000
         CLC   OPCMODID(2,ROPCAVT),DISPDEST                     02S0965 00818000
         BNE   @RF00965                                         02S0965 00819000
*     REG00=0;                      /* PRIME REGISTER ZERO FOR  02S0966 00820000
*                                      IGC0010D                      */ 00821000
         SLR   REG00,REG00                                      02S0966 00822000
*   GEN EXIT REFS(OPCXCTL,ROPCAVT) NOSEQFLOW SETS(REG15);       02S0967 00823000
@RF00965 DS    0H                                               02S0967 00824000
*                                   /*                                  00825000
         XCTL  SF=(E,OPCXCTL(ROPCAVT)) TRANSFER CONTROL MACRO           00826000
*   RFY                                                         02S0968 00827000
*     REG00 UNRSTD;                                             02S0968 00828000
*                                                               02S0969 00829000
*   /*****************************************************************/ 00830000
*   /*                                                               */ 00831000
*   /* SEARCH: THIS SEGMENT CONTAINS THE SEARCH INTERNAL PROCEDURE   */ 00832000
*   /* WHICH SEARCHES THE RESPONSE WAIT CHAIN POINTED TO BY RCHAIN.  */ 00833000
*   /* IF A TTCIN MATCH USING INPUTTED BUFFER PRFSRCE AND OPCE       */ 00834000
*   /* RESPONSE ELEMENT OCTRTBL IS FOUND, A RESPONSE IS GENERATED AND*/ 00835000
*   /* TPOSTED TO AVTOPCOB. THE SEARCH CONTINUES UNTIL THE CHAIN IS  */ 00836000
*   /* COMPLETED. IF BUFFERS, NEEDED TO BUILD RESPONSES, ARE EXHAUSED*/ 00837000
*   /* EXIT IS MADE TO ALLOW PROCESSING OF RESPONSES ALREADY TPOSTED.*/ 00838000
*   /* ON INPUT RCUR=@CUR, RCHAIN=@CHAIN TO SEARCH                   */ 00839000
*   /*                                                               */ 00840000
*   /*****************************************************************/ 00841000
*                                                               02S0969 00842000
*SEARCH:                                                        02S0969 00843000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0969 00844000
SEARCH   DS    0H                                               02S0970 00845000
*   RFY                                                         02S0970 00846000
*    (RELEM,                                                    02S0970 00847000
*     RCHAIN,                                                   02S0970 00848000
*     RCUR,                                                     02S0970 00849000
*     RPRF,                                                     02S0970 00850000
*     REG00,                                                    02S0970 00851000
*     REG09,                                                    02S0970 00852000
*     RRETURN) RSTD;                                            02S0970 00853000
*   REG09=RRETURN;                  /* SAVE RETURN ADDRESS           */ 00854000
         LR    REG09,RRETURN                                    02S0971 00855000
*   RFY                                                         02S0972 00856000
*     RRETURN UNRSTD;                                           02S0972 00857000
*   RFY                                                         02S0973 00858000
*     IEDQOPCE BASED(RELEM);                                    02S0973 00859000
*   CURENDCH=OFF;                   /* INITIALIZE EXIT SWITCH        */ 00860000
         NI    CURENDCH(RCUR),B'11101111'                       02S0974 00861000
*   RELEM=RCHAIN;                   /* SET UP TO FIRST ELEMENT ON       00862000
*                                      WAIT CHAIN                    */ 00863000
         LR    RELEM,RCHAIN                                     02S0975 00864000
*   DO UNTIL                        /* PROCESS TILL ...              */ 00865000
*         (CURPIUCT=10              /* 10 PIUS HAVE BEEN POSTED TO      00866000
*                                      PATH CONTROL ...              */ 00867000
*         |CURPIUCT=>(AVTAVFCT/2)   /* ... OR 1/2 AVAILABLE BUFFERS     00868000
*                                      IS LESS THAN THE NUMBER OF       00869000
*                                      PIUS WE HAVE POSTED ...       */ 00870000
*         |CURENDCH=ON);            /* ... OR END OF CHAIN           */ 00871000
@DL00976 DS    0H                                               02S0977 00872000
*                                                               03S0977 00873000
*     /***************************************************************/ 00874000
*     /*                                                             */ 00875000
*     /* SEARCH.CHAIN: THIS SEGMENT SEARCHES THE CHAIN               */ 00876000
*     /*                                                             */ 00877000
*     /***************************************************************/ 00878000
*                                                               03S0977 00879000
*     IF RCHAIN=OPCWAITN            /* IF FID0 WAIT CHAIN SEARCH ... */ 00880000
*         |(OCSWITCH>=OCCHGSL       /* ... OR FID1 AND A REQUEST THAT   00881000
*                                      WILL ...                      */ 00882000
*         &OCSWITCH=<OCSESTRM) THEN /* ... NOT BE RESPONDED TO BY       00883000
*                                      TCAM ...                      */ 00884000
         C     RCHAIN,OPCWAITN(,ROPCAVT)                        03S0977 00885000
         BE    @RT00977                                         03S0977 00886000
         CLI   OCSWITCH(RELEM),X'80'                            03S0977 00887000
         BL    @RF00977                                         03S0977 00888000
         CLI   OCSWITCH(RELEM),X'E6'                            03S0977 00889000
         BH    @RF00977                                         03S0977 00890000
@RT00977 DS    0H                                               03S0978 00891000
*       DO;                         /* ... RESIDENT CLEANUP          */ 00892000
*         IF OCRSPSNT=ON            /* HAS RESPONSE BEEN SENT BY C1     00893000
*                                      FOR THIS ELEMENT ...          */ 00894000
*             |OCBFREQ=ON THEN                                  03S0979 00895000
         LR    @15,RELEM                                        03S0979 00896000
         AL    @15,@CF03169                                     03S0979 00897000
         TM    OCRSPSNT-3(@15),B'11000000'                      03S0979 00898000
         BNZ   @RT00979                                         03S0979 00899000
*           ;                       /* ... OR THIS ELEMENT HAS BEEN     00900000
*                                      MARKED NO MATCH               */ 00901000
*         ELSE                      /* SKIP TO NEXT ELEMENT          */ 00902000
*           DO;                                                 03S0981 00903000
*                                                               04S0982 00904000
*             /*******************************************************/ 00905000
*             /*                                                     */ 00906000
*             /* SEARCH.CHAIN.LOOKCOHT: THIS SEGMENT, PART OF SEARCH */ 00907000
*             /* SUBROUTINE, CHECKS THE TTCIN OF THE ANS OR INOP     */ 00908000
*             /* DEVICE AGAINST TTCIN OF DEVICES AWAITING RESPONSES  */ 00909000
*             /* ON THE WAIT CHAIN OR AGAINST TTCIN OF HIGHER        */ 00910000
*             /* RESOURCE OF DEVICES AWAITING RESPONSES              */ 00911000
*             /*                                                     */ 00912000
*             /*******************************************************/ 00913000
*                                                               04S0982 00914000
*             IF CURTTCIN=OCTRMTBL THEN                         04S0982 00915000
         LH    @15,OCTRMTBL(,RELEM)                             04S0982 00916000
         N     @15,@CF03167                                     04S0982 00917000
         CH    @15,CURTTCIN(,RCUR)                              04S0982 00918000
         BE    @RT00982                                         04S0982 00919000
*               ;                   /* IF TTCIN OF INOP/ANS DEVICE IS   00920000
*                                      SAME AS ELEMENT AWAITING 04S0983 00921000
*                                      RESPONSE - EXIT               */ 00922000
*             ELSE                  /* NO MATCH - CHECK HIGHER  04S0984 00923000
*                                      RESOURCE                      */ 00924000
*               DO;                                             04S0984 00925000
*                 RPARM=OCTRMTBL;   /* TNT INDEX - TO GET TRM ROUTINE*/ 00926000
         LH    RPARM,OCTRMTBL(,RELEM)                           04S0985 00927000
         N     RPARM,@CF03167                                   04S0985 00928000
*                 CALL IEDQTNT;                                 04S0986 00929000
*                                                               04S0986 00930000
         L     @15,AVTRNMPT(,RAVT)                              04S0986 00931000
         BALR  @14,@15                                          04S0986 00932000
*                 /***************************************************/ 00933000
*                 /*                                                 */ 00934000
*                 /* WHEN RETURN, RPARM=ADDR OF TRM OF DEVICE        */ 00935000
*                 /* AWAITING RESPONSE                               */ 00936000
*                 /*                                                 */ 00937000
*                 /***************************************************/ 00938000
*                                                               04S0987 00939000
*                 RPARM=RPARM-LENGTH(IEDNTRM);/* BACK UP TO NEG 04S0987 00940000
*                                      PREFIX                        */ 00941000
         SL    RPARM,@CF02443                                   04S0987 00942000
*                 RFY                                           04S0988 00943000
*                   IEDTRM BASED(RPARM);/* TEMP CHANGE BASE TO CHECK    00944000
*                                      RESPONSE TRM                  */ 00945000
*                 DO UNTIL(TRMTYPE=TRMLNCP/* DO WHILE NEXT HIGHER       00946000
*                                      ROSOURCE IS NOT AN NCP ...    */ 00947000
*                       |CURTTCIN=REG00/* ... OR TTCIN DOES NOT MATCH   00948000
*                                      ...                           */ 00949000
*                       |REG00=0);  /* ... OR ROUTINE DOES NOT FAIL  */ 00950000
@DL00989 DS    0H                                               04S0990 00951000
*                   RPARM=RPARM+LENGTH(IEDNTRM);/* TO TRM PROPER FOR    00952000
*                                      ROUTINE                       */ 00953000
         AL    RPARM,@CF02443                                   04S0990 00954000
*                   CALL COHORTLK;                              04S0991 00955000
         L     @15,OPCHORT(,ROPCAVT)                            04S0991 00956000
         BALR  @14,@15                                          04S0991 00957000
*                   RPARM=RPARM-LENGTH(IEDNTRM);/* BACK UP TO START     00958000
*                                      OF TRM RETURNED FOR CHECKS    */ 00959000
         SL    RPARM,@CF02443                                   04S0992 00960000
*                 END;                                          04S0993 00961000
@DE00989 CLI   TRMTYPE(RPARM),X'0F'                             04S0993 00962000
         BE    @DC00989                                         04S0993 00963000
         CH    REG00,CURTTCIN(,RCUR)                            04S0993 00964000
         BE    @DC00989                                         04S0993 00965000
         LTR   REG00,REG00                                      04S0993 00966000
         BNZ   @DL00989                                         04S0993 00967000
@DC00989 DS    0H                                               04S0994 00968000
*               END;                                            04S0994 00969000
*             RFY                                               04S0995 00970000
*               IEDTRM BASED(RTRM); /* RESTORE                       */ 00971000
@RT00982 DS    0H                                               04S0996 00972000
*             IF PRFSRCE=OCTRMTBL   /* WAS THERE A TTCIN MATCH ...   */ 00973000
*                 |PRFSRCE=REG00 THEN/* ... OR TTCIN MATCH IN COHORT */ 00974000
         LH    @15,PRFSRCE(,RPRF)                               03S0996 00975000
         LH    @14,OCTRMTBL(,RELEM)                             03S0996 00976000
         N     @14,@CF03167                                     03S0996 00977000
         CR    @15,@14                                          03S0996 00978000
         BE    @RT00996                                         03S0996 00979000
         CR    @15,REG00                                        03S0996 00980000
         BNE   @RF00996                                         03S0996 00981000
@RT00996 DS    0H                                               03S0997 00982000
*               DO;                                             03S0997 00983000
*                                                               04S0998 00984000
*                 /***************************************************/ 00985000
*                 /*                                                 */ 00986000
*                 /* SEARCH.CHAIN.RESPONSE: THIS SEGMENT BUILDS THE  */ 00987000
*                 /* RESPONSE FOR DEVICES FOUND ON RESPONSE WAIT     */ 00988000
*                 /* CHAIN AND TPOSTS THE BUILT RESPONSE TO AVTOPCOB */ 00989000
*                 /*                                                 */ 00990000
*                 /***************************************************/ 00991000
*                                                               04S0998 00992000
*                 RFY                                           04S0998 00993000
*                   IEDRH BASED(ADDR(PRF1RH));                  04S0998 00994000
*                 RPARM=1;          /* REQUEST ONE UNIT              */ 00995000
         LA    RPARM,1                                          04S0999 00996000
*                 CALL ALLOCBUF;                                04S1000 00997000
         L     @15,OPCGETBF(,ROPCAVT)                           04S1000 00998000
         BALR  @14,@15                                          04S1000 00999000
*                 RPRF=RPARM;       /* BUFFER BASE                   */ 01000000
*                                                               04S1001 01001000
         LR    RPRF,RPARM                                       04S1001 01002000
*                 /***************************************************/ 01003000
*                 /*                                                 */ 01004000
*                 /* SET UP BUFFER PREFIX                            */ 01005000
*                 /*                                                 */ 01006000
*                 /***************************************************/ 01007000
*                                                               04S1002 01008000
*                 PRFSRCE=OCRUDEST; /* SOURCE OF RESPONSE            */ 01009000
         L     @15,OCRUDEST(,RELEM)                             04S1002 01010000
         STH   @15,PRFSRCE(,RPRF)                               04S1002 01011000
*                 PRFPRI=PRIRESPB;  /* PRIORITY OF RESPONSE          */ 01012000
         MVI   PRFPRI(RPRF),X'EA'                               04S1003 01013000
*                 PRFQCBA=ADDR(AVTOPCOB);/* DESTINATION              */ 01014000
         LA    @15,AVTOPCOB(,RAVT)                              04S1004 01015000
         STCM  @15,7,PRFQCBA(RPRF)                              04S1004 01016000
*                 PRFTIC=PRFINTIC;  /* LAST UNIT                     */ 01017000
         MVC   PRFTIC(4,RPRF),@CB01989                          04S1005 01018000
*                 PRFNBUNT=1;       /* ONE UNIT                      */ 01019000
         MVI   PRFNBUNT(RPRF),X'01'                             04S1006 01020000
*                 IF RCHAIN=OPCWAITN THEN/* IF GENERATING FID0  04S1007 01021000
*                                      RESPONSES                     */ 01022000
         C     RCHAIN,OPCWAITN(,ROPCAVT)                        04S1007 01023000
         BNE   @RF01007                                         04S1007 01024000
*                   DO;                                         04S1008 01025000
*                                                               05S1009 01026000
*                     /***********************************************/ 01027000
*                     /*                                             */ 01028000
*                     /* SEARCH.CHAIN.RESPONSE.FID0RESP: THIS SEGMENT*/ 01029000
*                     /* INITIALIZES THE RH AND TH FOR FID0 RESPONSE */ 01030000
*                     /* AND SETS UP THE NEGATIVE RESPONSE IN THE    */ 01031000
*                     /* BUFFER                                      */ 01032000
*                     /*                                             */ 01033000
*                     /***********************************************/ 01034000
*                                                               05S1009 01035000
*                     IEDRH=TRHFID0;/* FID0 RH                       */ 01036000
         LR    @15,RPRF                                         05S1009 01037000
         SL    @15,@CF00045                                     05S1009 01038000
         MVC   IEDRH(3,@15),@CB02439                            05S1009 01039000
*                     PRF1FLG1=0;   /* FID0 TH                       */ 01040000
         MVI   PRF1FLG1(@15),X'00'                              05S1010 01041000
*                     PRF1SQID=OCSEQ;/* SEQUENCE NUMBER              */ 01042000
         LH    @14,OCSEQ(,RELEM)                                05S1011 01043000
         N     @14,@CF03167                                     05S1011 01044000
         STH   @14,PRF1SQID(,@15)                               05S1011 01045000
*                     BDUCMND=CD0CTRL;/* COMMAND                     */ 01046000
         LA    @15,42                                           05S1012 01047000
         ALR   @15,RPRF                                         05S1012 01048000
         MVI   BDUCMND(@15),X'08'                               05S1012 01049000
*                     BDUFNFLG=0;   /* ALL FUNCTION FLAGS OFF EXCEPT    01050000
*                                      ...                           */ 01051000
         MVI   BDUFNFLG(@15),X'00'                              05S1013 01052000
*                     BDUSTHDR=ON;  /* ... START OF HEADER ...       */ 01053000
*                     BDUFRSTB=ON;  /* ... FIRST BLOCK ...           */ 01054000
         OI    BDUSTHDR(@15),B'10010000'                        05S1015 01055000
*                     BDUBDUFG=0;   /* ALL BDU FLAGS OFF             */ 01056000
         MVI   BDUBDUFG(@15),X'00'                              05S1016 01057000
*                     BDUSYRSP=RSPCRSET;/* SET COMMAND RESET @OZ27810*/ 01058000
         MVI   BDUSYRSP(@15),X'9E'                              05S1017 01059000
*                     BDUEXRSP=0;   /* ... ERROR STATUS      @OZ27810*/ 01060000
         MVI   BDUEXRSP(@15),X'00'                              05S1018 01061000
*                   END;                                        04S1019 01062000
*                 ELSE              /* IF GENERATING FID1 RESPONSES  */ 01063000
*                   DO;                                         04S1020 01064000
         B     @RC01007                                         04S1020 01065000
@RF01007 DS    0H                                               04S1021 01066000
*                                                               05S1021 01067000
*                     /***********************************************/ 01068000
*                     /*                                             */ 01069000
*                     /* SEARCH.CHAIN.RESPONSE.FID1RESP: THIS SEGMENT*/ 01070000
*                     /* INITIALIZES THE RH AND TH FOR FID1 RESPONSE */ 01071000
*                     /* AND SETS THE PATH ERROR RESPONSE INTO THE   */ 01072000
*                     /* BUFFER                                      */ 01073000
*                     /*                                             */ 01074000
*                     /***********************************************/ 01075000
*                                                               05S1021 01076000
*                     IEDRH=0;      /* ZERO COMPLETE RH PRIOR TO        01077000
*                                      INITIALIZING                  */ 01078000
         LR    @15,RPRF                                         05S1021 01079000
         SL    @15,@CF00045                                     05S1021 01080000
         SLR   @14,@14                                          05S1021 01081000
         STCM  @14,7,IEDRH(@15)                                 05S1021 01082000
*                     TRHTYPE=ON;   /* SET RESPONSE                  */ 01083000
*                     TRHFI=ON;     /* SET FORMAT                    */ 01084000
*                     TRHSDI=ON;    /* SET SENSE INCLUDED            */ 01085000
*                     TRHBC=ON;     /* SET BEGIN CHAIN               */ 01086000
*                     TRHEC=ON;     /* SET END CHAIN                 */ 01087000
         OI    TRHTYPE(@15),B'10001111'                         05S1026 01088000
*                     TRHDR1=ON;    /* DEFINITE RESPONSE             */ 01089000
         OI    TRHDR1(@15),B'10000000'                          05S1027 01090000
*                     PRFDEST=SAVTSCPT;/* SSCP TTE INDEX             */ 01091000
         L     @14,AVTSAVTP(,RAVT)                              05S1028 01092000
         LH    @14,SAVTSCPT(,@14)                               05S1028 01093000
         N     @14,@CF03167                                     05S1028 01094000
         STH   @14,PRFDEST(,RPRF)                               05S1028 01095000
*                     PRF1SQID=OCSEQ;/* INSERT SEQUENCE NUMBER       */ 01096000
         LH    @14,OCSEQ(,RELEM)                                05S1029 01097000
         N     @14,@CF03167                                     05S1029 01098000
         STH   @14,PRF1SQID(,@15)                               05S1029 01099000
*                     PRF1FLG1=0;   /* ZERO FLAG BYTE                */ 01100000
         MVI   PRF1FLG1(@15),X'00'                              05S1030 01101000
*                     PRF1FIDI=ON;  /* SET FID1 FOR ALL RESPONSES    */ 01102000
         OI    PRF1FIDI(@15),B'10000000'                        05S1031 01103000
*                     PRF1FORM=PRF1IDI;/* DESCRIPTION FOR ALL   05S1032 01104000
*                                      RESPONSES                     */ 01105000
         NI    PRF1FORM(@15),B'11101111'                        05S1032 01106000
         OI    PRF1FORM(@15),B'00100000'                        05S1032 01107000
*                     IF OCSWITCH=OCSWEP/* IF SWITCH TO EP MODE ...  */ 01108000
*                         |OCSWITCH=OCSWNCP THEN/* ... OR SWITCH TO     01109000
*                                      NCP MODE                      */ 01110000
         CLI   OCSWITCH(RELEM),X'C0'                            05S1033 01111000
         BE    @RT01033                                         05S1033 01112000
         CLI   OCSWITCH(RELEM),X'D0'                            05S1033 01113000
         BNE   @RF01033                                         05S1033 01114000
@RT01033 DS    0H                                               05S1034 01115000
*                       DO;                                     05S1034 01116000
*                         TRHRUCAT=TRHNC;/* RU CATAGORY=NETWORK 05S1035 01117000
*                                      CONTROL                       */ 01118000
         LR    @15,RPRF                                         05S1035 01119000
         SL    @15,@CF00045                                     05S1035 01120000
         NI    TRHRUCAT(@15),B'10111111'                        05S1035 01121000
         OI    TRHRUCAT(@15),B'00100000'                        05S1035 01122000
*                         PRF1EXPI=ON;/* EXPANDED INDICATOR          */ 01123000
         OI    PRF1EXPI(@15),B'01000000'                        05S1036 01124000
*                       END;                                    05S1037 01125000
*                     CATAGORY=SNSPATH;/* SIGNAL PATH ERROR          */ 01126000
@RF01033 LA    @15,PRFSUNIT(,RPRF)                              05S1038 01127000
         AL    @15,@CF00452                                     05S1038 01128000
         SLR   @14,@14                                          05S1038 01129000
         IC    @14,PRFISIZE(,RPRF)                              05S1038 01130000
         ALR   @15,@14                                          05S1038 01131000
         MVI   CATAGORY(@15),X'80'                              05S1038 01132000
*                     MODIFIER=SNSLNKF;/* SIGNAL LINK FAILURE        */ 01133000
         MVI   MODIFIER(@15),X'02'                              05S1039 01134000
*                     USERDATA=0;   /* NO USER DATA                  */ 01135000
         SLR   @14,@14                                          05S1040 01136000
         STH   @14,USERDATA(,@15)                               05S1040 01137000
*                   END;                                        04S1041 01138000
*                 RPARM=RPRF;       /* ADDRESS OF UNIT TO TPOST      */ 01139000
@RC01007 LR    RPARM,RPRF                                       04S1042 01140000
*                 CALL TPOSTELM;    /* TPOST UNIT TO AVTOPCOB        */ 01141000
         BAL   @14,TPOSTELM                                     04S1043 01142000
*                 OCRSPSNT=ON;      /* MARK RESPONSE SENT            */ 01143000
         LR    @15,RELEM                                        04S1044 01144000
         AL    @15,@CF03169                                     04S1044 01145000
         OI    OCRSPSNT-3(@15),B'01000000'                      04S1044 01146000
*               END;                                            03S1045 01147000
*             ELSE                  /* NO MATCH                      */ 01148000
*               DO;                                             03S1046 01149000
         B     @RC00996                                         03S1046 01150000
@RF00996 DS    0H                                               03S1047 01151000
*                 OCRSPSNT=OFF;     /* RESET RESPONSE SENT SWITCH    */ 01152000
*                 OCBFREQ=ON;       /* SET NO MATCH SWITCH           */ 01153000
         LR    @15,RELEM                                        03S1048 01154000
         AL    @15,@CF03169                                     03S1048 01155000
         OI    OCBFREQ-3(@15),B'10000000'                       03S1048 01156000
         NI    OCRSPSNT-3(@15),B'10111111'                      03S1048 01157000
*               END;                                            03S1049 01158000
*           END;                                                03S1050 01159000
@RC00996 DS    0H                                               03S1051 01160000
*       END;                                                    03S1051 01161000
@RT00979 DS    0H                                               03S1052 01162000
*     RELEM=OCLINK;                 /* SET UP TO NEXT ELEMENT        */ 01163000
@RF00977 L     RELEM,OCLINK(,RELEM)                             03S1052 01164000
*     IF RELEM=0 THEN               /* IF END OF CHAIN               */ 01165000
         LTR   RELEM,RELEM                                      03S1053 01166000
         BNZ   @RF01053                                         03S1053 01167000
*       CURENDCH=ON;                /* SIGNAL EXIT LOOP              */ 01168000
         OI    CURENDCH(RCUR),B'00010000'                       03S1054 01169000
*   END;                                                        02S1055 01170000
@RF01053 DS    0H                                               02S1055 01171000
@DE00976 LH    @15,CURPIUCT(,RCUR)                              02S1055 01172000
         C     @15,@CF03101                                     02S1055 01173000
         BE    @DC00976                                         02S1055 01174000
         LH    @10,AVTAVFCT(,RAVT)                              02S1055 01175000
         SRDA  @10,32                                           02S1055 01176000
         D     @10,@CF00065                                     02S1055 01177000
         CR    @15,@11                                          02S1055 01178000
         BNL   @DC00976                                         02S1055 01179000
         TM    CURENDCH(RCUR),B'00010000'                       02S1055 01180000
         BNO   @DL00976                                         02S1055 01181000
@DC00976 DS    0H                                               02S1056 01182000
*   OPCMODID=DISPDEST;              /* XCTL TARGET TO IGC0010D       */ 01183000
         MVC   OPCMODID(2,ROPCAVT),DISPDEST                     02S1056 01184000
*   RFY                                                         02S1057 01185000
*     RRETURN RSTD;                                             02S1057 01186000
*   RRETURN=REG09;                  /* RESTORE RETURN ADDRESS        */ 01187000
         LR    RRETURN,REG09                                    02S1058 01188000
*   RFY                                                         02S1059 01189000
*    (RELEM,                                                    02S1059 01190000
*     RCHAIN,                                                   02S1059 01191000
*     RCUR,                                                     02S1059 01192000
*     RPRF,                                                     02S1059 01193000
*     REG00,                                                    02S1059 01194000
*     REG09,                                                    02S1059 01195000
*     RRETURN) UNRSTD;                                          02S1059 01196000
*   END SEARCH;                                                 02S1060 01197000
@EL00002 DS    0H                                               02S1060 01198000
@EF00002 DS    0H                                               02S1060 01199000
@ER00002 BR    @14                                              02S1060 01200000
*                                                               02S1061 01201000
*   /*****************************************************************/ 01202000
*   /*                                                               */ 01203000
*   /* OPCEBLD: THIS SEGMENT CONTAINS THE INTERNAL PROCEDURE THAT    */ 01204000
*   /* BUILDS AN OPCE IN A UNIT PASSED IN REG1. ON INPUT RTRM, RLCB, */ 01205000
*   /* AND RPARM MUST BE INITIALIZED. OCSWITCH AND OCWTG WILL NOT BE */ 01206000
*   /* SET UP AND RTRM, RLCB AND RPARM WILL BE UNCHANGED. ON INPUT IF*/ 01207000
*   /* REG 0 IS NOT = TO 0 THE LCB MAY NOT BE FOR THE RESOURCE INOP, */ 01208000
*   /* IN WHICH CASE THE TTE NAME IS INSERTED IN THE OPCE FOR MESSAGE*/ 01209000
*   /* USE.                                                          */ 01210000
*   /*                                                               */ 01211000
*   /*****************************************************************/ 01212000
*                                                               02S1061 01213000
*OPCEBLD:                                                       02S1061 01214000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S1061 01215000
OPCEBLD  DS    0H                                               02S1062 01216000
*   RFY                                                         02S1062 01217000
*     IEDQOPCE BASED(RPARM);                                    02S1062 01218000
*   RFY                                                         02S1063 01219000
*    (REG10,                                                    02S1063 01220000
*     RPARM,                                                    02S1063 01221000
*     RLCB,                                                     02S1063 01222000
*     RRETURN,                                                  02S1063 01223000
*     REG00,                                                    02S1063 01224000
*     REG15) RSTD;                  /*                       @YM08988*/ 01225000
*   OPCECLR=''B;                    /* CLEAR FIRST 8 BYTES           */ 01226000
         LR    @11,RPARM                                        02S1064 01227000
         AL    @11,@CF03163                                     02S1064 01228000
         XC    OPCECLR(64,@11),OPCECLR(@11)                     02S1064 01229000
*   OCFLAG=0;                       /* CLEAR FLAG BYTE               */ 01230000
         MVI   OCFLAG(RPARM),X'00'                              02S1065 01231000
*   OCOPTCDE=OCMODIFY;              /* IDENTIFY MODIFY COMMAND       */ 01232000
         MVI   OCOPTCDE(RPARM),X'44'                            02S1066 01233000
*   IF AVTOPCON=0 THEN              /* IF SYSTEM CONSOLE IS PRIMARY     01234000
*                                      OPERATOR CONSOLE              */ 01235000
         LH    @11,AVTOPCON(,RAVT)                              02S1067 01236000
         LTR   @11,@11                                          02S1067 01237000
         BNZ   @RF01067                                         02S1067 01238000
*     OCCONSOL=ON;                  /* SO INDICATE                   */ 01239000
         OI    OCCONSOL(RPARM),B'10000000'                      02S1068 01240000
*   ELSE                                                        02S1069 01241000
*     OCDEST=AVTOPCIN;              /* IDENTIFY PRIMARY OPERATOR        01242000
*                                      CONSOLE                       */ 01243000
         B     @RC01067                                         02S1069 01244000
@RF01067 LH    @11,AVTOPCIN(,RAVT)                              02S1069 01245000
         N     @11,@CF03167                                     02S1069 01246000
         STH   @11,OCDEST(,RPARM)                               02S1069 01247000
*   IF REG00=0 THEN                 /* IF LCB OK TO USE              */ 01248000
@RC01067 LTR   REG00,REG00                                      02S1070 01249000
         BNZ   @RF01070                                         02S1070 01250000
*     DO;                                                       02S1071 01251000
*       OCTRMTBL=LCBTTCIN;          /* TTCIN OF RESOURCE             */ 01252000
         LH    @11,LCBTTCIN(,RLCB)                              02S1072 01253000
         N     @11,@CF03167                                     02S1072 01254000
         STH   @11,OCTRMTBL(,RPARM)                             02S1072 01255000
*       REG10=LCBDCBPT;             /* TEMP DCB BASE                 */ 01256000
         L     REG10,LCBDCBPT(,RLCB)                            02S1073 01257000
*       RFY                                                     02S1074 01258000
*         IHADCB BASED(REG10);                                  02S1074 01259000
*       RFY                                                     02S1075 01260000
*         IEDQDEB BASED(REG10);                                 02S1075 01261000
*       REG10=DCBDEBAD;             /* DEB ADDRESS                   */ 01262000
         L     @11,DCBDEBAD+40(,REG10)                          02S1076 01263000
         LR    REG10,@11                                        02S1076 01264000
*       REG10=REG10-(ADDR(DEBTCBAD)-ADDR(IEDQDEB)-1);/* BACK UP TO      01265000
*                                      DEB PROPER            @YM08409*/ 01266000
         SL    REG10,@CF01140                                   02S1077 01267000
*       OCBACKUP=DEBUCBAD(1)->UCBNAME;/* ADDRESS FOR MESSAGES   02S1078 01268000
*                                                            @YM08020*/ 01269000
         MVI   OCBACKUP+3(RPARM),C' '                           02S1078 01270000
         MVC   OCBACKUP+4(4,RPARM),OCBACKUP+3(RPARM)            02S1078 01271000
         L     @11,DEBUCBAD-1(,REG10)                           02S1078 01272000
         MVC   OCBACKUP(3,RPARM),UCBNAME(@11)                   02S1078 01273000
*       RFY                                                     02S1079 01274000
*         REG10 UNRSTD;                                         02S1079 01275000
*     END;                                                      02S1080 01276000
*   ELSE                            /* CANT USE LCB USE TTE NAME     */ 01277000
*     DO;                                                       02S1081 01278000
         B     @RC01070                                         02S1081 01279000
@RF01070 DS    0H                                               02S1082 01280000
*       RFY                                                     02S1082 01281000
*        (REG10,                                                02S1082 01282000
*         REG11) UNRSTD;                                        02S1082 01283000
*       REG00=TNTENLEN+3;           /* DEVELOPE TNT NAME             */ 01284000
         L     @11,AVTRNMPT(,RAVT)                              02S1083 01285000
         SLR   @10,@10                                          02S1083 01286000
         IC    @10,TNTENLEN(,@11)                               02S1083 01287000
         LA    REG00,3                                          02S1083 01288000
         ALR   REG00,@10                                        02S1083 01289000
*       REG15=CURTTCIN-1;           /* SAME                          */ 01290000
         LH    @07,CURTTCIN(,RCUR)                              02S1084 01291000
         LR    REG15,@07                                        02S1084 01292000
         BCTR  REG15,0                                          02S1084 01293000
*       REG15=REG15*REG00;          /* SAME                          */ 01294000
         LR    @07,REG00                                        02S1085 01295000
         MR    @06,REG15                                        02S1085 01296000
         LR    REG15,@07                                        02S1085 01297000
*       REG15=REG15+ADDR(TNTFIRST); /* ADDRESS OF NAME IN TNT        */ 01298000
         AL    @11,@CF03148                                     02S1086 01299000
         ALR   REG15,@11                                        02S1086 01300000
*       RFY                                                     02S1087 01301000
*         REG00 UNRSTD;                                         02S1087 01302000
*       OCBACKUP=TTENAME(1:TNTENLEN);/* INSERT TTE NAME              */ 01303000
         MVI   OCBACKUP+1(RPARM),C' '                           02S1088 01304000
         MVC   OCBACKUP+2(6,RPARM),OCBACKUP+1(RPARM)            02S1088 01305000
         BCTR  @10,0                                            02S1088 01306000
         EX    @10,@SM03170                                     02S1088 01307000
*       OCTRMTBL=CURTTCIN;          /* DEVICE TNT INDEX              */ 01308000
         LH    @11,CURTTCIN(,RCUR)                              02S1089 01309000
         STH   @11,OCTRMTBL(,RPARM)                             02S1089 01310000
*     END;                                                      02S1090 01311000
*   OCUNIT=PRFINTIC;                /* ONLY ONE UNIT IN CHAIN        */ 01312000
@RC01070 MVC   OCUNIT(4,RPARM),@CF01989                         02S1091 01313000
*   RFY                                                         02S1092 01314000
*     IHADCB BASED;                                             02S1092 01315000
*   RFY                                                         02S1093 01316000
*     IEDQDEB BASED;                                            02S1093 01317000
*   RFY                                                         02S1094 01318000
*    (RLCB,                                                     02S1094 01319000
*     RPARM,                                                    02S1094 01320000
*     RRETURN,                                                  02S1094 01321000
*     REG15) UNRSTD;                /*                       @YM08988*/ 01322000
*   RFY                                                         02S1095 01323000
*     IEDQOPCE BASED(ROPCE);                                    02S1095 01324000
*   END OPCEBLD;                                                02S1096 01325000
@EL00003 DS    0H                                               02S1096 01326000
@EF00003 DS    0H                                               02S1096 01327000
@ER00003 BR    @14                                              02S1096 01328000
*                                                               02S1097 01329000
*   /*****************************************************************/ 01330000
*   /*                                                               */ 01331000
*   /* TPOSTELM: THIS SEGMENT CONTAINS THE INTERNAL PROCEDURE THAT   */ 01332000
*   /* TPOSTS ONE ELEMENT. UPON ENTRY RPARM = ADDR OF ELEMENT TO     */ 01333000
*   /* TPOST. THE ELEMENT MUST HAVE BEEN INITIALIZED PRIOR TO COMMING*/ 01334000
*   /* TO THIS ROUTINE                                               */ 01335000
*   /*                                                               */ 01336000
*   /*****************************************************************/ 01337000
*                                                               02S1097 01338000
*TPOSTELM:                                                      02S1097 01339000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S1097 01340000
TPOSTELM DS    0H                                               02S1098 01341000
*   RFY                                                         02S1098 01342000
*    (RPARM,                                                    02S1098 01343000
*     RRETURN) RSTD;                                            02S1098 01344000
*   OPCAQWD1=RPARM;                 /* BEGINNING OF LIST             */ 01345000
         ST    RPARM,OPCAQWD1(,ROPCAVT)                         02S1099 01346000
*   OPCAQWD2=RPARM;                 /* END OF LIST                   */ 01347000
         ST    RPARM,OPCAQWD2(,ROPCAVT)                         02S1100 01348000
*   OPCAQREQ=TPOST;                 /* REQUEST TPOST                 */ 01349000
         MVI   OPCAQREQ(ROPCAVT),X'0C'                          02S1101 01350000
*   OPCAQRQ2=ENDLIS2;               /* MARK END OF LIST              */ 01351000
         MVI   OPCAQRQ2(ROPCAVT),X'80'                          02S1102 01352000
*   RPARM=ADDR(OPCAQCTL);           /* ADDRESS OF PARAMETER LIST     */ 01353000
         LA    RPARM,OPCAQCTL(,ROPCAVT)                         02S1103 01354000
*   GEN(AQCTL);                     /* ISSUE SVC 102                 */ 01355000
         AQCTL                                                          01356000
*   RFY                                                         02S1105 01357000
*    (RPARM,                                                    02S1105 01358000
*     RRETURN) UNRSTD;                                          02S1105 01359000
*   END TPOSTELM;                                               02S1106 01360000
@EL00004 DS    0H                                               02S1106 01361000
@EF00004 DS    0H                                               02S1106 01362000
@ER00004 BR    @14                                              02S1106 01363000
*                                                               02S1107 01364000
*   /*****************************************************************/ 01365000
*   /*                                                               */ 01366000
*   /* GETLCB: THIS SEGMENT CONTAINS THE INTERNAL PROCEDURE THAT     */ 01367000
*   /* LOCATES THE LCB USING THE TRM. RTRM MUST BE INITIALIZED BEFORE*/ 01368000
*   /* INPUT. RLCB WILL BE INITIALIZED                               */ 01369000
*   /*                                                               */ 01370000
*   /*****************************************************************/ 01371000
*                                                               02S1107 01372000
*GETLCB:                                                        02S1107 01373000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S1107 01374000
GETLCB   DS    0H                                               02S1108 01375000
*   RFY                                                         02S1108 01376000
*     IHADCB BASED(REG10);          /* TEMP BASE FOR DCB STRUCTURE   */ 01377000
*   RFY                                                         02S1109 01378000
*    (RLCB,                                                     02S1109 01379000
*     REG10,                                                    02S1109 01380000
*     RRETURN) RSTD;                /*                       @YM08988*/ 01381000
*   REG10=TRMDESTQ->QCBDCBAD;       /* TEMP BASE                     */ 01382000
         SLR   @15,@15                                          02S1110 01383000
         ICM   @15,7,TRMDESTQ(RTRM)                             02S1110 01384000
         L     REG10,QCBDCBAD-1(,@15)                           02S1110 01385000
         LA    REG10,0(,REG10)                                  02S1110 01386000
*   RLCB=DCBIOBAD+DCBEIOBX-LCBPRFSZ;/* LCB BASE                      */ 01387000
         LA    @15,20                                           02S1111 01388000
         ALR   @15,REG10                                        02S1111 01389000
         SLR   RLCB,RLCB                                        02S1111 01390000
         IC    RLCB,DCBEIOBX(,@15)                              02S1111 01391000
         AL    RLCB,DCBIOBAD(,@15)                              02S1111 01392000
         SL    RLCB,@CF00627                                    02S1111 01393000
*   RFY                                                         02S1112 01394000
*     IHADCB BASED;                                             02S1112 01395000
*   RFY                                                         02S1113 01396000
*    (RLCB,                                                     02S1113 01397000
*     REG10,                                                    02S1113 01398000
*     RRETURN) UNRSTD;              /*                       @YM08988*/ 01399000
*   END GETLCB;                                                 02S1114 01400000
@EL00005 DS    0H                                               02S1114 01401000
@EF00005 DS    0H                                               02S1114 01402000
@ER00005 BR    @14                                              02S1114 01403000
*                                                               02S1115 01404000
*   /*****************************************************************/ 01405000
*   /*                                                               */ 01406000
*   /* GETLCBNA: THIS SEGMENT CONTAINS THE INTERNAL PROCEDURE THAT   */ 01407000
*   /* LOCATES THE LCB USING THE TTCIN TO NETWORK ADDRESS AND NETWORK*/ 01408000
*   /* ADDRESS TO LCB ADDRESS ROUTINES                               */ 01409000
*   /*                                                               */ 01410000
*   /*****************************************************************/ 01411000
*                                                               02S1115 01412000
*GETLCBNA:                                                      02S1115 01413000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S1115 01414000
GETLCBNA DS    0H                                               02S1116 01415000
*   RFY                                                         02S1116 01416000
*    (RLCB,                                                     02S1116 01417000
*     REG15,                                                    02S1116 01418000
*     REG10,                                                    02S1116 01419000
*     RRETURN,                                                  02S1116 01420000
*     RPARM) RSTD;                                              02S1116 01421000
*   REG10=RRETURN;                  /* SAVE RETURN ADDRESS           */ 01422000
         LR    REG10,RRETURN                                    02S1117 01423000
*   RPARM=CURTTCIN;                 /* TTCIN FOR ROUTINE             */ 01424000
         LH    RPARM,CURTTCIN(,RCUR)                            02S1118 01425000
*   CALL IEDIAP04;                                              02S1119 01426000
         L     @11,AVTSAVTP(,RAVT)                              02S1119 01427000
         L     @15,SAVTTNTX(,@11)                               02S1119 01428000
         BALR  @14,@15                                          02S1119 01429000
*   RPARM=REG15;                    /* NETWORK ADDRESS FOR ROUTINE   */ 01430000
         LR    RPARM,REG15                                      02S1120 01431000
*   CALL IEDIAP06;                                              02S1121 01432000
         L     @11,AVTSAVTP(,RAVT)                              02S1121 01433000
         L     @15,SAVTLCBS(,@11)                               02S1121 01434000
         BALR  @14,@15                                          02S1121 01435000
*   RLCB=REG15;                     /* LCB BASE                      */ 01436000
         LR    RLCB,REG15                                       02S1122 01437000
*   RRETURN=REG10;                  /* RESTORE RETURN ADDRESS        */ 01438000
         LR    RRETURN,REG10                                    02S1123 01439000
*   RFY                                                         02S1124 01440000
*    (RLCB,                                                     02S1124 01441000
*     REG15,                                                    02S1124 01442000
*     REG10,                                                    02S1124 01443000
*     RRETURN,                                                  02S1124 01444000
*     RPARM) UNRSTD;                                            02S1124 01445000
*   END GETLCBNA;                                               02S1125 01446000
@EL00006 DS    0H                                               02S1125 01447000
@EF00006 DS    0H                                               02S1125 01448000
@ER00006 BR    @14                                              02S1125 01449000
*   END IGCC110D                                                01S1126 01450000
*                                                               01S1126 01451000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01452000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 01453000
*/*%INCLUDE SYSLIB  (TBDUD   )                                       */ 01454000
*/*%INCLUDE SYSLIB  (TCD0D   )                                       */ 01455000
*/*%INCLUDE SYSLIB  (TCD1D   )                                       */ 01456000
*/*%INCLUDE SYSLIB  (TCURD   )                                       */ 01457000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 01458000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 01459000
*/*%INCLUDE SYSLIB  (TDEBD   )                                       */ 01460000
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */ 01461000
*/*%INCLUDE SYSLIB  (TNCPID  )                                       */ 01462000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 01463000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 01464000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 01465000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 01466000
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */ 01467000
*/*%INCLUDE SYSLIB  (TRSPD   )                                       */ 01468000
*/*%INCLUDE SYSLIB  (TSNSD   )                                       */ 01469000
*/*%INCLUDE SYSLIB  (TTNTD   )                                       */ 01470000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 01471000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 01472000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 01473000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 01474000
*/*%INCLUDE SYSUT5  (RFY     )                                       */ 01475000
*/*%INCLUDE SYSUT5  (DCL     )                                       */ 01476000
*/*%INCLUDE SYSUT5  (PROLOGUE)                                       */ 01477000
*/*%INCLUDE SYSUT5  (PROCESS )                                       */ 01478000
*/*%INCLUDE SYSUT5  (INITIAL )                                       */ 01479000
*/*%INCLUDE SYSUT5  (RSPSRCH )                                       */ 01480000
*/*%INCLUDE SYSUT5  (DISPO   )                                       */ 01481000
*/*%INCLUDE SYSUT5  (ANSCHANI)                                       */ 01482000
*/*%INCLUDE SYSUT5  (SETREQST)                                       */ 01483000
*/*%INCLUDE SYSUT5  (INVOKDMP)                                       */ 01484000
*/*%INCLUDE SYSUT5  (LOWIN   )                                       */ 01485000
*/*%INCLUDE SYSUT5  (SCHDDACT)                                       */ 01486000
*/*%INCLUDE SYSUT5  (EPILOGUE)                                       */ 01487000
*/*%INCLUDE SYSUT5  (SEARCH  )                                       */ 01488000
*/*%INCLUDE SYSUT5  (CHAIN   )                                       */ 01489000
*/*%INCLUDE SYSUT5  (LOOKCOHT)                                       */ 01490000
*/*%INCLUDE SYSUT5  (RESPONSE)                                       */ 01491000
*/*%INCLUDE SYSUT5  (FID0RESP)                                       */ 01492000
*/*%INCLUDE SYSUT5  (FID1RESP)                                       */ 01493000
*/*%INCLUDE SYSUT5  (OPCEBLD )                                       */ 01494000
*/*%INCLUDE SYSUT5  (TPOSTELM)                                       */ 01495000
*/*%INCLUDE SYSUT5  (GETLCB  )                                       */ 01496000
*/*%INCLUDE SYSUT5  (GETLCBNA)                                       */ 01497000
*                                                               01S1126 01498000
*       ;                                                       01S1126 01499000
@DATA    DS    0H                                                       01500000
@SM03170 MVC   OCBACKUP(0,RPARM),TTENAME(REG15)                         01501000
         DS    0F                                                       01502000
         DS    0F                                                       01503000
@CF00065 DC    F'2'                                                     01504000
@CF00256 DC    F'4'                                                     01505000
@CF00045 DC    F'8'                                                     01506000
@CF03101 DC    F'10'                                                    01507000
@CF02443 DC    F'14'                                                    01508000
@CF00175 DC    F'16'                                                    01509000
@CF01140 DC    F'36'                                                    01510000
@CF03148 DC    F'82'                                                    01511000
@CF03163 DC    F'-8'                                                    01512000
@CF03169 DC    F'-5'                                                    01513000
@CF01989 DC    XL4'08000002'                                            01514000
@CF03167 DC    XL4'0000FFFF'                                            01515000
@CF00452 DC    XL4'1E'                                                  01516000
@CF00627 DC    XL4'20'                                                  01517000
         DS    0D                                                       01518000
@CB01989 DC    X'08000002'                                              01519000
@CB02439 DC    X'0B8000'                                                01520000
DISPDEST DC    CL2'00'                                                  01521000
DMPDEST  DC    CL2'MH'                                                  01522000
DACDEST  DC    CL2'FC'                                                  01523000
CU2DEST  DC    CL2'C1'                                                  01524000
ACTDEST  DC    CL2'FA'                                                  01525000
INOP     DS    CL3                                                      01526000
         ORG   INOP                                                     01527000
@NM00229 DC    X'01'                                                    01528000
@NM00230 DC    X'02'                                                    01529000
@NM00231 DC    X'81'                                                    01530000
         ORG   INOP+3                                                   01531000
IGCC110D CSECT                                                          01532000
*                                   /*                                  01533000
ENDC1     EQU    *                                                      01534000
SPACE     EQU    2048-(ENDC1-IGCC110D) SPACE FOR PATCH AREA             01535000
PATCH     DC     (SPACE)X'00'          PATCH AREA                       01536000
IGCC110D CSECT                                                          01537000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01538000
@01      EQU   01                                                       01539000
@02      EQU   02                                                       01540000
@03      EQU   03                                                       01541000
@04      EQU   04                                                       01542000
@05      EQU   05                                                       01543000
@06      EQU   06                                                       01544000
@07      EQU   07                                                       01545000
@08      EQU   08                                                       01546000
@09      EQU   09                                                       01547000
@10      EQU   10                                                       01548000
@11      EQU   11                                                       01549000
@12      EQU   12                                                       01550000
@13      EQU   13                                                       01551000
@14      EQU   14                                                       01552000
@15      EQU   15                                                       01553000
RCUR     EQU   @03                                                      01554000
LCBXPTR  EQU   @05                                                      01555000
ROPCE    EQU   @03                                                      01556000
ROPCAVT  EQU   @02                                                      01557000
RTRM     EQU   @08                                                      01558000
RAVT     EQU   @04                                                      01559000
RLCB     EQU   @09                                                      01560000
RPRF     EQU   @06                                                      01561000
REG00    EQU   @00                                                      01562000
RPARM    EQU   @01                                                      01563000
RCHAIN   EQU   @05                                                      01564000
RRUDATA  EQU   @05                                                      01565000
RELEM    EQU   @07                                                      01566000
REG09    EQU   @09                                                      01567000
REG10    EQU   @10                                                      01568000
REG11    EQU   @11                                                      01569000
RBASE    EQU   @12                                                      01570000
RSAVE    EQU   @13                                                      01571000
RRETURN  EQU   @14                                                      01572000
REG15    EQU   @15                                                      01573000
REG05    EQU   @05                                                      01574000
IEDQAVTD EQU   0                                                        01575000
AVTSAVEX EQU   IEDQAVTD+288                                             01576000
AVTREADD EQU   IEDQAVTD+380                                             01577000
AVTBUFSW EQU   IEDQAVTD+384                                             01578000
@NM00004 EQU   IEDQAVTD+388                                             01579000
AVTCKFLG EQU   @NM00004                                                 01580000
AVTBASE  EQU   IEDQAVTD+412                                             01581000
AVTPKF   EQU   AVTBASE                                                  01582000
AVTRNMPT EQU   IEDQAVTD+424                                             01583000
AVTOSECB EQU   IEDQAVTD+492                                             01584000
AVTECB1  EQU   AVTOSECB                                                 01585000
AVTHG02  EQU   IEDQAVTD+528                                             01586000
AVTDISP  EQU   IEDQAVTD+552                                             01587000
AVTHD    EQU   IEDQAVTD+556                                             01588000
AVTSCOPT EQU   AVTHD                                                    01589000
AVTSAVTP EQU   IEDQAVTD+612                                             01590000
AVTSAVTF EQU   AVTSAVTP                                                 01591000
AVTCKPEL EQU   IEDQAVTD+652                                             01592000
AVTCKRMV EQU   AVTCKPEL                                                 01593000
AVTCKELF EQU   IEDQAVTD+680                                             01594000
AVTCKBYT EQU   IEDQAVTD+691                                             01595000
AVTHG01  EQU   IEDQAVTD+692                                             01596000
AVTCKLNK EQU   IEDQAVTD+696                                             01597000
AVTCRELE EQU   IEDQAVTD+708                                             01598000
AVTCCELE EQU   AVTCRELE                                                 01599000
AVTCLRHI EQU   IEDQAVTD+716                                             01600000
AVTADBUF EQU   IEDQAVTD+720                                             01601000
AVTSYSER EQU   IEDQAVTD+728                                             01602000
AVTBFRFG EQU   IEDQAVTD+784                                             01603000
AVTCKPQB EQU   IEDQAVTD+804                                             01604000
AVTCKPTB EQU   AVTCKPQB                                                 01605000
AVTCKPEC EQU   AVTCKPQB+4                                               01606000
AVTCKPCC EQU   AVTCKPEC                                                 01607000
AVTOPCQB EQU   IEDQAVTD+816                                             01608000
AVTOPCOB EQU   AVTOPCQB                                                 01609000
AVTOPCEC EQU   AVTOPCQB+4                                               01610000
AVTOPCCC EQU   AVTOPCEC                                                 01611000
AVTOLTQB EQU   IEDQAVTD+828                                             01612000
AVTCWFL1 EQU   IEDQAVTD+924                                             01613000
AVTCWFL2 EQU   IEDQAVTD+925                                             01614000
AVTSUBT  EQU   IEDQAVTD+948                                             01615000
AVTIOTR  EQU   IEDQAVTD+949                                             01616000
AVTOPCON EQU   IEDQAVTD+1038                                            01617000
AVTAVFCT EQU   IEDQAVTD+1040                                            01618000
AVTBIT1  EQU   IEDQAVTD+1050                                            01619000
AVTBIT2  EQU   IEDQAVTD+1051                                            01620000
AVTBIT3  EQU   IEDQAVTD+1052                                            01621000
AVTDDFT  EQU   IEDQAVTD+1064                                            01622000
AVTOPCIN EQU   IEDQAVTD+1074                                            01623000
AVTBIT4  EQU   IEDQAVTD+1136                                            01624000
@NM00086 EQU   IEDQAVTD+1232                                            01625000
IEDQAPTR EQU   0                                                        01626000
IEDNSVTD EQU   0                                                        01627000
SAVTDIAG EQU   IEDNSVTD                                                 01628000
SAVTDIAF EQU   SAVTDIAG                                                 01629000
SAVTCLUP EQU   IEDNSVTD+72                                              01630000
SAVTLUSQ EQU   IEDNSVTD+88                                              01631000
SAVTTCPU EQU   IEDNSVTD+238                                             01632000
SAVTSCPT EQU   SAVTTCPU                                                 01633000
SAVTTNTX EQU   IEDNSVTD+252                                             01634000
SAVTLCBS EQU   IEDNSVTD+260                                             01635000
SAVTZELM EQU   IEDNSVTD+270                                             01636000
SAVTRDRV EQU   IEDNSVTD+284                                             01637000
SAVTCKQB EQU   IEDNSVTD+300                                             01638000
SAVTCKTB EQU   SAVTCKQB                                                 01639000
SAVTCKEC EQU   SAVTCKQB+4                                               01640000
SAVTCKCC EQU   SAVTCKEC                                                 01641000
IEDBDU   EQU   0                                                        01642000
BDUCMND  EQU   IEDBDU                                                   01643000
BDUFNFLG EQU   IEDBDU+2                                                 01644000
BDUSTHDR EQU   BDUFNFLG                                                 01645000
BDUFRSTB EQU   BDUFNFLG                                                 01646000
BDUBDUFG EQU   IEDBDU+3                                                 01647000
BDURSP   EQU   IEDBDU+4                                                 01648000
BDUSYRSP EQU   BDURSP                                                   01649000
BDUEXRSP EQU   BDURSP+1                                                 01650000
BDUEND   EQU   IEDBDU+6                                                 01651000
IEDCUREQ EQU   0                                                        01652000
CURQCB   EQU   IEDCUREQ+1                                               01653000
CURPRI   EQU   IEDCUREQ+4                                               01654000
CURELEM  EQU   IEDCUREQ+5                                               01655000
CURTOTIN EQU   IEDCUREQ+12                                              01656000
CURSWCH  EQU   CURTOTIN+1                                               01657000
CURFLG2  EQU   IEDCUREQ+14                                              01658000
CURF0FIN EQU   CURFLG2                                                  01659000
CURF1SEQ EQU   CURFLG2                                                  01660000
CURF1ID  EQU   CURFLG2                                                  01661000
CURENDCH EQU   CURFLG2                                                  01662000
CURFLG3  EQU   IEDCUREQ+15                                              01663000
CURNCURE EQU   CURFLG3                                                  01664000
CURPIUCT EQU   IEDCUREQ+16                                              01665000
CURTTCIN EQU   IEDCUREQ+20                                              01666000
CURTRM   EQU   IEDCUREQ+40                                              01667000
IHADCB   EQU   0                                                        01668000
DCBPTR   EQU   0                                                        01669000
IHADCS1A EQU   0                                                        01670000
DCBBCKUP EQU   IHADCS1A+8                                               01671000
IHADCS2K EQU   0                                                        01672000
DCBDUMPD EQU   IHADCS2K                                                 01673000
DCBTRSTA EQU   IHADCS2K+5                                               01674000
DCBDSORG EQU   IHADCS2K+6                                               01675000
DCBDSRG2 EQU   DCBDSORG+1                                               01676000
DCBIOBAD EQU   IHADCS2K+8                                               01677000
DCBRNCKD EQU   IHADCS2K+12                                              01678000
DCBEXLST EQU   IHADCS2K+16                                              01679000
DCBEIOBX EQU   DCBEXLST                                                 01680000
IHADCS24 EQU   0                                                        01681000
DCBOFLGS EQU   IHADCS24+8                                               01682000
DCBOFLWR EQU   DCBOFLGS                                                 01683000
DCBIFLG  EQU   IHADCS24+9                                               01684000
DCBIBPCT EQU   DCBIFLG                                                  01685000
DCBMACR  EQU   IHADCS24+10                                              01686000
DCBMACR1 EQU   DCBMACR                                                  01687000
DCBMRFE  EQU   DCBMACR1                                                 01688000
DCBMRGET EQU   DCBMRFE                                                  01689000
DCBMRAPG EQU   DCBMACR1                                                 01690000
DCBMRRD  EQU   DCBMRAPG                                                 01691000
DCBMRCI  EQU   DCBMACR1                                                 01692000
DCBMRMVG EQU   DCBMRCI                                                  01693000
DCBMRLCG EQU   DCBMACR1                                                 01694000
DCBMRABC EQU   DCBMACR1                                                 01695000
DCBMRPT1 EQU   DCBMRABC                                                 01696000
DCBMRSBG EQU   DCBMRPT1                                                 01697000
DCBMRCRL EQU   DCBMACR1                                                 01698000
DCBMRCHK EQU   DCBMRCRL                                                 01699000
DCBMRRDX EQU   DCBMRCHK                                                 01700000
DCBMRDMG EQU   DCBMACR1                                                 01701000
DCBMACR2 EQU   DCBMACR+1                                                01702000
DCBMRPUT EQU   DCBMACR2                                                 01703000
DCBMRWRT EQU   DCBMACR2                                                 01704000
DCBMRMVP EQU   DCBMACR2                                                 01705000
DCBMR5WD EQU   DCBMACR2                                                 01706000
DCBMRLDM EQU   DCBMR5WD                                                 01707000
DCBMRLCP EQU   DCBMRLDM                                                 01708000
DCBMR4WD EQU   DCBMACR2                                                 01709000
DCBMRPT2 EQU   DCBMR4WD                                                 01710000
DCBMRTMD EQU   DCBMRPT2                                                 01711000
DCBMR3WD EQU   DCBMACR2                                                 01712000
DCBMRCTL EQU   DCBMR3WD                                                 01713000
DCBMRSTK EQU   DCBMRCTL                                                 01714000
DCBMR1WD EQU   DCBMACR2                                                 01715000
DCBMRSWA EQU   DCBMR1WD                                                 01716000
DCBMRDMD EQU   DCBMRSWA                                                 01717000
IHADCS25 EQU   0                                                        01718000
DCBMACRF EQU   IHADCS25+2                                               01719000
DCBMACF1 EQU   DCBMACRF                                                 01720000
DCBMFFE  EQU   DCBMACF1                                                 01721000
DCBMFGET EQU   DCBMFFE                                                  01722000
DCBMFAPG EQU   DCBMACF1                                                 01723000
DCBMFRD  EQU   DCBMFAPG                                                 01724000
DCBMFCI  EQU   DCBMACF1                                                 01725000
DCBMFMVG EQU   DCBMFCI                                                  01726000
DCBMFLCG EQU   DCBMACF1                                                 01727000
DCBMFABC EQU   DCBMACF1                                                 01728000
DCBMFPT1 EQU   DCBMFABC                                                 01729000
DCBMFSBG EQU   DCBMFPT1                                                 01730000
DCBMFCRL EQU   DCBMACF1                                                 01731000
DCBMFCHK EQU   DCBMFCRL                                                 01732000
DCBMFDMG EQU   DCBMACF1                                                 01733000
DCBMACF2 EQU   DCBMACRF+1                                               01734000
DCBMFPUT EQU   DCBMACF2                                                 01735000
DCBMFWRT EQU   DCBMACF2                                                 01736000
DCBMFMVP EQU   DCBMACF2                                                 01737000
DCBMF5WD EQU   DCBMACF2                                                 01738000
DCBMFLDM EQU   DCBMF5WD                                                 01739000
DCBMFLCP EQU   DCBMFLDM                                                 01740000
DCBMF4WD EQU   DCBMACF2                                                 01741000
DCBMFPT2 EQU   DCBMF4WD                                                 01742000
DCBMFTMD EQU   DCBMFPT2                                                 01743000
DCBMF3WD EQU   DCBMACF2                                                 01744000
DCBMFCTL EQU   DCBMF3WD                                                 01745000
DCBMFSTK EQU   DCBMFCTL                                                 01746000
DCBMF1WD EQU   DCBMACF2                                                 01747000
DCBMFSWA EQU   DCBMF1WD                                                 01748000
DCBMFDMD EQU   DCBMFSWA                                                 01749000
DCBDEBAD EQU   IHADCS25+4                                               01750000
DCBIFLGS EQU   DCBDEBAD                                                 01751000
DCBIFPCT EQU   DCBIFLGS                                                 01752000
IHADCS27 EQU   0                                                        01753000
DCBGET   EQU   IHADCS27                                                 01754000
DCBPUT   EQU   DCBGET                                                   01755000
DCBGETA  EQU   DCBPUT+1                                                 01756000
IHADCS43 EQU   0                                                        01757000
DCBSCTAB EQU   IHADCS43                                                 01758000
IEDQDEB  EQU   0                                                        01759000
DEBPRF   EQU   IEDQDEB                                                  01760000
DEBAPVT  EQU   DEBPRF                                                   01761000
DEBTCBAD EQU   IEDQDEB+37                                               01762000
DEBNMEXT EQU   IEDQDEB+52                                               01763000
DEBUCBS  EQU   IEDQDEB+68                                               01764000
IEDQDPTR EQU   0                                                        01765000
IEDQLCB  EQU   0                                                        01766000
LCBRCB   EQU   IEDQLCB                                                  01767000
LCBTSOB  EQU   IEDQLCB+19                                               01768000
LCBCHAIN EQU   IEDQLCB+20                                               01769000
LCBSCRNN EQU   LCBCHAIN                                                 01770000
LCBTETEN EQU   LCBCHAIN                                                 01771000
LCBINSRC EQU   IEDQLCB+21                                               01772000
LCBLKMDE EQU   LCBINSRC+2                                               01773000
LCBNTXT  EQU   IEDQLCB+24                                               01774000
LCBSTAT4 EQU   LCBNTXT                                                  01775000
LCBDMPRQ EQU   LCBSTAT4                                                 01776000
LCBDACRQ EQU   LCBSTAT4                                                 01777000
LCBIPLRQ EQU   LCBSTAT4                                                 01778000
LCBACTRQ EQU   LCBSTAT4                                                 01779000
LCBPHASE EQU   LCBSTAT4                                                 01780000
LCBSCBDA EQU   IEDQLCB+25                                               01781000
LCBMHA   EQU   IEDQLCB+29                                               01782000
LCBFLAG1 EQU   IEDQLCB+32                                               01783000
LCBIOBSN EQU   IEDQLCB+33                                               01784000
LCBSNS   EQU   LCBIOBSN+1                                               01785000
LCBSENS0 EQU   LCBSNS                                                   01786000
LCBINTRQ EQU   LCBSENS0                                                 01787000
LCBEQUCK EQU   LCBSENS0                                                 01788000
LCBLOSDT EQU   LCBSENS0                                                 01789000
LCBNOTIN EQU   LCBLOSDT                                                 01790000
LCBTMOUT EQU   LCBSENS0                                                 01791000
LCBFLAG3 EQU   LCBIOBSN+7                                               01792000
LCBCSW   EQU   LCBIOBSN+8                                               01793000
LCBCSWST EQU   LCBCSW+3                                                 01794000
LCBCSWUS EQU   LCBCSWST                                                 01795000
LCBUSUC  EQU   LCBCSWUS                                                 01796000
LCBCSWCS EQU   LCBCSWST+1                                               01797000
LCBSIOCC EQU   LCBIOBSN+15                                              01798000
LCBSIOC1 EQU   LCBSIOCC                                                 01799000
LCBSIOC2 EQU   LCBSIOCC                                                 01800000
LCBDCBPT EQU   IEDQLCB+52                                               01801000
LCBRCQCB EQU   IEDQLCB+56                                               01802000
LCBRESTR EQU   LCBRCQCB                                                 01803000
LCBTHSQ  EQU   IEDQLCB+60                                               01804000
LCBINCAM EQU   LCBTHSQ                                                  01805000
LCBERRCT EQU   IEDQLCB+62                                               01806000
LCBLSPCI EQU   IEDQLCB+65                                               01807000
LCBRCBFR EQU   LCBLSPCI                                                 01808000
LCBSTATE EQU   IEDQLCB+70                                               01809000
LCBSTAT1 EQU   LCBSTATE                                                 01810000
LCBSTAT2 EQU   LCBSTATE+1                                               01811000
LCBBEOTN EQU   LCBSTAT2                                                 01812000
LCBSYNC  EQU   LCBSTAT2                                                 01813000
LCBDIAL  EQU   LCBSTAT2                                                 01814000
LCBTSTSW EQU   IEDQLCB+72                                               01815000
LCBERB   EQU   IEDQLCB+76                                               01816000
LCBERBST EQU   IEDQLCB+84                                               01817000
LCBDLNKN EQU   LCBERBST                                                 01818000
LCBERBCT EQU   IEDQLCB+88                                               01819000
LCBRBCT2 EQU   LCBERBCT+1                                               01820000
LCBTTCIN EQU   IEDQLCB+90                                               01821000
LCBMSGFM EQU   IEDQLCB+92                                               01822000
LCBOBRCH EQU   IEDQLCB+96                                               01823000
LCBINVPT EQU   LCBOBRCH+1                                               01824000
LCBBFRW  EQU   LCBINVPT                                                 01825000
LCBTPCD  EQU   IEDQLCB+100                                              01826000
LCBSTAT5 EQU   LCBTPCD                                                  01827000
LCBSTAT6 EQU   LCBTPCD+4                                                01828000
LCBRSPSV EQU   LCBTPCD+8                                                01829000
LCBSAVSN EQU   IEDQLCB+112                                              01830000
LCBERCCW EQU   IEDQLCB+120                                              01831000
LCBCPA   EQU   IEDQLCB+144                                              01832000
LCBCCW5  EQU   LCBCPA+32                                                01833000
LCBATTEL EQU   LCBCCW5                                                  01834000
LCBQEBPL EQU   LCBATTEL                                                 01835000
IEDQLPTR EQU   0                                                        01836000
IEDQLCBX EQU   0                                                        01837000
LCBXCON  EQU   IEDQLCBX                                                 01838000
LCBXFLAG EQU   LCBXCON                                                  01839000
LCBXDCT  EQU   LCBXCON+1                                                01840000
LCBXRADR EQU   LCBXCON+4                                                01841000
IEDNCP   EQU   0                                                        01842000
NCPFLAG1 EQU   IEDNCP+1                                                 01843000
NCPIAUTO EQU   NCPFLAG1                                                 01844000
NCPDAUTO EQU   NCPFLAG1                                                 01845000
NCPIPLD  EQU   NCPFLAG1                                                 01846000
IEDQOPCE EQU   0                                                        01847000
OCLINK   EQU   IEDQOPCE                                                 01848000
OCELEM   EQU   IEDQOPCE+4                                               01849000
OCELMPRI EQU   OCELEM                                                   01850000
OCUNIT   EQU   IEDQOPCE+8                                               01851000
OCRUDEST EQU   OCUNIT                                                   01852000
OCCKPKEY EQU   OCRUDEST                                                 01853000
OCSCAN   EQU   OCCKPKEY                                                 01854000
OCOPTCDE EQU   IEDQOPCE+12                                              01855000
OCSWITCH EQU   IEDQOPCE+13                                              01856000
OCFLAG   EQU   IEDQOPCE+14                                              01857000
OCCONSOL EQU   OCFLAG                                                   01858000
OCATTACH EQU   OCFLAG                                                   01859000
@NM00163 EQU   IEDQOPCE+16                                              01860000
OCDEST   EQU   @NM00163                                                 01861000
OCREQVAL EQU   OCDEST+1                                                 01862000
OCTRMTBL EQU   IEDQOPCE+20                                              01863000
OCLINENO EQU   IEDQOPCE+22                                              01864000
OCTIOT   EQU   OCLINENO                                                 01865000
OCTRUNIT EQU   IEDQOPCE+24                                              01866000
OCRSID   EQU   OCTRUNIT                                                 01867000
OCALSTAT EQU   OCRSID                                                   01868000
OCSEQ    EQU   OCTRUNIT+2                                               01869000
OCPARM   EQU   IEDQOPCE+28                                              01870000
OCWTG    EQU   IEDQOPCE+30                                              01871000
OCBACKUP EQU   IEDQOPCE+32                                              01872000
OCMODNME EQU   IEDQOPCE+40                                              01873000
OCIPLWA  EQU   OCMODNME                                                 01874000
OCCKDATA EQU   IEDQOPCE+48                                              01875000
OCRSTGTM EQU   OCCKDATA                                                 01876000
IEDQOPCN EQU   0                                                        01877000
OCLDNME  EQU   IEDQOPCN                                                 01878000
OCLINTTE EQU   OCLDNME                                                  01879000
OCREQFLG EQU   OCLINTTE+2                                               01880000
OCPREFLG EQU   OCLINTTE+3                                               01881000
OCBFREQ  EQU   OCPREFLG                                                 01882000
OCRSPSNT EQU   OCPREFLG                                                 01883000
IEDQOPCD EQU   0                                                        01884000
OPCAVTPT EQU   IEDQOPCD+8                                               01885000
OPCCOPCE EQU   IEDQOPCD+12                                              01886000
OPCSAVE  EQU   IEDQOPCD+56                                              01887000
OPCAQCTL EQU   IEDQOPCD+180                                             01888000
OPCXCTL  EQU   IEDQOPCD+204                                             01889000
OPCLDNME EQU   IEDQOPCD+212                                             01890000
OPCMODID EQU   OPCLDNME+3                                               01891000
OPCWAITN EQU   IEDQOPCD+228                                             01892000
OPCHORT  EQU   IEDQOPCD+256                                             01893000
OPCSCNC  EQU   IEDQOPCD+264                                             01894000
OPCFMDFC EQU   IEDQOPCD+268                                             01895000
OPCNEXT  EQU   IEDQOPCD+272                                             01896000
OPCGETBF EQU   IEDQOPCD+276                                             01897000
OPCFREBF EQU   IEDQOPCD+280                                             01898000
OPCSPEC  EQU   IEDQOPCD+300                                             01899000
OPCPWCOB EQU   IEDQOPCD+368                                             01900000
OPCPWQCB EQU   OPCPWCOB                                                 01901000
OPCPWECB EQU   OPCPWCOB+4                                               01902000
IEDQPRF  EQU   0                                                        01903000
PRFRCB   EQU   IEDQPRF                                                  01904000
PRFKEY   EQU   PRFRCB                                                   01905000
PRFQCBA  EQU   PRFRCB+1                                                 01906000
PRFPRI   EQU   PRFRCB+4                                                 01907000
PRFLINK  EQU   PRFRCB+5                                                 01908000
PRFTIC   EQU   IEDQPRF+8                                                01909000
PRFTICC  EQU   PRFTIC                                                   01910000
PRFNBUNT EQU   IEDQPRF+12                                               01911000
PRFSUNIT EQU   PRFNBUNT                                                 01912000
PRFPLQCB EQU   PRFSUNIT                                                 01913000
@NM00193 EQU   IEDQPRF+16                                               01914000
PRFSVFFO EQU   @NM00193                                                 01915000
PRFSRCE  EQU   PRFSVFFO                                                 01916000
PRFSTAT1 EQU   IEDQPRF+20                                               01917000
PRFEOFN  EQU   PRFSTAT1                                                 01918000
PRFCORE  EQU   IEDQPRF+21                                               01919000
PRFXTRA  EQU   PRFCORE                                                  01920000
PRFSCAN  EQU   IEDQPRF+24                                               01921000
PRFISIZE EQU   PRFSCAN+1                                                01922000
PRFTQBCK EQU   IEDQPRF+26                                               01923000
PRFNTXT  EQU   PRFTQBCK                                                 01924000
PRFEOBOF EQU   PRFNTXT                                                  01925000
PRFCHDR  EQU   IEDQPRF+32                                               01926000
PRFHQBCK EQU   IEDQPRF+35                                               01927000
PRFDEST  EQU   IEDQPRF+40                                               01928000
IEDQPPTR EQU   0                                                        01929000
IEDPF1   EQU   0                                                        01930000
PRF1RH   EQU   IEDPF1                                                   01931000
PRF1FLG1 EQU   IEDPF1+3                                                 01932000
PRF1FIDI EQU   PRF1FLG1                                                 01933000
PRF1EXPI EQU   PRF1FLG1                                                 01934000
PRF1FORM EQU   PRF1FLG1                                                 01935000
PRF1WD2  EQU   IEDPF1+4                                                 01936000
PRF1SEQP EQU   PRF1WD2                                                  01937000
PRF1SQID EQU   PRF1SEQP                                                 01938000
PRF1TAG1 EQU   PRF1SQID                                                 01939000
IEDPF2   EQU   0                                                        01940000
PRF2FLG2 EQU   IEDPF2                                                   01941000
PRF2WD2  EQU   IEDPF2+4                                                 01942000
IEDQQCB  EQU   0                                                        01943000
QCBDSFLG EQU   IEDQQCB                                                  01944000
QCBDISK  EQU   QCBDSFLG                                                 01945000
QCBELCHN EQU   IEDQQCB+1                                                01946000
QCBEOLDT EQU   IEDQQCB+16                                               01947000
QCBBYTE1 EQU   QCBEOLDT+1                                               01948000
QCBLKRLN EQU   IEDQQCB+18                                               01949000
QCBRETCT EQU   QCBLKRLN                                                 01950000
QCBSTAT  EQU   IEDQQCB+19                                               01951000
QCBINSRC EQU   IEDQQCB+21                                               01952000
@NM00203 EQU   QCBINSRC                                                 01953000
QCBTSOF2 EQU   @NM00203+1                                               01954000
QCBTSOF1 EQU   @NM00203+2                                               01955000
QCBINTVL EQU   IEDQQCB+24                                               01956000
QCBPREN  EQU   IEDQQCB+28                                               01957000
QCBLKRRN EQU   QCBPREN+1                                                01958000
QCBDCBAD EQU   IEDQQCB+33                                               01959000
QCBFLAG  EQU   IEDQQCB+36                                               01960000
IEDQQPTR EQU   0                                                        01961000
IEDQPQCB EQU   0                                                        01962000
QCBFHDLZ EQU   IEDQPQCB+3                                               01963000
QCBPFEFO EQU   QCBFHDLZ+1                                               01964000
QCBFHDTZ EQU   IEDQPQCB+6                                               01965000
QCBINTLF EQU   IEDQPQCB+12                                              01966000
IEDNQCB  EQU   0                                                        01967000
QCBSTAT1 EQU   IEDNQCB+4                                                01968000
QCBPLCBA EQU   IEDNQCB+5                                                01969000
IEDSNSD  EQU   0                                                        01970000
SNSSYSTM EQU   IEDSNSD                                                  01971000
SNSUSER  EQU   IEDSNSD+2                                                01972000
SNSPTR   EQU   0                                                        01973000
IEDQTNTD EQU   0                                                        01974000
IEDQTCDE EQU   IEDQTNTD                                                 01975000
TNTENLEN EQU   IEDQTNTD+40                                              01976000
IEDQTDCE EQU   IEDQTNTD+46                                              01977000
IEDQNPTR EQU   0                                                        01978000
TNTFIRST EQU   0                                                        01979000
IEDTNTA  EQU   0                                                        01980000
IEDRH    EQU   0                                                        01981000
TRHBYTE0 EQU   IEDRH                                                    01982000
TRHTYPE  EQU   TRHBYTE0                                                 01983000
TRHRUCAT EQU   TRHBYTE0                                                 01984000
TRHFI    EQU   TRHBYTE0                                                 01985000
TRHSDI   EQU   TRHBYTE0                                                 01986000
TRHBC    EQU   TRHBYTE0                                                 01987000
TRHEC    EQU   TRHBYTE0                                                 01988000
TRHBYTE1 EQU   IEDRH+1                                                  01989000
TRHDR1   EQU   TRHBYTE1                                                 01990000
TRHBYTE2 EQU   IEDRH+2                                                  01991000
IEDTRM   EQU   0                                                        01992000
IEDNTRM  EQU   IEDTRM                                                   01993000
TRMBYTE4 EQU   IEDNTRM                                                  01994000
TRMBYTE3 EQU   IEDNTRM+1                                                01995000
TRMBYTE2 EQU   IEDNTRM+2                                                01996000
TRMINPG  EQU   TRMBYTE2                                                 01997000
TRMBYTE1 EQU   IEDNTRM+3                                                01998000
TRMSCPRQ EQU   TRMBYTE1                                                 01999000
TRMBYTE0 EQU   IEDNTRM+6                                                02000000
TRMSIBPT EQU   IEDNTRM+7                                                02001000
TRMTYPE  EQU   IEDNTRM+11                                               02002000
IEDQTRM  EQU   IEDTRM+14                                                02003000
TRMSTATE EQU   IEDQTRM                                                  02004000
TRMLOG   EQU   TRMSTATE                                                 02005000
TRMDESTQ EQU   IEDQTRM+1                                                02006000
TRMINSEQ EQU   IEDQTRM+4                                                02007000
TLISTCNT EQU   TRMINSEQ                                                 02008000
TRMOUTSQ EQU   IEDQTRM+6                                                02009000
TLISTEN  EQU   TRMOUTSQ                                                 02010000
TRMDSORG EQU   TLISTEN                                                  02011000
TRMALTD  EQU   IEDQTRM+8                                                02012000
TRMDEVFL EQU   IEDQTRM+10                                               02013000
TRMSTAT  EQU   IEDQTRM+12                                               02014000
IEDTH    EQU   0                                                        02015000
TTHBYTE0 EQU   IEDTH                                                    02016000
TTHSNF   EQU   IEDTH+6                                                  02017000
TTHTAG   EQU   TTHSNF                                                   02018000
TTHTAG1  EQU   TTHTAG                                                   02019000
UCB      EQU   0                                                        02020000
UCBPTR   EQU   0                                                        02021000
UCBOB    EQU   0                                                        02022000
UCBJBNR  EQU   UCBOB                                                    02023000
UCBFL5   EQU   UCBOB+1                                                  02024000
UCBAF    EQU   UCBFL5                                                   02025000
UCBSTAT  EQU   UCBOB+3                                                  02026000
UCBCHAN  EQU   UCBOB+4                                                  02027000
UCBSFLS  EQU   UCBOB+6                                                  02028000
UCBFLA   EQU   UCBSFLS                                                  02029000
UCBFL1   EQU   UCBFLA                                                   02030000
UCBBSY   EQU   UCBFL1                                                   02031000
UCBNRY   EQU   UCBFL1                                                   02032000
UCBPST   EQU   UCBFL1                                                   02033000
UCBCUB   EQU   UCBFL1                                                   02034000
UCBFLB   EQU   UCBSFLS+1                                                02035000
UCBCHM   EQU   UCBOB+8                                                  02036000
UCBCHM1  EQU   UCBCHM                                                   02037000
UCBPTH0  EQU   UCBCHM1                                                  02038000
UCBPTH1  EQU   UCBCHM1                                                  02039000
UCBWGT   EQU   UCBOB+12                                                 02040000
UCBNAME  EQU   UCBOB+13                                                 02041000
UCBTYP   EQU   UCBOB+16                                                 02042000
UCBTBYT1 EQU   UCBTYP                                                   02043000
UCB1FEA5 EQU   UCBTBYT1                                                 02044000
UCB1FEA6 EQU   UCBTBYT1                                                 02045000
UCBTBYT2 EQU   UCBTYP+1                                                 02046000
UCB2OPT2 EQU   UCBTBYT2                                                 02047000
UCBDUDN1 EQU   UCB2OPT2                                                 02048000
UCB2OPT3 EQU   UCBTBYT2                                                 02049000
UCBDUDN2 EQU   UCB2OPT3                                                 02050000
UCB2OPT4 EQU   UCBTBYT2                                                 02051000
UCBRWTAU EQU   UCB2OPT4                                                 02052000
UCB2OPT6 EQU   UCBTBYT2                                                 02053000
UCB2OPT7 EQU   UCBTBYT2                                                 02054000
UCBTBYT3 EQU   UCBTYP+2                                                 02055000
UCBDVCLS EQU   UCBTBYT3                                                 02056000
UCBTBYT4 EQU   UCBTYP+3                                                 02057000
UCBEXTPT EQU   UCBOB+20                                                 02058000
UCBFLC   EQU   UCBEXTPT                                                 02059000
UCBDEV   EQU   UCBOB+24                                                 02060000
UCBCMEXT EQU   0                                                        02061000
UCBATI   EQU   UCBCMEXT+3                                               02062000
@NM00228 EQU   UCBATI                                                   02063000
UCBFLP1  EQU   UCBCMEXT+5                                               02064000
UCBMT    EQU   0                                                        02065000
UCBOCR   EQU   0                                                        02066000
UCB3540X EQU   0                                                        02067000
UCBDKBYT EQU   UCB3540X+6                                               02068000
UCB3800X EQU   0                                                        02069000
UCBOPTNS EQU   UCB3800X                                                 02070000
UCBACTIV EQU   UCB3800X+3                                               02071000
UCBMDRBF EQU   UCB3800X+36                                              02072000
UCBUCS   EQU   0                                                        02073000
UCBUCSOP EQU   UCBUCS+4                                                 02074000
UCBFCBOP EQU   UCBUCS+5                                                 02075000
OPCECLR  EQU   0                                                        02076000
TTENAME  EQU   0                                                        02077000
IEDQTNT  EQU   0                                                        02078000
ALLOCBUF EQU   0                                                        02079000
FREEBUFF EQU   0                                                        02080000
COHORTLK EQU   0                                                        02081000
IEDQTL   EQU   0                                                        02082000
IEDIAP04 EQU   0                                                        02083000
IEDIAP06 EQU   0                                                        02084000
SENSDAT  EQU   0                                                        02085000
CATAGORY EQU   SENSDAT                                                  02086000
MODIFIER EQU   SENSDAT+1                                                02087000
USERDATA EQU   SENSDAT+2                                                02088000
RUDATA   EQU   0                                                        02089000
RUDATA3  EQU   RUDATA                                                   02090000
RUDATA2  EQU   RUDATA3                                                  02091000
CURCLEAR EQU   0                                                        02092000
DEBSUBR  EQU   0                                                        02093000
QCBLDCB  EQU   0                                                        02094000
TNTCODE  EQU   0                                                        02095000
TNTDCODE EQU   0                                                        02096000
UCBBGN   EQU   0                                                        02097000
UCBDCPTR EQU   0                                                        02098000
DEBUCB   EQU   DEBUCBS                                                  02099000
DEBDVMOD EQU   DEBUCB                                                   02100000
DEBUCBAD EQU   DEBUCB+1                                                 02101000
LCBRSPIN EQU   LCBIOBSN                                                 02102000
LCBLUSNS EQU   LCBRSPIN+5                                               02103000
LCBSCPRS EQU   LCBRSPIN+9                                               02104000
LCBCSWU1 EQU   LCBSCPRS+2                                               02105000
LCBRSPFG EQU   LCBRSPIN+15                                              02106000
LCBCOREQ EQU   LCBTPCD                                                  02107000
@NM00145 EQU   LCBCPA+40                                                02108000
LCBQNX   EQU   LCBERCCW                                                 02109000
LCBQNXMN EQU   LCBQNX                                                   02110000
LCBCANCL EQU   LCBSAVSN                                                 02111000
LCBCANFG EQU   LCBCANCL                                                 02112000
OCCKPKY1 EQU   OCCKPKEY                                                 02113000
OCCKPTYP EQU   OCCKPKY1                                                 02114000
OCICACTN EQU   OCMODNME                                                 02115000
OCICDADR EQU   OCICACTN                                                 02116000
OCICSW   EQU   OCICDADR+3                                               02117000
OPCAQWD  EQU   OPCAQCTL                                                 02118000
OPCAQWD1 EQU   OPCAQWD                                                  02119000
OPCAQREQ EQU   OPCAQWD1                                                 02120000
OPCAQWD2 EQU   OPCAQWD+4                                                02121000
OPCAQRQ2 EQU   OPCAQWD2                                                 02122000
OPCAQWD3 EQU   OPCAQWD+8                                                02123000
PRFSHDR  EQU   IEDQPRF+42                                               02124000
TRMPRE1  EQU   TRMBYTE4                                                 02125000
TRMNCP1  EQU   TRMBYTE4                                                 02126000
TRMINOP  EQU   TRMNCP1                                                  02127000
TRMPRE   EQU   TRMBYTE3                                                 02128000
TRMNCP   EQU   TRMBYTE3                                                 02129000
TRMSYGEN EQU   TRMNCP                                                   02130000
TRMPU    EQU   TRMBYTE3                                                 02131000
TRMLU    EQU   TRMBYTE3                                                 02132000
TRMLINK  EQU   TRMBYTE3                                                 02133000
UCBOBS01 EQU   UCBDEV                                                   02134000
UCBSTAB  EQU   UCBOBS01+10                                              02135000
UCBBSVL  EQU   UCBSTAB                                                  02136000
UCBPRSRS EQU   UCBSTAB                                                  02137000
UCBDMCT  EQU   UCBOBS01+11                                              02138000
UCBFL4   EQU   UCBOBS01+13                                              02139000
UCBOBS02 EQU   UCBDEV                                                   02140000
UCBTFL1  EQU   UCBOBS02+19                                              02141000
UCBXTN   EQU   UCBOBS02+20                                              02142000
UCBVOPT  EQU   UCBXTN                                                   02143000
UCBOBS03 EQU   UCBDEV                                                   02144000
UCBXTADR EQU   UCBOBS03                                                 02145000
UCBOBS04 EQU   UCBDEV                                                   02146000
UCBBTA   EQU   UCBOBS04+12                                              02147000
UCBOBS06 EQU   UCBDEV                                                   02148000
UCBAOF   EQU   UCBOBS06                                                 02149000
UCBAOF1  EQU   UCBAOF                                                   02150000
UCBAOF2  EQU   UCBAOF+1                                                 02151000
@NM00227 EQU   UCBOBS06+3                                               02152000
UCBIRB   EQU   UCBOBS06+4                                               02153000
UCBGRAF  EQU   UCBIRB                                                   02154000
UCBLDNCA EQU   UCBOBS06+8                                               02155000
UCBRDYQ  EQU   UCBLDNCA                                                 02156000
UCBIRLN  EQU   UCBRDYQ                                                  02157000
UCBLDNCB EQU   UCBRDYQ+1                                                02158000
UCBCTLNK EQU   UCBOBS06+12                                              02159000
UCBOBS07 EQU   UCBDEV                                                   02160000
UCBOBS08 EQU   UCBDEV                                                   02161000
UCBCTCAD EQU   UCBOBS08                                                 02162000
UCBCTCF1 EQU   UCBOBS08+4                                               02163000
UCBOBS09 EQU   UCBDEV                                                   02164000
BDUTEXT  EQU   BDUEND                                                   02165000
OCCIB    EQU   OCREQVAL                                                 02166000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02167000
UCBRV066 EQU   UCBOBS09+4                                               02168000
UCBIOSBA EQU   UCBOBS09                                                 02169000
UCBRV042 EQU   UCBOBS08+5                                               02170000
UCBRV082 EQU   UCBCTCF1                                                 02171000
UCBRV081 EQU   UCBCTCF1                                                 02172000
UCBRV080 EQU   UCBCTCF1                                                 02173000
UCBRV079 EQU   UCBCTCF1                                                 02174000
UCBRV078 EQU   UCBCTCF1                                                 02175000
UCBRV077 EQU   UCBCTCF1                                                 02176000
UCBRV076 EQU   UCBCTCF1                                                 02177000
UCBCTC80 EQU   UCBCTCF1                                                 02178000
UCBCTCAL EQU   UCBCTCAD                                                 02179000
UCBICNCB EQU   UCBOBS07+4                                               02180000
UCBRV040 EQU   UCBOBS07                                                 02181000
UCBCTLNA EQU   UCBCTLNK+1                                               02182000
UCBRLN   EQU   UCBCTLNK                                                 02183000
UCBRDYQA EQU   UCBLDNCB                                                 02184000
UCBINRLN EQU   UCBIRLN                                                  02185000
UCBIRBA  EQU   UCBIRB+1                                                 02186000
UCBRV039 EQU   UCBGRAF                                                  02187000
UCBDWNR  EQU   UCBGRAF                                                  02188000
UCBRPND  EQU   UCBGRAF                                                  02189000
UCBUPM   EQU   UCBGRAF                                                  02190000
UCBBTAM  EQU   UCBGRAF                                                  02191000
UCBDRNO  EQU   UCBGRAF                                                  02192000
UCBDRO   EQU   UCBGRAF                                                  02193000
UCBOIP   EQU   UCBGRAF                                                  02194000
UCBATRCD EQU   @NM00227                                                 02195000
UCBSKPFG EQU   @NM00227                                                 02196000
UCBRIPND EQU   @NM00227                                                 02197000
UCBRTIAC EQU   @NM00227                                                 02198000
UCBRSV79 EQU   @NM00227                                                 02199000
UCBRSV78 EQU   @NM00227                                                 02200000
UCBRSV77 EQU   @NM00227                                                 02201000
UCBOLTEP EQU   @NM00227                                                 02202000
UCBATNCT EQU   UCBOBS06+2                                               02203000
UCBRSV76 EQU   UCBAOF2                                                  02204000
UCBRSV75 EQU   UCBAOF2                                                  02205000
UCBRSV74 EQU   UCBAOF2                                                  02206000
UCBRSV73 EQU   UCBAOF2                                                  02207000
UCBRSV72 EQU   UCBAOF2                                                  02208000
UCBRSV71 EQU   UCBAOF2                                                  02209000
UCBRSV70 EQU   UCBAOF2                                                  02210000
UCBRSV69 EQU   UCBAOF2                                                  02211000
UCBRSV68 EQU   UCBAOF1                                                  02212000
UCBRSV67 EQU   UCBAOF1                                                  02213000
UCBRSV66 EQU   UCBAOF1                                                  02214000
UCBRSV65 EQU   UCBAOF1                                                  02215000
UCBRSV64 EQU   UCBAOF1                                                  02216000
UCBOFNL  EQU   UCBAOF1                                                  02217000
UCBOFSP  EQU   UCBAOF1                                                  02218000
UCBOFMCR EQU   UCBAOF1                                                  02219000
UCBBTB   EQU   UCBBTA+1                                                 02220000
UCBDI    EQU   UCBBTA                                                   02221000
UCBSNS   EQU   UCBOBS04+8                                               02222000
UCBTEB   EQU   UCBOBS04+4                                               02223000
UCBGCB   EQU   UCBOBS04+3                                               02224000
UCBOPEN  EQU   UCBOBS04+2                                               02225000
UCBSTART EQU   UCBOBS04                                                 02226000
UCBXTNB  EQU   UCBXTN+1                                                 02227000
UCBRSV22 EQU   UCBVOPT                                                  02228000
UCBRSV21 EQU   UCBVOPT                                                  02229000
UCBRSV20 EQU   UCBVOPT                                                  02230000
UCBESVE  EQU   UCBVOPT                                                  02231000
UCBERPC  EQU   UCBVOPT                                                  02232000
UCBESVC  EQU   UCBVOPT                                                  02233000
UCBEVA   EQU   UCBVOPT                                                  02234000
UCBESV   EQU   UCBVOPT                                                  02235000
UCBRV009 EQU   UCBTFL1                                                  02236000
UCBRV008 EQU   UCBTFL1                                                  02237000
UCBRV007 EQU   UCBTFL1                                                  02238000
UCBRV006 EQU   UCBTFL1                                                  02239000
UCBRV005 EQU   UCBTFL1                                                  02240000
UCBRV038 EQU   UCBTFL1                                                  02241000
UCBNSLTP EQU   UCBTFL1                                                  02242000
UCBNLTP  EQU   UCBTFL1                                                  02243000
UCBRES1B EQU   UCBOBS02+18                                              02244000
UCBFSER  EQU   UCBOBS02+12                                              02245000
@NM00226 EQU   UCBOBS02+4                                               02246000
UCBFSEQ  EQU   UCBOBS02+2                                               02247000
UCBFSCT  EQU   UCBOBS02                                                 02248000
UCBNEXP  EQU   UCBOBS01+20                                              02249000
UCBBASE  EQU   UCBOBS01+16                                              02250000
UCBRES1A EQU   UCBOBS01+15                                              02251000
UCBUSER  EQU   UCBOBS01+14                                              02252000
UCBFL47  EQU   UCBFL4                                                   02253000
UCBFL46  EQU   UCBFL4                                                   02254000
UCBFL45  EQU   UCBFL4                                                   02255000
UCBRV065 EQU   UCBFL4                                                   02256000
UCBDSS   EQU   UCBFL4                                                   02257000
UCBRV028 EQU   UCBFL4                                                   02258000
UCBWDAV  EQU   UCBFL4                                                   02259000
UCBDAVV  EQU   UCBFL4                                                   02260000
UCBSQC   EQU   UCBOBS01+12                                              02261000
UCBDATP  EQU   UCBOBS01+12                                              02262000
UCBDMC   EQU   UCBDMCT                                                  02263000
UCBMOUNT EQU   UCBDMCT                                                  02264000
UCBBNUL  EQU   UCBSTAB                                                  02265000
UCBSHAR  EQU   UCBSTAB                                                  02266000
UCBBSTR  EQU   UCBSTAB                                                  02267000
UCBBPUB  EQU   UCBSTAB                                                  02268000
UCBBPRV  EQU   UCBSTAB                                                  02269000
UCBBALB  EQU   UCBPRSRS                                                 02270000
UCBPGFL  EQU   UCBSTAB                                                  02271000
UCBDVSHR EQU   UCBBSVL                                                  02272000
UCBVOLI  EQU   UCBOBS01+4                                               02273000
UCBVTOC  EQU   UCBOBS01                                                 02274000
@NM00222 EQU   TRMLINK                                                  02275000
TRMLSTAT EQU   TRMLINK                                                  02276000
TRMLINT  EQU   TRMLINK                                                  02277000
TRMEPMOD EQU   TRMLINK                                                  02278000
TRMLULOG EQU   TRMLU                                                    02279000
TRMINERR EQU   TRMLU                                                    02280000
TRMLUREQ EQU   TRMLU                                                    02281000
TRMSESRQ EQU   TRMLU                                                    02282000
TRMTDIFF EQU   TRMLU                                                    02283000
TRMLUTM  EQU   TRMLU                                                    02284000
TRMLUIT  EQU   TRMLU                                                    02285000
TRMAUTO  EQU   TRMLU                                                    02286000
TRMPCONT EQU   TRMPU                                                    02287000
@NM00221 EQU   TRMPU                                                    02288000
TRMNCONT EQU   TRMNCP                                                   02289000
TRMQUCKN EQU   TRMNCP                                                   02290000
TRMSLOWN EQU   TRMNCP                                                   02291000
TRMNCPCL EQU   TRMNCP                                                   02292000
TRMIPLDM EQU   TRMNCP                                                   02293000
TRMINOUT EQU   TRMPRE                                                   02294000
TRMRDOUT EQU   TRMPRE                                                   02295000
TRMNLOUT EQU   TRMPRE                                                   02296000
TRMWROUT EQU   TRMPRE                                                   02297000
TRMASNXI EQU   TRMPRE                                                   02298000
TRMSTMM  EQU   TRMPRE                                                   02299000
TRMCMODE EQU   TRMPRE                                                   02300000
TRMSTPND EQU   TRMPRE                                                   02301000
@NM00220 EQU   TRMNCP1                                                  02302000
TRMLYNCH EQU   TRMPRE1                                                  02303000
TRMSPOUT EQU   TRMPRE1                                                  02304000
TRMERLCK EQU   TRMPRE1                                                  02305000
TRMQNPL  EQU   TRMPRE1                                                  02306000
TRMSPACT EQU   TRMPRE1                                                  02307000
TRMOCNI  EQU   TRMPRE1                                                  02308000
TRMSESSN EQU   TRMPRE1                                                  02309000
TRMCONT  EQU   TRMPRE1                                                  02310000
OPCAQLST EQU   OPCAQWD3+1                                               02311000
OPCAQRQ3 EQU   OPCAQWD3                                                 02312000
OPCAQSEC EQU   OPCAQWD2+1                                               02313000
OPCAQFST EQU   OPCAQWD1+1                                               02314000
OCICINAC EQU   OCICSW                                                   02315000
@NM00168 EQU   OCICSW                                                   02316000
OCICATST EQU   OCICDADR+1                                               02317000
OCICTYPE EQU   OCICDADR                                                 02318000
@NM00167 EQU   OCCKPKY1                                                 02319000
OCCKPENV EQU   OCCKPKY1                                                 02320000
OCCKPRST EQU   OCCKPTYP                                                 02321000
OCCKPNCP EQU   OCCKPTYP                                                 02322000
OCCKPINC EQU   OCCKPTYP                                                 02323000
@NM00153 EQU   LCBCANCL+3                                               02324000
LCBCANTH EQU   LCBCANCL+1                                               02325000
@NM00152 EQU   LCBCANFG                                                 02326000
LCBCANCD EQU   LCBCANFG                                                 02327000
@NM00151 EQU   LCBCANFG                                                 02328000
LCBCANEB EQU   LCBCANFG                                                 02329000
LCBCANXT EQU   LCBCANFG                                                 02330000
LCBUNADD EQU   LCBQNX+21                                                02331000
LCBUASZE EQU   LCBQNX+20                                                02332000
LCBDSTEA EQU   LCBQNX+16                                                02333000
@NM00150 EQU   LCBQNX+8                                                 02334000
LCBIOSBS EQU   LCBQNX+5                                                 02335000
@NM00149 EQU   LCBQNX+4                                                 02336000
LCBSTSAV EQU   LCBQNX+1                                                 02337000
@NM00148 EQU   LCBQNXMN                                                 02338000
LCBNX509 EQU   LCBQNXMN                                                 02339000
LCBNX162 EQU   LCBQNXMN                                                 02340000
LCBNX142 EQU   LCBQNXMN                                                 02341000
LCBNX064 EQU   LCBQNXMN                                                 02342000
@NM00147 EQU   @NM00145+4                                               02343000
LCBNCPPT EQU   @NM00145+1                                               02344000
@NM00146 EQU   @NM00145                                                 02345000
LCBWRSCH EQU   LCBCOREQ+8                                               02346000
LCBCQLNK EQU   LCBCOREQ+4                                               02347000
LCBCQELE EQU   LCBCOREQ                                                 02348000
LCBPAKCH EQU   LCBRSPIN+16                                              02349000
@NM00144 EQU   LCBRSPFG                                                 02350000
LCBRSRH  EQU   LCBRSPFG                                                 02351000
LCBEXPI  EQU   LCBRSPFG                                                 02352000
@NM00143 EQU   LCBRSPIN+12                                              02353000
LCBUSUE1 EQU   LCBCSWU1                                                 02354000
@NM00142 EQU   LCBCSWU1                                                 02355000
@NM00141 EQU   LCBSCPRS+1                                               02356000
LCBDFCMD EQU   LCBSCPRS                                                 02357000
LCBUSER  EQU   LCBLUSNS+2                                               02358000
LCBSMIN  EQU   LCBLUSNS+1                                               02359000
LCBSMAJ  EQU   LCBLUSNS                                                 02360000
LCBRHSV  EQU   LCBRSPIN+2                                               02361000
LCBSNS0  EQU   LCBRSPIN+1                                               02362000
@NM00140 EQU   LCBRSPIN                                                 02363000
@NM00232 EQU   RUDATA+5                                                 02364000
RUNA     EQU   RUDATA+3                                                 02365000
RUDATA1  EQU   RUDATA2                                                  02366000
UCBERADR EQU   UCBUCS+12                                                02367000
UCBFCBID EQU   UCBUCS+8                                                 02368000
UCBERCNT EQU   UCBUCS+7                                                 02369000
UCBRSV51 EQU   UCBUCS+6                                                 02370000
UCBRSV50 EQU   UCBFCBOP                                                 02371000
UCBRSV49 EQU   UCBFCBOP                                                 02372000
UCBRSV48 EQU   UCBFCBOP                                                 02373000
UCBRSV47 EQU   UCBFCBOP                                                 02374000
UCBRSV46 EQU   UCBFCBOP                                                 02375000
UCBRSV45 EQU   UCBFCBOP                                                 02376000
UCBRSV44 EQU   UCBFCBOP                                                 02377000
UCBFCBO1 EQU   UCBFCBOP                                                 02378000
UCBUCSPE EQU   UCBUCSOP                                                 02379000
UCBRSV43 EQU   UCBUCSOP                                                 02380000
UCBRSV42 EQU   UCBUCSOP                                                 02381000
UCBRSV41 EQU   UCBUCSOP                                                 02382000
UCBRSV40 EQU   UCBUCSOP                                                 02383000
UCBRSV39 EQU   UCBUCSOP                                                 02384000
UCBUCSO2 EQU   UCBUCSOP                                                 02385000
UCBUCSO1 EQU   UCBUCSOP                                                 02386000
UCBUCSID EQU   UCBUCS                                                   02387000
UCBMDRBA EQU   UCBMDRBF+1                                               02388000
UCBRV075 EQU   UCBMDRBF                                                 02389000
UCBRV074 EQU   UCB3800X+32                                              02390000
UCBIMAGE EQU   UCB3800X+28                                              02391000
UCBFCBNM EQU   UCB3800X+24                                              02392000
UCBCHAR4 EQU   UCB3800X+20                                              02393000
UCBCHAR3 EQU   UCB3800X+16                                              02394000
UCBCHAR2 EQU   UCB3800X+12                                              02395000
UCBCHAR1 EQU   UCB3800X+8                                               02396000
UCBCGMID EQU   UCB3800X+4                                               02397000
UCBBRSTA EQU   UCBACTIV                                                 02398000
UCBRV063 EQU   UCBACTIV                                                 02399000
UCBRV062 EQU   UCBACTIV                                                 02400000
UCBRV061 EQU   UCBACTIV                                                 02401000
UCBRV060 EQU   UCBACTIV                                                 02402000
UCBRV059 EQU   UCBACTIV                                                 02403000
UCBRV058 EQU   UCBACTIV                                                 02404000
UCBRV057 EQU   UCBACTIV                                                 02405000
UCBRV050 EQU   UCB3800X+2                                               02406000
UCBCGMNO EQU   UCB3800X+1                                               02407000
UCBRV083 EQU   UCBOPTNS                                                 02408000
UCBBRSTR EQU   UCBOPTNS                                                 02409000
UCBRV056 EQU   UCBOPTNS                                                 02410000
UCBRV055 EQU   UCBOPTNS                                                 02411000
UCBRV054 EQU   UCBOPTNS                                                 02412000
UCBRV053 EQU   UCBOPTNS                                                 02413000
UCBRV052 EQU   UCBOPTNS                                                 02414000
UCBRV051 EQU   UCBOPTNS                                                 02415000
UCBRV073 EQU   UCB3540X+7                                               02416000
UCBRV072 EQU   UCBDKBYT                                                 02417000
UCBRV071 EQU   UCBDKBYT                                                 02418000
UCBRV070 EQU   UCBDKBYT                                                 02419000
UCBRV069 EQU   UCBDKBYT                                                 02420000
UCBRV068 EQU   UCBDKBYT                                                 02421000
UCBRV067 EQU   UCBDKBYT                                                 02422000
UCBVLVER EQU   UCBDKBYT                                                 02423000
UCBDKAMX EQU   UCBDKBYT                                                 02424000
UCBVLSER EQU   UCB3540X                                                 02425000
UCBRDATA EQU   UCBOCR+4                                                 02426000
UCBFRID  EQU   UCBOCR                                                   02427000
UCBCLN   EQU   UCBMT+14                                                 02428000
UCBERG   EQU   UCBMT+12                                                 02429000
UCBMS    EQU   UCBMT+11                                                 02430000
UCBNB    EQU   UCBMT+10                                                 02431000
UCBPW    EQU   UCBMT+9                                                  02432000
UCBPR    EQU   UCBMT+8                                                  02433000
UCBSIO   EQU   UCBMT+6                                                  02434000
UCBTW    EQU   UCBMT+5                                                  02435000
UCBTR    EQU   UCBMT+4                                                  02436000
UCBTWT   EQU   UCBMT+3                                                  02437000
UCBTRT   EQU   UCBMT+2                                                  02438000
UCBCTD   EQU   UCBMT                                                    02439000
UCBWTOID EQU   UCBCMEXT+17                                              02440000
UCBRV043 EQU   UCBCMEXT+16                                              02441000
UCBASID  EQU   UCBCMEXT+14                                              02442000
UCBMFCNT EQU   UCBCMEXT+12                                              02443000
UCBPMSK  EQU   UCBCMEXT+10                                              02444000
UCBCCWOF EQU   UCBCMEXT+8                                               02445000
UCBRV041 EQU   UCBCMEXT+6                                               02446000
UCBRV036 EQU   UCBFLP1                                                  02447000
UCBRV035 EQU   UCBFLP1                                                  02448000
UCBERLOG EQU   UCBFLP1                                                  02449000
UCBRV033 EQU   UCBFLP1                                                  02450000
UCBRV032 EQU   UCBFLP1                                                  02451000
UCBRV031 EQU   UCBFLP1                                                  02452000
UCBSHRUP EQU   UCBFLP1                                                  02453000
UCBNSRCH EQU   UCBFLP1                                                  02454000
UCBSNSCT EQU   UCBCMEXT+4                                               02455000
UCBHPDV  EQU   @NM00228                                                 02456000
UCBHALI  EQU   @NM00228                                                 02457000
UCBRSV09 EQU   @NM00228                                                 02458000
UCBRSV08 EQU   @NM00228                                                 02459000
UCBRSV07 EQU   @NM00228                                                 02460000
UCBRSV06 EQU   @NM00228                                                 02461000
UCBRSV05 EQU   @NM00228                                                 02462000
UCBRSV04 EQU   @NM00228                                                 02463000
UCBDTI   EQU   UCBCMEXT+2                                               02464000
UCBSTI   EQU   UCBCMEXT+1                                               02465000
UCBETI   EQU   UCBCMEXT                                                 02466000
UCBEXTP  EQU   UCBEXTPT+1                                               02467000
UCBDDRSW EQU   UCBFLC                                                   02468000
UCBTICBT EQU   UCBFLC                                                   02469000
UCBIVRR  EQU   UCBFLC                                                   02470000
UCBIVRS  EQU   UCBFLC                                                   02471000
UCBITF   EQU   UCBFLC                                                   02472000
UCBUDE   EQU   UCBFLC                                                   02473000
UCBWAA   EQU   UCBFLC                                                   02474000
UCBATTP  EQU   UCBFLC                                                   02475000
UCBUNTYP EQU   UCBTBYT4                                                 02476000
UCBRSV11 EQU   UCBDVCLS                                                 02477000
UCBRSV10 EQU   UCBDVCLS                                                 02478000
UCB3CHAR EQU   UCBDVCLS                                                 02479000
UCB3UREC EQU   UCBDVCLS                                                 02480000
UCB3DISP EQU   UCBDVCLS                                                 02481000
UCB3DACC EQU   UCBDVCLS                                                 02482000
UCB3COMM EQU   UCBDVCLS                                                 02483000
UCB3TAPE EQU   UCBDVCLS                                                 02484000
UCBDVPWR EQU   UCB2OPT7                                                 02485000
UCBVLPWR EQU   UCB2OPT6                                                 02486000
UCB2OPT5 EQU   UCBTBYT2                                                 02487000
UCBRVDEV EQU   UCBRWTAU                                                 02488000
UCBRPS   EQU   UCBDUDN2                                                 02489000
UCBRR    EQU   UCBDUDN1                                                 02490000
UCB2OPT1 EQU   UCBTBYT2                                                 02491000
UCB2OPT0 EQU   UCBTBYT2                                                 02492000
UCB1FEA7 EQU   UCBTBYT1                                                 02493000
UCBD6250 EQU   UCB1FEA6                                                 02494000
UCBD1600 EQU   UCB1FEA5                                                 02495000
UCB1FEA4 EQU   UCBTBYT1                                                 02496000
UCB1FEA3 EQU   UCBTBYT1                                                 02497000
UCB1FEA2 EQU   UCBTBYT1                                                 02498000
UCB1FEA1 EQU   UCBTBYT1                                                 02499000
UCB1FEA0 EQU   UCBTBYT1                                                 02500000
UCBRV029 EQU   UCBWGT                                                   02501000
UCBVHRSN EQU   UCBWGT                                                   02502000
UCBVORSN EQU   UCBWGT                                                   02503000
UCBMTPXP EQU   UCBWGT                                                   02504000
UCBREW   EQU   UCBWGT                                                   02505000
UCBPUB   EQU   UCBWGT                                                   02506000
UCBOUT   EQU   UCBWGT                                                   02507000
UCBIN    EQU   UCBWGT                                                   02508000
UCBCPU   EQU   UCBOB+11                                                 02509000
UCBLCI   EQU   UCBOB+10                                                 02510000
UCBCNT   EQU   UCBOB+9                                                  02511000
UCBRV017 EQU   UCBCHM1                                                  02512000
UCBRV016 EQU   UCBCHM1                                                  02513000
UCBRV015 EQU   UCBCHM1                                                  02514000
UCBRV014 EQU   UCBCHM1                                                  02515000
UCBSPB   EQU   UCBPTH1                                                  02516000
UCBPPB   EQU   UCBPTH1                                                  02517000
UCBSPA   EQU   UCBPTH0                                                  02518000
UCBPPA   EQU   UCBPTH0                                                  02519000
UCBSIGP  EQU   UCBFLB                                                   02520000
UCBVALPH EQU   UCBFLB                                                   02521000
UCBCRHSN EQU   UCBFLB                                                   02522000
UCBCRHRV EQU   UCBFLB                                                   02523000
UCBRESVH EQU   UCBFLB                                                   02524000
UCBSPST  EQU   UCBFLB                                                   02525000
UCBASNS  EQU   UCBFLB                                                   02526000
UCBIORST EQU   UCBFLB                                                   02527000
UCBQISCE EQU   UCBFL1                                                   02528000
UCBACTV  EQU   UCBFL1                                                   02529000
UCBSAP   EQU   UCBFL1                                                   02530000
UCBNOTRC EQU   UCBCUB                                                   02531000
UCBPSNS  EQU   UCBFL1                                                   02532000
UCBUSING EQU   UCBPST                                                   02533000
UCBNOTRD EQU   UCBNRY                                                   02534000
UCBBUSYD EQU   UCBBSY                                                   02535000
UCBUA    EQU   UCBCHAN+1                                                02536000
UCBCHA   EQU   UCBCHAN                                                  02537000
UCBDADI  EQU   UCBSTAT                                                  02538000
UCBSYSR  EQU   UCBSTAT                                                  02539000
UCBPRES  EQU   UCBSTAT                                                  02540000
UCBALOC  EQU   UCBSTAT                                                  02541000
UCBUNLD  EQU   UCBSTAT                                                  02542000
UCBRESV  EQU   UCBSTAT                                                  02543000
UCBCHGS  EQU   UCBSTAT                                                  02544000
UCBONLI  EQU   UCBSTAT                                                  02545000
UCBID    EQU   UCBOB+2                                                  02546000
UCBALTPH EQU   UCBFL5                                                   02547000
UCBALTCU EQU   UCBFL5                                                   02548000
UCBNALOC EQU   UCBFL5                                                   02549000
UCBENVRD EQU   UCBFL5                                                   02550000
UCBVSDR  EQU   UCBFL5                                                   02551000
UCBSASK  EQU   UCBFL5                                                   02552000
UCBAMV   EQU   UCBAF                                                    02553000
UCBDCC   EQU   UCBFL5                                                   02554000
UCBMONT  EQU   UCBJBNR                                                  02555000
UCBRV011 EQU   UCBJBNR                                                  02556000
UCBRSV02 EQU   UCBJBNR                                                  02557000
UCBOLDSM EQU   UCBJBNR                                                  02558000
UCBRV003 EQU   UCBJBNR                                                  02559000
UCBDUC   EQU   UCBJBNR                                                  02560000
UCBJES3  EQU   UCBJBNR                                                  02561000
UCBVRDEV EQU   UCBJBNR                                                  02562000
UCBCMSEG EQU   UCBOB                                                    02563000
UCBPFXND EQU   UCB+512                                                  02564000
UCBIOQ   EQU   UCB+508                                                  02565000
UCBLOCK  EQU   UCB+504                                                  02566000
UCBPXST  EQU   UCB+504                                                  02567000
@NM00225 EQU   UCB                                                      02568000
TTHDCF   EQU   IEDTH+8                                                  02569000
TTHTAG2  EQU   TTHTAG+1                                                 02570000
@NM00224 EQU   TTHTAG1                                                  02571000
TTHTAGS  EQU   TTHTAG1                                                  02572000
TTHOAF   EQU   IEDTH+4                                                  02573000
TTHDAF   EQU   IEDTH+2                                                  02574000
TTHBYTE1 EQU   IEDTH+1                                                  02575000
TTHEFI   EQU   TTHBYTE0                                                 02576000
@NM00223 EQU   TTHBYTE0                                                 02577000
TTHEBIU  EQU   TTHBYTE0                                                 02578000
TTHBBIU  EQU   TTHBYTE0                                                 02579000
TTHFTYPE EQU   TTHBYTE0                                                 02580000
TRMOPT   EQU   IEDTRM+34                                                02581000
TRMOPTBL EQU   IEDQTRM+18                                               02582000
TRMOPNO  EQU   IEDQTRM+17                                               02583000
TRMCHCIN EQU   IEDQTRM+16                                               02584000
TRMSENSE EQU   TRMSTAT+3                                                02585000
TRMTEMPR EQU   TRMSTAT+2                                                02586000
TRMSIO   EQU   TRMSTAT                                                  02587000
@NM00219 EQU   TRMDEVFL+1                                               02588000
TRMTPIN  EQU   TRMDEVFL+1                                               02589000
TRMNCPI  EQU   TRMDEVFL+1                                               02590000
TRMRNTRM EQU   TRMDEVFL+1                                               02591000
@NM00218 EQU   TRMDEVFL+1                                               02592000
TRMLMD   EQU   TRMDEVFL+1                                               02593000
TRMCONC  EQU   TRMDEVFL+1                                               02594000
TRMTSOB  EQU   TRMDEVFL                                                 02595000
TRMBFDY  EQU   TRMDEVFL                                                 02596000
TRMTBLK  EQU   TRMDEVFL                                                 02597000
TRMSBLK  EQU   TRMDEVFL                                                 02598000
TRMBLKS  EQU   TRMDEVFL                                                 02599000
TRMADDC  EQU   TRMDEVFL                                                 02600000
TRMDDIG  EQU   TRMDEVFL                                                 02601000
TRMBUFS  EQU   TRMDEVFL                                                 02602000
TRMPRILK EQU   TRMALTD                                                  02603000
TRMLGB   EQU   TRMDSORG                                                 02604000
TRMUTERM EQU   TLISTCNT                                                 02605000
TRMSCNYN EQU   TRMSTATE                                                 02606000
TRMOPTFN EQU   TRMSTATE                                                 02607000
TRMHELDN EQU   TRMSTATE                                                 02608000
TRMACPTN EQU   TRMSTATE                                                 02609000
TRMPREF  EQU   TRMSTATE                                                 02610000
TRMPROC  EQU   TRMLOG                                                   02611000
TRMLIST  EQU   TRMLOG                                                   02612000
TRMLINE  EQU   TRMSTATE                                                 02613000
TRMSUBST EQU   IEDNTRM+12                                               02614000
TRMRLMCT EQU   IEDNTRM+10                                               02615000
TRMCOHTG EQU   TRMSIBPT+1                                               02616000
TRMGPCNT EQU   TRMSIBPT                                                 02617000
TRMBUFRD EQU   TRMBYTE0                                                 02618000
TRMSNA   EQU   TRMBYTE0                                                 02619000
TRMGP    EQU   TRMBYTE0                                                 02620000
TRMDIAL  EQU   TRMBYTE0                                                 02621000
@NM00217 EQU   TRMBYTE0                                                 02622000
TRMOUTPT EQU   TRMBYTE0                                                 02623000
TRMINPUT EQU   TRMBYTE0                                                 02624000
TRMUDEF  EQU   TRMBYTE0                                                 02625000
TRMCOHRT EQU   IEDNTRM+4                                                02626000
TRMSTOTE EQU   TRMBYTE1                                                 02627000
TRMCKPRN EQU   TRMBYTE1                                                 02628000
TRMTSATN EQU   TRMBYTE1                                                 02629000
TRMTRACE EQU   TRMBYTE1                                                 02630000
TRMSWBCK EQU   TRMBYTE1                                                 02631000
TRMAUTOC EQU   TRMBYTE1                                                 02632000
TRMINPTP EQU   TRMBYTE1                                                 02633000
TRMWTNEG EQU   TRMSCPRQ                                                 02634000
TRMWRBRK EQU   TRMBYTE2                                                 02635000
TRMNOSND EQU   TRMBYTE2                                                 02636000
TRMPREP  EQU   TRMBYTE2                                                 02637000
TRMGPACT EQU   TRMBYTE2                                                 02638000
TRMANDL  EQU   TRMBYTE2                                                 02639000
TRMCLOSN EQU   TRMINPG                                                  02640000
TRMREMB  EQU   TRMBYTE2                                                 02641000
TRMRSACT EQU   TRMBYTE2                                                 02642000
@NM00216 EQU   TRHBYTE2                                                 02643000
@NM00215 EQU   TRHBYTE2                                                 02644000
@NM00214 EQU   TRHBYTE2                                                 02645000
TRHCSI   EQU   TRHBYTE2                                                 02646000
@NM00213 EQU   TRHBYTE2                                                 02647000
TRHCDI   EQU   TRHBYTE2                                                 02648000
TRHEB    EQU   TRHBYTE2                                                 02649000
TRHBB    EQU   TRHBYTE2                                                 02650000
TRHPI    EQU   TRHBYTE1                                                 02651000
@NM00212 EQU   TRHBYTE1                                                 02652000
@NM00211 EQU   TRHBYTE1                                                 02653000
@NM00210 EQU   TRHBYTE1                                                 02654000
TRHER    EQU   TRHBYTE1                                                 02655000
TRHDR2   EQU   TRHBYTE1                                                 02656000
@NM00209 EQU   TRHBYTE1                                                 02657000
@NM00208 EQU   TRHBYTE0                                                 02658000
TNTTRMAD EQU   IEDTNTA                                                  02659000
TNTLEN   EQU   IEDQTNTD+44                                              02660000
TNTMIDEN EQU   IEDQTNTD+41                                              02661000
TNTSRCHX EQU   IEDQTNTD+38                                              02662000
SNSUSR2  EQU   SNSUSER+1                                                02663000
SNSUSR1  EQU   SNSUSER                                                  02664000
SNSMIN   EQU   SNSSYSTM+1                                               02665000
SNSMAJ   EQU   SNSSYSTM                                                 02666000
QCBTTCIN EQU   QCBPLCBA+1                                               02667000
@NM00207 EQU   QCBPLCBA                                                 02668000
@NM00206 EQU   QCBSTAT1                                                 02669000
QCBFLUSH EQU   QCBSTAT1                                                 02670000
QCBNDXRQ EQU   QCBSTAT1                                                 02671000
QCBESIG  EQU   QCBSTAT1                                                 02672000
QCBRCVRQ EQU   QCBSTAT1                                                 02673000
QCBSNDRQ EQU   QCBSTAT1                                                 02674000
QCBWAITC EQU   QCBSTAT1                                                 02675000
QCBPLCBN EQU   QCBSTAT1                                                 02676000
QCBCHAIN EQU   IEDNQCB                                                  02677000
QCBPQBCK EQU   IEDQPQCB+25                                              02678000
QCBPRIPQ EQU   IEDQPQCB+24                                              02679000
QCBCFHDR EQU   IEDQPQCB+21                                              02680000
QCBLFEFO EQU   IEDQPQCB+18                                              02681000
QCBFFEFO EQU   IEDQPQCB+15                                              02682000
QCBPREVF EQU   QCBINTLF                                                 02683000
QCBINTFF EQU   IEDQPQCB+9                                               02684000
QCBDATSQ EQU   QCBFHDTZ+1                                               02685000
@NM00205 EQU   QCBFHDTZ                                                 02686000
@NM00204 EQU   QCBPFEFO                                                 02687000
QCBDATFL EQU   QCBFHDLZ                                                 02688000
QCBDNHDR EQU   IEDQPQCB                                                 02689000
QCBQBACK EQU   IEDQQCB+37                                               02690000
QCBCKPT  EQU   QCBFLAG                                                  02691000
QCBPROC  EQU   QCBFLAG                                                  02692000
QCBSDFFO EQU   QCBFLAG                                                  02693000
QCBTERMQ EQU   QCBFLAG                                                  02694000
QCBRSRV  EQU   QCBFLAG                                                  02695000
QCBREAD  EQU   QCBFLAG                                                  02696000
QCBNOBRK EQU   QCBFLAG                                                  02697000
QCBTSSES EQU   QCBFLAG                                                  02698000
QCBLGBAD EQU   QCBDCBAD                                                 02699000
QCBRELLN EQU   IEDQQCB+32                                               02700000
QCBTJID  EQU   QCBLKRRN+1                                               02701000
QCBCARCT EQU   QCBLKRRN                                                 02702000
QCBPRLVL EQU   QCBPREN                                                  02703000
QCBMSGCT EQU   IEDQQCB+26                                               02704000
QCBEXTO  EQU   QCBINTVL                                                 02705000
QCBDISC  EQU   QCBTSOF1                                                 02706000
QCBDELAY EQU   QCBTSOF1                                                 02707000
QCBPARTO EQU   QCBTSOF1                                                 02708000
QCBSATRD EQU   QCBTSOF1                                                 02709000
QCBNOBUF EQU   QCBTSOF1                                                 02710000
QCBTPUT  EQU   QCBTSOF1                                                 02711000
QCBTGET  EQU   QCBTSOF1                                                 02712000
QCBWRBRK EQU   QCBTSOF1                                                 02713000
QCBSATLC EQU   QCBTSOF2                                                 02714000
QCBSATTI EQU   QCBTSOF2                                                 02715000
QCBSATCH EQU   QCBTSOF2                                                 02716000
QCBSIMRD EQU   QCBTSOF2                                                 02717000
QCBDSSMI EQU   QCBTSOF2                                                 02718000
QCBPOSTO EQU   QCBTSOF2                                                 02719000
QCBBUFQ  EQU   QCBTSOF2                                                 02720000
QCBINHBN EQU   QCBTSOF2                                                 02721000
QCBSATCT EQU   @NM00203                                                 02722000
QCBSCBOF EQU   IEDQQCB+20                                               02723000
QCBTIME  EQU   QCBSTAT                                                  02724000
QCBCLOCK EQU   QCBSTAT                                                  02725000
QCBSCHDL EQU   QCBSTAT                                                  02726000
QCBSMODE EQU   QCBSTAT                                                  02727000
QCBSEND  EQU   QCBSTAT                                                  02728000
QCBBUFRD EQU   QCBSTAT                                                  02729000
QCBTRMHO EQU   QCBSTAT                                                  02730000
QCBEOM   EQU   QCBSTAT                                                  02731000
QCBHUCT  EQU   QCBRETCT                                                 02732000
QCBIEND  EQU   QCBRETCT                                                 02733000
QCBEND   EQU   QCBRETCT                                                 02734000
QCBNL    EQU   QCBRETCT                                                 02735000
QCBLOGCT EQU   QCBRETCT                                                 02736000
@NM00202 EQU   QCBBYTE1                                                 02737000
QCBRITRM EQU   QCBBYTE1                                                 02738000
@NM00201 EQU   QCBEOLDT                                                 02739000
QCBSLINK EQU   IEDQQCB+13                                               02740000
QCBSTPRI EQU   IEDQQCB+12                                               02741000
QCBSTCHN EQU   IEDQQCB+9                                                02742000
QCBSTVTO EQU   IEDQQCB+8                                                02743000
QCBLINK  EQU   IEDQQCB+5                                                02744000
QCBPRI   EQU   IEDQQCB+4                                                02745000
QCBCNTEN EQU   QCBELCHN+2                                               02746000
@NM00200 EQU   QCBELCHN+2                                               02747000
@NM00199 EQU   QCBELCHN                                                 02748000
QCBHELD  EQU   QCBDSFLG                                                 02749000
QCBFQCB  EQU   QCBDSFLG                                                 02750000
QCBDRQQ  EQU   QCBDSFLG                                                 02751000
QCBALTMH EQU   QCBDSFLG                                                 02752000
QCBREUS  EQU   QCBDISK                                                  02753000
QCBNREUS EQU   QCBDISK                                                  02754000
QCBCORE  EQU   QCBDSFLG                                                 02755000
QCBTSQ   EQU   QCBDSFLG                                                 02756000
PRF2SEQP EQU   PRF2WD2                                                  02757000
@NM00198 EQU   IEDPF2+1                                                 02758000
@NM00197 EQU   PRF2FLG2                                                 02759000
PRF2TERM EQU   PRF2FLG2                                                 02760000
PRF2SMI  EQU   PRF2FLG2                                                 02761000
PRF2FORM EQU   PRF2FLG2                                                 02762000
PRF2TNTI EQU   PRF2FLG2                                                 02763000
PRF1RULN EQU   PRF1SEQP+2                                               02764000
PRF1TAG2 EQU   PRF1SQID+1                                               02765000
@NM00196 EQU   PRF1TAG1                                                 02766000
PRF1TAGS EQU   PRF1TAG1                                                 02767000
@NM00195 EQU   PRF1FLG1                                                 02768000
PRF1LOGD EQU   PRF1FLG1                                                 02769000
PRF1USS  EQU   PRF1FLG1                                                 02770000
PRFISEQ  EQU   IEDQPRF+38                                               02771000
PRFSTXT  EQU   PRFHQBCK                                                 02772000
PRFNHDR  EQU   PRFCHDR                                                  02773000
PRFCRCD  EQU   IEDQPRF+29                                               02774000
PRFSVSEQ EQU   PRFNTXT+1                                                02775000
PRFSVPRI EQU   PRFEOBOF                                                 02776000
@NM00194 EQU   PRFSCAN                                                  02777000
PRFEOB   EQU   PRFXTRA+1                                                02778000
PRFSTSO  EQU   PRFXTRA                                                  02779000
PRFNHDRN EQU   PRFSTAT1                                                 02780000
PRFNLSTN EQU   PRFSTAT1                                                 02781000
PRFLOCK  EQU   PRFEOFN                                                  02782000
PRFDUPLN EQU   PRFSTAT1                                                 02783000
PRFTSMSG EQU   PRFSTAT1                                                 02784000
PRFITCPN EQU   PRFSTAT1                                                 02785000
PRFERMGN EQU   PRFSTAT1                                                 02786000
PRFCNCLN EQU   PRFSTAT1                                                 02787000
PRFSVFLG EQU   @NM00193+3                                               02788000
PRFSIZE  EQU   PRFSVFFO+2                                               02789000
PRFLCB   EQU   IEDQPRF+13                                               02790000
PRFPIUO  EQU   PRFPLQCB                                                 02791000
PRFTI0   EQU   PRFTIC+1                                                 02792000
@NM00192 EQU   PRFTICC                                                  02793000
@NM00191 EQU   PRFTICC                                                  02794000
@NM00190 EQU   PRFTICC                                                  02795000
PRFTICON EQU   PRFTICC                                                  02796000
@NM00189 EQU   PRFTICC                                                  02797000
@NM00188 EQU   PRFTICC                                                  02798000
PRFBFMM  EQU   PRFTICC                                                  02799000
PRFEOMSG EQU   PRFTICC                                                  02800000
PRFCOUNT EQU   PRFLINK+1                                                02801000
@NM00187 EQU   PRFLINK                                                  02802000
PRFFLAGS EQU   PRFPRI                                                   02803000
PRFIOADR EQU   PRFQCBA                                                  02804000
PRFOPCDE EQU   PRFKEY                                                   02805000
OPCBOTTM EQU   IEDQOPCD+1188                                            02806000
OPCDSRWT EQU   IEDQOPCD+1184                                            02807000
@NM00186 EQU   IEDQOPCD+1100                                            02808000
@NM00185 EQU   IEDQOPCD+948                                             02809000
@NM00184 EQU   IEDQOPCD+940                                             02810000
@NM00183 EQU   IEDQOPCD+380                                             02811000
@NM00182 EQU   OPCPWCOB+9                                               02812000
@NM00181 EQU   OPCPWCOB+8                                               02813000
@NM00180 EQU   OPCPWECB+1                                               02814000
OPCPWCCC EQU   OPCPWECB                                                 02815000
OPCPWCHN EQU   OPCPWQCB+1                                               02816000
OPCPWVTO EQU   OPCPWQCB                                                 02817000
OPCWAITV EQU   IEDQOPCD+364                                             02818000
OPCTOTCK EQU   IEDQOPCD+360                                             02819000
OPCAPXTL EQU   IEDQOPCD+356                                             02820000
OPCDECR  EQU   IEDQOPCD+352                                             02821000
OPCBUFWT EQU   IEDQOPCD+348                                             02822000
OPCWRKSP EQU   IEDQOPCD+320                                             02823000
OPCADGOT EQU   IEDQOPCD+318                                             02824000
OPCRQCNT EQU   IEDQOPCD+316                                             02825000
OPPOLSTP EQU   IEDQOPCD+312                                             02826000
OPCCKCIB EQU   IEDQOPCD+308                                             02827000
OPCEND   EQU   IEDQOPCD+307                                             02828000
OPCSTCBS EQU   IEDQOPCD+306                                             02829000
OPCHNEND EQU   IEDQOPCD+302                                             02830000
OPCOQSW  EQU   IEDQOPCD+301                                             02831000
@NM00179 EQU   OPCSPEC                                                  02832000
@NM00178 EQU   OPCSPEC                                                  02833000
@NM00177 EQU   OPCSPEC                                                  02834000
@NM00176 EQU   OPCSPEC                                                  02835000
OPCFRMCA EQU   OPCSPEC                                                  02836000
OPCRSTRT EQU   OPCSPEC                                                  02837000
OPCPART  EQU   OPCSPEC                                                  02838000
OPCALTD  EQU   OPCSPEC                                                  02839000
OPCBFEND EQU   IEDQOPCD+296                                             02840000
OPCBFIRS EQU   IEDQOPCD+292                                             02841000
OPCAVBUF EQU   IEDQOPCD+290                                             02842000
OPCIPLCT EQU   IEDQOPCD+289                                             02843000
OPCCLNTS EQU   IEDQOPCD+288                                             02844000
OPCHA8   EQU   IEDQOPCD+286                                             02845000
OPCBFREQ EQU   IEDQOPCD+284                                             02846000
OPCHORTG EQU   IEDQOPCD+260                                             02847000
OPCCKPTL EQU   IEDQOPCD+252                                             02848000
OPCCKPTF EQU   IEDQOPCD+248                                             02849000
OPCWAITA EQU   IEDQOPCD+244                                             02850000
OPCWAITR EQU   IEDQOPCD+240                                             02851000
OPCWAITP EQU   IEDQOPCD+236                                             02852000
OPCWAITO EQU   IEDQOPCD+232                                             02853000
OPCWAITL EQU   IEDQOPCD+224                                             02854000
OPCWAITC EQU   IEDQOPCD+220                                             02855000
@NM00175 EQU   OPCLDNME+5                                               02856000
@NM00174 EQU   OPCLDNME                                                 02857000
OPCWAIT  EQU   IEDQOPCD+192                                             02858000
OPCCKERB EQU   IEDQOPCD+164                                             02859000
OPCBFERB EQU   IEDQOPCD+148                                             02860000
OPCFLAG2 EQU   IEDQOPCD+147                                             02861000
OPCFLAG1 EQU   IEDQOPCD+146                                             02862000
OPCWRKSZ EQU   IEDQOPCD+144                                             02863000
OPCWORK  EQU   IEDQOPCD+140                                             02864000
OPCRSAVE EQU   IEDQOPCD+132                                             02865000
OPCQCBAD EQU   IEDQOPCD+128                                             02866000
OPCTRMWA EQU   IEDQOPCD+52                                              02867000
OPCPSTWT EQU   IEDQOPCD+48                                              02868000
OPCTNTEA EQU   IEDQOPCD+44                                              02869000
OPCPGCK  EQU   IEDQOPCD+40                                              02870000
OPCLCB   EQU   IEDQOPCD+36                                              02871000
@NM00173 EQU   IEDQOPCD+32                                              02872000
OPCIPLAD EQU   IEDQOPCD+28                                              02873000
OPCTOFLK EQU   IEDQOPCD+24                                              02874000
OPCOPTLK EQU   IEDQOPCD+20                                              02875000
OPCDCBLK EQU   IEDQOPCD+16                                              02876000
OPCDOUBL EQU   IEDQOPCD                                                 02877000
@NM00172 EQU   OCLDNME+4                                                02878000
@NM00171 EQU   OCPREFLG                                                 02879000
OCTOTEP  EQU   OCPREFLG                                                 02880000
OCREPOST EQU   OCPREFLG                                                 02881000
OCIDLE   EQU   OCREQFLG                                                 02882000
OCFORCE  EQU   OCREQFLG                                                 02883000
OCDCARD  EQU   OCREQFLG                                                 02884000
OCPARTAL EQU   OCREQFLG                                                 02885000
OCADNCP  EQU   OCREQFLG                                                 02886000
@NM00170 EQU   OCREQFLG                                                 02887000
@NM00169 EQU   OCREQFLG                                                 02888000
OCFLUSHZ EQU   OCREQFLG                                                 02889000
OCRESPCT EQU   OCLINTTE                                                 02890000
OCCKPTWA EQU   OCCKDATA+4                                               02891000
@NM00166 EQU   OCRSTGTM+2                                               02892000
OCCKDAT2 EQU   OCRSTGTM+1                                               02893000
OCCKDAT1 EQU   OCRSTGTM                                                 02894000
OCPTRSAV EQU   OCMODNME+4                                               02895000
OCPUADR  EQU   OCIPLWA+2                                                02896000
OCWTGSAV EQU   OCIPLWA                                                  02897000
OCDVRDCT EQU   OCBACKUP+6                                               02898000
OCNCP    EQU   OCBACKUP+4                                               02899000
OCBUFGOT EQU   OCBACKUP+2                                               02900000
OCBUFNED EQU   OCBACKUP                                                 02901000
OCRESNUM EQU   OCPARM                                                   02902000
@NM00165 EQU   OCRSID+1                                                 02903000
OCNONE   EQU   OCALSTAT                                                 02904000
OCSOME   EQU   OCALSTAT                                                 02905000
OCALLFLG EQU   OCALSTAT                                                 02906000
OCACTREQ EQU   OCALSTAT                                                 02907000
OCREDRVE EQU   OCALSTAT                                                 02908000
OCSEQIND EQU   OCALSTAT                                                 02909000
OCDACTIP EQU   OCALSTAT                                                 02910000
OCRENTRD EQU   OCALSTAT                                                 02911000
OCWTGB   EQU   OCTIOT                                                   02912000
@NM00164 EQU   @NM00163+2                                               02913000
OCCONID  EQU   OCDEST                                                   02914000
OCRLN    EQU   IEDQOPCE+15                                              02915000
OCRESP   EQU   OCFLAG                                                   02916000
OCSSCP   EQU   OCFLAG                                                   02917000
OCOUTPUT EQU   OCFLAG                                                   02918000
OCLINE   EQU   OCFLAG                                                   02919000
OCMPP    EQU   OCFLAG                                                   02920000
OCTOTE   EQU   OCFLAG                                                   02921000
@NM00162 EQU   OCSWITCH                                                 02922000
OCQUCKN  EQU   OCSWITCH                                                 02923000
OCPRIFLG EQU   OCOPTCDE                                                 02924000
@NM00161 EQU   OCRUDEST+1                                               02925000
@NM00160 EQU   OCSCAN                                                   02926000
OCNOTUCB EQU   OCSCAN                                                   02927000
OCNONAME EQU   OCSCAN                                                   02928000
OCALLRLN EQU   OCSCAN                                                   02929000
OCDDNAME EQU   OCSCAN                                                   02930000
OCDDNRLN EQU   OCSCAN                                                   02931000
OCADDR   EQU   OCSCAN                                                   02932000
OCELMPTR EQU   OCELEM+1                                                 02933000
NCPLTRAC EQU   IEDNCP+26                                                02934000
NCPCKPT  EQU   IEDNCP+22                                                02935000
NCPDPDCB EQU   IEDNCP+18                                                02936000
NCPTXID  EQU   IEDNCP+10                                                02937000
NCPBKUPN EQU   IEDNCP+2                                                 02938000
@NM00159 EQU   NCPFLAG1                                                 02939000
NCPTRACE EQU   NCPFLAG1                                                 02940000
NCPBKUP  EQU   NCPFLAG1                                                 02941000
NCPREST  EQU   NCPFLAG1                                                 02942000
NCPBGUP  EQU   NCPFLAG1                                                 02943000
NCPLEN   EQU   IEDNCP                                                   02944000
LCBERADR EQU   LCBXRADR+1                                               02945000
LCBPCIRC EQU   LCBXRADR                                                 02946000
LCBDCT3  EQU   LCBXDCT+2                                                02947000
LCBDCT2  EQU   LCBXDCT+1                                                02948000
LCBDCT1  EQU   LCBXDCT                                                  02949000
@NM00158 EQU   LCBXFLAG                                                 02950000
LCBERPND EQU   LCBXFLAG                                                 02951000
LCBSRCPF EQU   LCBXFLAG                                                 02952000
LCBGPCTV EQU   LCBXFLAG                                                 02953000
@NM00157 EQU   LCBXFLAG                                                 02954000
@NM00156 EQU   LCBXFLAG                                                 02955000
@NM00155 EQU   LCBXFLAG                                                 02956000
@NM00154 EQU   LCBXFLAG                                                 02957000
LCBCCW10 EQU   LCBCPA+72                                                02958000
LCBCCW9  EQU   LCBCPA+64                                                02959000
LCBCCW8  EQU   LCBCPA+56                                                02960000
LCBCCW7  EQU   LCBCPA+48                                                02961000
LCBCCW6  EQU   LCBCPA+40                                                02962000
LCBCP    EQU   LCBQEBPL+4                                               02963000
LCBIOSB  EQU   LCBQEBPL+1                                               02964000
LCBSIO   EQU   LCBQEBPL                                                 02965000
LCBCCW4  EQU   LCBCPA+24                                                02966000
LCBCCW3  EQU   LCBCPA+16                                                02967000
LCBCCW2  EQU   LCBCPA+8                                                 02968000
LCBCCW1  EQU   LCBCPA                                                   02969000
@NM00139 EQU   LCBERCCW+16                                              02970000
LCBATL05 EQU   LCBERCCW+8                                               02971000
@NM00138 EQU   LCBERCCW                                                 02972000
LCBCSWSV EQU   LCBSAVSN+1                                               02973000
LCBSNSV  EQU   LCBSAVSN                                                 02974000
LCBBFSNS EQU   LCBRSPSV                                                 02975000
LCBWAITC EQU   LCBTPCD+5                                                02976000
LCBINPAK EQU   LCBSTAT6                                                 02977000
LCBMHBID EQU   LCBSTAT6                                                 02978000
LCBRTRRO EQU   LCBSTAT6                                                 02979000
LCBHDRPD EQU   LCBSTAT6                                                 02980000
LCBCHN   EQU   LCBSTAT6                                                 02981000
LCBBFRSV EQU   LCBTPCD+1                                                02982000
@NM00137 EQU   LCBSTAT5                                                 02983000
LCBLUS   EQU   LCBSTAT5                                                 02984000
LCBLUNIT EQU   LCBSTAT5                                                 02985000
LCBPERM  EQU   LCBSTAT5                                                 02986000
LCBNXCMD EQU   LCBBFRW                                                  02987000
LCBERMSK EQU   LCBOBRCH                                                 02988000
LCBSCBA  EQU   IEDQLCB+93                                               02989000
LCBOLT   EQU   LCBMSGFM                                                 02990000
LCBEOT   EQU   LCBMSGFM                                                 02991000
LCBENQ   EQU   LCBMSGFM                                                 02992000
LCBTTD   EQU   LCBMSGFM                                                 02993000
LCBRSTRT EQU   LCBMSGFM                                                 02994000
LCBVSTRT EQU   LCBMSGFM                                                 02995000
LCBACKI  EQU   LCBMSGFM                                                 02996000
LCBNAK   EQU   LCBMSGFM                                                 02997000
@NM00136 EQU   LCBRBCT2                                                 02998000
LCBDCNT  EQU   LCBRBCT2                                                 02999000
LCBRBCT1 EQU   LCBERBCT                                                 03000000
LCBERBCH EQU   IEDQLCB+85                                               03001000
LCBCOMPL EQU   LCBDLNKN                                                 03002000
LCBPRCPG EQU   LCBERBST                                                 03003000
LCBERROR EQU   LCBERBST                                                 03004000
LCBLOGDV EQU   LCBERBST                                                 03005000
LCBINQ   EQU   LCBERBST                                                 03006000
LCBRDERR EQU   LCBERBST                                                 03007000
LCBEOMSG EQU   LCBERBST                                                 03008000
LCBMSG   EQU   LCBERBST                                                 03009000
LCBERBLK EQU   IEDQLCB+81                                               03010000
LCBERBPY EQU   IEDQLCB+80                                               03011000
LCBERBQB EQU   LCBERB+1                                                 03012000
LCBERBKY EQU   LCBERB                                                   03013000
LCBRECAD EQU   IEDQLCB+73                                               03014000
@NM00135 EQU   LCBTSTSW                                                 03015000
@NM00134 EQU   LCBTSTSW                                                 03016000
@NM00133 EQU   LCBTSTSW                                                 03017000
@NM00132 EQU   LCBTSTSW                                                 03018000
@NM00131 EQU   LCBTSTSW                                                 03019000
@NM00130 EQU   LCBTSTSW                                                 03020000
@NM00129 EQU   LCBTSTSW                                                 03021000
LCBCONCT EQU   LCBTSTSW                                                 03022000
LCBRESP  EQU   LCBSTAT2                                                 03023000
LCBBFRAV EQU   LCBDIAL                                                  03024000
LCBATTN  EQU   LCBSYNC                                                  03025000
LCBNEGRP EQU   LCBSTAT2                                                 03026000
LCBSNDPR EQU   LCBSTAT2                                                 03027000
LCBCONNN EQU   LCBBEOTN                                                 03028000
LCBMSGNN EQU   LCBSTAT2                                                 03029000
LCBTRACE EQU   LCBSTAT2                                                 03030000
LCBSENDN EQU   LCBSTAT1                                                 03031000
LCBRECVN EQU   LCBSTAT1                                                 03032000
LCBFREEN EQU   LCBSTAT1                                                 03033000
LCBCONT  EQU   LCBSTAT1                                                 03034000
LCBINITN EQU   LCBSTAT1                                                 03035000
LCBOCNI  EQU   LCBSTAT1                                                 03036000
LCBOCWTN EQU   LCBSTAT1                                                 03037000
LCBRCLLN EQU   LCBSTAT1                                                 03038000
LCBRECOF EQU   IEDQLCB+68                                               03039000
LCBRDBFR EQU   LCBRCBFR                                                 03040000
LCBUCBX  EQU   IEDQLCB+64                                               03041000
LCBTTBIN EQU   LCBERRCT                                                 03042000
@NM00128 EQU   LCBINCAM                                                 03043000
LCBGETMN EQU   LCBINCAM                                                 03044000
@NM00127 EQU   LCBRESTR+1                                               03045000
LCBCMDSV EQU   LCBRESTR                                                 03046000
LCBPCILK EQU   LCBDCBPT                                                 03047000
LCBSTART EQU   LCBIOBSN+16                                              03048000
LCBAP4OL EQU   LCBSIOCC                                                 03049000
LCBAP3OL EQU   LCBSIOCC                                                 03050000
LCBAP2OL EQU   LCBSIOCC                                                 03051000
LCBAP1OL EQU   LCBSIOCC                                                 03052000
@NM00126 EQU   LCBSIOCC                                                 03053000
LCBCSWRC EQU   LCBCSW+5                                                 03054000
LCBCSCHC EQU   LCBCSWCS                                                 03055000
LCBCSICC EQU   LCBCSWCS                                                 03056000
LCBCSCCC EQU   LCBCSWCS                                                 03057000
LCBCSCDC EQU   LCBCSWCS                                                 03058000
LCBCSPTC EQU   LCBCSWCS                                                 03059000
LCBCSPGC EQU   LCBCSWCS                                                 03060000
LCBCSIL  EQU   LCBCSWCS                                                 03061000
LCBCSPCI EQU   LCBCSWCS                                                 03062000
LCBUSUE  EQU   LCBCSWUS                                                 03063000
LCBUSDE  EQU   LCBCSWUS                                                 03064000
LCBUSCE  EQU   LCBCSWUS                                                 03065000
LCBUSBSY EQU   LCBCSWUS                                                 03066000
LCBUSCUE EQU   LCBCSWUS                                                 03067000
LCBUSSM  EQU   LCBCSWUS                                                 03068000
LCBUSAT  EQU   LCBCSWUS                                                 03069000
LCBCSWCA EQU   LCBCSW                                                   03070000
LCBOBR   EQU   LCBFLAG3                                                 03071000
LCBOBRRD EQU   LCBFLAG3                                                 03072000
LCBIOMSG EQU   LCBFLAG3                                                 03073000
LCBSOHC  EQU   LCBFLAG3                                                 03074000
LCBRLAD  EQU   LCBFLAG3                                                 03075000
LCBSOHR  EQU   LCBFLAG3                                                 03076000
@NM00125 EQU   LCBFLAG3                                                 03077000
LCBECBPT EQU   LCBIOBSN+4                                               03078000
LCBECBCC EQU   LCBIOBSN+3                                               03079000
LCBSENS1 EQU   LCBSNS+1                                                 03080000
LCBABORT EQU   LCBTMOUT                                                 03081000
LCBOVRUN EQU   LCBSENS0                                                 03082000
LCBDATCK EQU   LCBSENS0                                                 03083000
LCBBUSCK EQU   LCBSENS0                                                 03084000
LCBCMDRJ EQU   LCBSENS0                                                 03085000
LCBFLAG2 EQU   LCBIOBSN                                                 03086000
@NM00124 EQU   LCBFLAG1                                                 03087000
LCBUNREL EQU   LCBFLAG1                                                 03088000
LCBEXCPN EQU   LCBFLAG1                                                 03089000
@NM00123 EQU   LCBFLAG1                                                 03090000
LCBERPIN EQU   LCBFLAG1                                                 03091000
@NM00122 EQU   LCBFLAG1                                                 03092000
LCBFSBFR EQU   LCBMHA                                                   03093000
LCBISZE  EQU   IEDQLCB+28                                               03094000
LCBLNENT EQU   LCBSCBDA+1                                               03095000
@NM00121 EQU   LCBSCBDA                                                 03096000
LCBCPGMH EQU   LCBSTAT4                                                 03097000
LCBREAL  EQU   LCBPHASE                                                 03098000
@NM00120 EQU   LCBSTAT4                                                 03099000
@NM00119 EQU   LCBLKMDE                                                 03100000
LCBLOCKI EQU   LCBLKMDE                                                 03101000
LCBLOCKR EQU   LCBLKMDE                                                 03102000
LCBHMFLG EQU   LCBLKMDE                                                 03103000
LCBBDFLG EQU   LCBLKMDE                                                 03104000
@NM00118 EQU   LCBINSRC                                                 03105000
LCBABRTN EQU   LCBCHAIN                                                 03106000
LCBCTLMD EQU   LCBTETEN                                                 03107000
LCBBFRSZ EQU   LCBCHAIN                                                 03108000
LCBUREQN EQU   LCBCHAIN                                                 03109000
LCBNORTY EQU   LCBCHAIN                                                 03110000
LCBERMSG EQU   LCBCHAIN                                                 03111000
LCBEXCP  EQU   LCBCHAIN                                                 03112000
LCBINVRQ EQU   LCBSCRNN                                                 03113000
LCB2741N EQU   LCBTSOB                                                  03114000
LCBINHBN EQU   LCBTSOB                                                  03115000
LCBCIRCD EQU   LCBTSOB                                                  03116000
LCBPREP  EQU   LCBTSOB                                                  03117000
LCBSOPL  EQU   LCBTSOB                                                  03118000
LCBSATRD EQU   LCBTSOB                                                  03119000
LCBTSBUF EQU   LCBTSOB                                                  03120000
LCBWRBRK EQU   LCBTSOB                                                  03121000
LCBTDL   EQU   IEDQLCB+18                                               03122000
LCBEOLTD EQU   IEDQLCB+16                                               03123000
LCBRSLNK EQU   IEDQLCB+13                                               03124000
LCBRSPRI EQU   IEDQLCB+12                                               03125000
LCBSTCBA EQU   IEDQLCB+9                                                03126000
LCBRSKEY EQU   IEDQLCB+8                                                03127000
LCBLINK  EQU   LCBRCB+5                                                 03128000
LCBPRI   EQU   LCBRCB+4                                                 03129000
LCBQCBA  EQU   LCBRCB+1                                                 03130000
LCBKEY   EQU   LCBRCB                                                   03131000
DEBAPPAD EQU   IEDQDEB+65                                               03132000
DEBEXSCL EQU   IEDQDEB+64                                               03133000
DEBDCBAD EQU   IEDQDEB+61                                               03134000
DEBPROTG EQU   IEDQDEB+60                                               03135000
DEBECBAD EQU   IEDQDEB+57                                               03136000
DEBPRIOR EQU   IEDQDEB+56                                               03137000
DEBUSRPG EQU   IEDQDEB+53                                               03138000
DEBSYSPG EQU   IEDQDEB+49                                               03139000
DEBOPATB EQU   IEDQDEB+48                                               03140000
DEBIRBAD EQU   IEDQDEB+45                                               03141000
DEBOFLGS EQU   IEDQDEB+44                                               03142000
DEBDEBAD EQU   IEDQDEB+41                                               03143000
DEBAMLNG EQU   IEDQDEB+40                                               03144000
DEBNMSUB EQU   IEDQDEB+36                                               03145000
@NM00117 EQU   DEBPRF+33                                                03146000
DEBLNGTH EQU   DEBPRF+32                                                03147000
DEBDCBMK EQU   DEBPRF+28                                                03148000
DEBDSCBA EQU   DEBPRF+21                                                03149000
DEBWKARA EQU   DEBPRF+20                                                03150000
DEBXCEA  EQU   DEBAPVT+16                                               03151000
DEBCEA   EQU   DEBAPVT+12                                               03152000
DEBPCIA  EQU   DEBAPVT+8                                                03153000
DEBSIOA  EQU   DEBAPVT+4                                                03154000
DEBEOEA  EQU   DEBAPVT                                                  03155000
DCBBUFSI EQU   IHADCS43+6                                               03156000
DCBUNTCT EQU   IHADCS43+5                                               03157000
DCBILCT  EQU   IHADCS43+4                                               03158000
DCBSCTAD EQU   DCBSCTAB+1                                               03159000
@NM00116 EQU   DCBSCTAB                                                 03160000
DCBPUTA  EQU   DCBGETA                                                  03161000
@NM00115 EQU   DCBPUT                                                   03162000
DCBDEBA  EQU   DCBDEBAD+1                                               03163000
@NM00114 EQU   DCBIFLGS                                                 03164000
DCBIFIOE EQU   DCBIFLGS                                                 03165000
DCBCH12  EQU   DCBIFPCT                                                 03166000
DCBCH9   EQU   DCBIFPCT                                                 03167000
DCBIFEC  EQU   DCBIFLGS                                                 03168000
DCBMFSTI EQU   DCBMFDMD                                                 03169000
DCBMFAWR EQU   DCBMFSTK                                                 03170000
DCBMFUIP EQU   DCBMFTMD                                                 03171000
DCBMFIDW EQU   DCBMFLCP                                                 03172000
DCBMFWRK EQU   DCBMFMVP                                                 03173000
DCBMFRDQ EQU   DCBMFWRT                                                 03174000
DCBMFGTQ EQU   DCBMFPUT                                                 03175000
DCBMFSTL EQU   DCBMACF2                                                 03176000
DCBMFCK  EQU   DCBMFDMG                                                 03177000
DCBMFRDX EQU   DCBMFCHK                                                 03178000
DCBMFDBF EQU   DCBMFSBG                                                 03179000
DCBMFRDI EQU   DCBMFLCG                                                 03180000
DCBMFRDK EQU   DCBMFMVG                                                 03181000
DCBMFWRQ EQU   DCBMFRD                                                  03182000
DCBMFPTQ EQU   DCBMFGET                                                 03183000
DCBMFECP EQU   DCBMACF1                                                 03184000
DCBTIOT  EQU   IHADCS25                                                 03185000
DCBMRSTI EQU   DCBMRDMD                                                 03186000
DCBMRAWR EQU   DCBMRSTK                                                 03187000
DCBMRUIP EQU   DCBMRTMD                                                 03188000
DCBMRIDW EQU   DCBMRLCP                                                 03189000
DCBMRWRK EQU   DCBMRMVP                                                 03190000
DCBMRRDQ EQU   DCBMRWRT                                                 03191000
DCBMRGTQ EQU   DCBMRPUT                                                 03192000
DCBMRSTL EQU   DCBMACR2                                                 03193000
DCBMRCK  EQU   DCBMRDMG                                                 03194000
DCBPGFXA EQU   DCBMRRDX                                                 03195000
DCBMRDBF EQU   DCBMRSBG                                                 03196000
DCBMRRDI EQU   DCBMRLCG                                                 03197000
DCBMRRDK EQU   DCBMRMVG                                                 03198000
DCBMRWRQ EQU   DCBMRRD                                                  03199000
DCBMRPTQ EQU   DCBMRGET                                                 03200000
DCBMRECP EQU   DCBMACR1                                                 03201000
@NM00113 EQU   DCBIFLG                                                  03202000
DCBIBIOE EQU   DCBIFLG                                                  03203000
DCBICH12 EQU   DCBIBPCT                                                 03204000
DCBICH9  EQU   DCBIBPCT                                                 03205000
DCBIBEC  EQU   DCBIFLG                                                  03206000
DCBOFIOF EQU   DCBOFLGS                                                 03207000
DCBOFUEX EQU   DCBOFLGS                                                 03208000
DCBOFTM  EQU   DCBOFLGS                                                 03209000
DCBOFPPC EQU   DCBOFLGS                                                 03210000
DCBOFOPN EQU   DCBOFLGS                                                 03211000
DCBOFEOV EQU   DCBOFLGS                                                 03212000
DCBOFLRB EQU   DCBOFLGS                                                 03213000
DCBOFIOD EQU   DCBOFLWR                                                 03214000
DCBDDNAM EQU   IHADCS24                                                 03215000
DCBEXLSA EQU   DCBEXLST+1                                               03216000
DCBRNCKA EQU   DCBRNCKD+1                                               03217000
@NM00112 EQU   DCBRNCKD                                                 03218000
DCBDSGTR EQU   DCBDSRG2                                                 03219000
@NM00111 EQU   DCBDSRG2                                                 03220000
DCBDSRG1 EQU   DCBDSORG                                                 03221000
DCBCHNGL EQU   DCBTRSTA                                                 03222000
DCBNIDLE EQU   DCBTRSTA                                                 03223000
DCBBAKUP EQU   DCBTRSTA                                                 03224000
DCBIPLED EQU   DCBTRSTA                                                 03225000
DCBRSTRT EQU   DCBTRSTA                                                 03226000
DCBINITL EQU   DCBTRSTA                                                 03227000
DCBAUTOD EQU   DCBTRSTA                                                 03228000
DCBAUTOI EQU   DCBTRSTA                                                 03229000
@NM00110 EQU   IHADCS2K+4                                               03230000
DCBDUMPA EQU   DCBDUMPD+1                                               03231000
DCBUNITN EQU   DCBDUMPD                                                 03232000
DCBBCKUA EQU   DCBBCKUP+1                                               03233000
@NM00109 EQU   DCBBCKUP                                                 03234000
DCBIPLTX EQU   IHADCS1A                                                 03235000
@NM00108 EQU   IHADCB                                                   03236000
CUROPCE  EQU   IEDCUREQ+36                                              03237000
CURPIUPC EQU   IEDCUREQ+32                                              03238000
CURTOTBF EQU   IEDCUREQ+28                                              03239000
CURNEWBF EQU   IEDCUREQ+24                                              03240000
CURNXTRC EQU   IEDCUREQ+22                                              03241000
CURFAILT EQU   IEDCUREQ+18                                              03242000
@NM00107 EQU   CURFLG3                                                  03243000
CURDIAL  EQU   CURFLG3                                                  03244000
CURFIRST EQU   CURFLG3                                                  03245000
CURTOTEP EQU   CURFLG3                                                  03246000
CUREPOST EQU   CURFLG3                                                  03247000
CURTERM  EQU   CURFLG2                                                  03248000
CURATTCH EQU   CURFLG2                                                  03249000
@NM00106 EQU   CURFLG2                                                  03250000
CURFLG1  EQU   CURTOTIN                                                 03251000
CURLINK  EQU   IEDCUREQ+8                                               03252000
CURKEY   EQU   IEDCUREQ                                                 03253000
BDUXGRPH EQU   BDUEXRSP                                                 03254000
BDUXFINL EQU   BDUEXRSP                                                 03255000
BDUXINIT EQU   BDUEXRSP                                                 03256000
BDURESP  EQU   BDUSYRSP                                                 03257000
BDUPHASE EQU   BDUSYRSP                                                 03258000
BDUERROR EQU   BDUSYRSP                                                 03259000
BDUXERLK EQU   BDUBDUFG                                                 03260000
BDUALTAK EQU   BDUFNFLG                                                 03261000
BDUNEGAK EQU   BDUFNFLG                                                 03262000
BDUPOSAK EQU   BDUFNFLG                                                 03263000
BDUTPTX  EQU   BDUFNFLG                                                 03264000
BDULEADG EQU   BDUFNFLG                                                 03265000
BDUHEADR EQU   BDUFNFLG                                                 03266000
BDUMODIF EQU   IEDBDU+1                                                 03267000
SAVTLLCB EQU   IEDNSVTD+316                                             03268000
SAVTBITN EQU   IEDNSVTD+312                                             03269000
@NM00105 EQU   SAVTCKQB+8                                               03270000
@NM00104 EQU   SAVTCKEC+1                                               03271000
@NM00103 EQU   SAVTCKCC                                                 03272000
SAVTCKPO EQU   SAVTCKCC                                                 03273000
SAVTCKWA EQU   SAVTCKCC                                                 03274000
SAVTCKCH EQU   SAVTCKTB+1                                               03275000
SAVTCKVT EQU   SAVTCKTB                                                 03276000
@NM00102 EQU   IEDNSVTD+297                                             03277000
SAVTRDFG EQU   SAVTRDRV+12                                              03278000
@NM00101 EQU   SAVTRDRV+5                                               03279000
SAVTRDPY EQU   SAVTRDRV+4                                               03280000
SAVTRDQB EQU   SAVTRDRV+1                                               03281000
SAVTRDKY EQU   SAVTRDRV                                                 03282000
SAVTNID  EQU   IEDNSVTD+280                                             03283000
SAVTDVAS EQU   IEDNSVTD+276                                             03284000
SAVTPLSZ EQU   IEDNSVTD+274                                             03285000
@NM00100 EQU   IEDNSVTD+273                                             03286000
SAVTSUBL EQU   IEDNSVTD+272                                             03287000
@NM00099 EQU   SAVTZELM+1                                               03288000
SAVTSUBM EQU   SAVTZELM                                                 03289000
SAVTMHDX EQU   IEDNSVTD+268                                             03290000
SAVTNAT1 EQU   IEDNSVTD+266                                             03291000
SAVTSH20 EQU   IEDNSVTD+264                                             03292000
SAVTRNMP EQU   IEDNSVTD+256                                             03293000
SAVTNAX  EQU   IEDNSVTD+248                                             03294000
SAVTSUBV EQU   IEDNSVTD+247                                             03295000
SAVTSUBA EQU   IEDNSVTD+246                                             03296000
SAVTSIBC EQU   IEDNSVTD+244                                             03297000
SAVTBSM  EQU   IEDNSVTD+240                                             03298000
SAVTRQTG EQU   IEDNSVTD+236                                             03299000
SAVTRQCH EQU   IEDNSVTD+232                                             03300000
SAVTMAND EQU   IEDNSVTD+228                                             03301000
SAVTSPLN EQU   IEDNSVTD+224                                             03302000
SAVTNADL EQU   IEDNSVTD+222                                             03303000
SAVTNATL EQU   IEDNSVTD+220                                             03304000
SAVTMHTB EQU   IEDNSVTD+216                                             03305000
SAVTSSMH EQU   IEDNSVTD+212                                             03306000
SAVTQRS  EQU   IEDNSVTD+208                                             03307000
SAVTRQIN EQU   IEDNSVTD+204                                             03308000
SAVTDFCO EQU   IEDNSVTD+200                                             03309000
SAVTSAO  EQU   IEDNSVTD+196                                             03310000
SAVTSARI EQU   IEDNSVTD+192                                             03311000
SAVTSAC  EQU   IEDNSVTD+188                                             03312000
SAVTSAI  EQU   IEDNSVTD+184                                             03313000
SAVTCSCI EQU   IEDNSVTD+180                                             03314000
SAVTSSRP EQU   IEDNSVTD+176                                             03315000
SAVTSSRQ EQU   IEDNSVTD+172                                             03316000
SAVTSCLU EQU   IEDNSVTD+168                                             03317000
SAVTXTRQ EQU   IEDNSVTD+164                                             03318000
SAVTMVBF EQU   IEDNSVTD+160                                             03319000
@NM00098 EQU   IEDNSVTD+148                                             03320000
SAVTIPCQ EQU   IEDNSVTD+144                                             03321000
@NM00097 EQU   IEDNSVTD+136                                             03322000
SAVTXFMI EQU   IEDNSVTD+132                                             03323000
@NM00096 EQU   IEDNSVTD+124                                             03324000
SAVTXFMO EQU   IEDNSVTD+120                                             03325000
@NM00095 EQU   IEDNSVTD+116                                             03326000
SAVTSSSR EQU   IEDNSVTD+112                                             03327000
SAVTSCPQ EQU   IEDNSVTD+108                                             03328000
SAVTSLCB EQU   IEDNSVTD+104                                             03329000
SAVTLUSR EQU   IEDNSVTD+100                                             03330000
@NM00094 EQU   SAVTLUSQ+8                                               03331000
SAVTLUSP EQU   SAVTLUSQ+4                                               03332000
SAVTLUSB EQU   SAVTLUSQ                                                 03333000
@NM00093 EQU   IEDNSVTD+84                                              03334000
SAVTSAT  EQU   IEDNSVTD+80                                              03335000
SAVTNAT  EQU   IEDNSVTD+76                                              03336000
SAVTPIUT EQU   IEDNSVTD+68                                              03337000
SAVTRNTA EQU   IEDNSVTD+64                                              03338000
SAVTDNIR EQU   IEDNSVTD+60                                              03339000
SAVTCNIR EQU   IEDNSVTD+56                                              03340000
SAVTFLDH EQU   IEDNSVTD+52                                              03341000
SAVTSRTN EQU   IEDNSVTD+48                                              03342000
SAVTSREQ EQU   IEDNSVTD+44                                              03343000
SAVTFAIL EQU   IEDNSVTD+42                                              03344000
SAVTSUSE EQU   IEDNSVTD+40                                              03345000
SAVTSIB  EQU   IEDNSVTD+36                                              03346000
SAVTPRTN EQU   IEDNSVTD+32                                              03347000
@NM00092 EQU   IEDNSVTD+28                                              03348000
SAVTWH20 EQU   IEDNSVTD+26                                              03349000
SAVTPWT  EQU   IEDNSVTD+24                                              03350000
SAVTPRTQ EQU   IEDNSVTD+20                                              03351000
SAVTPREQ EQU   IEDNSVTD+16                                              03352000
SAVTPH20 EQU   IEDNSVTD+14                                              03353000
SAVTPUSE EQU   IEDNSVTD+12                                              03354000
SAVTPLCB EQU   IEDNSVTD+8                                               03355000
SAVTPOOL EQU   IEDNSVTD+4                                               03356000
SAVTPRMT EQU   SAVTDIAF                                                 03357000
SAVTVIRT EQU   SAVTDIAF                                                 03358000
AVTCPBNO EQU   IEDQAVTD+1244                                            03359000
AVTHRESS EQU   IEDQAVTD+1243                                            03360000
@NM00091 EQU   IEDQAVTD+1242                                            03361000
@NM00090 EQU   IEDQAVTD+1241                                            03362000
@NM00089 EQU   IEDQAVTD+1240                                            03363000
@NM00088 EQU   IEDQAVTD+1237                                            03364000
@NM00087 EQU   IEDQAVTD+1236                                            03365000
AVTHRESE EQU   @NM00086                                                 03366000
AVTRADDR EQU   IEDQAVTD+1228                                            03367000
AVTNADDR EQU   IEDQAVTD+1224                                            03368000
AVTHRESN EQU   IEDQAVTD+1220                                            03369000
AVTVOLRN EQU   IEDQAVTD+1216                                            03370000
AVTTOTNN EQU   IEDQAVTD+1212                                            03371000
AVTTRCYN EQU   IEDQAVTD+1208                                            03372000
AVTRCTRN EQU   IEDQAVTD+1204                                            03373000
AVTNOVON EQU   IEDQAVTD+1200                                            03374000
AVTADEBN EQU   IEDQAVTD+1196                                            03375000
AVTVOLRR EQU   IEDQAVTD+1192                                            03376000
AVTTOTNR EQU   IEDQAVTD+1188                                            03377000
AVTTRCYR EQU   IEDQAVTD+1184                                            03378000
AVTRCTRR EQU   IEDQAVTD+1180                                            03379000
AVTNOVOR EQU   IEDQAVTD+1176                                            03380000
AVTADEBR EQU   IEDQAVTD+1172                                            03381000
AVTLODPT EQU   IEDQAVTD+1168                                            03382000
AVTIOBN  EQU   IEDQAVTD+1164                                            03383000
AVTIOBR  EQU   IEDQAVTD+1160                                            03384000
AVTCPBPT EQU   IEDQAVTD+1156                                            03385000
AVTFCPB  EQU   IEDQAVTD+1152                                            03386000
@NM00085 EQU   IEDQAVTD+1148                                            03387000
AVTINCPQ EQU   IEDQAVTD+1144                                            03388000
@NM00084 EQU   IEDQAVTD+1140                                            03389000
@NM00083 EQU   IEDQAVTD+1137                                            03390000
@NM00082 EQU   AVTBIT4                                                  03391000
@NM00081 EQU   AVTBIT4                                                  03392000
@NM00080 EQU   AVTBIT4                                                  03393000
@NM00079 EQU   AVTBIT4                                                  03394000
@NM00078 EQU   AVTBIT4                                                  03395000
@NM00077 EQU   AVTBIT4                                                  03396000
@NM00076 EQU   AVTBIT4                                                  03397000
AVTRUFTN EQU   AVTBIT4                                                  03398000
@NM00075 EQU   IEDQAVTD+1132                                            03399000
AVTNOBFQ EQU   IEDQAVTD+1128                                            03400000
@NM00074 EQU   IEDQAVTD+1124                                            03401000
AVTDKENQ EQU   IEDQAVTD+1120                                            03402000
@NM00073 EQU   IEDQAVTD+1116                                            03403000
AVTDKAPQ EQU   IEDQAVTD+1112                                            03404000
AVTCOPY  EQU   IEDQAVTD+1108                                            03405000
AVTIA    EQU   IEDQAVTD+1104                                            03406000
AVTFL    EQU   IEDQAVTD+1100                                            03407000
@NM00072 EQU   IEDQAVTD+1096                                            03408000
AVTNCPBQ EQU   IEDQAVTD+1092                                            03409000
AVTTOTNC EQU   IEDQAVTD+1088                                            03410000
AVTCMAX  EQU   IEDQAVTD+1084                                            03411000
AVTCMIN  EQU   IEDQAVTD+1080                                            03412000
AVTHM02  EQU   IEDQAVTD+1076                                            03413000
AVTDCTLN EQU   IEDQAVTD+1072                                            03414000
AVTOPMSK EQU   IEDQAVTD+1068                                            03415000
AVTSTEAL EQU   IEDQAVTD+1060                                            03416000
AVTOPTN  EQU   IEDQAVTD+1056                                            03417000
AVTDSKCT EQU   IEDQAVTD+1054                                            03418000
AVTCKRST EQU   IEDQAVTD+1053                                            03419000
AVTSTAN  EQU   AVTBIT3                                                  03420000
AVTSTACN EQU   AVTBIT3                                                  03421000
AVTSTAIN EQU   AVTBIT3                                                  03422000
AVTSTAYN EQU   AVTBIT3                                                  03423000
AVTOLTBN EQU   AVTBIT3                                                  03424000
AVTTSAB  EQU   AVTBIT3                                                  03425000
AVTRFULN EQU   AVTBIT3                                                  03426000
AVTRECVN EQU   AVTBIT3                                                  03427000
@NM00071 EQU   AVTBIT2                                                  03428000
@NM00070 EQU   AVTBIT2                                                  03429000
AVTOPEIN EQU   AVTBIT2                                                  03430000
AVTSTRTN EQU   AVTBIT2                                                  03431000
AVTTOPOL EQU   AVTBIT2                                                  03432000
AVTCOPYN EQU   AVTBIT2                                                  03433000
AVTREUSN EQU   AVTBIT2                                                  03434000
AVTEXTSC EQU   AVTBIT2                                                  03435000
AVTDISKN EQU   AVTBIT1                                                  03436000
AVTQUCKN EQU   AVTBIT1                                                  03437000
AVTCLOSN EQU   AVTBIT1                                                  03438000
AVTREADN EQU   AVTBIT1                                                  03439000
AVTDLAYN EQU   AVTBIT1                                                  03440000
AVTAQTAN EQU   AVTBIT1                                                  03441000
AVTTSON  EQU   AVTBIT1                                                  03442000
AVTAPLKN EQU   AVTBIT1                                                  03443000
AVTDUMBR EQU   IEDQAVTD+1048                                            03444000
AVTDLQX  EQU   IEDQAVTD+1046                                            03445000
AVTINTLV EQU   IEDQAVTD+1044                                            03446000
AVTSMCNT EQU   IEDQAVTD+1042                                            03447000
AVTOPCNT EQU   IEDQAVTD+1036                                            03448000
AVTLNCNT EQU   IEDQAVTD+1034                                            03449000
AVTKEYLE EQU   IEDQAVTD+1032                                            03450000
AVTHA16  EQU   IEDQAVTD+1030                                            03451000
AVTHA7   EQU   IEDQAVTD+1028                                            03452000
AVTHA4   EQU   IEDQAVTD+1026                                            03453000
AVTHA3   EQU   IEDQAVTD+1024                                            03454000
AVTHA2   EQU   IEDQAVTD+1022                                            03455000
AVTGETMS EQU   IEDQAVTD+1021                                            03456000
@NM00069 EQU   IEDQAVTD+1020                                            03457000
AVTGETMD EQU   IEDQAVTD+1016                                            03458000
AVTGETMN EQU   IEDQAVTD+1012                                            03459000
AVTCWTOT EQU   IEDQAVTD+1008                                            03460000
AVTCWINT EQU   IEDQAVTD+956                                             03461000
AVTDTRAP EQU   IEDQAVTD+952                                             03462000
@NM00068 EQU   IEDQAVTD+950                                             03463000
@NM00067 EQU   AVTIOTR                                                  03464000
AVTIOTRH EQU   AVTIOTR                                                  03465000
AVTIOTRE EQU   AVTIOTR                                                  03466000
@NM00066 EQU   AVTSUBT                                                  03467000
AVTSUBPT EQU   AVTSUBT                                                  03468000
AVTSUBON EQU   AVTSUBT                                                  03469000
AVTAFE30 EQU   IEDQAVTD+944                                             03470000
AVTAFE20 EQU   IEDQAVTD+940                                             03471000
AVTAFE10 EQU   IEDQAVTD+936                                             03472000
AVTCWEC2 EQU   IEDQAVTD+932                                             03473000
AVTCWPM2 EQU   IEDQAVTD+928                                             03474000
AVTCWTS2 EQU   IEDQAVTD+927                                             03475000
AVTCWTS1 EQU   IEDQAVTD+926                                             03476000
AVTCWCLD EQU   AVTCWFL2                                                 03477000
AVTCWRAP EQU   AVTCWFL2                                                 03478000
@NM00065 EQU   AVTCWFL2                                                 03479000
@NM00064 EQU   AVTCWFL2                                                 03480000
@NM00063 EQU   AVTCWFL2                                                 03481000
@NM00062 EQU   AVTCWFL2                                                 03482000
@NM00061 EQU   AVTCWFL2                                                 03483000
AVTCWACT EQU   AVTCWFL2                                                 03484000
@NM00060 EQU   AVTCWFL1                                                 03485000
@NM00059 EQU   AVTCWFL1                                                 03486000
@NM00058 EQU   AVTCWFL1                                                 03487000
@NM00057 EQU   AVTCWFL1                                                 03488000
@NM00056 EQU   AVTCWFL1                                                 03489000
@NM00055 EQU   AVTCWFL1                                                 03490000
@NM00054 EQU   AVTCWFL1                                                 03491000
AVTCOMWN EQU   AVTCWFL1                                                 03492000
AVTCWEC1 EQU   IEDQAVTD+920                                             03493000
AVTCWPM1 EQU   IEDQAVTD+916                                             03494000
AVTCAREA EQU   IEDQAVTD+912                                             03495000
AVTFZERO EQU   IEDQAVTD+908                                             03496000
AVTCADDR EQU   IEDQAVTD+904                                             03497000
AVTCOREC EQU   IEDQAVTD+900                                             03498000
@NM00053 EQU   IEDQAVTD+892                                             03499000
AVTCPBCB EQU   IEDQAVTD+888                                             03500000
@NM00052 EQU   IEDQAVTD+880                                             03501000
AVTDSIOB EQU   IEDQAVTD+876                                             03502000
@NM00051 EQU   IEDQAVTD+868                                             03503000
AVTCPRMB EQU   IEDQAVTD+864                                             03504000
@NM00050 EQU   IEDQAVTD+856                                             03505000
AVTCLOSB EQU   IEDQAVTD+852                                             03506000
@NM00049 EQU   IEDQAVTD+844                                             03507000
AVTACTIB EQU   IEDQAVTD+840                                             03508000
@NM00048 EQU   IEDQAVTD+836                                             03509000
AVTOLTEB EQU   IEDQAVTD+832                                             03510000
AVTOLTCH EQU   AVTOLTQB+1                                               03511000
AVTOLTVT EQU   AVTOLTQB                                                 03512000
@NM00047 EQU   AVTOPCQB+8                                               03513000
@NM00046 EQU   AVTOPCEC+1                                               03514000
@NM00045 EQU   AVTOPCCC                                                 03515000
AVTOPCPO EQU   AVTOPCCC                                                 03516000
AVTOPCWA EQU   AVTOPCCC                                                 03517000
AVTOPCCH EQU   AVTOPCOB+1                                               03518000
AVTOPCVT EQU   AVTOPCOB                                                 03519000
@NM00044 EQU   AVTCKPQB+9                                               03520000
AVTCKPTS EQU   AVTCKPQB+8                                               03521000
@NM00043 EQU   AVTCKPEC+1                                               03522000
@NM00042 EQU   AVTCKPCC                                                 03523000
AVTCKPPO EQU   AVTCKPCC                                                 03524000
AVTCKPWA EQU   AVTCKPCC                                                 03525000
AVTCKPCH EQU   AVTCKPTB+1                                               03526000
AVTCKPVT EQU   AVTCKPTB                                                 03527000
@NM00041 EQU   IEDQAVTD+796                                             03528000
AVTBFRTB EQU   IEDQAVTD+792                                             03529000
@NM00040 EQU   IEDQAVTD+788                                             03530000
AVTSELCH EQU   IEDQAVTD+785                                             03531000
AVTBFRTN EQU   AVTBFRFG                                                 03532000
AVTBFREB EQU   IEDQAVTD+780                                             03533000
AVTTIMQ  EQU   IEDQAVTD+776                                             03534000
@NM00039 EQU   IEDQAVTD+772                                             03535000
AVTIMQPS EQU   IEDQAVTD+768                                             03536000
AVTINOUT EQU   IEDQAVTD+766                                             03537000
AVTREFTM EQU   IEDQAVTD+764                                             03538000
@NM00038 EQU   IEDQAVTD+752                                             03539000
AVTDELYB EQU   IEDQAVTD+748                                             03540000
AVTOCQPT EQU   IEDQAVTD+744                                             03541000
AVTTSOPT EQU   IEDQAVTD+740                                             03542000
AVTSUPPT EQU   IEDQAVTD+736                                             03543000
AVTCBQCB EQU   IEDQAVTD+732                                             03544000
AVTMSGS  EQU   IEDQAVTD+729                                             03545000
@NM00037 EQU   AVTSYSER                                                 03546000
@NM00036 EQU   AVTSYSER                                                 03547000
@NM00035 EQU   AVTSYSER                                                 03548000
@NM00034 EQU   AVTSYSER                                                 03549000
@NM00033 EQU   AVTSYSER                                                 03550000
@NM00032 EQU   AVTSYSER                                                 03551000
AVTCMAXN EQU   AVTSYSER                                                 03552000
AVTCMINN EQU   AVTSYSER                                                 03553000
AVT2260L EQU   IEDQAVTD+724                                             03554000
AVTABEPL EQU   AVTADBUF                                                 03555000
AVTHFF   EQU   AVTCLRHI+2                                               03556000
@NM00031 EQU   AVTCLRHI                                                 03557000
AVTCCLNK EQU   AVTCRELE+5                                               03558000
AVTCCPRI EQU   AVTCRELE+4                                               03559000
AVTCCQCB EQU   AVTCCELE+1                                               03560000
AVTCCKEY EQU   AVTCCELE                                                 03561000
AVTDELAD EQU   IEDQAVTD+704                                             03562000
AVTDELEM EQU   IEDQAVTD+700                                             03563000
AVTBSX   EQU   AVTCKLNK                                                 03564000
AVTOPETR EQU   AVTHG01                                                  03565000
@NM00030 EQU   AVTCKBYT                                                 03566000
AVTCKONQ EQU   AVTCKBYT                                                 03567000
@NM00029 EQU   AVTCKBYT                                                 03568000
@NM00028 EQU   AVTCKBYT                                                 03569000
@NM00027 EQU   AVTCKBYT                                                 03570000
@NM00026 EQU   AVTCKBYT                                                 03571000
@NM00025 EQU   AVTCKBYT                                                 03572000
@NM00024 EQU   AVTCKBYT                                                 03573000
AVTOPERT EQU   IEDQAVTD+690                                             03574000
AVTOPXCL EQU   IEDQAVTD+688                                             03575000
AVTOPERL EQU   IEDQAVTD+687                                             03576000
@NM00023 EQU   IEDQAVTD+686                                             03577000
AVTCKTIM EQU   IEDQAVTD+684                                             03578000
AVTCKELV EQU   IEDQAVTD+682                                             03579000
AVTCPRCD EQU   IEDQAVTD+681                                             03580000
AVTWARMN EQU   AVTCKELF                                                 03581000
AVTCRTLN EQU   AVTCKELF                                                 03582000
AVTCPIPN EQU   AVTCKELF                                                 03583000
AVTCCLCN EQU   AVTCKELF                                                 03584000
AVTCINCN EQU   AVTCKELF                                                 03585000
@NM00022 EQU   AVTCKELF                                                 03586000
AVTCMCPN EQU   AVTCKELF                                                 03587000
AVTNQBCK EQU   AVTCKELF                                                 03588000
AVTCKQAD EQU   IEDQAVTD+677                                             03589000
AVTSCBSZ EQU   IEDQAVTD+676                                             03590000
@NM00021 EQU   IEDQAVTD+672                                             03591000
AVTCKELE EQU   IEDQAVTD+668                                             03592000
@NM00020 EQU   AVTCKPEL+8                                               03593000
AVTCKRLK EQU   AVTCKPEL+5                                               03594000
AVTCKRPR EQU   AVTCKPEL+4                                               03595000
AVTCKRMQ EQU   AVTCKRMV+1                                               03596000
AVTCKRKY EQU   AVTCKRMV                                                 03597000
AVTHK    EQU   IEDQAVTD+648                                             03598000
AVTHI    EQU   IEDQAVTD+644                                             03599000
AVTIOT   EQU   IEDQAVTD+640                                             03600000
AVTNX    EQU   IEDQAVTD+636                                             03601000
AVTTONE  EQU   IEDQAVTD+632                                             03602000
AVTA3TL  EQU   IEDQAVTD+628                                             03603000
AVTDMECB EQU   IEDQAVTD+624                                             03604000
AVTABEND EQU   IEDQAVTD+618                                             03605000
AVTPLCBN EQU   IEDQAVTD+616                                             03606000
@NM00019 EQU   AVTSAVTP+1                                               03607000
@NM00018 EQU   AVTSAVTF                                                 03608000
AVTSNA   EQU   AVTSAVTF                                                 03609000
AVTONSNA EQU   AVTSAVTF                                                 03610000
AVTVTMCP EQU   AVTSAVTF                                                 03611000
@NM00017 EQU   IEDQAVTD+608                                             03612000
AVTCMBSS EQU   IEDQAVTD+604                                             03613000
AVTRCV   EQU   IEDQAVTD+600                                             03614000
AVTSEND  EQU   IEDQAVTD+596                                             03615000
AVTCSCH  EQU   IEDQAVTD+592                                             03616000
AVTQ1    EQU   IEDQAVTD+588                                             03617000
AVTE7    EQU   IEDQAVTD+584                                             03618000
AVTHB    EQU   IEDQAVTD+580                                             03619000
AVTR1    EQU   IEDQAVTD+576                                             03620000
AVTBZ    EQU   IEDQAVTD+572                                             03621000
AVTEZ    EQU   IEDQAVTD+568                                             03622000
AVTEC    EQU   IEDQAVTD+564                                             03623000
AVTEW    EQU   IEDQAVTD+560                                             03624000
AVTNDIAL EQU   AVTSCOPT                                                 03625000
AVTN2741 EQU   AVTSCOPT                                                 03626000
AVTCONCO EQU   AVTSCOPT                                                 03627000
AVTCONC  EQU   AVTSCOPT                                                 03628000
AVTCMBUF EQU   AVTSCOPT                                                 03629000
AVTAPDMP EQU   AVTSCOPT                                                 03630000
@NM00016 EQU   AVTSCOPT                                                 03631000
AVTHA    EQU   AVTDISP                                                  03632000
AVTEA    EQU   IEDQAVTD+548                                             03633000
AVTAX    EQU   IEDQAVTD+544                                             03634000
AVTA3    EQU   IEDQAVTD+540                                             03635000
AVTGD    EQU   IEDQAVTD+536                                             03636000
AVTAL    EQU   IEDQAVTD+532                                             03637000
AVTOLTST EQU   AVTHG02                                                  03638000
AVTE8    EQU   IEDQAVTD+524                                             03639000
AVTUI    EQU   IEDQAVTD+520                                             03640000
AVTCOMPT EQU   IEDQAVTD+516                                             03641000
AVTCRSRF EQU   IEDQAVTD+512                                             03642000
@NM00015 EQU   IEDQAVTD+508                                             03643000
AVTKA02  EQU   IEDQAVTD+504                                             03644000
AVTOPTPT EQU   IEDQAVTD+500                                             03645000
AVTPCBPT EQU   IEDQAVTD+496                                             03646000
@NM00014 EQU   AVTECB1                                                  03647000
AVTCOMP  EQU   AVTECB1                                                  03648000
@NM00013 EQU   AVTECB1                                                  03649000
AVTOPECA EQU   IEDQAVTD+488                                             03650000
AVTOLECA EQU   IEDQAVTD+484                                             03651000
AVTCKECA EQU   IEDQAVTD+480                                             03652000
AVTCWECA EQU   IEDQAVTD+476                                             03653000
AVTCWTCB EQU   IEDQAVTD+472                                             03654000
AVTOLTCB EQU   IEDQAVTD+468                                             03655000
AVTOCTCB EQU   IEDQAVTD+464                                             03656000
AVTCKTCB EQU   IEDQAVTD+460                                             03657000
AVTAS    EQU   IEDQAVTD+456                                             03658000
AVTNOLBF EQU   IEDQAVTD+454                                             03659000
AVTNCKPR EQU   IEDQAVTD+453                                             03660000
AVTCIB   EQU   IEDQAVTD+452                                             03661000
AVTSPLPT EQU   IEDQAVTD+448                                             03662000
AVTMVBFR EQU   IEDQAVTD+444                                             03663000
AVTSBTA  EQU   IEDQAVTD+440                                             03664000
AVTRARTN EQU   IEDQAVTD+436                                             03665000
AVTBSCAN EQU   IEDQAVTD+432                                             03666000
AVTRDYA  EQU   IEDQAVTD+428                                             03667000
AVTDISTR EQU   IEDQAVTD+420                                             03668000
AVTPARM3 EQU   IEDQAVTD+416                                             03669000
@NM00012 EQU   AVTPKF                                                   03670000
@NM00011 EQU   AVTPKF                                                   03671000
@NM00010 EQU   AVTPKF                                                   03672000
AVTFTCHF EQU   AVTPKF                                                   03673000
@NM00009 EQU   AVTPKF                                                   03674000
@NM00008 EQU   AVTPKF                                                   03675000
@NM00007 EQU   AVTPKF                                                   03676000
@NM00006 EQU   AVTPKF                                                   03677000
AVTPARM  EQU   IEDQAVTD+408                                             03678000
AVTEXS2A EQU   IEDQAVTD+402                                             03679000
AVTEXA2S EQU   IEDQAVTD+396                                             03680000
AVTOCGET EQU   IEDQAVTD+392                                             03681000
AVTCKAVT EQU   @NM00004+1                                               03682000
@NM00005 EQU   AVTCKFLG                                                 03683000
AVTCKHLT EQU   AVTCKFLG                                                 03684000
AVTCKREQ EQU   AVTCKFLG                                                 03685000
AVTCKENV EQU   AVTCKFLG                                                 03686000
AVTCKNAC EQU   AVTCKFLG                                                 03687000
AVTCKTAC EQU   AVTCKFLG                                                 03688000
AVTBUENT EQU   IEDQAVTD+386                                             03689000
@NM00003 EQU   IEDQAVTD+385                                             03690000
AVTFULLT EQU   AVTBUFSW                                                 03691000
AVTUNCON EQU   AVTBUFSW                                                 03692000
@NM00002 EQU   AVTBUFSW                                                 03693000
AVTBUFTR EQU   AVTREADD                                                 03694000
AVTREADY EQU   IEDQAVTD+376                                             03695000
AVTRACE  EQU   IEDQAVTD+372                                             03696000
AVTTCB   EQU   IEDQAVTD+368                                             03697000
AVTPASWD EQU   IEDQAVTD+360                                             03698000
AVTCTLCH EQU   IEDQAVTD+352                                             03699000
AVTDOUBL EQU   IEDQAVTD+344                                             03700000
AVTDOUBX EQU   IEDQAVTD+336                                             03701000
AVTDPARM EQU   IEDQAVTD+332                                             03702000
AVTCSTCS EQU   IEDQAVTD+328                                             03703000
AVTDLQ   EQU   AVTSAVEX+32                                              03704000
@NM00001 EQU   AVTSAVEX                                                 03705000
AVTSAVE4 EQU   IEDQAVTD+216                                             03706000
AVTSAVE3 EQU   IEDQAVTD+144                                             03707000
AVTSAVE2 EQU   IEDQAVTD+72                                              03708000
AVTSAVE1 EQU   IEDQAVTD                                                 03709000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03710000
@RC00752 EQU   @RC00750                                                 03711000
@RF00772 EQU   @RC00750                                                 03712000
@RC00754 EQU   @RC00752                                                 03713000
@RF00762 EQU   @RC00752                                                 03714000
@ENDDATA EQU   *                                                        03715000
         END   IGCC110D,(C'PLS2317',0701,78089)                         03716000
