         TITLE 'IGCFJ10D, ACTIVATE NCP RESPONSE PROCESSOR              *00001000
                        '                                               00002000
IGCFJ10D CSECT ,                                                01S0001 00003000
@PROLOG  BALR  @12,0                                            01S0001 00004000
@PSTART  DS    0H                                               01S0001 00005000
         USING @PSTART,@12                                      01S0001 00006000
*                                   /*                                  00007000
IGCFJ10D IEDHJN AFTERHJN,HJN           MODULE IDENTIFICATION MACRO      00008000
*   ROPCAVT=RPARM;                  /* SET THE BASE POINTER FOR THE     00009000
*                                      OPERATOR CONTROL ADDRESS 02S0369 00010000
*                                      VECTOR TABLE                  */ 00011000
         LR    ROPCAVT,RPARM                                    02S0369 00012000
*   REG10=OPCWORK;                  /* SET THE BASE REGISTER TO BE      00013000
*                                      USED FOR ADDRESSING AUTOMATIC    00014000
*                                      DATA WITH THE POINTER TO THE     00015000
*                                      OPERATOR CONTROL RESIDENT WORK   00016000
*                                      AREA                          */ 00017000
         L     REG10,OPCWORK(,ROPCAVT)                          02S0370 00018000
*   GEN REFS(REG10) NOSETS;                                     02S0371 00019000
*                                   /*                                  00020000
         USING @DATD,REG10             INFORM THE ASSEMBLER OF THE      00021000
*                                      BASE REGISTER TO BE USED FOR     00022000
*                                      ADDRESSING AUTOMATIC DATA        00023000
*   RSAVE=ADDR(OPCSAVE);            /* SET THE SAVE AREA POINTER        00024000
*                                      REGISTER WITH THE POINTER TO     00025000
*                                      THE OPERATOR CONTROL SAVE AREA*/ 00026000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          02S0372 00027000
*                                                               02S0373 00028000
*   /*****************************************************************/ 00029000
*   /*                                                               */ 00030000
*   /* PROCESS: THIS SEGMENT DOES THE PROCESSING THAT IS NECESSARY TO*/ 00031000
*   /* PERFORM THE FUNCTION OF THE MODULE.                           */ 00032000
*   /*                                                               */ 00033000
*   /*****************************************************************/ 00034000
*                                                               02S0373 00035000
*                                                               03S0373 00036000
*   /*****************************************************************/ 00037000
*   /*                                                               */ 00038000
*   /* PROCESS.INITIAL: THIS SEGMENT DOES THE INITIAL PROCESSING.    */ 00039000
*   /*                                                               */ 00040000
*   /*****************************************************************/ 00041000
*                                                               03S0373 00042000
*   DO;                                                         03S0373 00043000
*     RAVT=OPCAVTPT;                /* SET THE BASE POINTER FOR THE     00044000
*                                      TCAM ADDRESS VECTOR TABLE     */ 00045000
         L     RAVT,OPCAVTPT(,ROPCAVT)                          03S0374 00046000
*     ROPCE=OPCCOPCE;               /* SET THE BASE POINTER FOR THE     00047000
*                                      OPERATOR CONTROL ELEMENT      */ 00048000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         03S0375 00049000
*     HALFUNIT=(AVTNOLBF/2);        /* INITIALIZE THE THRESHOLD UNIT    00050000
*                                      COUNT                         */ 00051000
         LH    @06,AVTNOLBF(,RAVT)                              03S0376 00052000
         SRDA  @06,32                                           03S0376 00053000
         D     @06,@CF00067                                     03S0376 00054000
         STH   @07,HALFUNIT                                     03S0376 00055000
*     FLAGS=''B;                    /* INIT FLAGS                    */ 00056000
         SLR   @11,@11                                          03S0377 00057000
         ST    @11,FLAGS                                        03S0377 00058000
*   END;                                                        03S0378 00059000
*                                                               03S0379 00060000
*   /*****************************************************************/ 00061000
*   /*                                                               */ 00062000
*   /* PROCESS.MAINSEG: THIS SEGMENT ROUTES THE OPCES TO THE CORRECT */ 00063000
*   /* ROUTINES FOR PROCESSING                                       */ 00064000
*   /*                                                               */ 00065000
*   /*****************************************************************/ 00066000
*                                                               03S0379 00067000
*   IF OCREDRVE=OFF THEN            /* IF NOT REDRIVE OPCE THEN      */ 00068000
         TM    OCREDRVE(ROPCE),B'00010000'                      03S0379 00069000
         BNZ   @RF00379                                         03S0379 00070000
*     DO;                                                       03S0380 00071000
*       IF OCSWITCH^=OCACTNCP THEN  /* IF NOT ACTPU RESP THEN        */ 00072000
         CLI   OCSWITCH(ROPCE),X'70'                            03S0381 00073000
         BE    @RF00381                                         03S0381 00074000
*         IF OCSWITCH^=OCSETTD      /* IF NOT SET TIME-DATE RESP THEN*/ 00075000
*           THEN                                                03S0382 00076000
         CLI   OCSWITCH(ROPCE),X'E0'                            03S0382 00077000
         BNE   @RT00382                                         03S0382 00078000
*           ;                       /* FALL THROUGH                  */ 00079000
*         ELSE                      /* ELSE PROCESS SET TIME-DATE       00080000
*                                      RESPONSE                      */ 00081000
*           DO;                                                 03S0384 00082000
*                                                               04S0385 00083000
*             /*******************************************************/ 00084000
*             /*                                                     */ 00085000
*             /* SET CONTROL VECTOR RESPONSE PROCESSOR. IF COMMAND   */ 00086000
*             /* WAS SUCCESSFUL, TURN ON IPLED FLAG IN NCP DEVICE    */ 00087000
*             /* DEPENDENT FIELDS. IF UNSUCCESSFUL, SET IPL'ED       */ 00088000
*             /* REQUIRED MSG. AS COMPLETION CODE AND GO CLEANUP.    */ 00089000
*             /*                                                     */ 00090000
*             /*******************************************************/ 00091000
*                                                               04S0385 00092000
*             IF OCPARM>0 THEN      /* IF COMMAND WAS SUCCESSFUL     */ 00093000
         ICM   @11,3,OCPARM(ROPCE)                              04S0385 00094000
         BNP   @RF00385                                         04S0385 00095000
*               DO;                                             04S0386 00096000
*                 RPARM=OCTRMTBL;   /* SET TTCIN OF NCP AS PARM.     */ 00097000
         SLR   RPARM,RPARM                                      04S0387 00098000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          04S0387 00099000
*                 CALL NCPDVCDP;    /* OBTAIN DEVICE DEPENDENT FIELD */ 00100000
         BAL   @14,NCPDVCDP                                     04S0388 00101000
*                 NCPIPLD=ON;       /* TURN ON IPL'ED FLAG           */ 00102000
         OI    NCPIPLD(RTNCODE),B'00001000'                     04S0389 00103000
*                                                               05S0390 00104000
*                 /***************************************************/ 00105000
*                 /*                                                 */ 00106000
*                 /* PROCESS.MAINSEG.SETCVR.DACTCHK: THIS SEGMENT    */ 00107000
*                 /* PERFORMS THE PROCESSING NECESSARY TO SEE IF ANY */ 00108000
*                 /* DEACT LINKS ARE REQUIRED FOR ANY LINKS. IF THE  */ 00109000
*                 /* ORIGINAL COMMAND WAS AN 'IDLE' THEN ALL LINKS   */ 00110000
*                 /* ARE DEACTIVATED. IF NOT AN 'IDLE' THEN ALL      */ 00111000
*                 /* PRE-SNA AND ANY SNA LINES WITHOUT THEIR REMEMBER*/ 00112000
*                 /* BIT ON ARE DEACTIVATED. IF NO DEACTS ARE        */ 00113000
*                 /* NECESSARY THEN THE OPCE IS SET UP TO GO TO THE  */ 00114000
*                 /* ACTLINK SEG TO PERFORM ANY ACTLINK AND RESTART  */ 00115000
*                 /* PROCESSING                                      */ 00116000
*                 /*                                                 */ 00117000
*                 /***************************************************/ 00118000
*                                                               05S0390 00119000
*                 OCWTG=THISMOD;    /* SET UP RETURN TO THIS MODULE  */ 00120000
         MVC   OCWTG(2,ROPCE),THISMOD                           05S0390 00121000
*                 OCSWITCH=OCDACTLK;/* SET UP AS REDRIVE OPCE FOR       00122000
*                                      DACT LINKS                    */ 00123000
         MVI   OCSWITCH(ROPCE),X'60'                            05S0391 00124000
*                 OCREDRVE=ON;                                  05S0392 00125000
         OI    OCREDRVE(ROPCE),B'00010000'                      05S0392 00126000
*                 IF TIC=VALTIC THEN/* IF THERE IS AN ATTACHED RU    */ 00127000
         TM    TIC(ROPCE),B'00000011'                           05S0393 00128000
         BNZ   @RF00393                                         05S0393 00129000
*                   DO;                                         05S0394 00130000
*                     RPARM=OCUNIT; /* THEN POINT TO IT              */ 00131000
         L     RPARM,OCUNIT(,ROPCE)                             05S0395 00132000
*                     CALL FREEBUF; /* AND FREE IT                   */ 00133000
         L     @15,OPCFREBF(,ROPCAVT)                           05S0396 00134000
         BALR  @14,@15                                          05S0396 00135000
*                     OCUNIT=PRUINTIC;/* SET INVALID TIC     @YM05695*/ 00136000
         MVC   OCUNIT(4,ROPCE),@CF01412                         05S0397 00137000
*                   END;                                        05S0398 00138000
*                 ELSE                                          05S0399 00139000
*                   ;                                           05S0399 00140000
@RF00393 DS    0H                                               05S0400 00141000
*                 RPARM=OCPTRSAV-LENGTH(IEDQOPCN);/* BACK UP TO ORIG    00142000
*                                      OPCE NEG PREF                 */ 00143000
         L     RPARM,OCPTRSAV(,ROPCE)                           05S0400 00144000
         SH    RPARM,@CH00047                                   05S0400 00145000
*                 IF RPARM->OCIDLE=ON THEN/* IF ORIG OPCE IS 'IDLE'  */ 00146000
         TM    OCIDLE(RPARM),B'00000001'                        05S0401 00147000
         BNO   @RF00401                                         05S0401 00148000
*                   ACTFLAG=1;      /* THEN SET CNTL TO COUNT ALL       00149000
*                                      LINES                         */ 00150000
         MVC   ACTFLAG(4),@CF00063                              05S0402 00151000
*                 ELSE                                          05S0403 00152000
*                   ACTFLAG=3;      /* ELSE SET TO COUNT PSNA AND       00153000
*                                      INACTIVE SNA LINES            */ 00154000
         B     @RC00401                                         05S0403 00155000
@RF00401 MVC   ACTFLAG(4),@CF00076                              05S0403 00156000
*                 IF TRMSUBST=0 THEN/* IF NO SUBORDINATE RESOURCES      00157000
*                                      THEN DONE                     */ 00158000
@RC00401 LR    @11,RTRM                                         05S0404 00159000
         BCTR  @11,0                                            05S0404 00160000
         BCTR  @11,0                                            05S0404 00161000
         ICM   @09,3,TRMSUBST-12(@11)                           05S0404 00162000
         BNZ   @RF00404                                         05S0404 00163000
*                   DO;                                         05S0405 00164000
*                     OCPTRSAV->OCPARM=GOODMSG;/* SET COMPLETION MSG */ 00165000
         L     @11,OCPTRSAV(,ROPCE)                             05S0406 00166000
         MVC   OCPARM(2,@11),@CH01663                           05S0406 00167000
*                     OPCCOPCE=OCPTRSAV;/* SET ORIG OPCE AS CURRENT  */ 00168000
         ST    @11,OPCCOPCE(,ROPCAVT)                           05S0407 00169000
*                     CALL TERMPROC;/* PERFORM TERMINATION PROCESSING*/ 00170000
         BAL   @14,TERMPROC                                     05S0408 00171000
*                     OUTFLAG=ON;   /* SET TO BYPASS ACTLINK         */ 00172000
         OI    OUTFLAG,B'01000000'                              05S0409 00173000
*                   END;                                        05S0410 00174000
*                 ELSE                                          05S0411 00175000
*                   DO;             /* ELSE PROCESS SUBORDINATE 05S0411 00176000
*                                      RESOURCES                     */ 00177000
         B     @RC00404                                         05S0411 00178000
@RF00404 DS    0H                                               05S0412 00179000
*                     OCBUFNED=0;   /* INIT THE COUNTER FIELDS       */ 00180000
         SLR   @11,@11                                          05S0412 00181000
         STH   @11,OCBUFNED(,ROPCE)                             05S0412 00182000
*                     OCBUFGOT=0;                               05S0413 00183000
         STH   @11,OCBUFGOT(,ROPCE)                             05S0413 00184000
*                     CALL HIERLOOP;/* PERFORM THE COUNT             */ 00185000
         BAL   @14,HIERLOOP                                     05S0414 00186000
*                     IF OCBUFNED^=0 THEN/* IF ANY DEACTS TO BE DONE */ 00187000
         ICM   @11,3,OCBUFNED(ROPCE)                            05S0415 00188000
         BZ    @RF00415                                         05S0415 00189000
*                       DO;         /* THEN                          */ 00190000
*                         RPARM=OCPTRSAV-LENGTH(IEDQOPCN);/* BACK UP    00191000
*                                      TO ORIG OPCE NEG PREF         */ 00192000
         L     RPARM,OCPTRSAV(,ROPCE)                           05S0417 00193000
         SH    RPARM,@CH00047                                   05S0417 00194000
*                         RPARM->OCRESPCT=OCBUFNED;/* AND SET   05S0418 00195000
*                                      OUTSTANDING RESPONSE COUNT    */ 00196000
         MVC   OCRESPCT(2,RPARM),OCBUFNED(ROPCE)                05S0418 00197000
*                         CALL GETBUFS;/* AND GO GET BUFS            */ 00198000
         BAL   @14,GETBUFS                                      05S0419 00199000
*                         IF OUTFLAG=OFF THEN/* IF COULD OBTAIN ANY     00200000
*                                      BUFFERS THEN                  */ 00201000
         TM    OUTFLAG,B'01000000'                              05S0420 00202000
         BNZ   @RF00420                                         05S0420 00203000
*                           DO;                                 05S0421 00204000
*                             ACTFLAG=ACTFLAG+1;/* SET CNTL TO BUILD    00205000
*                                      DEACTS                        */ 00206000
         LA    @11,1                                            05S0422 00207000
         AL    @11,ACTFLAG                                      05S0422 00208000
         ST    @11,ACTFLAG                                      05S0422 00209000
*                             CALL BLDER;/* AND GO BUILD THEM AND       00210000
*                                      POST THEM                     */ 00211000
         BAL   @14,BLDER                                        05S0423 00212000
*                           END;                                05S0424 00213000
*                         ELSE                                  05S0425 00214000
*                           ;                                   05S0425 00215000
@RF00420 DS    0H                                               05S0426 00216000
*                       END;                                    05S0426 00217000
*                     ELSE          /* ELSE SET UP TO DO ACT LINKS      00218000
*                                      AND STARTLINES                */ 00219000
*                       DO;                                     05S0427 00220000
         B     @RC00415                                         05S0427 00221000
@RF00415 DS    0H                                               05S0428 00222000
*                         OCSWITCH=OCACTLK;/* SET ACTLINK CODE       */ 00223000
         MVI   OCSWITCH(ROPCE),X'50'                            05S0428 00224000
*                         OCREDRVE=OFF;/* AND RESET REDRIVE SWITCH   */ 00225000
         NI    OCREDRVE(ROPCE),B'11101111'                      05S0429 00226000
*                       END;                                    05S0430 00227000
*                   END;                                        05S0431 00228000
*               END;                                            04S0432 00229000
*             ELSE                  /* UNSUCCESSFUL SET CTL. VECTOR  */ 00230000
*               DO;                                             04S0433 00231000
         B     @RC00385                                         04S0433 00232000
@RF00385 DS    0H                                               04S0434 00233000
*                 OCPTRSAV->OCPARM=IPLRQMSG;/* SET IPL REQ'ED AS        00234000
*                                      COMP. CODE                    */ 00235000
         L     @11,OCPTRSAV(,ROPCE)                             04S0434 00236000
         MVC   OCPARM(2,@11),@CH01665                           04S0434 00237000
*                 CALL CLNUPNCP;    /* CLEANUP F ACT=NCP             */ 00238000
         BAL   @14,CLNUPNCP                                     04S0435 00239000
*                 CALL TERMPROC;    /* TERMINATE PROCESSING          */ 00240000
         BAL   @14,TERMPROC                                     04S0436 00241000
*                 OUTFLAG=ON;       /* SET TO BYPASS ACTLINK         */ 00242000
         OI    OUTFLAG,B'01000000'                              04S0437 00243000
*               END;                                            04S0438 00244000
*           END;                                                03S0439 00245000
*       ELSE                        /* ELSE PROCESS ACTPU RESPONSE   */ 00246000
*         DO;                                                   03S0440 00247000
         B     @RC00381                                         03S0440 00248000
@RF00381 DS    0H                                               03S0441 00249000
*                                                               04S0441 00250000
*           /*********************************************************/ 00251000
*           /*                                                       */ 00252000
*           /* ACTPU(NCP) RESPONSE PROCESSOR. IF OPCE INDICATES THAT */ 00253000
*           /* NCP IS ACTIVE OR WAS ALREADY ACTIVE, THE ATTACHED RU  */ 00254000
*           /* IS FREED, THE OPCE IS REFORMATTED INTO A SET CTL.     */ 00255000
*           /* VECTOR OPCE, AND SET TO XCTL TO SSCP. IF BAD RESPONSE,*/ 00256000
*           /* SET COMPLETION CODE AND CALL ROUTINES TO CLEAN UP NCP */ 00257000
*           /* ACTIVATION AND TERMINATE PROCESSING                   */ 00258000
*           /*                                                       */ 00259000
*           /*********************************************************/ 00260000
*                                                               04S0441 00261000
*           IF OCPARM>0 THEN        /* IF NCP ACTIVATED OR ALREADY      00262000
*                                      ACTIVE                        */ 00263000
         ICM   @11,3,OCPARM(ROPCE)                              04S0441 00264000
         BNP   @RF00441                                         04S0441 00265000
*             DO;                   /* FREE RU AND REFORMAT INTO SET    00266000
*                                      CONTROL VECTOR OPCE           */ 00267000
*               RPARM=OCUNIT;       /* FREE ATTACHED ....            */ 00268000
         L     RPARM,OCUNIT(,ROPCE)                             04S0443 00269000
*               CALL FREEBUF;       /* .... RU                       */ 00270000
         L     @15,OPCFREBF(,ROPCAVT)                           04S0444 00271000
         BALR  @14,@15                                          04S0444 00272000
*               OCUNIT=PRUINTIC;    /* SET INVALID TIC       @YM05695*/ 00273000
         MVC   OCUNIT(4,ROPCE),@CF01412                         04S0445 00274000
*               OCSWITCH=OCSETTD;   /* INDICATES SET CTL. VECTOR        00275000
*                                      (TIME/ DATE)                  */ 00276000
         MVI   OCSWITCH(ROPCE),X'E0'                            04S0446 00277000
*               OCWTG=THISMOD;      /* SET TO RETURN TO 'FJ' FROM       00278000
*                                      SSCP                          */ 00279000
         MVC   OCWTG(2,ROPCE),THISMOD                           04S0447 00280000
*               OCRESP=OFF;         /* SET OFF OCRESP                */ 00281000
         NI    OCRESP(ROPCE),B'11111110'                        04S0448 00282000
*               OPCMODID=SSCPMOD;   /* SET TO XCTL TO SSCP           */ 00283000
         MVC   OPCMODID(2,ROPCAVT),SSCPMOD                      04S0449 00284000
*             END;                                              04S0450 00285000
*           ELSE                                                04S0451 00286000
*             DO;                   /* DO ACTPU(NCP) ERROR PROCESSING*/ 00287000
         B     @RC00441                                         04S0451 00288000
@RF00441 DS    0H                                               04S0452 00289000
*               IF OCPARM=OCRCBNEG|OCPARM=OCRCBPOS THEN/* IF IPL        00290000
*                                      REQUIRED                      */ 00291000
         LH    @11,OCPARM(,ROPCE)                               04S0452 00292000
         CH    @11,@CH01067                                     04S0452 00293000
         BE    @RT00452                                         04S0452 00294000
         CH    @11,@CH01071                                     04S0452 00295000
         BNE   @RF00452                                         04S0452 00296000
@RT00452 DS    0H                                               04S0453 00297000
*                 OCPTRSAV->OCPARM=IPLRQMSG;/* SET COMPLETION CODE IN   00298000
*                                      ORIG. OPCE                    */ 00299000
         L     @11,OCPTRSAV(,ROPCE)                             04S0453 00300000
         MVC   OCPARM(2,@11),@CH01665                           04S0453 00301000
*               ELSE                                            04S0454 00302000
*                 IF OCPARM=OCRCBSIB THEN/* IF SIB SHORTAGE          */ 00303000
         B     @RC00452                                         04S0454 00304000
@RF00452 CLC   OCPARM(2,ROPCE),@CH01069                         04S0454 00305000
         BNE   @RF00454                                         04S0454 00306000
*                   OCPTRSAV->OCPARM=SIBSGMSG;/* SET COMP. CODE IN      00307000
*                                      ORIG. OPCE                    */ 00308000
         L     @11,OCPTRSAV(,ROPCE)                             04S0455 00309000
         MVC   OCPARM(2,@11),@CH01667                           04S0455 00310000
*                 ELSE                                          04S0456 00311000
*                   DO;                                         04S0456 00312000
         B     @RC00454                                         04S0456 00313000
@RF00454 DS    0H                                               04S0457 00314000
*                     RPARM=OCPTRSAV-LENGTH(IEDQOPCN);/* POINT TO       00315000
*                                      NEG. PREFIX OF ORIG.          */ 00316000
         L     @11,OCPTRSAV(,ROPCE)                             04S0457 00317000
         LR    RPARM,@11                                        04S0457 00318000
         SH    RPARM,@CH00047                                   04S0457 00319000
*                     RPARM->OCLDNME=OCBACKUP;/* PLACE LOAD MOD. NAME   00320000
*                                      IN PREFIX                     */ 00321000
         MVC   OCLDNME(8,RPARM),OCBACKUP(ROPCE)                 04S0458 00322000
*                     OCPTRSAV->OCPARM=LDMODMSG;/* SET COMP. CODE IN    00323000
*                                      ORIG OPCE FOR LOAD MODULE NAME   00324000
*                                      MISMATCH                      */ 00325000
         MVC   OCPARM(2,@11),@CH01669                           04S0459 00326000
*                   END;                                        04S0460 00327000
*               CALL CLNUPNCP;      /* CLEAN UP F ACT=NCP            */ 00328000
@RC00454 DS    0H                                               04S0461 00329000
@RC00452 BAL   @14,CLNUPNCP                                     04S0461 00330000
*               CALL TERMPROC;      /* TERMINATE PROCESSING          */ 00331000
         BAL   @14,TERMPROC                                     04S0462 00332000
*             END;                                              04S0463 00333000
*           OUTFLAG=ON;             /* SET TO BYPASS ACTLINK         */ 00334000
@RC00441 OI    OUTFLAG,B'01000000'                              04S0464 00335000
*         END;                                                  03S0465 00336000
*       IF OUTFLAG=OFF THEN         /* IF FLAG NOT SET THEN          */ 00337000
@RC00381 TM    OUTFLAG,B'01000000'                              03S0466 00338000
         BNZ   @RF00466                                         03S0466 00339000
*         DO;                                                   03S0467 00340000
*                                                               04S0468 00341000
*           /*********************************************************/ 00342000
*           /*                                                       */ 00343000
*           /* ACTLINK: THIS SEGMENT CHECKS TO SEE IF RESTART        */ 00344000
*           /* PROCESSING IS NECESSARY AND IF SO CONTROL IS PASSED TO*/ 00345000
*           /* IGCFF10D TO SEND RESTART INFO TO THE NCP. IGCFF10D    */ 00346000
*           /* RETURNS TO THIS MODULE TO HAVE THE ACTLINK PROCESSING */ 00347000
*           /* PERFORMED(OCSWITCH=0). MODULES IGCFL-FQ10D RETURN TO  */ 00348000
*           /* THIS MODULE ALSO TO HAVE THE ACTLINK PROCESSING       */ 00349000
*           /* PERFORMED                                             */ 00350000
*           /*                                                       */ 00351000
*           /*********************************************************/ 00352000
*                                                               04S0468 00353000
*           IF OCSWITCH^=0 THEN     /* IF NOT RETURN FROM FF THEN SEE   00354000
*                                      IF RESTART                    */ 00355000
         CLI   OCSWITCH(ROPCE),0                                04S0468 00356000
         BE    @RF00468                                         04S0468 00357000
*             DO;                   /* NECESSARY                     */ 00358000
*               RPARM=OCPTRSAV->OCTRMTBL;/* SET UP NCP TTCIN IN RPARM*/ 00359000
         L     @11,OCPTRSAV(,ROPCE)                             04S0470 00360000
         SLR   @09,@09                                          04S0470 00361000
         ICM   @09,3,OCTRMTBL(@11)                              04S0470 00362000
         LR    RPARM,@09                                        04S0470 00363000
*               OCTRMTBL=OCPTRSAV->OCTRMTBL;/* AND IN OCTRMTBL  04S0471 00364000
*                                                            @YM05695*/ 00365000
         STH   @09,OCTRMTBL(,ROPCE)                             04S0471 00366000
*               CALL NCPDVCDP;      /* OBTAIN ADDR. OF NCP DEVICE       00367000
*                                      DEPENDENT FIELDS              */ 00368000
         BAL   @14,NCPDVCDP                                     04S0472 00369000
*               IF NCPCKPT^=0 THEN  /* IF POINTER TO CK.PT. D.S.        00370000
*                                      EXITS                         */ 00371000
         SLR   @11,@11                                          04S0473 00372000
         L     @09,NCPCKPT(,RTNCODE)                            04S0473 00373000
         CLR   @09,@11                                          04S0473 00374000
         BE    @RF00473                                         04S0473 00375000
*                 IF DCBOFOPN=ON&DCBIOBAD^=0&NCPREST=ON THEN/* IF       00376000
*                                      OPEN & RESTART                */ 00377000
         TM    DCBOFOPN+40(@09),B'00010000'                     04S0474 00378000
         BNO   @RF00474                                         04S0474 00379000
         C     @11,DCBIOBAD+20(,@09)                            04S0474 00380000
         BE    @RF00474                                         04S0474 00381000
         TM    NCPREST(RTNCODE),B'00010000'                     04S0474 00382000
         BNO   @RF00474                                         04S0474 00383000
*                   DO;                                         04S0475 00384000
*                     FINIFLAG=ON;  /* SET ON FINIFLAG               */ 00385000
         OI    FINIFLAG,B'10000000'                             04S0476 00386000
*                     OPCMODID=ADCKPMOD;/* SET TO XCTL TO A/D CK. PT.   00387000
*                                      MOD.                          */ 00388000
         MVC   OPCMODID(2,ROPCAVT),ADCKPMOD                     04S0477 00389000
*                   END;                                        04S0478 00390000
*                 ELSE                                          04S0479 00391000
*                   ;                                           04S0479 00392000
@RF00474 DS    0H                                               04S0480 00393000
*               ELSE                                            04S0480 00394000
*                 ;                                             04S0480 00395000
@RF00473 DS    0H                                               04S0481 00396000
*             END;                                              04S0481 00397000
*           ELSE                                                04S0482 00398000
*             ;                                                 04S0482 00399000
@RF00468 DS    0H                                               04S0483 00400000
*           IF FINIFLAG=OFF THEN    /* PERFORM ACTLINK PROCESSING    */ 00401000
         TM    FINIFLAG,B'10000000'                             04S0483 00402000
         BNZ   @RF00483                                         04S0483 00403000
*             DO;                                               04S0484 00404000
*                                                               05S0485 00405000
*               /*****************************************************/ 00406000
*               /*                                                   */ 00407000
*               /* THIS SEGMENT CHECKS TO SEE IF THE ORIG CMND. WAS  */ 00408000
*               /* AN F ACT=NCP,IDLE. IF IT WAS PROCESSING IS        */ 00409000
*               /* TERMINATED AND A GOOD COMPLETION CODE IS GIVEN. IF*/ 00410000
*               /* NOT, THE NUMBER OF LINES TO ACTIVATE IS           */ 00411000
*               /* DETERMINED. IF NO LINES ARE TO BE ACTIVATED,      */ 00412000
*               /* PROCESSING IS THE SAME AS IF IDLE. OTHERWISE, THE */ 00413000
*               /* ATTACHED RU IS FREED AND ACTIVATE LINES PROCESSING*/ 00414000
*               /* IS STARTED.                                       */ 00415000
*               /*                                                   */ 00416000
*               /*****************************************************/ 00417000
*                                                               05S0485 00418000
*               RPARM=OCPTRSAV-LENGTH(IEDQOPCN);/* POINT TO NEG.        00419000
*                                      PREFIX OF ORIG.               */ 00420000
         L     @11,OCPTRSAV(,ROPCE)                             05S0485 00421000
         LR    RPARM,@11                                        05S0485 00422000
         SH    RPARM,@CH00047                                   05S0485 00423000
*               IF RPARM->OCIDLE=ON THEN/* IF IDLE FLAG ON IN ORIG.  */ 00424000
         TM    OCIDLE(RPARM),B'00000001'                        05S0486 00425000
         BNO   @RF00486                                         05S0486 00426000
*                 DO;                                           05S0487 00427000
*                   OCPTRSAV->OCPARM=GOODMSG;/* SET GOOD COMP. CODE  */ 00428000
         MVC   OCPARM(2,@11),@CH01663                           05S0488 00429000
*                   OPCCOPCE=OCPTRSAV;/* MAKE ORIG. OPCE THE CURRENT    00430000
*                                      OPCE                          */ 00431000
         ST    @11,OPCCOPCE(,ROPCAVT)                           05S0489 00432000
*                   CALL TERMPROC;  /* TERMINATE PROCESSING          */ 00433000
         BAL   @14,TERMPROC                                     05S0490 00434000
*                 END;                                          05S0491 00435000
*               ELSE                                            05S0492 00436000
*                 DO;               /* NOT IDLE                      */ 00437000
         B     @RC00486                                         05S0492 00438000
@RF00486 DS    0H                                               05S0493 00439000
*                   IF TIC=VALTIC THEN/* IF UNIT ATTACHED            */ 00440000
         TM    TIC(ROPCE),B'00000011'                           05S0493 00441000
         BNZ   @RF00493                                         05S0493 00442000
*                     DO;                                       05S0494 00443000
*                       RPARM=OCUNIT;/* POINT TO ATTACHED RU         */ 00444000
         L     RPARM,OCUNIT(,ROPCE)                             05S0495 00445000
*                       CALL FREEBUF;/* FREE THE RU                  */ 00446000
         L     @15,OPCFREBF(,ROPCAVT)                           05S0496 00447000
         BALR  @14,@15                                          05S0496 00448000
*                       OCUNIT=PRUINTIC;/* AND SET INVALID TIC       */ 00449000
         MVC   OCUNIT(4,ROPCE),@CF01412                         05S0497 00450000
*                     END;                                      05S0498 00451000
*                   ELSE                                        05S0499 00452000
*                     ;                                         05S0499 00453000
@RF00493 DS    0H                                               05S0500 00454000
*                   ACTFLAG=5;      /* SET FLAG TO COUNT ACTLINKS TO    00455000
*                                      BE DONE                       */ 00456000
         MVC   ACTFLAG(4),@CF00165                              05S0500 00457000
*                   OCBUFNED=0;     /* INIT THE BUFS NEED AND THE    */ 00458000
         SLR   @11,@11                                          05S0501 00459000
         STH   @11,OCBUFNED(,ROPCE)                             05S0501 00460000
*                   OCBUFGOT=0;     /* BUFS HAVE FIELDS              */ 00461000
         STH   @11,OCBUFGOT(,ROPCE)                             05S0502 00462000
*                   CALL HIERLOOP;  /* GO GET COUNT                  */ 00463000
         BAL   @14,HIERLOOP                                     05S0503 00464000
*                   IF OCBUFNED^=0 THEN/* IF ANY ACTLINKS TO BE DONE */ 00465000
         ICM   @11,3,OCBUFNED(ROPCE)                            05S0504 00466000
         BZ    @RF00504                                         05S0504 00467000
*                     DO;                                       05S0505 00468000
*                       RPARM=OCPTRSAV-LENGTH(IEDQOPCN);/* BACK UP TO   00469000
*                                      NEG PREFIX                    */ 00470000
         L     RPARM,OCPTRSAV(,ROPCE)                           05S0506 00471000
         SH    RPARM,@CH00047                                   05S0506 00472000
*                       RPARM->OCRESPCT=OCBUFNED;/* SET OUTSTANDING     00473000
*                                      RESP COUNT                    */ 00474000
         MVC   OCRESPCT(2,RPARM),OCBUFNED(ROPCE)                05S0507 00475000
*                       CALL GETBUFS;/* GO GET BUFFER UNITS          */ 00476000
         BAL   @14,GETBUFS                                      05S0508 00477000
*                       IF OUTFLAG=OFF THEN/* IF COULD GET UNITS THEN*/ 00478000
         TM    OUTFLAG,B'01000000'                              05S0509 00479000
         BNZ   @RF00509                                         05S0509 00480000
*                         DO;                                   05S0510 00481000
*                           ACTFLAG=6;/* SET TO BUILD ACTLINKS AND      00482000
*                                      STARTLINES                    */ 00483000
         MVC   ACTFLAG(4),@CF00061                              05S0511 00484000
*                           CALL BLDER;/* GO BUILD OPCES             */ 00485000
         BAL   @14,BLDER                                        05S0512 00486000
*                         END;                                  05S0513 00487000
*                       ELSE                                    05S0514 00488000
*                         ;                                     05S0514 00489000
@RF00509 DS    0H                                               05S0515 00490000
*                     END;                                      05S0515 00491000
*                   ELSE                                        05S0516 00492000
*                     DO;           /* NO LINES TO ACTIVATE          */ 00493000
         B     @RC00504                                         05S0516 00494000
@RF00504 DS    0H                                               05S0517 00495000
*                       OCPTRSAV->OCPARM=GOODMSG;/* SET GOOD COMP.      00496000
*                                      CODE                          */ 00497000
         L     @11,OCPTRSAV(,ROPCE)                             05S0517 00498000
         MVC   OCPARM(2,@11),@CH01663                           05S0517 00499000
*                       OPCCOPCE=OCPTRSAV;/* MAKE ORIG. OPCE THE        00500000
*                                      CURRENT OPCE                  */ 00501000
         ST    @11,OPCCOPCE(,ROPCAVT)                           05S0518 00502000
*                       CALL TERMPROC;/* TERMINATE PROCESSING        */ 00503000
         BAL   @14,TERMPROC                                     05S0519 00504000
*                     END;                                      05S0520 00505000
*                 END;                                          05S0521 00506000
*             END;                                              04S0522 00507000
*           ELSE                                                04S0523 00508000
*             ;                                                 04S0523 00509000
@RF00483 DS    0H                                               04S0524 00510000
*         END;                                                  03S0524 00511000
*       ELSE                                                    03S0525 00512000
*         ;                                                     03S0525 00513000
@RF00466 DS    0H                                               03S0526 00514000
*     END;                                                      03S0526 00515000
*   ELSE                                                        03S0527 00516000
*     IF OCSWITCH=OCDACTLK THEN     /* IF DACTLINK REDRIVE THEN      */ 00517000
         B     @RC00379                                         03S0527 00518000
@RF00379 CLI   OCSWITCH(ROPCE),X'60'                            03S0527 00519000
         BNE   @RF00527                                         03S0527 00520000
*       DO;                                                     03S0528 00521000
*                                                               04S0529 00522000
*         /***********************************************************/ 00523000
*         /*                                                         */ 00524000
*         /* DACTLKRD: THIS SEGMENT PROCESSES DACTLINK REDRIVE OPCES */ 00525000
*         /* TO CONTINUE THE DACTLINK PROCESS                        */ 00526000
*         /*                                                         */ 00527000
*         /***********************************************************/ 00528000
*                                                               04S0529 00529000
*         RPARM=OCPTRSAV-LENGTH(IEDQOPCN);/* BACK UP TO NEG PREF OF     00530000
*                                      OPCE                          */ 00531000
         L     RPARM,OCPTRSAV(,ROPCE)                           04S0529 00532000
         SH    RPARM,@CH00047                                   04S0529 00533000
*         IF RPARM->OCIDLE=ON THEN  /* IF ORIG OPCE IS 'IDLE'        */ 00534000
         TM    OCIDLE(RPARM),B'00000001'                        04S0530 00535000
         BNO   @RF00530                                         04S0530 00536000
*           ACTFLAG=2;              /* SET CONTROL AS SAME           */ 00537000
         MVC   ACTFLAG(4),@CF00067                              04S0531 00538000
*         ELSE                                                  04S0532 00539000
*           ACTFLAG=4;              /* ELSE SET TO NORMAL DEACT      */ 00540000
         B     @RC00530                                         04S0532 00541000
@RF00530 MVC   ACTFLAG(4),@CF00257                              04S0532 00542000
*         CALL BLDER;               /* AND BUILD DEACTS              */ 00543000
@RC00530 BAL   @14,BLDER                                        04S0533 00544000
*       END;                                                    03S0534 00545000
*     ELSE                          /* ELSE IS ACTLINK REDRIVE SO    */ 00546000
*       DO;                                                     03S0535 00547000
         B     @RC00527                                         03S0535 00548000
@RF00527 DS    0H                                               03S0536 00549000
*                                                               04S0536 00550000
*         /***********************************************************/ 00551000
*         /*                                                         */ 00552000
*         /* ACTLNKRD: THIS SEGMENT PROCESSES ACTLINK REDRIVE OPCES  */ 00553000
*         /*                                                         */ 00554000
*         /***********************************************************/ 00555000
*                                                               04S0536 00556000
*         ACTFLAG=6;                /* SET ACTFLAG TO BUILD ACTLKS      00557000
*                                      AND STARTLINES                */ 00558000
         MVC   ACTFLAG(4),@CF00061                              04S0536 00559000
*         CALL BLDER;               /* AND BUILD THEM                */ 00560000
         BAL   @14,BLDER                                        04S0537 00561000
*       END;                                                    03S0538 00562000
*                                                               02S0539 00563000
*   /*****************************************************************/ 00564000
*   /*                                                               */ 00565000
*   /* EPILOGUE: THIS SEGMENT COMPLETES THE EPILOGUE CODE THAT WAS   */ 00566000
*   /* ALTERED BY THE MODULE PROCEDURE STATEMENT. THE XCTL SYSTEM    */ 00567000
*   /* MACRO INSTRUCTION IS USED BY THIS SEGMENT TO TRANSFER CONTROL */ 00568000
*   /* TO THE NEXT MODULE THAT IS TO BE EXECUTED.                    */ 00569000
*   /*                                                               */ 00570000
*   /*****************************************************************/ 00571000
*                                                               02S0539 00572000
*   IF OPCMODID=TO00 THEN           /* SET REG 0 IF TO GO TO IGC0010D*/ 00573000
@RC00527 DS    0H                                               02S0539 00574000
@RC00379 CLC   OPCMODID(2,ROPCAVT),TO00                         02S0539 00575000
         BNE   @RF00539                                         02S0539 00576000
*     REG00=0;                                                  02S0540 00577000
         SLR   REG00,REG00                                      02S0540 00578000
*   ELSE                                                        02S0541 00579000
*     ;                                                         02S0541 00580000
@RF00539 DS    0H                                               02S0542 00581000
*   RFY                                                         02S0542 00582000
*     REG01 RSTD;                   /* RESTRICT THE ARGUMENT REGISTER   00583000
*                                      TO BE USED TO CONTAIN THE        00584000
*                                      POINTER TO THE OPERATOR  02S0542 00585000
*                                      CONTROL ADDRESS VECTOR TABLE     00586000
*                                      FROM USE BY THE COMPILER      */ 00587000
*   REG01=ROPCAVT;                  /* SET THE ARGUMENT REGISTER IN     00588000
*                                      PREPARATION TO TRANSFERRING      00589000
*                                      CONTROL TO THE NEXT MODULE    */ 00590000
         LR    REG01,ROPCAVT                                    02S0543 00591000
*   GEN EXIT REFS(OPCXCTL,ROPCAVT) NOSEQFLOW SETS(REG15);       02S0544 00592000
*                                   /*                                  00593000
         XCTL  SF=(E,OPCXCTL(ROPCAVT)) TRANSFER CONTROL MACRO           00594000
*                                                               02S0545 00595000
*   /*****************************************************************/ 00596000
*   /*                                                               */ 00597000
*   /* HIERLOOP: THIS PROC PERFORMS THE LOOPING THROUGH THE LINE     */ 00598000
*   /* HIERARCHY AND DOES THE ACTION REQUIRED BY THE ACTION CONTROL  */ 00599000
*   /* FLAG.                                                         */ 00600000
*   /*                                                               */ 00601000
*   /*****************************************************************/ 00602000
*                                                               02S0545 00603000
*HIERLOOP:                                                      02S0545 00604000
*   PROC OPTIONS(RETREG,SAVE(14));                              02S0545 00605000
HIERLOOP ST    @14,@SA00002                                     02S0545 00606000
*   RPARM=OCTRMTBL;                 /* SET TTCIN FOR CALL            */ 00607000
         SLR   RPARM,RPARM                                      02S0546 00608000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          02S0546 00609000
*   CALL IEDQTNT;                   /* GET TTE ADDR                  */ 00610000
         L     @15,AVTRNMPT(,RAVT)                              02S0547 00611000
         BALR  @14,@15                                          02S0547 00612000
*   RTRM=RPARM;                     /* SET TTE BASE REG              */ 00613000
         LR    RTRM,RPARM                                       02S0548 00614000
*   IF TRMTYPE=TRMLNCP THEN         /* IF THIS IS THE NCP            */ 00615000
         LR    @11,RTRM                                         02S0549 00616000
         SH    @11,@CH01700                                     02S0549 00617000
         CLI   TRMTYPE(@11),X'0F'                               02S0549 00618000
         BNE   @RF00549                                         02S0549 00619000
*     DO;                           /* THEN MUST FIND SUBSTRUCT TTE     00620000
*                                      ADDR                          */ 00621000
*       RPARM=TRMSUBST;             /* SET TTCIN FOR CALL            */ 00622000
         SLR   @09,@09                                          02S0551 00623000
         ICM   @09,3,TRMSUBST(@11)                              02S0551 00624000
         LR    RPARM,@09                                        02S0551 00625000
*       OCTRMTBL=TRMSUBST;          /* AND SET UP IN OPCE    @YM05695*/ 00626000
         STH   @09,OCTRMTBL(,ROPCE)                             02S0552 00627000
*       CALL IEDQTNT;               /* GET TTE ADDR                  */ 00628000
         L     @15,AVTRNMPT(,RAVT)                              02S0553 00629000
         BALR  @14,@15                                          02S0553 00630000
*       RTRM=RPARM;                 /* SET TTE BASE                  */ 00631000
         LR    RTRM,RPARM                                       02S0554 00632000
*     END;                                                      02S0555 00633000
*   ELSE                                                        02S0556 00634000
*     ;                                                         02S0556 00635000
@RF00549 DS    0H                                               02S0557 00636000
*   DO WHILE(TRMTYPE^=TRMLNCP)&(OUTFLAG=OFF);/* LOOP TILL HIT NCP OR    00637000
*                                      UNTIL ACTION RUNS OUT OF BUF     00638000
*                                      UNITS                         */ 00639000
         B     @DE00557                                         02S0557 00640000
@DL00557 DS    0H                                               02S0558 00641000
*                                                               03S0558 00642000
*     /***************************************************************/ 00643000
*     /*                                                             */ 00644000
*     /* HIERLOOP.ACTION: THIS SEGMENT PERFORMS THE ACTION INDICATED */ 00645000
*     /* BY THE ACTFLAG CONTROL INDICATOR. THE AVAILABEL ACTIONS ARE:*/ 00646000
*     /* 1=COUNT ALL LINES 2=BUILD DEACTS FOR ALL LINKS 3=COUNT ALL  */ 00647000
*     /* PRESNA LINKS AND ALL SNA LINKS WITH TRMREMB OFF. 4= BUILD   */ 00648000
*     /* DEACT LINKS FOR THOSE LINES COUNTED BY 3. 5=COUNT ALL LINES */ 00649000
*     /* WITH TRMREMB ON. 6=BUILD ACTLINKS AND STARTLINES FOR ALL    */ 00650000
*     /* LINES WITH TRMREMB ON                                       */ 00651000
*     /*                                                             */ 00652000
*     /***************************************************************/ 00653000
*                                                               03S0558 00654000
*     IF ACTFLAG>2 THEN             /* IF NOT IDLE                   */ 00655000
         L     @11,ACTFLAG                                      03S0558 00656000
         CH    @11,@CH00067                                     03S0558 00657000
         BNH   @RF00558                                         03S0558 00658000
*       IF ACTFLAG>4 THEN           /* AND NOT DEACT                 */ 00659000
         CH    @11,@CH00257                                     03S0559 00660000
         BNH   @RF00559                                         03S0559 00661000
*         IF TRMREMB=ON THEN        /* AND REMEMBER BIT IS ON        */ 00662000
         LR    @09,RTRM                                         03S0560 00663000
         AL    @09,@CF01732                                     03S0560 00664000
         TM    TRMREMB-2(@09),B'01000000'                       03S0560 00665000
         BNO   @RF00560                                         03S0560 00666000
*           IF ACTFLAG=5 THEN       /* AND COUNTING                  */ 00667000
         CH    @11,@CH00165                                     03S0561 00668000
         BNE   @RF00561                                         03S0561 00669000
*             OCBUFNED=OCBUFNED+1;  /* THEN ADD 1 TO COUNT           */ 00670000
         LA    @11,1                                            03S0562 00671000
         SLR   @09,@09                                          03S0562 00672000
         ICM   @09,3,OCBUFNED(ROPCE)                            03S0562 00673000
         ALR   @11,@09                                          03S0562 00674000
         STH   @11,OCBUFNED(,ROPCE)                             03S0562 00675000
*           ELSE                    /* ELSE BUILD ACTS AND STARTLINES*/ 00676000
*             CALL BLDOPCE;                                     03S0563 00677000
         B     @RC00561                                         03S0563 00678000
@RF00561 BAL   @14,BLDOPCE                                      03S0563 00679000
*         ELSE                                                  03S0564 00680000
*           ;                                                   03S0564 00681000
@RF00560 DS    0H                                               03S0565 00682000
*       ELSE                        /* IF REMB BIT IS OFF AND DOING     00683000
*                                      DEACTS                        */ 00684000
*         IF(TRMREMB=ON)&(TRMTYPE=TRMSDLC) THEN                 03S0565 00685000
         B     @RC00559                                         03S0565 00686000
@RF00559 LR    @11,RTRM                                         03S0565 00687000
         SH    @11,@CH01700                                     03S0565 00688000
         TM    TRMREMB(@11),B'01000000'                         03S0565 00689000
         BNO   @RF00565                                         03S0565 00690000
         CLI   TRMTYPE(@11),X'21'                               03S0565 00691000
         BE    @RT00565                                         03S0565 00692000
*           ;                                                   03S0566 00693000
*         ELSE                      /* SEE IF COUNTING OR BUILDING      00694000
*                                      OPCES                         */ 00695000
*           IF ACTFLAG=3 THEN       /* ADD TO COUNT IF COUNTING      */ 00696000
@RF00565 CLC   ACTFLAG(4),@CF00076                              03S0567 00697000
         BNE   @RF00567                                         03S0567 00698000
*             OCBUFNED=OCBUFNED+1;                              03S0568 00699000
         LA    @11,1                                            03S0568 00700000
         SLR   @09,@09                                          03S0568 00701000
         ICM   @09,3,OCBUFNED(ROPCE)                            03S0568 00702000
         ALR   @11,@09                                          03S0568 00703000
         STH   @11,OCBUFNED(,ROPCE)                             03S0568 00704000
*           ELSE                                                03S0569 00705000
*             CALL BLDOPCE;         /* ELSE BUILD OPCE               */ 00706000
         B     @RC00567                                         03S0569 00707000
@RF00567 BAL   @14,BLDOPCE                                      03S0569 00708000
*     ELSE                          /* IF DOING DEACTS FOR ACT IDLE  */ 00709000
*       IF ACTFLAG=1 THEN           /* BUMP COUNT IF COUNTING        */ 00710000
         B     @RC00558                                         03S0570 00711000
@RF00558 LA    @11,1                                            03S0570 00712000
         C     @11,ACTFLAG                                      03S0570 00713000
         BNE   @RF00570                                         03S0570 00714000
*         OCBUFNED=OCBUFNED+1;                                  03S0571 00715000
         SLR   @09,@09                                          03S0571 00716000
         ICM   @09,3,OCBUFNED(ROPCE)                            03S0571 00717000
         ALR   @11,@09                                          03S0571 00718000
         STH   @11,OCBUFNED(,ROPCE)                             03S0571 00719000
*       ELSE                                                    03S0572 00720000
*         CALL BLDOPCE;             /* ELSE BUILD DEACTS             */ 00721000
         B     @RC00570                                         03S0572 00722000
@RF00570 BAL   @14,BLDOPCE                                      03S0572 00723000
*     RPARM=TRMCOHRT;               /* SET TO FOLLOW HIERARCHY CHAIN */ 00724000
@RC00570 DS    0H                                               02S0573 00725000
@RC00558 LR    @11,RTRM                                         02S0573 00726000
         AL    @11,@CF01733                                     02S0573 00727000
         SLR   @09,@09                                          02S0573 00728000
         ICM   @09,3,TRMCOHRT-4(@11)                            02S0573 00729000
         LR    RPARM,@09                                        02S0573 00730000
*     OCTRMTBL=TRMCOHRT;            /* SAVE ALSO IN OPCE             */ 00731000
         STH   @09,OCTRMTBL(,ROPCE)                             02S0574 00732000
*     CALL IEDQTNT;                 /* GET TTE ADDR                  */ 00733000
         L     @15,AVTRNMPT(,RAVT)                              02S0575 00734000
         BALR  @14,@15                                          02S0575 00735000
*     RTRM=RPARM;                   /* SET NEW TTE BASE              */ 00736000
         LR    RTRM,RPARM                                       02S0576 00737000
*   END;                                                        02S0577 00738000
@DE00557 LR    @11,RTRM                                         02S0577 00739000
         AL    @11,@CF01071                                     02S0577 00740000
         CLI   TRMTYPE-11(@11),X'0F'                            02S0577 00741000
         BE    @DC00557                                         02S0577 00742000
         TM    OUTFLAG,B'01000000'                              02S0577 00743000
         BZ    @DL00557                                         02S0577 00744000
@DC00557 DS    0H                                               02S0578 00745000
*   END HIERLOOP;                                               02S0578 00746000
@EL00002 DS    0H                                               02S0578 00747000
@EF00002 DS    0H                                               02S0578 00748000
@ER00002 L     @14,@SA00002                                     02S0578 00749000
         BR    @14                                              02S0578 00750000
*                                                               02S0579 00751000
*   /*****************************************************************/ 00752000
*   /*                                                               */ 00753000
*   /* BLDOPCE: THIS PROC BUILDS OPCES FOR DEACT LINKS, ACT LINKS,   */ 00754000
*   /* AND STARTLINE REQUESTS. THEY ARE PUT ON THE SVC102 LIST. IF   */ 00755000
*   /* USE THE LAST BUFFER THEN NEED MORE THEN THE OUT FLAG IS SET ON*/ 00756000
*   /* TO EXIT THE OUTER LOOP AND SET UP FOR REDRIVE                 */ 00757000
*   /*                                                               */ 00758000
*   /*****************************************************************/ 00759000
*                                                               02S0579 00760000
*BLDOPCE:                                                       02S0579 00761000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0579 00762000
BLDOPCE  DS    0H                                               02S0580 00763000
*   RFY                                                         02S0580 00764000
*     REG14 RSTD;                   /* RESTRICT REG                  */ 00765000
*   BLDOSAV=REG14;                  /* SAVE RETURN ADDR              */ 00766000
         ST    REG14,BLDOSAV                                    02S0581 00767000
*   RFY                                                         02S0582 00768000
*     REG14 UNRSTD;                 /* FREE REG FOR USE              */ 00769000
*   RFY                                                         02S0583 00770000
*     REG09 RSTD;                   /* RESTRICT REG                  */ 00771000
*   REG09=OCUNIT;                   /* GET PTR TO ATTACHED UNIT      */ 00772000
         L     REG09,OCUNIT(,ROPCE)                             02S0584 00773000
*   OCUNIT=REG09->OCUNIT;           /* DELINK UNIT                   */ 00774000
         MVC   OCUNIT(4,ROPCE),OCUNIT(REG09)                    02S0585 00775000
*   RFY                                                         02S0586 00776000
*     IEDQOPCE BASED(REG09);        /* RESET OPCE BASE               */ 00777000
*   OCUNIT=PRUINTIC;                /* SET UP INVALID TIC            */ 00778000
         MVC   OCUNIT(4,REG09),@CF01412                         02S0587 00779000
*   OCTRMTBL=ROPCE->OCTRMTBL;       /* SET UP TTCIN                  */ 00780000
         MVC   OCTRMTBL(2,REG09),OCTRMTBL(ROPCE)                02S0588 00781000
*   OCPARM=0;                       /* CLEAR OCPARM                  */ 00782000
         SLR   @11,@11                                          02S0589 00783000
         STH   @11,OCPARM(,REG09)                               02S0589 00784000
*   OCALSTAT=0;                     /* CLEAR OCALSTAT                */ 00785000
         MVI   OCALSTAT(REG09),X'00'                            02S0590 00786000
*   OCRESP=OFF;                     /* TURN OFF OCRESP               */ 00787000
         NI    OCRESP(REG09),B'11111110'                        02S0591 00788000
*   OCACTREQ=ON;                    /* SET ACT/DEACT REQUEST         */ 00789000
         OI    OCACTREQ(REG09),B'00001000'                      02S0592 00790000
*   OCLINK=ADDR(AVTOPCOB);          /* SET QCB PTR                   */ 00791000
         LA    @11,AVTOPCOB(,RAVT)                              02S0593 00792000
         ST    @11,OCLINK(,REG09)                               02S0593 00793000
*   OCPTRSAV=ROPCE->OCPTRSAV;       /* SET UP PTR TO ORIG OPCE       */ 00794000
         MVC   OCPTRSAV(4,REG09),OCPTRSAV(ROPCE)                02S0594 00795000
*   IF(ACTFLAG=2)|(ACTFLAG=4) THEN  /* IF DOING DEACTS THEN          */ 00796000
         L     @11,ACTFLAG                                      02S0595 00797000
         CH    @11,@CH00067                                     02S0595 00798000
         BE    @RT00595                                         02S0595 00799000
         CH    @11,@CH00257                                     02S0595 00800000
         BNE   @RF00595                                         02S0595 00801000
@RT00595 DS    0H                                               02S0596 00802000
*     DO;                                                       02S0596 00803000
*       OCELMPRI=PRIHIFLG;          /* SET SSCP PRIORITY             */ 00804000
         MVI   OCELMPRI(REG09),X'E9'                            02S0597 00805000
*       OCPRIFLG=OPRA0;             /* SET SSCP FLAG                 */ 00806000
         MVI   OCPRIFLG(REG09),X'01'                            02S0598 00807000
*       OCSWITCH=OCDACTLK;          /* SET TO DACTLINK REQUEST       */ 00808000
         MVI   OCSWITCH(REG09),X'60'                            02S0599 00809000
*       OCWTG=NEXTMOD;              /* SET RESPONSE TO IGCFL10D      */ 00810000
         MVC   OCWTG(2,REG09),NEXTMOD                           02S0600 00811000
*     END;                                                      02S0601 00812000
*   ELSE                            /* ELSE IF DOING ACTIVATES       */ 00813000
*     IF TRMTYPE=TRMNSDLC THEN      /* AND IS PRE-SNA LINE           */ 00814000
         B     @RC00595                                         02S0602 00815000
@RF00595 LR    @11,RTRM                                         02S0602 00816000
         AL    @11,@CF01071                                     02S0602 00817000
         CLI   TRMTYPE-11(@11),X'20'                            02S0602 00818000
         BNE   @RF00602                                         02S0602 00819000
*       DO;                                                     02S0603 00820000
*         RPARM=RTRM;               /* SET FOR SUBROUTINE CALL  02S0604 00821000
*                                                            @YM05711*/ 00822000
         LR    RPARM,RTRM                                       02S0604 00823000
*         CALL CHORTGLK;            /* FIND GROUP TTE        @YM05711*/ 00824000
         L     @15,OPCHORTG(,ROPCAVT)                           02S0605 00825000
         BALR  @14,@15                                          02S0605 00826000
*         RPARM=REG00;              /* SET FOR SUBROUTINE CALL  02S0606 00827000
*                                                            @YM05711*/ 00828000
         LR    RPARM,REG00                                      02S0606 00829000
*         OCBACKUP='';              /* CLEAR OCBACKUP        @YM05711*/ 00830000
         MVI   OCBACKUP(REG09),C' '                             02S0607 00831000
         MVC   OCBACKUP+1(7,REG09),OCBACKUP(REG09)              02S0607 00832000
*         CALL TNTENTAD;            /* GET THE GROUP NAME FIELD ADDR    00833000
*                                                            @YM05711*/ 00834000
         L     @15,OPCTNTEA(,ROPCAVT)                           02S0608 00835000
         BALR  @14,@15                                          02S0608 00836000
*         OCBACKUP(1:TNTENLEN)=NAME(1:TNTENLEN);/* SET UP GROUPNAME     00837000
*                                                            @YM05711*/ 00838000
         L     @11,IEDQNPTR(,RAVT)                              02S0609 00839000
         SLR   @05,@05                                          02S0609 00840000
         IC    @05,TNTENLEN(,@11)                               02S0609 00841000
         BCTR  @05,0                                            02S0609 00842000
         EX    @05,@SM01734                                     02S0609 00843000
*         OCSWITCH=OCVARON;         /* SET STARTLINE CODE            */ 00844000
         MVI   OCSWITCH(REG09),X'D1'                            02S0610 00845000
*         OCELMPRI=PRIMEDFG;        /* SET PRIORITY                  */ 00846000
         MVI   OCELMPRI(REG09),X'DF'                            02S0611 00847000
*         OCPRIFLG=OPRVI2;          /* AND FLAG TO GO TO IGCVI10D    */ 00848000
         MVI   OCPRIFLG(REG09),X'10'                            02S0612 00849000
*         OCWTG=ALKRPMOD;           /* SET RESPONSE RETURN TO   02S0613 00850000
*                                      IGCFE10D                      */ 00851000
         MVC   OCWTG(2,REG09),ALKRPMOD                          02S0613 00852000
*       END;                                                    02S0614 00853000
*     ELSE                          /* ELSE IS SNA LINE SO BUILD        00854000
*                                      ACTLINK REQUEST               */ 00855000
*       DO;                                                     02S0615 00856000
         B     @RC00602                                         02S0615 00857000
@RF00602 DS    0H                                               02S0616 00858000
*         OCELMPRI=PRIHIFLG;        /* SET SSCP PRIORITY             */ 00859000
         MVI   OCELMPRI(REG09),X'E9'                            02S0616 00860000
*         OCPRIFLG=OPRA0;           /* AND FLAG                      */ 00861000
         MVI   OCPRIFLG(REG09),X'01'                            02S0617 00862000
*         OCSWITCH=OCACTLK;         /* SET ACTLINK CODE              */ 00863000
         MVI   OCSWITCH(REG09),X'50'                            02S0618 00864000
*         OCWTG=ALKRPMOD;           /* SET RESPONSE RETURN TO   02S0619 00865000
*                                      IGCFE10D                      */ 00866000
         MVC   OCWTG(2,REG09),ALKRPMOD                          02S0619 00867000
*       END;                                                    02S0620 00868000
*   IF OPCAQFST=0 THEN              /* IF LIST EMPTY                 */ 00869000
@RC00602 DS    0H                                               02S0621 00870000
@RC00595 ICM   @11,7,OPCAQFST(ROPCAVT)                          02S0621 00871000
         BNZ   @RF00621                                         02S0621 00872000
*     DO;                           /* THEN                          */ 00873000
*       OPCAQFST=REG09;             /* SET FIRST ELEMENT             */ 00874000
         STCM  REG09,7,OPCAQFST(ROPCAVT)                        02S0623 00875000
*       OPCAQSEC=REG09;             /* SET SECOND SAME               */ 00876000
         STCM  REG09,7,OPCAQSEC(ROPCAVT)                        02S0624 00877000
*     END;                                                      02S0625 00878000
*   ELSE                            /* ELSE IF LIST NOT EMPTY        */ 00879000
*     DO;                           /* THEN                          */ 00880000
         B     @RC00621                                         02S0626 00881000
@RF00621 DS    0H                                               02S0627 00882000
*       RFY                                                     02S0627 00883000
*         REG06 RSTD;               /* RESTRICT REG                  */ 00884000
*       REG06=OPCAQSEC;             /* SET LAST ELEMENT PTR          */ 00885000
         SLR   REG06,REG06                                      02S0628 00886000
         ICM   REG06,7,OPCAQSEC(ROPCAVT)                        02S0628 00887000
*       REG06->OCELMPTR=REG09;      /* SET LAST ELEM TO POINT TO THIS   00888000
*                                      ONE                           */ 00889000
         STCM  REG09,7,OCELMPTR(REG06)                          02S0629 00890000
*       OPCAQSEC=REG09;             /* SET LIST LAST ELEM PTR TO THIS   00891000
*                                      ONE                           */ 00892000
         STCM  REG09,7,OPCAQSEC(ROPCAVT)                        02S0630 00893000
*       RFY                                                     02S0631 00894000
*         REG06 UNRSTD;             /* RELEASE REG                   */ 00895000
*     END;                                                      02S0632 00896000
*   RFY                                                         02S0633 00897000
*     REG09 UNRSTD;                 /* RELEASE REG                   */ 00898000
@RC00621 DS    0H                                               02S0634 00899000
*   RFY                                                         02S0634 00900000
*     IEDQOPCE BASED(ROPCE);        /* RESET OPCE BASE               */ 00901000
*   OCBUFGOT=OCBUFGOT-1;            /* DECREMENT NO OF UNITS HAVE    */ 00902000
         SLR   @11,@11                                          02S0635 00903000
         ICM   @11,3,OCBUFGOT(ROPCE)                            02S0635 00904000
         BCTR  @11,0                                            02S0635 00905000
         STH   @11,OCBUFGOT(,ROPCE)                             02S0635 00906000
*   IF OCBUFGOT=0 THEN              /* IF RUN OUT OF UNITS           */ 00907000
         LTR   @11,@11                                          02S0636 00908000
         BNZ   @RF00636                                         02S0636 00909000
*     IF OCBUFNED>0 THEN            /* AND STILL NEED MORE           */ 00910000
         CLC   OCBUFNED(2,ROPCE),@CH00919                       02S0637 00911000
         BNH   @RF00637                                         02S0637 00912000
*       OUTFLAG=ON;                 /* SET TO GET OUT                */ 00913000
         OI    OUTFLAG,B'01000000'                              02S0638 00914000
*     ELSE                                                      02S0639 00915000
*       ;                                                       02S0639 00916000
@RF00637 DS    0H                                               02S0640 00917000
*   ELSE                                                        02S0640 00918000
*     ;                                                         02S0640 00919000
@RF00636 DS    0H                                               02S0641 00920000
*   RFY                                                         02S0641 00921000
*     REG14 RSTD;                   /* RESTRICT REG                  */ 00922000
*   REG14=BLDOSAV;                  /* RESET RETURN ADDR             */ 00923000
         L     REG14,BLDOSAV                                    02S0642 00924000
*   RFY                                                         02S0643 00925000
*     REG14 UNRSTD;                 /* RELEASE REG                   */ 00926000
*   END BLDOPCE;                                                02S0644 00927000
@EL00003 DS    0H                                               02S0644 00928000
@EF00003 DS    0H                                               02S0644 00929000
@ER00003 BR    @14                                              02S0644 00930000
*                                                               02S0645 00931000
*   /*****************************************************************/ 00932000
*   /*                                                               */ 00933000
*   /* BLDER: THIS PROC BUILDS THE OPCES FOR THE REQUIRED ACTION     */ 00934000
*   /*                                                               */ 00935000
*   /*****************************************************************/ 00936000
*                                                               02S0645 00937000
*BLDER:                                                         02S0645 00938000
*   PROC OPTIONS(RETREG,SAVE(14));                              02S0645 00939000
BLDER    ST    @14,@SA00004                                     02S0645 00940000
*   OPCAQWD=''B;                    /* CLEAR THE SVC LIST            */ 00941000
         XC    OPCAQWD(12,ROPCAVT),OPCAQWD(ROPCAVT)             02S0646 00942000
*   OPCAQREQ=CHAINFLG;              /* SET THE REQUEST CODE          */ 00943000
         MVI   OPCAQREQ(ROPCAVT),X'B4'                          02S0647 00944000
*   CALL HIERLOOP;                  /* AND BUILD THE OPCES           */ 00945000
         BAL   @14,HIERLOOP                                     02S0648 00946000
*   RPARM=ADDR(OPCAQCTL);           /* POINT TO SVC LIST             */ 00947000
         LA    RPARM,OPCAQCTL(,ROPCAVT)                         02S0649 00948000
*   SVC(102);                       /* AND POST THEM                 */ 00949000
         SVC   102                                              02S0650 00950000
*   IF OCBUFNED^=0 THEN             /* IF STILL NEED MORE OPCES TO      00951000
*                                      FINISH                        */ 00952000
         ICM   @11,3,OCBUFNED(ROPCE)                            02S0651 00953000
         BZ    @RF00651                                         02S0651 00954000
*     DO;                           /* THEN                          */ 00955000
*       OCWTG=THISMOD;              /* SET RETURN TO THIS MODULE     */ 00956000
         MVC   OCWTG(2,ROPCE),THISMOD                           02S0653 00957000
*       OCREDRVE=ON;                /* TURN ON REDRIVE FLAG          */ 00958000
         OI    OCREDRVE(ROPCE),B'00010000'                      02S0654 00959000
*       OCLINK=OPCBUFWT;            /* PUT OPCE ON REDRIVE CHAIN     */ 00960000
         MVC   OCLINK(4,ROPCE),OPCBUFWT(ROPCAVT)                02S0655 00961000
*       OPCBUFWT=ROPCE;             /* AND WAIT                      */ 00962000
         ST    ROPCE,OPCBUFWT(,ROPCAVT)                         02S0656 00963000
*     END;                                                      02S0657 00964000
*   ELSE                            /* ELSE FREE THE REDRIVE OPCE    */ 00965000
*     DO;                                                       02S0658 00966000
         B     @RC00651                                         02S0658 00967000
@RF00651 DS    0H                                               02S0659 00968000
*       REG00=1;                    /* SET DECR COUNT TO 1           */ 00969000
         LA    REG00,1                                          02S0659 00970000
*       CALL DECRCT;                /* DECREMENT OPCADGOT            */ 00971000
         L     @15,OPCDECR(,ROPCAVT)                            02S0660 00972000
         BALR  @14,@15                                          02S0660 00973000
*       RPARM=ROPCE;                /* POINT TO OPCE                 */ 00974000
         LR    RPARM,ROPCE                                      02S0661 00975000
*       CALL FREEBUF;               /* AND FREE IT                   */ 00976000
         L     @15,OPCFREBF(,ROPCAVT)                           02S0662 00977000
         BALR  @14,@15                                          02S0662 00978000
*     END;                                                      02S0663 00979000
*   OPCMODID=TO00;                  /* SET TO GO TO IGC0010D         */ 00980000
@RC00651 MVC   OPCMODID(2,ROPCAVT),TO00                         02S0664 00981000
*   OUTFLAG=ON;                     /* SET TO GET OUT                */ 00982000
         OI    OUTFLAG,B'01000000'                              02S0665 00983000
*   END BLDER;                                                  02S0666 00984000
@EL00004 DS    0H                                               02S0666 00985000
@EF00004 DS    0H                                               02S0666 00986000
@ER00004 L     @14,@SA00004                                     02S0666 00987000
         BR    @14                                              02S0666 00988000
*                                                               02S0667 00989000
*   /*****************************************************************/ 00990000
*   /*                                                               */ 00991000
*   /* PROCESS.GETBUFS: THIS PROCEDURE DETERMINES IF ANY UNITS MAY BE*/ 00992000
*   /* OBTAINED, AND IF SO, HOW MANY, AND THEN GETS THEM AND ATTACHES*/ 00993000
*   /* THEM TO THE REDRIVE OPCE                                      */ 00994000
*   /*                                                               */ 00995000
*   /*****************************************************************/ 00996000
*                                                               02S0667 00997000
*GETBUFS:                                                       02S0667 00998000
*   PROC OPTIONS(RETREG,SAVE(14));                              02S0667 00999000
GETBUFS  ST    @14,@SA00005                                     02S0667 01000000
*   IF OPCADGOT<HALFUNIT THEN       /* IF ACT/DEACT HAS LT 50%       */ 01001000
         LH    @11,HALFUNIT                                     02S0668 01002000
         SLR   @09,@09                                          02S0668 01003000
         ICM   @09,3,OPCADGOT(ROPCAVT)                          02S0668 01004000
         CR    @09,@11                                          02S0668 01005000
         BNL   @RF00668                                         02S0668 01006000
*     DO;                           /* THEN                          */ 01007000
*       IF(OCBUFNED+OPCADGOT)>HALFUNIT THEN/* IF NO NEED PLUS        */ 01008000
         SLR   @05,@05                                          02S0670 01009000
         ICM   @05,3,OCBUFNED(ROPCE)                            02S0670 01010000
         LR    @07,@05                                          02S0670 01011000
         ALR   @07,@09                                          02S0670 01012000
         CR    @07,@11                                          02S0670 01013000
         BNH   @RF00670                                         02S0670 01014000
*         DO;                       /* NO A/D ALREADY HAS IS GT 50%     01015000
*                                      THEN                          */ 01016000
*           GETNO=(HALFUNIT-OPCADGOT);/* SET TO GET UP TO 50%        */ 01017000
         SLR   @11,@09                                          02S0672 01018000
         LR    GETNO,@11                                        02S0672 01019000
*           OCBUFNED=OCBUFNED-GETNO;/* SET NO STILL NEED =REMAINDER  */ 01020000
         SLR   @05,GETNO                                        02S0673 01021000
         STH   @05,OCBUFNED(,ROPCE)                             02S0673 01022000
*         END;                                                  02S0674 01023000
*       ELSE                        /* ELSE GET ALL NEEDED           */ 01024000
*         DO;                                                   02S0675 01025000
         B     @RC00670                                         02S0675 01026000
@RF00670 DS    0H                                               02S0676 01027000
*           GETNO=OCBUFNED;         /* SET TO GET ALL                */ 01028000
         SLR   GETNO,GETNO                                      02S0676 01029000
         ICM   GETNO,3,OCBUFNED(ROPCE)                          02S0676 01030000
*           OCBUFNED=0;             /* SET NO STILL NEED=0           */ 01031000
         SLR   @11,@11                                          02S0677 01032000
         STH   @11,OCBUFNED(,ROPCE)                             02S0677 01033000
*         END;                                                  02S0678 01034000
*       OCBUFGOT=GETNO;             /* SET NO HAVE =NO TO GET        */ 01035000
@RC00670 STH   GETNO,OCBUFGOT(,ROPCE)                           02S0679 01036000
*       OPCADGOT=OPCADGOT+GETNO;    /* INCREMENT OPCADGOT            */ 01037000
         SLR   @11,@11                                          02S0680 01038000
         ICM   @11,3,OPCADGOT(ROPCAVT)                          02S0680 01039000
         ALR   @11,GETNO                                        02S0680 01040000
         STH   @11,OPCADGOT(,ROPCAVT)                           02S0680 01041000
*     END;                                                      02S0681 01042000
*   ELSE                            /* ELSE MUST PUT REDRIVE OPCE ON    01043000
*                                      WAIT CHAIN AND WAIT FOR       */ 01044000
*     DO;                           /* AVAILABLE UNITS ON REDRIVE    */ 01045000
         B     @RC00668                                         02S0682 01046000
@RF00668 DS    0H                                               02S0683 01047000
*       OPCMODID=TO00;              /* SET TO GO TO IGC0010D @OY20680*/ 01048000
         MVC   OPCMODID(2,ROPCAVT),TO00                         02S0683 01049000
*       OCWTG=THISMOD;              /* SET RETURN TO THIS MODULE     */ 01050000
         MVC   OCWTG(2,ROPCE),THISMOD                           02S0684 01051000
*       OCREDRVE=ON;                /* SET ON REDRIVE FLAG           */ 01052000
         OI    OCREDRVE(ROPCE),B'00010000'                      02S0685 01053000
*       OCLINK=OPCBUFWT;            /* GET CHAIN ANCHOR AND PUT IN      01054000
*                                      LINK FIELD                    */ 01055000
         MVC   OCLINK(4,ROPCE),OPCBUFWT(ROPCAVT)                02S0686 01056000
*       OPCBUFWT=ROPCE;             /* CHAIN IN THIS REDRIVE OPCE    */ 01057000
         ST    ROPCE,OPCBUFWT(,ROPCAVT)                         02S0687 01058000
*       OUTFLAG=ON;                 /* SET TO GET OUT                */ 01059000
         OI    OUTFLAG,B'01000000'                              02S0688 01060000
*       GETNO=0;                    /* SET NO TO GET =0              */ 01061000
         SLR   GETNO,GETNO                                      02S0689 01062000
*     END;                                                      02S0690 01063000
*   DO WHILE GETNO>0;               /* LOOP TO GET UNITS             */ 01064000
@RC00668 B     @DE00691                                         02S0691 01065000
@DL00691 DS    0H                                               02S0692 01066000
*     IF GETNO>255 THEN             /* MUST LOOP IF NEED MORE THAN      01067000
*                                      255                           */ 01068000
         LA    @11,255                                          02S0692 01069000
         CR    GETNO,@11                                        02S0692 01070000
         BNH   @RF00692                                         02S0692 01071000
*       DO;                         /* THEN                          */ 01072000
*         GETNO=GETNO-255;          /* SUB 255 FROM NO TO GET        */ 01073000
         SLR   GETNO,@11                                        02S0694 01074000
*         RPARM=255;                /* SET FOR REQUEST               */ 01075000
         LR    RPARM,@11                                        02S0695 01076000
*       END;                                                    02S0696 01077000
*     ELSE                          /* ELSE NEED ONLY ONE PASS TO GET   01078000
*                                      ALL NEEDED                    */ 01079000
*       DO;                                                     02S0697 01080000
         B     @RC00692                                         02S0697 01081000
@RF00692 DS    0H                                               02S0698 01082000
*         RPARM=GETNO;              /* SET REQUEST VALUE             */ 01083000
         LR    RPARM,GETNO                                      02S0698 01084000
*         GETNO=0;                  /* AND RESET GETNO TO 0          */ 01085000
         SLR   GETNO,GETNO                                      02S0699 01086000
*       END;                                                    02S0700 01087000
*     CALL ALLOCBUF;                /* GET BUFF UNITS                */ 01088000
@RC00692 L     @15,OPCGETBF(,ROPCAVT)                           02S0701 01089000
         BALR  @14,@15                                          02S0701 01090000
*     RFY                                                       02S0702 01091000
*       REG09 RSTD;                 /* RESTRICT WORK REG             */ 01092000
*     REG09=ROPCE;                  /* SET REG TO POINT TO REDRIVE      01093000
*                                      OPCE                          */ 01094000
         LR    REG09,ROPCE                                      02S0703 01095000
*     DO WHILE REG09->TIC=VALTIC;   /* LOOP TO FIND END OF UNIT CHAIN*/ 01096000
         B     @DE00704                                         02S0704 01097000
@DL00704 DS    0H                                               02S0705 01098000
*       REG09=REG09->OCUNIT;        /* UPDATE PTR TO NEXT UNIT       */ 01099000
         L     REG09,OCUNIT(,REG09)                             02S0705 01100000
*     END;                          /* AT END OF LOOP REG09 PTS TO      01101000
*                                      LAST UNIT OR REDRIVE OPCE     */ 01102000
@DE00704 TM    TIC(REG09),B'00000011'                           02S0706 01103000
         BZ    @DL00704                                         02S0706 01104000
*     REG09->OCUNIT=RPARM;          /* ATTACH GOTTEN UNITS           */ 01105000
         ST    RPARM,OCUNIT(,REG09)                             02S0707 01106000
*     RFY                                                       02S0708 01107000
*       REG09 UNRSTD;               /* RELEASE REG                   */ 01108000
*   END;                                                        02S0709 01109000
@DE00691 LTR   GETNO,GETNO                                      02S0709 01110000
         BP    @DL00691                                         02S0709 01111000
*   END GETBUFS;                                                02S0710 01112000
@EL00005 DS    0H                                               02S0710 01113000
@EF00005 DS    0H                                               02S0710 01114000
@ER00005 L     @14,@SA00005                                     02S0710 01115000
         BR    @14                                              02S0710 01116000
*                                                               02S0711 01117000
*   /*****************************************************************/ 01118000
*   /*                                                               */ 01119000
*   /* THIS ROUTINE CLEANS UP FROM AN ACTIVATION OF THE NCP BROUGHT  */ 01120000
*   /* ABOUT BY AN F ACT=NCP. THE IPL'ED FLAG IN THE DEVICE DEPENDENT*/ 01121000
*   /* FIELDS OF THE NCP IS TURNED OFF IF ACTIVATION DID NOT FAIL    */ 01122000
*   /* BECAUSE OF A SIB SHORTAGE. IGCFD10D IS LINKED TO TO DELETE THE*/ 01123000
*   /* HIERARCHY, THE SAT ENTRY FOR THIS NCP, THE NAT ENTRIES, AND TO*/ 01124000
*   /* FREE THE RVT.                                                 */ 01125000
*   /*                                                               */ 01126000
*   /*****************************************************************/ 01127000
*                                                               02S0711 01128000
*CLNUPNCP:                                                      02S0711 01129000
*   PROC OPTIONS(RETREG,SAVE(14));                              02S0711 01130000
CLNUPNCP ST    @14,@SA00006                                     02S0711 01131000
*   IF OCPTRSAV->OCPARM^=SIBSGMSG THEN/* IF NOT SIB SHORTAGE         */ 01132000
         L     @11,OCPTRSAV(,ROPCE)                             02S0712 01133000
         CLC   OCPARM(2,@11),@CH01667                           02S0712 01134000
         BE    @RF00712                                         02S0712 01135000
*     DO;                                                       02S0713 01136000
*       RPARM=OCTRMTBL;             /* SET PARM. WITH NCP TTCIN      */ 01137000
         SLR   RPARM,RPARM                                      02S0714 01138000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          02S0714 01139000
*       CALL NCPDVCDP;              /* OBTAIN DEVICE DEPENDENT FIELDS*/ 01140000
         BAL   @14,NCPDVCDP                                     02S0715 01141000
*       NCPIPLD=OFF;                /* TURN OFF IPL'ED FLAG          */ 01142000
         NI    NCPIPLD(RTNCODE),B'11110111'                     02S0716 01143000
*     END;                                                      02S0717 01144000
*   ELSE                                                        02S0718 01145000
*     ;                                                         02S0718 01146000
@RF00712 DS    0H                                               02S0719 01147000
*   OPCCOPCE=OCPTRSAV;              /* MAKE ORIG. OPCE THE CURRENT      01148000
*                                      OPCE                          */ 01149000
         MVC   OPCCOPCE(4,ROPCAVT),OCPTRSAV(ROPCE)              02S0719 01150000
*   RPARM=ROPCAVT;                  /* SET ADDR. OF OP. CTL. AVT     */ 01151000
         LR    RPARM,ROPCAVT                                    02S0720 01152000
*   GEN;                                                        02S0721 01153000
*          /*                                                           01154000
         LINK  EP=IGCFD10D         */                                   01155000
*   END CLNUPNCP;                                               02S0722 01156000
@EL00006 DS    0H                                               02S0722 01157000
@EF00006 DS    0H                                               02S0722 01158000
@ER00006 L     @14,@SA00006                                     02S0722 01159000
         BR    @14                                              02S0722 01160000
*                                                               02S0723 01161000
*   /*****************************************************************/ 01162000
*   /*                                                               */ 01163000
*   /* THIS ROUTINE HANDLES THE TERMINATION OF NCP ACTIVATION IF THE */ 01164000
*   /* ACTIVATION ENDS IN THIS MODULE (IE. IF CASCADING IS NOT       */ 01165000
*   /* PERFORMED. THE ORIG. (F ACT) OPCE IS SET AS CURRENT, THE      */ 01166000
*   /* PREVIOUS CURRENT OPCE IS FREED (ALONG WITH ANY ATTACHED RU),  */ 01167000
*   /* OPCADGOT IS DECREMENTED, THE IN-PROGRESS BITS TURNED OFF, THE */ 01168000
*   /* COMP. CODE IS SET IN R0, AND THE OPCMODID IS SET WITH THE     */ 01169000
*   /* APPROPRIATE MOD. ID                                           */ 01170000
*   /*                                                               */ 01171000
*   /*****************************************************************/ 01172000
*                                                               02S0723 01173000
*TERMPROC:                                                      02S0723 01174000
*   PROC OPTIONS(RETREG,SAVE(14));                              02S0723 01175000
TERMPROC ST    @14,@SA00007                                     02S0723 01176000
*   RPARM=ROPCE;                    /* ADDR. OF OPCE TO BE FREED     */ 01177000
         LR    RPARM,ROPCE                                      02S0724 01178000
*   CALL FREEBUF;                   /* FREE BUFFER AND RU (IF ANY)   */ 01179000
         L     @15,OPCFREBF(,ROPCAVT)                           02S0725 01180000
         BALR  @14,@15                                          02S0725 01181000
*   RZERO=1;                        /* NUMBER OF A/D UNITS FREED     */ 01182000
         LA    RZERO,1                                          02S0726 01183000
*   CALL DECRCT;                    /* DECREMENT OPCADGOT, START        01184000
*                                      REDRIVE                       */ 01185000
         L     @15,OPCDECR(,ROPCAVT)                            02S0727 01186000
         BALR  @14,@15                                          02S0727 01187000
*   RZERO=TOFFINPG;                 /* TURN OFF IN-PROG BITS AND ....*/ 01188000
         SLR   RZERO,RZERO                                      02S0728 01189000
*   RPARM=OPCCOPCE;                 /* .... REMOVE ORIG. OPCE ....   */ 01190000
         L     RPARM,OPCCOPCE(,ROPCAVT)                         02S0729 01191000
*   CALL PROGRTNE;                  /* .... FROM A/D WAIT CHAIN      */ 01192000
         L     @15,OPCPGCK(,ROPCAVT)                            02S0730 01193000
         BALR  @14,@15                                          02S0730 01194000
*   ROPCE=OPCCOPCE;                 /* SET OPCE BASE TO CURRENT OPCE    01195000
*                                      WHICH IS ORIG.                */ 01196000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         02S0731 01197000
*   RZERO=OCPARM;                   /* SET REG. 0 WITH COMP. CODE    */ 01198000
         LH    RZERO,OCPARM(,ROPCE)                             02S0732 01199000
*   IF OCWTG^=0 THEN                                            02S0733 01200000
         ICM   @11,3,OCWTG(ROPCE)                               02S0733 01201000
         BZ    @RF00733                                         02S0733 01202000
*     DO;                                                       02S0734 01203000
*       OPCMODID=OCWTG;             /* SET TO RETURN TO CALLER       */ 01204000
         MVC   OPCMODID(2,ROPCAVT),OCWTG(ROPCE)                 02S0735 01205000
*       OCWTG=''B;                  /* REINITIALIZE                  */ 01206000
         XC    OCWTG(2,ROPCE),OCWTG(ROPCE)                      02S0736 01207000
*     END;                                                      02S0737 01208000
*   ELSE                                                        02S0738 01209000
*     IF OCTOTE=ON THEN             /* IF TOTE ENTERED COMMAND       */ 01210000
         B     @RC00733                                         02S0738 01211000
@RF00733 TM    OCTOTE(ROPCE),B'01000000'                        02S0738 01212000
         BNO   @RF00738                                         02S0738 01213000
*       DO;                                                     02S0739 01214000
*         OPCMODID=OUTPTMOD;        /* SET TO XCTL TO OUTPUT WRITER  */ 01215000
         MVC   OPCMODID(2,ROPCAVT),OUTPTMOD                     02S0740 01216000
*         IF RZERO=GOODMSG THEN     /* IF SUCCESSFUL                 */ 01217000
         CH    RZERO,@CH01663                                   02S0741 01218000
         BNE   @RF00741                                         02S0741 01219000
*           RZERO=TOTEGOOD;         /* GOOD RETURN CODE FOR TOTE     */ 01220000
         SLR   RZERO,RZERO                                      02S0742 01221000
*         ELSE                                                  02S0743 01222000
*           RZERO=TOTEBAD;          /* BAD RETURN CODE FOR TOTE      */ 01223000
         B     @RC00741                                         02S0743 01224000
@RF00741 LA    RZERO,4                                          02S0743 01225000
*       END;                                                    02S0744 01226000
*     ELSE                                                      02S0745 01227000
*       IF RZERO=GOODMSG THEN       /* IF GOOD RETURN CODE           */ 01228000
         B     @RC00738                                         02S0745 01229000
@RF00738 CH    RZERO,@CH01663                                   02S0745 01230000
         BNE   @RF00745                                         02S0745 01231000
*         DO;                                                   02S0746 01232000
*           OPCMODID=OPCKPMOD;      /* SET TO XCTL TO OP. CTL CKPT.  */ 01233000
         MVC   OPCMODID(2,ROPCAVT),OPCKPMOD                     02S0747 01234000
*           OCWTG=MSGMOD0D;         /* SET TO GO TO MSG. MOD. AFTER     01235000
*                                      CHECK POINT.                  */ 01236000
         MVC   OCWTG(2,ROPCE),MSGMOD0D                          02S0748 01237000
*         END;                                                  02S0749 01238000
*       ELSE                                                    02S0750 01239000
*         IF RZERO^=IPLRQMSG THEN   /* IF NOT IPL REQ'ED             */ 01240000
         B     @RC00745                                         02S0750 01241000
@RF00745 CH    RZERO,@CH01665                                   02S0750 01242000
         BE    @RF00750                                         02S0750 01243000
*           OPCMODID=MSGMOD0H;      /* SET TO XCTL TO IGC0H10D       */ 01244000
         MVC   OPCMODID(2,ROPCAVT),MSGMOD0H                     02S0751 01245000
*         ELSE                                                  02S0752 01246000
*           OPCMODID=MSGMOD0C;      /* SET TO XCTL TO IGC0C10D  02S0752 01247000
*                                                            @YM07763*/ 01248000
         B     @RC00750                                         02S0752 01249000
@RF00750 MVC   OPCMODID(2,ROPCAVT),MSGMOD0C                     02S0752 01250000
*   END TERMPROC;                                               02S0753 01251000
@EL00007 DS    0H                                               02S0753 01252000
@EF00007 DS    0H                                               02S0753 01253000
@ER00007 L     @14,@SA00007                                     02S0753 01254000
         BR    @14                                              02S0753 01255000
*                                                               02S0754 01256000
*   /*****************************************************************/ 01257000
*   /*                                                               */ 01258000
*   /* THIS ROUTINE TAKES THE TTCIN CONTAINED IN RPARM AND RETURNS   */ 01259000
*   /* THE ADDR. OF THE DEVICE DEPENDENT FIELDS FOR THE RESOURCE IN  */ 01260000
*   /* RTNCODE (R15). ALSO, RTRM IS SET TO POINT TO THE TTE ADDR.    */ 01261000
*   /*                                                               */ 01262000
*   /*****************************************************************/ 01263000
*                                                               02S0754 01264000
*NCPDVCDP:                                                      02S0754 01265000
*   PROC OPTIONS(RETREG,SAVE(14));                              02S0754 01266000
NCPDVCDP ST    @14,@SA00008                                     02S0754 01267000
*   CALL IEDQTNT;                   /* OBTAIN TTE ADDR.              */ 01268000
         L     @15,AVTRNMPT(,RAVT)                              02S0755 01269000
         BALR  @14,@15                                          02S0755 01270000
*   RTRM=RPARM;                     /* COPY TTE ADDR.                */ 01271000
         LR    RTRM,RPARM                                       02S0756 01272000
*   RZERO=TRMNCPIM;                 /* SET UP MASK                   */ 01273000
         LA    RZERO,8                                          02S0757 01274000
*   CALL IEDQTL;                    /* OBTAIN ADDR. OF DEVICE   02S0758 01275000
*                                      DEPENDENT FIELDS              */ 01276000
         L     @15,AVTDDFT(,RAVT)                               02S0758 01277000
         BALR  @14,@15                                          02S0758 01278000
*   END NCPDVCDP;                                               02S0759 01279000
@EL00008 DS    0H                                               02S0759 01280000
@EF00008 DS    0H                                               02S0759 01281000
@ER00008 L     @14,@SA00008                                     02S0759 01282000
         BR    @14                                              02S0759 01283000
*   END IGCFJ10D                                                01S0760 01284000
*                                                               01S0760 01285000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01286000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 01287000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 01288000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 01289000
*/*%INCLUDE SYSLIB  (TNCPID  )                                       */ 01290000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 01291000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 01292000
*/*%INCLUDE SYSLIB  (TOPRED  )                                       */ 01293000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 01294000
*/*%INCLUDE SYSLIB  (TPRUD   )                                       */ 01295000
*/*%INCLUDE SYSLIB  (TTNTD   )                                       */ 01296000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 01297000
*/*%INCLUDE SYSUT5  (RFY     )                                       */ 01298000
*/*%INCLUDE SYSUT5  (DCL     )                                       */ 01299000
*/*%INCLUDE SYSUT5  (PROLOGUE)                                       */ 01300000
*/*%INCLUDE SYSUT5  (PROCESS )                                       */ 01301000
*/*%INCLUDE SYSUT5  (INITIAL )                                       */ 01302000
*/*%INCLUDE SYSUT5  (MAINSEG )                                       */ 01303000
*/*%INCLUDE SYSUT5  (SETCVR  )                                       */ 01304000
*/*%INCLUDE SYSUT5  (DACTCHK )                                       */ 01305000
*/*%INCLUDE SYSUT5  (ACTNCPR )                                       */ 01306000
*/*%INCLUDE SYSUT5  (ACTLINK )                                       */ 01307000
*/*%INCLUDE SYSUT5  (NOTRST  )                                       */ 01308000
*/*%INCLUDE SYSUT5  (DACTLKRD)                                       */ 01309000
*/*%INCLUDE SYSUT5  (ACTLNKRD)                                       */ 01310000
*/*%INCLUDE SYSUT5  (EPILOGUE)                                       */ 01311000
*/*%INCLUDE SYSUT5  (HIERLOOP)                                       */ 01312000
*/*%INCLUDE SYSUT5  (ACTION  )                                       */ 01313000
*/*%INCLUDE SYSUT5  (BLDOPCE )                                       */ 01314000
*/*%INCLUDE SYSUT5  (BLDER   )                                       */ 01315000
*/*%INCLUDE SYSUT5  (GETBUFS )                                       */ 01316000
*/*%INCLUDE SYSUT5  (CLNUPNCP)                                       */ 01317000
*/*%INCLUDE SYSUT5  (TERMPROC)                                       */ 01318000
*/*%INCLUDE SYSUT5  (NCPDVCDP)                                       */ 01319000
*                                                               01S0760 01320000
*       ;                                                       01S0760 01321000
@DATA    DS    0H                                                       01322000
@CH00919 DC    H'0'                                                     01323000
@CH00047 DC    H'8'                                                     01324000
@CH01700 DC    H'14'                                                    01325000
@CH01663 DC    H'382'                                                   01326000
@CH01665 DC    H'416'                                                   01327000
@CH01667 DC    H'531'                                                   01328000
@CH01669 DC    H'532'                                                   01329000
@CH01069 DC    H'-2'                                                    01330000
@CH01067 DC    H'-1'                                                    01331000
@SM01734 MVC   OCBACKUP(0,REG09),NAME(RPARM)                            01332000
@DATD    DSECT                                                          01333000
         DS    0F                                                       01334000
@SA00008 DS    1F                                                       01335000
@SA00007 DS    1F                                                       01336000
@SA00002 DS    1F                                                       01337000
@SA00005 DS    1F                                                       01338000
@SA00004 DS    1F                                                       01339000
@SA00006 DS    1F                                                       01340000
IGCFJ10D CSECT                                                          01341000
         DS    0F                                                       01342000
@CF00063 DC    F'1'                                                     01343000
@CF00067 DC    F'2'                                                     01344000
@CH00067 EQU   @CF00067+2                                               01345000
@CF00076 DC    F'3'                                                     01346000
@CF00257 DC    F'4'                                                     01347000
@CH00257 EQU   @CF00257+2                                               01348000
@CF00165 DC    F'5'                                                     01349000
@CH00165 EQU   @CF00165+2                                               01350000
@CF00061 DC    F'6'                                                     01351000
@CF01732 DC    F'-12'                                                   01352000
@CF01733 DC    F'-10'                                                   01353000
@CF01071 DC    F'-3'                                                    01354000
@CH01071 EQU   @CF01071+2                                               01355000
@CF01412 DC    XL4'08000002'                                            01356000
@DATD    DSECT                                                          01357000
         DS    0D                                                       01358000
BLDOSAV  DS    A                                                        01359000
FLAGS    DS    FL4                                                      01360000
         ORG   FLAGS                                                    01361000
FINIFLAG DS    BL1                                                      01362000
OUTFLAG  EQU   FLAGS+0                                                  01363000
         ORG   FLAGS+4                                                  01364000
ACTFLAG  DS    F                                                        01365000
HALFUNIT DS    H                                                        01366000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01367000
@ENDDATD EQU   *                                                        01368000
IGCFJ10D CSECT                                                          01369000
         NOPR  ((@ENDDATD-@DATD)/561*16)                                01370000
         DS    0F                                                       01371000
@SIZDATD DC    AL1(0)                                                   01372000
         DC    AL3(@ENDDATD-@DATD)                                      01373000
         DS    0D                                                       01374000
ADPATCH  DC    XL104'0'                                                 01375000
TO00     DC    CL2'00'                                                  01376000
SSCPMOD  DC    CL2'A0'                                                  01377000
MSGMOD0H DC    CL2'0H'                                                  01378000
MSGMOD0C DC    CL2'0C'                                                  01379000
MSGMOD0D DC    CL2'0D'                                                  01380000
OPCKPMOD DC    CL2'06'                                                  01381000
ADCKPMOD DC    CL2'FF'                                                  01382000
OUTPTMOD DC    CL2'07'                                                  01383000
NEXTMOD  DC    CL2'FL'                                                  01384000
ALKRPMOD DC    CL2'FE'                                                  01385000
THISMOD  DC    CL2'FJ'                                                  01386000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01387000
@01      EQU   01                                                       01388000
@02      EQU   02                                                       01389000
@03      EQU   03                                                       01390000
@04      EQU   04                                                       01391000
@05      EQU   05                                                       01392000
@06      EQU   06                                                       01393000
@07      EQU   07                                                       01394000
@08      EQU   08                                                       01395000
@09      EQU   09                                                       01396000
@10      EQU   10                                                       01397000
@11      EQU   11                                                       01398000
@12      EQU   12                                                       01399000
@13      EQU   13                                                       01400000
@14      EQU   14                                                       01401000
@15      EQU   15                                                       01402000
GETNO    EQU   @06                                                      01403000
IEDQAPTR EQU   @04                                                      01404000
ROPCE    EQU   @03                                                      01405000
ROPCAVT  EQU   @02                                                      01406000
IEDPRUQP EQU   @03                                                      01407000
IEDQTPTR EQU   @08                                                      01408000
RAVT     EQU   @04                                                      01409000
RTRM     EQU   @08                                                      01410000
RTNCODE  EQU   @15                                                      01411000
REG00    EQU   @00                                                      01412000
RZERO    EQU   @00                                                      01413000
REG01    EQU   @01                                                      01414000
RPARM    EQU   @01                                                      01415000
REG06    EQU   @06                                                      01416000
REG09    EQU   @09                                                      01417000
REG10    EQU   @10                                                      01418000
RWRKAREA EQU   @10                                                      01419000
RBASE    EQU   @12                                                      01420000
RSAVE    EQU   @13                                                      01421000
REG14    EQU   @14                                                      01422000
RRET     EQU   @14                                                      01423000
REG15    EQU   @15                                                      01424000
RBRNCH   EQU   @15                                                      01425000
RCL14SAV EQU   @11                                                      01426000
REG02    EQU   @02                                                      01427000
REG03    EQU   @03                                                      01428000
REG04    EQU   @04                                                      01429000
REG05    EQU   @05                                                      01430000
REG07    EQU   @07                                                      01431000
REG08    EQU   @08                                                      01432000
REG11    EQU   @11                                                      01433000
REG12    EQU   @12                                                      01434000
REG13    EQU   @13                                                      01435000
ROPRE    EQU   @03                                                      01436000
IEDQAVTD EQU   0                                                        01437000
AVTSAVEX EQU   IEDQAVTD+288                                             01438000
AVTREADD EQU   IEDQAVTD+380                                             01439000
AVTBUFSW EQU   IEDQAVTD+384                                             01440000
@NM00004 EQU   IEDQAVTD+388                                             01441000
AVTCKFLG EQU   @NM00004                                                 01442000
AVTBASE  EQU   IEDQAVTD+412                                             01443000
AVTPKF   EQU   AVTBASE                                                  01444000
AVTRNMPT EQU   IEDQAVTD+424                                             01445000
AVTNOLBF EQU   IEDQAVTD+454                                             01446000
AVTOSECB EQU   IEDQAVTD+492                                             01447000
AVTECB1  EQU   AVTOSECB                                                 01448000
AVTHG02  EQU   IEDQAVTD+528                                             01449000
AVTDISP  EQU   IEDQAVTD+552                                             01450000
AVTHD    EQU   IEDQAVTD+556                                             01451000
AVTSCOPT EQU   AVTHD                                                    01452000
AVTSAVTP EQU   IEDQAVTD+612                                             01453000
AVTSAVTF EQU   AVTSAVTP                                                 01454000
AVTCKPEL EQU   IEDQAVTD+652                                             01455000
AVTCKRMV EQU   AVTCKPEL                                                 01456000
AVTCKELF EQU   IEDQAVTD+680                                             01457000
AVTCKBYT EQU   IEDQAVTD+691                                             01458000
AVTHG01  EQU   IEDQAVTD+692                                             01459000
AVTCKLNK EQU   IEDQAVTD+696                                             01460000
AVTCRELE EQU   IEDQAVTD+708                                             01461000
AVTCCELE EQU   AVTCRELE                                                 01462000
AVTCLRHI EQU   IEDQAVTD+716                                             01463000
AVTADBUF EQU   IEDQAVTD+720                                             01464000
AVTSYSER EQU   IEDQAVTD+728                                             01465000
AVTBFRFG EQU   IEDQAVTD+784                                             01466000
AVTCKPQB EQU   IEDQAVTD+804                                             01467000
AVTCKPTB EQU   AVTCKPQB                                                 01468000
AVTCKPEC EQU   AVTCKPQB+4                                               01469000
AVTCKPCC EQU   AVTCKPEC                                                 01470000
AVTOPCQB EQU   IEDQAVTD+816                                             01471000
AVTOPCOB EQU   AVTOPCQB                                                 01472000
AVTOPCEC EQU   AVTOPCQB+4                                               01473000
AVTOPCCC EQU   AVTOPCEC                                                 01474000
AVTOLTQB EQU   IEDQAVTD+828                                             01475000
AVTCWFL1 EQU   IEDQAVTD+924                                             01476000
AVTCWFL2 EQU   IEDQAVTD+925                                             01477000
AVTSUBT  EQU   IEDQAVTD+948                                             01478000
AVTIOTR  EQU   IEDQAVTD+949                                             01479000
AVTBIT1  EQU   IEDQAVTD+1050                                            01480000
AVTBIT2  EQU   IEDQAVTD+1051                                            01481000
AVTBIT3  EQU   IEDQAVTD+1052                                            01482000
AVTDDFT  EQU   IEDQAVTD+1064                                            01483000
AVTBIT4  EQU   IEDQAVTD+1136                                            01484000
@NM00086 EQU   IEDQAVTD+1232                                            01485000
IEDNSVTD EQU   0                                                        01486000
SAVTDIAG EQU   IEDNSVTD                                                 01487000
SAVTDIAF EQU   SAVTDIAG                                                 01488000
SAVTLUSQ EQU   IEDNSVTD+88                                              01489000
SAVTTCPU EQU   IEDNSVTD+238                                             01490000
SAVTZELM EQU   IEDNSVTD+270                                             01491000
SAVTRDRV EQU   IEDNSVTD+284                                             01492000
SAVTCKQB EQU   IEDNSVTD+300                                             01493000
SAVTCKTB EQU   SAVTCKQB                                                 01494000
SAVTCKEC EQU   SAVTCKQB+4                                               01495000
SAVTCKCC EQU   SAVTCKEC                                                 01496000
IHADCB   EQU   0                                                        01497000
IHADCS16 EQU   0                                                        01498000
DCBMHA   EQU   IHADCS16                                                 01499000
DCBBUFOU EQU   DCBMHA                                                   01500000
DCBBUFIN EQU   DCBBUFOU                                                 01501000
DCBPCI   EQU   IHADCS16+5                                               01502000
DCBDSORG EQU   IHADCS16+6                                               01503000
DCBDSRG1 EQU   DCBDSORG                                                 01504000
DCBDSRG2 EQU   DCBDSORG+1                                               01505000
IHADCS17 EQU   0                                                        01506000
DCBCLPS  EQU   IHADCS17                                                 01507000
DCBIOBAD EQU   IHADCS17+8                                               01508000
IHADCS18 EQU   0                                                        01509000
DCBTRANA EQU   IHADCS18                                                 01510000
IHADCS19 EQU   0                                                        01511000
DCBLCBAD EQU   IHADCS19                                                 01512000
DCBCPRI  EQU   DCBLCBAD                                                 01513000
DCBEXLST EQU   IHADCS19+4                                               01514000
IHADCS24 EQU   0                                                        01515000
DCBOFLGS EQU   IHADCS24+8                                               01516000
DCBOFLWR EQU   DCBOFLGS                                                 01517000
DCBOFOPN EQU   DCBOFLGS                                                 01518000
DCBIFLG  EQU   IHADCS24+9                                               01519000
DCBIBPCT EQU   DCBIFLG                                                  01520000
DCBMACR  EQU   IHADCS24+10                                              01521000
DCBMACR1 EQU   DCBMACR                                                  01522000
DCBMRFE  EQU   DCBMACR1                                                 01523000
DCBMRGET EQU   DCBMRFE                                                  01524000
DCBMRAPG EQU   DCBMACR1                                                 01525000
DCBMRRD  EQU   DCBMRAPG                                                 01526000
DCBMRCI  EQU   DCBMACR1                                                 01527000
DCBMRMVG EQU   DCBMRCI                                                  01528000
DCBMRLCG EQU   DCBMACR1                                                 01529000
DCBMRABC EQU   DCBMACR1                                                 01530000
DCBMRPT1 EQU   DCBMRABC                                                 01531000
DCBMRSBG EQU   DCBMRPT1                                                 01532000
DCBMRCRL EQU   DCBMACR1                                                 01533000
DCBMRCHK EQU   DCBMRCRL                                                 01534000
DCBMRRDX EQU   DCBMRCHK                                                 01535000
DCBMRDMG EQU   DCBMACR1                                                 01536000
DCBMACR2 EQU   DCBMACR+1                                                01537000
DCBMRPUT EQU   DCBMACR2                                                 01538000
DCBMRWRT EQU   DCBMACR2                                                 01539000
DCBMRMVP EQU   DCBMACR2                                                 01540000
DCBMR5WD EQU   DCBMACR2                                                 01541000
DCBMRLDM EQU   DCBMR5WD                                                 01542000
DCBMRLCP EQU   DCBMRLDM                                                 01543000
DCBMR4WD EQU   DCBMACR2                                                 01544000
DCBMRPT2 EQU   DCBMR4WD                                                 01545000
DCBMRTMD EQU   DCBMRPT2                                                 01546000
DCBMR3WD EQU   DCBMACR2                                                 01547000
DCBMRCTL EQU   DCBMR3WD                                                 01548000
DCBMRSTK EQU   DCBMRCTL                                                 01549000
DCBMR1WD EQU   DCBMACR2                                                 01550000
DCBMRSWA EQU   DCBMR1WD                                                 01551000
DCBMRDMD EQU   DCBMRSWA                                                 01552000
IHADCS25 EQU   0                                                        01553000
DCBMACRF EQU   IHADCS25+2                                               01554000
DCBMACF1 EQU   DCBMACRF                                                 01555000
DCBMFFE  EQU   DCBMACF1                                                 01556000
DCBMFGET EQU   DCBMFFE                                                  01557000
DCBMFAPG EQU   DCBMACF1                                                 01558000
DCBMFRD  EQU   DCBMFAPG                                                 01559000
DCBMFCI  EQU   DCBMACF1                                                 01560000
DCBMFMVG EQU   DCBMFCI                                                  01561000
DCBMFLCG EQU   DCBMACF1                                                 01562000
DCBMFABC EQU   DCBMACF1                                                 01563000
DCBMFPT1 EQU   DCBMFABC                                                 01564000
DCBMFSBG EQU   DCBMFPT1                                                 01565000
DCBMFCRL EQU   DCBMACF1                                                 01566000
DCBMFCHK EQU   DCBMFCRL                                                 01567000
DCBMFDMG EQU   DCBMACF1                                                 01568000
DCBMACF2 EQU   DCBMACRF+1                                               01569000
DCBMFPUT EQU   DCBMACF2                                                 01570000
DCBMFWRT EQU   DCBMACF2                                                 01571000
DCBMFMVP EQU   DCBMACF2                                                 01572000
DCBMF5WD EQU   DCBMACF2                                                 01573000
DCBMFLDM EQU   DCBMF5WD                                                 01574000
DCBMFLCP EQU   DCBMFLDM                                                 01575000
DCBMF4WD EQU   DCBMACF2                                                 01576000
DCBMFPT2 EQU   DCBMF4WD                                                 01577000
DCBMFTMD EQU   DCBMFPT2                                                 01578000
DCBMF3WD EQU   DCBMACF2                                                 01579000
DCBMFCTL EQU   DCBMF3WD                                                 01580000
DCBMFSTK EQU   DCBMFCTL                                                 01581000
DCBMF1WD EQU   DCBMACF2                                                 01582000
DCBMFSWA EQU   DCBMF1WD                                                 01583000
DCBMFDMD EQU   DCBMFSWA                                                 01584000
DCBDEBAD EQU   IHADCS25+4                                               01585000
DCBIFLGS EQU   DCBDEBAD                                                 01586000
DCBIFPCT EQU   DCBIFLGS                                                 01587000
IHADCS43 EQU   0                                                        01588000
DCBSCTAB EQU   IHADCS43                                                 01589000
IHADCS2A EQU   0                                                        01590000
DCBRESER EQU   IHADCS2A                                                 01591000
DCBINVLI EQU   IHADCS2A+4                                               01592000
DCBINVCI EQU   DCBINVLI                                                 01593000
IEDNCP   EQU   0                                                        01594000
NCPFLAG1 EQU   IEDNCP+1                                                 01595000
NCPREST  EQU   NCPFLAG1                                                 01596000
NCPIPLD  EQU   NCPFLAG1                                                 01597000
NCPCKPT  EQU   IEDNCP+22                                                01598000
IEDQOPCE EQU   0                                                        01599000
OCLINK   EQU   IEDQOPCE                                                 01600000
OCELEM   EQU   IEDQOPCE+4                                               01601000
OCELMPRI EQU   OCELEM                                                   01602000
OCELMPTR EQU   OCELEM+1                                                 01603000
OCUNIT   EQU   IEDQOPCE+8                                               01604000
OCRUDEST EQU   OCUNIT                                                   01605000
OCCKPKEY EQU   OCRUDEST                                                 01606000
OCSCAN   EQU   OCCKPKEY                                                 01607000
OCOPTCDE EQU   IEDQOPCE+12                                              01608000
OCPRIFLG EQU   OCOPTCDE                                                 01609000
OCSWITCH EQU   IEDQOPCE+13                                              01610000
OCFLAG   EQU   IEDQOPCE+14                                              01611000
OCTOTE   EQU   OCFLAG                                                   01612000
OCRESP   EQU   OCFLAG                                                   01613000
@NM00128 EQU   IEDQOPCE+16                                              01614000
OCDEST   EQU   @NM00128                                                 01615000
OCREQVAL EQU   OCDEST+1                                                 01616000
OCTRMTBL EQU   IEDQOPCE+20                                              01617000
OCLINENO EQU   IEDQOPCE+22                                              01618000
OCTIOT   EQU   OCLINENO                                                 01619000
OCTRUNIT EQU   IEDQOPCE+24                                              01620000
OCRSID   EQU   OCTRUNIT                                                 01621000
OCALSTAT EQU   OCRSID                                                   01622000
OCREDRVE EQU   OCALSTAT                                                 01623000
OCACTREQ EQU   OCALSTAT                                                 01624000
OCPARM   EQU   IEDQOPCE+28                                              01625000
OCWTG    EQU   IEDQOPCE+30                                              01626000
OCBACKUP EQU   IEDQOPCE+32                                              01627000
OCBUFNED EQU   OCBACKUP                                                 01628000
OCBUFGOT EQU   OCBACKUP+2                                               01629000
OCMODNME EQU   IEDQOPCE+40                                              01630000
OCIPLWA  EQU   OCMODNME                                                 01631000
OCPTRSAV EQU   OCMODNME+4                                               01632000
OCCKDATA EQU   IEDQOPCE+48                                              01633000
OCRSTGTM EQU   OCCKDATA                                                 01634000
IEDQOPCN EQU   0                                                        01635000
OCLDNME  EQU   IEDQOPCN                                                 01636000
OCLINTTE EQU   OCLDNME                                                  01637000
OCRESPCT EQU   OCLINTTE                                                 01638000
OCREQFLG EQU   OCLINTTE+2                                               01639000
OCIDLE   EQU   OCREQFLG                                                 01640000
OCPREFLG EQU   OCLINTTE+3                                               01641000
IEDQOPCD EQU   0                                                        01642000
OPCAVTPT EQU   IEDQOPCD+8                                               01643000
OPCCOPCE EQU   IEDQOPCD+12                                              01644000
OPCPGCK  EQU   IEDQOPCD+40                                              01645000
OPCTNTEA EQU   IEDQOPCD+44                                              01646000
OPCSAVE  EQU   IEDQOPCD+56                                              01647000
OPCWORK  EQU   IEDQOPCD+140                                             01648000
OPCAQCTL EQU   IEDQOPCD+180                                             01649000
OPCXCTL  EQU   IEDQOPCD+204                                             01650000
OPCLDNME EQU   IEDQOPCD+212                                             01651000
OPCMODID EQU   OPCLDNME+3                                               01652000
OPCHORTG EQU   IEDQOPCD+260                                             01653000
OPCGETBF EQU   IEDQOPCD+276                                             01654000
OPCFREBF EQU   IEDQOPCD+280                                             01655000
OPCSPEC  EQU   IEDQOPCD+300                                             01656000
OPCADGOT EQU   IEDQOPCD+318                                             01657000
OPCBUFWT EQU   IEDQOPCD+348                                             01658000
OPCDECR  EQU   IEDQOPCD+352                                             01659000
OPCPWCOB EQU   IEDQOPCD+368                                             01660000
OPCPWQCB EQU   OPCPWCOB                                                 01661000
OPCPWECB EQU   OPCPWCOB+4                                               01662000
IEDOPRED EQU   0                                                        01663000
OPRESAVE EQU   IEDOPRED+8                                               01664000
OPREFLG3 EQU   IEDOPRED+14                                              01665000
IEDPRUQD EQU   0                                                        01666000
PRUTIC   EQU   IEDPRUQD+8                                               01667000
IEDPRUND EQU   0                                                        01668000
PRURHTH  EQU   IEDPRUND                                                 01669000
PRURH    EQU   PRURHTH                                                  01670000
PRURHFG0 EQU   PRURH                                                    01671000
PRURHFG1 EQU   PRURH+1                                                  01672000
PRURHFG2 EQU   PRURH+2                                                  01673000
PRUTH    EQU   PRURHTH+3                                                01674000
PRUFIDN  EQU   PRUTH                                                    01675000
IEDQTNTD EQU   0                                                        01676000
IEDQTCDE EQU   IEDQTNTD                                                 01677000
TNTENLEN EQU   IEDQTNTD+40                                              01678000
IEDQTDCE EQU   IEDQTNTD+46                                              01679000
IEDTNTA  EQU   0                                                        01680000
IEDQTRM  EQU   0                                                        01681000
TRMSTATE EQU   IEDQTRM                                                  01682000
TRMLOG   EQU   TRMSTATE                                                 01683000
TRMINSEQ EQU   IEDQTRM+4                                                01684000
TLISTCNT EQU   TRMINSEQ                                                 01685000
TRMOUTSQ EQU   IEDQTRM+6                                                01686000
TLISTEN  EQU   TRMOUTSQ                                                 01687000
TRMDSORG EQU   TLISTEN                                                  01688000
TRMALTD  EQU   IEDQTRM+8                                                01689000
TRMDEVFL EQU   IEDQTRM+10                                               01690000
TRMSTAT  EQU   IEDQTRM+12                                               01691000
IEDNTRM  EQU   0                                                        01692000
TRMBYTE4 EQU   IEDNTRM                                                  01693000
TRMBYTE3 EQU   IEDNTRM+1                                                01694000
TRMBYTE2 EQU   IEDNTRM+2                                                01695000
TRMREMB  EQU   TRMBYTE2                                                 01696000
TRMINPG  EQU   TRMBYTE2                                                 01697000
TRMBYTE1 EQU   IEDNTRM+3                                                01698000
TRMSCPRQ EQU   TRMBYTE1                                                 01699000
TRMCOHRT EQU   IEDNTRM+4                                                01700000
TRMBYTE0 EQU   IEDNTRM+6                                                01701000
TRMSIBPT EQU   IEDNTRM+7                                                01702000
TRMTYPE  EQU   IEDNTRM+11                                               01703000
TRMSUBST EQU   IEDNTRM+12                                               01704000
NAME     EQU   0                                                        01705000
ALLOCBUF EQU   0                                                        01706000
TNTENTAD EQU   0                                                        01707000
CHORTGLK EQU   0                                                        01708000
DECRCT   EQU   0                                                        01709000
FREEBUF  EQU   0                                                        01710000
IEDQTNT  EQU   0                                                        01711000
PROGRTNE EQU   0                                                        01712000
IEDQTL   EQU   0                                                        01713000
TNTCODE  EQU   0                                                        01714000
TNTDCODE EQU   0                                                        01715000
TNTFIRST EQU   0                                                        01716000
DCBPTR   EQU   NCPCKPT                                                  01717000
OCCKPKY1 EQU   OCCKPKEY                                                 01718000
OCCKPTYP EQU   OCCKPKY1                                                 01719000
OCICACTN EQU   OCMODNME                                                 01720000
OCICDADR EQU   OCICACTN                                                 01721000
OCICSW   EQU   OCICDADR+3                                               01722000
OPCAQWD  EQU   OPCAQCTL                                                 01723000
OPCAQWD1 EQU   OPCAQWD                                                  01724000
OPCAQREQ EQU   OPCAQWD1                                                 01725000
OPCAQFST EQU   OPCAQWD1+1                                               01726000
OPCAQWD2 EQU   OPCAQWD+4                                                01727000
OPCAQSEC EQU   OPCAQWD2+1                                               01728000
OPCAQWD3 EQU   OPCAQWD+8                                                01729000
IEDQNPTR EQU   AVTRNMPT                                                 01730000
TRMPRE1  EQU   TRMBYTE4                                                 01731000
TRMNCP1  EQU   TRMBYTE4                                                 01732000
TRMPRE   EQU   TRMBYTE3                                                 01733000
TRMNCP   EQU   TRMBYTE3                                                 01734000
TRMPU    EQU   TRMBYTE3                                                 01735000
TRMLU    EQU   TRMBYTE3                                                 01736000
TRMLINK  EQU   TRMBYTE3                                                 01737000
TICFLD   EQU   OCUNIT                                                   01738000
TIC      EQU   TICFLD+3                                                 01739000
OCCIB    EQU   OCREQVAL                                                 01740000
TRMOPT   EQU   IEDQTRM+20                                               01741000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01742000
@NM00168 EQU   TICFLD                                                   01743000
@NM00167 EQU   TRMLINK                                                  01744000
TRMLSTAT EQU   TRMLINK                                                  01745000
TRMLINT  EQU   TRMLINK                                                  01746000
TRMEPMOD EQU   TRMLINK                                                  01747000
TRMLULOG EQU   TRMLU                                                    01748000
TRMINERR EQU   TRMLU                                                    01749000
TRMLUREQ EQU   TRMLU                                                    01750000
TRMSESRQ EQU   TRMLU                                                    01751000
TRMTDIFF EQU   TRMLU                                                    01752000
TRMLUTM  EQU   TRMLU                                                    01753000
TRMLUIT  EQU   TRMLU                                                    01754000
TRMAUTO  EQU   TRMLU                                                    01755000
TRMPCONT EQU   TRMPU                                                    01756000
@NM00166 EQU   TRMPU                                                    01757000
TRMNCONT EQU   TRMNCP                                                   01758000
TRMQUCKN EQU   TRMNCP                                                   01759000
TRMSLOWN EQU   TRMNCP                                                   01760000
TRMSYGEN EQU   TRMNCP                                                   01761000
TRMNCPCL EQU   TRMNCP                                                   01762000
TRMIPLDM EQU   TRMNCP                                                   01763000
TRMINOUT EQU   TRMPRE                                                   01764000
TRMRDOUT EQU   TRMPRE                                                   01765000
TRMNLOUT EQU   TRMPRE                                                   01766000
TRMWROUT EQU   TRMPRE                                                   01767000
TRMASNXI EQU   TRMPRE                                                   01768000
TRMSTMM  EQU   TRMPRE                                                   01769000
TRMCMODE EQU   TRMPRE                                                   01770000
TRMSTPND EQU   TRMPRE                                                   01771000
@NM00165 EQU   TRMNCP1                                                  01772000
TRMINOP  EQU   TRMNCP1                                                  01773000
TRMLYNCH EQU   TRMPRE1                                                  01774000
TRMSPOUT EQU   TRMPRE1                                                  01775000
TRMERLCK EQU   TRMPRE1                                                  01776000
TRMQNPL  EQU   TRMPRE1                                                  01777000
TRMSPACT EQU   TRMPRE1                                                  01778000
TRMOCNI  EQU   TRMPRE1                                                  01779000
TRMSESSN EQU   TRMPRE1                                                  01780000
TRMCONT  EQU   TRMPRE1                                                  01781000
OPCAQLST EQU   OPCAQWD3+1                                               01782000
OPCAQRQ3 EQU   OPCAQWD3                                                 01783000
OPCAQRQ2 EQU   OPCAQWD2                                                 01784000
OCICINAC EQU   OCICSW                                                   01785000
@NM00133 EQU   OCICSW                                                   01786000
OCICATST EQU   OCICDADR+1                                               01787000
OCICTYPE EQU   OCICDADR                                                 01788000
@NM00132 EQU   OCCKPKY1                                                 01789000
OCCKPENV EQU   OCCKPKY1                                                 01790000
OCCKPRST EQU   OCCKPTYP                                                 01791000
OCCKPNCP EQU   OCCKPTYP                                                 01792000
OCCKPINC EQU   OCCKPTYP                                                 01793000
TRMRLMCT EQU   IEDNTRM+10                                               01794000
TRMCOHTG EQU   TRMSIBPT+1                                               01795000
TRMGPCNT EQU   TRMSIBPT                                                 01796000
TRMBUFRD EQU   TRMBYTE0                                                 01797000
TRMSNA   EQU   TRMBYTE0                                                 01798000
TRMGP    EQU   TRMBYTE0                                                 01799000
TRMDIAL  EQU   TRMBYTE0                                                 01800000
@NM00164 EQU   TRMBYTE0                                                 01801000
TRMOUTPT EQU   TRMBYTE0                                                 01802000
TRMINPUT EQU   TRMBYTE0                                                 01803000
TRMUDEF  EQU   TRMBYTE0                                                 01804000
TRMSTOTE EQU   TRMBYTE1                                                 01805000
TRMCKPRN EQU   TRMBYTE1                                                 01806000
TRMTSATN EQU   TRMBYTE1                                                 01807000
TRMTRACE EQU   TRMBYTE1                                                 01808000
TRMSWBCK EQU   TRMBYTE1                                                 01809000
TRMAUTOC EQU   TRMBYTE1                                                 01810000
TRMINPTP EQU   TRMBYTE1                                                 01811000
TRMWTNEG EQU   TRMSCPRQ                                                 01812000
TRMWRBRK EQU   TRMBYTE2                                                 01813000
TRMNOSND EQU   TRMBYTE2                                                 01814000
TRMPREP  EQU   TRMBYTE2                                                 01815000
TRMGPACT EQU   TRMBYTE2                                                 01816000
TRMANDL  EQU   TRMBYTE2                                                 01817000
TRMCLOSN EQU   TRMINPG                                                  01818000
TRMRSACT EQU   TRMBYTE2                                                 01819000
TRMOPTBL EQU   IEDQTRM+18                                               01820000
TRMOPNO  EQU   IEDQTRM+17                                               01821000
TRMCHCIN EQU   IEDQTRM+16                                               01822000
TRMSENSE EQU   TRMSTAT+3                                                01823000
TRMTEMPR EQU   TRMSTAT+2                                                01824000
TRMSIO   EQU   TRMSTAT                                                  01825000
@NM00163 EQU   TRMDEVFL+1                                               01826000
TRMTPIN  EQU   TRMDEVFL+1                                               01827000
TRMNCPI  EQU   TRMDEVFL+1                                               01828000
TRMRNTRM EQU   TRMDEVFL+1                                               01829000
@NM00162 EQU   TRMDEVFL+1                                               01830000
TRMLMD   EQU   TRMDEVFL+1                                               01831000
TRMCONC  EQU   TRMDEVFL+1                                               01832000
TRMTSOB  EQU   TRMDEVFL                                                 01833000
TRMBFDY  EQU   TRMDEVFL                                                 01834000
TRMTBLK  EQU   TRMDEVFL                                                 01835000
TRMSBLK  EQU   TRMDEVFL                                                 01836000
TRMBLKS  EQU   TRMDEVFL                                                 01837000
TRMADDC  EQU   TRMDEVFL                                                 01838000
TRMDDIG  EQU   TRMDEVFL                                                 01839000
TRMBUFS  EQU   TRMDEVFL                                                 01840000
TRMPRILK EQU   TRMALTD                                                  01841000
TRMLGB   EQU   TRMDSORG                                                 01842000
TRMUTERM EQU   TLISTCNT                                                 01843000
TRMDESTQ EQU   IEDQTRM+1                                                01844000
TRMSCNYN EQU   TRMSTATE                                                 01845000
TRMOPTFN EQU   TRMSTATE                                                 01846000
TRMHELDN EQU   TRMSTATE                                                 01847000
TRMACPTN EQU   TRMSTATE                                                 01848000
TRMPREF  EQU   TRMSTATE                                                 01849000
TRMPROC  EQU   TRMLOG                                                   01850000
TRMLIST  EQU   TRMLOG                                                   01851000
TRMLINE  EQU   TRMSTATE                                                 01852000
TNTTRMAD EQU   IEDTNTA                                                  01853000
TNTLEN   EQU   IEDQTNTD+44                                              01854000
TNTMIDEN EQU   IEDQTNTD+41                                              01855000
TNTSRCHX EQU   IEDQTNTD+38                                              01856000
@NM00161 EQU   IEDPRUND+4                                               01857000
PRUTHEFI EQU   PRUFIDN                                                  01858000
PRUTHUSS EQU   PRUFIDN                                                  01859000
PRUTHEIU EQU   PRUFIDN                                                  01860000
PRUTHBIU EQU   PRUFIDN                                                  01861000
PRUTHTYE EQU   PRUFIDN                                                  01862000
@NM00160 EQU   PRURHFG2                                                 01863000
PRURHCSI EQU   PRURHFG2                                                 01864000
@NM00159 EQU   PRURHFG2                                                 01865000
PRURHCDI EQU   PRURHFG2                                                 01866000
PRURHEB  EQU   PRURHFG2                                                 01867000
PRURHBB  EQU   PRURHFG2                                                 01868000
PRURHPI  EQU   PRURHFG1                                                 01869000
@NM00158 EQU   PRURHFG1                                                 01870000
PRURHER  EQU   PRURHFG1                                                 01871000
PRURHDR2 EQU   PRURHFG1                                                 01872000
@NM00157 EQU   PRURHFG1                                                 01873000
PRURHDR1 EQU   PRURHFG1                                                 01874000
PRURHEC  EQU   PRURHFG0                                                 01875000
PRURHBC  EQU   PRURHFG0                                                 01876000
PRURHSDI EQU   PRURHFG0                                                 01877000
PRURHFI  EQU   PRURHFG0                                                 01878000
@NM00156 EQU   PRURHFG0                                                 01879000
PRURUCAT EQU   PRURHFG0                                                 01880000
PRURHTYP EQU   PRURHFG0                                                 01881000
PRUDATA  EQU   IEDPRUQD+12                                              01882000
PRUNUNIT EQU   PRUTIC+1                                                 01883000
@NM00155 EQU   PRUTIC                                                   01884000
@NM00154 EQU   IEDPRUQD+4                                               01885000
PRUDATCT EQU   IEDPRUQD+2                                               01886000
PRUTTCIN EQU   IEDPRUQD                                                 01887000
@NM00153 EQU   OPREFLG3                                                 01888000
OPREATCH EQU   OPREFLG3                                                 01889000
@NM00152 EQU   OPREFLG3                                                 01890000
OPREFLG2 EQU   IEDOPRED+13                                              01891000
OPREFLG1 EQU   IEDOPRED+12                                              01892000
OPRETIC  EQU   OPRESAVE                                                 01893000
OPRELINK EQU   IEDOPRED+5                                               01894000
OPREPRI  EQU   IEDOPRED+4                                               01895000
OPREQCB  EQU   IEDOPRED+1                                               01896000
OPREKEY  EQU   IEDOPRED                                                 01897000
OPCBOTTM EQU   IEDQOPCD+1188                                            01898000
OPCDSRWT EQU   IEDQOPCD+1184                                            01899000
@NM00151 EQU   IEDQOPCD+1100                                            01900000
@NM00150 EQU   IEDQOPCD+948                                             01901000
@NM00149 EQU   IEDQOPCD+940                                             01902000
@NM00148 EQU   IEDQOPCD+380                                             01903000
@NM00147 EQU   OPCPWCOB+9                                               01904000
@NM00146 EQU   OPCPWCOB+8                                               01905000
@NM00145 EQU   OPCPWECB+1                                               01906000
OPCPWCCC EQU   OPCPWECB                                                 01907000
OPCPWCHN EQU   OPCPWQCB+1                                               01908000
OPCPWVTO EQU   OPCPWQCB                                                 01909000
OPCWAITV EQU   IEDQOPCD+364                                             01910000
OPCTOTCK EQU   IEDQOPCD+360                                             01911000
OPCAPXTL EQU   IEDQOPCD+356                                             01912000
OPCWRKSP EQU   IEDQOPCD+320                                             01913000
OPCRQCNT EQU   IEDQOPCD+316                                             01914000
OPPOLSTP EQU   IEDQOPCD+312                                             01915000
OPCCKCIB EQU   IEDQOPCD+308                                             01916000
OPCEND   EQU   IEDQOPCD+307                                             01917000
OPCSTCBS EQU   IEDQOPCD+306                                             01918000
OPCHNEND EQU   IEDQOPCD+302                                             01919000
OPCOQSW  EQU   IEDQOPCD+301                                             01920000
@NM00144 EQU   OPCSPEC                                                  01921000
@NM00143 EQU   OPCSPEC                                                  01922000
@NM00142 EQU   OPCSPEC                                                  01923000
@NM00141 EQU   OPCSPEC                                                  01924000
OPCFRMCA EQU   OPCSPEC                                                  01925000
OPCRSTRT EQU   OPCSPEC                                                  01926000
OPCPART  EQU   OPCSPEC                                                  01927000
OPCALTD  EQU   OPCSPEC                                                  01928000
OPCBFEND EQU   IEDQOPCD+296                                             01929000
OPCBFIRS EQU   IEDQOPCD+292                                             01930000
OPCAVBUF EQU   IEDQOPCD+290                                             01931000
OPCIPLCT EQU   IEDQOPCD+289                                             01932000
OPCCLNTS EQU   IEDQOPCD+288                                             01933000
OPCHA8   EQU   IEDQOPCD+286                                             01934000
OPCBFREQ EQU   IEDQOPCD+284                                             01935000
OPCNEXT  EQU   IEDQOPCD+272                                             01936000
OPCFMDFC EQU   IEDQOPCD+268                                             01937000
OPCSCNC  EQU   IEDQOPCD+264                                             01938000
OPCHORT  EQU   IEDQOPCD+256                                             01939000
OPCCKPTL EQU   IEDQOPCD+252                                             01940000
OPCCKPTF EQU   IEDQOPCD+248                                             01941000
OPCWAITA EQU   IEDQOPCD+244                                             01942000
OPCWAITR EQU   IEDQOPCD+240                                             01943000
OPCWAITP EQU   IEDQOPCD+236                                             01944000
OPCWAITO EQU   IEDQOPCD+232                                             01945000
OPCWAITN EQU   IEDQOPCD+228                                             01946000
OPCWAITL EQU   IEDQOPCD+224                                             01947000
OPCWAITC EQU   IEDQOPCD+220                                             01948000
@NM00140 EQU   OPCLDNME+5                                               01949000
@NM00139 EQU   OPCLDNME                                                 01950000
OPCWAIT  EQU   IEDQOPCD+192                                             01951000
OPCCKERB EQU   IEDQOPCD+164                                             01952000
OPCBFERB EQU   IEDQOPCD+148                                             01953000
OPCFLAG2 EQU   IEDQOPCD+147                                             01954000
OPCFLAG1 EQU   IEDQOPCD+146                                             01955000
OPCWRKSZ EQU   IEDQOPCD+144                                             01956000
OPCRSAVE EQU   IEDQOPCD+132                                             01957000
OPCQCBAD EQU   IEDQOPCD+128                                             01958000
OPCTRMWA EQU   IEDQOPCD+52                                              01959000
OPCPSTWT EQU   IEDQOPCD+48                                              01960000
OPCLCB   EQU   IEDQOPCD+36                                              01961000
@NM00138 EQU   IEDQOPCD+32                                              01962000
OPCIPLAD EQU   IEDQOPCD+28                                              01963000
OPCTOFLK EQU   IEDQOPCD+24                                              01964000
OPCOPTLK EQU   IEDQOPCD+20                                              01965000
OPCDCBLK EQU   IEDQOPCD+16                                              01966000
OPCDOUBL EQU   IEDQOPCD                                                 01967000
@NM00137 EQU   OCLDNME+4                                                01968000
@NM00136 EQU   OCPREFLG                                                 01969000
OCTOTEP  EQU   OCPREFLG                                                 01970000
OCREPOST EQU   OCPREFLG                                                 01971000
OCRSPSNT EQU   OCPREFLG                                                 01972000
OCBFREQ  EQU   OCPREFLG                                                 01973000
OCFORCE  EQU   OCREQFLG                                                 01974000
OCDCARD  EQU   OCREQFLG                                                 01975000
OCPARTAL EQU   OCREQFLG                                                 01976000
OCADNCP  EQU   OCREQFLG                                                 01977000
@NM00135 EQU   OCREQFLG                                                 01978000
@NM00134 EQU   OCREQFLG                                                 01979000
OCFLUSHZ EQU   OCREQFLG                                                 01980000
OCCKPTWA EQU   OCCKDATA+4                                               01981000
@NM00131 EQU   OCRSTGTM+2                                               01982000
OCCKDAT2 EQU   OCRSTGTM+1                                               01983000
OCCKDAT1 EQU   OCRSTGTM                                                 01984000
OCPUADR  EQU   OCIPLWA+2                                                01985000
OCWTGSAV EQU   OCIPLWA                                                  01986000
OCDVRDCT EQU   OCBACKUP+6                                               01987000
OCNCP    EQU   OCBACKUP+4                                               01988000
OCRESNUM EQU   OCPARM                                                   01989000
OCSEQ    EQU   OCTRUNIT+2                                               01990000
@NM00130 EQU   OCRSID+1                                                 01991000
OCNONE   EQU   OCALSTAT                                                 01992000
OCSOME   EQU   OCALSTAT                                                 01993000
OCALLFLG EQU   OCALSTAT                                                 01994000
OCSEQIND EQU   OCALSTAT                                                 01995000
OCDACTIP EQU   OCALSTAT                                                 01996000
OCRENTRD EQU   OCALSTAT                                                 01997000
OCWTGB   EQU   OCTIOT                                                   01998000
@NM00129 EQU   @NM00128+2                                               01999000
OCCONID  EQU   OCDEST                                                   02000000
OCRLN    EQU   IEDQOPCE+15                                              02001000
OCATTACH EQU   OCFLAG                                                   02002000
OCSSCP   EQU   OCFLAG                                                   02003000
OCOUTPUT EQU   OCFLAG                                                   02004000
OCLINE   EQU   OCFLAG                                                   02005000
OCMPP    EQU   OCFLAG                                                   02006000
OCCONSOL EQU   OCFLAG                                                   02007000
@NM00127 EQU   OCSWITCH                                                 02008000
OCQUCKN  EQU   OCSWITCH                                                 02009000
@NM00126 EQU   OCRUDEST+1                                               02010000
@NM00125 EQU   OCSCAN                                                   02011000
OCNOTUCB EQU   OCSCAN                                                   02012000
OCNONAME EQU   OCSCAN                                                   02013000
OCALLRLN EQU   OCSCAN                                                   02014000
OCDDNAME EQU   OCSCAN                                                   02015000
OCDDNRLN EQU   OCSCAN                                                   02016000
OCADDR   EQU   OCSCAN                                                   02017000
NCPLTRAC EQU   IEDNCP+26                                                02018000
NCPDPDCB EQU   IEDNCP+18                                                02019000
NCPTXID  EQU   IEDNCP+10                                                02020000
NCPBKUPN EQU   IEDNCP+2                                                 02021000
@NM00124 EQU   NCPFLAG1                                                 02022000
NCPTRACE EQU   NCPFLAG1                                                 02023000
NCPBKUP  EQU   NCPFLAG1                                                 02024000
NCPBGUP  EQU   NCPFLAG1                                                 02025000
NCPDAUTO EQU   NCPFLAG1                                                 02026000
NCPIAUTO EQU   NCPFLAG1                                                 02027000
NCPLEN   EQU   IEDNCP                                                   02028000
DCBINVLA EQU   DCBINVLI+1                                               02029000
@NM00123 EQU   DCBINVCI                                                 02030000
DCBINVB2 EQU   DCBINVCI                                                 02031000
@NM00122 EQU   DCBINVCI                                                 02032000
DCBINVB1 EQU   DCBINVCI                                                 02033000
@NM00121 EQU   DCBINVCI                                                 02034000
@NM00120 EQU   DCBRESER+2                                               02035000
DCBRESB2 EQU   DCBRESER+1                                               02036000
DCBRESB1 EQU   DCBRESER                                                 02037000
DCBBUFSI EQU   IHADCS43+6                                               02038000
DCBUNTCT EQU   IHADCS43+5                                               02039000
DCBILCT  EQU   IHADCS43+4                                               02040000
DCBSCTAD EQU   DCBSCTAB+1                                               02041000
@NM00119 EQU   DCBSCTAB                                                 02042000
DCBDEBA  EQU   DCBDEBAD+1                                               02043000
@NM00118 EQU   DCBIFLGS                                                 02044000
DCBIFIOE EQU   DCBIFLGS                                                 02045000
DCBCH12  EQU   DCBIFPCT                                                 02046000
DCBCH9   EQU   DCBIFPCT                                                 02047000
DCBIFEC  EQU   DCBIFLGS                                                 02048000
DCBMFSTI EQU   DCBMFDMD                                                 02049000
DCBMFAWR EQU   DCBMFSTK                                                 02050000
DCBMFUIP EQU   DCBMFTMD                                                 02051000
DCBMFIDW EQU   DCBMFLCP                                                 02052000
DCBMFWRK EQU   DCBMFMVP                                                 02053000
DCBMFRDQ EQU   DCBMFWRT                                                 02054000
DCBMFGTQ EQU   DCBMFPUT                                                 02055000
DCBMFSTL EQU   DCBMACF2                                                 02056000
DCBMFCK  EQU   DCBMFDMG                                                 02057000
DCBMFRDX EQU   DCBMFCHK                                                 02058000
DCBMFDBF EQU   DCBMFSBG                                                 02059000
DCBMFRDI EQU   DCBMFLCG                                                 02060000
DCBMFRDK EQU   DCBMFMVG                                                 02061000
DCBMFWRQ EQU   DCBMFRD                                                  02062000
DCBMFPTQ EQU   DCBMFGET                                                 02063000
DCBMFECP EQU   DCBMACF1                                                 02064000
DCBTIOT  EQU   IHADCS25                                                 02065000
DCBMRSTI EQU   DCBMRDMD                                                 02066000
DCBMRAWR EQU   DCBMRSTK                                                 02067000
DCBMRUIP EQU   DCBMRTMD                                                 02068000
DCBMRIDW EQU   DCBMRLCP                                                 02069000
DCBMRWRK EQU   DCBMRMVP                                                 02070000
DCBMRRDQ EQU   DCBMRWRT                                                 02071000
DCBMRGTQ EQU   DCBMRPUT                                                 02072000
DCBMRSTL EQU   DCBMACR2                                                 02073000
DCBMRCK  EQU   DCBMRDMG                                                 02074000
DCBPGFXA EQU   DCBMRRDX                                                 02075000
DCBMRDBF EQU   DCBMRSBG                                                 02076000
DCBMRRDI EQU   DCBMRLCG                                                 02077000
DCBMRRDK EQU   DCBMRMVG                                                 02078000
DCBMRWRQ EQU   DCBMRRD                                                  02079000
DCBMRPTQ EQU   DCBMRGET                                                 02080000
DCBMRECP EQU   DCBMACR1                                                 02081000
@NM00117 EQU   DCBIFLG                                                  02082000
DCBIBIOE EQU   DCBIFLG                                                  02083000
DCBICH12 EQU   DCBIBPCT                                                 02084000
DCBICH9  EQU   DCBIBPCT                                                 02085000
DCBIBEC  EQU   DCBIFLG                                                  02086000
DCBOFIOF EQU   DCBOFLGS                                                 02087000
DCBOFUEX EQU   DCBOFLGS                                                 02088000
DCBOFTM  EQU   DCBOFLGS                                                 02089000
DCBOFPPC EQU   DCBOFLGS                                                 02090000
DCBOFEOV EQU   DCBOFLGS                                                 02091000
DCBOFLRB EQU   DCBOFLGS                                                 02092000
DCBOFIOD EQU   DCBOFLWR                                                 02093000
DCBDDNAM EQU   IHADCS24                                                 02094000
DCBEXLSA EQU   DCBEXLST+1                                               02095000
DCBEIOBX EQU   DCBEXLST                                                 02096000
DCBLCBA  EQU   DCBLCBAD+1                                               02097000
DCBCPS   EQU   DCBCPRI                                                  02098000
DCBCPE   EQU   DCBCPRI                                                  02099000
DCBCPR   EQU   DCBCPRI                                                  02100000
@NM00116 EQU   DCBCPRI                                                  02101000
DCBTRANS EQU   DCBTRANA+1                                               02102000
@NM00115 EQU   DCBTRANA                                                 02103000
DCBIOBAA EQU   DCBIOBAD+1                                               02104000
DCBDEVTP EQU   DCBIOBAD                                                 02105000
@NM00114 EQU   IHADCS17+7                                               02106000
@NM00113 EQU   IHADCS17+6                                               02107000
@NM00112 EQU   IHADCS17+5                                               02108000
DCBINTVL EQU   IHADCS17+4                                               02109000
DCBCLPSA EQU   DCBCLPS+1                                                02110000
DCBBUFRQ EQU   DCBCLPS                                                  02111000
DCBBUFMA EQU   IHADCS16+8                                               02112000
@NM00111 EQU   DCBDSRG2                                                 02113000
DCBDSGTR EQU   DCBDSRG2                                                 02114000
DCBACBM  EQU   DCBDSRG2                                                 02115000
@NM00110 EQU   DCBDSRG2                                                 02116000
DCBDSGTQ EQU   DCBDSRG2                                                 02117000
DCBDSGTX EQU   DCBDSRG2                                                 02118000
DCBDSGGS EQU   DCBDSRG2                                                 02119000
DCBDSGU  EQU   DCBDSRG1                                                 02120000
DCBDSGPO EQU   DCBDSRG1                                                 02121000
@NM00109 EQU   DCBDSRG1                                                 02122000
@NM00108 EQU   DCBDSRG1                                                 02123000
DCBDSGCX EQU   DCBDSRG1                                                 02124000
DCBDSGDA EQU   DCBDSRG1                                                 02125000
DCBDSGPS EQU   DCBDSRG1                                                 02126000
DCBDSGIS EQU   DCBDSRG1                                                 02127000
DCBPCIR2 EQU   DCBPCI                                                   02128000
DCBPCIR1 EQU   DCBPCI                                                   02129000
DCBPCIN2 EQU   DCBPCI                                                   02130000
DCBPCIN1 EQU   DCBPCI                                                   02131000
DCBPCIA2 EQU   DCBPCI                                                   02132000
DCBPCIA1 EQU   DCBPCI                                                   02133000
DCBPCIX2 EQU   DCBPCI                                                   02134000
DCBPCIX1 EQU   DCBPCI                                                   02135000
@NM00107 EQU   IHADCS16+4                                               02136000
DCBMH    EQU   DCBMHA+1                                                 02137000
DCBBFOUT EQU   DCBBUFIN                                                 02138000
DCBBFIN  EQU   DCBBUFIN                                                 02139000
@NM00106 EQU   IHADCB                                                   02140000
SAVTLLCB EQU   IEDNSVTD+316                                             02141000
SAVTBITN EQU   IEDNSVTD+312                                             02142000
@NM00105 EQU   SAVTCKQB+8                                               02143000
@NM00104 EQU   SAVTCKEC+1                                               02144000
@NM00103 EQU   SAVTCKCC                                                 02145000
SAVTCKPO EQU   SAVTCKCC                                                 02146000
SAVTCKWA EQU   SAVTCKCC                                                 02147000
SAVTCKCH EQU   SAVTCKTB+1                                               02148000
SAVTCKVT EQU   SAVTCKTB                                                 02149000
@NM00102 EQU   IEDNSVTD+297                                             02150000
SAVTRDFG EQU   SAVTRDRV+12                                              02151000
@NM00101 EQU   SAVTRDRV+5                                               02152000
SAVTRDPY EQU   SAVTRDRV+4                                               02153000
SAVTRDQB EQU   SAVTRDRV+1                                               02154000
SAVTRDKY EQU   SAVTRDRV                                                 02155000
SAVTNID  EQU   IEDNSVTD+280                                             02156000
SAVTDVAS EQU   IEDNSVTD+276                                             02157000
SAVTPLSZ EQU   IEDNSVTD+274                                             02158000
@NM00100 EQU   IEDNSVTD+273                                             02159000
SAVTSUBL EQU   IEDNSVTD+272                                             02160000
@NM00099 EQU   SAVTZELM+1                                               02161000
SAVTSUBM EQU   SAVTZELM                                                 02162000
SAVTMHDX EQU   IEDNSVTD+268                                             02163000
SAVTNAT1 EQU   IEDNSVTD+266                                             02164000
SAVTSH20 EQU   IEDNSVTD+264                                             02165000
SAVTLCBS EQU   IEDNSVTD+260                                             02166000
SAVTRNMP EQU   IEDNSVTD+256                                             02167000
SAVTTNTX EQU   IEDNSVTD+252                                             02168000
SAVTNAX  EQU   IEDNSVTD+248                                             02169000
SAVTSUBV EQU   IEDNSVTD+247                                             02170000
SAVTSUBA EQU   IEDNSVTD+246                                             02171000
SAVTSIBC EQU   IEDNSVTD+244                                             02172000
SAVTBSM  EQU   IEDNSVTD+240                                             02173000
SAVTSCPT EQU   SAVTTCPU                                                 02174000
SAVTRQTG EQU   IEDNSVTD+236                                             02175000
SAVTRQCH EQU   IEDNSVTD+232                                             02176000
SAVTMAND EQU   IEDNSVTD+228                                             02177000
SAVTSPLN EQU   IEDNSVTD+224                                             02178000
SAVTNADL EQU   IEDNSVTD+222                                             02179000
SAVTNATL EQU   IEDNSVTD+220                                             02180000
SAVTMHTB EQU   IEDNSVTD+216                                             02181000
SAVTSSMH EQU   IEDNSVTD+212                                             02182000
SAVTQRS  EQU   IEDNSVTD+208                                             02183000
SAVTRQIN EQU   IEDNSVTD+204                                             02184000
SAVTDFCO EQU   IEDNSVTD+200                                             02185000
SAVTSAO  EQU   IEDNSVTD+196                                             02186000
SAVTSARI EQU   IEDNSVTD+192                                             02187000
SAVTSAC  EQU   IEDNSVTD+188                                             02188000
SAVTSAI  EQU   IEDNSVTD+184                                             02189000
SAVTCSCI EQU   IEDNSVTD+180                                             02190000
SAVTSSRP EQU   IEDNSVTD+176                                             02191000
SAVTSSRQ EQU   IEDNSVTD+172                                             02192000
SAVTSCLU EQU   IEDNSVTD+168                                             02193000
SAVTXTRQ EQU   IEDNSVTD+164                                             02194000
SAVTMVBF EQU   IEDNSVTD+160                                             02195000
@NM00098 EQU   IEDNSVTD+148                                             02196000
SAVTIPCQ EQU   IEDNSVTD+144                                             02197000
@NM00097 EQU   IEDNSVTD+136                                             02198000
SAVTXFMI EQU   IEDNSVTD+132                                             02199000
@NM00096 EQU   IEDNSVTD+124                                             02200000
SAVTXFMO EQU   IEDNSVTD+120                                             02201000
@NM00095 EQU   IEDNSVTD+116                                             02202000
SAVTSSSR EQU   IEDNSVTD+112                                             02203000
SAVTSCPQ EQU   IEDNSVTD+108                                             02204000
SAVTSLCB EQU   IEDNSVTD+104                                             02205000
SAVTLUSR EQU   IEDNSVTD+100                                             02206000
@NM00094 EQU   SAVTLUSQ+8                                               02207000
SAVTLUSP EQU   SAVTLUSQ+4                                               02208000
SAVTLUSB EQU   SAVTLUSQ                                                 02209000
@NM00093 EQU   IEDNSVTD+84                                              02210000
SAVTSAT  EQU   IEDNSVTD+80                                              02211000
SAVTNAT  EQU   IEDNSVTD+76                                              02212000
SAVTCLUP EQU   IEDNSVTD+72                                              02213000
SAVTPIUT EQU   IEDNSVTD+68                                              02214000
SAVTRNTA EQU   IEDNSVTD+64                                              02215000
SAVTDNIR EQU   IEDNSVTD+60                                              02216000
SAVTCNIR EQU   IEDNSVTD+56                                              02217000
SAVTFLDH EQU   IEDNSVTD+52                                              02218000
SAVTSRTN EQU   IEDNSVTD+48                                              02219000
SAVTSREQ EQU   IEDNSVTD+44                                              02220000
SAVTFAIL EQU   IEDNSVTD+42                                              02221000
SAVTSUSE EQU   IEDNSVTD+40                                              02222000
SAVTSIB  EQU   IEDNSVTD+36                                              02223000
SAVTPRTN EQU   IEDNSVTD+32                                              02224000
@NM00092 EQU   IEDNSVTD+28                                              02225000
SAVTWH20 EQU   IEDNSVTD+26                                              02226000
SAVTPWT  EQU   IEDNSVTD+24                                              02227000
SAVTPRTQ EQU   IEDNSVTD+20                                              02228000
SAVTPREQ EQU   IEDNSVTD+16                                              02229000
SAVTPH20 EQU   IEDNSVTD+14                                              02230000
SAVTPUSE EQU   IEDNSVTD+12                                              02231000
SAVTPLCB EQU   IEDNSVTD+8                                               02232000
SAVTPOOL EQU   IEDNSVTD+4                                               02233000
SAVTPRMT EQU   SAVTDIAF                                                 02234000
SAVTVIRT EQU   SAVTDIAF                                                 02235000
AVTCPBNO EQU   IEDQAVTD+1244                                            02236000
AVTHRESS EQU   IEDQAVTD+1243                                            02237000
@NM00091 EQU   IEDQAVTD+1242                                            02238000
@NM00090 EQU   IEDQAVTD+1241                                            02239000
@NM00089 EQU   IEDQAVTD+1240                                            02240000
@NM00088 EQU   IEDQAVTD+1237                                            02241000
@NM00087 EQU   IEDQAVTD+1236                                            02242000
AVTHRESE EQU   @NM00086                                                 02243000
AVTRADDR EQU   IEDQAVTD+1228                                            02244000
AVTNADDR EQU   IEDQAVTD+1224                                            02245000
AVTHRESN EQU   IEDQAVTD+1220                                            02246000
AVTVOLRN EQU   IEDQAVTD+1216                                            02247000
AVTTOTNN EQU   IEDQAVTD+1212                                            02248000
AVTTRCYN EQU   IEDQAVTD+1208                                            02249000
AVTRCTRN EQU   IEDQAVTD+1204                                            02250000
AVTNOVON EQU   IEDQAVTD+1200                                            02251000
AVTADEBN EQU   IEDQAVTD+1196                                            02252000
AVTVOLRR EQU   IEDQAVTD+1192                                            02253000
AVTTOTNR EQU   IEDQAVTD+1188                                            02254000
AVTTRCYR EQU   IEDQAVTD+1184                                            02255000
AVTRCTRR EQU   IEDQAVTD+1180                                            02256000
AVTNOVOR EQU   IEDQAVTD+1176                                            02257000
AVTADEBR EQU   IEDQAVTD+1172                                            02258000
AVTLODPT EQU   IEDQAVTD+1168                                            02259000
AVTIOBN  EQU   IEDQAVTD+1164                                            02260000
AVTIOBR  EQU   IEDQAVTD+1160                                            02261000
AVTCPBPT EQU   IEDQAVTD+1156                                            02262000
AVTFCPB  EQU   IEDQAVTD+1152                                            02263000
@NM00085 EQU   IEDQAVTD+1148                                            02264000
AVTINCPQ EQU   IEDQAVTD+1144                                            02265000
@NM00084 EQU   IEDQAVTD+1140                                            02266000
@NM00083 EQU   IEDQAVTD+1137                                            02267000
@NM00082 EQU   AVTBIT4                                                  02268000
@NM00081 EQU   AVTBIT4                                                  02269000
@NM00080 EQU   AVTBIT4                                                  02270000
@NM00079 EQU   AVTBIT4                                                  02271000
@NM00078 EQU   AVTBIT4                                                  02272000
@NM00077 EQU   AVTBIT4                                                  02273000
@NM00076 EQU   AVTBIT4                                                  02274000
AVTRUFTN EQU   AVTBIT4                                                  02275000
@NM00075 EQU   IEDQAVTD+1132                                            02276000
AVTNOBFQ EQU   IEDQAVTD+1128                                            02277000
@NM00074 EQU   IEDQAVTD+1124                                            02278000
AVTDKENQ EQU   IEDQAVTD+1120                                            02279000
@NM00073 EQU   IEDQAVTD+1116                                            02280000
AVTDKAPQ EQU   IEDQAVTD+1112                                            02281000
AVTCOPY  EQU   IEDQAVTD+1108                                            02282000
AVTIA    EQU   IEDQAVTD+1104                                            02283000
AVTFL    EQU   IEDQAVTD+1100                                            02284000
@NM00072 EQU   IEDQAVTD+1096                                            02285000
AVTNCPBQ EQU   IEDQAVTD+1092                                            02286000
AVTTOTNC EQU   IEDQAVTD+1088                                            02287000
AVTCMAX  EQU   IEDQAVTD+1084                                            02288000
AVTCMIN  EQU   IEDQAVTD+1080                                            02289000
AVTHM02  EQU   IEDQAVTD+1076                                            02290000
AVTOPCIN EQU   IEDQAVTD+1074                                            02291000
AVTDCTLN EQU   IEDQAVTD+1072                                            02292000
AVTOPMSK EQU   IEDQAVTD+1068                                            02293000
AVTSTEAL EQU   IEDQAVTD+1060                                            02294000
AVTOPTN  EQU   IEDQAVTD+1056                                            02295000
AVTDSKCT EQU   IEDQAVTD+1054                                            02296000
AVTCKRST EQU   IEDQAVTD+1053                                            02297000
AVTSTAN  EQU   AVTBIT3                                                  02298000
AVTSTACN EQU   AVTBIT3                                                  02299000
AVTSTAIN EQU   AVTBIT3                                                  02300000
AVTSTAYN EQU   AVTBIT3                                                  02301000
AVTOLTBN EQU   AVTBIT3                                                  02302000
AVTTSAB  EQU   AVTBIT3                                                  02303000
AVTRFULN EQU   AVTBIT3                                                  02304000
AVTRECVN EQU   AVTBIT3                                                  02305000
@NM00071 EQU   AVTBIT2                                                  02306000
@NM00070 EQU   AVTBIT2                                                  02307000
AVTOPEIN EQU   AVTBIT2                                                  02308000
AVTSTRTN EQU   AVTBIT2                                                  02309000
AVTTOPOL EQU   AVTBIT2                                                  02310000
AVTCOPYN EQU   AVTBIT2                                                  02311000
AVTREUSN EQU   AVTBIT2                                                  02312000
AVTEXTSC EQU   AVTBIT2                                                  02313000
AVTDISKN EQU   AVTBIT1                                                  02314000
AVTQUCKN EQU   AVTBIT1                                                  02315000
AVTCLOSN EQU   AVTBIT1                                                  02316000
AVTREADN EQU   AVTBIT1                                                  02317000
AVTDLAYN EQU   AVTBIT1                                                  02318000
AVTAQTAN EQU   AVTBIT1                                                  02319000
AVTTSON  EQU   AVTBIT1                                                  02320000
AVTAPLKN EQU   AVTBIT1                                                  02321000
AVTDUMBR EQU   IEDQAVTD+1048                                            02322000
AVTDLQX  EQU   IEDQAVTD+1046                                            02323000
AVTINTLV EQU   IEDQAVTD+1044                                            02324000
AVTSMCNT EQU   IEDQAVTD+1042                                            02325000
AVTAVFCT EQU   IEDQAVTD+1040                                            02326000
AVTOPCON EQU   IEDQAVTD+1038                                            02327000
AVTOPCNT EQU   IEDQAVTD+1036                                            02328000
AVTLNCNT EQU   IEDQAVTD+1034                                            02329000
AVTKEYLE EQU   IEDQAVTD+1032                                            02330000
AVTHA16  EQU   IEDQAVTD+1030                                            02331000
AVTHA7   EQU   IEDQAVTD+1028                                            02332000
AVTHA4   EQU   IEDQAVTD+1026                                            02333000
AVTHA3   EQU   IEDQAVTD+1024                                            02334000
AVTHA2   EQU   IEDQAVTD+1022                                            02335000
AVTGETMS EQU   IEDQAVTD+1021                                            02336000
@NM00069 EQU   IEDQAVTD+1020                                            02337000
AVTGETMD EQU   IEDQAVTD+1016                                            02338000
AVTGETMN EQU   IEDQAVTD+1012                                            02339000
AVTCWTOT EQU   IEDQAVTD+1008                                            02340000
AVTCWINT EQU   IEDQAVTD+956                                             02341000
AVTDTRAP EQU   IEDQAVTD+952                                             02342000
@NM00068 EQU   IEDQAVTD+950                                             02343000
@NM00067 EQU   AVTIOTR                                                  02344000
AVTIOTRH EQU   AVTIOTR                                                  02345000
AVTIOTRE EQU   AVTIOTR                                                  02346000
@NM00066 EQU   AVTSUBT                                                  02347000
AVTSUBPT EQU   AVTSUBT                                                  02348000
AVTSUBON EQU   AVTSUBT                                                  02349000
AVTAFE30 EQU   IEDQAVTD+944                                             02350000
AVTAFE20 EQU   IEDQAVTD+940                                             02351000
AVTAFE10 EQU   IEDQAVTD+936                                             02352000
AVTCWEC2 EQU   IEDQAVTD+932                                             02353000
AVTCWPM2 EQU   IEDQAVTD+928                                             02354000
AVTCWTS2 EQU   IEDQAVTD+927                                             02355000
AVTCWTS1 EQU   IEDQAVTD+926                                             02356000
AVTCWCLD EQU   AVTCWFL2                                                 02357000
AVTCWRAP EQU   AVTCWFL2                                                 02358000
@NM00065 EQU   AVTCWFL2                                                 02359000
@NM00064 EQU   AVTCWFL2                                                 02360000
@NM00063 EQU   AVTCWFL2                                                 02361000
@NM00062 EQU   AVTCWFL2                                                 02362000
@NM00061 EQU   AVTCWFL2                                                 02363000
AVTCWACT EQU   AVTCWFL2                                                 02364000
@NM00060 EQU   AVTCWFL1                                                 02365000
@NM00059 EQU   AVTCWFL1                                                 02366000
@NM00058 EQU   AVTCWFL1                                                 02367000
@NM00057 EQU   AVTCWFL1                                                 02368000
@NM00056 EQU   AVTCWFL1                                                 02369000
@NM00055 EQU   AVTCWFL1                                                 02370000
@NM00054 EQU   AVTCWFL1                                                 02371000
AVTCOMWN EQU   AVTCWFL1                                                 02372000
AVTCWEC1 EQU   IEDQAVTD+920                                             02373000
AVTCWPM1 EQU   IEDQAVTD+916                                             02374000
AVTCAREA EQU   IEDQAVTD+912                                             02375000
AVTFZERO EQU   IEDQAVTD+908                                             02376000
AVTCADDR EQU   IEDQAVTD+904                                             02377000
AVTCOREC EQU   IEDQAVTD+900                                             02378000
@NM00053 EQU   IEDQAVTD+892                                             02379000
AVTCPBCB EQU   IEDQAVTD+888                                             02380000
@NM00052 EQU   IEDQAVTD+880                                             02381000
AVTDSIOB EQU   IEDQAVTD+876                                             02382000
@NM00051 EQU   IEDQAVTD+868                                             02383000
AVTCPRMB EQU   IEDQAVTD+864                                             02384000
@NM00050 EQU   IEDQAVTD+856                                             02385000
AVTCLOSB EQU   IEDQAVTD+852                                             02386000
@NM00049 EQU   IEDQAVTD+844                                             02387000
AVTACTIB EQU   IEDQAVTD+840                                             02388000
@NM00048 EQU   IEDQAVTD+836                                             02389000
AVTOLTEB EQU   IEDQAVTD+832                                             02390000
AVTOLTCH EQU   AVTOLTQB+1                                               02391000
AVTOLTVT EQU   AVTOLTQB                                                 02392000
@NM00047 EQU   AVTOPCQB+8                                               02393000
@NM00046 EQU   AVTOPCEC+1                                               02394000
@NM00045 EQU   AVTOPCCC                                                 02395000
AVTOPCPO EQU   AVTOPCCC                                                 02396000
AVTOPCWA EQU   AVTOPCCC                                                 02397000
AVTOPCCH EQU   AVTOPCOB+1                                               02398000
AVTOPCVT EQU   AVTOPCOB                                                 02399000
@NM00044 EQU   AVTCKPQB+9                                               02400000
AVTCKPTS EQU   AVTCKPQB+8                                               02401000
@NM00043 EQU   AVTCKPEC+1                                               02402000
@NM00042 EQU   AVTCKPCC                                                 02403000
AVTCKPPO EQU   AVTCKPCC                                                 02404000
AVTCKPWA EQU   AVTCKPCC                                                 02405000
AVTCKPCH EQU   AVTCKPTB+1                                               02406000
AVTCKPVT EQU   AVTCKPTB                                                 02407000
@NM00041 EQU   IEDQAVTD+796                                             02408000
AVTBFRTB EQU   IEDQAVTD+792                                             02409000
@NM00040 EQU   IEDQAVTD+788                                             02410000
AVTSELCH EQU   IEDQAVTD+785                                             02411000
AVTBFRTN EQU   AVTBFRFG                                                 02412000
AVTBFREB EQU   IEDQAVTD+780                                             02413000
AVTTIMQ  EQU   IEDQAVTD+776                                             02414000
@NM00039 EQU   IEDQAVTD+772                                             02415000
AVTIMQPS EQU   IEDQAVTD+768                                             02416000
AVTINOUT EQU   IEDQAVTD+766                                             02417000
AVTREFTM EQU   IEDQAVTD+764                                             02418000
@NM00038 EQU   IEDQAVTD+752                                             02419000
AVTDELYB EQU   IEDQAVTD+748                                             02420000
AVTOCQPT EQU   IEDQAVTD+744                                             02421000
AVTTSOPT EQU   IEDQAVTD+740                                             02422000
AVTSUPPT EQU   IEDQAVTD+736                                             02423000
AVTCBQCB EQU   IEDQAVTD+732                                             02424000
AVTMSGS  EQU   IEDQAVTD+729                                             02425000
@NM00037 EQU   AVTSYSER                                                 02426000
@NM00036 EQU   AVTSYSER                                                 02427000
@NM00035 EQU   AVTSYSER                                                 02428000
@NM00034 EQU   AVTSYSER                                                 02429000
@NM00033 EQU   AVTSYSER                                                 02430000
@NM00032 EQU   AVTSYSER                                                 02431000
AVTCMAXN EQU   AVTSYSER                                                 02432000
AVTCMINN EQU   AVTSYSER                                                 02433000
AVT2260L EQU   IEDQAVTD+724                                             02434000
AVTABEPL EQU   AVTADBUF                                                 02435000
AVTHFF   EQU   AVTCLRHI+2                                               02436000
@NM00031 EQU   AVTCLRHI                                                 02437000
AVTCCLNK EQU   AVTCRELE+5                                               02438000
AVTCCPRI EQU   AVTCRELE+4                                               02439000
AVTCCQCB EQU   AVTCCELE+1                                               02440000
AVTCCKEY EQU   AVTCCELE                                                 02441000
AVTDELAD EQU   IEDQAVTD+704                                             02442000
AVTDELEM EQU   IEDQAVTD+700                                             02443000
AVTBSX   EQU   AVTCKLNK                                                 02444000
AVTOPETR EQU   AVTHG01                                                  02445000
@NM00030 EQU   AVTCKBYT                                                 02446000
AVTCKONQ EQU   AVTCKBYT                                                 02447000
@NM00029 EQU   AVTCKBYT                                                 02448000
@NM00028 EQU   AVTCKBYT                                                 02449000
@NM00027 EQU   AVTCKBYT                                                 02450000
@NM00026 EQU   AVTCKBYT                                                 02451000
@NM00025 EQU   AVTCKBYT                                                 02452000
@NM00024 EQU   AVTCKBYT                                                 02453000
AVTOPERT EQU   IEDQAVTD+690                                             02454000
AVTOPXCL EQU   IEDQAVTD+688                                             02455000
AVTOPERL EQU   IEDQAVTD+687                                             02456000
@NM00023 EQU   IEDQAVTD+686                                             02457000
AVTCKTIM EQU   IEDQAVTD+684                                             02458000
AVTCKELV EQU   IEDQAVTD+682                                             02459000
AVTCPRCD EQU   IEDQAVTD+681                                             02460000
AVTWARMN EQU   AVTCKELF                                                 02461000
AVTCRTLN EQU   AVTCKELF                                                 02462000
AVTCPIPN EQU   AVTCKELF                                                 02463000
AVTCCLCN EQU   AVTCKELF                                                 02464000
AVTCINCN EQU   AVTCKELF                                                 02465000
@NM00022 EQU   AVTCKELF                                                 02466000
AVTCMCPN EQU   AVTCKELF                                                 02467000
AVTNQBCK EQU   AVTCKELF                                                 02468000
AVTCKQAD EQU   IEDQAVTD+677                                             02469000
AVTSCBSZ EQU   IEDQAVTD+676                                             02470000
@NM00021 EQU   IEDQAVTD+672                                             02471000
AVTCKELE EQU   IEDQAVTD+668                                             02472000
@NM00020 EQU   AVTCKPEL+8                                               02473000
AVTCKRLK EQU   AVTCKPEL+5                                               02474000
AVTCKRPR EQU   AVTCKPEL+4                                               02475000
AVTCKRMQ EQU   AVTCKRMV+1                                               02476000
AVTCKRKY EQU   AVTCKRMV                                                 02477000
AVTHK    EQU   IEDQAVTD+648                                             02478000
AVTHI    EQU   IEDQAVTD+644                                             02479000
AVTIOT   EQU   IEDQAVTD+640                                             02480000
AVTNX    EQU   IEDQAVTD+636                                             02481000
AVTTONE  EQU   IEDQAVTD+632                                             02482000
AVTA3TL  EQU   IEDQAVTD+628                                             02483000
AVTDMECB EQU   IEDQAVTD+624                                             02484000
AVTABEND EQU   IEDQAVTD+618                                             02485000
AVTPLCBN EQU   IEDQAVTD+616                                             02486000
@NM00019 EQU   AVTSAVTP+1                                               02487000
@NM00018 EQU   AVTSAVTF                                                 02488000
AVTSNA   EQU   AVTSAVTF                                                 02489000
AVTONSNA EQU   AVTSAVTF                                                 02490000
AVTVTMCP EQU   AVTSAVTF                                                 02491000
@NM00017 EQU   IEDQAVTD+608                                             02492000
AVTCMBSS EQU   IEDQAVTD+604                                             02493000
AVTRCV   EQU   IEDQAVTD+600                                             02494000
AVTSEND  EQU   IEDQAVTD+596                                             02495000
AVTCSCH  EQU   IEDQAVTD+592                                             02496000
AVTQ1    EQU   IEDQAVTD+588                                             02497000
AVTE7    EQU   IEDQAVTD+584                                             02498000
AVTHB    EQU   IEDQAVTD+580                                             02499000
AVTR1    EQU   IEDQAVTD+576                                             02500000
AVTBZ    EQU   IEDQAVTD+572                                             02501000
AVTEZ    EQU   IEDQAVTD+568                                             02502000
AVTEC    EQU   IEDQAVTD+564                                             02503000
AVTEW    EQU   IEDQAVTD+560                                             02504000
AVTNDIAL EQU   AVTSCOPT                                                 02505000
AVTN2741 EQU   AVTSCOPT                                                 02506000
AVTCONCO EQU   AVTSCOPT                                                 02507000
AVTCONC  EQU   AVTSCOPT                                                 02508000
AVTCMBUF EQU   AVTSCOPT                                                 02509000
AVTAPDMP EQU   AVTSCOPT                                                 02510000
@NM00016 EQU   AVTSCOPT                                                 02511000
AVTHA    EQU   AVTDISP                                                  02512000
AVTEA    EQU   IEDQAVTD+548                                             02513000
AVTAX    EQU   IEDQAVTD+544                                             02514000
AVTA3    EQU   IEDQAVTD+540                                             02515000
AVTGD    EQU   IEDQAVTD+536                                             02516000
AVTAL    EQU   IEDQAVTD+532                                             02517000
AVTOLTST EQU   AVTHG02                                                  02518000
AVTE8    EQU   IEDQAVTD+524                                             02519000
AVTUI    EQU   IEDQAVTD+520                                             02520000
AVTCOMPT EQU   IEDQAVTD+516                                             02521000
AVTCRSRF EQU   IEDQAVTD+512                                             02522000
@NM00015 EQU   IEDQAVTD+508                                             02523000
AVTKA02  EQU   IEDQAVTD+504                                             02524000
AVTOPTPT EQU   IEDQAVTD+500                                             02525000
AVTPCBPT EQU   IEDQAVTD+496                                             02526000
@NM00014 EQU   AVTECB1                                                  02527000
AVTCOMP  EQU   AVTECB1                                                  02528000
@NM00013 EQU   AVTECB1                                                  02529000
AVTOPECA EQU   IEDQAVTD+488                                             02530000
AVTOLECA EQU   IEDQAVTD+484                                             02531000
AVTCKECA EQU   IEDQAVTD+480                                             02532000
AVTCWECA EQU   IEDQAVTD+476                                             02533000
AVTCWTCB EQU   IEDQAVTD+472                                             02534000
AVTOLTCB EQU   IEDQAVTD+468                                             02535000
AVTOCTCB EQU   IEDQAVTD+464                                             02536000
AVTCKTCB EQU   IEDQAVTD+460                                             02537000
AVTAS    EQU   IEDQAVTD+456                                             02538000
AVTNCKPR EQU   IEDQAVTD+453                                             02539000
AVTCIB   EQU   IEDQAVTD+452                                             02540000
AVTSPLPT EQU   IEDQAVTD+448                                             02541000
AVTMVBFR EQU   IEDQAVTD+444                                             02542000
AVTSBTA  EQU   IEDQAVTD+440                                             02543000
AVTRARTN EQU   IEDQAVTD+436                                             02544000
AVTBSCAN EQU   IEDQAVTD+432                                             02545000
AVTRDYA  EQU   IEDQAVTD+428                                             02546000
AVTDISTR EQU   IEDQAVTD+420                                             02547000
AVTPARM3 EQU   IEDQAVTD+416                                             02548000
@NM00012 EQU   AVTPKF                                                   02549000
@NM00011 EQU   AVTPKF                                                   02550000
@NM00010 EQU   AVTPKF                                                   02551000
AVTFTCHF EQU   AVTPKF                                                   02552000
@NM00009 EQU   AVTPKF                                                   02553000
@NM00008 EQU   AVTPKF                                                   02554000
@NM00007 EQU   AVTPKF                                                   02555000
@NM00006 EQU   AVTPKF                                                   02556000
AVTPARM  EQU   IEDQAVTD+408                                             02557000
AVTEXS2A EQU   IEDQAVTD+402                                             02558000
AVTEXA2S EQU   IEDQAVTD+396                                             02559000
AVTOCGET EQU   IEDQAVTD+392                                             02560000
AVTCKAVT EQU   @NM00004+1                                               02561000
@NM00005 EQU   AVTCKFLG                                                 02562000
AVTCKHLT EQU   AVTCKFLG                                                 02563000
AVTCKREQ EQU   AVTCKFLG                                                 02564000
AVTCKENV EQU   AVTCKFLG                                                 02565000
AVTCKNAC EQU   AVTCKFLG                                                 02566000
AVTCKTAC EQU   AVTCKFLG                                                 02567000
AVTBUENT EQU   IEDQAVTD+386                                             02568000
@NM00003 EQU   IEDQAVTD+385                                             02569000
AVTFULLT EQU   AVTBUFSW                                                 02570000
AVTUNCON EQU   AVTBUFSW                                                 02571000
@NM00002 EQU   AVTBUFSW                                                 02572000
AVTBUFTR EQU   AVTREADD                                                 02573000
AVTREADY EQU   IEDQAVTD+376                                             02574000
AVTRACE  EQU   IEDQAVTD+372                                             02575000
AVTTCB   EQU   IEDQAVTD+368                                             02576000
AVTPASWD EQU   IEDQAVTD+360                                             02577000
AVTCTLCH EQU   IEDQAVTD+352                                             02578000
AVTDOUBL EQU   IEDQAVTD+344                                             02579000
AVTDOUBX EQU   IEDQAVTD+336                                             02580000
AVTDPARM EQU   IEDQAVTD+332                                             02581000
AVTCSTCS EQU   IEDQAVTD+328                                             02582000
AVTDLQ   EQU   AVTSAVEX+32                                              02583000
@NM00001 EQU   AVTSAVEX                                                 02584000
AVTSAVE4 EQU   IEDQAVTD+216                                             02585000
AVTSAVE3 EQU   IEDQAVTD+144                                             02586000
AVTSAVE2 EQU   IEDQAVTD+72                                              02587000
AVTSAVE1 EQU   IEDQAVTD                                                 02588000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02589000
@RT00382 EQU   @RC00381                                                 02590000
@RC00385 EQU   @RC00381                                                 02591000
@RC00466 EQU   @RC00379                                                 02592000
@RC00567 EQU   @RC00558                                                 02593000
@RT00565 EQU   @RC00558                                                 02594000
@RC00559 EQU   @RC00558                                                 02595000
@RC00750 EQU   @EL00007                                                 02596000
@RC00745 EQU   @EL00007                                                 02597000
@RC00738 EQU   @EL00007                                                 02598000
@RC00733 EQU   @EL00007                                                 02599000
@RC00404 EQU   @RC00385                                                 02600000
@RC00415 EQU   @RC00385                                                 02601000
@RC00483 EQU   @RC00466                                                 02602000
@RC00560 EQU   @RC00559                                                 02603000
@RC00741 EQU   @RC00738                                                 02604000
@RC00486 EQU   @RC00483                                                 02605000
@RC00504 EQU   @RC00483                                                 02606000
@RC00561 EQU   @RC00560                                                 02607000
@ENDDATA EQU   *                                                        02608000
         END   IGCFJ10D,(C'PLS1251',0701,78123)                         02609000
