         TITLE 'IGCMR10D-SWAP DEVICE ID'                                00001000
IGCMR10D CSECT ,                                                   0001 00002000
@PROLOG  DS    0H                                                  0002 00003000
         BALR  RBASE,0                  BASE REGISTER                   00004000
         USING *,RBASE                                                  00005000
IGCMR10D IEDHJN  SKIPID                                                 00006000
*   ROPCAVT=RPARM;                  /* SET OP CTL AVT BASE           */ 00007000
         LR    ROPCAVT,RPARM                                       0332 00008000
*   RESPECIFY                                                      0333 00009000
*     RPARM UNRSTD;                 /*                       @Y17XART*/ 00010000
*   ROPCE=OPCCOPCE;                 /* ELEMENT ADDRESS               */ 00011000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                            0334 00012000
*   GEN;                                                           0335 00013000
         LM    ROPCE,RWORK9,OPCSAVE(ROPCAVT) PARMS FROM SCAN MODULE     00014000
*   IF RLEN<=MAXLEN THEN            /* IS REMNDER OF CMD     @XA06346   00015000
*                                      LESS THAN OR EQUAL@XA06346 TO    00016000
*                                      MAX LNG ALLOWED@XA06346       */ 00017000
         CH    RLEN,MAXLEN                                         0336 00018000
         BH    @RF00336                                            0336 00019000
*     DO;                           /* YES                   @XA06346*/ 00020000
*       RSPTR=RSCAN+RLEN;           /* BUMP TO END OF CMD@XA06346    */ 00021000
         LR    RSPTR,RSCAN                                         0338 00022000
         ALR   RSPTR,RLEN                                          0338 00023000
*       DIGIT=' ';                  /* DELIMIT WITH BLANK@XA06346    */ 00024000
         MVI   DIGIT(RSPTR),C' '                                   0339 00025000
*     END;                          /* END OF DO GROUP       @XA06346*/ 00026000
*   RELEASE(RLEN,RSPTR);            /* RELEASE TO COMPILEROX06346    */ 00027000
@RF00336 DS    0H                                                  0342 00028000
*   OCBACKUP=OPCDOUBL;              /* CONC TRM NAME                 */ 00029000
         MVC   OCBACKUP(8,ROPCE),OPCDOUBL(ROPCAVT)                 0342 00030000
*   OPCLDNME(4:5)=ERRMOD;           /* ERROR EXIT MOD ID             */ 00031000
         MVC   OPCLDNME+3(2,ROPCAVT),ERRMOD                        0343 00032000
*   RSAVE=ADDR(OPCSAVE);            /* SAVE AREA ADDRESS             */ 00033000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                             0344 00034000
*   CALL TRMLKUP;                   /* GOTO TRM LOOKUP RTN           */ 00035000
         L     @15,OPCTOFLK(,ROPCAVT)                              0345 00036000
         BALR  @14,@15                                             0345 00037000
*   GOTO GOODTRM1;                  /* GOOD RETURN                   */ 00038000
         B     GOODTRM1                                            0346 00039000
*   RESPECIFY                                                      0347 00040000
*     RERR RSTD;                    /*                       @Y17XART*/ 00041000
*RETURN1:                                                          0348 00042000
*   RERR=16;                        /* ERROR MESSAGE                 */ 00043000
RETURN1  LA    RERR,16                                             0348 00044000
*   GOTO ERREXIT;                   /* GOTO ERROR MSG MODULE         */ 00045000
         B     ERREXIT                                             0349 00046000
*   RESPECIFY                                                      0350 00047000
*     RERR UNRSTD;                  /*                       @Y17XART*/ 00048000
*   RESPECIFY                                                      0351 00049000
*     IEDQTRM BASED(RPARM);                                        0351 00050000
*   RESPECIFY                                                      0352 00051000
*    (RPARM) RESTRICTED;                                           0352 00052000
*   RESTRICT(RQCB);                                                0353 00053000
*GOODTRM1:                                                         0354 00054000
*   OCMODNME=OCBACKUP;              /* SAVE CONC TRM NAME            */ 00055000
GOODTRM1 MVC   OCMODNME(8,ROPCE),OCBACKUP(ROPCE)                   0354 00056000
*   GEN(L     RQCB,TRMDESTQ-1(RPARM));/* GET QCB ADDRESS             */ 00057000
         L     RQCB,TRMDESTQ-1(RPARM)                                   00058000
*   IF TRMCONC^='1'B|               /* CONCENTRATOR                  */ 00059000
*       QCBDRQQ^='1'B THEN                                         0356 00060000
         TM    TRMCONC(RPARM),B'10000000'                          0356 00061000
         BNO   @RT00356                                            0356 00062000
         TM    QCBDRQQ(IEDQQPTR),B'00000100'                       0356 00063000
         BO    @RF00356                                            0356 00064000
@RT00356 DS    0H                                                  0357 00065000
*     DO;                           /* TRM A CONCENTRATOR            */ 00066000
*       RESPECIFY                                                  0358 00067000
*         RERR RSTD;                /*                       @Y17XART*/ 00068000
*       RERR=391;                   /* NO, ERROR MSG                 */ 00069000
         LA    RERR,391                                            0359 00070000
*       GOTO ERREXIT;               /* EXIT                          */ 00071000
         B     ERREXIT                                             0360 00072000
*       RESPECIFY                                                  0361 00073000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00074000
*     END;                                                         0362 00075000
*   RESTRICT(RCONC);                                               0363 00076000
@RF00356 DS    0H                                                  0364 00077000
*   RELEASE(RQCB);                                                 0364 00078000
*   RCONC=RPARM;                    /* YES, SAVE CONC TRM ADDR       */ 00079000
         LR    RCONC,RPARM                                         0365 00080000
*   CALL SCAN;                      /* SCAN FOR NEXT TRM NAME        */ 00081000
         BAL   @14,SCAN                                            0366 00082000
*   CALL TRMLKUP;                   /* LOOK UP TRM NAME              */ 00083000
         L     @15,OPCTOFLK(,ROPCAVT)                              0367 00084000
         BALR  @14,@15                                             0367 00085000
*   GOTO GOODTRM2;                  /* TRM NAME FOUND                */ 00086000
         B     GOODTRM2                                            0368 00087000
*   RESPECIFY                                                      0369 00088000
*     RERR RSTD;                    /*                       @Y17XART*/ 00089000
*RETURN2:                                                          0370 00090000
*   RERR=16;                        /* ERROR MSG                     */ 00091000
RETURN2  LA    RERR,16                                             0370 00092000
*   GOTO ERREXIT;                   /* EXIT                          */ 00093000
         B     ERREXIT                                             0371 00094000
*   RESPECIFY                                                      0372 00095000
*     RERR UNRSTD;                  /*                       @Y17XART*/ 00096000
*GOODTRM2:                                                         0373 00097000
*   CALL CONCTEST;                  /* CHECK VALIDITY OF TRM         */ 00098000
GOODTRM2 BAL   @14,CONCTEST                                        0373 00099000
*   IDSAVE=OCBACKUP;                /* SAVE TRM NAME TEMP            */ 00100000
         MVC   IDSAVE(8,RWORKA),OCBACKUP(ROPCE)                    0374 00101000
*   GEN(ST    RPARM,OCLINK(ROPCE)); /* SAVE TRM ENTRY ADDRESS        */ 00102000
         ST    RPARM,OCLINK(ROPCE)                                      00103000
*   CALL SCAN;                      /* SCAN FOR NEXT TRM NAME        */ 00104000
         BAL   @14,SCAN                                            0376 00105000
*   CALL TRMLKUP;                   /* GET TRM ENTR ADDR             */ 00106000
         L     @15,OPCTOFLK(,ROPCAVT)                              0377 00107000
         BALR  @14,@15                                             0377 00108000
*   GOTO GOODTRM3;                  /* TRM NAME FOUND                */ 00109000
         B     GOODTRM3                                            0378 00110000
*   RESPECIFY                                                      0379 00111000
*     RERR RSTD;                    /*                       @Y17XART*/ 00112000
*RETURN3:                                                          0380 00113000
*   RERR=16;                        /* ERROR MSG                     */ 00114000
RETURN3  LA    RERR,16                                             0380 00115000
*   GOTO ERREXIT;                   /* EXIT                          */ 00116000
         B     ERREXIT                                             0381 00117000
*   RESPECIFY                                                      0382 00118000
*     RERR UNRSTD;                  /*                       @Y17XART*/ 00119000
*GOODTRM3:                                                         0383 00120000
*   CALL CONCTEST;                  /* VALID TERMINAL                */ 00121000
GOODTRM3 BAL   @14,CONCTEST                                        0383 00122000
*   OCMODNME=IDSAVE;                /* RESTORE SAVED TRM NAME        */ 00123000
         MVC   OCMODNME(8,ROPCE),IDSAVE(RWORKA)                    0384 00124000
*   OCELEM=RPARM;                   /* SAVE TRM ENTRY ADDRESS        */ 00125000
         ST    RPARM,OCELEM(,ROPCE)                                0385 00126000
*   RELEASE(RCONC);                                                0386 00127000
*   RESTRICT(RDCT1,RDCT2);                                         0387 00128000
*   RDCT1=AVTCSTCS+(OCLINK->TRMCHCIN*AVTDCTLN);/* DCT TBL P  @Y17XART*/ 00129000
         L     @10,AVTCSTCS(,IEDQAPTR)                             0388 00130000
         L     @06,OCLINK(,ROPCE)                                  0388 00131000
         LH    @15,AVTDCTLN(,IEDQAPTR)                             0388 00132000
         SLR   RDCT1,RDCT1                                         0388 00133000
         IC    RDCT1,TRMCHCIN(,@06)                                0388 00134000
         MR    @08,@15                                             0388 00135000
         ALR   RDCT1,@10                                           0388 00136000
*   RDCT2=AVTCSTCS+(OCELEM->TRMCHCIN*AVTDCTLN);/* DCT TBL P  @Y17XART*/ 00137000
         L     @08,OCELEM(,ROPCE)                                  0389 00138000
         SLR   RDCT2,RDCT2                                         0389 00139000
         IC    RDCT2,TRMCHCIN(,@08)                                0389 00140000
         MR    @14,RDCT2                                           0389 00141000
         ALR   @10,@15                                             0389 00142000
         LR    RDCT2,@10                                           0389 00143000
*   IF RDCT1^=RDCT2 THEN                                           0390 00144000
         CR    RDCT1,RDCT2                                         0390 00145000
         BE    @RF00390                                            0390 00146000
*     DO;                           /* ARE DEVICE CHAR SIMILAR       */ 00147000
*       RESPECIFY                                                  0392 00148000
*         RERR RSTD;                /*                       @Y17XART*/ 00149000
*       RERR=393;                   /* NO, ERROR MSG                 */ 00150000
         LA    RERR,393                                            0393 00151000
*       GOTO ERREXIT;               /* EXIT                          */ 00152000
         B     ERREXIT                                             0394 00153000
*       RESPECIFY                                                  0395 00154000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00155000
*     END;                                                         0396 00156000
*   RELEASE(RDCT1,RDCT2);                                          0397 00157000
@RF00390 DS    0H                                                  0398 00158000
*   RESTRICT(RIDPTR);                                              0398 00159000
*   GEN(L     RPARM,OCLINK(ROPCE)); /* GET TRM ENTRY ADDRESS         */ 00160000
         L     RPARM,OCLINK(ROPCE)                                      00161000
*   CALL FLDLKUP;                   /* GET PTR TO DVC ID TBL ENT     */ 00162000
         BAL   @14,FLDLKUP                                         0400 00163000
*   GEN(ST    RIDPTR,OCLINK(ROPCE));/* SAVE DVC ID TBL ENTRY ADD     */ 00164000
         ST    RIDPTR,OCLINK(ROPCE)                                     00165000
*   RPARM=OCELEM;                   /* GET SECOND TRM ENTRY ADDR     */ 00166000
         L     RPARM,OCELEM(,ROPCE)                                0402 00167000
*   CALL FLDLKUP;                   /* GET DVC ID TBL ENTRY PTR      */ 00168000
         BAL   @14,FLDLKUP                                         0403 00169000
*   OCELEM=RIDPTR;                  /* SAVE DVC ID TBL ENTRY ADDR    */ 00170000
         ST    RIDPTR,OCELEM(,ROPCE)                               0404 00171000
*/* ARE DEVICE IDS EQUAL                                             */ 00172000
*                                                                  0405 00173000
*   IF OCELEM->DVCIDLTH^=OCLINK->DVCIDLTH THEN                     0405 00174000
         L     @06,OCELEM(,ROPCE)                                  0405 00175000
         L     @15,OCLINK(,ROPCE)                                  0405 00176000
         CLC   DVCIDLTH(1,@06),DVCIDLTH(@15)                       0405 00177000
         BE    @RF00405                                            0405 00178000
*     DO;                                                          0406 00179000
*       RESPECIFY                                                  0407 00180000
*         RERR RSTD;                /*                       @Y17XART*/ 00181000
*       RERR=393;                   /* NO, ERROR MSG                 */ 00182000
         LA    RERR,393                                            0408 00183000
*       GOTO ERREXIT;               /* EXIT                          */ 00184000
         B     ERREXIT                                             0409 00185000
*       RESPECIFY                                                  0410 00186000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00187000
*     END;                                                         0411 00188000
*   IF OCELEM->DVCIDLTH=1&          /* DVC ID CHAR LENGTH ONE        */ 00189000
*       OCELEM->DVCCHAR='FF'X|      /* TRM1 DVC ID = X'FF'           */ 00190000
*       OCLINK->DVCIDLTH=1&         /* DVC ID CHAR LENGTH ONE        */ 00191000
*       OCLINK->DVCCHAR='FF'X THEN                                 0412 00192000
@RF00405 L     @06,OCELEM(,ROPCE)                                  0412 00193000
         CLI   DVCIDLTH(@06),1                                     0412 00194000
         BNE   @GL00002                                            0412 00195000
         CLI   DVCCHAR(@06),X'FF'                                  0412 00196000
         BE    @RT00412                                            0412 00197000
@GL00002 L     @06,OCLINK(,ROPCE)                                  0412 00198000
         CLI   DVCIDLTH(@06),1                                     0412 00199000
         BNE   @RF00412                                            0412 00200000
         CLI   DVCCHAR(@06),X'FF'                                  0412 00201000
         BNE   @RF00412                                            0412 00202000
@RT00412 DS    0H                                                  0413 00203000
*     DO;                           /* TRM2 DVC ID = X'FF'           */ 00204000
*       RESPECIFY                                                  0414 00205000
*         RERR RSTD;                /*                       @Y17XART*/ 00206000
*       RERR=393;                   /* YES, PUT OUT ERROR MSG        */ 00207000
         LA    RERR,393                                            0415 00208000
*       GOTO ERREXIT;               /* EXIT                          */ 00209000
         B     ERREXIT                                             0416 00210000
*       RESPECIFY                                                  0417 00211000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00212000
*     END;                                                         0418 00213000
*   RESTRICT(RCNT);                                                0419 00214000
@RF00412 DS    0H                                                  0420 00215000
*   RCNT=OCLINK->DVCIDLTH;          /* LENGTH OF DVCIDS TO SWAP      */ 00216000
         L     @06,OCLINK(,ROPCE)                                  0420 00217000
         SLR   RCNT,RCNT                                           0420 00218000
         IC    RCNT,DVCIDLTH(,@06)                                 0420 00219000
*                                                                  0421 00220000
*/* ALL VALIDITY CHECKING HAS NOW BEEN DONE. WE MUST NOW FIND THE    */ 00221000
*/* DEVICE ID ENTRY FOR THE ATTACHED TERMINLS AND SWAP THEIR DEVICE  */ 00222000
*/* ID'S.                                                            */ 00223000
*                                                                  0421 00224000
*   GEN(SPACE 2);                                                  0421 00225000
         SPACE 2                                                        00226000
*   IDSAVE(1:RCNT)=OCELEM->TEMPDVC(1:RCNT);/* SAVID          @Y17XART*/ 00227000
         LR    @10,RCNT                                            0422 00228000
         BCTR  @10,0                                               0422 00229000
         L     @06,OCELEM(,ROPCE)                                  0422 00230000
         EX    @10,@SM01929                                        0422 00231000
*/* SWAP THE DEVICE IDS                                              */ 00232000
*                                                                  0423 00233000
*   OCELEM->TEMPDVC(1:RCNT)=OCLINK->TEMPDVC(1:RCNT);/*       @Y17XART*/ 00234000
         L     @15,OCLINK(,ROPCE)                                  0423 00235000
         EX    @10,@SM01931                                        0423 00236000
*   OCLINK->TEMPDVC(1:RCNT)=IDSAVE(1:RCNT);/*                @Y17XART*/ 00237000
         EX    @10,@SM01933                                        0424 00238000
*   RELEASE(RCNT);                                                 0425 00239000
*   RESPECIFY                                                      0426 00240000
*     RMSG RSTD;                    /*                       @Y17XART*/ 00241000
*   RMSG=394;                       /* SWAP COMPLETE MESSAGE         */ 00242000
         LA    RMSG,394                                            0427 00243000
*                                                                  0428 00244000
*/* EXIT LINKAGE                                                     */ 00245000
*                                                                  0428 00246000
*   GEN(SPACE 2) ;                                                 0428 00247000
         SPACE 2                                                        00248000
*   OPCLDNME(4:5)=WTGMOD;           /* ERROR MSG MODULE ID           */ 00249000
         MVC   OPCLDNME+3(2,ROPCAVT),WTGMOD                        0429 00250000
*ERREXIT:                                                          0430 00251000
*   RESPECIFY                                                      0430 00252000
*    (RPARM,                                                       0430 00253000
*     RERR) RSTD;                   /*                       @Y17XART*/ 00254000
ERREXIT  DS    0H                                                  0431 00255000
*   RPARM=ROPCAVT;                  /* PASS OP CTL AVT POINTER       */ 00256000
         LR    RPARM,ROPCAVT                                       0431 00257000
*   GEN EXIT;                                                      0432 00258000
*                                                          /*@Y17XART*/ 00259000
         XCTL  SF=(E,OPCXCTL(ROPCAVT))                         @Y17XART 00260000
*   RESPECIFY                                                      0433 00261000
*    (RPARM,                                                       0433 00262000
*     RERR,                                                        0433 00263000
*     RMSG) UNRSTD;                 /*                       @Y17XART*/ 00264000
*FLDLKUP:                                                          0434 00265000
*   PROC OPTIONS(DONTSAVE,NOSAVEAREA);                             0434 00266000
@EL00001 DS    0H                                                  0434 00267000
@EF00001 DS    0H                                                  0434 00268000
@ER00001 BR    @14                                                 0434 00269000
FLDLKUP  DS    0H                                                  0435 00270000
*   DCL                                                            0435 00271000
*     RFLD REG(11) PTR(24);                                        0435 00272000
*   DCL                                                            0436 00273000
*     RWORK2 REG(7) PTR(24);                                       0436 00274000
*   RESTRICT(RFLD,RWORK9,RWORK2,RIDPTR);                           0437 00275000
*   RESTRICT(ROPCE,ROPCAVT);                                       0438 00276000
*   RESPECIFY                                                      0439 00277000
*    (RPARM,                                                       0439 00278000
*     RLINK) RSTD;                  /*                       @Y17XART*/ 00279000
*   OPCSAVE=RLINK;                  /* SAVE RETURN REG               */ 00280000
         ST    RLINK,OPCSAVE(,ROPCAVT)                             0440 00281000
*   RFLD=ADDR(TRMOPT);              /* START OF DEVICE DEP FLD IF NO    00282000
*                                      OPTION FIELDS                 */ 00283000
         LA    RFLD,TRMOPT(,RPARM)                                 0441 00284000
*   IF TRMOPTFN='1'B THEN                                          0442 00285000
         TM    TRMOPTFN(RPARM),B'00000010'                         0442 00286000
         BNO   @RF00442                                            0442 00287000
*     DO;                           /* OPTION FIELDS USED            */ 00288000
*       RFLD=RFLD+TRMOPNO;          /* YES, SKIP OPTION FIELDS       */ 00289000
         SLR   @15,@15                                             0444 00290000
         IC    @15,TRMOPNO(,RPARM)                                 0444 00291000
         ALR   RFLD,@15                                            0444 00292000
*     END;                                                         0445 00293000
*   GEN(LH    RWORK9,TRMDEVFL(RPARM));/* GET DVC DEP FLD BITS        */ 00294000
@RF00442 DS    0H                                                  0446 00295000
         LH    RWORK9,TRMDEVFL(RPARM)                                   00296000
*   RESPECIFY                                                      0447 00297000
*     RPARM UNRSTD;                 /*                       @Y17XART*/ 00298000
*   GEN(SLL   RWORK9,15                SHIFT BITS TO HIGH ORDER);  0448 00299000
         SLL   RWORK9,15                SHIFT BITS TO HIGH ORDER        00300000
*   DO RCNT=9 TO 1 BY-1;            /* FIND DEVICE ID ENTRY ADDR     */ 00301000
         LA    RCNT,9                                              0449 00302000
@DL00449 DS    0H                                                  0450 00303000
*     GEN(SLL   RWORK9,1               SHIFT BIT OUT) ;            0450 00304000
         SLL   RWORK9,1               SHIFT BIT OUT                     00305000
*     IF RWORK9<0 THEN                                             0451 00306000
         LTR   RWORK9,RWORK9                                       0451 00307000
         BNM   @RF00451                                            0451 00308000
*       DO;                         /* IS THIS FIELD PRESENT         */ 00309000
*         RWORK2=RFLD->TRMOPT;      /* GET LENGTH OF THIS FIELD      */ 00310000
         SLR   RWORK2,RWORK2                                       0453 00311000
         IC    RWORK2,TRMOPT(,RFLD)                                0453 00312000
*         RFLD=RFLD+RWORK2+1;       /* BUMP TO NEXT FIELD            */ 00313000
         LR    @15,RFLD                                            0454 00314000
         ALR   @15,RWORK2                                          0454 00315000
         LA    @15,1(,@15)                                         0454 00316000
         LR    RFLD,@15                                            0454 00317000
*       END;                                                       0455 00318000
*   END;                                                           0456 00319000
@RF00451 BCTR  RCNT,0                                              0456 00320000
         LTR   RCNT,RCNT                                           0456 00321000
         BP    @DL00449                                            0456 00322000
*   RESPECIFY                                                      0457 00323000
*     RWORKA RSTD;                  /*                       @Y17XART*/ 00324000
*   DVCIDPSV=DVCIDPTR;              /* SAVE DVC ID PTR               */ 00325000
         ICM   @15,15,DVCIDPTR(IEDQDPTR)                           0458 00326000
         ST    @15,DVCIDPSV(,RWORKA)                               0458 00327000
*   RIDPTR=DVCIDPSV;                /* DVC ID PTR                    */ 00328000
         LR    RIDPTR,@15                                          0459 00329000
*   RELEASE(RFLD,RWORK9,RWORK2);                                   0460 00330000
*   RLINK=OPCSAVE;                  /* RESTORE RETURN ADDRESS        */ 00331000
         L     RLINK,OPCSAVE(,ROPCAVT)                             0461 00332000
*   RETURN;                         /* RETURN TO CALLER              */ 00333000
@EL00002 DS    0H                                                  0462 00334000
@EF00002 DS    0H                                                  0462 00335000
@ER00002 BR    @14                                                 0462 00336000
*   RESPECIFY                                                      0463 00337000
*     RLINK UNRSTD;                 /*                       @Y17XART*/ 00338000
*   END FLDLKUP;                                                   0464 00339000
*SCAN:                                                             0465 00340000
*   PROC OPTIONS(DONTSAVE,NOSAVEAREA);                             0465 00341000
SCAN     DS    0H                                                  0466 00342000
*   GEN(EJECT) ;                                                   0466 00343000
*                                                                  0466 00344000
         EJECT                                                          00345000
*/* THIS ROUTINE SCANS FOR A COMMA OR A BLANK FROM WHERE THE SCAN    */ 00346000
*/* POINTER (REG 7) IS POINTING. IF FOUND, IT INITIALIZES OCBACKUP   */ 00347000
*/* WITH THE TERMINAL NAME. OTHERWISE AN ERROR MSG IS ISSUED.        */ 00348000
*                                                                  0467 00349000
*   RESTRICT(ROPCE,ROPCAVT);                                       0467 00350000
*   RESTRICT(RSPTR,RSCAN,RCNT);                                    0468 00351000
*   GEN(SPACE 2) ;                                                 0469 00352000
         SPACE 2                                                        00353000
*   RESPECIFY                                                      0470 00354000
*     RLINK RSTD;                   /*                       @Y17XART*/ 00355000
*   OPCSAVE=RLINK;                  /* SAVE RETURN REG               */ 00356000
         ST    RLINK,OPCSAVE(,ROPCAVT)                             0471 00357000
*   RESPECIFY                                                      0472 00358000
*     RLINK UNRSTD;                 /*                       @Y17XART*/ 00359000
*   RSPTR=RSCAN;                    /* INIT SCAN PTR                 */ 00360000
         LR    RSPTR,RSCAN                                         0473 00361000
*   DO RCNT=0 TO 8 BY 1;            /* SCAN FOR A COMMA              */ 00362000
         SLR   RCNT,RCNT                                           0474 00363000
@DL00474 DS    0H                                                  0475 00364000
*     RSPTR=RSCAN+RCNT;             /* UPDATE SCAN PTR               */ 00365000
         LR    RSPTR,RSCAN                                         0475 00366000
         ALR   RSPTR,RCNT                                          0475 00367000
*     IF DIGIT=','|                 /* IS THIS CHARACTER A COMMA     */ 00368000
*         DIGIT=' ' THEN                                           0476 00369000
         CLI   DIGIT(RSPTR),C','                                   0476 00370000
         BE    @RT00476                                            0476 00371000
         CLI   DIGIT(RSPTR),C' '                                   0476 00372000
         BNE   @RF00476                                            0476 00373000
@RT00476 DS    0H                                                  0477 00374000
*       DO;                         /* OR A BLANK                    */ 00375000
*         OCBACKUP=' ';             /* YES, BLANK RCVING FIELD       */ 00376000
         MVI   OCBACKUP+1(ROPCE),C' '                              0478 00377000
         MVC   OCBACKUP+2(6,ROPCE),OCBACKUP+1(ROPCE)               0478 00378000
         MVI   OCBACKUP(ROPCE),C' '                                0478 00379000
*         OCBACKUP=FIELD(1:RCNT);   /* MOVE TERMINAL NAME            */ 00380000
         MVI   OCBACKUP+1(ROPCE),C' '                              0479 00381000
         MVC   OCBACKUP+2(6,ROPCE),OCBACKUP+1(ROPCE)               0479 00382000
         LR    @12,RCNT                                            0479 00383000
         BCTR  @12,0                                               0479 00384000
         EX    @12,@SM01935                                        0479 00385000
*         OPCDOUBL=OCBACKUP;        /* SET FOR TRMLKUP       @XA06345*/ 00386000
         MVC   OPCDOUBL(8,ROPCAVT),OCBACKUP(ROPCE)                 0480 00387000
*         RSCAN=RSCAN+RCNT+1;       /* UPDATE SCAN POINTER           */ 00388000
         LR    @12,RSCAN                                           0481 00389000
         ALR   @12,RCNT                                            0481 00390000
         LA    @12,1(,@12)                                         0481 00391000
         LR    RSCAN,@12                                           0481 00392000
*         RESPECIFY                                                0482 00393000
*           RLINK RSTD;             /*                       @Y17XART*/ 00394000
*         RLINK=OPCSAVE;            /* RESTORE RETURN ADDRESS        */ 00395000
         L     RLINK,OPCSAVE(,ROPCAVT)                             0483 00396000
*         RETURN;                   /* RETURN TO CALLER              */ 00397000
@EL00003 DS    0H                                                  0484 00398000
@EF00003 DS    0H                                                  0484 00399000
@ER00003 BR    @14                                                 0484 00400000
*         RESPECIFY                                                0485 00401000
*           RLINK UNRSTD;           /*                       @Y17XART*/ 00402000
*       END;                                                       0486 00403000
*   END;                                                           0487 00404000
@RF00476 AL    RCNT,@CF00087                                       0487 00405000
         C     RCNT,@CF00071                                       0487 00406000
         BNH   @DL00474                                            0487 00407000
*   RESPECIFY                                                      0488 00408000
*     RERR RSTD;                    /*                       @Y17XART*/ 00409000
*   RERR=18;                        /* ERROR MSG NUMBER              */ 00410000
         LA    RERR,18                                             0489 00411000
*   GOTO ERREXIT;                   /* EXIT                          */ 00412000
         B     ERREXIT                                             0490 00413000
*   RESPECIFY                                                      0491 00414000
*     RERR UNRSTD;                  /*                       @Y17XART*/ 00415000
*   RELEASE(RSPTR,RCNT);                                           0492 00416000
*   END SCAN;                                                      0493 00417000
*CONCTEST:                                                         0494 00418000
*   PROC OPTIONS(DONTSAVE,NOSAVEAREA);                             0494 00419000
CONCTEST DS    0H                                                  0495 00420000
*   GEN(EJECT) ;                                                   0495 00421000
*                                                                  0495 00422000
         EJECT                                                          00423000
*/* THIS ROUTINE TEST THE TERMINALS VALIDITY. IT INSURES THAT THE    */ 00424000
*/* TERMINAL IS NOT ANOTHER CONCENTRATOR AND ALSO CHECKS TO BE SURE  */ 00425000
*/* THAT THE TERMINAL IS ATTACHED TO THE CORRECT CONCENTRATOR. IF    */ 00426000
*/* THE TESTS FAIL AN ERROR MESSAGE IS ISSUED AND THE COMMAND IS     */ 00427000
*/* ABORTED.                                                         */ 00428000
*                                                                  0496 00429000
*   RESTRICT(ROPCE,ROPCAVT);                                       0496 00430000
*   RESTRICT(RQCB,RCONC);                                          0497 00431000
*   RESPECIFY                                                      0498 00432000
*     RLINK RSTD;                   /*                       @Y17XART*/ 00433000
*   OPCSAVE=RLINK;                  /* SAVE RETURN REG               */ 00434000
         ST    RLINK,OPCSAVE(,ROPCAVT)                             0499 00435000
*   RESPECIFY                                                      0500 00436000
*     RLINK UNRSTD;                 /*                       @Y17XART*/ 00437000
*   RESPECIFY                                                      0501 00438000
*     RPARM RSTD;                   /*                       @Y17XART*/ 00439000
*   IF TRMSTATE(1:3)^='000'B THEN                                  0502 00440000
         TM    TRMSTATE(RPARM),B'11100000'                         0502 00441000
         BZ    @RF00502                                            0502 00442000
*     DO;                           /* SINGLE ENTRY                  */ 00443000
*       RESPECIFY                                                  0504 00444000
*         RERR RSTD;                /*                       @Y17XART*/ 00445000
*       RERR=90;                    /* SET ERR MSG NUMBER            */ 00446000
         LA    RERR,90                                             0505 00447000
*       GOTO ERREXIT;               /* EXIT                          */ 00448000
         B     ERREXIT                                             0506 00449000
*       RESPECIFY                                                  0507 00450000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00451000
*     END;                                                         0508 00452000
*   IF TRMCONC^='1'B THEN                                          0509 00453000
@RF00502 TM    TRMCONC(RPARM),B'10000000'                          0509 00454000
         BO    @RF00509                                            0509 00455000
*     DO;                           /* CONCENTRATOR                  */ 00456000
*       RESPECIFY                                                  0511 00457000
*         RERR RSTD;                /*                       @Y17XART*/ 00458000
*       RERR=391;                   /* ERROR MSG NUMBER              */ 00459000
         LA    RERR,391                                            0512 00460000
*       GOTO ERREXIT;               /* EXIT                          */ 00461000
         B     ERREXIT                                             0513 00462000
*       RESPECIFY                                                  0514 00463000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00464000
*     END;                                                         0515 00465000
*   RESTRICT(RQCBE);                                               0516 00466000
@RF00509 DS    0H                                                  0517 00467000
*   GEN(L     RQCB,TRMDESTQ-1(RPARM));/* QCB ADDRESS                 */ 00468000
         L     RQCB,TRMDESTQ-1(RPARM)                                   00469000
*   RESPECIFY                                                      0518 00470000
*     RPARM UNRSTD;                 /*                       @Y17XART*/ 00471000
*   RQCBE=RQCB+QCBEXTO;             /* EXTENSION ADDRESS             */ 00472000
         LR    RQCBE,RQCB                                          0519 00473000
         LH    @12,QCBEXTO(,IEDQQPTR)                              0519 00474000
         N     @12,@CF01937                                        0519 00475000
         ALR   RQCBE,@12                                           0519 00476000
*   RCONC=RCONC+0;                  /* CLEAR HIGH ORDER              */ 00477000
*   GEN(L     RQCBE,QCBECONC-1(RQCBE));/* EXTENSION PTR              */ 00478000
         L     RQCBE,QCBECONC-1(RQCBE)                                  00479000
*   RQCBE=RQCBE+0;                  /* CLEAR HIGH ORDER              */ 00480000
*   IF QCBDRQQ='1'B|                /* CONCENTRATOR OR               */ 00481000
*       RCONC^=RQCBE THEN                                          0523 00482000
         TM    QCBDRQQ(IEDQQPTR),B'00000100'                       0523 00483000
         BO    @RT00523                                            0523 00484000
         CR    RCONC,RQCBE                                         0523 00485000
         BE    @RF00523                                            0523 00486000
@RT00523 DS    0H                                                  0524 00487000
*     DO;                           /* NOT ATTACHED TO RIGHT CONC    */ 00488000
*       RELEASE(RQCBE);                                            0525 00489000
*       RESPECIFY                                                  0526 00490000
*         RERR RSTD;                /*                       @Y17XART*/ 00491000
*       RERR=392;                   /* ERROR MSG NUMBER              */ 00492000
         LA    RERR,392                                            0527 00493000
*       GOTO ERREXIT;               /* EXIT                          */ 00494000
         B     ERREXIT                                             0528 00495000
*       RESPECIFY                                                  0529 00496000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00497000
*     END;                                                         0530 00498000
*   RESPECIFY                                                      0531 00499000
*     RLINK RSTD;                   /*                       @Y17XART*/ 00500000
@RF00523 DS    0H                                                  0532 00501000
*   RLINK=OPCSAVE;                  /* RESTORE RETURN ADDRESS        */ 00502000
         L     RLINK,OPCSAVE(,ROPCAVT)                             0532 00503000
*   RETURN;                                                        0533 00504000
@EL00004 DS    0H                                                  0533 00505000
@EF00004 DS    0H                                                  0533 00506000
@ER00004 BR    @14                                                 0533 00507000
*   RESPECIFY                                                      0534 00508000
*     RLINK UNRSTD;                 /*                       @Y17XART*/ 00509000
*   RELEASE(RQCB);                                                 0535 00510000
*   END CONCTEST;                                                  0536 00511000
*   END IGCMR10D                                                   0537 00512000
*                                                                  0537 00513000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00514000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00515000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 00516000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 00517000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00518000
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */ 00519000
*/*%INCLUDE SYSLIB  (TQCBED  )                                       */ 00520000
*/*%INCLUDE SYSLIB  (TDVCIDTD)                                       */ 00521000
*                                                                  0537 00522000
*       ;                                                          0537 00523000
@DATA    DS    0H                                                       00524000
@SM01929 MVC   IDSAVE(0,RWORKA),TEMPDVC(@06)                            00525000
@SM01931 MVC   TEMPDVC(0,@06),TEMPDVC(@15)                              00526000
@SM01933 MVC   TEMPDVC(0,@15),IDSAVE(RWORKA)                            00527000
@SM01935 MVC   OCBACKUP(0,ROPCE),FIELD(RSCAN)                           00528000
         DS    0F                                                       00529000
         DS    0F                                                       00530000
@CF00087 DC    F'1'                                                     00531000
@CF00071 DC    F'8'                                                     00532000
@CF01937 DC    XL4'0000FFFF'                                            00533000
         DS    0D                                                       00534000
MAXLEN   DC    H'17'                                                    00535000
ENABLE   DC    XL1'FF'                                                  00536000
DISABLE  DC    XL1'00'                                                  00537000
ERRMOD   DC    CL2'03'                                                  00538000
WTGMOD   DC    CL2'M3'                                                  00539000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00540000
@01      EQU   01                                                       00541000
@02      EQU   02                                                       00542000
@03      EQU   03                                                       00543000
@04      EQU   04                                                       00544000
@05      EQU   05                                                       00545000
@06      EQU   06                                                       00546000
@07      EQU   07                                                       00547000
@08      EQU   08                                                       00548000
@09      EQU   09                                                       00549000
@10      EQU   10                                                       00550000
@11      EQU   11                                                       00551000
@12      EQU   12                                                       00552000
@13      EQU   13                                                       00553000
@14      EQU   14                                                       00554000
@15      EQU   15                                                       00555000
@0       EQU   00                                                       00556000
@1       EQU   01                                                       00557000
@2       EQU   02                                                       00558000
@3       EQU   03                                                       00559000
@4       EQU   04                                                       00560000
@5       EQU   05                                                       00561000
@6       EQU   06                                                       00562000
@7       EQU   07                                                       00563000
@8       EQU   08                                                       00564000
@9       EQU   09                                                       00565000
@A       EQU   10                                                       00566000
@B       EQU   11                                                       00567000
@C       EQU   12                                                       00568000
@D       EQU   13                                                       00569000
@E       EQU   14                                                       00570000
@F       EQU   15                                                       00571000
RMSG     EQU   @00                                                      00572000
RERR     EQU   @00                                                      00573000
RPARM    EQU   @01                                                      00574000
IEDQTPTR EQU   @01                                                      00575000
ROPCAVT  EQU   @02                                                      00576000
ROPCE    EQU   @03                                                      00577000
IEDQAPTR EQU   @04                                                      00578000
RWORKA   EQU   @05                                                      00579000
RCONC    EQU   @06                                                      00580000
RLEN     EQU   @06                                                      00581000
RIDPTR   EQU   @07                                                      00582000
RQCB     EQU   @08                                                      00583000
IEDQDPTR EQU   @07                                                      00584000
IEDQQPTR EQU   @08                                                      00585000
RSCAN    EQU   @07                                                      00586000
IEDQEPTR EQU   @09                                                      00587000
RQCBE    EQU   @09                                                      00588000
RDCT1    EQU   @09                                                      00589000
RSPTR    EQU   @09                                                      00590000
RWORK9   EQU   @09                                                      00591000
RCNT     EQU   @11                                                      00592000
RDCT2    EQU   @11                                                      00593000
RBASE    EQU   @12                                                      00594000
RSAVE    EQU   @13                                                      00595000
RLINK    EQU   @14                                                      00596000
RFLD     EQU   @11                                                      00597000
RWORK2   EQU   @07                                                      00598000
IEDQAVTD EQU   0                                                        00599000
AVTSAVEX EQU   IEDQAVTD+288                                             00600000
AVTCSTCS EQU   IEDQAVTD+328                                             00601000
AVTREADD EQU   IEDQAVTD+380                                             00602000
AVTBUFSW EQU   IEDQAVTD+384                                             00603000
@NM00004 EQU   IEDQAVTD+388                                             00604000
AVTCKFLG EQU   @NM00004                                                 00605000
AVTBASE  EQU   IEDQAVTD+412                                             00606000
AVTPKF   EQU   AVTBASE                                                  00607000
AVTHG02  EQU   IEDQAVTD+528                                             00608000
AVTDISP  EQU   IEDQAVTD+552                                             00609000
AVTHD    EQU   IEDQAVTD+556                                             00610000
AVTSCOPT EQU   AVTHD                                                    00611000
AVTSAVTP EQU   IEDQAVTD+612                                             00612000
AVTSAVTF EQU   AVTSAVTP                                                 00613000
AVTCKPEL EQU   IEDQAVTD+652                                             00614000
AVTCKRMV EQU   AVTCKPEL                                                 00615000
AVTCKELF EQU   IEDQAVTD+680                                             00616000
AVTCKBYT EQU   IEDQAVTD+691                                             00617000
AVTHG01  EQU   IEDQAVTD+692                                             00618000
AVTCKLNK EQU   IEDQAVTD+696                                             00619000
AVTCRELE EQU   IEDQAVTD+708                                             00620000
AVTCCELE EQU   AVTCRELE                                                 00621000
AVTCLRHI EQU   IEDQAVTD+716                                             00622000
AVTADBUF EQU   IEDQAVTD+720                                             00623000
AVTSYSER EQU   IEDQAVTD+728                                             00624000
AVTBFRFG EQU   IEDQAVTD+784                                             00625000
AVTCKPQB EQU   IEDQAVTD+804                                             00626000
AVTCKPTB EQU   AVTCKPQB                                                 00627000
AVTCKPEC EQU   AVTCKPQB+4                                               00628000
AVTCKPCC EQU   AVTCKPEC                                                 00629000
AVTOPCQB EQU   IEDQAVTD+816                                             00630000
AVTOPCOB EQU   AVTOPCQB                                                 00631000
AVTOPCEC EQU   AVTOPCQB+4                                               00632000
AVTOPCCC EQU   AVTOPCEC                                                 00633000
AVTOLTQB EQU   IEDQAVTD+828                                             00634000
AVTCWFL1 EQU   IEDQAVTD+924                                             00635000
AVTCWFL2 EQU   IEDQAVTD+925                                             00636000
AVTSUBT  EQU   IEDQAVTD+948                                             00637000
AVTIOTR  EQU   IEDQAVTD+949                                             00638000
AVTBIT1  EQU   IEDQAVTD+1050                                            00639000
AVTBIT2  EQU   IEDQAVTD+1051                                            00640000
AVTBIT3  EQU   IEDQAVTD+1052                                            00641000
AVTDCTLN EQU   IEDQAVTD+1072                                            00642000
AVTBIT4  EQU   IEDQAVTD+1136                                            00643000
@NM00083 EQU   IEDQAVTD+1232                                            00644000
IEDNSVTD EQU   0                                                        00645000
SAVTDIAG EQU   IEDNSVTD                                                 00646000
SAVTDIAF EQU   SAVTDIAG                                                 00647000
SAVTLUSQ EQU   IEDNSVTD+88                                              00648000
SAVTSCLU EQU   IEDNSVTD+168                                             00649000
SAVTTCPU EQU   IEDNSVTD+238                                             00650000
SAVTZELM EQU   IEDNSVTD+270                                             00651000
SAVTRDRV EQU   IEDNSVTD+284                                             00652000
SAVTCKQB EQU   IEDNSVTD+300                                             00653000
SAVTCKTB EQU   SAVTCKQB                                                 00654000
SAVTCKEC EQU   SAVTCKQB+4                                               00655000
SAVTCKCC EQU   SAVTCKEC                                                 00656000
SAVTNETF EQU   IEDNSVTD+324                                             00657000
SAVTCDRV EQU   IEDNSVTD+332                                             00658000
IEDQOPCD EQU   0                                                        00659000
OPCDOUBL EQU   IEDQOPCD                                                 00660000
OPCCOPCE EQU   IEDQOPCD+12                                              00661000
OPCTOFLK EQU   IEDQOPCD+24                                              00662000
OPCSAVE  EQU   IEDQOPCD+56                                              00663000
OPCAQCTL EQU   IEDQOPCD+180                                             00664000
OPCLDNME EQU   IEDQOPCD+212                                             00665000
OPCSPEC  EQU   IEDQOPCD+300                                             00666000
OPCPWCOB EQU   IEDQOPCD+368                                             00667000
OPCPWQCB EQU   OPCPWCOB                                                 00668000
OPCPWECB EQU   OPCPWCOB+4                                               00669000
OPCSESS  EQU   IEDQOPCD+384                                             00670000
OPCSFLAG EQU   OPCSESS                                                  00671000
OPCSENSE EQU   OPCSESS+8                                                00672000
OPCSNSSY EQU   OPCSENSE                                                 00673000
OPCSNSUS EQU   OPCSENSE+2                                               00674000
OPCPCID  EQU   IEDQOPCD+456                                             00675000
OPCUNIQP EQU   OPCPCID+2                                                00676000
OPCSESSF EQU   IEDQOPCD+464                                             00677000
IEDQOPCE EQU   0                                                        00678000
OCLINK   EQU   IEDQOPCE                                                 00679000
OCELEM   EQU   IEDQOPCE+4                                               00680000
OCUNIT   EQU   IEDQOPCE+8                                               00681000
OCRUDEST EQU   OCUNIT                                                   00682000
OCCKPKEY EQU   OCRUDEST                                                 00683000
OCSCAN   EQU   OCCKPKEY                                                 00684000
@NM00130 EQU   OCRUDEST+1                                               00685000
OCUNITBF EQU   @NM00130+2                                               00686000
OCOPTCDE EQU   IEDQOPCE+12                                              00687000
OCSWITCH EQU   IEDQOPCE+13                                              00688000
OCFLAG   EQU   IEDQOPCE+14                                              00689000
OCRLN    EQU   IEDQOPCE+15                                              00690000
OCCIB    EQU   IEDQOPCE+16                                              00691000
OCMSTSAV EQU   OCCIB                                                    00692000
OCDEST   EQU   OCMSTSAV                                                 00693000
OCLINENO EQU   IEDQOPCE+22                                              00694000
OCTIOT   EQU   OCLINENO                                                 00695000
OCWTGB   EQU   OCTIOT                                                   00696000
OCTRUNIT EQU   IEDQOPCE+24                                              00697000
OCRSID   EQU   OCTRUNIT                                                 00698000
OCALSTAT EQU   OCRSID                                                   00699000
OCFNAALL EQU   OCALSTAT                                                 00700000
OCFLAG1  EQU   OCRSID+1                                                 00701000
OCPARM   EQU   IEDQOPCE+28                                              00702000
OCBACKUP EQU   IEDQOPCE+32                                              00703000
OCBUFNED EQU   OCBACKUP                                                 00704000
OCCOUNT1 EQU   OCBUFNED                                                 00705000
OCBUFGOT EQU   OCBACKUP+2                                               00706000
OCCOUNT2 EQU   OCBUFGOT                                                 00707000
OCMODNME EQU   IEDQOPCE+40                                              00708000
OCIPLWA  EQU   OCMODNME                                                 00709000
OCPTRSAV EQU   OCMODNME+4                                               00710000
OCCKDATA EQU   IEDQOPCE+48                                              00711000
OCRSTGTM EQU   OCCKDATA                                                 00712000
OC379RRT EQU   OCRSTGTM                                                 00713000
OCNCP    EQU   OCRSTGTM+2                                               00714000
OCOID    EQU   IEDQOPCE+56                                              00715000
IEDQOPCN EQU   0                                                        00716000
OCLDNME  EQU   IEDQOPCN                                                 00717000
OCLINTTE EQU   OCLDNME                                                  00718000
OCREQFLG EQU   OCLINTTE+2                                               00719000
OCPREFLG EQU   OCLINTTE+3                                               00720000
IEDQTRM  EQU   0                                                        00721000
TRMSTATE EQU   IEDQTRM                                                  00722000
TRMLOG   EQU   TRMSTATE                                                 00723000
TRMOPTFN EQU   TRMSTATE                                                 00724000
TRMDESTQ EQU   IEDQTRM+1                                                00725000
TRMRSTRT EQU   TRMDESTQ+2                                               00726000
TRMINSEQ EQU   IEDQTRM+4                                                00727000
TLISTCNT EQU   TRMINSEQ                                                 00728000
TRMSESCT EQU   TLISTCNT                                                 00729000
TRMOUTSQ EQU   IEDQTRM+6                                                00730000
TLISTEN  EQU   TRMOUTSQ                                                 00731000
TRMDSORG EQU   TLISTEN                                                  00732000
TRMPLIM  EQU   TLISTEN+1                                                00733000
TRMALTD  EQU   IEDQTRM+8                                                00734000
TRMPRILK EQU   TRMALTD                                                  00735000
TRMDEVFL EQU   IEDQTRM+10                                               00736000
TRMADDC  EQU   TRMDEVFL                                                 00737000
TRMCONC  EQU   TRMDEVFL+1                                               00738000
TRMNCPI  EQU   TRMDEVFL+1                                               00739000
TRMSTAT  EQU   IEDQTRM+12                                               00740000
TRMAPB   EQU   TRMSTAT                                                  00741000
TRMSIO   EQU   TRMAPB                                                   00742000
TRMOWNER EQU   TRMSIO                                                   00743000
TRMSENSE EQU   TRMAPB+3                                                 00744000
TRMCHCIN EQU   IEDQTRM+16                                               00745000
TRMOPNO  EQU   IEDQTRM+17                                               00746000
IEDNTRM  EQU   0                                                        00747000
TRMDIALQ EQU   IEDNTRM+1                                                00748000
TRMBYTE7 EQU   TRMDIALQ+2                                               00749000
TRMATNDX EQU   IEDNTRM+4                                                00750000
TRMINDEX EQU   IEDNTRM+6                                                00751000
TRMCOHTG EQU   IEDNTRM+8                                                00752000
TRMBYTE6 EQU   TRMCOHTG                                                 00753000
TRMCDF0  EQU   TRMBYTE6                                                 00754000
TRMBYTE5 EQU   TRMCOHTG+1                                               00755000
TRMBYTE4 EQU   IEDNTRM+10                                               00756000
TRMBYTE3 EQU   IEDNTRM+11                                               00757000
TRMBYTE2 EQU   IEDNTRM+12                                               00758000
TRMINPG  EQU   TRMBYTE2                                                 00759000
TRMBYTE1 EQU   IEDNTRM+13                                               00760000
TRMSCPRQ EQU   TRMBYTE1                                                 00761000
TRMBYTE0 EQU   IEDNTRM+16                                               00762000
TRMNOWCD EQU   TRMBYTE0                                                 00763000
TRMSIBPT EQU   IEDNTRM+17                                               00764000
TRMLTRAC EQU   TRMSIBPT                                                 00765000
TRMLBUFR EQU   TRMLTRAC                                                 00766000
TRMRLMCT EQU   IEDNTRM+20                                               00767000
TRMLGBST EQU   TRMRLMCT                                                 00768000
IEDQQCB  EQU   0                                                        00769000
QCBDSFLG EQU   IEDQQCB                                                  00770000
QCBDISK  EQU   QCBDSFLG                                                 00771000
QCBDRQQ  EQU   QCBDSFLG                                                 00772000
QCBELCHN EQU   IEDQQCB+1                                                00773000
QCBEOLDT EQU   IEDQQCB+16                                               00774000
QCBBYTE1 EQU   QCBEOLDT+1                                               00775000
QCBLKRLN EQU   IEDQQCB+18                                               00776000
QCBRETCT EQU   QCBLKRLN                                                 00777000
QCBSTAT  EQU   IEDQQCB+19                                               00778000
QCBINSRC EQU   IEDQQCB+21                                               00779000
QCBNBACK EQU   QCBINSRC                                                 00780000
QCBTSOF2 EQU   QCBNBACK+1                                               00781000
QCBINHBN EQU   QCBTSOF2                                                 00782000
QCBTSOF1 EQU   QCBNBACK+2                                               00783000
QCBINTVL EQU   IEDQQCB+24                                               00784000
QCBEXTO  EQU   QCBINTVL                                                 00785000
QCBPREN  EQU   IEDQQCB+28                                               00786000
QCBLKRRN EQU   QCBPREN+5                                                00787000
QCBDCBAD EQU   IEDQQCB+33                                               00788000
QCBFLAG  EQU   IEDQQCB+36                                               00789000
IEDQPQCB EQU   40                                                       00790000
QCBFHDLZ EQU   IEDQPQCB+3                                               00791000
QCBFHDTZ EQU   IEDQPQCB+6                                               00792000
QCBINTLF EQU   IEDQPQCB+12                                              00793000
IEDNQCB  EQU   0                                                        00794000
QCBSTAT1 EQU   IEDNQCB+4                                                00795000
QCBPLCBA EQU   IEDNQCB+5                                                00796000
QCBPASCF EQU   0                                                        00797000
QCBASCFG EQU   QCBPASCF                                                 00798000
IEDRQCBP EQU   0                                                        00799000
IEDRATIQ EQU   0                                                        00800000
IEDQQCBE EQU   0                                                        00801000
QCBEFLG  EQU   IEDQQCBE                                                 00802000
QCBECONC EQU   IEDQQCBE+1                                               00803000
QCBEDAMT EQU   IEDQQCBE+4                                               00804000
QCBESAVE EQU   IEDQQCBE+10                                              00805000
QCBEDEOB EQU   IEDQQCBE+15                                              00806000
IEDQDVCT EQU   0                                                        00807000
DVCIDLTH EQU   IEDQDVCT                                                 00808000
DVCCHAR  EQU   IEDQDVCT+1                                               00809000
DVCSTAT  EQU   IEDQDVCT+2                                               00810000
DIGIT    EQU   0                                                        00811000
IDSAVE   EQU   100                                                      00812000
TRMLKUP  EQU   0                                                        00813000
FIELD    EQU   0                                                        00814000
DVCIDPSV EQU   108                                                      00815000
DVCIDPTR EQU   1                                                        00816000
OPCAQWD  EQU   OPCAQCTL                                                 00817000
OPCAQWD1 EQU   OPCAQWD                                                  00818000
OPCAQWD2 EQU   OPCAQWD+4                                                00819000
OPCAQWD3 EQU   OPCAQWD+8                                                00820000
@NM00137 EQU   OCCKDATA                                                 00821000
@NM00139 EQU   OCCIB                                                    00822000
@NM00140 EQU   @NM00139+1                                               00823000
OCCKPKY1 EQU   OCCKPKEY                                                 00824000
OCCKPTYP EQU   OCCKPKY1                                                 00825000
OCICACTN EQU   OCMODNME                                                 00826000
OCICDADR EQU   OCICACTN                                                 00827000
OCICSW   EQU   OCICDADR+3                                               00828000
@NM00145 EQU   OCBACKUP                                                 00829000
@NM00146 EQU   OCCKDATA                                                 00830000
OCMSGFLG EQU   OCPREFLG                                                 00831000
OCBKUP1  EQU   OCMODNME                                                 00832000
@NM00150 EQU   OCMODNME                                                 00833000
OCBKUP2  EQU   OCCKDATA                                                 00834000
OCBKUP3  EQU   OCLDNME                                                  00835000
OCRESPTR EQU   OCBKUP3+4                                                00836000
OCDIALLN EQU   OCRESPTR                                                 00837000
OCIPLDMP EQU   OCLDNME+4                                                00838000
TRMOPT   EQU   IEDQTRM+20                                               00839000
@NM00161 EQU   TRMSTATE                                                 00840000
TRMLUFD0 EQU   TRMBYTE7                                                 00841000
TRMSNAST EQU   TRMBYTE6                                                 00842000
TRMCDFD0 EQU   TRMBYTE5                                                 00843000
TRMPRE1  EQU   TRMBYTE4                                                 00844000
TRMNCP1  EQU   TRMBYTE4                                                 00845000
TRMLU1   EQU   TRMBYTE4                                                 00846000
TRMLINK1 EQU   TRMBYTE4                                                 00847000
TRMDCONS EQU   TRMLINK1                                                 00848000
TRMPRE   EQU   TRMBYTE3                                                 00849000
TRMNCP   EQU   TRMBYTE3                                                 00850000
TRMIPLDM EQU   TRMNCP                                                   00851000
TRMPU    EQU   TRMBYTE3                                                 00852000
TRMLU    EQU   TRMBYTE3                                                 00853000
TRMCDMGR EQU   TRMBYTE3                                                 00854000
TRMLINK  EQU   TRMBYTE3                                                 00855000
@NM00186 EQU   QCBFHDLZ                                                 00856000
@NM00191 EQU   QCBESAVE                                                 00857000
QCBEQTYP EQU   @NM00191+4                                               00858000
TEMPDVC  EQU   DVCCHAR                                                  00859000
DVCECW   EQU   IEDQDVCT+3                                               00860000
OCLINRRT EQU   OCTRUNIT                                                 00861000
OCPCID   EQU   OCBACKUP                                                 00862000
OCRSNCDE EQU   OCALSTAT                                                 00863000
OCSENSE  EQU   OCBACKUP                                                 00864000
QCBLDCB  EQU   IEDQQCB+120                                              00865000
TRMPOOLP EQU   TRMINSEQ                                                 00866000
TRMSRPTR EQU   TRMPLIM                                                  00867000
*                                      START UNREFERENCED COMPONENTS    00868000
QCBEMM   EQU   QCBEQTYP                                                 00869000
@NM00192 EQU   QCBEQTYP                                                 00870000
QCBEFEFO EQU   @NM00191+1                                               00871000
QCBEPRI  EQU   @NM00191                                                 00872000
QCBPFEFO EQU   @NM00186+1                                               00873000
QCBDATFL EQU   @NM00186                                                 00874000
TRMLDISC EQU   TRMLINK                                                  00875000
@NM00180 EQU   TRMLINK                                                  00876000
TRMLALOC EQU   TRMLINK                                                  00877000
TRMLSTAT EQU   TRMLINK                                                  00878000
TRMLINT  EQU   TRMLINK                                                  00879000
TRMEPMOD EQU   TRMLINK                                                  00880000
TRMCDLOG EQU   TRMCDMGR                                                 00881000
@NM00179 EQU   TRMCDMGR                                                 00882000
@NM00178 EQU   TRMCDMGR                                                 00883000
@NM00177 EQU   TRMCDMGR                                                 00884000
@NM00176 EQU   TRMCDMGR                                                 00885000
@NM00175 EQU   TRMCDMGR                                                 00886000
TRMBKDUP EQU   TRMCDMGR                                                 00887000
TRMLULOG EQU   TRMLU                                                    00888000
@NM00174 EQU   TRMLU                                                    00889000
@NM00173 EQU   TRMLU                                                    00890000
@NM00172 EQU   TRMLU                                                    00891000
TRMTDIFF EQU   TRMLU                                                    00892000
@NM00171 EQU   TRMLU                                                    00893000
@NM00170 EQU   TRMLU                                                    00894000
@NM00169 EQU   TRMLU                                                    00895000
TRMPCONT EQU   TRMPU                                                    00896000
TRMPDOCQ EQU   TRMPU                                                    00897000
TRMPULOC EQU   TRMPU                                                    00898000
TRMPDNAS EQU   TRMPU                                                    00899000
TRMPALOC EQU   TRMPU                                                    00900000
TRMNCONT EQU   TRMNCP                                                   00901000
TRMQUCKN EQU   TRMNCP                                                   00902000
TRMSLOWN EQU   TRMNCP                                                   00903000
TRMSYGEN EQU   TRMNCP                                                   00904000
TRMNCPCL EQU   TRMNCP                                                   00905000
TRMCONN  EQU   TRMIPLDM                                                 00906000
TRMINOUT EQU   TRMPRE                                                   00907000
TRMRDOUT EQU   TRMPRE                                                   00908000
TRMNLOUT EQU   TRMPRE                                                   00909000
TRMWROUT EQU   TRMPRE                                                   00910000
TRMASNXI EQU   TRMPRE                                                   00911000
TRMSTMM  EQU   TRMPRE                                                   00912000
TRMCMODE EQU   TRMPRE                                                   00913000
TRMSTPND EQU   TRMPRE                                                   00914000
TRMNCPLK EQU   TRMLINK1                                                 00915000
@NM00168 EQU   TRMLINK1                                                 00916000
TRMDCONN EQU   TRMDCONS                                                 00917000
TRMDCOP  EQU   TRMDCONS                                                 00918000
TRMPMARY EQU   TRMLU1                                                   00919000
TRMLUNAS EQU   TRMLU1                                                   00920000
@NM00167 EQU   TRMLU1                                                   00921000
TRMLSCVP EQU   TRMLU1                                                   00922000
@NM00166 EQU   TRMLU1                                                   00923000
TRMCPOPT EQU   TRMLU1                                                   00924000
TRMCPREQ EQU   TRMLU1                                                   00925000
@NM00165 EQU   TRMNCP1                                                  00926000
TRMANS   EQU   TRMNCP1                                                  00927000
TRMLINOP EQU   TRMNCP1                                                  00928000
TRMINOP  EQU   TRMNCP1                                                  00929000
TRMLYNCH EQU   TRMPRE1                                                  00930000
TRMSPOUT EQU   TRMPRE1                                                  00931000
TRMERLCK EQU   TRMPRE1                                                  00932000
TRMQNPL  EQU   TRMPRE1                                                  00933000
TRMSPACT EQU   TRMPRE1                                                  00934000
TRMOCNI  EQU   TRMPRE1                                                  00935000
TRMSESSN EQU   TRMPRE1                                                  00936000
TRMCONT  EQU   TRMPRE1                                                  00937000
TRMINERR EQU   TRMCDFD0                                                 00938000
TRMLUTM  EQU   TRMCDFD0                                                 00939000
TRMLUIT  EQU   TRMCDFD0                                                 00940000
TRMLUREQ EQU   TRMCDFD0                                                 00941000
TRMCDPRE EQU   TRMCDFD0                                                 00942000
TRMWASCD EQU   TRMCDFD0                                                 00943000
TRMSRPFG EQU   TRMCDFD0                                                 00944000
TRMSESRQ EQU   TRMCDFD0                                                 00945000
@NM00164 EQU   TRMSNAST                                                 00946000
TRMDRSRC EQU   TRMSNAST                                                 00947000
@NM00163 EQU   TRMLUFD0                                                 00948000
TRMNOINP EQU   TRMLUFD0                                                 00949000
TRMASSOC EQU   TRMLUFD0                                                 00950000
TRMAUTO  EQU   TRMLUFD0                                                 00951000
@NM00162 EQU   @NM00161                                                 00952000
TRMENTRY EQU   @NM00161                                                 00953000
@NM00153 EQU   OCIPLDMP                                                 00954000
OCACTRQ  EQU   OCIPLDMP                                                 00955000
OCDACRQ  EQU   OCIPLDMP                                                 00956000
OCIPLRQ  EQU   OCIPLDMP                                                 00957000
OCDMPRQ  EQU   OCIPLDMP                                                 00958000
@NM00152 EQU   OCRESPTR+2                                               00959000
OCOHNATA EQU   OCDIALLN                                                 00960000
OCRRTPTR EQU   OCBKUP3                                                  00961000
@NM00151 EQU   OCBKUP2+4                                                00962000
OCNHITTC EQU   OCBKUP2+2                                                00963000
OCLINTTC EQU   OCBKUP2                                                  00964000
OCCSIB   EQU   @NM00150                                                 00965000
@NM00149 EQU   OCBKUP1+6                                                00966000
OCTARTTC EQU   OCBKUP1+4                                                00967000
OCSRTTC  EQU   OCBKUP1+2                                                00968000
OCRSTTC  EQU   OCBKUP1                                                  00969000
@NM00148 EQU   OCMSGFLG                                                 00970000
OCRRT    EQU   OCMSGFLG                                                 00971000
OCNAME   EQU   OCMSGFLG                                                 00972000
OCLU1TTE EQU   @NM00146+5                                               00973000
OCSFLAG  EQU   @NM00146+4                                               00974000
OCLU2TTI EQU   @NM00146+2                                               00975000
OCLU1TTI EQU   @NM00146                                                 00976000
OCDISTLN EQU   @NM00145+6                                               00977000
OCDISTAD EQU   @NM00145+2                                               00978000
OCDISTNA EQU   @NM00145                                                 00979000
OCICINAC EQU   OCICSW                                                   00980000
@NM00144 EQU   OCICSW                                                   00981000
OCICATST EQU   OCICDADR+1                                               00982000
OCICTYPE EQU   OCICDADR                                                 00983000
@NM00143 EQU   OCCKPKY1                                                 00984000
OCCKPENV EQU   OCCKPKY1                                                 00985000
OCCKPRST EQU   OCCKPTYP                                                 00986000
OCCKPNCP EQU   OCCKPTYP                                                 00987000
OCCKPINC EQU   OCCKPTYP                                                 00988000
@NM00142 EQU   @NM00139+2                                               00989000
@NM00141 EQU   @NM00140                                                 00990000
OCTSTAT  EQU   @NM00140                                                 00991000
OCREASON EQU   @NM00139                                                 00992000
@NM00138 EQU   @NM00137+4                                               00993000
OCOIDEP  EQU   @NM00137                                                 00994000
OPCAQLST EQU   OPCAQWD3+1                                               00995000
OPCAQRQ3 EQU   OPCAQWD3                                                 00996000
OPCAQSEC EQU   OPCAQWD2+1                                               00997000
OPCAQRQ2 EQU   OPCAQWD2                                                 00998000
OPCAQFST EQU   OPCAQWD1+1                                               00999000
OPCAQREQ EQU   OPCAQWD1                                                 01000000
DVCSORTD EQU   DVCSTAT                                                  01001000
@NM00193 EQU   DVCSTAT                                                  01002000
DVCENLTH EQU   IEDQDVCT+1                                               01003000
DVCRSV   EQU   DVCCHAR                                                  01004000
DVCNO    EQU   DVCIDLTH                                                 01005000
QCBERS   EQU   IEDQQCBE+20                                              01006000
QCBELRS  EQU   IEDQQCBE+19                                              01007000
QCBELCB  EQU   QCBEDEOB                                                 01008000
QCBEEOB  EQU   QCBESAVE+3                                               01009000
QCBEMACR EQU   QCBESAVE                                                 01010000
QCBENPLV EQU   IEDQQCBE+9                                               01011000
QCBELGTH EQU   IEDQQCBE+8                                               01012000
QCBETCIN EQU   IEDQQCBE+6                                               01013000
QCBEOSEQ EQU   QCBEDAMT                                                 01014000
QCBEHDR  EQU   QCBECONC                                                 01015000
QCBEPEND EQU   QCBEFLG                                                  01016000
QCBEDATA EQU   QCBEFLG                                                  01017000
QCBEOMSG EQU   QCBEFLG                                                  01018000
QCBESRVC EQU   QCBEFLG                                                  01019000
QCBEHELD EQU   QCBEFLG                                                  01020000
QCBEOPL  EQU   QCBEFLG                                                  01021000
QCBECNT  EQU   QCBEFLG                                                  01022000
QCBESTAT EQU   QCBEFLG                                                  01023000
@NM00190 EQU   IEDRATIQ                                                 01024000
QCBSTGQA EQU   IEDRQCBP+4                                               01025000
QCBSTGQL EQU   IEDRQCBP                                                 01026000
@NM00189 EQU   QCBPASCF+1                                               01027000
@NM00188 EQU   QCBASCFG                                                 01028000
QCBTRMNG EQU   QCBASCFG                                                 01029000
QCBTTCIN EQU   QCBPLCBA+1                                               01030000
@NM00187 EQU   QCBPLCBA                                                 01031000
QCBRAPMH EQU   QCBSTAT1                                                 01032000
QCBFLUSH EQU   QCBSTAT1                                                 01033000
QCBNDXRQ EQU   QCBSTAT1                                                 01034000
QCBESIG  EQU   QCBSTAT1                                                 01035000
QCBRCVRQ EQU   QCBSTAT1                                                 01036000
QCBSNDRQ EQU   QCBSTAT1                                                 01037000
QCBWAITC EQU   QCBSTAT1                                                 01038000
QCBPLCBN EQU   QCBSTAT1                                                 01039000
QCBCHAIN EQU   IEDNQCB                                                  01040000
QCBPQBCK EQU   IEDQPQCB+25                                              01041000
QCBPRIPQ EQU   IEDQPQCB+24                                              01042000
QCBCFHDR EQU   IEDQPQCB+21                                              01043000
QCBLFEFO EQU   IEDQPQCB+18                                              01044000
QCBFFEFO EQU   IEDQPQCB+15                                              01045000
QCBPREVF EQU   QCBINTLF                                                 01046000
QCBINTFF EQU   IEDQPQCB+9                                               01047000
QCBDATSQ EQU   QCBFHDTZ+1                                               01048000
@NM00185 EQU   QCBFHDTZ                                                 01049000
QCBDNHDR EQU   IEDQPQCB                                                 01050000
QCBQBACK EQU   IEDQQCB+37                                               01051000
QCBCKPT  EQU   QCBFLAG                                                  01052000
QCBPROC  EQU   QCBFLAG                                                  01053000
QCBSDFFO EQU   QCBFLAG                                                  01054000
QCBTERMQ EQU   QCBFLAG                                                  01055000
QCBRSRV  EQU   QCBFLAG                                                  01056000
QCBREAD  EQU   QCBFLAG                                                  01057000
QCBNOBRK EQU   QCBFLAG                                                  01058000
QCBTSSES EQU   QCBFLAG                                                  01059000
QCBLGBAD EQU   QCBDCBAD                                                 01060000
QCBRELLN EQU   IEDQQCB+32                                               01061000
QCBTJID  EQU   QCBLKRRN+1                                               01062000
QCBCARCT EQU   QCBLKRRN                                                 01063000
QCBPRLVL EQU   QCBPREN+4                                                01064000
QCBSLPIU EQU   QCBPREN                                                  01065000
QCBMSGCT EQU   IEDQQCB+26                                               01066000
QCBRBACK EQU   QCBEXTO                                                  01067000
QCBDISC  EQU   QCBTSOF1                                                 01068000
QCBDELAY EQU   QCBTSOF1                                                 01069000
QCBPARTO EQU   QCBTSOF1                                                 01070000
QCBSATRD EQU   QCBTSOF1                                                 01071000
QCBNOBUF EQU   QCBTSOF1                                                 01072000
QCBTPUT  EQU   QCBTSOF1                                                 01073000
QCBTGET  EQU   QCBTSOF1                                                 01074000
QCBWRBRK EQU   QCBTSOF1                                                 01075000
QCBSATLC EQU   QCBTSOF2                                                 01076000
QCBSATTI EQU   QCBTSOF2                                                 01077000
QCBSATCH EQU   QCBTSOF2                                                 01078000
QCBSIMRD EQU   QCBTSOF2                                                 01079000
QCBDSSMI EQU   QCBTSOF2                                                 01080000
QCBPOSTO EQU   QCBTSOF2                                                 01081000
QCBBUFQ  EQU   QCBTSOF2                                                 01082000
QCBMTP   EQU   QCBINHBN                                                 01083000
QCBSATCT EQU   QCBNBACK                                                 01084000
QCBSCBOF EQU   IEDQQCB+20                                               01085000
QCBTIME  EQU   QCBSTAT                                                  01086000
QCBCLOCK EQU   QCBSTAT                                                  01087000
QCBSCHDL EQU   QCBSTAT                                                  01088000
QCBSMODE EQU   QCBSTAT                                                  01089000
QCBSEND  EQU   QCBSTAT                                                  01090000
QCBBUFRD EQU   QCBSTAT                                                  01091000
QCBTRMHO EQU   QCBSTAT                                                  01092000
QCBEOM   EQU   QCBSTAT                                                  01093000
QCBHUCT  EQU   QCBRETCT                                                 01094000
QCBIEND  EQU   QCBRETCT                                                 01095000
QCBEND   EQU   QCBRETCT                                                 01096000
QCBNL    EQU   QCBRETCT                                                 01097000
QCBLOGCT EQU   QCBRETCT                                                 01098000
@NM00184 EQU   QCBBYTE1                                                 01099000
QCBRITRM EQU   QCBBYTE1                                                 01100000
@NM00183 EQU   QCBEOLDT                                                 01101000
QCBSLINK EQU   IEDQQCB+13                                               01102000
QCBSTPRI EQU   IEDQQCB+12                                               01103000
QCBSTCHN EQU   IEDQQCB+9                                                01104000
QCBSTVTO EQU   IEDQQCB+8                                                01105000
QCBLINK  EQU   IEDQQCB+5                                                01106000
QCBPRI   EQU   IEDQQCB+4                                                01107000
QCBCNTEN EQU   QCBELCHN+2                                               01108000
@NM00182 EQU   QCBELCHN+2                                               01109000
@NM00181 EQU   QCBELCHN                                                 01110000
QCBHELD  EQU   QCBDSFLG                                                 01111000
QCBFQCB  EQU   QCBDSFLG                                                 01112000
QCBALTMH EQU   QCBDSFLG                                                 01113000
QCBREUS  EQU   QCBDISK                                                  01114000
QCBNREUS EQU   QCBDISK                                                  01115000
QCBCORE  EQU   QCBDSFLG                                                 01116000
QCBTSQ   EQU   QCBDSFLG                                                 01117000
TRMSUBST EQU   IEDNTRM+22                                               01118000
TRMTYPE  EQU   IEDNTRM+21                                               01119000
TRMPRIME EQU   TRMLGBST                                                 01120000
TRMOWNR  EQU   TRMLBUFR+1                                               01121000
TRMGPCNT EQU   TRMLBUFR                                                 01122000
TRMBUFRD EQU   TRMBYTE0                                                 01123000
TRMSNA   EQU   TRMBYTE0                                                 01124000
TRMGP    EQU   TRMBYTE0                                                 01125000
TRMDIAL  EQU   TRMBYTE0                                                 01126000
TRMACDC  EQU   TRMNOWCD                                                 01127000
TRMOUTPT EQU   TRMBYTE0                                                 01128000
TRMINPUT EQU   TRMBYTE0                                                 01129000
TRMUDEF  EQU   TRMBYTE0                                                 01130000
TRMCOHRT EQU   IEDNTRM+14                                               01131000
TRMSTOTE EQU   TRMBYTE1                                                 01132000
TRMCKPRN EQU   TRMBYTE1                                                 01133000
TRMTSATN EQU   TRMBYTE1                                                 01134000
TRMTRACE EQU   TRMBYTE1                                                 01135000
TRMSWBCK EQU   TRMBYTE1                                                 01136000
TRMAUTOC EQU   TRMBYTE1                                                 01137000
TRMINPTP EQU   TRMBYTE1                                                 01138000
TRMWTNEG EQU   TRMSCPRQ                                                 01139000
TRMWRBRK EQU   TRMBYTE2                                                 01140000
TRMNOSND EQU   TRMBYTE2                                                 01141000
TRMPREP  EQU   TRMBYTE2                                                 01142000
TRMGPACT EQU   TRMBYTE2                                                 01143000
TRMANDL  EQU   TRMBYTE2                                                 01144000
TRMCLOSN EQU   TRMINPG                                                  01145000
TRMREMB  EQU   TRMBYTE2                                                 01146000
TRMRSACT EQU   TRMBYTE2                                                 01147000
TRMCINOP EQU   TRMCDF0                                                  01148000
TRMRSTPD EQU   TRMCDF0                                                  01149000
TRMCLNXI EQU   TRMCDF0                                                  01150000
TRMDVAS0 EQU   TRMCDF0                                                  01151000
TRMPURGE EQU   TRMCDF0                                                  01152000
TRMCDST  EQU   TRMINDEX                                                 01153000
TRMASNDX EQU   TRMATNDX                                                 01154000
TRMBYTE8 EQU   TRMDIALQ+1                                               01155000
@NM00160 EQU   TRMDIALQ                                                 01156000
@NM00159 EQU   IEDNTRM                                                  01157000
TRMOPTBL EQU   IEDQTRM+18                                               01158000
TRMLOCAD EQU   TRMSENSE                                                 01159000
TRMTEMPR EQU   TRMAPB+2                                                 01160000
TRMNADDR EQU   TRMOWNER                                                 01161000
@NM00158 EQU   TRMDEVFL+1                                               01162000
TRMTPIN  EQU   TRMDEVFL+1                                               01163000
@NM00157 EQU   TRMNCPI                                                  01164000
TRMRNTRM EQU   TRMDEVFL+1                                               01165000
@NM00156 EQU   TRMDEVFL+1                                               01166000
TRMLMD   EQU   TRMDEVFL+1                                               01167000
TRMTSOB  EQU   TRMDEVFL                                                 01168000
TRMBFDY  EQU   TRMDEVFL                                                 01169000
TRMTBLK  EQU   TRMDEVFL                                                 01170000
TRMSBLK  EQU   TRMDEVFL                                                 01171000
TRMBLKS  EQU   TRMDEVFL                                                 01172000
TRMSCV   EQU   TRMADDC                                                  01173000
TRMDDIG  EQU   TRMDEVFL                                                 01174000
TRMBUFS  EQU   TRMDEVFL                                                 01175000
TRMSTEAL EQU   TRMPRILK                                                 01176000
TRMLGB   EQU   TRMDSORG                                                 01177000
TRMUTERM EQU   TRMSESCT                                                 01178000
TRMVERIF EQU   TRMRSTRT                                                 01179000
@NM00155 EQU   TRMRSTRT                                                 01180000
@NM00154 EQU   TRMDESTQ                                                 01181000
TRMSCNYN EQU   TRMSTATE                                                 01182000
TRMHELDN EQU   TRMSTATE                                                 01183000
TRMACPTN EQU   TRMSTATE                                                 01184000
TRMPREF  EQU   TRMSTATE                                                 01185000
TRMPROC  EQU   TRMLOG                                                   01186000
TRMLIST  EQU   TRMLOG                                                   01187000
TRMLINE  EQU   TRMSTATE                                                 01188000
@NM00147 EQU   OCLDNME+6                                                01189000
OC1SQID  EQU   OCLDNME+4                                                01190000
OCWAITPC EQU   OCPREFLG                                                 01191000
OCSRCCLN EQU   OCPREFLG                                                 01192000
OCREMCON EQU   OCPREFLG                                                 01193000
OCCLNUP  EQU   OCPREFLG                                                 01194000
OCTOTEP  EQU   OCPREFLG                                                 01195000
OCREPOST EQU   OCPREFLG                                                 01196000
OCRSPSNT EQU   OCPREFLG                                                 01197000
OCBFREQ  EQU   OCPREFLG                                                 01198000
OCIDLE   EQU   OCREQFLG                                                 01199000
OCFORCE  EQU   OCREQFLG                                                 01200000
OCDCARD  EQU   OCREQFLG                                                 01201000
OCPARTAL EQU   OCREQFLG                                                 01202000
OCADNCP  EQU   OCREQFLG                                                 01203000
OCRMPORQ EQU   OCREQFLG                                                 01204000
OCCDLACT EQU   OCREQFLG                                                 01205000
OCFLUSHZ EQU   OCREQFLG                                                 01206000
OCRESPCT EQU   OCLINTTE                                                 01207000
@NM00136 EQU   IEDQOPCE+60                                              01208000
OCURC    EQU   OCOID                                                    01209000
OCCKPTWA EQU   OCCKDATA+4                                               01210000
OCSRCTTC EQU   OCNCP                                                    01211000
OCCKDAT2 EQU   OC379RRT+1                                               01212000
OCCKDAT1 EQU   OC379RRT                                                 01213000
OCECHOPT EQU   OCPTRSAV                                                 01214000
OCPUADR  EQU   OCIPLWA+2                                                01215000
OCWTGSAV EQU   OCIPLWA                                                  01216000
OCDVRDCT EQU   OCBACKUP+6                                               01217000
@NM00135 EQU   OCBACKUP+4                                               01218000
OCBUFRET EQU   OCCOUNT2                                                 01219000
OCBUFUSD EQU   OCCOUNT1                                                 01220000
OCWTG    EQU   IEDQOPCE+30                                              01221000
OCRESNUM EQU   OCPARM                                                   01222000
OCSEQ    EQU   OCTRUNIT+2                                               01223000
OCTYPTRM EQU   OCFLAG1                                                  01224000
OCNONE   EQU   OCALSTAT                                                 01225000
OCSOME   EQU   OCALSTAT                                                 01226000
OCALLFLG EQU   OCALSTAT                                                 01227000
OCACTREQ EQU   OCALSTAT                                                 01228000
OCREDRVE EQU   OCALSTAT                                                 01229000
OCSEQIND EQU   OCALSTAT                                                 01230000
OCDACTIP EQU   OCFNAALL                                                 01231000
OCRENTRD EQU   OCALSTAT                                                 01232000
OCDIALX  EQU   OCWTGB                                                   01233000
OCTRMTBL EQU   IEDQOPCE+20                                              01234000
OCATNDX  EQU   OCMSTSAV+2                                               01235000
OCREQVAL EQU   OCDEST+1                                                 01236000
OCCONID  EQU   OCDEST                                                   01237000
OCLOCAD  EQU   OCRLN                                                    01238000
OCRESP   EQU   OCFLAG                                                   01239000
OCATTACH EQU   OCFLAG                                                   01240000
OCSSCP   EQU   OCFLAG                                                   01241000
OCOUTPUT EQU   OCFLAG                                                   01242000
OCLINE   EQU   OCFLAG                                                   01243000
OCMPP    EQU   OCFLAG                                                   01244000
OCTOTE   EQU   OCFLAG                                                   01245000
OCCONSOL EQU   OCFLAG                                                   01246000
@NM00134 EQU   OCSWITCH                                                 01247000
OCQUCKN  EQU   OCSWITCH                                                 01248000
OCPRIFLG EQU   OCOPTCDE                                                 01249000
@NM00133 EQU   OCUNITBF                                                 01250000
OCINVTIC EQU   OCUNITBF                                                 01251000
@NM00132 EQU   OCUNITBF                                                 01252000
@NM00131 EQU   @NM00130                                                 01253000
@NM00129 EQU   OCSCAN                                                   01254000
OCNOTUCB EQU   OCSCAN                                                   01255000
OCNONAME EQU   OCSCAN                                                   01256000
OCALLRLN EQU   OCSCAN                                                   01257000
OCDDNAME EQU   OCSCAN                                                   01258000
OCDDNRLN EQU   OCSCAN                                                   01259000
OCADDR   EQU   OCSCAN                                                   01260000
OCELMPTR EQU   OCELEM+1                                                 01261000
OCELMPRI EQU   OCELEM                                                   01262000
OPCBOTTM EQU   IEDQOPCD+3644                                            01263000
@NM00128 EQU   IEDQOPCD+1948                                            01264000
@NM00127 EQU   IEDQOPCD+1860                                            01265000
@NM00126 EQU   IEDQOPCD+1772                                            01266000
@NM00125 EQU   IEDQOPCD+1696                                            01267000
@NM00124 EQU   IEDQOPCD+1620                                            01268000
OPCDSRWT EQU   IEDQOPCD+1616                                            01269000
@NM00123 EQU   IEDQOPCD+1532                                            01270000
@NM00122 EQU   IEDQOPCD+1336                                            01271000
@NM00121 EQU   IEDQOPCD+1328                                            01272000
@NM00120 EQU   IEDQOPCD+528                                             01273000
OPCRSTRS EQU   IEDQOPCD+524                                             01274000
OPCSAVES EQU   IEDQOPCD+520                                             01275000
OPCRSPBD EQU   IEDQOPCD+516                                             01276000
OPCNFY03 EQU   IEDQOPCD+512                                             01277000
OPCNFY01 EQU   IEDQOPCD+508                                             01278000
OPCURC   EQU   IEDQOPCD+504                                             01279000
OPCCINBD EQU   IEDQOPCD+500                                             01280000
OPCCRKEY EQU   IEDQOPCD+496                                             01281000
OPCDRSET EQU   IEDQOPCD+492                                             01282000
OPCDRCLN EQU   IEDQOPCD+488                                             01283000
OPCDRDEL EQU   IEDQOPCD+484                                             01284000
OPCDRLOD EQU   IEDQOPCD+480                                             01285000
OPCDRLOC EQU   IEDQOPCD+476                                             01286000
OPCDRCVT EQU   IEDQOPCD+472                                             01287000
OPCDRFST EQU   IEDQOPCD+468                                             01288000
OPCLSABC EQU   IEDQOPCD+466                                             01289000
@NM00119 EQU   IEDQOPCD+465                                             01290000
@NM00118 EQU   OPCSESSF                                                 01291000
OPCUNIQV EQU   OPCUNIQP+2                                               01292000
OPCUNIQU EQU   OPCUNIQP                                                 01293000
OPCOSSCP EQU   OPCPCID                                                  01294000
@NM00117 EQU   IEDQOPCD+452                                             01295000
@NM00116 EQU   IEDQOPCD+448                                             01296000
OPCSDUPU EQU   IEDQOPCD+444                                             01297000
OPCSDULU EQU   IEDQOPCD+440                                             01298000
OPCSDRVT EQU   IEDQOPCD+436                                             01299000
OPCSDRET EQU   IEDQOPCD+432                                             01300000
OPCSDHSY EQU   IEDQOPCD+428                                             01301000
OPCSDENQ EQU   IEDQOPCD+424                                             01302000
OPCSDDIA EQU   IEDQOPCD+420                                             01303000
OPCSDAPU EQU   IEDQOPCD+416                                             01304000
OPCSDALU EQU   IEDQOPCD+412                                             01305000
OPCCSKEY EQU   IEDQOPCD+408                                             01306000
OPCSSKEY EQU   IEDQOPCD+404                                             01307000
OPCPRTTE EQU   IEDQOPCD+400                                             01308000
OPCLU2TT EQU   OPCSESS+14                                               01309000
OPCLU1TT EQU   OPCSESS+12                                               01310000
OPCSNSU2 EQU   OPCSNSUS+1                                               01311000
OPCSNSU1 EQU   OPCSNSUS                                                 01312000
OPCSNSMN EQU   OPCSNSSY+1                                               01313000
OPCSNSMJ EQU   OPCSNSSY                                                 01314000
OPCCSIB  EQU   OPCSESS+4                                                01315000
OPCCTTE  EQU   OPCSESS+1                                                01316000
@NM00115 EQU   OPCSFLAG                                                 01317000
OPCISQUD EQU   OPCSFLAG                                                 01318000
OPCERRST EQU   OPCSFLAG                                                 01319000
OPCISRSP EQU   OPCSFLAG                                                 01320000
OPCISQUE EQU   OPCSFLAG                                                 01321000
OPCRAPMH EQU   OPCSFLAG                                                 01322000
OPCRAPI  EQU   OPCSFLAG                                                 01323000
OPCGTSIB EQU   IEDQOPCD+380                                             01324000
@NM00114 EQU   OPCPWCOB+9                                               01325000
@NM00113 EQU   OPCPWCOB+8                                               01326000
@NM00112 EQU   OPCPWECB+1                                               01327000
OPCPWCCC EQU   OPCPWECB                                                 01328000
OPCPWCHN EQU   OPCPWQCB+1                                               01329000
OPCPWVTO EQU   OPCPWQCB                                                 01330000
OPCWAITV EQU   IEDQOPCD+364                                             01331000
OPCTOTCK EQU   IEDQOPCD+360                                             01332000
OPCAPXTL EQU   IEDQOPCD+356                                             01333000
OPCDECR  EQU   IEDQOPCD+352                                             01334000
OPCBUFWT EQU   IEDQOPCD+348                                             01335000
OPCWRKSP EQU   IEDQOPCD+320                                             01336000
OPCADGOT EQU   IEDQOPCD+318                                             01337000
OPCRQCNT EQU   IEDQOPCD+316                                             01338000
OPPOLSTP EQU   IEDQOPCD+312                                             01339000
OPCCKCIB EQU   IEDQOPCD+308                                             01340000
OPCEND   EQU   IEDQOPCD+307                                             01341000
OPCSTCBS EQU   IEDQOPCD+306                                             01342000
OPCHNEND EQU   IEDQOPCD+302                                             01343000
OPCOQSW  EQU   IEDQOPCD+301                                             01344000
@NM00111 EQU   OPCSPEC                                                  01345000
@NM00110 EQU   OPCSPEC                                                  01346000
@NM00109 EQU   OPCSPEC                                                  01347000
@NM00108 EQU   OPCSPEC                                                  01348000
OPCFRMCA EQU   OPCSPEC                                                  01349000
OPCRSTRT EQU   OPCSPEC                                                  01350000
OPCPART  EQU   OPCSPEC                                                  01351000
OPCALTD  EQU   OPCSPEC                                                  01352000
OPCBFEND EQU   IEDQOPCD+296                                             01353000
OPCBFIRS EQU   IEDQOPCD+292                                             01354000
OPCAVBUF EQU   IEDQOPCD+290                                             01355000
OPCIPLCT EQU   IEDQOPCD+289                                             01356000
OPCCLNTS EQU   IEDQOPCD+288                                             01357000
OPCHA8   EQU   IEDQOPCD+286                                             01358000
OPCBFREQ EQU   IEDQOPCD+284                                             01359000
OPCFREBF EQU   IEDQOPCD+280                                             01360000
OPCGETBF EQU   IEDQOPCD+276                                             01361000
OPCNEXT  EQU   IEDQOPCD+272                                             01362000
OPCFMDFC EQU   IEDQOPCD+268                                             01363000
OPCSCNC  EQU   IEDQOPCD+264                                             01364000
OPCHORTG EQU   IEDQOPCD+260                                             01365000
OPCHORT  EQU   IEDQOPCD+256                                             01366000
OPCCKPTL EQU   IEDQOPCD+252                                             01367000
OPCCKPTF EQU   IEDQOPCD+248                                             01368000
OPCWAITA EQU   IEDQOPCD+244                                             01369000
OPCWAITR EQU   IEDQOPCD+240                                             01370000
OPCWAITP EQU   IEDQOPCD+236                                             01371000
OPCWAITO EQU   IEDQOPCD+232                                             01372000
OPCWAITN EQU   IEDQOPCD+228                                             01373000
OPCWAITL EQU   IEDQOPCD+224                                             01374000
OPCWAITC EQU   IEDQOPCD+220                                             01375000
@NM00107 EQU   OPCLDNME+5                                               01376000
OPCMODID EQU   OPCLDNME+3                                               01377000
@NM00106 EQU   OPCLDNME                                                 01378000
OPCXCTL  EQU   IEDQOPCD+204                                             01379000
OPCWAIT  EQU   IEDQOPCD+192                                             01380000
OPCCKERB EQU   IEDQOPCD+164                                             01381000
OPCBFERB EQU   IEDQOPCD+148                                             01382000
OPCFLAG2 EQU   IEDQOPCD+147                                             01383000
OPCFLAG1 EQU   IEDQOPCD+146                                             01384000
OPCWRKSZ EQU   IEDQOPCD+144                                             01385000
OPCWORK  EQU   IEDQOPCD+140                                             01386000
OPCRSAVE EQU   IEDQOPCD+132                                             01387000
OPCQCBAD EQU   IEDQOPCD+128                                             01388000
OPCTRMWA EQU   IEDQOPCD+52                                              01389000
OPCPSTWT EQU   IEDQOPCD+48                                              01390000
OPCTNTEA EQU   IEDQOPCD+44                                              01391000
OPCPGCK  EQU   IEDQOPCD+40                                              01392000
OPCLCB   EQU   IEDQOPCD+36                                              01393000
OPCTRACE EQU   IEDQOPCD+32                                              01394000
OPCIPLAD EQU   IEDQOPCD+28                                              01395000
OPCOPTLK EQU   IEDQOPCD+20                                              01396000
OPCDCBLK EQU   IEDQOPCD+16                                              01397000
OPCAVTPT EQU   IEDQOPCD+8                                               01398000
SAVTSMAX EQU   IEDNSVTD+500                                             01399000
SAVTSINO EQU   IEDNSVTD+498                                             01400000
SAVTAMAX EQU   IEDNSVTD+496                                             01401000
SAVTAENO EQU   IEDNSVTD+494                                             01402000
SAVTAINO EQU   IEDNSVTD+492                                             01403000
SAVTNMAX EQU   IEDNSVTD+490                                             01404000
SAVTNENO EQU   IEDNSVTD+488                                             01405000
SAVTNINO EQU   IEDNSVTD+486                                             01406000
SAVTRSZE EQU   IEDNSVTD+484                                             01407000
SAVTRMAX EQU   IEDNSVTD+482                                             01408000
SAVTRENO EQU   IEDNSVTD+480                                             01409000
SAVTRINO EQU   IEDNSVTD+478                                             01410000
SAVTRMIN EQU   IEDNSVTD+476                                             01411000
SAVTPMID EQU   IEDNSVTD+474                                             01412000
SAVTRRTC EQU   IEDNSVTD+472                                             01413000
SAVTLUSG EQU   IEDNSVTD+468                                             01414000
SAVTACNQ EQU   IEDNSVTD+464                                             01415000
SAVTCM20 EQU   IEDNSVTD+460                                             01416000
SAVTCFDC EQU   IEDNSVTD+456                                             01417000
SAVTCMOT EQU   IEDNSVTD+452                                             01418000
SAVTCMIN EQU   IEDNSVTD+448                                             01419000
SAVTCPCH EQU   IEDNSVTD+444                                             01420000
SAVTCRGT EQU   IEDNSVTD+440                                             01421000
SAVTNALC EQU   IEDNSVTD+436                                             01422000
SAVTATCT EQU   IEDNSVTD+434                                             01423000
SAVTCRIU EQU   IEDNSVTD+432                                             01424000
SAVTCRHI EQU   IEDNSVTD+430                                             01425000
SAVTCRIB EQU   IEDNSVTD+428                                             01426000
SAVTLCQ  EQU   IEDNSVTD+424                                             01427000
SAVTDRSR EQU   IEDNSVTD+420                                             01428000
SAVTATPT EQU   IEDNSVTD+416                                             01429000
SAVTCSMI EQU   IEDNSVTD+412                                             01430000
SAVTNXCR EQU   IEDNSVTD+408                                             01431000
SAVTCRPT EQU   IEDNSVTD+404                                             01432000
SAVTCIPH EQU   IEDNSVTD+400                                             01433000
SAVTBTCO EQU   IEDNSVTD+396                                             01434000
SAVTBTCI EQU   IEDNSVTD+392                                             01435000
SAVTBPCO EQU   IEDNSVTD+388                                             01436000
SAVTBPCI EQU   IEDNSVTD+384                                             01437000
SAVTLLCB EQU   IEDNSVTD+380                                             01438000
SAVTSCF0 EQU   IEDNSVTD+376                                             01439000
SAVTLSNY EQU   IEDNSVTD+372                                             01440000
SAVTLSZP EQU   IEDNSVTD+368                                             01441000
SAVTOMSU EQU   IEDNSVTD+364                                             01442000
SAVTGTSB EQU   IEDNSVTD+360                                             01443000
SAVTHIBL EQU   IEDNSVTD+356                                             01444000
SAVTHISY EQU   IEDNSVTD+352                                             01445000
SAVTNAX2 EQU   IEDNSVTD+348                                             01446000
SAVTCDRU EQU   IEDNSVTD+344                                             01447000
SAVTPOLC EQU   IEDNSVTD+342                                             01448000
SAVTPOLM EQU   IEDNSVTD+340                                             01449000
SAVTPOLR EQU   IEDNSVTD+336                                             01450000
SAVTCDRN EQU   SAVTCDRV                                                 01451000
SAVTPOLL EQU   IEDNSVTD+328                                             01452000
SAVTPOLN EQU   IEDNSVTD+326                                             01453000
@NM00105 EQU   IEDNSVTD+325                                             01454000
@NM00104 EQU   SAVTNETF                                                 01455000
SAVTSDIS EQU   SAVTNETF                                                 01456000
SAVTROUT EQU   SAVTNETF                                                 01457000
SAVTNETW EQU   SAVTNETF                                                 01458000
SAVTDIAL EQU   IEDNSVTD+320                                             01459000
SAVTRQUT EQU   IEDNSVTD+316                                             01460000
SAVTBITN EQU   IEDNSVTD+312                                             01461000
@NM00103 EQU   SAVTCKQB+8                                               01462000
@NM00102 EQU   SAVTCKEC+1                                               01463000
@NM00101 EQU   SAVTCKCC                                                 01464000
SAVTCKPO EQU   SAVTCKCC                                                 01465000
SAVTCKWA EQU   SAVTCKCC                                                 01466000
SAVTCKCH EQU   SAVTCKTB+1                                               01467000
SAVTCKVT EQU   SAVTCKTB                                                 01468000
@NM00100 EQU   IEDNSVTD+297                                             01469000
SAVTRDFG EQU   SAVTRDRV+12                                              01470000
@NM00099 EQU   SAVTRDRV+5                                               01471000
SAVTRDPY EQU   SAVTRDRV+4                                               01472000
SAVTRDQB EQU   SAVTRDRV+1                                               01473000
SAVTRDKY EQU   SAVTRDRV                                                 01474000
SAVTNID  EQU   IEDNSVTD+280                                             01475000
SAVTDVAS EQU   IEDNSVTD+276                                             01476000
SAVTPLSZ EQU   IEDNSVTD+274                                             01477000
@NM00098 EQU   IEDNSVTD+273                                             01478000
SAVTSUBL EQU   IEDNSVTD+272                                             01479000
@NM00097 EQU   SAVTZELM+1                                               01480000
SAVTSUBM EQU   SAVTZELM                                                 01481000
SAVTMHDX EQU   IEDNSVTD+268                                             01482000
SAVTNAT1 EQU   IEDNSVTD+266                                             01483000
SAVTSH20 EQU   IEDNSVTD+264                                             01484000
SAVTLCBS EQU   IEDNSVTD+260                                             01485000
SAVTRNMP EQU   IEDNSVTD+256                                             01486000
SAVTTNTX EQU   IEDNSVTD+252                                             01487000
SAVTNAX  EQU   IEDNSVTD+248                                             01488000
SAVTSUBV EQU   IEDNSVTD+247                                             01489000
SAVTSUBA EQU   IEDNSVTD+246                                             01490000
SAVTSIBC EQU   IEDNSVTD+244                                             01491000
SAVTBSM  EQU   IEDNSVTD+240                                             01492000
SAVTSCPT EQU   SAVTTCPU                                                 01493000
SAVTRQTG EQU   IEDNSVTD+236                                             01494000
SAVTRQCH EQU   IEDNSVTD+232                                             01495000
SAVTMAND EQU   IEDNSVTD+228                                             01496000
SAVTSPLN EQU   IEDNSVTD+224                                             01497000
SAVTNADL EQU   IEDNSVTD+222                                             01498000
SAVTNATL EQU   IEDNSVTD+220                                             01499000
SAVTMHTB EQU   IEDNSVTD+216                                             01500000
SAVTSSMH EQU   IEDNSVTD+212                                             01501000
SAVTQRS  EQU   IEDNSVTD+208                                             01502000
SAVTRQIN EQU   IEDNSVTD+204                                             01503000
SAVTDFCO EQU   IEDNSVTD+200                                             01504000
SAVTSAO  EQU   IEDNSVTD+196                                             01505000
SAVTSARI EQU   IEDNSVTD+192                                             01506000
SAVTSAC  EQU   IEDNSVTD+188                                             01507000
SAVTSAI  EQU   IEDNSVTD+184                                             01508000
SAVTCSCI EQU   IEDNSVTD+180                                             01509000
SAVTSSRP EQU   IEDNSVTD+176                                             01510000
SAVTSSRQ EQU   IEDNSVTD+172                                             01511000
SAVTEP   EQU   SAVTSCLU                                                 01512000
SAVTXTRQ EQU   IEDNSVTD+164                                             01513000
SAVTMVBF EQU   IEDNSVTD+160                                             01514000
@NM00096 EQU   IEDNSVTD+148                                             01515000
SAVTIPCQ EQU   IEDNSVTD+144                                             01516000
@NM00095 EQU   IEDNSVTD+136                                             01517000
SAVTXFMI EQU   IEDNSVTD+132                                             01518000
@NM00094 EQU   IEDNSVTD+124                                             01519000
SAVTXFMO EQU   IEDNSVTD+120                                             01520000
@NM00093 EQU   IEDNSVTD+116                                             01521000
SAVTSSSR EQU   IEDNSVTD+112                                             01522000
SAVTSCPQ EQU   IEDNSVTD+108                                             01523000
SAVTSLCB EQU   IEDNSVTD+104                                             01524000
SAVTLUSR EQU   IEDNSVTD+100                                             01525000
@NM00092 EQU   SAVTLUSQ+8                                               01526000
SAVTLUSP EQU   SAVTLUSQ+4                                               01527000
SAVTLUSB EQU   SAVTLUSQ                                                 01528000
@NM00091 EQU   IEDNSVTD+84                                              01529000
SAVTSAT  EQU   IEDNSVTD+80                                              01530000
SAVTNAT  EQU   IEDNSVTD+76                                              01531000
SAVTCLUP EQU   IEDNSVTD+72                                              01532000
SAVTPIUT EQU   IEDNSVTD+68                                              01533000
SAVTRNTA EQU   IEDNSVTD+64                                              01534000
SAVTDNIR EQU   IEDNSVTD+60                                              01535000
SAVTCNIR EQU   IEDNSVTD+56                                              01536000
SAVTFLDH EQU   IEDNSVTD+52                                              01537000
SAVTSRTN EQU   IEDNSVTD+48                                              01538000
SAVTSREQ EQU   IEDNSVTD+44                                              01539000
SAVTFAIL EQU   IEDNSVTD+42                                              01540000
SAVTSUSE EQU   IEDNSVTD+40                                              01541000
SAVTSIB  EQU   IEDNSVTD+36                                              01542000
SAVTPRTN EQU   IEDNSVTD+32                                              01543000
@NM00090 EQU   IEDNSVTD+28                                              01544000
SAVTWH20 EQU   IEDNSVTD+26                                              01545000
SAVTPWT  EQU   IEDNSVTD+24                                              01546000
SAVTPRTQ EQU   IEDNSVTD+20                                              01547000
SAVTPREQ EQU   IEDNSVTD+16                                              01548000
SAVTPH20 EQU   IEDNSVTD+14                                              01549000
SAVTPUSE EQU   IEDNSVTD+12                                              01550000
SAVTPLCB EQU   IEDNSVTD+8                                               01551000
SAVTPOOL EQU   IEDNSVTD+4                                               01552000
SAVTPRMT EQU   SAVTDIAF                                                 01553000
SAVTVIRT EQU   SAVTDIAF                                                 01554000
AVTTVT   EQU   IEDQAVTD+1268                                            01555000
AVTSITS  EQU   IEDQAVTD+1264                                            01556000
AVTMSUHI EQU   IEDQAVTD+1260                                            01557000
AVTSITU  EQU   IEDQAVTD+1256                                            01558000
AVTSITP  EQU   IEDQAVTD+1252                                            01559000
AVTPADDR EQU   IEDQAVTD+1248                                            01560000
@NM00089 EQU   IEDQAVTD+1246                                            01561000
AVTCPBNO EQU   IEDQAVTD+1244                                            01562000
AVTHRESS EQU   IEDQAVTD+1243                                            01563000
@NM00088 EQU   IEDQAVTD+1242                                            01564000
@NM00087 EQU   IEDQAVTD+1241                                            01565000
@NM00086 EQU   IEDQAVTD+1240                                            01566000
@NM00085 EQU   IEDQAVTD+1237                                            01567000
@NM00084 EQU   IEDQAVTD+1236                                            01568000
AVTHRESE EQU   @NM00083                                                 01569000
AVTRADDR EQU   IEDQAVTD+1228                                            01570000
AVTNADDR EQU   IEDQAVTD+1224                                            01571000
AVTHRESN EQU   IEDQAVTD+1220                                            01572000
AVTVOLRN EQU   IEDQAVTD+1216                                            01573000
AVTTOTNN EQU   IEDQAVTD+1212                                            01574000
AVTTRCYN EQU   IEDQAVTD+1208                                            01575000
AVTRCTRN EQU   IEDQAVTD+1204                                            01576000
AVTNOVON EQU   IEDQAVTD+1200                                            01577000
AVTADEBN EQU   IEDQAVTD+1196                                            01578000
AVTVOLRR EQU   IEDQAVTD+1192                                            01579000
AVTTOTNR EQU   IEDQAVTD+1188                                            01580000
AVTTRCYR EQU   IEDQAVTD+1184                                            01581000
AVTRCTRR EQU   IEDQAVTD+1180                                            01582000
AVTNOVOR EQU   IEDQAVTD+1176                                            01583000
AVTADEBR EQU   IEDQAVTD+1172                                            01584000
AVTLODPT EQU   IEDQAVTD+1168                                            01585000
AVTIOBN  EQU   IEDQAVTD+1164                                            01586000
AVTIOBR  EQU   IEDQAVTD+1160                                            01587000
AVTCPBPT EQU   IEDQAVTD+1156                                            01588000
AVTFCPB  EQU   IEDQAVTD+1152                                            01589000
@NM00082 EQU   IEDQAVTD+1148                                            01590000
AVTINCPQ EQU   IEDQAVTD+1144                                            01591000
@NM00081 EQU   IEDQAVTD+1140                                            01592000
@NM00080 EQU   IEDQAVTD+1137                                            01593000
@NM00079 EQU   AVTBIT4                                                  01594000
@NM00078 EQU   AVTBIT4                                                  01595000
@NM00077 EQU   AVTBIT4                                                  01596000
@NM00076 EQU   AVTBIT4                                                  01597000
@NM00075 EQU   AVTBIT4                                                  01598000
@NM00074 EQU   AVTBIT4                                                  01599000
@NM00073 EQU   AVTBIT4                                                  01600000
AVTRUFTN EQU   AVTBIT4                                                  01601000
@NM00072 EQU   IEDQAVTD+1132                                            01602000
AVTNOBFQ EQU   IEDQAVTD+1128                                            01603000
@NM00071 EQU   IEDQAVTD+1124                                            01604000
AVTDKENQ EQU   IEDQAVTD+1120                                            01605000
@NM00070 EQU   IEDQAVTD+1116                                            01606000
AVTDKAPQ EQU   IEDQAVTD+1112                                            01607000
AVTCOPY  EQU   IEDQAVTD+1108                                            01608000
AVTIA    EQU   IEDQAVTD+1104                                            01609000
AVTFL    EQU   IEDQAVTD+1100                                            01610000
@NM00069 EQU   IEDQAVTD+1096                                            01611000
AVTNCPBQ EQU   IEDQAVTD+1092                                            01612000
AVTTOTNC EQU   IEDQAVTD+1088                                            01613000
AVTCMAX  EQU   IEDQAVTD+1084                                            01614000
AVTCMIN  EQU   IEDQAVTD+1080                                            01615000
AVTHM02  EQU   IEDQAVTD+1076                                            01616000
AVTOPCIN EQU   IEDQAVTD+1074                                            01617000
AVTOPMSK EQU   IEDQAVTD+1068                                            01618000
AVTDDFT  EQU   IEDQAVTD+1064                                            01619000
AVTSTEAL EQU   IEDQAVTD+1060                                            01620000
AVTOPTN  EQU   IEDQAVTD+1056                                            01621000
AVTDSKCT EQU   IEDQAVTD+1054                                            01622000
AVTCKRST EQU   IEDQAVTD+1053                                            01623000
AVTSTAN  EQU   AVTBIT3                                                  01624000
AVTSTACN EQU   AVTBIT3                                                  01625000
AVTSTAIN EQU   AVTBIT3                                                  01626000
AVTSTAYN EQU   AVTBIT3                                                  01627000
AVTOLTBN EQU   AVTBIT3                                                  01628000
AVTTSAB  EQU   AVTBIT3                                                  01629000
AVTRFULN EQU   AVTBIT3                                                  01630000
AVTRECVN EQU   AVTBIT3                                                  01631000
@NM00068 EQU   AVTBIT2                                                  01632000
@NM00067 EQU   AVTBIT2                                                  01633000
AVTOPEIN EQU   AVTBIT2                                                  01634000
AVTSTRTN EQU   AVTBIT2                                                  01635000
AVTTOPOL EQU   AVTBIT2                                                  01636000
AVTCOPYN EQU   AVTBIT2                                                  01637000
AVTREUSN EQU   AVTBIT2                                                  01638000
AVTEXTSC EQU   AVTBIT2                                                  01639000
AVTDISKN EQU   AVTBIT1                                                  01640000
AVTQUCKN EQU   AVTBIT1                                                  01641000
AVTCLOSN EQU   AVTBIT1                                                  01642000
AVTREADN EQU   AVTBIT1                                                  01643000
AVTDLAYN EQU   AVTBIT1                                                  01644000
AVTAQTAN EQU   AVTBIT1                                                  01645000
AVTTSON  EQU   AVTBIT1                                                  01646000
AVTAPLKN EQU   AVTBIT1                                                  01647000
AVTDUMBR EQU   IEDQAVTD+1048                                            01648000
AVTDLQX  EQU   IEDQAVTD+1046                                            01649000
AVTINTLV EQU   IEDQAVTD+1044                                            01650000
AVTSMCNT EQU   IEDQAVTD+1042                                            01651000
AVTAVFCT EQU   IEDQAVTD+1040                                            01652000
AVTOPCON EQU   IEDQAVTD+1038                                            01653000
AVTOPCNT EQU   IEDQAVTD+1036                                            01654000
AVTLNCNT EQU   IEDQAVTD+1034                                            01655000
AVTKEYLE EQU   IEDQAVTD+1032                                            01656000
AVTHA16  EQU   IEDQAVTD+1030                                            01657000
AVTHA7   EQU   IEDQAVTD+1028                                            01658000
AVTHA4   EQU   IEDQAVTD+1026                                            01659000
AVTHA3   EQU   IEDQAVTD+1024                                            01660000
AVTHA2   EQU   IEDQAVTD+1022                                            01661000
AVTGETMS EQU   IEDQAVTD+1021                                            01662000
@NM00066 EQU   IEDQAVTD+1020                                            01663000
AVTGETMD EQU   IEDQAVTD+1016                                            01664000
AVTGETMN EQU   IEDQAVTD+1012                                            01665000
AVTCWTOT EQU   IEDQAVTD+1008                                            01666000
AVTCWINT EQU   IEDQAVTD+956                                             01667000
AVTDTRAP EQU   IEDQAVTD+952                                             01668000
@NM00065 EQU   IEDQAVTD+950                                             01669000
@NM00064 EQU   AVTIOTR                                                  01670000
AVTIOTRH EQU   AVTIOTR                                                  01671000
AVTIOTRE EQU   AVTIOTR                                                  01672000
@NM00063 EQU   AVTSUBT                                                  01673000
AVTSUBPT EQU   AVTSUBT                                                  01674000
AVTSUBON EQU   AVTSUBT                                                  01675000
AVTAFE30 EQU   IEDQAVTD+944                                             01676000
AVTAFE20 EQU   IEDQAVTD+940                                             01677000
AVTAFE10 EQU   IEDQAVTD+936                                             01678000
AVTCWEC2 EQU   IEDQAVTD+932                                             01679000
AVTCWPM2 EQU   IEDQAVTD+928                                             01680000
AVTCWTS2 EQU   IEDQAVTD+927                                             01681000
AVTCWTS1 EQU   IEDQAVTD+926                                             01682000
AVTCWCLD EQU   AVTCWFL2                                                 01683000
AVTCWRAP EQU   AVTCWFL2                                                 01684000
@NM00062 EQU   AVTCWFL2                                                 01685000
@NM00061 EQU   AVTCWFL2                                                 01686000
@NM00060 EQU   AVTCWFL2                                                 01687000
@NM00059 EQU   AVTCWFL2                                                 01688000
@NM00058 EQU   AVTCWFL2                                                 01689000
AVTCWACT EQU   AVTCWFL2                                                 01690000
@NM00057 EQU   AVTCWFL1                                                 01691000
@NM00056 EQU   AVTCWFL1                                                 01692000
@NM00055 EQU   AVTCWFL1                                                 01693000
@NM00054 EQU   AVTCWFL1                                                 01694000
@NM00053 EQU   AVTCWFL1                                                 01695000
@NM00052 EQU   AVTCWFL1                                                 01696000
@NM00051 EQU   AVTCWFL1                                                 01697000
AVTCOMWN EQU   AVTCWFL1                                                 01698000
AVTCWEC1 EQU   IEDQAVTD+920                                             01699000
AVTCWPM1 EQU   IEDQAVTD+916                                             01700000
AVTCAREA EQU   IEDQAVTD+912                                             01701000
AVTFZERO EQU   IEDQAVTD+908                                             01702000
AVTCADDR EQU   IEDQAVTD+904                                             01703000
AVTCOREC EQU   IEDQAVTD+900                                             01704000
@NM00050 EQU   IEDQAVTD+892                                             01705000
AVTCPBCB EQU   IEDQAVTD+888                                             01706000
@NM00049 EQU   IEDQAVTD+880                                             01707000
AVTDSIOB EQU   IEDQAVTD+876                                             01708000
@NM00048 EQU   IEDQAVTD+868                                             01709000
AVTCPRMB EQU   IEDQAVTD+864                                             01710000
@NM00047 EQU   IEDQAVTD+856                                             01711000
AVTCLOSB EQU   IEDQAVTD+852                                             01712000
@NM00046 EQU   IEDQAVTD+844                                             01713000
AVTACTIB EQU   IEDQAVTD+840                                             01714000
@NM00045 EQU   IEDQAVTD+836                                             01715000
AVTOLTEB EQU   IEDQAVTD+832                                             01716000
AVTOLTCH EQU   AVTOLTQB+1                                               01717000
AVTOLTVT EQU   AVTOLTQB                                                 01718000
@NM00044 EQU   AVTOPCQB+8                                               01719000
@NM00043 EQU   AVTOPCEC+1                                               01720000
@NM00042 EQU   AVTOPCCC                                                 01721000
AVTOPCPO EQU   AVTOPCCC                                                 01722000
AVTOPCWA EQU   AVTOPCCC                                                 01723000
AVTOPCCH EQU   AVTOPCOB+1                                               01724000
AVTOPCVT EQU   AVTOPCOB                                                 01725000
@NM00041 EQU   AVTCKPQB+9                                               01726000
AVTCKPTS EQU   AVTCKPQB+8                                               01727000
@NM00040 EQU   AVTCKPEC+1                                               01728000
@NM00039 EQU   AVTCKPCC                                                 01729000
AVTCKPPO EQU   AVTCKPCC                                                 01730000
AVTCKPWA EQU   AVTCKPCC                                                 01731000
AVTCKPCH EQU   AVTCKPTB+1                                               01732000
AVTCKPVT EQU   AVTCKPTB                                                 01733000
@NM00038 EQU   IEDQAVTD+796                                             01734000
AVTBFRTB EQU   IEDQAVTD+792                                             01735000
@NM00037 EQU   IEDQAVTD+788                                             01736000
AVTSELCH EQU   IEDQAVTD+785                                             01737000
AVTBFRTN EQU   AVTBFRFG                                                 01738000
AVTBFREB EQU   IEDQAVTD+780                                             01739000
AVTTIMQ  EQU   IEDQAVTD+776                                             01740000
@NM00036 EQU   IEDQAVTD+772                                             01741000
AVTIMQPS EQU   IEDQAVTD+768                                             01742000
AVTINOUT EQU   IEDQAVTD+766                                             01743000
AVTREFTM EQU   IEDQAVTD+764                                             01744000
@NM00035 EQU   IEDQAVTD+752                                             01745000
AVTDELYB EQU   IEDQAVTD+748                                             01746000
AVTOCQPT EQU   IEDQAVTD+744                                             01747000
AVTTSOPT EQU   IEDQAVTD+740                                             01748000
AVTSUPPT EQU   IEDQAVTD+736                                             01749000
AVTCBQCB EQU   IEDQAVTD+732                                             01750000
AVTMSGS  EQU   IEDQAVTD+729                                             01751000
@NM00034 EQU   AVTSYSER                                                 01752000
@NM00033 EQU   AVTSYSER                                                 01753000
@NM00032 EQU   AVTSYSER                                                 01754000
@NM00031 EQU   AVTSYSER                                                 01755000
@NM00030 EQU   AVTSYSER                                                 01756000
@NM00029 EQU   AVTSYSER                                                 01757000
AVTCMAXN EQU   AVTSYSER                                                 01758000
AVTCMINN EQU   AVTSYSER                                                 01759000
AVT2260L EQU   IEDQAVTD+724                                             01760000
AVTABEPL EQU   AVTADBUF                                                 01761000
AVTHFF   EQU   AVTCLRHI+2                                               01762000
@NM00028 EQU   AVTCLRHI                                                 01763000
AVTCCLNK EQU   AVTCRELE+5                                               01764000
AVTCCPRI EQU   AVTCRELE+4                                               01765000
AVTCCQCB EQU   AVTCCELE+1                                               01766000
AVTCCKEY EQU   AVTCCELE                                                 01767000
AVTDELAD EQU   IEDQAVTD+704                                             01768000
AVTDELEM EQU   IEDQAVTD+700                                             01769000
AVTBSX   EQU   AVTCKLNK                                                 01770000
AVTOPETR EQU   AVTHG01                                                  01771000
@NM00027 EQU   AVTCKBYT                                                 01772000
AVTCKONQ EQU   AVTCKBYT                                                 01773000
@NM00026 EQU   AVTCKBYT                                                 01774000
@NM00025 EQU   AVTCKBYT                                                 01775000
@NM00024 EQU   AVTCKBYT                                                 01776000
@NM00023 EQU   AVTCKBYT                                                 01777000
@NM00022 EQU   AVTCKBYT                                                 01778000
@NM00021 EQU   AVTCKBYT                                                 01779000
AVTOPERT EQU   IEDQAVTD+690                                             01780000
AVTOPXCL EQU   IEDQAVTD+688                                             01781000
AVTOPERL EQU   IEDQAVTD+687                                             01782000
@NM00020 EQU   IEDQAVTD+686                                             01783000
AVTCKTIM EQU   IEDQAVTD+684                                             01784000
AVTCKELV EQU   IEDQAVTD+682                                             01785000
AVTCPRCD EQU   IEDQAVTD+681                                             01786000
AVTWARMN EQU   AVTCKELF                                                 01787000
AVTCRTLN EQU   AVTCKELF                                                 01788000
AVTCPIPN EQU   AVTCKELF                                                 01789000
AVTCCLCN EQU   AVTCKELF                                                 01790000
AVTCINCN EQU   AVTCKELF                                                 01791000
@NM00019 EQU   AVTCKELF                                                 01792000
AVTCMCPN EQU   AVTCKELF                                                 01793000
AVTNQBCK EQU   AVTCKELF                                                 01794000
AVTCKQAD EQU   IEDQAVTD+677                                             01795000
AVTSCBSZ EQU   IEDQAVTD+676                                             01796000
@NM00018 EQU   IEDQAVTD+672                                             01797000
AVTCKELE EQU   IEDQAVTD+668                                             01798000
@NM00017 EQU   AVTCKPEL+8                                               01799000
AVTCKRLK EQU   AVTCKPEL+5                                               01800000
AVTCKRPR EQU   AVTCKPEL+4                                               01801000
AVTCKRMQ EQU   AVTCKRMV+1                                               01802000
AVTCKRKY EQU   AVTCKRMV                                                 01803000
AVTHK    EQU   IEDQAVTD+648                                             01804000
AVTHI    EQU   IEDQAVTD+644                                             01805000
AVTIOT   EQU   IEDQAVTD+640                                             01806000
AVTNX    EQU   IEDQAVTD+636                                             01807000
AVTTONE  EQU   IEDQAVTD+632                                             01808000
AVTA3TL  EQU   IEDQAVTD+628                                             01809000
AVTDMECB EQU   IEDQAVTD+624                                             01810000
AVTABEND EQU   IEDQAVTD+618                                             01811000
AVTPLCBN EQU   IEDQAVTD+616                                             01812000
@NM00016 EQU   AVTSAVTP+1                                               01813000
@NM00015 EQU   AVTSAVTF                                                 01814000
AVTRAPI  EQU   AVTSAVTF                                                 01815000
AVTLCLST EQU   AVTSAVTF                                                 01816000
AVT370X  EQU   AVTSAVTF                                                 01817000
AVTSNA   EQU   AVTSAVTF                                                 01818000
AVTONSNA EQU   AVTSAVTF                                                 01819000
AVTVTMCP EQU   AVTSAVTF                                                 01820000
AVTTRNOS EQU   IEDQAVTD+608                                             01821000
AVTCMBSS EQU   IEDQAVTD+604                                             01822000
AVTRCV   EQU   IEDQAVTD+600                                             01823000
AVTSEND  EQU   IEDQAVTD+596                                             01824000
AVTCSCH  EQU   IEDQAVTD+592                                             01825000
AVTQ1    EQU   IEDQAVTD+588                                             01826000
AVTE7    EQU   IEDQAVTD+584                                             01827000
AVTHB    EQU   IEDQAVTD+580                                             01828000
AVTR1    EQU   IEDQAVTD+576                                             01829000
AVTBZ    EQU   IEDQAVTD+572                                             01830000
AVTEZ    EQU   IEDQAVTD+568                                             01831000
AVTEC    EQU   IEDQAVTD+564                                             01832000
AVTEW    EQU   IEDQAVTD+560                                             01833000
AVTNDIAL EQU   AVTSCOPT                                                 01834000
AVTN2741 EQU   AVTSCOPT                                                 01835000
AVTCONCO EQU   AVTSCOPT                                                 01836000
AVTCONC  EQU   AVTSCOPT                                                 01837000
AVTCMBUF EQU   AVTSCOPT                                                 01838000
AVTAPDMP EQU   AVTSCOPT                                                 01839000
@NM00014 EQU   AVTSCOPT                                                 01840000
AVTHA    EQU   AVTDISP                                                  01841000
AVTEA    EQU   IEDQAVTD+548                                             01842000
AVTAX    EQU   IEDQAVTD+544                                             01843000
AVTA3    EQU   IEDQAVTD+540                                             01844000
AVTGD    EQU   IEDQAVTD+536                                             01845000
AVTAL    EQU   IEDQAVTD+532                                             01846000
AVTOLTST EQU   AVTHG02                                                  01847000
AVTE8    EQU   IEDQAVTD+524                                             01848000
AVTUI    EQU   IEDQAVTD+520                                             01849000
AVTCOMPT EQU   IEDQAVTD+516                                             01850000
AVTCRSRF EQU   IEDQAVTD+512                                             01851000
@NM00013 EQU   IEDQAVTD+508                                             01852000
AVTKA02  EQU   IEDQAVTD+504                                             01853000
AVTOPTPT EQU   IEDQAVTD+500                                             01854000
AVTPCBPT EQU   IEDQAVTD+496                                             01855000
AVTECBAD EQU   IEDQAVTD+492                                             01856000
AVTOPECA EQU   IEDQAVTD+488                                             01857000
AVTOLECA EQU   IEDQAVTD+484                                             01858000
AVTCKECA EQU   IEDQAVTD+480                                             01859000
AVTCWECA EQU   IEDQAVTD+476                                             01860000
AVTCWTCB EQU   IEDQAVTD+472                                             01861000
AVTOLTCB EQU   IEDQAVTD+468                                             01862000
AVTOCTCB EQU   IEDQAVTD+464                                             01863000
AVTCKTCB EQU   IEDQAVTD+460                                             01864000
AVTAS    EQU   IEDQAVTD+456                                             01865000
AVTNOLBF EQU   IEDQAVTD+454                                             01866000
AVTNCKPR EQU   IEDQAVTD+453                                             01867000
AVTCIB   EQU   IEDQAVTD+452                                             01868000
AVTSPLPT EQU   IEDQAVTD+448                                             01869000
AVTMVBFR EQU   IEDQAVTD+444                                             01870000
AVTSBTA  EQU   IEDQAVTD+440                                             01871000
AVTRARTN EQU   IEDQAVTD+436                                             01872000
AVTBSCAN EQU   IEDQAVTD+432                                             01873000
AVTRDYA  EQU   IEDQAVTD+428                                             01874000
AVTRNMPT EQU   IEDQAVTD+424                                             01875000
AVTDISTR EQU   IEDQAVTD+420                                             01876000
AVTPARM3 EQU   IEDQAVTD+416                                             01877000
@NM00012 EQU   AVTPKF                                                   01878000
@NM00011 EQU   AVTPKF                                                   01879000
@NM00010 EQU   AVTPKF                                                   01880000
AVTFTCHF EQU   AVTPKF                                                   01881000
@NM00009 EQU   AVTPKF                                                   01882000
@NM00008 EQU   AVTPKF                                                   01883000
@NM00007 EQU   AVTPKF                                                   01884000
@NM00006 EQU   AVTPKF                                                   01885000
AVTPARM  EQU   IEDQAVTD+408                                             01886000
AVTEXS2A EQU   IEDQAVTD+402                                             01887000
AVTEXA2S EQU   IEDQAVTD+396                                             01888000
AVTOCGET EQU   IEDQAVTD+392                                             01889000
AVTCKAVT EQU   @NM00004+1                                               01890000
@NM00005 EQU   AVTCKFLG                                                 01891000
AVTCKHLT EQU   AVTCKFLG                                                 01892000
AVTCKREQ EQU   AVTCKFLG                                                 01893000
AVTCKENV EQU   AVTCKFLG                                                 01894000
AVTCKNAC EQU   AVTCKFLG                                                 01895000
AVTCKTAC EQU   AVTCKFLG                                                 01896000
AVTBUENT EQU   IEDQAVTD+386                                             01897000
@NM00003 EQU   IEDQAVTD+385                                             01898000
AVTFULLT EQU   AVTBUFSW                                                 01899000
AVTUNCON EQU   AVTBUFSW                                                 01900000
AVTTRAPI EQU   AVTBUFSW                                                 01901000
@NM00002 EQU   AVTBUFSW                                                 01902000
AVTBUFTR EQU   AVTREADD                                                 01903000
AVTREADY EQU   IEDQAVTD+376                                             01904000
AVTRACE  EQU   IEDQAVTD+372                                             01905000
AVTTCB   EQU   IEDQAVTD+368                                             01906000
AVTPASWD EQU   IEDQAVTD+360                                             01907000
AVTCTLCH EQU   IEDQAVTD+352                                             01908000
AVTDOUBL EQU   IEDQAVTD+344                                             01909000
AVTDOUBX EQU   IEDQAVTD+336                                             01910000
AVTDPARM EQU   IEDQAVTD+332                                             01911000
AVTDLQ   EQU   AVTSAVEX+32                                              01912000
@NM00001 EQU   AVTSAVEX                                                 01913000
AVTSAVE4 EQU   IEDQAVTD+216                                             01914000
AVTSAVE3 EQU   IEDQAVTD+144                                             01915000
AVTSAVE2 EQU   IEDQAVTD+72                                              01916000
AVTSAVE1 EQU   IEDQAVTD                                                 01917000
*                                      END UNREFERENCED COMPONENTS      01918000
@PB00004 EQU   @EL00001                                                 01919000
@PB00003 EQU   @PB00004                                                 01920000
@PB00002 EQU   @PB00003                                                 01921000
@EL01    EQU   @EL00001                                                 01922000
@ENDDATA EQU   *                                                        01923000
@DATEND  EQU   *                                                        01924000
         END   IGCMR10D                                                 01925000
