         TITLE 'AMDSAASM AUXILIARY STORAGE MANAGER ROUTINE             *00001000
                        '                                               00002000
AMDSAASM CSECT ,                                                01S0001 00003000
AMDSAAMR DS    0H                                               01S0001 00004000
         ENTRY AMDSAAMR                                                 00005000
@MAINENT DS    0H                                               01S0001 00006000
         USING *,@15                                            01S0001 00007000
         B     @PROLOG                                          01S0001 00008000
         DC    AL2(@EP00001-@MAINENT)                                   00009000
         DC    AL1(16)                                          01S0001 00010000
         DC    C'AMDSAASM  76.071'                              01S0001 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00013000
         BALR  @11,0                                            01S0001 00014000
@PSTART  DS    0H                                               01S0001 00015000
         USING @PSTART,@11                                      01S0001 00016000
         AH    @15,4(,@15)                                      01S0001 00017000
         BR    @15                                              01S0001 00018000
@EP00001 DS    0H                                               01S0002 00019000
         B     @PB00002                                         02S0002 00020000
ILRCNVRT STM   @14,@12,12(@13)                                  02S0002 00021000
*   R2=R0;                          /* SET UP EDBHDPTR IN REG2       */ 00022000
         LR    R2,R0                                            02S0009 00023000
*   RFY                                                         02S0010 00024000
*     R0 UNRSTD;                    /* NO NEED FOR R0                */ 00025000
*   RFY                                                         02S0011 00026000
*     R3 RSTD;                                                  02S0011 00027000
*   R3=R2+LENGTH(IDAEDBHD);         /* POINT R3 TO FIRST EDB ENTRY   */ 00028000
         LA    R3,8                                             02S0012 00029000
         ALR   R3,R2                                            02S0012 00030000
*   RFY                                                         02S0013 00031000
*     R5 RSTD;                                                  02S0013 00032000
*   R5=CNVRTRBA;                    /* RBA TO BE CONVERTED           */ 00033000
         L     R5,CNVRTRBA(,R1)                                 02S0014 00034000
*   RFY                                                         02S0015 00035000
*    (R4,                                                       02S0015 00036000
*     R15) RSTD;                                                02S0015 00037000
*   R15=CNVRTBAD;                   /* INITIALIZE RETURN CODE        */ 00038000
         LA    R15,4                                            02S0016 00039000
*   DO R4=R2->EDBNO TO 1 BY-1       /* LOOP THROUGH EDB ENTRIES      */ 00040000
*         WHILE R15=CNVRTBAD;                                   02S0017 00041000
         SLR   R4,R4                                            02S0017 00042000
         IC    R4,EDBNO(,R2)                                    02S0017 00043000
         B     @DE00017                                         02S0017 00044000
@DL00017 CH    R15,@CH00054                                     02S0017 00045000
         BNE   @DC00017                                         02S0017 00046000
*     IF R5=>R3->EDBLORBA&          /* IF RBA IN THIS EXTENT         */ 00047000
*         R5<=R3->EDBHIRBA THEN     /* THEN RESET RETURN CODE        */ 00048000
         CL    R5,EDBLORBA(,R3)                                 02S0018 00049000
         BL    @RF00018                                         02S0018 00050000
         CL    R5,EDBHIRBA(,R3)                                 02S0018 00051000
         BH    @RF00018                                         02S0018 00052000
*       R15=CNVRTOK;                                            02S0019 00053000
         SLR   R15,R15                                          02S0019 00054000
*     ELSE                          /* ELSE, CHECK NEXT ENTRY        */ 00055000
*       R3=R3+R2->EDBLEN;                                       02S0020 00056000
         B     @RC00018                                         02S0020 00057000
@RF00018 AH    R3,EDBLEN(,R2)                                   02S0020 00058000
*   END;                                                        02S0021 00059000
@RC00018 BCTR  R4,0                                             02S0021 00060000
@DE00017 LTR   R4,R4                                            02S0021 00061000
         BP    @DL00017                                         02S0021 00062000
@DC00017 DS    0H                                               02S0022 00063000
*   IF R15=CNVRTOK                  /* IF FOUND EDB ENTRY,           */ 00064000
*     THEN                                                      02S0022 00065000
         LTR   R15,R15                                          02S0022 00066000
         BNZ   @RF00022                                         02S0022 00067000
*     DO;                           /* THEN DO CONVERSION            */ 00068000
*/*                                                                  */ 00069000
*/*                 FOUND EDB ENTRY                                  */ 00070000
*/*                                                                  */ 00071000
*                                                               02S0024 00072000
*       R2=R3->EDBLPMBA;            /* GET LPMB ADDRESS              */ 00073000
         L     R2,EDBLPMBA(,R3)                                 02S0024 00074000
*       CNVRTSKA=''B;               /* ZERO FULL SEEK ADDRESS        */ 00075000
         XC    CNVRTSKA(8,R1),CNVRTSKA(R1)                      02S0025 00076000
*       R5=R5-R3->EDBLORBA;         /* RELATIVE RBA THIS EXTENT      */ 00077000
         SL    R5,EDBLORBA(,R3)                                 02S0026 00078000
*       CNVRTM=R3->EDBM;            /* SET UP EXTENT NUMBER          */ 00079000
         MVC   CNVRTM(1,R1),EDBM(R3)                            02S0027 00080000
*/*                                                                  */ 00081000
*/*          OPTIMIZE CODE BY USING ASSEMBLER FOR DIVISION           */ 00082000
*/*                                                                  */ 00083000
*                                                               02S0028 00084000
*       GENERATE REFS(LPMAUSZ,LPMBPTRK,LPMBLKSZ,R2,R4,R5,CNVRTCC,       00085000
*           CNVRTHH);                                           02S0028 00086000
*                                                                       00087000
*           CNVRTCC = REL RBA / BYTES PER ALLOCATION UNIT               00088000
*           R5= R5 / LPMAUSZ                                            00089000
*           R4= R5 // LPMAUSZ                                           00090000
*                                                                       00091000
            SR   R4,R4                 ZERO EVEN REGISTER               00092000
            D    R4,LPMAUSZ(,R2)       RBA / BYTES PER ALLOC UNIT       00093000
            STCM R5,3,CNVRTCC(R1)      RELATIVE CYL VALVE               00094000
            LR   R5,R4                 REMAINDER= RELATIVE TRACK        00095000
*                                                                       00096000
*           CNVRTHH = RELATIVE TRACK / BYTES PER TRACK                  00097000
*           R5= R5 / LPMBPTRK                                           00098000
*           R4= R5 // LPMBPTRK                                          00099000
*                                                                       00100000
            SR   R4,R4                 ZERO EVEN REGISTER               00101000
            D    R4,LPMBPTRK(,R2)      REL TRACK / BYTES PER TRACK      00102000
            STCM R5,3,CNVRTHH(R1)      RELATIVE TRACK VALVE             00103000
*                                                                       00104000
*           CNVRTR= (( RELATIVE RECORD + BLOCKSIZE -1) / BLOCKSIZE)+1   00105000
*                R7= ( R6 + LPMBLKSZ - 1 ) / LPMBLKSZ                   00106000
*                                                                       00107000
            A    R4,LPMBLKSZ(,R2)      ADD PHYSICAL BLOCKSIZE           00108000
            BCTR R4,0                  SUBTRACT 1 FOR ROUNDING          00109000
            LR   R5,R4                 SET UP FOR DIVISION              00110000
            SR   R4,R4                 ZERO EVEN REGISTER               00111000
            D    R4,LPMBLKSZ(,R2)      DIVIDE BY BLOCKSIZE              00112000
*       CNVRTR=R5+CNVRTONE;         /* RECORD NUMBER                 */ 00113000
         LA    @14,1                                            02S0029 00114000
         ALR   @14,R5                                           02S0029 00115000
         STC   @14,CNVRTR(,R1)                                  02S0029 00116000
*/*                                                                  */ 00117000
*/*      CNVRTCC=(CNVRTCC * LPMTRKAU + CNVRTHH + EDBSTTRK)/ LPMTPC   */ 00118000
*/*      CNVRTHH=(CNVRTCC * LPMTRKAU + CNVRTHH + EDBSTTRK)// LPMTPC  */ 00119000
*/*                                                                  */ 00120000
*                                                               02S0030 00121000
*       R5=CNVRTCC*(R2->LPMTRKAU)+CNVRTHH+(R3->EDBSTTRK);       02S0030 00122000
         SLR   R5,R5                                            02S0030 00123000
         ICM   R5,3,CNVRTCC(R1)                                 02S0030 00124000
         MH    R5,LPMTRKAU(,R2)                                 02S0030 00125000
         SLR   @14,@14                                          02S0030 00126000
         ICM   @14,3,CNVRTHH(R1)                                02S0030 00127000
         ALR   R5,@14                                           02S0030 00128000
         AL    R5,EDBSTTRK(,R3)                                 02S0030 00129000
*       GENERATE REFS(LPMTPC,R3,R4,R5,R2,R1,CNVRTCC,CNVRTHH);   02S0031 00130000
*                                                                       00131000
*           CNVRTCC= R5 / LPMTPC                                        00132000
*           CNVRTHH= R5 // LPMTPC                                       00133000
*                                                                       00134000
            SR    R4,R4                ZERO EVEN REGISTER               00135000
            LH    R3,LPMTPC(,R2)       PICK UP TRACKS PER CYLINDER      00136000
            DR   R4,R3                 R5 / LPMTPC                      00137000
            STCM R5,3,CNVRTCC(R1)      ACTUAL CYLINDER ADDRESS          00138000
            STCM R4,3,CNVRTHH(R1)      ACTUAL HEAD ADDRESS              00139000
*     END;                          /* END OF CONVERSION PROCESS     */ 00140000
*   RETURN CODE(R15);               /* RETURN TO CALLER              */ 00141000
@RF00022 L     @14,12(,@13)                                     02S0033 00142000
         LM    @00,@12,20(@13)                                  02S0033 00143000
         BR    @14                                              02S0033 00144000
*   END ILRCNVRT;                                               02S0034 00145000
@PB00002 DS    0H                                               02S0035 00146000
*   RFY                                                         02S0035 00147000
*    (R1,                                                       02S0035 00148000
*     R2,                                                       02S0035 00149000
*     R3,                                                       02S0035 00150000
*     R4,                                                       02S0035 00151000
*     R5,                                                       02S0035 00152000
*     R15) UNRSTD;                                              02S0035 00153000
*                                                               02S0036 00154000
*/*                                                                  */ 00155000
*/*      COMMUNICATION VECTOR TABLE                                  */ 00156000
*/*                                                                  */ 00157000
*/*      OS/VS2 RELEASE 4, 10/15/75, LEVEL=8                         */ 00158000
*/*                                                                  */ 00159000
*/*  METHOD OF ACCESS                                                */ 00160000
*/*      PL/S - DCL CVTPTR PTR                                       */ 00161000
*/*      BAL  - DSECT=YES SHOULD BE SPECIFIED ON MACRO CALL EXCEPT   */ 00162000
*/*             WHEN CALLED DURING SYSGEN TO CREATE CSECT.  CVT FOR  */ 00163000
*/*             OS/VS2 IS MAPPED UNLESS SYS=AOS1 IS SPECIFIED.  THE  */ 00164000
*/*             PREFIX IS NOT MAPPED UNLESS PREFIX=YES IS SPECIFIED. */ 00165000
*/*             A USING ON CVTMAP OR DSECT NAME WILL ESTABLISH       */ 00166000
*/*             ADDRESSABILITY FOR ALL SYMBOLS EXCEPT IN THE 2       */ 00167000
*/*             EXTENSIONS.  TO ESTABLISH ADDRESSABILITY FOR THE     */ 00168000
*/*             OS - OS/VS COMMON EXTENSION, YOU SHOULD CODE         */ 00169000
*/*                                                                  */ 00170000
*/*             L     REG,CVTEXT1                                    */ 00171000
*/*             USING CVTXTNT1,REG                                   */ 00172000
*/*                                                                  */ 00173000
*/*             TO ESTABLISH ADDRESSABILITY FOR THE OS/VS1 - OS/VS2  */ 00174000
*/*             COMMON EXTENSION, YOU SHOULD CODE                    */ 00175000
*/*                                                                  */ 00176000
*/*             L     REG,CVTEXT2                                    */ 00177000
*/*             USING CVTXTNT2,REG                                   */ 00178000
*/*                                                                  */ 00179000
*/*             WHERE REG IN EITHER CASE IS ANY REGISTER OTHER       */ 00180000
*/*             THAN ZERO.                                           */ 00181000
*/*                                                                  */ 00182000
*/*             WHEN LISTING IS SUPPRESSED, YOU CAN DETERMINE WHICH  */ 00183000
*/*             DSECT A SYMBOL IS IN BY USING THE STATEMENT NUMBER   */ 00184000
*/*             IN THE DEFN COLUMN IN THE CROSS REFERENCE LISTING.   */ 00185000
*/*             FOR EXAMPLE, ANY SYMBOL DEFINED BETWEEN THE          */ 00186000
*/*             STATEMENT NUMBERS FOR CVTXTNT1 AND CVTXTNT2 IS IN    */ 00187000
*/*             THE OS - OS/VS COMMON EXTENSION.                     */ 00188000
*/*                                                                  */ 00189000
*/*  F.E.'S                                                          */ 00190000
*/*      MICROFICHE LISTING - CVT                                    */ 00191000
*/*                                                                  */ 00192000
*/*  DEVELOPERS                                                      */ 00193000
*/*      BAL LISTING  - SPECIFY LIST=YES ON MACRO CALL               */ 00194000
*/*      PL/S LISTING - SPECIFY %IHALIST='YES' BEFORE INCLUDE        */ 00195000
*/*                                                                  */ 00196000
*/*      FOR INTEGRATION, A LISTING MUST NOT BE REQUESTED UNLESS     */ 00197000
*/*      YOUR MODULE CREATES THE CSECT.                              */ 00198000
*                                                               02S0036 00199000
*                                                               02S0036 00200000
*/*                    CVT PROPER                                    */ 00201000
*                                                               02S0036 00202000
*   DECLARE                                                     02S0036 00203000
*     1 CVTMAP BASED(CVTPTR) BDY(WORD),                         02S0036 00204000
*      2 CVT CHAR(0) BDY(WORD),     /* BEGINNING OF CVT MDC150       */ 00205000
*      2 CVTTCBP PTR(31),           /* ADDRESS OF A DOUBLE WORD, THE    00206000
*                                      FIRST CONTAINING THE NEXT-TO-    00207000
*                                      BE-DISPATCHED TCB ADDRESS. THE   00208000
*                                      SECOND CONTAINING THE LAST       00209000
*                                      (CURRENT) TCB ADDRESS. BOTH      00210000
*                                      WORDS ARE IDENTICAL UNLESS THE   00211000
*                                      TASK GOES INTO A WAIT STATE.     00212000
*                                      WHEN IN A WAIT STATE, THE        00213000
*                                      FIRST WORD IS SET TO ZERO        00214000
*                                      UNTIL THE WAITING IS OVER AND    00215000
*                                      THEN BOTH WORDS ARE ONCE AGAIN   00216000
*                                      IDENTICAL. (OS/VS1) ADDRESS OF   00217000
*                                      4-WORD LIST OF ADDRESSES - THE   00218000
*                                      NEXT TCB, THE CURRENT TCB, THE   00219000
*                                      NEXT ASCB AND THE CURRENT        00220000
*                                      ASCB, IN THAT ORDER (OS/VS2)     00221000
*                                      MDC026                        */ 00222000
*      2 CVT0EF00 PTR(31),          /* ADDRESS OF ROUTINE TO SCHEDULE   00223000
*                                      ASYNCHRONOUS EXITS            */ 00224000
*      2 CVTLINK PTR(31),           /* ADDRESS OF DCB FOR       02S0036 00225000
*                                      SYS1.LINKLIB DATA SET         */ 00226000
*      2 CVTJOB PTR(31),            /* ADDRESS OF QUEUE MANAGER 02S0036 00227000
*                                      RESIDENT DATA AREA (QMRES)       00228000
*                                      (OS/VS1) (MDC083)       XM4042*/ 00229000
*      2 CVTBUF PTR(31),            /* ADDRESS OF THE BUFFER OF THE     00230000
*                                      RESIDENT CONSOLE INTERRUPT       00231000
*                                      ROUTINE                       */ 00232000
*      2 CVTXAPG PTR(31),           /* ADDRESS OF I/O SUPERVISOR        00233000
*                                      APPENDAGE VECTOR TABLE        */ 00234000
*      2 CVT0VL00 PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    00235000
*                                      TASK SUPERVISOR'S ADDRESS        00236000
*                                      VALIDITY CHECKING ROUTINE     */ 00237000
*      2 CVTPCNVT PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    00238000
*                                      ROUTINE WHICH CONVERTS A 02S0036 00239000
*                                      RELATIVE TRACK ADDRESS (TTR)     00240000
*                                      TO AN ABSOLUTE TRACK ADDRESS     00241000
*                                      (MBBCCHHR)                    */ 00242000
*      2 CVTPRLTV PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    00243000
*                                      ROUTINE WHICH CONVERTS AN        00244000
*                                      ABSOLUTE TRACK ADDRESS   02S0036 00245000
*                                      (MBBCCHHR) TO A RELATIVE TRACK   00246000
*                                      ADDRESS (TTR)                 */ 00247000
*      2 CVTILK1 PTR(31),           /* ADDRESS OF THE CHANNEL AND       00248000
*                                      CONTROL UNIT PORTION OF THE      00249000
*                                      UCB LOOKUP TABLE              */ 00250000
*      2 CVTILK2 PTR(31),           /* ADDRESS OF THE UCB HALFWORD      00251000
*                                      ADDRESS LIST PORTION OF THE      00252000
*                                      UCB LOOKUP TABLE              */ 00253000
*      2 CVTXTLER PTR(31),          /* ADDRESS OF ERROR RECOVERY        00254000
*                                      PROCEDURE (ERP) LOADER   02S0036 00255000
*                                      (IECVERPL) ENTRY POINT   02S0036 00256000
*                                      IECXTLER (MDC349)     @Z40AQ9A*/ 00257000
*      2 CVTSYSAD PTR(31),          /* ADDRESS OF THE SYSTEM    02S0036 00258000
*                                      RESIDENCE VOLUME ENTRY IN THE    00259000
*                                      UCB LOOKUP TABLE              */ 00260000
*      2 CVTBTERM PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    00261000
*                                      ABTERM ROUTINE                */ 00262000
*      2 CVTDATE CHAR(4) BDY(WORD), /* CURRENT DATE IN PACKED DECIMAL*/ 00263000
*      2 CVTMSLT PTR(31),           /* ADDRESS OF THE MASTER COMMON     00264000
*                                      AREA IN MASTER SCHEDULER 02S0036 00265000
*                                      RESIDENT DATA AREA. NOTE - USE   00266000
*                                      CVTMSER INSTEAD TO ADDRESS       00267000
*                                      MASTER SCHEDULER RESIDENT DATA   00268000
*                                      AREA.                         */ 00269000
*      2 CVTZDTAB PTR(31),          /* ADDRESS OF I/O DEVICE    02S0036 00270000
*                                      CHARACTERISTIC TABLE          */ 00271000
*      2 CVTXITP PTR(31),           /* ADDRESS OF ERROR INTERPRETER     00272000
*                                      ROUTINE                       */ 00273000
*      2 CVTDAR PTR(31),            /* SAME AS CVTDARA BELOW (OS/VS1)   00274000
*                                      MDC029                        */ 00275000
*       3 CVTFLGS1 BIT(8),          /* FLAG BYTE (OS/VS1) MDC030     */ 00276000
*        4 CVTDMPLK BIT(1),         /* SVC DUMP IS IN PROGRESS  02S0036 00277000
*                                      (OS/VS1) MDC030               */ 00278000
*        4 CVTRSV01 BIT(1),         /* RESERVED                      */ 00279000
*        4 CVTRSV02 BIT(1),         /* RESERVED                      */ 00280000
*        4 CVTRSV03 BIT(1),         /* RESERVED                      */ 00281000
*        4 CVTRSV04 BIT(1),         /* RESERVED                      */ 00282000
*        4 CVTRSV05 BIT(1),         /* RESERVED                      */ 00283000
*        4 CVTRSV06 BIT(1),         /* RESERVED                      */ 00284000
*        4 CVTRSV07 BIT(1),         /* RESERVED                      */ 00285000
*       3 CVTDARA PTR(24),          /* ADDRESS OF THE SYS1.DUMP I/O     00286000
*                                      CONTROL BLOCKS NEEDED BY 02S0036 00287000
*                                      ABEND'S DAMAGE ASSESSMENT        00288000
*                                      ROUTINE (DAR) (OS/VS1) MDC029 */ 00289000
*      2 CVT0FN00 PTR(31),          /* ADDRESS OF ENTRY POINT OF THE    00290000
*                                      FINCH ROUTINE (OS/VS1)        */ 00291000
*      2 CVTEXIT CHAR(2) BDY(WORD), /* AN SVC 3 INSTRUCTION. EXIT TO    00292000
*                                      DISPATCHER.                   */ 00293000
*      2 CVTBRET CHAR(2) BDY(WORD,3),/* A BCR 15,14 INSTRUCTION.        00294000
*                                      RETURN TO CALLER (USED BY DATA   00295000
*                                      MANAGEMENT ROUTINES)          */ 00296000
*      2 CVTSVDCB PTR(31),          /* ADDRESS OF THE DCB FOR THE       00297000
*                                      SYS1.SVCLIB DATA SET          */ 00298000
*      2 CVTTPC PTR(31),            /* ADDRESS OF THE TIMER     02S0036 00299000
*                                      SUPERVISOR WORK AREA          */ 00300000
*      2 CVTPBLDL PTR(31),          /* ADDRESS OF BRANCH AND LINK       00301000
*                                      (BALR) ENTRY POINT OF THE BLDL   00302000
*                                      ROUTINE (OS/VS1) MDC103       */ 00303000
*      2 CVTSJQ PTR(31),            /* ADDRESS OF THE SELECTED JOB      00304000
*                                      QUEUE (OS/VS1)                */ 00305000
*      2 CVTCUCB PTR(31),           /* ADDRESS OF THE TABLE THAT        00306000
*                                      CONTAINS THE CURRENT CONSOLE     00307000
*                                      UCB ADDRESSES                 */ 00308000
*      2 CVTQTE00 PTR(31),          /* ADDRESS OF THE TIMER ENQUEUE     00309000
*                                      ROUTINE FOR INTERVAL TIMER    */ 00310000
*      2 CVTQTD00 PTR(31),          /* ADDRESS OF THE TIMER DEQUEUE     00311000
*                                      ROUTINE FOR INTERVAL TIMER    */ 00312000
*      2 CVTSTB PTR(31),            /* ADDRESS OF THE I/O DEVICE        00313000
*                                      STATISTICS TABLE              */ 00314000
*      2 CVTDCB CHAR(1) BDY(WORD),  /* OPERATING SYSTEM CONFIGURATION*/ 00315000
*        4 CVTRSV08 BIT(1),         /* RESERVED                      */ 00316000
*        4 CVT1SSS BIT(1),          /* PCP                           */ 00317000
*        4 CVT2SPS BIT(1),          /* MFT, OS/VS1                   */ 00318000
*        4 CVT4MS1 BIT(1),          /* MVT, OS/VS2                   */ 00319000
*        4 CVTRSV09 BIT(1),         /* RESERVED                      */ 00320000
*        4 CVT4MPS BIT(1),          /* MODEL 65 MULTIPROCESSING      */ 00321000
*        4 CVT6DAT BIT(1),          /* DYNAMIC ADDRESS TRANSLATION BY   00322000
*                                      CPU (OS/VS1, OS/VS2)          */ 00323000
*        4 CVTMVS2 BIT(1),          /* MULTIPLE MEMORY OPTION OF        00324000
*                                      OS/VS2 IS PRESENT MDC131      */ 00325000
*      2 CVTDCBA PTR(24),           /* ADDRESS OF THE DCB FOR THE       00326000
*                                      SYS1.LOGREC (OUTBOARD    02S0036 00327000
*                                      RECORDER) DATA SET FOR SYSTEM    00328000
*                                      ENVIRONMENT RECORDING (SER)   */ 00329000
*      2 CVTIOQET PTR(31),          /* ADDRESS OF IOS REQUEST ELEMENT   00330000
*                                      TABLE (OS/VS1) MDC020         */ 00331000
*      2 CVTIXAVL PTR(31),          /* ADDRESS OF THE I/O       02S0036 00332000
*                                      SUPERVISOR'S FREELIST POINTER    00333000
*                                      WHICH CONTAINS THE ADDRESS OF    00334000
*                                      THE NEXT REQUEST ELEMENT 02S0036 00335000
*                                      (OS/VS1) ADDRESS OF THE I/O      00336000
*                                      SUPERVISOR'S COMMUNICATION       00337000
*                                      AREA (IOCOM) (OS/VS2)         */ 00338000
*      2 CVTNUCB PTR(31),           /* LOWEST ADDRESS NOT IN THE        00339000
*                                      NUCLEUS (ON PAGE BOUNDARY FOR    00340000
*                                      OS/VS1) (ON SEGMENT BOUNDARY     00341000
*                                      FOR OS/VS2) (MDC318)  @Z30AQ9A*/ 00342000
*      2 CVTFBOSV PTR(31),          /* ADDRESS OF PROGRAM FETCH 02S0036 00343000
*                                      ROUTINE                       */ 00344000
*      2 CVT0DS PTR(31),            /* ADDRESS OF ENTRY POINT OF THE    00345000
*                                      DISPATCHER                    */ 00346000
*      2 CVTILCH PTR(31),           /* ADDRESS OF THE LOGICAL CHANNEL   00347000
*                                      WORD TABLE                    */ 00348000
*      2 CVTIERLC PTR(31),          /* ADDRESS OF THE ASYNCHRONOUS      00349000
*                                      EXIT QUEUE (OS/VS1) (MDC218)     00350000
*                                                              YM4043*/ 00351000
*       3 CVTRV516 PTR(31),         /* ** CVTIERLC FIELD UNUSED IN      00352000
*                                      MVS ** (MDC218)         YM4043*/ 00353000
*      2 CVTMSER PTR(31),           /* ADDRESS OF DATA AREA OF MASTER   00354000
*                                      SCHEDULER RESIDENT DATA AREA  */ 00355000
*      2 CVT0PT01 PTR(31),          /* ADDRESS OF BRANCH ENTRY POINT    00356000
*                                      OF POST ROUTINE               */ 00357000
*      2 CVTRSV11 PTR(31),          /* ** CVTTRMTB FIELD UNUSED IN      00358000
*                                      OS/VS **                      */ 00359000
*      2 CVTHEAD PTR(31),           /* ADDRESS OF THE HIGHEST   02S0036 00360000
*                                      PRIORITY TCB IN THE READY        00361000
*                                      QUEUE (OS/VS1) MDC025         */ 00362000
*      2 CVTMZ00 PTR(31),           /* HIGHEST ADDRESS IN VIRTUAL       00363000
*                                      STORAGE FOR THE MACHINE       */ 00364000
*      2 CVT1EF00 PTR(31),          /* ADDRESS OF ROUTINE WHICH 02S0036 00365000
*                                      CREATES IRB'S FOR EXITS       */ 00366000
*      2 CVTQOCR PTR(31),           /* GRAPHICS INTERFACE TASK (GFX)    00367000
*                                      FIELD. ADDRESS OF SEVENTH WORD   00368000
*                                      OF GFX PARAMETER LIST, IF GFX    00369000
*                                      IS ACTIVE. ZERO IF GFX IS NOT    00370000
*                                      ACTIVE.                       */ 00371000
*      2 CVTQMWR PTR(31),           /* ADDRESS OF QUEUE MANAGER'S       00372000
*                                      SYSTEM OUTPUT COMMUNICATIONS-    00373000
*                                      DATA-AREA (CDA), WHICH IS        00374000
*                                      STORED ON AN EXTERNAL DEVICE  */ 00375000
*      2 CVTSNCTR FIXED(15),        /* SERIAL NUMBER COUNTER FOR        00376000
*                                      ASSIGNING SERIAL NUMBERS TO      00377000
*                                      NON-SPECIFIC, UNLABELED  02S0036 00378000
*                                      MAGNETIC TAPE VOLUMES         */ 00379000
*      2 CVTOPTA CHAR(1),           /* OPTION INDICATORS             */ 00380000
*       3 CVTCCH BIT(1),            /* CHANNEL CHECK HANDLER (CCH)      00381000
*                                      OPTION PRESENT - RECOVERY        00382000
*                                      MANAGEMENT SUPPORT (RMS) 02S0036 00383000
*                                                              XM4686*/ 00384000
*       3 CVTAPR BIT(1),            /* ALTERNATE PATH RETRY (APR)       00385000
*                                      OPTION PRESENT - RECOVERY        00386000
*                                      MANAGEMENT SUPPORT (RMS)      */ 00387000
*       3 CVTDDR BIT(1),            /* DYNAMIC DEVICE RECONFIGURATION   00388000
*                                      (DDR) OPTION PRESENT -   02S0036 00389000
*                                      RECOVERY MANAGEMENT SUPPORT      00390000
*                                      (RMS) (OS/VS1) DDR       02S0036 00391000
*                                      SYSTEM-INITIATED SWAP ACTIVE     00392000
*                                      (OS/VS2) MDC126               */ 00393000
*       3 CVTNIP BIT(1),            /* NIP IS EXECUTING              */ 00394000
*       3 CVTRSV12 BIT(1),          /* RESERVED                      */ 00395000
*       3 CVTRSV13 BIT(1),          /* RESERVED                      */ 00396000
*       3 CVTASCII BIT(1),          /* ASCII TAPE PROCESSING IS 02S0036 00397000
*                                      GENERATED IN THIS SYSTEM      */ 00398000
*       3 CVTXPFP BIT(1),           /* CPU HAS EXTENDED PRECISION       00399000
*                                      FLOATING POINT FEATURE        */ 00400000
*      2 CVTOPTB CHAR(1),           /* MISCELLANEOUS FLAGS           */ 00401000
*       3 CVTPROT BIT(1),           /* CPU HAS STORE PROTECTION 02S0036 00402000
*                                      FEATURE (OS/VS1)              */ 00403000
*       3 CVTCTIMS BIT(1),          /* IF ON, HARDWARE HAS THE CLOCK    00404000
*                                      COMPARATOR AND CPU TIMER 02S0036 00405000
*                                      FEATURE INSTALLED, AND OS/VS1    00406000
*                                      SYSGEN HAS SPECIFIED THIS        00407000
*                                      FEATURE (OS/VS1) MDC127       */ 00408000
*       3 CVTTOD BIT(1),            /* CPU HAS TIME-OF-DAY CLOCK        00409000
*                                      FEATURE                       */ 00410000
*       3 CVTNLOG BIT(1),           /* SYS1.LOGREC IS UNAVAILABLE FOR   00411000
*                                      ERROR RECORDING. ALWAYS SET TO   00412000
*                                      ZERO FOR OS/VS1 ICB382        */ 00413000
*       3 CVTAPTHR BIT(1),          /* NIP SETS THIS BIT TO 1 WHEN      00414000
*                                      DEVICE TESTING IS COMPLETE. IF   00415000
*                                      1, I/O SUPERVISOR USES AN        00416000
*                                      ALTERNATE PATH TO A DEVICE       00417000
*                                      WHEN A CONDITION CODE OF 3       00418000
*                                      EXISTS. THIS BIT IS RESET BY     00419000
*                                      NIP TO 0 AFTER THE LINK PACK     00420000
*                                      AREA IS INITIALIZED.    YM2670*/ 00421000
*       3 CVTFP BIT(1),             /* CPU HAS FETCH PROTECTION 02S0036 00422000
*                                      FEATURE (OS/VS1) ICB427       */ 00423000
*       3 CVTRSV16 BIT(1),          /* RESERVED                      */ 00424000
*       3 CVTRSV17 BIT(1),          /* RESERVED                      */ 00425000
*      2 CVTQCDSR PTR(31),          /* CDE SEARCH ROUTINE ADDRESS       00426000
*                                      (OS/VS2) ADDRESS OF THE  02S0036 00427000
*                                      ROUTINE THAT SEARCHES THE        00428000
*                                      REENTERABLE LOAD MODULE QUEUE    00429000
*                                      (OS/VS1)                      */ 00430000
*      2 CVTQLPAQ PTR(31),          /* ADDRESS OF POINTER TO MOST       00431000
*                                      RECENT ENTRY ON LINK PACK AREA   00432000
*                                      CDE QUEUE (OS/VS2) ADDRESS OF    00433000
*                                      THE REENTERABLE LOAD MODULE      00434000
*                                      QUEUE (OS/VS1)                */ 00435000
*      2 CVTRSV18 PTR(31),          /* ** CVTMPCVT FIELD UNUSED IN      00436000
*                                      OS/VS **                      */ 00437000
*      2 CVTSMCA PTR(31),           /* ADDRESS OF THE SYSTEM    02S0036 00438000
*                                      MANAGEMENT CONTROL AREA (SMCA)   00439000
*                                      IF THE SYSTEM MANAGEMENT 02S0036 00440000
*                                      FACILITIES (SMF) OPTION IS       00441000
*                                      PRESENT IN THE SYSTEM.   02S0036 00442000
*                                      OTHERWISE, ZERO.              */ 00443000
*      2 CVTABEND PTR(31),          /* ADDRESS OF SECONDARY CVT FOR     00444000
*                                      ABEND IN EOT (OS/VS2) USED BY    00445000
*                                      AN INTERNAL ABEND TRACE  02S0036 00446000
*                                      ROUTINE FOR DEBUG PURPOSES       00447000
*                                      (OS/VS1)                XM0615*/ 00448000
*      2 CVTUSER PTR(31),           /* A WORD AVAILABLE TO THE USER  */ 00449000
*      2 CVTMDLDS PTR(31),          /* RESERVED FOR MODEL-DEPENDENT     00450000
*                                      SUPPORT                       */ 00451000
*      2 CVTQABST CHAR(2) BDY(WORD),/* AN SVC 13 (ABEND) INSTRUCTION    00452000
*                                      (OS/VS2) RESERVED (OS/VS1)    */ 00453000
*      2 CVTLNKSC CHAR(2) BDY(WORD,3),/* AN SVC 6 (LINK) INSTRUCTION    00454000
*                                      ICB369                        */ 00455000
*      2 CVTTSCE PTR(31),           /* ADDRESS OF THE FIRST TIME        00456000
*                                      SLICE CONTROL ELEMENT (TSCE)  */ 00457000
*      2 CVTPATCH PTR(31),          /* ADDRESS OF A 200-BYTE FE PATCH   00458000
*                                      AREA                          */ 00459000
*      2 CVTRMS PTR(31),            /* RECOVERY MANAGEMENT SUPPORT      00460000
*                                      (RMS) COMMUNICATIONS VECTOR.     00461000
*                                      ADDRESS OF A MACHINE STATUS      00462000
*                                      BLOCK.                        */ 00463000
*      2 CVTRV515 PTR(31),          /* ** CVTTSCVT FIELD UNUSED IN      00464000
*                                      MVS ** (MDC037)       @Z40AQ9A*/ 00465000
*      2 CVT0SCR1 PTR(31),          /* ADDRESS OF THE SECTOR    02S0036 00466000
*                                      CALCULATION ROUTINE FOR  02S0036 00467000
*                                      ROTATIONAL POSITION SENSING      00468000
*                                      (RPS)                         */ 00469000
*      2 CVTGTF PTR(31),            /* GENERALIZED TRACE FACILITY       00470000
*                                      (GTF) CONTROL WORD ICB312     */ 00471000
*       3 CVTGTFST BIT(8),          /* GTF FLAG BYTE ICB312          */ 00472000
*        4 CVTGTFS BIT(2),          /* GTF STATUS (OS/VS1) MDC088    */ 00473000
*         5 CVTGTFAV BIT(1),        /* IF ZERO, GTF NOT ACTIVE. IF      00474000
*                                      ONE, GTF ACTIVE. (OS/VS2)        00475000
*                                      MDC098                        */ 00476000
*         5 CVTRV315 BIT(1),        /* RESERVED (OS/VS2)             */ 00477000
*        4 CVTSTATE BIT(1),         /* GTF IS IN CONTROL PROCESSING A   00478000
*                                      HOOK (OS/VS1) MDC093          */ 00479000
*         5 CVTRV316 BIT(1),        /* RESERVED (OS/VS2)             */ 00480000
*        4 CVTTMODE BIT(1),         /* IF 0, MODE=INT SPECIFIED. IF     00481000
*                                      1, MODE=EXT SPECIFIED WHICH      00482000
*                                      MEANS TRACE DATA IS TO BE        00483000
*                                      WRITTEN TO AN EXTERNAL DEVICE.   00484000
*                                      (OS/VS1) MDC094               */ 00485000
*         5 CVTRV317 BIT(1),        /* RESERVED (OS/VS2)             */ 00486000
*        4 CVTFORM BIT(1),          /* TRACE DATA IS TO BE FORMATTED    00487000
*                                      ON ABNORMAL TERMINATION  02S0036 00488000
*                                      (OS/VS1) MDC095               */ 00489000
*         5 CVTRV318 BIT(1),        /* RESERVED (OS/VS2)             */ 00490000
*        4 CVTUSR BIT(1),           /* TRACE=USR SPECIFIED.     02S0036 00491000
*                                      USER-REQUESTED TRACE DATA IS     00492000
*                                      TO BE INCLUDED IN THE TRACE      00493000
*                                      DATA SET. (MDC317)    @Z30AP9A*/ 00494000
*        4 CVTRNIO BIT(1),          /* GTF IS ACTIVE AND TRACING RNIO   00495000
*                                      EVENTS MDC187                 */ 00496000
*        4 CVTRSV27 BIT(1),         /* RESERVED                      */ 00497000
*       3 CVTGTFA PTR(24),          /* ADDRESS OF THE MONITOR CALL      00498000
*                                      VECTOR TABLE (OS/VS1) ADDRESS    00499000
*                                      OF MAIN MONITOR CALL ROUTING     00500000
*                                      TABLE, MCHEAD (OS/VS2) MDC156 */ 00501000
*      2 CVTAQAVT PTR(31),          /* ADDRESS OF THE FIRST WORD OF     00502000
*                                      THE TCAM DISPATCHER WHICH        00503000
*                                      CONTAINS THE ADDRESS OF THE      00504000
*                                      ADDRESS VECTOR TABLE (AVT). IF   00505000
*                                      ZERO, TCAM IS NOT STARTED     */ 00506000
*       3 CVTTCMFG CHAR(1),         /* TCAM FLAGS                    */ 00507000
*        4 CVTTCRDY BIT(1),         /* TCAM IS READY TO ACCEPT USERS */ 00508000
*        4 CVTRSV28 BIT(1),         /* RESERVED                      */ 00509000
*        4 CVTRSV29 BIT(1),         /* RESERVED                      */ 00510000
*        4 CVTRSV30 BIT(1),         /* RESERVED                      */ 00511000
*        4 CVTRSV31 BIT(1),         /* RESERVED                      */ 00512000
*        4 CVTRSV32 BIT(1),         /* RESERVED                      */ 00513000
*        4 CVTRSV33 BIT(1),         /* RESERVED                      */ 00514000
*        4 CVTRSV34 BIT(1),         /* RESERVED                      */ 00515000
*       3 CVTAQAVB PTR(24),         /* SAME AS CVTAQAVT ABOVE        */ 00516000
*      2 CVTVOLM2 PTR(31),          /* ADDRESS OF TABLE FOR POWER       00517000
*                                      WARNING FEATURE (PWF) (OS/VS2)   00518000
*                                      (MDC308)              @Z30AQ9A*/ 00519000
*       3 CVTTATA PTR(31),          /* ADDRESS OF THE FIRST ENTRY IN    00520000
*                                      THE TCB ADDRESS TABLE. THE       00521000
*                                      FIRST ENTRY IS FOR PARTITION     00522000
*                                      0. (OS/VS1)                   */ 00523000
*        4 CVTTSKS PTR(8),          /* MAXIMUM ALLOWABLE NUMBER OF      00524000
*                                      ENTRIES IN THE TCB ADDRESS       00525000
*                                      TABLE (OS/VS1)                */ 00526000
*         5 CVTVOLF2 BIT(8),        /* PWF FLAG BYTE. THIS BYTE IS      00527000
*                                      OVERLAID BY CVTVOLM2 AFTER PWF   00528000
*                                      INITIALIZATION. (OS/VS2) 02S0036 00529000
*                                      (MDC309)              @Z30AQ9A*/ 00530000
*          6 CVTVOLI2 BIT(1),       /* PWF INITIALIZATION HAS NOT       00531000
*                                      OCCURRED (OS/VS2) (MDC310)       00532000
*                                                            @Z30AQ9A*/ 00533000
*        4 CVTTAT PTR(24),          /* SAME AS CVTTATA ABOVE         */ 00534000
*         5 CVTVOLT2 PTR(24),       /* PWF RECHECK TIME DELAY. THIS     00535000
*                                      VALUE IS OVERLAID BY CVTVOLM2    00536000
*                                      AFTER PWF INITIALIZATION.        00537000
*                                      (OS/VS2) (MDC311)     @Z30AQ9A*/ 00538000
*      2 CVTATER PTR(31),           /* ADDRESS OF THE SYSTEM ERROR      00539000
*                                      TCB. THE PURGE ROUTINE USES      00540000
*                                      THIS FIELD TO ACCESS THE SIRB.   00541000
*                                      (OS/VS1) ICB346               */ 00542000
*       3 CVTSYST PTR(8),           /* NUMBER OF ENTRIES IN THE TCB     00543000
*                                      ADDRESS TABLE FOR TCB'S  02S0036 00544000
*                                      CREATED DURING SYSTEM    02S0036 00545000
*                                      GENERATION (OS/VS1)           */ 00546000
*       3 CVTATERA PTR(24),         /* SAME AS CVTATER ABOVE         */ 00547000
*      2 CVTEXT1 PTR(31),           /* ADDRESS OF OS - OS/VS COMMON     00548000
*                                      EXTENSION ICB421              */ 00549000
*      2 CVTCBSP PTR(31),           /* ADDRESS OF ACCESS METHOD 02S0036 00550000
*                                      CONTROL BLOCK STRUCTURE MDC195*/ 00551000
*      2 CVTPURG PTR(31),           /* ADDRESS OF SUBSYSTEM PURGE       00552000
*                                      ROUTINE ICB330                */ 00553000
*       3 CVTRSV35 PTR(8),          /* RESERVED ICB330               */ 00554000
*       3 CVTPURGA PTR(24),         /* ADDRESS OF SUBSYSTEM PURGE       00555000
*                                      ROUTINE ICB330                */ 00556000
*      2 CVTAMFF CHAR(4),           /* RESERVED FOR ACCESS METHOD       00557000
*                                      FLAGS ICB436                  */ 00558000
*      2 CVTQMSG PTR(31),           /* ADDRESS OF INFORMATION TO BE     00559000
*                                      PRINTED BY ABEND ICB307       */ 00560000
*       3 CVTRSV36 PTR(8),          /* RESERVED ICB307               */ 00561000
*       3 CVTQMSGA PTR(24),         /* ADDRESS OF INFORMATION TO BE     00562000
*                                      PRINTED BY ABEND ICB307       */ 00563000
*      2 CVTDMSR PTR(31),           /* SAME AS CVTDMSRA BELOW ICB346 */ 00564000
*       3 CVTRSV37 PTR(8),          /* RESERVED (OS/VS1) ICB346      */ 00565000
*        4 CVTDMSRF BIT(8),         /* OPEN/CLOSE/EOV FLAG BYTE.        00566000
*                                      SETTING BOTH BIT 0 AND BIT 1     00567000
*                                      ON WILL CAUSE BOTH KINDS OF      00568000
*                                      DUMPS TO BE TAKEN. THESE BITS    00569000
*                                      ARE USED DURING TESTING AND      00570000
*                                      DEBUGGING WHEN OTHER DEBUG       00571000
*                                      METHODS ARE INEFFECTIVE. 02S0036 00572000
*                                      (OS/VS2) (MDC350)     @Z40AQ9A*/ 00573000
*         5 CVTSDUMP BIT(1),        /* SET BY COREZAP. WILL CAUSE AN    00574000
*                                      SDUMP TO BE TAKEN AND IEC999I    00575000
*                                      MESSAGE ISSUED FOR EVERY ABEND   00576000
*                                      ISSUED WITHIN AN         02S0036 00577000
*                                      OPEN/CLOSE/EOV OR DADSM  02S0036 00578000
*                                      FUNCTION. (OS/VS2) (MDC351)      00579000
*                                                            @Z40AQ9A*/ 00580000
*         5 CVTUDUMP BIT(1),        /* SET BY COREZAP. WILL CAUSE AN    00581000
*                                      ABEND DUMP TO BE TAKEN FOR       00582000
*                                      EVERY ABEND ISSUED WITHIN AN     00583000
*                                      OPEN/CLOSE/EOV OR DADSM  02S0036 00584000
*                                      FUNCTION. (OS/VS2) (MDC352)      00585000
*                                                            @Z40AQ9A*/ 00586000
*         5 CVTRV629 BIT(1),        /* RESERVED (OS/VS2)     @Z40AQ9A*/ 00587000
*         5 CVTRV630 BIT(1),        /* RESERVED (OS/VS2)     @Z40AQ9A*/ 00588000
*         5 CVTRV631 BIT(1),        /* RESERVED (OS/VS2)     @Z40AQ9A*/ 00589000
*         5 CVTRV632 BIT(1),        /* RESERVED (OS/VS2)     @Z40AQ9A*/ 00590000
*         5 CVTRV633 BIT(1),        /* RESERVED (OS/VS2)     @Z40AQ9A*/ 00591000
*         5 CVTRV634 BIT(1),        /* RESERVED (OS/VS2)     @Z40AQ9A*/ 00592000
*       3 CVTDMSRA PTR(24),         /* ADDRESS OF THE OPEN/CLOSE/EOV    00593000
*                                      SUPERVISORY ROUTINE IN THE       00594000
*                                      NUCLEUS. THIS ROUTINE HANDLES    00595000
*                                      THE ROUTING OF CONTROL AMONG     00596000
*                                      THE I/O SUPPORT ROUTINES.        00597000
*                                      ICB346                        */ 00598000
*      2 CVTRSV38 PTR(31),          /* RESERVED                      */ 00599000
*      2 CVTRSV39 PTR(31),          /* RESERVED                      */ 00600000
*/*            OS/VS1 - OS/VS2 COMMON SECTION                        */ 00601000
*                                                               02S0036 00602000
*      2 CVTREAL PTR(31),           /* ADDRESS OF THE VIRTUAL STORAGE   00603000
*                                      BYTE FOLLOWING THE HIGHEST       00604000
*                                      VIRTUAL=REAL STORAGE ADDRESS     00605000
*                                      ICB368                        */ 00606000
*      2 CVTPTRV PTR(31),           /* ADDRESS OF PAGING SUPERVISOR     00607000
*                                      GENERAL ROUTINE TO TRANSLATE     00608000
*                                      REAL ADDRESSES TO VIRTUAL        00609000
*                                      ADDRESSES                     */ 00610000
*      2 CVTMODE PTR(31),           /* ADDRESS OF ROUTINE TO CHANGE     00611000
*                                      SYSTEM MASK (OS/VS1) (MDC217)    00612000
*                                                              YM4244*/ 00613000
*      2 CVTJESCT PTR(31),          /* ADDRESS OF JOB ENTRY SUBSYSTEM   00614000
*                                      (JES) CONTROL TABLE           */ 00615000
*      2 CVTJEPS PTR(31),           /* ADDRESS OF JOB ENTRY     02S0036 00616000
*                                      PERIPHERAL SERVICES (JEPS)       00617000
*                                      MONITOR TCB (OS/VS1)    YM2702*/ 00618000
*      2 CVTTZ FIXED(31),           /* DIFFERENCE BETWEEN LOCAL TIME    00619000
*                                      AND GREENWICH MEAN TIME IN       00620000
*                                      BINARY UNITS OF 1.048576 02S0036 00621000
*                                      SECONDS                       */ 00622000
*      2 CVTMCHPR PTR(31),          /* ADDRESS OF MACHINE CHECK 02S0036 00623000
*                                      PARAMETER LIST                */ 00624000
*      2 CVTEORM PTR(31),           /* HIGHEST REAL ADDRESS IN MAIN     00625000
*                                      STORAGE (OS/VS1) POTENTIAL       00626000
*                                      REAL HIGH STORAGE ADDRESS        00627000
*                                      (OS/VS2) MDC087               */ 00628000
*      2 CVTERPV PTR(31),           /* ADDRESS OF I/O SUPERVISOR        00629000
*                                      SUBROUTINE TO CONVERT CCW DATA   00630000
*                                      ADDRESSES TO VIRTUAL ADDRESSES   00631000
*                                      (OS/VS1) (MDC219)       YM4043*/ 00632000
*       3 CVTRV517 PTR(31),         /* ** CVTERPV FIELD UNUSED IN MVS   00633000
*                                      ** (MDC219)             YM4043*/ 00634000
*      2 CVTINTLA PTR(31),          /* ADDRESS OF A TIME INTERVAL.      00635000
*                                      I/O LOAD BALANCING COUNTS THE    00636000
*                                      NUMBER OF EXCP'S ISSUED DURING   00637000
*                                      THIS TIME INTERVAL AND USES      00638000
*                                      THE VALUE IN DETERMINING THE     00639000
*                                      AMOUNT OF I/O ACTIVITY IN THE    00640000
*                                      SYSTEM. (OS/VS1) (MDC220)        00641000
*                                                              YM4043*/ 00642000
*       3 CVTRV518 PTR(31),         /* ** CVTINTLA FIELD UNUSED IN      00643000
*                                      MVS ** (MDC220)         YM4043*/ 00644000
*      2 CVTAPF PTR(31),            /* SAME AS CVTAPFA BELOW ICB360  */ 00645000
*       3 CVTRSV40 PTR(8),          /* RESERVED ICB360               */ 00646000
*       3 CVTAPFA PTR(24),          /* ADDRESS OF BRANCH ENTRY POINT    00647000
*                                      IN AUTHORIZED PROGRAM FACILITY   00648000
*                                      (APF) ROUTINE                 */ 00649000
*      2 CVTEXT2 PTR(31),           /* ADDRESS OF OS/VS1 - OS/VS2       00650000
*                                      COMMON EXTENSION ICB330       */ 00651000
*       3 CVTRSV41 PTR(8),          /* RESERVED ICB330               */ 00652000
*       3 CVTEXT2A PTR(24),         /* SAME AS CVTEXT2 ABOVE ICB330  */ 00653000
*      2 CVTHJES PTR(31),           /* SAME AS CVTHJESA BELOW ICB454 */ 00654000
*       3 CVTRSV42 PTR(8),          /* RESERVED ICB454               */ 00655000
*       3 CVTHJESA PTR(24),         /* ADDRESS OF OPTIONAL JOB ENTRY    00656000
*                                      SUBSYSTEM (JES) COMMUNICATION    00657000
*                                      VECTOR TABLE ICB454           */ 00658000
*      2 CVTRSV43 FIXED(15),        /* RESERVED                      */ 00659000
*      2 CVTRSV44 FIXED(15),        /* RESERVED                      */ 00660000
*      2 CVTRSV45 PTR(31),          /* RESERVED                      */ 00661000
*      2 CVTRSV46 PTR(31),          /* RESERVED                      */ 00662000
*/*            OS/VS1 OVERLAY                                        */ 00663000
*                                                               02S0036 00664000
*      2 CVTPGSIA PTR(31),          /* ADDRESS OF PAGING SUPERVISOR     00665000
*                                      INFORMATION AREA              */ 00666000
*      2 CVTPCVT PTR(31),           /* ADDRESS OF PAGED CVT EXTENSION*/ 00667000
*      2 CVTA1F1 CHAR(1),           /* PAGE FAULT FLAGS              */ 00668000
*       3 CVTPFSW BIT(1),           /* ONLY THE PAGING TASK MAY BE      00669000
*                                      DISPATCHED                    */ 00670000
*       3 CVTSRSW BIT(1),           /* NO TASK EXCEPT THE PAGING TASK   00671000
*                                      MAY EXECUTE DISABLED CODE     */ 00672000
*       3 CVTRSV47 BIT(1),          /* RESERVED                      */ 00673000
*       3 CVTRSV48 BIT(1),          /* RESERVED                      */ 00674000
*       3 CVTRSV49 BIT(1),          /* RESERVED                      */ 00675000
*       3 CVTRSV50 BIT(1),          /* RESERVED                      */ 00676000
*       3 CVTRSV51 BIT(1),          /* RESERVED                      */ 00677000
*       3 CVTRSV52 BIT(1),          /* RESERVED                      */ 00678000
*      2 CVTSYSK CHAR(1),           /* SYSTEM LOCK. IF NOT ZERO, ONLY   00679000
*                                      THE PAGING TASK MAY BE   02S0036 00680000
*                                      DISPATCHED                    */ 00681000
*       3 CVTRSV53 BIT(1),          /* RESERVED                      */ 00682000
*       3 CVTRSV54 BIT(1),          /* RESERVED                      */ 00683000
*       3 CVTRSV55 BIT(1),          /* RESERVED                      */ 00684000
*       3 CVTRSV56 BIT(1),          /* RESERVED                      */ 00685000
*       3 CVTSLKR BIT(1),           /* MACHINE CHECK HANDLING IS IN     00686000
*                                      PROGRESS ICB320               */ 00687000
*       3 CVTSLKQ BIT(1),           /* SYSTEM QUEUE AREA (SQA) HAS      00688000
*                                      BEEN EXHAUSTED                */ 00689000
*       3 CVTSLKP BIT(1),           /* LAST PAGING CONTROL BLOCK        00690000
*                                      (PCB) HAS BEEN USED           */ 00691000
*       3 CVTSLKO BIT(1),           /* A ROUTINE RUNNING DISABLED HAS   00692000
*                                      PRODUCED A PAGE FAULT         */ 00693000
*      2 CVTSULK FIXED(15),         /* SUPERVISOR LOCK. NUMBER OF       00694000
*                                      TASKS ATTEMPTING TO EXECUTE      00695000
*                                      DISABLED ROUTINES. IF NOT        00696000
*                                      ZERO, ONLY ENABLED TASKS MAY     00697000
*                                      RUN.                          */ 00698000
*      2 CVTSMF PTR(31),            /* ADDRESS OF SYSTEM MANAGEMENT     00699000
*                                      FACILITIES (SMF) TCB ICB395   */ 00700000
*      2 CVTPNWFR PTR(31),          /* ADDRESS OF ROUTINE WHICH FREES   00701000
*                                      THE 'EMERGENCY' WORK AREA        00702000
*                                      (ICB413)                XM2452*/ 00703000
*      2 CVTDDCE PTR(31),           /* ADDRESS OF DYNAMIC DISPATCHING   00704000
*                                      CONTROL ELEMENT ICB466        */ 00705000
*      2 CVTRSV57 FIXED(15),        /* RESERVED                      */ 00706000
*      2 CVTRSV58 FIXED(15),        /* RESERVED                      */ 00707000
*      2 CVTSTOA FIXED(31),         /* SAVE AREA FOR THE REAL STORAGE   00708000
*                                      ADDRESS OF THE SEGMENT TABLE     00709000
*                                      ORIGIN ICB496                 */ 00710000
*      2 CVTVOLM1 PTR(31),          /* ADDRESS OF TABLE FOR POWER       00711000
*                                      WARNING FEATURE (PWF) (MDC312)   00712000
*                                                            @X04AQ9A*/ 00713000
*       3 CVTVOLF1 BIT(8),          /* PWF FLAG BYTE. THIS BYTE IS      00714000
*                                      OVERLAID BY CVTVOLM1 AFTER PWF   00715000
*                                      INITIALIZATION. (MDC313) 02S0036 00716000
*                                                            @X04AQ9A*/ 00717000
*        4 CVTVOLI1 BIT(1),         /* PWF INITIALIZATION HAS NOT       00718000
*                                      OCCURRED (MDC314)     @X04AQ9A*/ 00719000
*       3 CVTVOLT1 PTR(24),         /* PWF RECHECK TIME DELAY. THIS     00720000
*                                      VALUE IS OVERLAID BY CVTVOLM1    00721000
*                                      AFTER PWF INITIALIZATION.        00722000
*                                      (MDC315)              @X04AQ9A*/ 00723000
*      2 CVTRSV61 PTR(31),          /* RESERVED                      */ 00724000
*      2 CVTATMCT PTR(31),          /* POINTER TO VTAM CONTROL TABLE    00725000
*                                      MDC082                        */ 00726000
*       3 CVTATMST CHAR(1),         /* VTAM START STATUS MDC135      */ 00727000
*       3 CVTATMCA PTR(24),         /* POINTER TO VTAM CONTROL TABLE    00728000
*                                      MDC138                        */ 00729000
*      2 CVTAUTH PTR(31),           /* POINTER TO AUTHORIZED LIBRARY    00730000
*                                      TABLE MDC188                  */ 00731000
*      2 CVTACTAP PTR(31),          /* ADDRESS OF BRANCH ENTRY TO       00732000
*                                      VTAM'S SVC ROUTINE ISTAPC42      00733000
*                                      (MDC216)              @X31BH9A*/ 00734000
*      2 CVTRV485 PTR(31),          /* RESERVED MDC106               */ 00735000
*      2 CVTRV486 PTR(31),          /* RESERVED MDC106               */ 00736000
*      2 CVTRV487 PTR(31),          /* RESERVED MDC106               */ 00737000
*      2 CVTRV488 PTR(31);          /* RESERVED MDC106               */ 00738000
*/*            OS/VS2 OVERLAY                                        */ 00739000
*                                                               02S0037 00740000
*   DECLARE                                                     02S0037 00741000
*     1 CVTS01 DEF(CVTPGSIA) BDY(WORD),                         02S0037 00742000
*      2 CVTGETL PTR(31),           /* ADDRESS OF IKJGETL, TSO GET      00743000
*                                      LINE ROUTINE (MDC206)   YM2225*/ 00744000
*      2 CVTLPDSR PTR(31),          /* ADDRESS OF LINK PACK AREA        00745000
*                                      (LPA) DIRECTORY SEARCH ROUTINE*/ 00746000
*      2 CVTPVTP PTR(31),           /* ADDRESS OF PAGE VECTOR TABLE  */ 00747000
*      2 CVTLPDIA PTR(31),          /* ADDRESS OF LINK PACK AREA        00748000
*                                      (LPA) DIRECTORY (ON PAGE 02S0037 00749000
*                                      BOUNDARY)                     */ 00750000
*       3 CVTDIRST CHAR(1),         /* FLAG BYTE                     */ 00751000
*        4 CVTDICOM BIT(1),         /* LPA DIRECTORY HAS BEEN   02S0037 00752000
*                                      INITIALIZED BY NIP            */ 00753000
*        4 CVTRSV63 BIT(1),         /* RESERVED                      */ 00754000
*        4 CVTRSV64 BIT(1),         /* RESERVED                      */ 00755000
*        4 CVTRSV65 BIT(1),         /* RESERVED                      */ 00756000
*        4 CVTRSV66 BIT(1),         /* RESERVED                      */ 00757000
*        4 CVTRSV67 BIT(1),         /* RESERVED                      */ 00758000
*        4 CVTRSV68 BIT(1),         /* RESERVED                      */ 00759000
*        4 CVTRSV69 BIT(1),         /* RESERVED                      */ 00760000
*       3 CVTLPDIR PTR(24),         /* ADDRESS OF LPA DIRECTORY. ON     00761000
*                                      PAGE BOUNDARY                 */ 00762000
*      2 CVTRV320 PTR(31),          /* ** CVTPAGE1 FIELD UNUSED IN      00763000
*                                      MVS ** (MDC112)       @Z40AQ9A*/ 00764000
*      2 CVTRV321 PTR(31),          /* ** CVTPGSUP FIELD UNUSED IN      00765000
*                                      MVS ** (MDC113)       @Z40AQ9A*/ 00766000
*      2 CVTSLIDA CHAR(4) BDY(WORD),/* IDENTITY OF TCB CAUSING  02S0037 00767000
*                                      SUPERVISOR LOCK BYTE (CVTSYLK)   00768000
*                                      TO BE SET OR IDENTITY OF TCB     00769000
*                                      THAT SECOND EXIT PROCESSING IS   00770000
*                                      FOR WHEN CVTSEIC=1            */ 00771000
*       3 CVTSYLK CHAR(1),          /* SUPERVISOR LOCK. ONLY ENABLED    00772000
*                                      TASKS MAY BE DISPATCHED       */ 00773000
*       3 CVTSLID CHAR(3),          /* SAME AS CVTSLIDA ABOVE        */ 00774000
*      2 CVTRV322 PTR(31),          /* RESERVED FOR FUTURE USE  02S0037 00775000
*                                      (MDC343)              @Z40AQ9A*/ 00776000
*      2 CVTRV328 PTR(31),          /* ** CVTSEG AND CVTSEGA FIELDS     00777000
*                                      UNUSED IN MVS ** (MDC139)        00778000
*                                                            @Z40AQ9A*/ 00779000
*      2 CVTRV329 PTR(31),          /* ** CVTSEGB FIELD UNUSED IN MVS   00780000
*                                      ** (MDC141)           @Z40AQ9A*/ 00781000
*      2 CVTRV330 PTR(31),          /* ** CVTSEGC AND SUBFIELDS 02S0037 00782000
*                                      UNUSED IN MVS ** (MDC142)        00783000
*                                                            @Z40AQ9A*/ 00784000
*      2 CVTRV331 PTR(31),          /* ** CVTSEGD AND SUBFIELDS 02S0037 00785000
*                                      UNUSED IN MVS ** (MDC145)        00786000
*                                                            @Z40AQ9A*/ 00787000
*      2 CVTRSV77 PTR(8),           /* RESERVED                      */ 00788000
*      2 CVTSPVLK PTR(8),           /* NUMBER OF TASKS WHICH HAVE       00789000
*                                      TERMINATED WHILE OWNING  02S0037 00790000
*                                      SUPERVISOR LOCK WITHOUT  02S0037 00791000
*                                      OPERATOR HAVING YET BEEN 02S0037 00792000
*                                      NOTIFIED                      */ 00793000
*      2 CVTCTLFG CHAR(1),          /* SYSTEM CONTROL FLAGS          */ 00794000
*       3 CVTRV323 BIT(1),          /* ** CVTPSIC BIT UNUSED IN MVS     00795000
*                                      ** (MDC118)           @Z40AQ9A*/ 00796000
*       3 CVTRV333 BIT(1),          /* ** CVTAPGB BIT UNUSED IN MVS     00797000
*                                      ** (MDC151)           @Z40AQ9A*/ 00798000
*       3 CVTRSV78 BIT(1),          /* RESERVED ICB382               */ 00799000
*       3 CVTDSTAT BIT(1),          /* DEVSTAT OPTION IN EFFECT.        00800000
*                                      DEVICE ADDRESS FOR 2319, 3330,   00801000
*                                      2314, 3330-1, 3340 CAN VARY      00802000
*                                      ACROSS SYSTEMS MDC189         */ 00803000
*       3 CVTRSV79 BIT(1),          /* RESERVED                      */ 00804000
*       3 CVTNOMP BIT(1),           /* MULTIPROCESSING CODE IS NOT IN   00805000
*                                      THE SYSTEM MDC176             */ 00806000
*       3 CVTGTRCE BIT(1),          /* GENERALIZED TRACE FACILITY       00807000
*                                      (GTF) HAS SUPPRESSED     02S0037 00808000
*                                      SUPERVISOR TRACE ICB446       */ 00809000
*       3 CVTSDTRC BIT(1),          /* SVC DUMP HAS SUPPRESSED  02S0037 00810000
*                                      SUPERVISOR TRACE ICB446       */ 00811000
*      2 CVTAPG CHAR(1),            /* DISPATCHING PRIORITY OF  02S0037 00812000
*                                      AUTOMATIC PRIORITY GROUP (APG)   00813000
*                                      ICB339                        */ 00814000
*      2 CVTTRACE CHAR(2) BDY(WORD),/* BRANCH ON REGISTER       02S0037 00815000
*                                      INSTRUCTION. SET BY NIP. 02S0037 00816000
*                                      REGISTER TEN FOR TRACE.  02S0037 00817000
*                                      REGISTER ELEVEN FOR NO TRACE. */ 00818000
*      2 CVTTRAC2 CHAR(2) BDY(WORD,3),/* BRANCH ON REGISTER 11  02S0037 00819000
*                                      INSTRUCTION. THIS ALLOWS FOR     00820000
*                                      SUPPRESSING TRACE DYNAMICALLY    00821000
*                                      BY SETTING CONDITION CODE MASK   00822000
*                                      TO ZERO IN FIRST INSTRUCTION     00823000
*                                      (CVTTRACE)                    */ 00824000
*      2 CVTRSCN PTR(31),           /* ADDRESS OF ROUTINE TO SCAN TCB   00825000
*                                      TREE                          */ 00826000
*      2 CVTTAS PTR(31),            /* ADDRESS OF ROUTINE TO TRANSFER   00827000
*                                      ADDRESS SPACE                 */ 00828000
*      2 CVTRV332 PTR(31),          /* ** CVTPVALD FIELD UNUSED IN      00829000
*                                      MVS ** (MDC148)       @Z40AQ9A*/ 00830000
*      2 CVTSHRVM PTR(31),          /* LOWEST ADDRESS OF SHARED 02S0037 00831000
*                                      VIRTUAL STORAGE AREA. THIS       00832000
*                                      ADDRESS WILL BE THE BEGINNING    00833000
*                                      OF THE COMMON SERVICE AREA       00834000
*                                      (CSA) (MDC324)        @Z30AQ9A*/ 00835000
*      2 CVT0VL01 PTR(31),          /* ENTRY POINT ADDRESS OF   02S0037 00836000
*                                      VALIDITY CHECK ROUTINE   02S0037 00837000
*                                      (IEA0VL01) USED TO COMPARE       00838000
*                                      PROTECT KEY OF AN ADDRESS WITH   00839000
*                                      TCB PROTECT KEY.              */ 00840000
*      2 CVTRV324 PTR(31),          /* ** CVTPFIXQ FIELD UNUSED IN      00841000
*                                      MVS ** (MDC119)       @Z40AQ9A*/ 00842000
*      2 CVTRV325 PTR(31),          /* ** CVTPFIXR FIELD UNUSED IN      00843000
*                                      MVS ** (MDC120)       @Z40AQ9A*/ 00844000
*      2 CVTRV326 PTR(31),          /* ** CVTPFIXP FIELD UNUSED IN      00845000
*                                      MVS ** (MDC121)       @Z40AQ9A*/ 00846000
*      2 CVTASCRF PTR(31),          /* CREATED ASCB QUEUE HEADER        00847000
*                                      (MDC337)              @ZA04120*/ 00848000
*      2 CVTASCRL PTR(31),          /* CREATED ASCB QUEUE TRAILER       00849000
*                                      (MDC338)              @ZA04120*/ 00850000
*      2 CVTPUTL PTR(31),           /* ADDRESS OF IKJPUTL, TSO PUT      00851000
*                                      LINE ROUTINE (MDC207)   YM2225*/ 00852000
*      2 CVTSRBRT PTR(31),          /* DISPATCHER RETURN ADDRESS FOR    00853000
*                                      SRB ROUTINES MDC130           */ 00854000
*      2 CVTOLT0A PTR(31),          /* BRANCH ENTRY TO OLTEP MEMORY     00855000
*                                      TERMINATION RESOURCE MANAGER     00856000
*                                      MDC129                        */ 00857000
*      2 CVTSMFEX PTR(31),          /* BRANCH ENTRY TO SYSTEM   02S0037 00858000
*                                      MANAGEMENT FACILITIES (SMF)      00859000
*                                      EXCP COUNTING ROUTINE FOR VAM    00860000
*                                      WINDOW INTERCEPT MDC133       */ 00861000
*      2 CVTCSPIE PTR(31),          /* FOR CHECKPOINT/RESTART, BRANCH   00862000
*                                      ENTRY TO SPIE MDC149          */ 00863000
*      2 CVTPTGT PTR(31),           /* ADDRESS OF IKJPTGT, TSO PUTGET   00864000
*                                      ROUTINE (MDC208)        YM2225*/ 00865000
*      2 CVTIOSPL PTR(8),           /* PRIORITY LEVEL OF I/O    02S0037 00866000
*                                      SUPERVISOR CHANNEL SCHEDULER     00867000
*                                      MDC019                        */ 00868000
*      2 CVTRV513 CHAR(1),          /* RESERVED MDC165               */ 00869000
*      2 CVTDSSAC CHAR(1),          /* DYNAMIC SUPPORT SYSTEM (DSS)     00870000
*                                      ACTIVATED FLAG - USED BY 02S0037 00871000
*                                      RESTART FLIH. IF X'00', DSS      00872000
*                                      NOT INITIALIZED. IF X'FF', DSS   00873000
*                                      HAS BEEN INITIALIZED. MDC163  */ 00874000
*      2 CVTRV139 PTR(8),           /* RESERVED                      */ 00875000
*      2 CVTSTCK PTR(31),           /* ADDRESS OF IKJSTCK, TSO STACK    00876000
*                                      ROUTINE (MDC209)        YM2225*/ 00877000
*      2 CVTMAXMP PTR(15),          /* FOR MEASUREMENT FACILITY 02S0037 00878000
*                                      (MF/1), MAXIMUM PHYSICAL CPU     00879000
*                                      ADDRESS SUPPORTED BY THIS        00880000
*                                      RELEASE MDC165                */ 00881000
*      2 CVTRV144 FIXED(15),        /* RESERVED                      */ 00882000
*      2 CVTSCAN PTR(31),           /* ADDRESS OF IKJSCAN, TSO SCAN     00883000
*                                      ROUTINE (MDC210)        YM2225*/ 00884000
*      2 CVTAUTHL PTR(31),          /* POINTER TO AUTHORIZED LIBRARY    00885000
*                                      TABLE MDC001                  */ 00886000
*      2 CVTBLDCP PTR(31),          /* BRANCH ENTRY TO BUILD POOL       00887000
*                                      MDC003                        */ 00888000
*      2 CVTGETCL PTR(31),          /* BRANCH ENTRY TO GET CELL 02S0037 00889000
*                                      MDC004                        */ 00890000
*      2 CVTFRECL PTR(31),          /* BRANCH ENTRY TO FREE CELL        00891000
*                                      MDC005                        */ 00892000
*      2 CVTDELCP PTR(31),          /* BRANCH ENTRY TO DELETE POOL      00893000
*                                      MDC006                        */ 00894000
*      2 CVTCRMN PTR(31),           /* BRANCH ENTRY TO SVC 120  02S0037 00895000
*                                      (GETMAIN/FREEMAIN:CRBRANCH)      00896000
*                                      MDC007                        */ 00897000
*      2 CVTCRAS PTR(31),           /* BRANCH ENTRY TO 'CREATE  02S0037 00898000
*                                      ADDRESS SPACE' MDC008         */ 00899000
*      2 CVTQSAS PTR(31),           /* BRANCH ENTRY TO TASK     02S0037 00900000
*                                      TERMINATION MDC009            */ 00901000
*      2 CVTFRAS PTR(31),           /* BRANCH ENTRY TO FREE ADDRESS     00902000
*                                      SPACE MDC010                  */ 00903000
*      2 CVTS1EE PTR(31),           /* BRANCH ENTRY TO STAGE 1 EXIT     00904000
*                                      EFFECTOR MDC011               */ 00905000
*      2 CVTPARS PTR(31),           /* ADDRESS OF IKJPARS, TSO PARSE    00906000
*                                      ROUTINE (MDC211)        YM2225*/ 00907000
*      2 CVTQUIS PTR(31),           /* BRANCH ENTRY TO QUIESCE MDC013*/ 00908000
*      2 CVTSTXU PTR(31),           /* BRANCH ENTRY TO ATTENTION EXIT   00909000
*                                      EPILOGUE MDC014               */ 00910000
*      2 CVTOPTE PTR(31),           /* BRANCH ENTRY ADDRESS TO  02S0037 00911000
*                                      SYSEVENT MDC015               */ 00912000
*      2 CVTSDRM PTR(31),           /* BRNACH ENTRY ADDRESS OF THE      00913000
*                                      RESOURCE MANAGER ROUTINE FOR     00914000
*                                      SVC DUMP. THIS ROUTINE CAN BE    00915000
*                                      INVOKED BY MEMORY TERMINATION    00916000
*                                      MDC077                        */ 00917000
*      2 CVTIOSCS PTR(31),          /* ENTRY POINT OF I/O SUPERVISOR    00918000
*                                      CHANNEL SCHEDULER MDC018      */ 00919000
*      2 CVTAQTOP PTR(31),          /* POINTER TO AREA CONTAINING       00920000
*                                      QUIESCE DESCRIPTOR BLOCK 02S0037 00921000
*                                      (QDB'S) FOR DEVICE ALLOCATION    00922000
*                                      MDC021                        */ 00923000
*      2 CVTVVMDI PTR(31),          /* CONSTANT USED BY PAGED LINK      00924000
*                                      PACK AREA (LPA) DIRECTORY        00925000
*                                      SEARCH ALGORITHM MDC022       */ 00926000
*      2 CVTASVT PTR(31),           /* POINTER TO ADDRESS SPACE 02S0037 00927000
*                                      VECTOR TABLE (ASVT) MDC070    */ 00928000
*      2 CVTGDA PTR(31),            /* POINTER TO GLOBAL DATA AREA      00929000
*                                      (GDA) IN SQA MDC024           */ 00930000
*      2 CVTASCBH PTR(31),          /* POINTER TO HIGHEST PRIORITY      00931000
*                                      ADDRESS SPACE CONTROL BLOCK      00932000
*                                      (ASCB) ON THE ASCB DISPATCHING   00933000
*                                      QUEUE (HEAD OF ASCB QUEUE)       00934000
*                                      MDC027                        */ 00935000
*      2 CVTASCBL PTR(31),          /* POINTER TO LOWEST PRIORITY       00936000
*                                      ASCB ON ASCB DISPATCHING QUEUE   00937000
*                                      MDC028                        */ 00938000
*      2 CVTRTMCT PTR(31),          /* POINTER TO               02S0037 00939000
*                                      RECOVERY/TERMINATION CONTROL     00940000
*                                      TABLE MDC031                  */ 00941000
*      2 CVTSV60 PTR(31),           /* ADDRESS OF SVC 60 BRANCH ENTRY   00942000
*                                      POINT (MDC354)        @Z40FP9A*/ 00943000
*      2 CVTSDMP PTR(31),           /* ADDRESS OF SVC DUMP BRANCH       00944000
*                                      ENTRY POINT MDC033            */ 00945000
*      2 CVTSCBP PTR(31),           /* ADDRESS OF SCB PURGE RESOURCE    00946000
*                                      MANAGER MDC034                */ 00947000
*      2 CVTSDBF PTR(31),           /* ADDRESS OF 4K SQA BUFFER USED    00948000
*                                      BY SVC DUMP. HIGH ORDER BIT OF   00949000
*                                      THIS CVT WORD IS USED AS LOCK    00950000
*                                      TO INDICATE BUFFER IS IN USE     00951000
*                                      MDC035                        */ 00952000
*      2 CVTRTMS PTR(31),           /* RTM1 INTERNAL SERVICABILITY      00953000
*                                      LEVEL INDICATOR MDC036        */ 00954000
*      2 CVTTPIOS PTR(31),          /* ADDRESS OF THE TELEPROCESSING    00955000
*                                      I/O SUPERV1SOR ROUTINE (TPIOS)   00956000
*                                      MDC078                        */ 00957000
*      2 CVTSIC PTR(31),            /* BRANCH ENTRY ADDRESS OF THE      00958000
*                                      ROUTINE TO SCHEDULE SYSTEM       00959000
*                                      INITIALIZED CANCEL MDC042     */ 00960000
*      2 CVTOPCTP PTR(31),          /* ADDRESS OF SYSTEM RESOURCES      00961000
*                                      MANAGER (SRM) CONTROL TABLE      00962000
*                                      MDC043                        */ 00963000
*      2 CVTEXPRO PTR(31),          /* ADDRESS OF EXIT PROLOGUE/TYPE    00964000
*                                      1 EXIT MDC044                 */ 00965000
*      2 CVTGSMQ PTR(31),           /* ADDRESS OF GLOBAL SERVICE        00966000
*                                      MANAGER QUEUE MDC045          */ 00967000
*      2 CVTLSMQ PTR(31),           /* ADDRESS OF LOCAL SERVICE 02S0037 00968000
*                                      MANAGER QUEUE MDC046          */ 00969000
*      2 CVTGSPL PTR(31),           /* ADDRESS OF GLOBAL SYSTEM 02S0037 00970000
*                                      PRIORITY LIST QUEUE MDC047    */ 00971000
*      2 CVTVWAIT PTR(31),          /* ADDRESS OF WAIT ROUTINE MDC048*/ 00972000
*      2 CVTPARRL PTR(31),          /* ADDRESS OF PARTIALLY LOADED      00973000
*                                      DELETE QUEUE MDC049           */ 00974000
*      2 CVTAPFT PTR(31),           /* ADDRESS OF AUTHORIZED PROGRAM    00975000
*                                      FACILITY (APF) TABLE.    02S0037 00976000
*                                      INITIALIZED BY NIP. MDC050    */ 00977000
*      2 CVTQCS01 PTR(31),          /* BRANCH ENTRY ADDRESS TO  02S0037 00978000
*                                      PROGRAM MANAGER USED BY ATTACH   00979000
*                                      MDC051                        */ 00980000
*      2 CVTFQCB PTR(31),           /* POINTER TO FIRST MAJOR QCB FOR   00981000
*                                      ENQ MDC052                    */ 00982000
*      2 CVTLQCB PTR(31),           /* POINTER TO LAST MAJOR QCB FOR    00983000
*                                      ENQ MDC053                    */ 00984000
*      2 CVTRENQ PTR(31),           /* RESOURCE MANAGER ADDRESS FOR     00985000
*                                      ENQ MDC054                    */ 00986000
*      2 CVTRSPIE PTR(31),          /* RESOURCE MANAGER FOR SPIE        00987000
*                                      MDC055                        */ 00988000
*      2 CVTLKRMA PTR(31),          /* RESOURCE MANAGER ADDRESS FOR     00989000
*                                      LOCK MANAGER MDC056           */ 00990000
*      2 CVTCSD PTR(31),            /* VIRTUAL ADDRESS OF COMMON        00991000
*                                      SYSTEM DATA AREA (CSD).  02S0037 00992000
*                                      INITIALIZED BY NIP. MDC057    */ 00993000
*      2 CVTDQIQE PTR(31),          /* RESOURCE MANAGER FOR EXIT        00994000
*                                      EFFECTORS MDC058              */ 00995000
*      2 CVTRPOST PTR(31),          /* RESOURCE MANAGER FOR POST        00996000
*                                      MDC059                        */ 00997000
*      2 CVT062R1 PTR(31),          /* BRANCH ENTRY TO DETACH MDC060 */ 00998000
*      2 CVTVEAC0 PTR(31),          /* ASCBCHAP BRANCH ENTRY MDC061  */ 00999000
*      2 CVTGLMN PTR(31),           /* GLOBAL BRANCH ENTRY ADDRESS      01000000
*                                      FOR GETMAIN/FREEMAIN MDC062   */ 01001000
*      2 CVTSPSA PTR(31),           /* POINTER TO GLOBAL WORK/SAVE      01002000
*                                      AREA VECTOR TABLE (WSAG) 02S0037 01003000
*                                      MDC071                        */ 01004000
*      2 CVTWSAL PTR(31),           /* ADDRESS OF TABLE OF LENGTHS OF   01005000
*                                      LOCAL WORK/SAVE AREAS MDC072  */ 01006000
*      2 CVTRV149 PTR(31),          /* RESERVED (MDC073)       YM4043*/ 01007000
*      2 CVTWSAC PTR(31),           /* ADDRESS OF TABLE OF LENGTHS OF   01008000
*                                      CPU WORK/SAVE AREAS MDC074    */ 01009000
*      2 CVTRECRQ PTR(31),          /* ADDRESS OF THE RECORDING 02S0037 01010000
*                                      REQUEST FACILITY (PART OF RTM1   01011000
*                                      - CALLED BY RTM2 AND RMS)        01012000
*                                      MDC075                        */ 01013000
*      2 CVTASMVT PTR(31),          /* POINTER TO AUXILIARY STORAGE     01014000
*                                      MANAGEMENT VECTOR TABLE (AMVT)   01015000
*                                      MDC076                        */ 01016000
*      2 CVTIOBP PTR(31),           /* ADDRESS OF THE BLOCK PROCESSOR   01017000
*                                      CVT MDC079                    */ 01018000
*      2 CVTSPOST PTR(31),          /* POST RESOURCE MANAGER    02S0037 01019000
*                                      TERMINATION ROUTINE (RMTR)       01020000
*                                      ENTRY POINT MDC085            */ 01021000
*      2 CVTRSTWD FIXED(31),        /* RESTART RESOURCE MANAGEMENT      01022000
*                                      WORD - CONTAINS IDENTIFIER OF    01023000
*                                      USER IF RESTART IS IN USE.       01024000
*                                      OTHERWISE, ZERO. MDC161       */ 01025000
*      2 CVTFETCH PTR(31),          /* ADDRESS OF ENTRY POINT FOR       01026000
*                                      BASIC FETCH MDC196            */ 01027000
*      2 CVT044R2 PTR(31),          /* ADDRESS OF IGC044R2 IN CHAP      01028000
*                                      SERVICE ROUTINE MDC197        */ 01029000
*      2 CVTPERFM PTR(31),          /* ADDRESS OF THE PERFORMANCE       01030000
*                                      WORK AREA. SET BY IGX00018.      01031000
*                                      MDC205                        */ 01032000
*      2 CVTDAIR PTR(31),           /* ADDRESS OF IKJDAIR, TSO  02S0037 01033000
*                                      DYNAMIC ALLOCATION INTERFACE     01034000
*                                      ROUTINE (MDC212)        YM2225*/ 01035000
*      2 CVTEHDEF PTR(31),          /* ADDRESS OF IKJEHDEF, TSO 02S0037 01036000
*                                      DEFAULT SERVICE ROUTINE  02S0037 01037000
*                                      (MDC213)                YM2225*/ 01038000
*      2 CVTEHCIR PTR(31),          /* ADDRESS OF IKJEHCIR, TSO 02S0037 01039000
*                                      CATALOG INFORMATION ROUTINE      01040000
*                                      (MDC214)                YM2225*/ 01041000
*      2 CVTSSAP PTR(31),           /* ADDRESS OF SYSTEM SAVE AREA      01042000
*                                      MDC063                        */ 01043000
*      2 CVTAIDVT PTR(31),          /* POINTER TO APPENDAGE ID VECTOR   01044000
*                                      TABLE MDC064                  */ 01045000
*      2 CVTIPCDS PTR(31),          /* BRANCH ENTRY FOR DIRECT SIGNAL   01046000
*                                      SERVICE ROUTINE MDC065        */ 01047000
*      2 CVTIPCRI PTR(31),          /* BRANCH ENTRY FOR REMOTE  02S0037 01048000
*                                      IMMEDIATE SIGNAL SERVICE 02S0037 01049000
*                                      ROUTINE MDC066                */ 01050000
*      2 CVTIPCRP PTR(31),          /* BRANCH ENTRY FOR REMOTE  02S0037 01051000
*                                      PENDABLE SIGNAL SERVICE  02S0037 01052000
*                                      ROUTINE MDC067                */ 01053000
*      2 CVTPCCAT PTR(31),          /* POINTER TO PHYSICAL CCA VECTOR   01054000
*                                      TABLE MDC068                  */ 01055000
*      2 CVTLCCAT PTR(31),          /* POINTER TO LOGICAL CCA VECTOR    01056000
*                                      TABLE MDC069                  */ 01057000
*      2 CVTRV210 BIT(8),           /* RESERVED                      */ 01058000
*       3 CVTRV211 BIT(1),          /* RESERVED                      */ 01059000
*       3 CVTRV212 BIT(1),          /* RESERVED                      */ 01060000
*       3 CVTRV213 BIT(1),          /* RESERVED                      */ 01061000
*       3 CVTRV214 BIT(1),          /* RESERVED                      */ 01062000
*       3 CVTRV215 BIT(1),          /* RESERVED                      */ 01063000
*       3 CVTRV216 BIT(1),          /* RESERVED                      */ 01064000
*       3 CVTRV217 BIT(1),          /* RESERVED                      */ 01065000
*       3 CVTRV218 BIT(1),          /* RESERVED                      */ 01066000
*      2 CVTRV219 BIT(8),           /* RESERVED                      */ 01067000
*       3 CVTRV220 BIT(1),          /* RESERVED                      */ 01068000
*       3 CVTRV221 BIT(1),          /* RESERVED                      */ 01069000
*       3 CVTRV222 BIT(1),          /* RESERVED                      */ 01070000
*       3 CVTRV223 BIT(1),          /* RESERVED                      */ 01071000
*       3 CVTRV224 BIT(1),          /* RESERVED                      */ 01072000
*       3 CVTRV225 BIT(1),          /* RESERVED                      */ 01073000
*       3 CVTRV226 BIT(1),          /* RESERVED                      */ 01074000
*       3 CVTRV227 BIT(1),          /* RESERVED                      */ 01075000
*      2 CVTRV228 BIT(8),           /* RESERVED                      */ 01076000
*       3 CVTRV229 BIT(1),          /* RESERVED                      */ 01077000
*       3 CVTRV230 BIT(1),          /* RESERVED                      */ 01078000
*       3 CVTRV231 BIT(1),          /* RESERVED                      */ 01079000
*       3 CVTRV232 BIT(1),          /* RESERVED                      */ 01080000
*       3 CVTRV233 BIT(1),          /* RESERVED                      */ 01081000
*       3 CVTRV234 BIT(1),          /* RESERVED                      */ 01082000
*       3 CVTRV235 BIT(1),          /* RESERVED                      */ 01083000
*       3 CVTRV236 BIT(1),          /* RESERVED                      */ 01084000
*      2 CVTRV237 BIT(8),           /* RESERVED                      */ 01085000
*       3 CVTRV238 BIT(1),          /* RESERVED                      */ 01086000
*       3 CVTRV239 BIT(1),          /* RESERVED                      */ 01087000
*       3 CVTRV240 BIT(1),          /* RESERVED                      */ 01088000
*       3 CVTRV241 BIT(1),          /* RESERVED                      */ 01089000
*       3 CVTRV242 BIT(1),          /* RESERVED                      */ 01090000
*       3 CVTRV243 BIT(1),          /* RESERVED                      */ 01091000
*       3 CVTRV244 BIT(1),          /* RESERVED                      */ 01092000
*       3 CVTRV245 BIT(1),          /* RESERVED                      */ 01093000
*      2 CVTRV246 PTR(8),           /* RESERVED                      */ 01094000
*      2 CVTRV247 PTR(8),           /* RESERVED                      */ 01095000
*      2 CVTRV248 PTR(8),           /* RESERVED                      */ 01096000
*      2 CVTRV249 PTR(8),           /* RESERVED                      */ 01097000
*      2 CVTRV250 PTR(8),           /* RESERVED                      */ 01098000
*      2 CVTRV251 PTR(8),           /* RESERVED                      */ 01099000
*      2 CVTRV252 PTR(15),          /* RESERVED                      */ 01100000
*      2 CVTRV253 FIXED(15),        /* RESERVED                      */ 01101000
*      2 CVTRV254 FIXED(15),        /* RESERVED                      */ 01102000
*      2 CVTPWI PTR(31),            /* ADDRESS OF THE WINDOW    02S0037 01103000
*                                      INTERCEPT ROUTINE MDC104      */ 01104000
*      2 CVTPVBP PTR(31),           /* ADDRESS OF THE VIRTUAL BLOCK     01105000
*                                      PROCESSOR MDC105              */ 01106000
*      2 CVTMFCTL PTR(31),          /* POINTER TO MEASUREMENT   02S0037 01107000
*                                      FACILITY CONTROL BLOCK MDC100 */ 01108000
*      2 CVTMFRTR PTR(31),          /* IF MEASUREMENT FACILITY IS       01109000
*                                      ACTIVE, CONTAINS ADDRESS OF      01110000
*                                      MEASUREMENT FACILITY ROUTER.     01111000
*                                      OTHERWISE, ADDRESS OF CVTBRET.   01112000
*                                      MDC101                        */ 01113000
*       3 CVTMFACT BIT(1),          /* IF ONE, I/O SUPERVISOR AND       01114000
*                                      TIMER SECOND LEVEL INTERRUPT     01115000
*                                      HANDLER HOOKS BRANCH TO  02S0037 01116000
*                                      MEASUREMENT FACILITY ROUTER      01117000
*                                      MDC102                        */ 01118000
*      2 CVTVPSIB PTR(31),          /* BRANCH ENTRY TO PAGE SERVICES    01119000
*                                      MDC108                        */ 01120000
*      2 CVTVSI PTR(31),            /* BRANCH ENTRY TO VAM SERVICES     01121000
*                                      MDC109                        */ 01122000
*      2 CVTVFP PTR(31),            /* BRANCH ENTRY TO FINDPAGE 02S0037 01123000
*                                      MDC110                        */ 01124000
*      2 CVTRV262 BIT(8),           /* RESERVED                      */ 01125000
*       3 CVTRV263 BIT(1),          /* RESERVED                      */ 01126000
*       3 CVTRV264 BIT(1),          /* RESERVED                      */ 01127000
*       3 CVTRV265 BIT(1),          /* RESERVED                      */ 01128000
*       3 CVTRV266 BIT(1),          /* RESERVED                      */ 01129000
*       3 CVTRV267 BIT(1),          /* RESERVED                      */ 01130000
*       3 CVTRV268 BIT(1),          /* RESERVED                      */ 01131000
*       3 CVTRV269 BIT(1),          /* RESERVED                      */ 01132000
*       3 CVTRV270 BIT(1),          /* RESERVED                      */ 01133000
*      2 CVTRV271 BIT(8),           /* RESERVED                      */ 01134000
*       3 CVTRV272 BIT(1),          /* RESERVED                      */ 01135000
*       3 CVTRV273 BIT(1),          /* RESERVED                      */ 01136000
*       3 CVTRV274 BIT(1),          /* RESERVED                      */ 01137000
*       3 CVTRV275 BIT(1),          /* RESERVED                      */ 01138000
*       3 CVTRV276 BIT(1),          /* RESERVED                      */ 01139000
*       3 CVTRV277 BIT(1),          /* RESERVED                      */ 01140000
*       3 CVTRV278 BIT(1),          /* RESERVED                      */ 01141000
*       3 CVTRV279 BIT(1),          /* RESERVED                      */ 01142000
*      2 CVTRV280 BIT(8),           /* RESERVED                      */ 01143000
*       3 CVTRV281 BIT(1),          /* RESERVED                      */ 01144000
*       3 CVTRV282 BIT(1),          /* RESERVED                      */ 01145000
*       3 CVTRV283 BIT(1),          /* RESERVED                      */ 01146000
*       3 CVTRV284 BIT(1),          /* RESERVED                      */ 01147000
*       3 CVTRV285 BIT(1),          /* RESERVED                      */ 01148000
*       3 CVTRV286 BIT(1),          /* RESERVED                      */ 01149000
*       3 CVTRV287 BIT(1),          /* RESERVED                      */ 01150000
*       3 CVTRV288 BIT(1),          /* RESERVED                      */ 01151000
*      2 CVTRV289 BIT(8),           /* RESERVED                      */ 01152000
*       3 CVTRV290 BIT(1),          /* RESERVED                      */ 01153000
*       3 CVTRV291 BIT(1),          /* RESERVED                      */ 01154000
*       3 CVTRV292 BIT(1),          /* RESERVED                      */ 01155000
*       3 CVTRV293 BIT(1),          /* RESERVED                      */ 01156000
*       3 CVTRV294 BIT(1),          /* RESERVED                      */ 01157000
*       3 CVTRV295 BIT(1),          /* RESERVED                      */ 01158000
*       3 CVTRV296 BIT(1),          /* RESERVED                      */ 01159000
*       3 CVTRV297 BIT(1),          /* RESERVED                      */ 01160000
*      2 CVTTRCA PTR(31),           /* ADDRESS OF TRACE TABLE HEADER    01161000
*                                      (MDC327)              @ZA02352*/ 01162000
*      2 CVTRV302 PTR(15),          /* RESERVED                      */ 01163000
*      2 CVTRV303 PTR(15),          /* RESERVED                      */ 01164000
*      2 CVTRV304 FIXED(15),        /* RESERVED                      */ 01165000
*      2 CVTRV305 FIXED(15),        /* RESERVED                      */ 01166000
*      2 CVTRV306 FIXED(15),        /* RESERVED                      */ 01167000
*      2 CVTRV307 FIXED(15),        /* RESERVED                      */ 01168000
*      2 CVTVIOP PTR(31),           /* ENTRY POINT OF PAGE I/O POST     01169000
*                                      MDC111                        */ 01170000
*      2 CVTRMBR PTR(31),           /* ADDRESS OF REGMAIN BRANCH        01171000
*                                      ENTRY MDC123                  */ 01172000
*      2 CVTLFRM PTR(31),           /* LIST FORMAT FREEMAIN BRANCH      01173000
*                                      ENTRY POINT MDC124            */ 01174000
*      2 CVTGMBR PTR(31),           /* LIST FORMAT GETMAIN BRANCH       01175000
*                                      ENTRY POINT MDC125            */ 01176000
*      2 CVT0TC0A PTR(31),          /* ADDRESS OF TASK CLOSE MODULE     01177000
*                                      IFG0TC0A MDC128               */ 01178000
*      2 CVTRLSTG FIXED(31),        /* SIZE OF ACTUAL REAL STORAGE      01179000
*                                      ONLINE AT IPL TIME IN 'K'.       01180000
*                                      VALUE PLACED HERE BY IEAVNIP0.   01181000
*                                      MDC153                        */ 01182000
*      2 CVTSPFRR PTR(31),          /* 'SUPER FRR' ADDRESS (ADDRESS     01183000
*                                      OF FUNCTIONAL RECOVERY ROUTINE   01184000
*                                      ESTABLISHED AT NIP0 TIME TO      01185000
*                                      PROTECT SUPERVISOR CONTROL       01186000
*                                      PROGRAM) MDC154               */ 01187000
*      2 CVTVEMS0 PTR(31),          /* ADDRESS OF MEMORY SWITCH 02S0037 01188000
*                                      ROUTINE MDC155                */ 01189000
*      2 CVTJRECM PTR(31),          /* ADDRESS OF SUBSYSTEM INTERFACE   01190000
*                                      RESOURCE MANAGER MDC157       */ 01191000
*      2 CVTIRECM PTR(31),          /* ADDRESS OF INITIATOR RESOURCE    01192000
*                                      MANAGER MDC158                */ 01193000
*      2 CVTDARCM PTR(31),          /* ADDRESS OF DEVICE ALLOCATION     01194000
*                                      RESOURCE MANAGER MDC159       */ 01195000
*      2 CVT0PT02 PTR(31),          /* ADDRESS OF POST ENTRY POINT      01196000
*                                      IEA0PT02 MDC160               */ 01197000
*      2 CVTSTPRS PTR(31),          /* ENTRY POINT OF STOP AND  02S0037 01198000
*                                      RESTART SUBROUTINE MDC162     */ 01199000
*      2 CVTWTCB PTR(31),           /* ADDRESS OF WAIT STATE TCB        01200000
*                                      MDC164                        */ 01201000
*      2 CVTVACR PTR(31),           /* ACR/VARY CPU CHANNEL RECOVERY    01202000
*                                      ROUTINE ADDRESS. ADDRESS 02S0037 01203000
*                                      FILLED IN BY VARY CPU    02S0037 01204000
*                                      PROCESSOR. MDC178             */ 01205000
*      2 CVTQUIT PTR(31),           /* VARY CPU SHUTDOWN ROUTINE        01206000
*                                      ADDRESS. ADDRESS FILLED IN BY    01207000
*                                      VARY CPU PROCESSOR. MDC179    */ 01208000
*      2 CVTGTFR8 PTR(31),          /* GENERALIZED TRACE FACILITY       01209000
*                                      (GTF) CONTROL REGISTER 8 02S0037 01210000
*                                      INITIALIZATION ROUTINE ADDRESS   01211000
*                                      MDC180                        */ 01212000
*      2 CVTVSTOP PTR(31),          /* ADDRESS OF VARY CPU STOP CPU     01213000
*                                      ROUTINE MDC169                */ 01214000
*      2 CVTVPSA PTR(31),           /* ADDRESS OF COPY OF SYSGEN'ED     01215000
*                                      PSA - PLACED HERE BY NIP 02S0037 01216000
*                                      MDC170                        */ 01217000
*      2 CVTRMPTT PTR(31),          /* ADDRESS OF ISTRAMA1, THE VTAM    01218000
*                                      RESOURCE MANAGER FOR NORMAL      01219000
*                                      AND ABNORMAL TASK TERMINATION    01220000
*                                      (MDC322)              @Z30AP9A*/ 01221000
*      2 CVTRMPMT PTR(31),          /* ADDRESS OF ISTRAMA2, THE VTAM    01222000
*                                      RESOURCE MANAGER FOR NORMAL      01223000
*                                      AND ABNORMAL MEMORY      02S0037 01224000
*                                      TERMINATION (MDC323)  @Z30AP9A*/ 01225000
*      2 CVTEXP1 PTR(31),           /* ADDRESS OF EXIT PROLOGUE WHICH   01226000
*                                      RETURNS TO THE DISPATCHER        01227000
*                                      MDC173                        */ 01228000
*      2 CVTCSDRL PTR(31),          /* REAL ADDRESS OF COMMON SYSTEM    01229000
*                                      DATA AREA (CSD). INITIALIZED     01230000
*                                      BY NIP. MDC174                */ 01231000
*      2 CVTSSRB PTR(31),           /* STATUS STOP SRB ENTRY MDC175  */ 01232000
*      2 CVTRPT PTR(31),            /* ADDRESS OF IGARPT01 MODULE OF    01233000
*                                      RADIX PARTITION TREE SERVICES.   01234000
*                                      INITIALIZED BY NIP. MDC177    */ 01235000
*      2 CVTQV1 PTR(31),            /* ADDRESS OF QUEUE VERIFICATION    01236000
*                                      FOR SINGLE THREADED QUEUES       01237000
*                                      WITH HEADERS ONLY MDC181      */ 01238000
*      2 CVTQV2 PTR(31),            /* ADDRESS OF QUEUE VERIFICATION    01239000
*                                      FOR SINGLE THREADED QUEUES       01240000
*                                      WITH HEADER AND TRAILER MDC182*/ 01241000
*      2 CVTQV3 PTR(31),            /* ADDRESS OF QUEUE VERIFICATION    01242000
*                                      FOR DOUBLE THREADED QUEUES       01243000
*                                      MDC183                        */ 01244000
*      2 CVTGSDA PTR(31),           /* ADDRESS OF GLOBAL SYSTEM 02S0037 01245000
*                                      DUPLEX AREA. ADDRESS FILLED IN   01246000
*                                      BY NIP0. MDC184               */ 01247000
*       3 CVTGSDAB BIT(1),          /* IF HIGH-ORDER BIT IS ONE,        01248000
*                                      THERE IS A VALID VALUE IN        01249000
*                                      FOLLOWING 31 BITS MDC185      */ 01250000
*      2 CVTADV PTR(31),            /* ADDRESS OF ADDRESS       02S0037 01251000
*                                      VERIFICATION ROUTINE MDC186   */ 01252000
*      2 CVTTPIO PTR(31),           /* ADDRESS OF VTAM TPIO (SVC 124)   01253000
*                                      ROUTINE MDC193                */ 01254000
*      2 CVTCRCA PTR(31),           /* WHEN CHANNEL RECONFIGURATION     01255000
*                                      HARDWARE (CRH) IS ACTIVE,        01256000
*                                      ADDRESS OF CRH COMMUNICATION     01257000
*                                      AREA IECVCRCA. OTHERWISE,        01258000
*                                      ZERO. (MDC306)        @Z30CQ9A*/ 01259000
*      2 CVTEVENT PTR(31),          /* BRANCH ENTRY ADDRESS TO EVENTS   01260000
*                                      (FAST MULTIPLE WAIT ROUTINE)     01261000
*                                      (MDC316)              @Z30HP9A*/ 01262000
*      2 CVTSSCR PTR(31),           /* ADDRESS OF STORAGE SYSTEM        01263000
*                                      CONTROLLER RECOVERY MANAGER      01264000
*                                      CLEANUP ROUTINE (SSC RMCR)       01265000
*                                      (MDC319)              @Z30LP9A*/ 01266000
*      2 CVTCBBR PTR(31),           /* BRANCH ENTRY ADDRESS TO  02S0037 01267000
*                                      GETMAIN/FREEMAIN (MDC325)        01268000
*                                                            @Z30EN9A*/ 01269000
*      2 CVTEFF02 PTR(31),          /* ADDRESS OF IKJEFF02, TSO 02S0037 01270000
*                                      MESSAGE ISSUER SERVICE ROUTINE   01271000
*                                      (MDC326)              @ZM30972*/ 01272000
*      2 CVTRV604 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01273000
*      2 CVTRV605 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01274000
*      2 CVTRV606 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01275000
*      2 CVTRAC PTR(31),            /* ADDRESS OF ACCESS CONTROL CVT    01276000
*                                      (MDC320)              @Z40RP9A*/ 01277000
*      2 CVTCGK PTR(31),            /* ADDRESS OF ROUTINE USED TO       01278000
*                                      CHANGE THE KEY OF VIRTUAL        01279000
*                                      PAGES (MDC331)        @Z40EP9A*/ 01280000
*      2 CVTIRM PTR(31),            /* RESERVED (MDC332)     @Z40EP9A*/ 01281000
*      2 CVT0PT0E PTR(31),          /* ENTRY POINT TO IDENTIFY POST     01282000
*                                      EXIT ROUTINES (MDC334)   02S0037 01283000
*                                                            @Z40EP9A*/ 01284000
*      2 CVT0PT03 PTR(31),          /* POST REINVOCATION ENTRY POINT    01285000
*                                      FROM POST EXIT ROUTINES  02S0037 01286000
*                                      (MDC335)              @Z40EP9A*/ 01287000
*      2 CVTTCASP PTR(31),          /* RESERVED FOR FUTURE USE  02S0037 01288000
*                                      (MDC336)              @Z40DQ9A*/ 01289000
*      2 CVTASMRM PTR(31),          /* ADDRESS OF AUXILIARY STORAGE     01290000
*                                      MANAGEMENT RESOURCE MANAGER      01291000
*                                      FOR ADDRESS SPACE TERMINATION    01292000
*                                      (MDC341)              @Z40WP9A*/ 01293000
*      2 CVTJTERM PTR(31),          /* ADDRESS OF AUXILIARY STORAGE     01294000
*                                      MANAGEMENT JOB TERMINATION       01295000
*                                      RESOURCE MANAGER (MDC342)        01296000
*                                                            @Z40WP9A*/ 01297000
*      2 CVTRSUME PTR(31),          /* ADDRESS OF RESUME FUNCTION       01298000
*                                      (MDC344)              @Z40FP9A*/ 01299000
*      2 CVTTCTL PTR(31),           /* ADDRESS OF TRANSFER CONTROL      01300000
*                                      (TCTL) FUNCTION (MDC345) 02S0037 01301000
*                                                            @Z40FP9A*/ 01302000
*      2 CVTCDAL PTR(31),           /* ADDRESS OF COMMON DISPATCHER     01303000
*                                      ACTIVE LIST (MDC346)  @Z40FP9A*/ 01304000
*      2 CVTT6SVC PTR(31),          /* ENTRY POINT ADDRESS FOR TYPE 6   01305000
*                                      SVC EXIT FUNCTION (MDC347)       01306000
*                                                            @Z40FP9A*/ 01307000
*      2 CVTSUSP PTR(31),           /* ADDRESS OF SUSPEND ROUTINE       01308000
*                                      (MDC348)              @Z40FP9A*/ 01309000
*      2 CVTRV620 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01310000
*      2 CVTRV621 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01311000
*      2 CVTRV622 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01312000
*      2 CVTRV623 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01313000
*      2 CVTRV624 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01314000
*      2 CVTRV625 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01315000
*      2 CVTRV626 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01316000
*      2 CVTRV627 PTR(31),          /* RESERVED (MDC307)     @Z30AQ9A*/ 01317000
*      2 CVTRV628 PTR(31);          /* RESERVED (MDC307)     @Z30AQ9A*/ 01318000
*/*                                                                  */ 01319000
*/*            OS - OS/VS COMMON EXTENSION                           */ 01320000
*/*                                                                  */ 01321000
*                                                               02S0038 01322000
*   DECLARE                                                     02S0038 01323000
*     1 CVTXTNT1 BASED(CVTEXT1),    /* START OF OS - OS/VS COMMON       01324000
*                                      EXTENSION ICB421              */ 01325000
*      2 CVTFACHN PTR(31),          /* ADDRESS OF CHAIN OF DCB FIELD    01326000
*                                      AREAS (ISAM) ICB421           */ 01327000
*      2 CVTRSV87 PTR(31),          /* RESERVED                      */ 01328000
*      2 CVTRSV88 PTR(31);          /* RESERVED                      */ 01329000
*/*                                                                  */ 01330000
*/*            OS/VS1 - OS/VS2 COMMON EXTENSION                      */ 01331000
*/*                                                                  */ 01332000
*                                                               02S0039 01333000
*   DECLARE                                                     02S0039 01334000
*     1 CVTXTNT2 BASED(CVTEXT2),    /* START OF OS/VS1 - OS/VS2 02S0039 01335000
*                                      EXTENSION                     */ 01336000
*      2 CVTDSSV PTR(31),           /* ADDRESS OF THE DYNAMIC SUPPORT   01337000
*                                      SYSTEM (DSS) VECTOR TABLE        01338000
*                                      ICB313                        */ 01339000
*       3 CVTRSV89 PTR(8),          /* RESERVED ICB313               */ 01340000
*       3 CVTDSSVA PTR(24),         /* ADDRESS OF THE DSS VECTOR        01341000
*                                      TABLE ICB313                  */ 01342000
*      2 CVTNUCLS CHAR(1),          /* IDENTIFICATION OF THE NUCLEUS    01343000
*                                      MEMBER NAME ICB322            */ 01344000
*      2 CVTFLGBT BIT(8),           /* FLAG BYTE (OS/VS1) (MDC301)      01345000
*                                                            @X04EP9A*/ 01346000
*       3 CVTNPE BIT(1),            /* INDICATES NON-PAGING     02S0039 01347000
*                                      ENVIRONMENT (VM HANDSHAKING)     01348000
*                                      (OS/VS1) (MDC302)     @X04EP9A*/ 01349000
*       3 CVTVME BIT(1),            /* INDICATES MACHINE IS OPERATING   01350000
*                                      IN VM ENVIRONMENT (OS/VS1)       01351000
*                                      (MDC303)              @X04EP9A*/ 01352000
*       3 CVTRSV9C BIT(1),          /* RESERVED                      */ 01353000
*       3 CVTRSV9D BIT(1),          /* RESERVED                      */ 01354000
*       3 CVTRSV9E BIT(1),          /* RESERVED                      */ 01355000
*       3 CVTRSV9F BIT(1),          /* RESERVED                      */ 01356000
*       3 CVTRSV9G BIT(1),          /* RESERVED                      */ 01357000
*       3 CVTRSV9H BIT(1),          /* RESERVED                      */ 01358000
*      2 CVTRSV91 FIXED(15),        /* RESERVED                      */ 01359000
*      2 CVTDEBVR PTR(31),          /* ADDRESS OF BRANCH ENTRY POINT    01360000
*                                      OF DEB VALIDITY CHECK ROUTINE    01361000
*                                      (ICB380)                XM9028*/ 01362000
*      2 CVTRSV92 PTR(31),          /* RESERVED (MDC190)       YM2278*/ 01363000
*      2 CVTRSV93 PTR(31),          /* RESERVED                      */ 01364000
*      2 CVTRSV94 PTR(31),          /* RESERVED                      */ 01365000
*      2 CVTQID PTR(31),            /* SAVE AS CVTQIDA BELOW ICB381  */ 01366000
*       3 CVTRSV95 PTR(8),          /* RESERVED ICB381               */ 01367000
*       3 CVTQIDA PTR(24),          /* ADDRESS OF QUEUE         02S0039 01368000
*                                      IDENTIFICATION (QID) TABLE       01369000
*                                      PREFIX ICB381                 */ 01370000
*      2 CVTOLTEP PTR(31),          /* POINTER TO CONTROL BLOCK 02S0039 01371000
*                                      CREATED BY SVC 59 TO POINT TO    01372000
*                                      PSEUDO-DEB'S ICB423           */ 01373000
*      2 CVTRSV96 FIXED(15),        /* RESERVED                      */ 01374000
*      2 CVTRSV97 FIXED(15),        /* RESERVED                      */ 01375000
*      2 CVTRSV98 PTR(31),          /* RESERVED                      */ 01376000
*      2 CVTSHS PTR(31),            /* RESERVED (MDC329)     @Z40EP9A*/ 01377000
*       3 CVTSHSB BIT(1),           /* RESERVED (MDC330)     @Z40EP9A*/ 01378000
*      2 CVTSKTA PTR(31),           /* ADDRESS OF STORAGE KEY TABLE     01379000
*                                      (VM HANDSHAKING) (OS/VS1)        01380000
*                                      (MDC304)              @X04EP9A*/ 01381000
*      2 CVTICB PTR(31),            /* ADDRESS OF MASS STORAGE SYSTEM   01382000
*                                      (MSS) CONTROL BLOCK (MDC305)     01383000
*                                                            @Z30LP9A*/ 01384000
*      2 CVTRV400 BIT(8),           /* RESERVED                      */ 01385000
*       3 CVTRV401 BIT(1),          /* RESERVED                      */ 01386000
*       3 CVTRV402 BIT(1),          /* RESERVED                      */ 01387000
*       3 CVTRV403 BIT(1),          /* RESERVED                      */ 01388000
*       3 CVTRV404 BIT(1),          /* RESERVED                      */ 01389000
*       3 CVTRV405 BIT(1),          /* RESERVED                      */ 01390000
*       3 CVTRV406 BIT(1),          /* RESERVED                      */ 01391000
*       3 CVTRV407 BIT(1),          /* RESERVED                      */ 01392000
*       3 CVTRV408 BIT(1),          /* RESERVED                      */ 01393000
*      2 CVTRV409 BIT(8),           /* RESERVED                      */ 01394000
*       3 CVTRV410 BIT(1),          /* RESERVED                      */ 01395000
*       3 CVTRV411 BIT(1),          /* RESERVED                      */ 01396000
*       3 CVTRV412 BIT(1),          /* RESERVED                      */ 01397000
*       3 CVTRV413 BIT(1),          /* RESERVED                      */ 01398000
*       3 CVTRV414 BIT(1),          /* RESERVED                      */ 01399000
*       3 CVTRV415 BIT(1),          /* RESERVED                      */ 01400000
*       3 CVTRV416 BIT(1),          /* RESERVED                      */ 01401000
*       3 CVTRV417 BIT(1),          /* RESERVED                      */ 01402000
*      2 CVTRV418 PTR(8),           /* RESERVED                      */ 01403000
*      2 CVTRV419 PTR(8),           /* RESERVED                      */ 01404000
*      2 CVTRV420 PTR(15),          /* RESERVED                      */ 01405000
*      2 CVTRV421 FIXED(15),        /* RESERVED                      */ 01406000
*      2 CVTRV422 FIXED(15),        /* RESERVED                      */ 01407000
*      2 CVTRV423 FIXED(15),        /* RESERVED                      */ 01408000
*      2 CVTATCVT PTR(31),          /* POINTER TO VTAM'S CVT MDC080  */ 01409000
*       3 CVTATACT BIT(1),          /* IF ON, VTAM IS ACTIVE MDC081  */ 01410000
*      2 CVTRV425 PTR(31),          /* RESERVED                      */ 01411000
*      2 CVTRV426 PTR(31),          /* RESERVED                      */ 01412000
*      2 CVTRV427 PTR(31),          /* RESERVED                      */ 01413000
*      2 CVTRV428 FIXED(31),        /* RESERVED                      */ 01414000
*      2 CVTRV429 BIT(8),           /* RESERVED                      */ 01415000
*       3 CVTRV430 BIT(1),          /* RESERVED                      */ 01416000
*       3 CVTRV431 BIT(1),          /* RESERVED                      */ 01417000
*       3 CVTRV432 BIT(1),          /* RESERVED                      */ 01418000
*       3 CVTRV433 BIT(1),          /* RESERVED                      */ 01419000
*       3 CVTRV434 BIT(1),          /* RESERVED                      */ 01420000
*       3 CVTRV435 BIT(1),          /* RESERVED                      */ 01421000
*       3 CVTRV436 BIT(1),          /* RESERVED                      */ 01422000
*       3 CVTRV437 BIT(1),          /* RESERVED                      */ 01423000
*      2 CVTRV438 BIT(8),           /* RESERVED                      */ 01424000
*       3 CVTRV439 BIT(1),          /* RESERVED                      */ 01425000
*       3 CVTRV440 BIT(1),          /* RESERVED                      */ 01426000
*       3 CVTRV441 BIT(1),          /* RESERVED                      */ 01427000
*       3 CVTRV442 BIT(1),          /* RESERVED                      */ 01428000
*       3 CVTRV443 BIT(1),          /* RESERVED                      */ 01429000
*       3 CVTRV444 BIT(1),          /* RESERVED                      */ 01430000
*       3 CVTRV445 BIT(1),          /* RESERVED                      */ 01431000
*       3 CVTRV446 BIT(1),          /* RESERVED                      */ 01432000
*      2 CVTRV447 PTR(8),           /* RESERVED                      */ 01433000
*      2 CVTRV448 PTR(8),           /* RESERVED                      */ 01434000
*      2 CVTRV449 PTR(15),          /* RESERVED                      */ 01435000
*      2 CVTRV450 FIXED(15),        /* RESERVED                      */ 01436000
*      2 CVTRV451 FIXED(15),        /* RESERVED                      */ 01437000
*      2 CVTRV452 FIXED(15),        /* RESERVED                      */ 01438000
*      2 CVTRV453 PTR(31),          /* RESERVED                      */ 01439000
*      2 CVTRV454 PTR(31),          /* RESERVED                      */ 01440000
*      2 CVTRV455 PTR(31),          /* RESERVED                      */ 01441000
*      2 CVTRV456 PTR(31),          /* RESERVED                      */ 01442000
*      2 CVTRV457 BIT(8),           /* RESERVED                      */ 01443000
*       3 CVTRV458 BIT(1),          /* RESERVED                      */ 01444000
*       3 CVTRV459 BIT(1),          /* RESERVED                      */ 01445000
*       3 CVTRV460 BIT(1),          /* RESERVED                      */ 01446000
*       3 CVTRV461 BIT(1),          /* RESERVED                      */ 01447000
*       3 CVTRV462 BIT(1),          /* RESERVED                      */ 01448000
*       3 CVTRV463 BIT(1),          /* RESERVED                      */ 01449000
*       3 CVTRV464 BIT(1),          /* RESERVED                      */ 01450000
*       3 CVTRV465 BIT(1),          /* RESERVED                      */ 01451000
*      2 CVTRV466 BIT(8),           /* RESERVED                      */ 01452000
*       3 CVTRV467 BIT(1),          /* RESERVED                      */ 01453000
*       3 CVTRV468 BIT(1),          /* RESERVED                      */ 01454000
*       3 CVTRV469 BIT(1),          /* RESERVED                      */ 01455000
*       3 CVTRV470 BIT(1),          /* RESERVED                      */ 01456000
*       3 CVTRV471 BIT(1),          /* RESERVED                      */ 01457000
*       3 CVTRV472 BIT(1),          /* RESERVED                      */ 01458000
*       3 CVTRV473 BIT(1),          /* RESERVED                      */ 01459000
*       3 CVTRV474 BIT(1),          /* RESERVED                      */ 01460000
*      2 CVTRV475 PTR(8),           /* RESERVED                      */ 01461000
*      2 CVTRV476 PTR(8),           /* RESERVED                      */ 01462000
*      2 CVTRV477 PTR(8),           /* RESERVED                      */ 01463000
*      2 CVTRV478 PTR(8),           /* RESERVED                      */ 01464000
*      2 CVTRV479 FIXED(15),        /* RESERVED                      */ 01465000
*      2 CVTRV480 PTR(31),          /* RESERVED                      */ 01466000
*      2 CVTRV481 PTR(31),          /* RESERVED                      */ 01467000
*      2 CVTRV482 PTR(31);          /* RESERVED                      */ 01468000
*/*                       CVT PREFIX                                 */ 01469000
*                                                               02S0040 01470000
*   DCL                                                         02S0040 01471000
*     1 CVTFIX BASED(CVTPTR-256) BDY(WORD),                     02S0040 01472000
*      2 * CHAR(248) BDY(WORD),     /* RESERVED                      */ 01473000
*      2 * CHAR(2) BDY(WORD),       /* RESERVED                      */ 01474000
*      2 CVTMDL CHAR(2) BDY(WORD,3),/* CPU MODEL NUMBER IN SIGNLESS     01475000
*                                      PACKED DECIMAL, I.E., A MODEL    01476000
*                                      145 WOULD BE REPRESENTED AS      01477000
*                                      0145 HEX                      */ 01478000
*      2 CVTRELNO CHAR(4) BDY(WORD),/* RELEASE NUMBER (EBCDIC)       */ 01479000
*       3 CVTNUMB CHAR(2) BDY(WORD),/* RELEASE NUMBER                */ 01480000
*       3 CVTLEVL CHAR(2) BDY(WORD,3);/* LEVEL NUMBER OF THIS RELEASE*/ 01481000
*/*                    END OF CVT MACRO                              */ 01482000
*                                                               02S0041 01483000
*                                                               02S0041 01484000
*/* MACMEAN  ILRPART - PAGE ACTIVITY REFERENCE TABLE                 */ 01485000
*/* MACCOMP Y-4SC1CW/PZD81                                           */ 01486000
*/* MACSTAT Y-475101/415304                                          */ 01487000
*/*A-000000-999999                                           @Z40WPWL*/ 01488000
*/********************************************************************/ 01489000
*/*                                                                  */ 01490000
*/*  NAME:  ILRPART                                                  */ 01491000
*/*                                                                  */ 01492000
*/*  FUNCTION:  PAGING ACTIVITY REFERENCE TABLE                      */ 01493000
*/*                                                                  */ 01494000
*/*  STATUS:  OS/VS2 RELEASE 4.1, LEVEL 0                            */ 01495000
*/*                                                                  */ 01496000
*/*  EXTERNAL REFERENCES:  PARTPTR - USER DEFINED POINTER TO PART    */ 01497000
*/*                        PAREPTR - USER DEFINED POINTER TO PART    */ 01498000
*/*                                  ENTRY                           */ 01499000
*/*                                                                  */ 01500000
*/*  REGISTERS USED:  N/A                                            */ 01501000
*/*                                                                  */ 01502000
*/*  REGISTERS CLOBBERED:  N/A                                       */ 01503000
*/*                                                                  */ 01504000
*/*  NOTES:  THE PART IS USED BY I/O SUBSYSTEM TO MANAGE THE PAGE    */ 01505000
*/*          DATA SETS IN USE. THE PART IS BUILT DURING ASM INTIALI- */ 01506000
*/*          ZATION IN SQA, AND IS BASED IN THE ASMVT.  THE ASM RIM  */ 01507000
*/*          BUILDS AN ENTRY (PARTE) FOR EACH PAGE DATA SET THAT IT  */ 01508000
*/*          OPENS PLUS THE NUMBER OF ENTRIES THAT ARE REQUIRED TO   */ 01509000
*/*          SUPPORT PAGE EXPANSION AS SPECIFIED ON THE PAGNUM       */ 01510000
*/*          PARAMETER.                                              */ 01511000
*/*                                                                  */ 01512000
*/*          THE ERROR COUNT AND DATA SET BAD FLAG MUST BE AT THE    */ 01513000
*/*          SAME OFFSETS IN BOTH THE PARTE AND SARTE, TO ALLOW      */ 01514000
*/*          EFFICIENT PROCESSING IN ILRIOC00.                       */ 01515000
*/*                                                                  */ 01516000
*/*          THE PART AND SART CONTAIN MANY SIMILAR FIELDS.  WHERE   */ 01517000
*/*          THE SAME FIELD EXISTS IN BOTH CONTROL BLOCKS, THEY MUST */ 01518000
*/*          REMAIN AT MATCHING OFFSETS.  THESE FIELDS ARE ALWAYS THE*/ 01519000
*/*          FIRST FIELDS IN BOTH THE HEADER AND ENTRY MAPPINGS.     */ 01520000
*/*                                                                  */ 01521000
*/********************************************************************/ 01522000
*/********************************************************************/ 01523000
*/*                                                                  */ 01524000
*/*                    PART NUMBER CONSTANTS                         */ 01525000
*/*                                                                  */ 01526000
*/********************************************************************/ 01527000
*                                                               02S0041 01528000
*   DECLARE                                                     02S0041 01529000
*     PARTPLPN FIXED(8) CONSTANT(0),/* PART NUMBER OF PLPA PARTE     */ 01530000
*     PARTCOMN FIXED(8) CONSTANT(1),/* PART NUMBER OF COMMON PARTE   */ 01531000
*     PARTDUPN FIXED(8) CONSTANT(2),/* PART NUMBER OF DUPLEX PARTE   */ 01532000
*     PARTLOCN FIXED(8) CONSTANT(3),/* PART NUMBER OF FIRST LOCAL       01533000
*                                      PARTE                         */ 01534000
*     PAREFSPC BIT(32) CONSTANT('80000000'X);/* CONSTANT USED TO SET    01535000
*                                      PAREFSIP FLAG                 */ 01536000
*/********************************************************************/ 01537000
*/*                                                                  */ 01538000
*/*                            PART MAPPING                          */ 01539000
*/*                                                                  */ 01540000
*/********************************************************************/ 01541000
*                                                               02S0042 01542000
*   DECLARE                                                     02S0042 01543000
*     1 PART BASED(PARTPTR) BDY(DWORD),/* PAGING ACTIVITY REFERENCE     01544000
*                                      TABLE                         */ 01545000
*       3 PARTHDR CHAR(80) BDY(DWORD),/* PART HEADER WHICH CONTAINS     01546000
*                                      GENERAL INFORMATION ABOUT THE    01547000
*                                      PAGE DATA SETS                */ 01548000
*         5 PARTIDEN CHAR(4),       /* 'PART' IDENTIFIER             */ 01549000
*         5 PARTSIZE FIXED(31),     /* THE TOTAL NUMBER OF PART 02S0042 01550000
*                                      ENTRIES (PARTE'S) CONTAINED IN   01551000
*                                      THIS PART                     */ 01552000
*         5 PARTEUSE FIXED(31),     /* NUMBER OF PARTE'S IN USE      */ 01553000
*         5 PARTAIAE PTR(31),       /* AIA ERROR QUEUE USED BY I/O      01554000
*                                      CONTROL AND THE I/O SUBSYSTEM    01555000
*                                      TO TEMPORARILY SAVE ERROR        01556000
*                                      AIA'S THAT COULD NOT BE  02S0042 01557000
*                                      IMMEDIATELY RETURNED TO RSM   */ 01558000
*/* THE FOLLOWING TWO QUEUES POINT TO CIRCULAR PARTE QUEUES FOR 02S0042 01559000
*   LOCAL PAGE DATA SETS.                                            */ 01560000
*                                                               02S0042 01561000
*         5 PARTCIR1 PTR(31),       /* POINTER TO NEXT PARTE FROM       01562000
*                                      WHICH TO ALLOCATE SLOTS FOR      01563000
*                                      FIXED HEAD FILES              */ 01564000
*         5 PARTCIR2 PTR(31),       /* POINTER TO NEXT PARTE FROM       01565000
*                                      WHICH TO ALLOCATE SLOTS FOR      01566000
*                                      MOVABLE HEAD FILES            */ 01567000
*         5 PARTTPAR PTR(31),       /* ADDRESS OF TPARTBLE FOR USE BY   01568000
*                                      TASK MODE INITIALIZATION      */ 01569000
*           7 PARTDSNL PTR(31),     /* ADDRESS OF DATA SET NAME LIST    01570000
*                                      IN CSA FOR PAGE DATA SETS.       01571000
*                                      THIS ADDRESS REPLACES THE        01572000
*                                      TPARTBLE POINTER WHEN THE DATA   01573000
*                                      SET NAME LIST IS BUILT AT TMI    01574000
*                                      TIME.                         */ 01575000
*         5 PARTPCTQ PTR(31),       /* ADDRESS OF FIRST IN CHAIN OF     01576000
*                                      ONE OR MORE PCT'S THAT HAVE      01577000
*                                      BEEN BUILT FOR THE DEVICE        01578000
*                                      TYPES CONTAINING OPEN PAGE       01579000
*                                      DATA SETS                     */ 01580000
*/* THE FOLLOWING FIELDS ARE UNIQUE FOR THE PART HEADER              */ 01581000
*                                                               02S0042 01582000
*         5 PARTLCNT FIXED(15),     /* COUNT OF ACTIVE LOCAL PAGE       01583000
*                                      DATA SETS                     */ 01584000
*         5 * CHAR(6),              /* RESERVED                      */ 01585000
*         5 PARTLKUP FIXED(31),     /* WORD FOR RECOVERY LOCKING USED   01586000
*                                      AS A COUNTER TO GENERATE LOCK    01587000
*                                      COUNT USED IN PARTE'S         */ 01588000
*         5 PARTLOCK FIXED(31),     /* LOCK WORD USED WITH ASM CLASS    01589000
*                                      LOCK TO SERIALIZE THE FIFO       01590000
*                                      WRITE QUEUES                  */ 01591000
*         5 PARTCOMQ CHAR(8) BDY(DWORD),/* COMMON WRITE QUEUE.  02S0042 01592000
*                                      CONTAINS IOE'S FOR WRITE 02S0042 01593000
*                                      OPERATIONS TO THE PLPA(ON COLD   01594000
*                                      START ONLY) OR COMMON PAGE       01595000
*                                      DATA SETS                     */ 01596000
*           7 PARTCOMF PTR(31),     /* ADDRESS OF FIRST IOE          */ 01597000
*           7 PARTCOML PTR(31),     /* ADDRESS OF LAST IOE           */ 01598000
*         5 PARTSPLQ CHAR(8) BDY(DWORD),/* SPILL WRITE QUEUE.   02S0042 01599000
*                                      CONTAINS IOES FOR WRITE  02S0042 01600000
*                                      OPERATIONS ONLY WHEN COMMON      01601000
*                                      DATA SET IS FULL AND ASM IS      01602000
*                                      SPILLING WRITE REQUESTS TO THE   01603000
*                                      PLPA DATA SET.                */ 01604000
*           7 PARTSPLF PTR(31),     /* ADDRESS OF FIRST IOE          */ 01605000
*           7 PARTSPLL PTR(31),     /* ADDRESS OF LAST IOE           */ 01606000
*         5 PARTDUPQ CHAR(8) BDY(DWORD),/* DUPLEX WRITE QUEUE.  02S0042 01607000
*                                      CONTAINS IOE'S FOR WRITE 02S0042 01608000
*                                      OPERATIONS TO THE DUPLEX PAGE    01609000
*                                      DATA SET WHEN DUPLEXING IS       01610000
*                                      ACTIVE                        */ 01611000
*           7 PARTDUPF PTR(31),     /* ADDRESS OF FIRST IOE          */ 01612000
*           7 PARTDUPL PTR(31),     /* ADDRESS OF LAST IOE           */ 01613000
*         5 PARTLOCQ CHAR(8) BDY(DWORD),/* LOCAL WRITE QUEUE.   02S0042 01614000
*                                      CONTAINS IOE'S FOR WRITE 02S0042 01615000
*                                      OPERATIONS TO THE LOCAL DATA     01616000
*                                      SETS                          */ 01617000
*           7 PARTLOCF PTR(31),     /* ADDRESS OF FIRST IOE          */ 01618000
*           7 PARTLOCL PTR(31),     /* ADDRESS OF LAST IOE           */ 01619000
*       3 PARTENTS(*) CHAR(64) BDY(DWORD);/* THE PART ENTRIES. ONE      01620000
*                                      PARTE REPRESENTS ONE PAGE DATA   01621000
*                                      SET. A PARTE IS BUILT FOR EACH   01622000
*                                      PAGE DATA SET OPENED AT IPL      01623000
*                                      TIME AND FOR EACH POTENTIAL      01624000
*                                      DATA SET THAT CAN BE ADDED       01625000
*                                      LATER UP TO A MAXIMUM OF 64      01626000
*                                      TOTAL ENTRIES.                */ 01627000
*/********************************************************************/ 01628000
*/*                                                                  */ 01629000
*/*  THIS STRUCTURE MAPS A PART ENTRY.                               */ 01630000
*/*                                                                  */ 01631000
*/********************************************************************/ 01632000
*                                                               02S0043 01633000
*   DECLARE                                                     02S0043 01634000
*     1 PARTENT BASED(PAREPTR) BDY(DWORD) CHAR(64),/* PART ENTRY     */ 01635000
*       3 PAREPARE PTR(31),         /* POINTER TO NEXT PARTE IN USE  */ 01636000
*       3 PARELKUP FIXED(31),       /* WORD FOR LOCKING THIS PARTE   */ 01637000
*         5 PARELKFL BIT(8),        /* LOCK FLAG BYTE                */ 01638000
*           7 PAREFSIP BIT(1),      /* SLOT SORT IN PROGRESS FLAG       01639000
*                                      1=SLOT SORT CURRENTLY    02S0043 01640000
*                                      PROCESSING THIS PARTE 0=SLOT     01641000
*                                      SORT NOT IN PROGRESS FOR THIS    01642000
*                                      PARTE                         */ 01643000
*           7 * BIT(7),             /* RESERVED                      */ 01644000
*         5 PAREIORN FIXED(8),      /* NUMBER OF IORB'S BUILT FOR       01645000
*                                      THIS PARTE                    */ 01646000
*         5 PARECPCT FIXED(16),     /* LOCK COUNT USED FOR RECOVERY  */ 01647000
*       3 PARETYPE CHAR(1),         /* PAGE DATA SET TYPE FLAGS      */ 01648000
*         5 PAREPLPA BIT(1),        /* PARTE FOR PLPA DATA SET       */ 01649000
*         5 PARECOMM BIT(1),        /* PARTE FOR COMMON DATA SET     */ 01650000
*         5 PAREDPLX BIT(1),        /* PARTE FOR DUPLEX DATA SET     */ 01651000
*         5 PARELOCL BIT(1),        /* PARTE FOR LOCAL DATA SET      */ 01652000
*         5 * BIT(4),               /* UNUSED                        */ 01653000
*       3 PAREFLG1 CHAR(1),         /* PARTE FLAGS                   */ 01654000
*         5 PARENUSE BIT(1),        /* PARTE NOT IN USE FLAG 1=PARTE    01655000
*                                      NOT IN USE 0=PARTE IN USE     */ 01656000
*         5 PAREDSBD BIT(1),        /* DATA SET BAD FLAG 1=ASM HAS      01657000
*                                      DETECTED ERRORS INDICATING       01658000
*                                      THIS PAGE DATA SET IS NOT        01659000
*                                      USEFUL FOR PAGING. IT IS 02S0043 01660000
*                                      EFFECTIVELY NOT IN USE. 0=PAGE   01661000
*                                      DATA SET SATISFACTORY FOR USE.*/ 01662000
*         5 PAREINCP BIT(1),        /* INTERCEPTED FLAG. MEANINGFUL     01663000
*                                      ONLY IF DUPLEXING ACTIVE 02S0043 01664000
*                                      1=PLPA OR COMMON DATA SET        01665000
*                                      TEMPORARILY NOT AVAILABLE,       01666000
*                                      READ REQUESTS SHOULD BE  02S0043 01667000
*                                      DIRECTED TO DUPLEX DATA SET      01668000
*                                      0=NORMAL PROCESSING IN EFFECT */ 01669000
*         5 * BIT(5),               /* UNUSED                        */ 01670000
*       3 PARENN FIXED(15),         /* PART NUMBER FOR THIS PARTE    */ 01671000
*       3 PAREIOEQ PTR(31),         /* ADDRESS OF FIRST IOE ON  02S0043 01672000
*                                      UNSORTED READ QUEUE           */ 01673000
*       3 PARESZSL FIXED(31),       /* SIZE OF PAGE DATA SET IN 02S0043 01674000
*                                      NUMBER OF SLOTS               */ 01675000
*       3 PARESLTA FIXED(31),       /* NUMBER OF SLOTS AVAILABLE FOR    01676000
*                                      ALLOCATION                    */ 01677000
*       3 PARERRCT FIXED(31),       /* COUNT OF THE NUMBER OF   02S0043 01678000
*                                      PERMANENT I/O ERRORS SUFFERED    01679000
*                                      ON THIS PAGE DATA SET.        */ 01680000
*       3 PAREIORB PTR(31),         /* POINTER TO FIRST IORB FOR THIS   01681000
*                                      PAGE DATA SET                 */ 01682000
*       3 PAREPATP PTR(31),         /* POINTER TO PAT FOR THIS PAGE     01683000
*                                      DATA SET                      */ 01684000
*       3 PAREPCTP PTR(31),         /* POINTER TO PCT FOR THIS PAGE     01685000
*                                      DATA SET TYPE                 */ 01686000
*       3 PAREEDBP PTR(31),         /* POINTER TO EDP FOR PAGE DATA     01687000
*                                      SET                           */ 01688000
*       3 PAREUCBP PTR(31),         /* POINTER TO UCB FOR PAGE DATA     01689000
*                                      SET                           */ 01690000
*/* THE FOLLOWING ARE UNIQUE FOR THE PARTE                           */ 01691000
*                                                               02S0043 01692000
*       3 PARENODE PTR(31),         /* SORTED READ QUEUE OF IOE'S       01693000
*                                      THIS FIELD IS ANCHOR FOR 02S0043 01694000
*                                      SORTED TREE OF IOE'S USED BY     01695000
*                                      SLOT SORT                     */ 01696000
*       3 PAREWTQE PTR(31),         /* POINTER TO WRITE Q FOR THIS      01697000
*                                      PARTE                         */ 01698000
*       3 PARERQTM FIXED(31),       /* CORRECTION VALUE, USED IN        01699000
*                                      COMPUTING SERVICE BURST FOR      01700000
*                                      THIS PAGE DATA SET            */ 01701000
*       3 PARELCYL FIXED(15),       /* LAST RELATIVE CYLINDER ON THIS   01702000
*                                      PAGE DATA SET PROCESSED BY       01703000
*                                      SLOT SORT                     */ 01704000
*       3 * CHAR(2);                /* RESERVED                      */ 01705000
*                                                               02S0044 01706000
*/*  MACMEAN SART MEANS SWAP ACTIVITY REFERENCE TABLE                */ 01707000
*/*  MACCOMP Y-4SC1CW/PZD81                                          */ 01708000
*/*  MACSTAT Y-475073/415304                                         */ 01709000
*/*A-000000-999999                                           @Z40WPWA*/ 01710000
*/********************************************************************/ 01711000
*/*                                                                  */ 01712000
*/*  NAME:  ILRSART                                                  */ 01713000
*/*                                                                  */ 01714000
*/*  FUNCTION:  SWAP ACTIVITY REFERENCE TABLE                        */ 01715000
*/*                                                                  */ 01716000
*/*  STATUS:  OS/VS2 RELEASE 4.1, LEVEL 0                            */ 01717000
*/*                                                                  */ 01718000
*/*  EXTERNAL REFERENCES: SARTPTR - USER DEFINED POINTER TO SART     */ 01719000
*/*                                                                  */ 01720000
*/*  REGISTERS USED:  N/A                                            */ 01721000
*/*                                                                  */ 01722000
*/*  REGISTERS CLOBBERED:  N/A                                       */ 01723000
*/*                                                                  */ 01724000
*/*  NOTES:  THIS MAPPING MACRO DESCRIBES THE CONTROL BLOCK USED BY  */ 01725000
*/*          THE SWAP ROUTINES OF ASM I/O CONTROL TO MANAGE THE SWAP */ 01726000
*/*          DATA SETS. THE SART CONSISTS OF A HEADER SECTION AND    */ 01727000
*/*          AND A SART ENTRY(SARTE) FOR EACH SWAP DATA SET. IT IS   */ 01728000
*/*          BUILT IN SQA AND BASED IN THE ASMVT BY THE ASM RIM. A   */ 01729000
*/*          SARTE IS INITIALIZED FOR EACH SWAP DATA SET OPENED BY   */ 01730000
*/*          THE RIM. ADDITIONAL SARTES ARE BUILT BUT NOT            */ 01731000
*/*          INITIALIZED, TO SUPPORT THE USER SPECIFIED EXPANSION    */ 01732000
*/*          EXPECTATIONS.                                           */ 01733000
*/*                                                                  */ 01734000
*/*          THE ERROR COUNT AND DATA SET BAD FLAGS MUST BE AT THE   */ 01735000
*/*          SAME OFFSETS IN BOTH THE SARTE AND PARTE TO ALLOW       */ 01736000
*/*          EFFICIENT PROCESSING IN ILRIOC00.                       */ 01737000
*/*                                                                  */ 01738000
*/*          THE SART AND PART CONTAIN MANY SIMILAR FIELDS.   WHERE  */ 01739000
*/*          THE SAME FIELD EXISTS IN BOTH CONTROL BLOCKS, THEY MUST */ 01740000
*/*          REMAIN AT MATCHING OFFSETS.  THESE FIELDS ARE ALWAYS    */ 01741000
*/*          THE FIRST FIELDS IN BOTH THE HEADER AND ENTRY MAPPINGS. */ 01742000
*/*          THE SARTE CURRENTLY DOES NOT CONTAIN ANY UNIQUE FIELDS. */ 01743000
*/*                                                                  */ 01744000
*/*  METHOD OF ACCESS:                                               */ 01745000
*/*          PL/S - DCL SARTPTR PTR                                  */ 01746000
*/*          %INCLUDE SYSLIB(ILRSART)                                */ 01747000
*/*                                                                  */ 01748000
*/********************************************************************/ 01749000
*                                                               02S0044 01750000
*   DECLARE                                                     02S0044 01751000
*     1 SART BASED(SARTPTR) BDY(DWORD),/* SWAP ACTIVITY REFERENCE       01752000
*                                      TABLE                         */ 01753000
*      2 SARTHDR CHAR(80) BDY(DWORD),/* SART HEADER                  */ 01754000
*        4 SARID CHAR(4),           /* SART IDENTIFIER. SET TO 'SART'*/ 01755000
*        4 SARSIZE FIXED(31),       /* NO. OF SARTES IN THIS SART    */ 01756000
*        4 SARUSE FIXED(31),        /* NUMBER OF SARTES IN USE       */ 01757000
*        4 * CHAR(4),               /* RESERVED, USED IN PART HEADER    01758000
*                                      MAPPING                       */ 01759000
*        4 SARFXDNX PTR(31),        /* ADDRESS OF NEXT SARTE FROM       01760000
*                                      WHICH TO ALLOCATE SWAP SETS ON   01761000
*                                      A FIXED HEAD FILE             */ 01762000
*        4 SARMOVNX PTR(31),        /* ADDRESS OF NEXT SARTE FORM       01763000
*                                      WHICH TO ALLOCATE SWAP SETS ON   01764000
*                                      A MOVABLE HEAD FILE           */ 01765000
*        4 SARDSNL PTR(31),         /* ADDRESS OF DATA SET NAME LIST    01766000
*                                      IN CSA FOR THE SWAP DATA SETS */ 01767000
*        4 SARSDCT PTR(31),         /* ADDRESS OF SWAP DEVICE TABLE  */ 01768000
*/* THE FOLLOWING NAMES ARE UNIQUE FOR THE SART HEADER               */ 01769000
*                                                               02S0044 01770000
*        4 SARSCCWQ PTR(31),        /* QUEUE OF AVAILABLE SCCWS      */ 01771000
*        4 SARSETCT FIXED(31),      /* NUMBER OF SWAP SETS CURRENTLY    01772000
*                                      AVAILABLE ON ALL SWAP DATA       01773000
*                                      SETS                          */ 01774000
*        4 SARWAITQ CHAR(8) BDY(DWORD),/* WAIT QUEUE OF AIAS WAITING    01775000
*                                      FOR AVAILABLE SWAP RESOURCES  */ 01776000
*          6 SARWAITF PTR(31),      /* ADDRESS OF FIRST AIA ON QUEUE */ 01777000
*          6 SARWAITL PTR(31),      /* ADDRESS OF LAST AIA ON QUEUE  */ 01778000
*        4 SARSRBP PTR(31),         /* ADDRESS OF SRB USED TO   02S0044 01779000
*                                      SCHEDULE SWAP DRIVER          */ 01780000
*        4 SARSRBCT FIXED(31),      /* COUNT OF SRBS SCHEDULED FOR      01781000
*                                      SWAP DRIVER WHICH HAVE NOT       01782000
*                                      BEEN DISPATCHED-EITHER ZERO OR   01783000
*                                      ONE.                          */ 01784000
*        4 SARSETSZ FIXED(31),      /* NO. OF PAGES/SLOTS IN SWAP SET*/ 01785000
*        4 * CHAR(20),              /* RESERVED                      */ 01786000
*      2 SARENTS(*) CHAR(48) BDY(DWORD);/* SART ENTRIES              */ 01787000
*/********************************************************************/ 01788000
*/*                                                                  */ 01789000
*/*  THIS STRUCTURE MAPS A SART ENTRY. A SARTE EXISTS FOR EACH OPEN  */ 01790000
*/*  OR POTENTIAL SWAP DATA SET. THE MAXIMUN NUMBER OF SARTES IS 25. */ 01791000
*/*                                                                  */ 01792000
*/********************************************************************/ 01793000
*                                                               02S0045 01794000
*   DECLARE                                                     02S0045 01795000
*     1 SARTE BASED(SAREPTR) BDY(DWORD),/* SART ENTRY                */ 01796000
*      2 SRENEXT PTR(31),           /* NEXT SARTE IN CIRCULAR CHAIN  */ 01797000
*      2 SRELOCK FIXED(31),         /* C&S LOCK TO SERIALIZE SWAP       01798000
*                                      DRIVER PROCESSING             */ 01799000
*      2 * CHAR(1),                 /* RESERVED                      */ 01800000
*      2 SREFLG CHAR(1),            /* SARTE FLAGS                   */ 01801000
*        4 SRENUSE BIT(1),          /* 1 = SARTE CURRENTLY NOT IN USE   01802000
*                                      0 = THIS SARTE IN USE         */ 01803000
*        4 SREDSBD BIT(1),          /* 1 = ASM HAS DETECTED ERRORS      01804000
*                                      PRECLUDING USE OF THIS DATA      01805000
*                                      SET 0 = SWAP DATA SET    02S0045 01806000
*                                      SATISFACTORY FOR USE          */ 01807000
*        4 SREDRIVE BIT(1),         /* SWAP DRIVER REDRIVE FLAG      */ 01808000
*        4 SREFIXED BIT(1),         /* FIXED HEAD FILE FLAG 1 = SARTE   01809000
*                                      FOR FIXED HEAD DEVICE 0 =        01810000
*                                      SARTE FOR MOVABLE HEAD DEVICE */ 01811000
*        4 * BIT(4),                /* RESERVED                      */ 01812000
*      2 SRENN FIXED(15),           /* SARTE NUMBER FOR THIS SARTE   */ 01813000
*      2 SRESCCW PTR(31),           /* FIRST IN A CHAIN OF ONE OR       01814000
*                                      MORE SCCWS WAITING TO BE 02S0045 01815000
*                                      STARTED                       */ 01816000
*      2 SRETOTSL FIXED(31),        /* TOTAL NUMBER OF SWAP SETS ON     01817000
*                                      THIS DATA SET                 */ 01818000
*      2 SREAVLSL FIXED(31),        /* COUNT OF AVAILABLE SWAP SETS     01819000
*                                      ON THIS DATA SET              */ 01820000
*      2 SRERRCNT FIXED(31),        /* COUNT OF ERROR SWAP SETS ON      01821000
*                                      THIS DATA SET                 */ 01822000
*      2 SREIORB PTR(31),           /* FIRST IORB FOR THIS DATA SET  */ 01823000
*      2 SRESAT PTR(31),            /* PTR TO SAT FOR THIS DATA SET  */ 01824000
*      2 SRESDCTE PTR(31),          /* PTR TO SDCTE FOR THIS DATA SET*/ 01825000
*      2 SREEDB PTR(31),            /* PTR TO EDB FOR THIS DATA SET  */ 01826000
*      2 SREUCB PTR(31);            /* PTR TO UCB FOR THIS DATA SET  */ 01827000
*                                                               02S0046 01828000
*/********************************************************************/ 01829000
*/*                                                                  */ 01830000
*/*   MACRO NAME = IDAEDB                                            */ 01831000
*/*                                                                  */ 01832000
*/*   DESCRIPTIVE NAME =EXTENT DEFINITION BLOCK                      */ 01833000
*/*                                                                  */ 01834000
*/*   FUNCTION = DESCRIBES LOGICAL EXTENTS OF A VSAM DATA SET        */ 01835000
*/*                                                                  */ 01836000
*/*   CONTROL BLOCK STRUCTURE = THE IDAEDB IS POINTED TO BY THE      */ 01837000
*/*              IDAAMB                                              */ 01838000
*/*                                                                  */ 01839000
*/*   INCLUDED MACROS = NONE                                         */ 01840000
*/*                                                                  */ 01841000
*/*   METHOD OF ACCESS = PL/S - NO DECLARES NECESSARY                */ 01842000
*/*                                                                  */ 01843000
*/*   CREATED BY = VSAM OPEN                                         */ 01844000
*/*                                                                  */ 01845000
*/*   STATUS = VS/1 RELEASE 4  (CHANGE FLAG @X04SVXX)                */ 01846000
*/*            VS/2 RELEASE 3  (CHANGE FLAG @Y30SDXX)                */ 01847000
*/*                                                                  */ 01848000
*/*   DATE OF LAST CHANGE = 30 AUG 74                                */ 01849000
*/*                                                                  */ 01850000
*/********************************************************************/ 01851000
*/********************************************************************/ 01852000
*/* EXTENT DEFINITION BLOCK HEADER                                   */ 01853000
*/********************************************************************/ 01854000
*                                                               02S0046 01855000
*   DCL                                                         02S0046 01856000
*     1 IDAEDBHD BASED,                                         02S0046 01857000
*      2 EDBID PTR(8),              /* EDB IDENTIFIER                */ 01858000
*      2 EDBNO PTR(8),              /* NUMBER OF ENTRIES             */ 01859000
*      2 EDBLEN FIXED(15),          /* LENGTH OF ENTRY               */ 01860000
*      2 EDBLPMBC PTR(31);          /* PTR TO FIRST LPMB             */ 01861000
*/********************************************************************/ 01862000
*/* EXTENT DEFINITION BLOCK                                          */ 01863000
*/********************************************************************/ 01864000
*                                                               02S0047 01865000
*   DCL                                                         02S0047 01866000
*     1 IDAEDB BASED,               /* ENTRY DEFINITION              */ 01867000
*      2 * CHAR(2),                 /* NOT USED              @Y30DSJH*/ 01868000
*      2 EDBFLG1 BIT(8),            /* EDB FLAGS FOR MVM     @Y30DSJH*/ 01869000
*       3 EDBLKR BIT(1),            /* CATLG LOW KEY RNG     @Y30DSJH*/ 01870000
*       3 EDBTOFLW BIT(1),          /* TRACK OVERFLOW        @Y30DSJH*/ 01871000
*       3 EDBPSDS BIT(1),           /* PAGE SPACE D.S.       @Y30DSJH*/ 01872000
*       3 * BIT(5),                 /* UNUSED                @Y30DSJH*/ 01873000
*      2 EDBM PTR(8),               /* ENTENT NUMBER                 */ 01874000
*      2 EDBLPMBA PTR(31),          /* ADDRESS OF LPMB               */ 01875000
*      2 EDBSTTRK PTR(31),          /* EXTENT RELATIVE TRK ADDR      */ 01876000
*      2 EDBLORBA PTR(32),          /* LO RBA LIMIT                  */ 01877000
*      2 EDBHIRBA PTR(32),          /* HI RBA LIMIT                  */ 01878000
*      2 EDBTKBAL FIXED(31);        /* MVM TRACK BAL CTR     @Y30DSJH*/ 01879000
*                                                               02S0048 01880000
*/********************************************************************/ 01881000
*/*                                                                  */ 01882000
*/*   MACRO NAME = IDALPMB                                           */ 01883000
*/*                                                                  */ 01884000
*/*   DESCRIPTIVE NAME = LOGICAL TO PHYSICAL MAPPING BLOCK           */ 01885000
*/*                                                                  */ 01886000
*/*   FUNCTION = USED TO MAP THE PHYSICAL ATTRIBUTES OF A VSAM DATA  */ 01887000
*/*                SET                                               */ 01888000
*/*                                                                  */ 01889000
*/*   CONTROL BLOCK STRUCTURE = POINTED TO BY THE IDAEDB             */ 01890000
*/*                                                                  */ 01891000
*/*   INCLUDED MACROS = NONE                                         */ 01892000
*/*                                                                  */ 01893000
*/*   METHOD OF ACCESS = PL/S - NO DECLARES NECESSARY                */ 01894000
*/*                                                                  */ 01895000
*/*   CREATED BY = VSAM OPEN                                         */ 01896000
*/*                                                                  */ 01897000
*/*   STATUS = VS/1 RELEASE 4  (CHANGE FLAG @X04SVXX)                */ 01898000
*/*                                                                  */ 01899000
*/*   DATE OF LAST CHANGE = 13 AUG 74                                */ 01900000
*/*                                                                  */ 01901000
*/********************************************************************/ 01902000
*                                                               02S0048 01903000
*   DCL                                                         02S0048 01904000
*     1 IDALPMB BASED,              /* LOGICAL TO PHYSICAL MAPPING      01905000
*                                      BLOCK                         */ 01906000
*      2 LPMBID CHAR(1),            /* LPMB IDENTIFER                */ 01907000
*      2 LPMBFLGS BIT(8),           /* FLAG BYTE ONE                 */ 01908000
*       3 LPMBRPS BIT(1),           /* ON FOR RPS DEVICE             */ 01909000
*       3 LPMREPL BIT(1),           /* REPLICATED RECORDS            */ 01910000
*       3 LPMSS BIT(1),             /* SEQUENCE SET W/DATA           */ 01911000
*       3 LPMBTOFL BIT(1),          /* MVM TRK OFLOW         @Y30DSJH*/ 01912000
*       3 LPMBSSTH BIT(1),          /* ON--SET SECTOR TABLE IS HERE     01913000
*                                                            @X04SVMR*/ 01914000
*       3 * BIT(3),                 /* UNUSED                @Y30DSJH*/ 01915000
*      2 LPMBLEN FIXED(15),         /* LENGTH OF LPMB                */ 01916000
*      2 LPMAUSZ FIXED(31),         /* BYTES PER ALLOC UNIT          */ 01917000
*      2 LPMBPTRK FIXED(31),        /* BYTES PER TRACK               */ 01918000
*      2 LPMBLKSZ FIXED(31),        /* PHYSICAL BLOCKSIZE            */ 01919000
*      2 LPMTRKAU FIXED(15),        /* TRACKS PER ALLOC UNIT         */ 01920000
*      2 LPMTPC FIXED(15),          /* TRACKS PER CYLINDER           */ 01921000
*      2 LPMBLKTR FIXED(15),        /* BLOCKS PER TRACK              */ 01922000
*      2 * FIXED(15),               /* NOT USED              @X04SVLC*/ 01923000
*      2 LPMBEXT PTR(31),           /* RESERVED FOR PTR TO LPMB 02S0048 01924000
*                                      EXTENSION WHEN DEFINED   02S0048 01925000
*                                                            @X04SVLC*/ 01926000
*      2 LPMBSST CHAR(*);           /* SET SECTOR TAB        @X04SVLC*/ 01927000
*                                                               02S0049 01928000
*/*  MACMEAN ASMVT MEANS ASM VECTOR TABLE                            */ 01929000
*/*  MACCOMP Y-4SC1CW/PZD81                                          */ 01930000
*/*  MACSTAT Y-475073/415304                                         */ 01931000
*/* A-000000-999999                                          @Z40WPWJ*/ 01932000
*/* ******************************************************************/ 01933000
*/*                                                                  */ 01934000
*/*   NAME:  ILRASMVT                                                */ 01935000
*/*                                                                  */ 01936000
*/*   FUNCTION:  AUXILIARY STORAGE MANAGEMENT VECTOR TABLE           */ 01937000
*/*                                                                  */ 01938000
*/*   STATUS:  OS/VS2 RELEASE 4.1                                    */ 01939000
*/*                                                                  */ 01940000
*/*   EXTERNAL REFERENCES:  ASMVTPTR - USER DEFINED POINTER TO ASMVT */ 01941000
*/*                                                                  */ 01942000
*/*   REGISTERS USED:  N/A                                           */ 01943000
*/*                                                                  */ 01944000
*/*   REGISTERS CLOBBERED:  N/A                                      */ 01945000
*/*                                                                  */ 01946000
*/*   NOTES:  THE ASMVT PROVIDES A MEANS OF COMMUNICATION WITHIN ASM.*/ 01947000
*/*           THE ASMVT CONTAINS ALL GLOBAL COUNTS, POINTERS, ENTRY  */ 01948000
*/*           POINT ADDRESSES, AND WORK/SAVE AREAS USED BY RSM       */ 01949000
*/*           ROUTINES.  THE ASMVT IS POINTED TO BY THE CVT FIELD    */ 01950000
*/*           CVTASMVT.                                              */ 01951000
*/*                                                                  */ 01952000
*/*           THE ASMVT IS DIVIDED INTO SECTIONS RELATING TO THE     */ 01953000
*/*           DIFFERENT FUNCTIONAL AREAS OF ASM.  THE ENTRY POINT    */ 01954000
*/*           ADDRESSES, WORK/SAVE AREAS, AND CELLPOOL CONTROLLERS   */ 01955000
*/*           FOLLOW THE FUNCTIONAL SECTIONS.                        */ 01956000
*/*                                                                  */ 01957000
*/*   METHOD OF ACCESS:                                              */ 01958000
*/*           BAL - DSECT=NO SHOULD BE SPECIFIED ON THE MACRO CALL   */ 01959000
*/*                 TO AVOID CREATING A DSECT.  A USING ON ASMVT     */ 01960000
*/*                 WILL ESTABLISH ADDRESSABILITY FOR ALL SYMBOLS.   */ 01961000
*/*           PLS - DCL ASMVTPTR PTR(31)                             */ 01962000
*/*                 %INCLUDE SYSLIB(ILRASMVT)                        */ 01963000
*/*                                                                  */ 01964000
*/* ******************************************************************/ 01965000
*                                                               02S0049 01966000
*   DECLARE                                                     02S0049 01967000
*     1 ASMVT BASED(ASMVTPTR) BDY(DWORD),/* ASM VECTOR TABLE         */ 01968000
*       3 ASMFLAG1 BIT(8),          /* ASM GLOBAL FLAG FIELD 1       */ 01969000
*         5 ASMDUPLX BIT(1),        /* DUPLEXING OPTION FLAG, 1 =       01970000
*                                      DUPLEXING OF COMMON REQUESTED    01971000
*                                      DUPLEX PAGE DATA SET OPENED BY   01972000
*                                      RIM 0 = DUPLEXING NOT    02S0049 01973000
*                                      REQUESTED, NO DUPLEX DATA SET    01974000
*                                      OPENED BY RIM, OR DUPLEXING      01975000
*                                      SUSPENDED IF DUPLEXING   02S0049 01976000
*                                      SUSPENDED FLAG IS ON          */ 01977000
*         5 ASMNOCWQ BIT(1),        /* NO COMMON WRITE QUEUE FLAG, 1    01978000
*                                      = DO NOT QUEUE WRITE IOE'S TO    01979000
*                                      COMMON WRITE QUEUE, 0 = DO       01980000
*                                      NORMAL IOE QUEUING            */ 01981000
*         5 ASMNOLCL BIT(1),        /* NO LOCAL DATA PAGING FLAG, 1 =   01982000
*                                      ALL WRITE IOE'S MUST BE QUEUED   01983000
*                                      TO COMMON WRITE QUEUE, 0 =       01984000
*                                      QUEUE IOE'S NORMALLY          */ 01985000
*         5 ASMRSV1 BIT(1),         /* RESERVED                      */ 01986000
*         5 ASMNODPX BIT(1),        /* DUPLEXING SUSPENDED FLAG, 1 =    01987000
*                                      DUPLEXING HAS BEEN SUSPENDED     01988000
*                                      BECAUSE THE DUPLEX PAGE DATA     01989000
*                                      SET IS FULL OR INOPERATIVE, 0    01990000
*                                      = DUPLEXING STILL ACTIVE IF      01991000
*                                      REQUESTED                     */ 01992000
*         5 ASMPLPAF BIT(1),        /* PLPA DATA SET FULL FLAG, 1 =     01993000
*                                      PLPA DATA SET FULL, 0 = PLPA     01994000
*                                      DATA SET NOT FULL             */ 01995000
*         5 ASMCOMMF BIT(1),        /* COMMON DATA SET FULL FLAG, 1 =   01996000
*                                      COMMON DATA SET FULL, 0 =        01997000
*                                      COMMON DATA SET NOT FULL      */ 01998000
*         5 ASMPLPAS BIT(1),        /* PLPA DATA SET SPILL FLAG, 1 =    01999000
*                                      PLPA DATA SET SPILLED TO 02S0049 02000000
*                                      COMMON DATA SET DURING PLPA      02001000
*                                      BUILD AT NIP TIME, 0 = PLPA      02002000
*                                      DATA SET NOT FULL AFTER PLPA     02003000
*                                      BUILD                         */ 02004000
*       3 ASMFLAG2 BIT(8),          /* ASM GLOBAL FLAG FIELD 2       */ 02005000
*         5 ASMCALLQ BIT(1),        /* QIOE CALLER FLAG, 1 = PAGE       02006000
*                                      COMPLETION IS THE CALLER OF      02007000
*                                      QIOE, 0 = QIOE CALLED BY SOME    02008000
*                                      OTHER ASM ROUTINE             */ 02009000
*         5 ASMNOSAV BIT(1),        /* NO SAVE FLAG, 1 =        02S0049 02010000
*                                      SYS1.STGINDEX UNAVAILABLE OR     02011000
*                                      FULL, SAVE REQUESTS NOT DONE,    02012000
*                                      0 = SYS1.STGINDEX AVAILABLE      02013000
*                                      FOR USE                       */ 02014000
*         5 ASMNOTMR BIT(1),        /* NO TASK MODE RELEASE FLAG, 1 =   02015000
*                                      TASK MODE RELEASE (ILRTMRLG)     02016000
*                                      HAS SUFFERED INDETERMINATE       02017000
*                                      ERRORS, DO NOT POST ITS ECB, 0   02018000
*                                      = ILRTMRLG RUNNING NORMALLY   */ 02019000
*         5 ASMNOTPT BIT(1),        /* NO TPARTABLE FLAG, 1 = A READ    02020000
*                                      OR WRITE OF TPARTABLE HAS        02021000
*                                      FAILED, IT IS NOT UP TO DATE,    02022000
*                                      0 = TPARTABLE AVAILABLE AND      02023000
*                                      CORRECT                       */ 02024000
*         5 ASMQUICK BIT(1),        /* QUICK START IPL FLAG, 1 = ASM    02025000
*                                      INITIALIZATION PROCESSED PLPA    02026000
*                                      IN QUICK START MODE (NOT 02S0049 02027000
*                                      CLPA), 0 = ASM INITIALIZATION    02028000
*                                      PROCESSED PLPA IN COLD START     02029000
*                                      MODE (CLPA), OR WAS FORCED TO    02030000
*                                      CONVERT TO COLD START MODE    */ 02031000
*         5 ASMWARM BIT(1),         /* WARM START IPL FLAG, 1 = ASM     02032000
*                                      INITIALIZATION PROCESSED VIO     02033000
*                                      DATA SETS IN WARM START MODE     02034000
*                                      (NOT CVIO), 0 = ASM      02S0049 02035000
*                                      INITIALIZATION PROCESSED VIO     02036000
*                                      DATA SETS IN CVIO MODE, OR WAS   02037000
*                                      FORCED TO CONVERT A WARM START   02038000
*                                      REQUEST TO CVIO               */ 02039000
*       3 ASMRSV4 CHAR(2),          /* RESERVED                      */ 02040000
*       3 ASMSART PTR(31),          /* ADDRESS OF SWAP ACTIVITY 02S0049 02041000
*                                      REFERENCE TABLE - SART        */ 02042000
*       3 ASMPART PTR(31),          /* ADDRESS OF PAGING ACTIVITY       02043000
*                                      REFERENCE TABLE - PART        */ 02044000
*       3 ASMGOS PTR(31),           /* ADDRESS OF ILRGOS, USED BY       02045000
*                                      ILRCALL MACRO                 */ 02046000
*       3 ASMTRPAG PTR(31),         /* ADDRESS OF ILRTRPAG, ENTRY       02047000
*                                      POINT IN ILRPOS, USED BY 02S0049 02048000
*                                      ILRCALL MACRO                 */ 02049000
*       3 ASMEREC PTR(31),          /* ADDRESS OF BAD SLOT ERROR        02050000
*                                      RECORD MAINTAINED BY ILRCMP   */ 02051000
*       3 ASMMSGBF PTR(31),         /* ADDRESS OF MESSAGE BUFFER USED   02052000
*                                      BY ASM MESSAGE ROUTINE        */ 02053000
*       3 ASMRSV5 CHAR(4),          /* RESERVED                      */ 02054000
*/* ******************************************************************/ 02055000
*/*                                                                  */ 02056000
*/*   THE FOLLOWING SECTION OF THE ASMVT IS USED PRIMARILY BY THE    */ 02057000
*/*   I/O CONTROL MODULES OF ASM.                                    */ 02058000
*/*                                                                  */ 02059000
*/* ******************************************************************/ 02060000
*                                                               02S0049 02061000
*       3 ASMSTAGQ CHAR(8) BDY(DWORD),/* I/O STAGING QUEUE CONTAINING   02062000
*                                      AIA'S WAITING FOR AVAILABLE      02063000
*                                      IOE'S                         */ 02064000
*         5 ASMSTAGF PTR(31),       /* ADDRESS OF FIRST AIA ON  02S0049 02065000
*                                      STAGING QUEUE                 */ 02066000
*         5 ASMSTAGL PTR(31),       /* ADDRESS OF LAST AIA ON STAGING   02067000
*                                      QUEUE                         */ 02068000
*       3 ASMIORQR FIXED(31),       /* COUNT OF I/O REQUESTS (AIA'S)    02069000
*                                      RECEIVED BY I/O CONTROL, THIS    02070000
*                                      DOES NOT INCLUDE LSQA SWAP       02071000
*                                      AIA'S                         */ 02072000
*       3 ASMIORQC FIXED(31),       /* COUNT OF I/O REQUESTS (AIA'S)    02073000
*                                      COMPLETED AND RETURNED TO RSM */ 02074000
*       3 ASMRSV6 CHAR(16),         /* RESERVED                      */ 02075000
*/* ******************************************************************/ 02076000
*/*                                                                  */ 02077000
*/*   THE FOLLOWING SECTION OF THE ASMVT IS USED PRIMARILY BY THE    */ 02078000
*/*   I/O SUBSYSTEM MODULES OF ASM.                                  */ 02079000
*/*                                                                  */ 02080000
*/* ******************************************************************/ 02081000
*                                                               02S0049 02082000
*       3 ASMPCCWQ CHAR(8) BDY(DWORD),/* QUEUE OF AVAILABLE PCCW'S      02083000
*                                      FOR SLOT SORT, QUEUE IS  02S0049 02084000
*                                      MAINTAINED BY COMPARE AND SWAP   02085000
*                                      LOGIC WHICH MAKES THE    02S0049 02086000
*                                      SYNCHRONIZATION COUNT    02S0049 02087000
*                                      NECESSARY                     */ 02088000
*         5 ASMPCCWA PTR(31),       /* ADDRESS OF FIRST AVAILABLE       02089000
*                                      PCCW                          */ 02090000
*         5 ASMPCCWC FIXED(31),     /* SYNCHRONIZATION COUNT,   02S0049 02091000
*                                      DECREMENTED WHEN REMOVING        02092000
*                                      PCCW'S, UNCHANGED WHEN ADDING    02093000
*                                      PCCW'S                        */ 02094000
*       3 ASMPCCWN FIXED(31),       /* NUMBER OF PCCW'S BUILT BY RIM */ 02095000
*       3 ASMBURST FIXED(31),       /* LENGTH OF SERVICE BURST FOR      02096000
*                                      PAGE DATA SETS (IN       02S0049 02097000
*                                      MICROSECONDS)                 */ 02098000
*       3 ASMIOCNT FIXED(31),       /* COUNT OF STARTIO REQUESTS MADE   02099000
*                                      TO IOS THAT HAVE NOT COMPLETED*/ 02100000
*       3 ASMSRBCT FIXED(31),       /* NUMBER OF SRB'S SCHEDULED FOR    02101000
*                                      THE I/O SUBSYSTEM THAT HAVE      02102000
*                                      NOT BEEN DISPATCHED, THIS        02103000
*                                      COUNT SHOULD BE EITHER 0 OR 1,   02104000
*                                      IT IS MAINTAINED BY COMPARE      02105000
*                                      AND SWAP LOGIC                */ 02106000
*       3 ASMPSRB PTR(31),          /* ADDRESS OF SRB USED TO   02S0049 02107000
*                                      SCHEDULE THE I/O SUBSYSTEM    */ 02108000
*       3 ASMRSV7 CHAR(16),         /* RESERVED                      */ 02109000
*/* ******************************************************************/ 02110000
*/*                                                                  */ 02111000
*/*   THE FOLLOWING SECTION OF THE ASMVT IS USED FOR PAGE DATA SET   */ 02112000
*/*   SLOT ACCOUNTING.                                               */ 02113000
*/*                                                                  */ 02114000
*/* ******************************************************************/ 02115000
*                                                               02S0049 02116000
*       3 ASMBKSLT FIXED(31),       /* COUNT OF UNRESERVED LOCAL        02117000
*                                      SLOTS, THIS COUNT IS     02S0049 02118000
*                                      DECREMENTED AND INCREMENTED      02119000
*                                      FOR EACH ADDRESS SPACE OR VIO    02120000
*                                      LG CREATED OR DELETED         */ 02121000
*       3 ASMSLOTS FIXED(31),       /* COUNT OF TOTAL LOCAL SLOTS IN    02122000
*                                      ALL OPEN LOCAL PAGE DATA SETS */ 02123000
*       3 ASMVSC FIXED(31),         /* COUNT OF TOTAL LOCAL SLOTS       02124000
*                                      ALLOCATED TO VIO PRIVATE AREA    02125000
*                                      PAGES                         */ 02126000
*       3 ASMNVSC FIXED(31),        /* COUNT OF TOTAL LOCAL SLOTS       02127000
*                                      ALLOCATED TO NON-VIO PRIVATE     02128000
*                                      AREA PAGES                    */ 02129000
*       3 ASMERRS FIXED(31),        /* COUNT OF BAD SLOTS FOUND ON      02130000
*                                      LOCAL DATA SETS DURING NORMAL    02131000
*                                      OPERATIONS                    */ 02132000
*/* ******************************************************************/ 02133000
*/*                                                                  */ 02134000
*/*   THE FOLLOWING SECTION OF THE ASMVT IS USED PRIMARILY BY THE    */ 02135000
*/*   VIO CONTROLLER AND THE GROUP OPERATOR MODULES.                 */ 02136000
*/*                                                                  */ 02137000
*/* ******************************************************************/ 02138000
*                                                               02S0049 02139000
*       3 ASMSLOTV PTR(31),         /* ADDRESS OF THE SLOTV CONSTANT */ 02140000
*       3 ASMLGVT PTR(31),          /* ADDRESS OF THE LOGICAL GROUP     02141000
*                                      VECTOR TABLE                  */ 02142000
*       3 ASMSTGXA PTR(31),         /* ADDRESS OF THE ACB FOR   02S0049 02143000
*                                      SYS1.STGINDEX                 */ 02144000
*       3 ASMCINV FIXED(31),        /* NUMBER OF CONTROL INTERVALS IN   02145000
*                                      SYS1.STGINDEX                 */ 02146000
*       3 ASMLSAI CHAR(8) BDY(DWORD),/* ASM STORAGE LOCATOR 'S' 02S0049 02147000
*                                      SYMBOL GENERATOR, LAST 'S'       02148000
*                                      SYMBOL ASSIGNED               */ 02149000
*         5 ASMLSAIL FIXED(31),     /* LOW WORD OF 'S' SYMBOL   02S0049 02150000
*                                      GENERATOR                     */ 02151000
*         5 ASMLSAIH FIXED(31),     /* HIGH WORD OF 'S' SYMBOL  02S0049 02152000
*                                      GENERATOR                     */ 02153000
*       3 ASMGOSQS CHAR(8) BDY(DWORD),/* DOUBLEWORD REFERENCE FOR GOS   02154000
*                                      WORK QUEUES                   */ 02155000
*         5 ASMGOSWT FIXED(31),     /* QUEUE OF ELEMENTS FOR ACE'S      02156000
*                                      WAITING FOR VSAM BUFFER TO       02157000
*                                      BECOME AVAILABLE, USED BY        02158000
*                                      ILRGOS                        */ 02159000
*         5 ASMGOSWK FIXED(31),     /* FIFO WORK QUEUE OF ELEMENTS      02160000
*                                      FOR ACE'S, USED BY ILRGOS TO     02161000
*                                      START OPERATIONS WAITING FOR     02162000
*                                      VSAM BUFFERS                  */ 02163000
*       3 ASMREQCT FIXED(31),       /* NUMBER OF SIMULTANEOUS   02S0049 02164000
*                                      REQUESTS THAT CAN BE MADE TO     02165000
*                                      VSAM, THIS NUMBER (MINUS ONE     02166000
*                                      FOR ILRTMRLG'S USE)      02S0049 02167000
*                                      CORRESPONDS TO THE STRING        02168000
*                                      NUMBER PARAMETER ON THE OPEN     02169000
*                                      FOR SYS1.STGINDEX             */ 02170000
*       3 ASMTCBPT PTR(31),         /* ADDRESS OF ASM TCB            */ 02171000
*       3 ASMTMECB FIXED(31),       /* ECB USED BY ILRTMRLG TO WAIT     02172000
*                                      FOR WORK, THIS ECB IS POSTED     02173000
*                                      BY ILRRLG                     */ 02174000
*       3 ASMRLGRQ FIXED(31),       /* REQUEST QUEUE FOR ILRTMRLG       02175000
*                                      CONSISTING OF ACE'S QUEUED BY    02176000
*                                      ILRRLG, QUEUE IS SERIALIZED BY   02177000
*                                      COMPARE AND SWAP LOGIC        */ 02178000
*       3 ASMRLGWQ FIXED(31),       /* WORK QUEUE FOR ILRTMRLG TO       02179000
*                                      HOLD ACE'S MOVED FROM REQUEST    02180000
*                                      QUEUES                        */ 02181000
*       3 ASMTASCB PTR(31),         /* ADDRESS OF ASCB FOR ADDRESS      02182000
*                                      SPACE IN WHICH ILRTMRLG IS       02183000
*                                      RUNNING                       */ 02184000
*       3 ASMRSV8 CHAR(8),          /* RESERVED                      */ 02185000
*/* ******************************************************************/ 02186000
*/*                                                                  */ 02187000
*/*   THE FOLLOWING SECTION OF THE ASMVT CONTAINS ENTRY POINT        */ 02188000
*/*   ADDRESSES OF THOSE ASM ROUTINES OR SUBROUTINES THAT ARE CALLED */ 02189000
*/*   BY MORE THAN ONE MODULE, OR THAT RESIDE IN LPA.  LPA ROUTINE   */ 02190000
*/*   ENTRY POINTS ARE DETERMINED AT TASK MODE INITIALIZATION.       */ 02191000
*/*                                                                  */ 02192000
*/* ******************************************************************/ 02193000
*                                                               02S0049 02194000
*       3 ASMPQIOE PTR(31),         /* ADDRESS OF ILRQIOE, SUBROUTINE   02195000
*                                      OF ILRPAGIO                   */ 02196000
*       3 ASMPFRSL PTR(31),         /* ADDRESS OF ILRFRSL1, FREESLOT    02197000
*                                      ENTRY POINT OF ILRFRSLT       */ 02198000
*       3 ASMPFRSW PTR(31),         /* ADDRESS OF ILRFLSW1, FREESWAP    02199000
*                                      ENTRY POINT OF ILRFRSLT       */ 02200000
*       3 ASMPTM PTR(31),           /* ADDRESS OF ILRPTM             */ 02201000
*       3 ASMPSWPD PTR(31),         /* ADDRESS OF ILRSWPDR           */ 02202000
*       3 ASMPSRMT PTR(31),         /* ADDRESS OF ILRPSRMT, PART        02203000
*                                      MONITOR AND SWAP DRIVER RMTR  */ 02204000
*       3 ASMPSRBC PTR(31),         /* ADDRESS OF ILRSRBC            */ 02205000
*       3 ASMVRMTR PTR(31),         /* ADDRESS OF ILRSRBRM, ENTRY       02206000
*                                      POINT OF ILRSRBC FOR VIO RMTR */ 02207000
*       3 ASMPEX PTR(31),           /* ADDRESS OF ILRPEX             */ 02208000
*       3 ASMPCMPD PTR(32),         /* ADDRESS OF ILRCMPDI, ENTRY       02209000
*                                      POINT OF ILRCMP, THE HIGH        02210000
*                                      ORDER BIT OF THIS POINTER IS     02211000
*                                      SET BY THE ASM RIM TO ALLOW      02212000
*                                      ROUTINES BUILDING AN IOSB TO     02213000
*                                      SET THE DIE EXIT ADDRESS AND     02214000
*                                      THE NO-TRAS FLAG IN ONE  02S0049 02215000
*                                      INSTRUCTION                   */ 02216000
*       3 ASMPCMPN PTR(31),         /* ADDRESS OF ILRCMPNE, ENTRY       02217000
*                                      POINT OF ILRCMP               */ 02218000
*       3 ASMPCMPA PTR(31),         /* ADDRESS OF ILRCMPAE, ENTRY       02219000
*                                      POINT OF ILRCMP               */ 02220000
*       3 ASMPCMP PTR(31),          /* ADDRESS OF ILRCMP             */ 02221000
*       3 ASMPSAV PTR(31),          /* ADDRESS OF ILRSAV             */ 02222000
*       3 ASMPACT PTR(31),          /* ADDRESS OF ILRACT             */ 02223000
*       3 ASMPRLG PTR(31),          /* ADDRESS OF ILRRLG             */ 02224000
*       3 ASMPFRLG PTR(31),         /* ADDRESS OF ILRFRELG, ENTRY       02225000
*                                      POINT OF ILRGOS               */ 02226000
*       3 ASMPMSG0 PTR(31),         /* ADDRESS OF ILRMSG00           */ 02227000
*       3 ASMPMSGS PTR(31),         /* ADDRESS OF ILRMSGSP, ENTRY       02228000
*                                      POINT OF ILRMSG00             */ 02229000
*       3 ASMPVACQ PTR(31),         /* ADDRESS OF ILRVACQ2, ENTRY       02230000
*                                      POINT OF ILRFRR01             */ 02231000
*       3 ASMPIOFR PTR(31),         /* ADDRESS OF ILRIOFRR, I/O 02S0049 02232000
*                                      CONTROL RECOVERY ROUTINE      */ 02233000
*       3 ASMPVACE PTR(31),         /* ADDRESS OF ILRVACE, ENTRY        02234000
*                                      POINT OF ILRFRR01             */ 02235000
*       3 ASMRSV10 CHAR(16),        /* RESERVED                      */ 02236000
*/* ******************************************************************/ 02237000
*/*                                                                  */ 02238000
*/*   THE FOLLOWING SECTION OF THE ASMVT CONTAINS THE POOL           */ 02239000
*/*   CONTROLLERS THAT ARE USED BY THE GMA MACRO TO OBTAIN AND       */ 02240000
*/*   RELEASE CELLS FOR THOSE ROUTINES REQUIRING ONE OF THESE        */ 02241000
*/*   CONTROL BLOCKS.  THE POOL CONTROLLER MAPPING APPEARS AT THE    */ 02242000
*/*   END OF THE ASMVT.                                              */ 02243000
*/*                                                                  */ 02244000
*/* ******************************************************************/ 02245000
*                                                               02S0049 02246000
*       3 ASMIOEPC CHAR(16) BDY(DWORD),/* IOE POOL CONTROLLER        */ 02247000
*       3 ASMBWKPC CHAR(16) BDY(DWORD),/* 256 BYTE WORKAREA POOL        02248000
*                                      CONTROLLER                    */ 02249000
*       3 ASMSWKPC CHAR(16) BDY(DWORD),/* 512 BYTE WORKAREA POOL        02250000
*                                      CONTROLLER, USED EXCLUSIVELY     02251000
*                                      BY ILRVSAMI                   */ 02252000
*       3 ASMACEPC CHAR(24) BDY(DWORD),/* ACE POOL CONTROLLER        */ 02253000
*/* ******************************************************************/ 02254000
*/*                                                                  */ 02255000
*/*   THE FOLLOWING SECTION OF THE ASMVT CONTAINS WORK-SAVE AREAS    */ 02256000
*/*   USED BY THE ASM ROUTINES THAT RUN WITH THE SALLOC LOCK.        */ 02257000
*/*                                                                  */ 02258000
*/* ******************************************************************/ 02259000
*                                                               02S0049 02260000
*       3 ASMWKSA1 CHAR(80) BDY(DWORD),/* USED BY ILRPAGIO           */ 02261000
*       3 ASMWKSA2 CHAR(80) BDY(DWORD),/* USED BY ILRQIOE, SUBROUTINE   02262000
*                                      OF ILRPAGIO                   */ 02263000
*       3 ASMWKSA3 CHAR(80) BDY(DWORD),/* USED BY ILRPAGCM           */ 02264000
*       3 ASMWKSA4 CHAR(80) BDY(DWORD),/* USED BY ILRSWAP            */ 02265000
*       3 ASMWKSA5 CHAR(80) BDY(DWORD),/* USED BY ILRSLSQA,     02S0049 02266000
*                                      SUBROUTINE OF ILRSWAP         */ 02267000
*       3 ASMWKSA6 CHAR(80) BDY(DWORD),/* USED BY ILRPOS AND ILRVIOCM*/ 02268000
*       3 ASMWKSA7 CHAR(80) BDY(DWORD),/* USED BY ILRPEX             */ 02269000
*       3 ASMSAVE CHAR(72) BDY(DWORD),/* STANDARD REGISTER SAVE AREA    02270000
*                                      USED BY ASM WHEN CALLING OTHER   02271000
*                                      ROUTINES                      */ 02272000
*       3 ASMRSV12 CHAR(24);        /* RESERVED                      */ 02273000
*/* ******************************************************************/ 02274000
*/*                                                                  */ 02275000
*/*   THE FOLLOWING IS THE MAPPING OF THE POOL CONTROLLERS CONTAINED */ 02276000
*/*   IN THE ASMVT.                                                  */ 02277000
*/*                                                                  */ 02278000
*/* ******************************************************************/ 02279000
*                                                               02S0050 02280000
*   DECLARE                                                     02S0050 02281000
*     1 ASMPOOLS BASED BDY(DWORD),  /* CELLPOOL CONTROLLER MAPPING   */ 02282000
*       3 ASMCPID CHAR(4),          /* CELLPOOL IDENTIFIER           */ 02283000
*       3 ASMCPSIZ FIXED(15),       /* SIZE OF EACH CELL IN POOL     */ 02284000
*       3 ASMCPEXT FIXED(15),       /* NUMBER OF CELLS IN POOL  02S0050 02285000
*                                      EXTENSION                     */ 02286000
*       3 ASMCPAVQ CHAR(8) BDY(DWORD),/* AVAILABLE CELL POOL CONTROL */ 02287000
*         5 ASMCPAVL PTR(31),       /* ADDRESS OF FIRST AVAILABLE       02288000
*                                      CELL IN POOL                  */ 02289000
*         5 ASMCPCNT FIXED(31),     /* COUNT FOR SYNCHRONIZATION OF     02290000
*                                      THIS POOL, DECREMENTED WHEN      02291000
*                                      REMOVING A CELL FROM POOL,       02292000
*                                      UNCHANGED WHEN PLACING A CELL    02293000
*                                      BACK IN THE POOL              */ 02294000
*       3 ASMCPRSQ CHAR(8) BDY(DWORD),/* ACE POOL ONLY, ACE RESERVE     02295000
*                                      CELL POOL CONTROL             */ 02296000
*         5 ASMCPTAK FIXED(31),     /* ACE POOL ONLY, NUMBER OF CELLS   02297000
*                                      TAKEN FROM RESERVE QUEUE      */ 02298000
*         5 ASMCPRES PTR(31);       /* ACE POOL ONLY, RESERVE QUEUE     02299000
*                                      OF ACE CELLS USED ONLY WHEN      02300000
*                                      ACE REQUIRED BY ROUTINES 02S0050 02301000
*                                      RUNNING WITH THE SALLOC LOCK  */ 02302000
*/* ******************************************************************/ 02303000
*/*                                                                  */ 02304000
*/*   THE FOLLOWING ARE MAPPINGS OF SOME OF THE WORK-SAVE AREAS      */ 02305000
*/*   CONTAINED IN THE ASMVT.                                        */ 02306000
*/*                                                                  */ 02307000
*/* ******************************************************************/ 02308000
*                                                               02S0051 02309000
*   DECLARE                                                     02S0051 02310000
*     1 ASM1WKSV CHAR(80) BDY(DWORD) DEFINED(ASMWKSA1),/* MAPPING OF    02311000
*                                      WORK-SAVE AREA USED BY   02S0051 02312000
*                                      ILRPAGIO                      */ 02313000
*       3 ASM1RGSV CHAR(60) BDY(DWORD),/* INPUT REGISTER SAVE AREA   */ 02314000
*         5 ASM1RG1 PTR(31),        /* SAVE AREA FOR REG 1           */ 02315000
*         5 * CHAR(52),             /* SAVE AREA FOR REG 2 TO REG 14 */ 02316000
*         5 ASM1RG15 PTR(31),       /* SAVE AREA FOR REG 15          */ 02317000
*       3 ASM1WRKA CHAR(20) BDY(WORD),/* WORK AREA                   */ 02318000
*         5 ASM1ASCB PTR(31),       /* ADDRESS OF ASCB               */ 02319000
*         5 ASM1NXTA PTR(31);       /* ADDRESS OF NEXT AIA           */ 02320000
*   DECLARE                                                     02S0052 02321000
*     1 ASM2WKSV CHAR(80) BDY(DWORD) DEFINED(ASMWKSA2),/* MAPPING OF    02322000
*                                      WORK-SAVE AREA USED BY ILRQIOE*/ 02323000
*       3 ASM2RGSV CHAR(52) BDY(DWORD),/* INPUT REGISTER SAVE AREA   */ 02324000
*       3 ASM2WRKA CHAR(28) BDY(WORD),/* WORK AREA                   */ 02325000
*         5 ASM2PAQ PTR(31),        /* PTR TO PRIVATE AREA IOE'S     */ 02326000
*         5 ASM2CAQ PTR(31),        /* PTR TO COMMON AREA IOE'S      */ 02327000
*         5 ASM2DUPQ PTR(31),       /* PTR TO DUPLEXED IOE'S         */ 02328000
*         5 ASM2FLGS BIT(8),        /* LOCAL SWITCHES                */ 02329000
*           7 ASM2RFLG BIT(1),      /* READ IOE PUT ON SOME PARTE    */ 02330000
*           7 ASM2WFLG BIT(1),      /* WRITE IOE BUILT               */ 02331000
*         5 * CHAR(3),              /* UNUSED                        */ 02332000
*         5 ASM2SR14 PTR(31);       /* SAVE AREA FOR REG 14          */ 02333000
*   DECLARE                                                     02S0053 02334000
*     1 ASM3WKSV CHAR(80) BDY(DWORD) DEFINED(ASMWKSA3),/* MAPPING OF    02335000
*                                      WORK-SAVE AREA USED BY   02S0053 02336000
*                                      ILRPAGCM                      */ 02337000
*       3 ASM3SWPQ PTR(31),         /* QUEUE OF AIA'S FOR SWAPCOMP      02338000
*                                      RTN                           */ 02339000
*       3 ASM3GENQ PTR(31),         /* QUEUE OF AIA'S FOR PAGECOMP      02340000
*                                      RTN                           */ 02341000
*       3 ASM3PIOP PTR(31),         /* QUEUE OF AIA'S FOR RETURN TO     02342000
*                                      PIOP                          */ 02343000
*       3 ASM3TMPA PTR(31),         /* SAVE AREA FOR NEXT AIA PTR    */ 02344000
*       3 ASM3GRPA PTR(31),         /* SAVE AREA FOR NEXT GROUP PTR  */ 02345000
*       3 ASM3R14A PTR(31),         /* SAVE AREA FOR 1ST LEVEL REG 14*/ 02346000
*       3 ASM3R14B PTR(31),         /* SAVE AREA FOR 2ND LEVEL REG 14*/ 02347000
*       3 ASM3SR13 PTR(31);         /* SAVE AREA FOR REG 13          */ 02348000
*   DECLARE                                                     02S0054 02349000
*     1 ASM4WKSV CHAR(80) BDY(DWORD) DEFINED(ASMWKSA4),/* MAPPING OF    02350000
*                                      WORK-SAVE AREA USED BY ILRSWAP*/ 02351000
*       3 ASM4RGSV CHAR(52) BDY(DWORD),/* INPUT REGISTER SAVE AREA   */ 02352000
*         5 ASM4RG2 PTR(31),        /* SAVE AREA FOR REG 2           */ 02353000
*         5 * CHAR(48);             /* SAVE AREA FOR REG 3 TO REG 14 */ 02354000
*   DECLARE                                                     02S0055 02355000
*     1 ASM5WKSV CHAR(80) BDY(DWORD) DEFINED(ASMWKSA5),/* MAPPING OF    02356000
*                                      WORK-SAVE AREA USED BY   02S0055 02357000
*                                      ILRSLSQA                      */ 02358000
*       3 ASM5RGSV CHAR(52) BDY(DWORD),/* INPUT REGISTER SAVE AREA   */ 02359000
*         5 ASM5RG2 PTR(31),        /* SAVE AREA FOR REG 2           */ 02360000
*         5 * CHAR(48),             /* SAVE AREA FOR REG 3 TO REG 14 */ 02361000
*       3 ASM5SR14 PTR(31),         /* SAVE AREA FOR REG 14          */ 02362000
*       3 ASM5GCTR FIXED(31),       /* COUNTER FOR GROUPING AIA'S    */ 02363000
*       3 ASM5AIA PTR(31),          /* TEMP SAVE AREA FOR AIA PTR    */ 02364000
*       3 ASM5FLGS BIT(8);          /* INTERNAL FLAGS                */ 02365000
*                                                               02S0056 02366000
*   /*****************************************************************/ 02367000
*   /*                                                               */ 02368000
*   /* VIRTUAL DUMP COMMON CONTROL BLOCKS - EXPANDS INTO BASED       */ 02369000
*   /* CONTROL BLOCKS UNLESS %RMKINIT IS DECLARED AS CHAR AND        */ 02370000
*   /* INITIALIZED TO A NON-NULL CHARACTER STRING.                   */ 02371000
*   /*                                                               */ 02372000
*   /*****************************************************************/ 02373000
*                                                               02S0056 02374000
*   DCL                                                         02S0056 02375000
*     1 ARB BASED,                  /* ADDRESS RANGE BLOCK           */ 02376000
*       3 ARBADDRB PTR(31),         /* BEGINNING ADDRESS OF RANGE    */ 02377000
*       3 ARBADDRE PTR(31);         /* ENDING ADDRESS OF RANGE       */ 02378000
*   DCL                                                         02S0057 02379000
*     1 BCTH BDY(WORD) BASED(VCTBCTH),/* BUFFER CONTROL TABLE HEAD   */ 02380000
*       3 BCTHBCTH CHAR(4),         /* BCTH ACRONYM                  */ 02381000
*       3 BCTHFRST PTR(31),         /* ADDRESS OF FIRST BCT          */ 02382000
*       3 BCTHLAST PTR(31);         /* ADDRESS OF LAST BCT           */ 02383000
*   DCL                                                         02S0058 02384000
*     1 BCT BDY(WORD) BASED,        /* BUFFER CONTROL TABLE ENTRY    */ 02385000
*       3 BCTBCT CHAR(4),           /* EBCDIC ACRONYM                */ 02386000
*       3 BCTNEXT PTR(31),          /* NEXT BCT ON I/O QUEUE         */ 02387000
*       3 BCTKEY1 PTR(8),           /* STORAGE KEY OF FIRST 2K       */ 02388000
*       3 BCTKEY2 PTR(8),           /* STORAGE KEY OF LAST 2K        */ 02389000
*       3 BCTASID FIXED(16),        /* ASID OF DATA IN BUFFER        */ 02390000
*       3 BCTVADDR PTR(31),         /* VIRTUAL ADDRESS OF DATA IN       02391000
*                                      BUFFER                        */ 02392000
*       3 BCTRADDR PTR(31),         /* REAL ADDRESS OF BUFFER        */ 02393000
*       3 BCTPGTE PTR(31),          /* ADDRESS OF PAGE TABLE ENTRY   */ 02394000
*       3 BCTMDCB PTR(31),          /* ADDRESS OF MDCB FOR BUFFER    */ 02395000
*       3 * CHAR(8) BDY(WORD),      /* UNUSED                @Z40WI3F*/ 02396000
*       3 * PTR(31),                /* UNUSED                @Z40WI3F*/ 02397000
*       3 BCTLSID FIXED(31),        /* LOGICAL SLOT IDENTIFIER -        02398000
*                                      PAGE'S AUX STORAGE ID @Z40WI3F*/ 02399000
*         5 * FIXED(8),             /* UNUSED                @Z40WI3F*/ 02400000
*         5 BCTINDEX FIXED(8),      /* PART/SART ENTRY NUMBER   02S0058 02401000
*                                                            @Z40WI3F*/ 02402000
*         5 BCTRBA FIXED(16),       /* RELATIVE BLOCK ADDR   @Z40WI3F*/ 02403000
*       3 BCTFLGT BIT(8),           /* BUFFER TYPE FLAGS             */ 02404000
*         5 * BIT(1),               /* RESERVED                      */ 02405000
*         5 BCTWKFLE BIT(1),        /* WORKFILE                      */ 02406000
*         5 BCTPGT BIT(1),          /* PAGE TABLE                    */ 02407000
*         5 BCTASM BIT(1),          /* ASM                           */ 02408000
*         5 BCTLSQA BIT(1),         /* LSQA                          */ 02409000
*         5 BCTDUMP BIT(1),         /* DUMP                          */ 02410000
*         5 BCTPGTF BIT(1),         /* FIXED PAGE TABLE              */ 02411000
*         5 * BIT(1),               /* RESERVED                      */ 02412000
*       3 BCTFLGI BIT(8),           /* BUFFER STATUS FLAGS           */ 02413000
*         5 BCTCOMP BIT(1),         /* I/O COMPLETE FOR BUFFER       */ 02414000
*         5 BCTALLOC BIT(1),        /* BUFFER SCHEDULED FOR I/O      */ 02415000
*         5 BCTIOERR BIT(1),        /* I/O ERROR PROCESSING BUFFER   */ 02416000
*         5 BCTRECLM BIT(1),        /* VIRTUAL ADDRESS RECLAIMED FROM   02417000
*                                      REAL STORAGE                  */ 02418000
*         5 BCTSWPDS BIT(1),        /* PAGE FROM SWAP DATA SET  02S0058 02419000
*                                                            @Z40WI3F*/ 02420000
*       3 * PTR(16);                /* RESERVED                      */ 02421000
*   DCL                                                         02S0059 02422000
*     1 CCT BDY(WORD) BASED(CCTADDR),/* COMMON COMMUNICATION TABLE   */ 02423000
*       3 CTWAIT PTR(8),            /* HIGHEST WAIT CODE             */ 02424000
*       3 CTFLG1 BIT(8),            /* FLAGS                         */ 02425000
*         5 CTERROR BIT(1),         /* CALLER PROCESSES ERROR   02S0059 02426000
*                                      RECOVERY                      */ 02427000
*         5 CTDEVICE BIT(1),        /* DIRECT ACCESS I/O IN PROGRESS */ 02428000
*         5 CTMORTPE BIT(1),        /* END OF REEL                   */ 02429000
*         5 CTWORK BIT(1),          /* WORK RECORD IN PROCESS        */ 02430000
*         5 CTDEFO BIT(1),          /* DEFAULT ADDRESS USED FOR 02S0059 02431000
*                                      OUTPUT                        */ 02432000
*         5 * BIT(1),               /* RESERVED                      */ 02433000
*         5 CTMP BIT(1),            /* PROCESSING ON MP SYSTEM       */ 02434000
*         5 CTERREC BIT(1),         /* IGNORE CATASTROPHIC ERROR     */ 02435000
*       3 CTFLG2 BIT(8),            /* FLAGS                         */ 02436000
*         5 CTDUPSW BIT(1),         /* DUPLICATE LINE                */ 02437000
*         5 CTSTOR BIT(1),          /* PROTECTION KEY IN PROCESS     */ 02438000
*         5 CTPGEFLT BIT(1),        /* PAGE FAULT IN PROCESS         */ 02439000
*         5 CTNOSTAT BIT(1),        /* STORE STATUS NOT PERFORMED    */ 02440000
*         5 CTVIRTR BIT(1),         /* VIRTUAL DUMP REQUESTED        */ 02441000
*         5 CTWKDONE BIT(1),        /* END OF WORK FILE PROCESSING   */ 02442000
*         5 CTALTCON BIT(1),        /* ALTERNATE CONSOLE IN USE      */ 02443000
*         5 * BIT(1),               /* RESERVED                      */ 02444000
*       3 CTDEVTYP PTR(8),          /* IPL DEVICE TYPE               */ 02445000
*       3 CTSENSE FIXED(15),        /* SENSE INFORMATION AREA        */ 02446000
*       3 CTINADDR FIXED(15),       /* IPL DEVICE ADDRESS            */ 02447000
*       3 CTCCHHR CHAR(7),          /* CCHHR FOR USE DURING IPL AND     02448000
*                                      WORK RECORD PROCESSING        */ 02449000
*       3 CTPGECNT CHAR(1),         /* NUMBER OF RECORDS IN AMDSAPGE    02450000
*                                      (D.A. IPL)                    */ 02451000
*       3 CTCCHHS FIXED(31),        /* STARTING CCHH OF SYS1.PAGEDUMP*/ 02452000
*       3 CTCCHHE FIXED(31),        /* ENDING CCHH OF SYS1.PAGEDUMP  */ 02453000
*       3 CTCCHHW FIXED(31),        /* BEGINNING CCHH FOR WORKFILE   */ 02454000
*       3 CTERBDA FIXED(31),        /* DIRECT ACCESS ERROR RECOVERY     02455000
*                                      BLOCK                         */ 02456000
*/* THE FOLLOWING IS THE CCT COMMON SECTION                          */ 02457000
*                                                               02S0059 02458000
*       3 CTERBTPE FIXED(31),       /* TAPE ERROR RECOVERY BLOCK     */ 02459000
*       3 CTERBCON FIXED(31),       /* CONSOLE ERROR RECOVERY BLOCK  */ 02460000
*       3 CTCPUI FIXED(15),         /* IPL CPU ADDRESS               */ 02461000
*       3 CTOUTAD FIXED(15),        /* OUTPUT DEVICE ADDRESS         */ 02462000
*       3 CTCONTYP PTR(8),          /* CONSOLE TYPE                  */ 02463000
*       3 CTEBCOPD CHAR(3),         /* DEFAULT OUTPUT DEVICE ADDRESS */ 02464000
*       3 CTLOWFLG BIT(8),          /* FLAGS                         */ 02465000
*         5 CTVIRTD BIT(1),         /* DEFAULT TO VIRTUAL DUMP       */ 02466000
*         5 CTFP BIT(1),            /* FILE PROTECT                  */ 02467000
*         5 CTINIT BIT(1),          /* RE-INITIALIZATION PERMITTED      02468000
*                                      AFTER CHANNEL ERROR           */ 02469000
*         5 CTWKSTUS BIT(1),        /* STATUS OF INCOMPLETE WORKFILE    02470000
*                                      - ON MEANS INSUFFICIENT SPACE,   02471000
*                                      OFF MEANS I/O ERROR OCCURRED  */ 02472000
*         5 * BIT(4),               /* RESERVED                      */ 02473000
*       3 CTEBCOPR CHAR(3),         /* REPLIED OUTPUT DEVICE ADDRESS */ 02474000
*/* THE FOLLOWING IS THE DUMP TYPE SECTION OF THE CCT                */ 02475000
*                                                               02S0059 02476000
*      2 CTDMPTYP,                                              02S0059 02477000
*                                                               02S0059 02478000
*/* HIGH SPEED DUMP -                                                */ 02479000
*                                                               02S0059 02480000
*       3 CTIOTYPE BIT(8),          /* I/O REQUEST FLAGS             */ 02481000
*         5 CTIOTERM BIT(1),        /* TERMINATE                     */ 02482000
*         5 CTIOOUT BIT(1),         /* OUTPUT TAPE                   */ 02483000
*         5 CTIODA BIT(1),          /* DIRECT ACCESS                 */ 02484000
*         5 CTIOWK BIT(1),          /* WORKFILE                      */ 02485000
*         5 CTIOCON BIT(1),         /* CONSOLE                       */ 02486000
*         5 CTIOINT BIT(1),         /* RETURN ON ANY INTERRUPT       */ 02487000
*         5 CTIORSET BIT(1),        /* RESET CPU ON CPU SWITCH       */ 02488000
*         5 * BIT(1),               /* RESERVED                      */ 02489000
*       3 * BIT(8),                 /* RESERVED                      */ 02490000
*       3 CTCONFLG BIT(8),          /* CONSOLE FLAGS                 */ 02491000
*         5 CTMSGOUT BIT(1),        /* MSG MUST COME OUT             */ 02492000
*         5 CTREAD BIT(1),          /* CONSOLE READ IN PROGRESS      */ 02493000
*         5 * BIT(6),               /* RESERVED                      */ 02494000
*       3 CTBUFTYP BIT(8),          /* BUFFER TYPE FLAGS             */ 02495000
*         5 * BIT(1),               /* RESERVED                      */ 02496000
*         5 CTWKFLE BIT(1),         /* WORKFILE                      */ 02497000
*         5 CTPGT BIT(1),           /* PAGE TABLE                    */ 02498000
*         5 CTASM BIT(1),           /* ASM                           */ 02499000
*         5 CTLSQA BIT(1),          /* LSQA                          */ 02500000
*         5 CTDUMP BIT(1),          /* DUMP BUFFER                   */ 02501000
*         5 * BIT(2),               /* RESERVED                      */ 02502000
*       3 CTCONSOL PTR(31),         /* ADDRESS OF CONSOLE I/O ROUTINE*/ 02503000
*       3 CTLWKAD PTR(31),          /* LAST ADDRESS ON WORKFILE      */ 02504000
*       3 CTCOMMIO PTR(31),         /* ADDRESS OF DUMPSIO ROUTINE    */ 02505000
*       3 CTEOR PTR(31),            /* ADDRESS OF END OF REEL ROUTINE*/ 02506000
*       3 CTVCCT PTR(31),           /* ADDRESS OF VCCT               */ 02507000
*       3 CTPRMT1 FIXED(15),        /* WRITE PROMPT POS. (3066 ONLY) */ 02508000
*         5 CTPRMT1Y FIXED(8),      /* Y COORDINATE                  */ 02509000
*         5 CTPRMT1X FIXED(8),      /* X COORDINATE                  */ 02510000
*       3 CTPRMT2 FIXED(15),        /* READ PROMPT POS. (3066 ONLY)  */ 02511000
*         5 CTPRMT2Y FIXED(8),      /* Y COORDINATE                  */ 02512000
*         5 CTPRMT2X FIXED(8),      /* X COORDINATE                  */ 02513000
*       3 CTHWM FIXED(8),           /* LOGICAL 3066 SCREEN LIMIT     */ 02514000
*       3 CTHWMAX FIXED(8);         /* PHYSICAL 3066 SCREEN LIMIT    */ 02515000
*   DCL                                                         02S0060 02516000
*     1 CTLOWDMP DEFINED(CTDMPTYP), /* THIS IS THE LOW SPEED DUMP       02517000
*                                      TYPE SECTION OF THE CCT       */ 02518000
*       3 CTADDRS PTR(31),          /* STARTING ADDRESS OF RANGE TO     02519000
*                                      BE DUMPED                     */ 02520000
*       3 CTADDRE PTR(31);          /* ENDING ADDRESS OF RANGE TO BE    02521000
*                                      DUMPED                        */ 02522000
*   DCL                                                         02S0061 02523000
*     1 CCW BDY(DWORD) BASED,       /* FORMAT OF CCW                 */ 02524000
*       3 CCWCMD PTR(8),            /* COMMAND                       */ 02525000
*       3 CCWDADDR PTR(24),         /* DATA ADDRESS                  */ 02526000
*       3 CCWFLAGS BIT(8),          /* CCW FLAGS                     */ 02527000
*         5 CCWDC BIT(1),           /* DATA CHAINING                 */ 02528000
*         5 CCWCC BIT(1),           /* COMMAND CHAINING              */ 02529000
*         5 CCWSLI BIT(1),          /* SUPPRESS INCORRECT LENGTH        02530000
*                                      INDICATOR                     */ 02531000
*         5 CCWSKIP BIT(1),         /* SUPPRESS DATA TRANSFER        */ 02532000
*         5 CCWPCI BIT(1),          /* PROGRAM-CONTROLLED INTERRUPT  */ 02533000
*         5 CCWIDA BIT(1),          /* INDIRECT DATA ADDRESS         */ 02534000
*         5 * BIT(2),               /* RESERVED                      */ 02535000
*       3 * PTR(8),                 /* RESERVED                      */ 02536000
*       3 CCWCNT FIXED(16);         /* BYTE COUNT                    */ 02537000
*   DCL                                                         02S0062 02538000
*     1 CSW BDY(WORD) BASED,        /* FORMAT OF CSW                 */ 02539000
*       3 CSWKEY00 BIT(8),                                      02S0062 02540000
*         5 CSWKEY BIT(4),          /* PROTECT KEY                   */ 02541000
*         5 * BIT(4),               /* RESERVED                      */ 02542000
*       3 CSWCADDR PTR(24),         /* COMMAND ADDRESS               */ 02543000
*       3 CSWUSTAT BIT(8),          /* CSW UNIT STATUS               */ 02544000
*         5 CSWATTN BIT(1),         /* ATTENTION                     */ 02545000
*         5 CSWSTMOD BIT(1),        /* STATUS MODIFIER               */ 02546000
*         5 CSWCUE BIT(1),          /* CONTROL UNIT END              */ 02547000
*         5 CSWBUSY BIT(1),         /* BUSY                          */ 02548000
*         5 CSWCE BIT(1),           /* CHANNEL END                   */ 02549000
*         5 CSWDE BIT(1),           /* DEVICE END                    */ 02550000
*         5 CSWUC BIT(1),           /* UNIT CHECK                    */ 02551000
*         5 CSWUE BIT(1),           /* UNIT EXCEPTION                */ 02552000
*       3 CSWCSTAT BIT(8),          /* CSW CHANNEL STATUS            */ 02553000
*         5 CSWPCI BIT(1),          /* PROGRAM-CONTROLLED INTERRUPT  */ 02554000
*         5 CSWIL BIT(1),           /* INCORRECT LENGTH              */ 02555000
*         5 CSWPGC BIT(1),          /* PROGRAM CHECK                 */ 02556000
*         5 CSWPTC BIT(1),          /* PROTECTION CHECK              */ 02557000
*         5 CSWCDC BIT(1),          /* CHANNEL DATA CHECK            */ 02558000
*         5 CSWCCC BIT(1),          /* CHANNEL CONTROL CHECK         */ 02559000
*         5 CSWICC BIT(1),          /* INTERFACE CONTROL CHECK       */ 02560000
*         5 CSWCHC BIT(1),          /* CHAINING CHECK                */ 02561000
*       3 CSWCNT FIXED(16);         /* RESIDUAL BYTE COUNT           */ 02562000
*   DCL                                                         02S0063 02563000
*     1 DSCE BDY(WORD) BASED(VCTDSCE),/* DYNAMIC STORAGE CONTROL        02564000
*                                      ELEMENT                       */ 02565000
*       3 DSCEDSCE CHAR(4),         /* DSCE ACRONYM                  */ 02566000
*       3 DSCEBEGN PTR(31),         /* BEGINNING ADDRESS OF DYNAMIC     02567000
*                                      STORAGE AREA                  */ 02568000
*       3 DSCENEXT PTR(31),         /* ADDRESS OF NEXT AVAILABLE        02569000
*                                      STORAGE                       */ 02570000
*       3 DSCETBEG PTR(31),         /* ADDRESS OF FIRST TRACE ENTRY  */ 02571000
*       3 DSCETCUR PTR(31),         /* CURRENT TRACE ENTRY ADDRESS   */ 02572000
*       3 DSCETEND PTR(31);         /* END OF TRACE AND DYNAMIC AREA */ 02573000
*   DCL                                                         02S0064 02574000
*     1 IODB BDY(WORD) BASED,       /* INPUT/OUTPUT DEVICE BLOCK     */ 02575000
*       3 IODBIODB CHAR(4),         /* IODB ACRONYM                  */ 02576000
*       3 IODBIDEN CHAR(4),         /* IODB TYPE                     */ 02577000
*       3 IODBFLAG BIT(16),         /* FLAGS                         */ 02578000
*         5 IODBTERM BIT(1),        /* CATASTROPHIC ERROR            */ 02579000
*         5 IODBPTRM BIT(1),        /* TERMINATE VIRTUAL DUMP        */ 02580000
*         5 IODBINT BIT(1),         /* INTERRUPT PROCESSED           */ 02581000
*         5 IODBIOC BIT(1),         /* I/O ERROR                     */ 02582000
*         5 IODBHALT BIT(1),        /* DEVICE QUIESCED               */ 02583000
*         5 IODBACTV BIT(1),        /* I/O ACTIVE ON DEVICE          */ 02584000
*         5 IODBCONW BIT(1),        /* WAIT ON NEXT FULL SCREEN (3066   02585000
*                                      CONSOLE ONLY)                 */ 02586000
*         5 IODBSTRT BIT(1),        /* I/O STARTED BY ERROR RECOVERY    02587000
*                                      ROUTINE                       */ 02588000
*         5 * BIT(8),               /* RESERVED                      */ 02589000
*       3 IODBDEV FIXED(15),        /* DEVICE ADDRESS                */ 02590000
*       3 IODBCLAS PTR(8),          /* DEVICE CLASS                  */ 02591000
*       3 IODBTYPE PTR(8),          /* UNIT TYPE                     */ 02592000
*       3 IODBCPU FIXED(15),        /* CPU ADDRESS                   */ 02593000
*       3 IODBBCT PTR(31),          /* ADDRESS OF FIRST BCT ON I/O      02594000
*                                      REQUEST QUEUE                 */ 02595000
*       3 IODBCAW PTR(31),          /* CAW USED FOR CURRENT I/O 02S0064 02596000
*                                      OPERATION                     */ 02597000
*       3 IODBCSW CHAR(8),          /* CSW FOR CURRENT OPERATION     */ 02598000
*       3 IODBCCHH CHAR(8),         /* SEEK ADDRESS                  */ 02599000
*         5 IODBM CHAR(1),          /* 'M' VALUE                     */ 02600000
*         5 IODBSEEK CHAR(2),       /* BEGINNING OF SEEK ADDRESS     */ 02601000
*         5 IODBSRCH CHAR(4),       /* SEARCH ADDRESS                */ 02602000
*           7 IODBCC CHAR(2),       /* CYLINDER NUMBER               */ 02603000
*           7 IODBHH CHAR(2),       /* TRACK NUMBER                  */ 02604000
*         5 IODBR CHAR(1),          /* RECORD NUMBER                 */ 02605000
*       3 IODBSENS CHAR(24);        /* SENSE INFORMATION             */ 02606000
*   DCL                                                         02S0065 02607000
*     1 MDCE BDY(WORD) BASED(VCTMDCE),/* MEMORY DISPATCHING CONTROL     02608000
*                                      ELEMENT                       */ 02609000
*       3 MDCEMDCE CHAR(4),         /* MDCE ACRONYM                  */ 02610000
*       3 MDCEACTV PTR(31),         /* ACTIVE MDCB QUEUE             */ 02611000
*       3 MDCEAVIL PTR(31);         /* AVAILABLE MDCB QUEUE          */ 02612000
*   DCL                                                         02S0066 02613000
*     1 MDCB BDY(WORD) BASED,       /* MEMORY DISPATCHING CONTROL       02614000
*                                      BLOCK                         */ 02615000
*       3 MDCBMDCB CHAR(4),         /* MDCB ACRONYM                  */ 02616000
*       3 MDCBNEXT PTR(31),         /* NEXT MDCB                     */ 02617000
*       3 MDCBPSW CHAR(8),          /* PSW AT TIME OF INTERRUPT      */ 02618000
*       3 MDCBGRS BDY(WORD) CHAR(64),/* GENERAL REGISTERS            */ 02619000
*         5 MDCBGR0 PTR(31),                                    02S0066 02620000
*         5 MDCBGR1 PTR(31),                                    02S0066 02621000
*         5 MDCBGR2 PTR(31),                                    02S0066 02622000
*         5 MDCBGR3 PTR(31),                                    02S0066 02623000
*         5 MDCBGR4 PTR(31),                                    02S0066 02624000
*         5 MDCBGR5 PTR(31),                                    02S0066 02625000
*         5 MDCBGR6 PTR(31),                                    02S0066 02626000
*         5 MDCBGR7 PTR(31),                                    02S0066 02627000
*         5 MDCBGR8 PTR(31),                                    02S0066 02628000
*         5 MDCBGR9 PTR(31),                                    02S0066 02629000
*         5 MDCBGR10 PTR(31),                                   02S0066 02630000
*         5 MDCBGR11 PTR(31),                                   02S0066 02631000
*         5 MDCBGR12 PTR(31),                                   02S0066 02632000
*         5 MDCBGR13 PTR(31),                                   02S0066 02633000
*         5 MDCBGR14 PTR(31),                                   02S0066 02634000
*         5 MDCBGR15 PTR(31),                                   02S0066 02635000
*       3 MDCBSTOR PTR(31),         /* CONTENTS OF CONTROL REGISTER 1*/ 02636000
*       3 MDCBPI FIXED(15),         /* PROGRAM INTERRUPT CODE        */ 02637000
*       3 MDCBFLGS BIT(8),          /* MDCB FLAGS                    */ 02638000
*         5 MDCBASMI BIT(1),        /* ASM FUNCTION STATUS           */ 02639000
*         5 MDCBDUMP BIT(1),        /* DUMP REQUEST STATUS           */ 02640000
*         5 * BIT(6),               /* RESERVED                      */ 02641000
*       3 * BIT(8);                 /* RESERVED                      */ 02642000
*   DCL                                                         02S0067 02643000
*     1 PSW BASED,                  /* OS/VS PSW (S/370 EC MODE)     */ 02644000
*      2 PSWSM CHAR(1),             /* SYSTEM MASK                   */ 02645000
*       3 * BIT(1),                                             02S0067 02646000
*       3 PSWPER BIT(1),            /* PROGRAM EVENT RECORDING       */ 02647000
*       3 * BIT(1),                                             02S0067 02648000
*       3 * BIT(1),                                             02S0067 02649000
*       3 * BIT(1),                                             02S0067 02650000
*       3 PSWDAT BIT(1),            /* DYNAMIC ADDRESS TRANSLATION   */ 02651000
*       3 PSWIO BIT(1),             /* INPUT / OUTPUT                */ 02652000
*       3 PSWXTRNL BIT(1),          /* EXTERNAL                      */ 02653000
*      2 * CHAR(1),                                             02S0067 02654000
*       3 PSWKEY BIT(4),            /* PROTECTION KEY                */ 02655000
*       3 PSWMODE BIT(1),           /* EXTENDED CONTROL MODE         */ 02656000
*       3 PSWMCH BIT(1),            /* MACHINE CHECK MASK            */ 02657000
*       3 PSWAIT BIT(1),            /* WAIT STATE                    */ 02658000
*       3 PSWPRBLM BIT(1),          /* PROBLEM STATE                 */ 02659000
*      2 PSWCCPM CHAR(1),                                       02S0067 02660000
*       3 * BIT(2),                 /* UNDEFINED                     */ 02661000
*       3 * BIT(2),                 /* CONDITION CODE                */ 02662000
*       3 PSWFPO BIT(1),            /* FIXED POINT OVERFLOW          */ 02663000
*       3 PSWDO BIT(1),             /* DIVIDE OVERFLOW               */ 02664000
*       3 PSWEU BIT(1),             /* EXPONENT UNDERFLOW            */ 02665000
*       3 PSWSIG BIT(1),            /* SIGNIFICANCE                  */ 02666000
*      2 * CHAR(1),                                             02S0067 02667000
*       3 PSWSP BIT(1),             /* SEGMENT PROTECTION            */ 02668000
*      2 PSWIA PTR(31),             /* INSTRUCTION ADDRESS           */ 02669000
*      2 PSWEND CHAR(0);            /* END OF PSW                    */ 02670000
*   DCL                                                         02S0068 02671000
*     PTRTREAL PTR(31) CONSTANT(30712);/* PTRT LOCATION X'77F8'      */ 02672000
*   DCL                                                         02S0069 02673000
*     1 PTRT BASED(PTRTREAL),       /* PTRT DEFINITION               */ 02674000
*       3 PTRTPTRT CHAR(4),         /* EBCDIC ACRONYM                */ 02675000
*       3 PTRTLGID CHAR(4),         /* LOGICAL GROUP FOR MEMORY      */ 02676000
*       3 PTRTRS(NUMSEG) PTR(31),   /* SEGMENT TABLE SECTION         */ 02677000
*       3 PTRTVS(NUMSEG) PTR(31);   /* VIRTUAL ADDR SECTION          */ 02678000
*   DCL                                                         02S0070 02679000
*     PTRTRSA PTR(31) BASED;        /* REAL STORAGE ADDRESS OF PAGE     02680000
*                                      TABLE                         */ 02681000
*   DCL                                                         02S0071 02682000
*     PTRTVSA PTR(31) BASED(ADDR(PTRTRSA)+NUMSEG*LENGTH(PTRTRSA));/*    02683000
*                                      VIRTUAL ADDR OF PAGE TABLE    */ 02684000
*   DCL                                                         02S0072 02685000
*     1 RCB BDY(WORD) BASED,        /* RECOVERY CONTROL BLOCK        */ 02686000
*       3 RCBNEXT PTR(31),          /* NEXT HIGHER RCB               */ 02687000
*       3 RCBSTOR PTR(31),          /* CONTROL REGISTER 1 FOR EXIT   */ 02688000
*       3 RCBSAVE PTR(31),          /* ADDRESS OF RECOVERY ROUTINE      02689000
*                                      REGISTER SAVE AREA            */ 02690000
*       3 RCBEXIT PTR(31),          /* ADDRESS OF RECOVERY ROUTINE   */ 02691000
*       3 RCBBASE PTR(31);          /* BASE ADDRESS OF RECOVERY 02S0072 02692000
*                                      ROUTINE                       */ 02693000
*   DCL                                                         02S0073 02694000
*     1 SADMPLSD LOCATION(3312),    /* SADMP LOW CORE STORAGE   02S0073 02695000
*                                      DEFINITIONS                   */ 02696000
*       3 PSWSADMP CHAR(8),         /* EBCDIC IDENTIFIER             */ 02697000
*       3 SVIRPSW CHAR(8) BDY(DWORD),/* RETURN PSW TO AMDSASVI  02S0073 02698000
*                                      FOLLOWING MEMORY SWITCH       */ 02699000
*       3 AUDPSW CHAR(8) BDY(DWORD),/* AMDSAAUD PSW TO GIVE CONTROL     02700000
*                                      TO RCB EXIT                   */ 02701000
*       3 SAVEDUMP CHAR(8),         /* EBCDIC IDENTIFIER OF SAVE        02702000
*                                      AREAS                         */ 02703000
*       3 LOWGRS CHAR(64),          /* SAVE AREA FOR GENERAL    02S0073 02704000
*                                      REGISTERS ACROSS CPU-CPU 02S0073 02705000
*                                      COMMUNICATIONS                */ 02706000
*       3 LOWCRS CHAR(64),          /* SAVE AREA FOR CONTROL    02S0073 02707000
*                                      REGISTERS ACROSS CPU-CPU 02S0073 02708000
*                                      COMMUNICATIONS                */ 02709000
*       3 SVINAME CHAR(4),          /* SAVE AREA ID                  */ 02710000
*       3 SVISAVE CHAR(100),        /* REGISTER SAVE AREA            */ 02711000
*       3 PGINAME CHAR(4),          /* SAVE AREA ID                  */ 02712000
*       3 PGISAVE CHAR(100),        /* REGISTER SAVE AREA            */ 02713000
*       3 IOINAME CHAR(4),          /* SAVE AREA ID                  */ 02714000
*       3 IOISAVE CHAR(100),        /* REGISTER SAVE AREA            */ 02715000
*       3 AUDNAME CHAR(4),          /* SAVE AREA ID                  */ 02716000
*       3 AUDSAVE CHAR(100),        /* REGISTER SAVE AREA            */ 02717000
*       3 FRMNAME CHAR(4),          /* SAVE AREA ID                  */ 02718000
*       3 FRMSAVE CHAR(100),        /* REGISTER SAVE AREA            */ 02719000
*       3 GTMNAME CHAR(4),          /* SAVE AREA ID                  */ 02720000
*       3 GTMSAVE CHAR(100);        /* REGISTER SAVE AREA            */ 02721000
*   DCL                                                         02S0074 02722000
*     1 VCCT BDY(WORD) BASED(VCCTREG),/* VIRTUAL COMMON COMMUNICATION   02723000
*                                      TABLE                         */ 02724000
*       3 VCTVCT CHAR(4),           /* VCCT ACRONYM                  */ 02725000
*       3 VCTRCB PTR(31),           /* RCB QUEUE POINTER             */ 02726000
*       3 VCTRECSN BIT(8),          /* RECURSION FLAGS               */ 02727000
*         5 VCTPGIR BIT(1),         /* PROGRAM INTERRUPT RECURSION      02728000
*                                      INVALID                       */ 02729000
*         5 VCTUPDR BIT(1),         /* PROGRAM INTERRUPT RECURSION IN   02730000
*                                      AMDSAUPD INVALID              */ 02731000
*         5 VCTEXIR BIT(1),         /* RECURSION THROUGH TERMINATION    02732000
*                                      ROUTINE INVALID               */ 02733000
*         5 VCTRSMR BIT(1),         /* RECURSION THROUGH AMDSARSM       02734000
*                                      INVALID                       */ 02735000
*         5 * BIT(4),               /* RESERVED                      */ 02736000
*       3 VCTFLGS BIT(8),           /* FLAGS                         */ 02737000
*         5 VCTSADMP BIT(1),        /* RECOVERY DUMP REQUESTED       */ 02738000
*         5 VCTMEMIN BIT(1),        /* MEMORY IS IN STORAGE          */ 02739000
*         5 VCTASMIC BIT(1),        /* ASM IN CONTROL                */ 02740000
*         5 VCTSARTB BIT(1),        /* BAD SART              @Z40WI3F*/ 02741000
*         5 VCTLRCLM BIT(1),        /* NO RECLAIM FOR LOCAL MEMORY   */ 02742000
*         5 VCTNOI22 BIT(1),        /* INHIBIT I22 MSG        @YM5001*/ 02743000
*         5 * BIT(2),               /* RESERVED               @YM5001*/ 02744000
*       3 VCTRECVA FIXED(16),       /* SADMP RECOVERY DUMP ASID      */ 02745000
*       3 VCTMDCE PTR(31),          /* MDCE PTR                      */ 02746000
*       3 VCTSTOR PTR(31),          /* SEGMENT TABLE ORIGIN FOR 02S0074 02747000
*                                      MEMORY SWITCH                 */ 02748000
*       3 VCTDSCE PTR(31),          /* DSCE PTR                      */ 02749000
*       3 VCTBCTH PTR(31),          /* BCTH PTR                      */ 02750000
*       3 VCTBCTC PTR(31),          /* CURRENT BCT PTR               */ 02751000
*       3 VCTIODB PTR(31),          /* IODB PTR                      */ 02752000
*       3 VCTARB PTR(31),           /* ARB PTR                       */ 02753000
*       3 VCTSUBPL PTR(31),         /* SUBPOOL DUMP LIST POINTER     */ 02754000
*       3 VCTWKHI PTR(8),           /* NUMBER OF RECORDS ON WORKFILE */ 02755000
*       3 VCTWKC PTR(8),            /* CURRENT POSITION OF WORKFILE  */ 02756000
*       3 VCTCPUC FIXED(15),        /* CURRENT CPU ADDRESS           */ 02757000
*       3 VCTASCB PTR(31),          /* CURRENT ASCB ADDRESS IN  02S0074 02758000
*                                      PROCESS                       */ 02759000
*       3 * PTR(31),                /* UNUSED                @Z40WI3F*/ 02760000
*       3 VCTPTRT PTR(31),          /* ADDR OF PTRT                  */ 02761000
*       3 VCTASID FIXED(16),        /* CURRENT ASID                  */ 02762000
*       3 VCTAUDIT FIXED(15),       /* ERROR CODE FOR INVOKING  02S0074 02763000
*                                      AMDSAAUD FOR A DUMP           */ 02764000
*       3 VCTCBID CHAR(8),          /* SYSTEM CONTROL BLOCK IN USE   */ 02765000
*         5 * CHAR(7),                                          02S0074 02766000
*         5 VCTCBIDN PTR(8),        /* CONTROL BLOCK ID              */ 02767000
*       3 VCTJBNME CHAR(8),         /* JOBNAME CURRENTLY BEING  02S0074 02768000
*                                      PROCESSED                     */ 02769000
*       3 VCTCBADR PTR(31),         /* ADDRESS OF SYSTEM CONTROL        02770000
*                                      BLOCK IN USE                  */ 02771000
*       3 VCTLPA PTR(31),           /* ADDRESS OF LPA FOR RELOCATION */ 02772000
*       3 VCTPGT PTR(31),           /* ADDRESS OF SADMP PAGE TABLE   */ 02773000
*       3 VCTSVCTB PTR(31),         /* ADDRESS OF SVCSADMP TABLE     */ 02774000
*       3 VCTCPOUT PTR(31),         /* ADDRESS OF CURRENT OUTPUT        02775000
*                                      CHANNEL PROGRAM               */ 02776000
*       3 VCTEXTRA FIXED(15),       /* NUMBER OF PAGES USED ABOVE 1     02777000
*                                      SEGMENT                       */ 02778000
*       3 * FIXED(15),              /* RESERVED                      */ 02779000
*       3 VCTCCTV PTR(31),          /* VIRTUAL ADDRESS OF CCT        */ 02780000
*       3 VCTVCCTV PTR(31);         /* VIRTUAL ADDRESS OF VCCT       */ 02781000
*   DCL                                                         02S0075 02782000
*     1 SDL BASED,                  /* SUBPOOL DUMP LIST             */ 02783000
*       3 SDLNUM PTR(8),            /* NUMBER OF ENTRIES             */ 02784000
*       3 SDLSPN PTR(8);            /* SUBPOOL NUMBER TO BE DUMPED   */ 02785000
*                                                               02S0075 02786000
*   /*****************************************************************/ 02787000
*   /*                                                               */ 02788000
*   /* REGISTER DECLARES                                             */ 02789000
*   /*                                                               */ 02790000
*   /*****************************************************************/ 02791000
*                                                               02S0076 02792000
*   DCL                                                         02S0076 02793000
*     RETREG REG(14) PTR(31);       /* RETURN REGISTER               */ 02794000
*   DCL                                                         02S0077 02795000
*     RETCODE REG(15) FIXED(31);    /* RETURN CODE REGISTER          */ 02796000
*   DCL                                                         02S0078 02797000
*     BASEREG REG(11) PTR(31) RESTRICTED;/* BASE REGISTER            */ 02798000
*   DCL                                                         02S0079 02799000
*     VCCTREG REG(12) PTR(31) RESTRICTED;/* VCCT ADDRESS             */ 02800000
*   DCL                                                         02S0080 02801000
*     R0 REG(0) PTR(31);                                        02S0080 02802000
*   DCL                                                         02S0081 02803000
*     R1 REG(1) PTR(31);                                        02S0081 02804000
*   DCL                                                         02S0082 02805000
*     R2 REG(2) PTR(31);                                        02S0082 02806000
*   DCL                                                         02S0083 02807000
*     R3 REG(3) PTR(31);                                        02S0083 02808000
*   DCL                                                         02S0084 02809000
*     R4 REG(4) PTR(31);                                        02S0084 02810000
*   DCL                                                         02S0085 02811000
*     R5 REG(5) PTR(31);                                        02S0085 02812000
*   DCL                                                         02S0086 02813000
*     R6 REG(6) PTR(31);                                        02S0086 02814000
*   DCL                                                         02S0087 02815000
*     R7 REG(7) PTR(31);                                        02S0087 02816000
*   DCL                                                         02S0088 02817000
*     R8 REG(8) PTR(31);                                        02S0088 02818000
*   DCL                                                         02S0089 02819000
*     R9 REG(9) PTR(31);                                        02S0089 02820000
*   DCL                                                         02S0090 02821000
*     R10 REG(10) PTR(31);                                      02S0090 02822000
*   DCL                                                         02S0091 02823000
*     R11 REG(11) PTR(31);                                      02S0091 02824000
*   DCL                                                         02S0092 02825000
*     R12 REG(12) PTR(31);                                      02S0092 02826000
*   DCL                                                         02S0093 02827000
*     R13 REG(13) PTR(31);                                      02S0093 02828000
*   DCL                                                         02S0094 02829000
*     R14 REG(14) PTR(31);                                      02S0094 02830000
*   DCL                                                         02S0095 02831000
*     R15 REG(15) PTR(31);                                      02S0095 02832000
*                                                               02S0095 02833000
*   /*****************************************************************/ 02834000
*   /*                                                               */ 02835000
*   /* SAVE AREA FORMATS                                             */ 02836000
*   /*                                                               */ 02837000
*   /*****************************************************************/ 02838000
*                                                               02S0096 02839000
*   DCL                                                         02S0096 02840000
*     1 REGLOCAL BDY(WORD) BASED,   /* FORMAT OF LOW CORE SAVE AREAS */ 02841000
*       3 REGL0 PTR(31),                                        02S0096 02842000
*       3 REGL1 PTR(31),                                        02S0096 02843000
*       3 REGL2 PTR(31),                                        02S0096 02844000
*       3 REGL3 PTR(31),                                        02S0096 02845000
*       3 REGL4 PTR(31),                                        02S0096 02846000
*       3 REGL5 PTR(31),                                        02S0096 02847000
*       3 REGL6 PTR(31),                                        02S0096 02848000
*       3 REGL7 PTR(31),                                        02S0096 02849000
*       3 REGL8 PTR(31),                                        02S0096 02850000
*       3 REGL9 PTR(31),                                        02S0096 02851000
*       3 REGL10 PTR(31),                                       02S0096 02852000
*       3 REGL11 PTR(31),                                       02S0096 02853000
*       3 REGL12 PTR(31),                                       02S0096 02854000
*       3 REGL13 PTR(31),                                       02S0096 02855000
*       3 REGL14 PTR(31),                                       02S0096 02856000
*       3 REGL15 PTR(31);                                       02S0096 02857000
*   DCL                                                         02S0097 02858000
*     1 SAVEFORM BDY(WORD) BASED(R13),/* FORMAT OF STANDARD SAVE AREA*/ 02859000
*       3 SAVEID CHAR(1),                                       02S0097 02860000
*       3 SAVENAME CHAR(3),         /* MODULE NAME - LAST 3 CHARS    */ 02861000
*       3 SAVEBACK PTR(31),         /* PREVIOUS SAVE AREA            */ 02862000
*       3 SAVENEXT PTR(31),         /* NEXT SAVE AREA                */ 02863000
*       3 SAVER14 PTR(31),                                      02S0097 02864000
*       3 SAVER15 PTR(31),                                      02S0097 02865000
*       3 SAVER0 PTR(31),                                       02S0097 02866000
*       3 SAVER1 PTR(31),                                       02S0097 02867000
*       3 SAVER2 PTR(31),                                       02S0097 02868000
*       3 SAVER3 PTR(31),                                       02S0097 02869000
*       3 SAVER4 PTR(31),                                       02S0097 02870000
*       3 SAVER5 PTR(31),                                       02S0097 02871000
*       3 SAVER6 PTR(31),                                       02S0097 02872000
*       3 SAVER7 PTR(31),                                       02S0097 02873000
*       3 SAVER8 PTR(31),                                       02S0097 02874000
*       3 SAVER9 PTR(31),                                       02S0097 02875000
*       3 SAVER10 PTR(31),                                      02S0097 02876000
*       3 SAVER11 PTR(31),                                      02S0097 02877000
*       3 SAVER12 PTR(31);                                      02S0097 02878000
*                                                               02S0097 02879000
*   /*****************************************************************/ 02880000
*   /*                                                               */ 02881000
*   /* MISCELLANEOUS CONSTANTS                                       */ 02882000
*   /*                                                               */ 02883000
*   /*****************************************************************/ 02884000
*                                                               02S0098 02885000
*   DCL                                                         02S0098 02886000
*     CCTADDR PTR(31) CONSTANT(28672);/* ADDR OF CCT ('7000'X)       */ 02887000
*   DCL                                                         02S0099 02888000
*     PGEMASK BIT(8) CONSTANT('01'X);/* SYSTEM MASK-ENABLED FOR 02S0099 02889000
*                                      EXTERNAL INTERRUPTS ONLY, DAT    02890000
*                                      OFF                           */ 02891000
*   DCL                                                         02S0100 02892000
*     DATMASK BIT(8) CONSTANT('05'X);/* SYSTEM MASK-ENABLED FOR 02S0100 02893000
*                                      EXTERNAL INTERRUPTS ONLY, DAT    02894000
*                                      ON                            */ 02895000
*   DCL                                                         02S0101 02896000
*     NUMSEG FIXED(31) CONSTANT(256);/* NUMBER OF SEGMENTS IN SYSTEM */ 02897000
*   DCL                                                         02S0102 02898000
*     ON BIT(1) CONSTANT('1'B);     /* SWITCH ON                     */ 02899000
*   DCL                                                         02S0103 02900000
*     OFF BIT(1) CONSTANT('0'B);    /* SWITCH OFF                    */ 02901000
*                                                               02S0103 02902000
*   /*****************************************************************/ 02903000
*   /*                                                               */ 02904000
*   /* SVC NUMBERS                                                   */ 02905000
*   /*                                                               */ 02906000
*   /*****************************************************************/ 02907000
*                                                               02S0104 02908000
*   DCL                                                         02S0104 02909000
*     SIOSVC FIXED(15) CONSTANT(0); /* SVC NUMBER FOR AMDSASIO       */ 02910000
*   DCL                                                         02S0105 02911000
*     WATSVC FIXED(15) CONSTANT(1); /* SVC NUMBER FOR AMDSAWAT       */ 02912000
*   DCL                                                         02S0106 02913000
*     TAPSVC FIXED(15) CONSTANT(2); /* SVC NUMBER FOR AMDSATAP       */ 02914000
*   DCL                                                         02S0107 02915000
*     CONSVC FIXED(15) CONSTANT(3); /* SVC NUMBER FOR AMDSACON       */ 02916000
*   DCL                                                         02S0108 02917000
*     GTMSVC FIXED(15) CONSTANT(4); /* SVC NUMBER FOR AMDSAGTM       */ 02918000
*   DCL                                                         02S0109 02919000
*     FRMSVC FIXED(15) CONSTANT(5); /* SVC NUMBER FOR AMDSAFRM       */ 02920000
*   DCL                                                         02S0110 02921000
*     ASMSVC FIXED(15) CONSTANT(6); /* SVC NUMBER FOR AMDSAASM       */ 02922000
*   DCL                                                         02S0111 02923000
*     ERMSVC FIXED(15) CONSTANT(7); /* SVC NUMBER FOR AMDSAERM       */ 02924000
*   DCL                                                         02S0112 02925000
*     SINSVC FIXED(15) CONSTANT(8); /* SVC NUMBER FOR AMDSASIN       */ 02926000
*   DCL                                                         02S0113 02927000
*     UPDSVC FIXED(15) CONSTANT(9); /* SVC NUMBER FOR AMDSAUPD       */ 02928000
*   DCL                                                         02S0114 02929000
*     TERSVC FIXED(15) CONSTANT(10);/* SVC NUMBER FOR AMDSATER       */ 02930000
*   DCL                                                         02S0115 02931000
*     CSASVC FIXED(15) CONSTANT(11);/* SVC NUMBER FOR AMDSACSA       */ 02932000
*   DCL                                                         02S0116 02933000
*     AIDSVC FIXED(15) CONSTANT(12);/* SVC NUMBER FOR AMDSAAID       */ 02934000
*   DCL                                                         02S0117 02935000
*     AUDSVC FIXED(15) CONSTANT(13);/* SVC NUMBER FOR AMDSAAUD       */ 02936000
*   DCL                                                         02S0118 02937000
*     BUFSVC FIXED(15) CONSTANT(14);/* SVC NUMBER FOR AMDSABUF       */ 02938000
*   DCL                                                         02S0119 02939000
*     DERSVC FIXED(15) CONSTANT(15);/* SVC NUMBER FOR AMDSADER       */ 02940000
*   DCL                                                         02S0120 02941000
*     ARDSVC FIXED(15) CONSTANT(16);/* SVC NUMBER FOR AMDSAARD       */ 02942000
*   DCL                                                         02S0121 02943000
*     MDMSVC FIXED(15) CONSTANT(17);/* SVC NUMBER FOR AMDSAMDM       */ 02944000
*   DCL                                                         02S0122 02945000
*     RSMSVC FIXED(15) CONSTANT(18);/* SVC NUMBER FOR AMDSARSM       */ 02946000
*   DCL                                                         02S0123 02947000
*     AMRSVC FIXED(15) CONSTANT(19);/* SVC NUMBER FOR AMDSAAMR       */ 02948000
*   DCL                                                         02S0124 02949000
*     ERBSVC FIXED(15) CONSTANT(20);/* SVC NUMBER FOR AMDSAERB       */ 02950000
*   DCL                                                         02S0125 02951000
*     ERPSVC FIXED(15) CONSTANT(21);/* SVC NUMBER FOR AMDSAERP       */ 02952000
*   DCL                                                         02S0126 02953000
*     GTFSVC FIXED(15) CONSTANT(22);/* SVC NUMBER FOR AMDSAGTF       */ 02954000
*   DCL                                                         02S0127 02955000
*     ERISVC FIXED(15) CONSTANT(23);/* SVC NUMBER FOR AMDSAERI       */ 02956000
*   DCL                                                         02S0128 02957000
*     UCBSVC FIXED(15) CONSTANT(24);/* SVC NUMBER FOR AMDSAUCB       */ 02958000
*   DCL                                                         02S0129 02959000
*     VCKSVC FIXED(15) CONSTANT(25);/* SVC NUMBER FOR AMDSAVCK       */ 02960000
*   DCL                                                         02S0130 02961000
*     SPQSVC FIXED(15) CONSTANT(26);/* SVC NUMBER FOR AMDSASPQ       */ 02962000
*   DCL                                                         02S0131 02963000
*     IOBSVC FIXED(15) CONSTANT(27);/* SVC NUMBER FOR AMDSAIOB       */ 02964000
*   DCL                                                         02S0132 02965000
*     BINSVC FIXED(15) CONSTANT(28);/* SVC NUMBER FOR AMDSABIN       */ 02966000
*   DCL                                                         02S0133 02967000
*     INRSVC FIXED(15) CONSTANT(29);/* SVC NUMBER FOR AMDSAINR       */ 02968000
*   DCL                                                         02S0134 02969000
*     VRTSVC FIXED(15) CONSTANT(30);/* SVC NUMBER FOR AMDSAVRT       */ 02970000
*                                                               02S0134 02971000
*   /*****************************************************************/ 02972000
*   /*                                                               */ 02973000
*   /* MESSAGE IDS                                                   */ 02974000
*   /*                                                               */ 02975000
*   /*****************************************************************/ 02976000
*                                                               02S0135 02977000
*   DCL                                                         02S0135 02978000
*     AMD002I BIT(8) CONSTANT('02'X);/* REFERENCE FOR MESSAGE        */ 02979000
*   DCL                                                         02S0136 02980000
*     AMD004A BIT(8) CONSTANT('04'X);/* REFERENCE FOR MESSAGE        */ 02981000
*   DCL                                                         02S0137 02982000
*     AMD010I BIT(8) CONSTANT('0A'X);/* REFERENCE FOR MESSAGE        */ 02983000
*   DCL                                                         02S0138 02984000
*     AMD012D BIT(8) CONSTANT('0C'X);/* REFERENCE FOR MESSAGE        */ 02985000
*   DCL                                                         02S0139 02986000
*     AMD014A BIT(8) CONSTANT('0E'X);/* REFERENCE FOR MESSAGE        */ 02987000
*   DCL                                                         02S0140 02988000
*     AMD015I BIT(8) CONSTANT('0F'X);/* REFERENCE FOR MESSAGE        */ 02989000
*   DCL                                                         02S0141 02990000
*     AMD016I BIT(8) CONSTANT('10'X);/* REFERENCE FOR MESSAGE        */ 02991000
*   DCL                                                         02S0142 02992000
*     AMD017I BIT(8) CONSTANT('11'X);/* REFERENCE FOR MESSAGE        */ 02993000
*   DCL                                                         02S0143 02994000
*     AMD018I BIT(8) CONSTANT('12'X);/* REFERENCE FOR MESSAGE        */ 02995000
*   DCL                                                         02S0144 02996000
*     AMD019A BIT(8) CONSTANT('13'X);/* REFERENCE FOR MESSAGE        */ 02997000
*   DCL                                                         02S0145 02998000
*     AMD020A BIT(8) CONSTANT('14'X);/* REFERENCE FOR MESSAGE        */ 02999000
*   DCL                                                         02S0146 03000000
*     AMD022I BIT(8) CONSTANT('16'X);/* REFERENCE FOR MESSAGE        */ 03001000
*   DCL                                                         02S0147 03002000
*     AMD023I BIT(8) CONSTANT('17'X);/* REFERENCE FOR MESSAGE        */ 03003000
*   DCL                                                         02S0148 03004000
*     AMD025I BIT(8) CONSTANT('19'X);/* REFERENCE FOR MESSAGE        */ 03005000
*   DCL                                                         02S0149 03006000
*     AMD029D BIT(8) CONSTANT('1D'X);/* REFERENCE FOR MESSAGE        */ 03007000
*   DCL                                                         02S0150 03008000
*     AMD030I BIT(8) CONSTANT('1E'X);/* REFERENCE FOR MESSAGE        */ 03009000
*   DCL                                                         02S0151 03010000
*     AMD031I BIT(8) CONSTANT('1F'X);/* REFERENCE FOR MESSAGE        */ 03011000
*   DCL                                                         02S0152 03012000
*     AMD032I BIT(8) CONSTANT('20'X);/* REFERENCE FOR MESSAGE        */ 03013000
*   DCL                                                         02S0153 03014000
*     AMD033I BIT(8) CONSTANT('21'X);/* REFERENCE FOR MESSAGE        */ 03015000
*   DCL                                                         02S0154 03016000
*     AMD034I BIT(8) CONSTANT('22'X);/* REFERENCE FOR MESSAGE        */ 03017000
*   DCL                                                         02S0155 03018000
*     MSGCR FIXED(8) CONSTANT(0);   /* COMMAND REJECT ID             */ 03019000
*   DCL                                                         02S0156 03020000
*     MSGIR FIXED(8) CONSTANT(1);   /* INTV REQUIRED ID              */ 03021000
*   DCL                                                         02S0157 03022000
*     MSGBOC FIXED(8) CONSTANT(2);  /* BUS OUT CK ID                 */ 03023000
*   DCL                                                         02S0158 03024000
*     MSGEC FIXED(8) CONSTANT(3);   /* EQUIPMENT CK ID               */ 03025000
*   DCL                                                         02S0159 03026000
*     MSGDC FIXED(8) CONSTANT(4);   /* DATA CK ID                    */ 03027000
*   DCL                                                         02S0160 03028000
*     MSGOR FIXED(8) CONSTANT(5);   /* OVERRUN ID                    */ 03029000
*   DCL                                                         02S0161 03030000
*     MSGTCC FIXED(8) CONSTANT(6);  /* TCC ID                        */ 03031000
*   DCL                                                         02S0162 03032000
*     MSGSCK FIXED(8) CONSTANT(7);  /* SEEK CK ID                    */ 03033000
*   DCL                                                         02S0163 03034000
*     MSGPE FIXED(8) CONSTANT(8);   /* PERMANENT ERR ID              */ 03035000
*   DCL                                                         02S0164 03036000
*     MSGEOC FIXED(8) CONSTANT(10); /* END OF CYL ID                 */ 03037000
*   DCL                                                         02S0165 03038000
*     MSGEDP FIXED(8) CONSTANT(11); /* ENV DATA ID                   */ 03039000
*   DCL                                                         02S0166 03040000
*     MSGNRF FIXED(8) CONSTANT(12); /* NO RCD FOUND ID               */ 03041000
*   DCL                                                         02S0167 03042000
*     MSGFP FIXED(8) CONSTANT(13);  /* FILE PROT ID                  */ 03043000
*   DCL                                                         02S0168 03044000
*     MSGOI FIXED(8) CONSTANT(14);  /* OPER INCOMP ID                */ 03045000
*   DCL                                                         02S0169 03046000
*     MSGMAM FIXED(8) CONSTANT(15); /* MISS ADDR ID                  */ 03047000
*   DCL                                                         02S0170 03048000
*     MSGATTN FIXED(8) CONSTANT(16);/* ATTENTION ID                  */ 03049000
*   DCL                                                         02S0171 03050000
*     MSGSTM FIXED(8) CONSTANT(17); /* STATUS MOD ID                 */ 03051000
*   DCL                                                         02S0172 03052000
*     MSGCUE FIXED(8) CONSTANT(18); /* CONTROL UNIT END ID           */ 03053000
*   DCL                                                         02S0173 03054000
*     MSGBUSY FIXED(8) CONSTANT(19);/* BUSY ID                       */ 03055000
*   DCL                                                         02S0174 03056000
*     MSGUE FIXED(8) CONSTANT(20);  /* UNIT EXCEPTION ID             */ 03057000
*   DCL                                                         02S0175 03058000
*     MSGPCI FIXED(8) CONSTANT(21); /* PCI ID                        */ 03059000
*   DCL                                                         02S0176 03060000
*     MSGIL FIXED(8) CONSTANT(22);  /* INCORRECT LNG ID              */ 03061000
*   DCL                                                         02S0177 03062000
*     MSGPCK FIXED(8) CONSTANT(23); /* PROG CK ID                    */ 03063000
*   DCL                                                         02S0178 03064000
*     MSGPTK FIXED(8) CONSTANT(24); /* PROT CK ID                    */ 03065000
*   DCL                                                         02S0179 03066000
*     MSGCDC FIXED(8) CONSTANT(25); /* CHAN DATA CK ID               */ 03067000
*   DCL                                                         02S0180 03068000
*     MSGCCC FIXED(8) CONSTANT(26); /* CHAN CTL CK ID                */ 03069000
*   DCL                                                         02S0181 03070000
*     MSGICC FIXED(8) CONSTANT(27); /* ICC ID                        */ 03071000
*   DCL                                                         02S0182 03072000
*     MSGCC FIXED(8) CONSTANT(28);  /* CHAINING CK ID                */ 03073000
*   DCL                                                         02S0183 03074000
*     MSGUNK FIXED(8) CONSTANT(29); /* UNKNOWN ERR ID                */ 03075000
*   DCL                                                         02S0184 03076000
*     MSGERS FIXED(8) CONSTANT(30); /* ERR ON SENSE ID               */ 03077000
*   DCL                                                         02S0185 03078000
*     MSGERR FIXED(8) CONSTANT(31); /* ERR IN ERR REC ID             */ 03079000
*   DCL                                                         02S0186 03080000
*     MSGBLF FIXED(8) CONSTANT(32); /* BUFFERED LOG FULL ID          */ 03081000
*   DCL                                                         02S0187 03082000
*     MSGITF FIXED(8) CONSTANT(33); /* INVALID TRACK FORMAT ID       */ 03083000
*   DCL                                                         02S0188 03084000
*     MSGLP FIXED(8) CONSTANT(34);  /* LOAD POINT ID                 */ 03085000
*   DCL                                                         02S0189 03086000
*     MSGDCC FIXED(8) CONSTANT(35); /* DATA CONV CK ID               */ 03087000
*   DCL                                                         02S0190 03088000
*     MSGNC FIXED(8) CONSTANT(36);  /* NOT CAPABLE ID                */ 03089000
*   DCL                                                         02S0191 03090000
*     MSGPEID FIXED(8) CONSTANT(37);/* PEID BURST CK ID              */ 03091000
*                                                               02S0191 03092000
*   /*****************************************************************/ 03093000
*   /*                                                               */ 03094000
*   /* CONTROL BLOCK IDS FOR VALIDITY CHECKING                       */ 03095000
*   /*                                                               */ 03096000
*   /*****************************************************************/ 03097000
*                                                               02S0192 03098000
*   DCL                                                         02S0192 03099000
*     VSPCTID PTR(8) CONSTANT(1);   /* SPCT ID               @Z40WI3F*/ 03100000
*   DCL                                                         02S0193 03101000
*     VASCBID PTR(8) CONSTANT(2);   /* ASCB ID                       */ 03102000
*   DCL                                                         02S0194 03103000
*     VASXBID PTR(8) CONSTANT(3);   /* ASXB ID                       */ 03104000
*   DCL                                                         02S0195 03105000
*     VASVTID PTR(8) CONSTANT(4);   /* ASVT ID                       */ 03106000
*   DCL                                                         02S0196 03107000
*     VCVTID PTR(8) CONSTANT(5);    /* CVT ID                        */ 03108000
*   DCL                                                         02S0197 03109000
*     VEDBID PTR(8) CONSTANT(6);    /* EDB ID                        */ 03110000
*   DCL                                                         02S0198 03111000
*     VDQEID PTR(8) CONSTANT(7);    /* DQE ID                        */ 03112000
*   DCL                                                         02S0199 03113000
*     VBCBID PTR(8) CONSTANT(8);    /* GTFBCB ID                     */ 03114000
*   DCL                                                         02S0200 03115000
*     VMCCEID PTR(8) CONSTANT(9);   /* MCCE ID                       */ 03116000
*   DCL                                                         02S0201 03117000
*     VMCQEID PTR(8) CONSTANT(10);  /* MCQE ID                       */ 03118000
*   DCL                                                         02S0202 03119000
*     VSPQEID PTR(8) CONSTANT(11);  /* SPQE ID                       */ 03120000
*   DCL                                                         02S0203 03121000
*     VPARTID PTR(8) CONSTANT(12);  /* PART ID               @Z40WI3F*/ 03122000
*   DCL                                                         02S0204 03123000
*     VSGTID PTR(8) CONSTANT(13);   /* SEGMENT TABLE ID              */ 03124000
*   DCL                                                         02S0205 03125000
*     VRSMHID PTR(8) CONSTANT(14);  /* RSM HEADER ID                 */ 03126000
*   DCL                                                         02S0206 03127000
*     VLPMBID PTR(8) CONSTANT(15);  /* LPMB ID                       */ 03128000
*   DCL                                                         02S0207 03129000
*     VUCBID PTR(8) CONSTANT(16);   /* UCB ID                        */ 03130000
*   DCL                                                         02S0208 03131000
*     VASMVTID PTR(8) CONSTANT(17); /* ASMVT ID                      */ 03132000
*   DCL                                                         02S0209 03133000
*     VTCBID PTR(8) CONSTANT(18);   /* TCB ID                        */ 03134000
*   DCL                                                         02S0210 03135000
*     VSARTID PTR(8) CONSTANT(19);  /* SART ID               @Z40WI3F*/ 03136000
*   DCL                                                         02S0211 03137000
*     VPVTID PTR(8) CONSTANT(20);   /* PVT ID                        */ 03138000
*                                                               02S0211 03139000
*   /*****************************************************************/ 03140000
*   /*                                                               */ 03141000
*   /* SUPPORTED DEVICE TYPE IDENTIFIERS                             */ 03142000
*   /*                                                               */ 03143000
*   /*****************************************************************/ 03144000
*                                                               02S0212 03145000
*   DCL                                                         02S0212 03146000
*     DT2314 BIT(8) CONSTANT('08'X);/* 2314                          */ 03147000
*   DCL                                                         02S0213 03148000
*     DT3330 BIT(8) CONSTANT('09'X);/* 3330                          */ 03149000
*   DCL                                                         02S0214 03150000
*     DT33301 BIT(8) CONSTANT('0D'X);/* 3330-1                       */ 03151000
*   DCL                                                         02S0215 03152000
*     DT23051 BIT(8) CONSTANT('06'X);/* 2305-1                       */ 03153000
*   DCL                                                         02S0216 03154000
*     DT23052 BIT(8) CONSTANT('07'X);/* 2305-2                       */ 03155000
*   DCL                                                         02S0217 03156000
*     DT3340 BIT(8) CONSTANT('0A'X);/* 3340                          */ 03157000
*   DCL                                                         02S0218 03158000
*     DT3350 BIT(8) CONSTANT('0B'X);/* 3350                  @Z30RSTA*/ 03159000
*                                                               01S0219 03160000
*   /*****************************************************************/ 03161000
*   /*                                                               */ 03162000
*   /* LOCAL DECLARES - DEFAULT TO AUTOMATIC                         */ 03163000
*   /*                                                               */ 03164000
*   /*****************************************************************/ 03165000
*                                                               01S0219 03166000
*   DCL                                                         01S0219 03167000
*     1 ASMSWTCH BIT(8) INIT('00'X),/* SWITCHES                      */ 03168000
*       3 ASMINIT BIT(1);           /* ASM INITIALIZATION COMPLETE   */ 03169000
*   DCL                                                         01S0220 03170000
*     IODBDA EXTERNAL NONLOCAL;     /* DIRECT ACCESS IODB            */ 03171000
*   DCL                                                         01S0221 03172000
*     1 ASMRCB CHAR(LENGTH(RCB)) BDY(WORD),/* RCB                    */ 03173000
*       3 * PTR(31),                                            01S0221 03174000
*       3 ASMRSTOR PTR(31),         /* CURRENT SEG TBL               */ 03175000
*       3 *(3) PTR(31);                                         01S0221 03176000
*   DCL                                                         01S0222 03177000
*     ASMBUFTP FIXED(8);            /* SAVE AREA FOR CTBUFTYP        */ 03178000
*   DCL                                                         01S0223 03179000
*     CVTPTR PTR(31) LOCATION(16);  /* CVT ADDRESS                   */ 03180000
*   DCL                                                         01S0224 03181000
*     ASMVTPTR PTR(31) DEFINED(CVTASMVT);/* ASMVT ADDRESS IN CVT     */ 03182000
*   DCL                                                         01S0225 03183000
*     SAREPTR PTR(31);              /* SART ENTRY POINTER    @Z40WI3F*/ 03184000
*   DCL                                                         01S0226 03185000
*     PAREPTR PTR(31);              /* PART ENTRY POINTER    @Z40WI3F*/ 03186000
*   DCL                                                         01S0227 03187000
*     PARTPTR PTR(31) DEFINED(ASMPART);/* PART POINTER       @Z40WI3F*/ 03188000
*   DCL                                                         01S0228 03189000
*     SARTPTR PTR(31) DEFINED(ASMSART);/* SART POINTER       @Z40WI3F*/ 03190000
*   DCL                                                         01S0229 03191000
*     PAGESIZE FIXED(31) CONSTANT(4096);/* PAGE SIZE         @Z40WI3F*/ 03192000
*   DCL                                                         01S0230 03193000
*     EDBPTR PTR(31);               /* EDB POINTER           @Z40WI3F*/ 03194000
*   DCL                                                         01S0231 03195000
*     UCBPTR PTR(31);               /* UCB POINTER           @Z40WI3F*/ 03196000
*   DCL                                                         01S0232 03197000
*     CONVOUT CHAR(8);              /* CONVERT ROUTINE WILL PUT CCHHR   03198000
*                                      IN THIS VARIABLE      @Z40WI3F*/ 03199000
*                                                               01S0233 03200000
*   /*****************************************************************/ 03201000
*   /*                                                               */ 03202000
*   /* OBTAIN WORK AREA. SET UP SAVE AREA AND RCB.                   */ 03203000
*   /*                                                               */ 03204000
*   /*****************************************************************/ 03205000
*                                                               01S0233 03206000
*/*AMDSAASM: CHART (SEQ)                                             */ 03207000
*/*HEADER                                                       01S0233 03208000
*/*AMDSAASM   AUXILIARY STORAGE MANAGEMENT (ASM) INTERFACE ROUTINE      03209000
*/*                                                     PAGE #       */ 03210000
*/*AMDSAASM: E AMDSAASM                                              */ 03211000
*/* N EXECUTES IN MASTER MEMORY                                      */ 03212000
*/* N RECEIVES NO INPUT                                              */ 03213000
*/* P OBSERVE STANDARD LINKAGE CONVENTIONS (NO SAVE AREA)            */ 03214000
*/* L  AMDSAGTM:  OBTAIN SAVE/WORK AREA                              */ 03215000
*/* D (NO,,YES,%ASMSTOR) RC  =  0                                    */ 03216000
*/* P SET RETURN CODE OF 4                                           */ 03217000
*/* R RETURN TO CALLER                                               */ 03218000
*/*%ASMSTOR: P INITIALIZE SAVE AREA                                  */ 03219000
*/* P SAVE ORIGINAL BUFFER REQUEST                                   */ 03220000
*/* P SET ASM BUFFER FLAGS                                           */ 03221000
*/* P CREATE RCB IN WORK AREA                                        */ 03222000
*/* P (NORM,,RCB,ASMEXIT) QUEUE RCB TO VCTRCB                        */ 03223000
*                                                               01S0233 03224000
*   RESPECIFY                                                   01S0233 03225000
*     CCT BASED(VCTCCTV);                                       01S0233 03226000
*   RESPECIFY                                                   01S0234 03227000
*     RCB BASED(ADDR(ASMRCB));                                  01S0234 03228000
*   RESPECIFY                                                   01S0235 03229000
*     IODB BASED(ADDR(IODBDA)+VCTLPA);                          01S0235 03230000
*   RESPECIFY                                                   01S0236 03231000
*     BCT BASED(IODBBCT+VCTLPA);                                01S0236 03232000
*   RESPECIFY                                                   01S0237 03233000
*    (R1,                                                       01S0237 03234000
*     R8,                                                       01S0237 03235000
*     R13,                                                      01S0237 03236000
*     RETCODE) RESTRICTED;                                      01S0237 03237000
*   SVC(GTMSVC);                    /* CALL AMDSAGTM FOR STORAGE     */ 03238000
         SVC   4                                                01S0238 03239000
*   IF RETCODE^=0 THEN              /* STORAGE OBTAINED              */ 03240000
         LTR   RETCODE,RETCODE                                  01S0239 03241000
         BZ    @RF00239                                         01S0239 03242000
*     DO;                           /* NO - ERROR                    */ 03243000
*       GENERATE REFS(R13,RETREG,RETCODE) SETS(R14,R12);        01S0241 03244000
         LM    R14,R12,12(R13)         RESTORE REGISTERS                03245000
         LA    RETCODE,4               SET ERROR RETURN CODE            03246000
         BR    RETREG                  RETURN TO CALLER                 03247000
*     END;                                                      01S0242 03248000
*   R8=R1;                          /* SAVE ADDRESS OF STORAGE       */ 03249000
@RF00239 LR    R8,R1                                            01S0243 03250000
*   GENERATE REFS(R8,R13) SETS(R15);                            01S0244 03251000
         USING @DATD,R8                                                 03252000
         ST    R13,@SA00001+4         SAVE CALLERS SAVE AREA            03253000
         LA    R15,@SA00001           GET ADDRESS OF SAVE AREA          03254000
*   SAVENEXT=R15;                   /* LINK TO CALLERS SAVE AREA     */ 03255000
         ST    R15,SAVENEXT(,R13)                               01S0245 03256000
*   R13=R15;                        /* MAKE SAVE AREA CURRENT        */ 03257000
         LR    R13,R15                                          01S0246 03258000
*   SAVENAME='ASM';                 /* MODULE ID TO SAVE AREA        */ 03259000
         MVC   SAVENAME(3,R13),@CC01611                         01S0247 03260000
*   RESPECIFY                                                   01S0248 03261000
*    (R1,                                                       01S0248 03262000
*     RETCODE) UNRESTRICTED;                                    01S0248 03263000
*   ASMBUFTP=CTBUFTYP;              /* SAVE BUFFER REQUEST FLAGS     */ 03264000
         L     @10,VCTCCTV(,VCCTREG)                            01S0249 03265000
         SLR   ASMBUFTP,ASMBUFTP                                01S0249 03266000
         IC    ASMBUFTP,CTBUFTYP(,@10)                          01S0249 03267000
*   CTBUFTYP=OFF;                   /* RESET BUFFER REQUEST FLAGS    */ 03268000
         MVI   CTBUFTYP(@10),B'00000000'                        01S0250 03269000
*   CTASM=ON;                       /* REQUEST ASM BUFFERS           */ 03270000
         OI    CTASM(@10),B'00010000'                           01S0251 03271000
*   RCBNEXT=VCTRCB;                 /* GET CURRENT RCB               */ 03272000
         LA    @10,ASMRCB                                       01S0252 03273000
         MVC   RCBNEXT(4,@10),VCTRCB(VCCTREG)                   01S0252 03274000
*   RCBBASE=BASEREG;                /* SAVE BASE REG IN RCB          */ 03275000
         ST    BASEREG,RCBBASE(,@10)                            01S0253 03276000
*   RCBEXIT=ADDR(ASMEXIT);          /* EXIT ADDR TO RCB              */ 03277000
         LA    @09,ASMEXIT                                      01S0254 03278000
         ST    @09,RCBEXIT(,@10)                                01S0254 03279000
*   RCBSAVE=R13;                    /* SAVE AREA ADDR TO RCB         */ 03280000
         ST    R13,RCBSAVE(,@10)                                01S0255 03281000
*   GENERATE REFS(R1) SETS(ASMRSTOR)(STCTL R1,R1,ASMRSTOR);/* CURRENT   03282000
*                                      SEGMENT TABLE ADDRESS TO RCB  */ 03283000
         STCTL R1,R1,ASMRSTOR                                           03284000
*   VCTRCB=ADDR(ASMRCB);            /* MAKE RCB ACTIVE               */ 03285000
         LA    @10,ASMRCB                                       01S0257 03286000
         ST    @10,VCTRCB(,VCCTREG)                             01S0257 03287000
*                                                               01S0258 03288000
*/*  CHECK IF ASM INITIALIZATION IS REQUIRED. IF SO, VALIDITY CHECK *   03289000
*  * THE ASMVT AND PART. IF EITHER IS INVALID, TAKE ERROR PATH *        03290000
*  * SINCE PAGING CANNOT BE DONE WITHOUT THEM. IF BOTH ARE VALID, *     03291000
*  * VALIDITY CHECK THE SART. IF IT IS INVALID, INDICATE SO IN THE *    03292000
*  * VCCT. THIS WILL ONLY AFFECT SWAPPED-OUT MEMORIES FOR WHICH THE *   03293000
*  * LSQA IS ON A SWAP DATA SET.                             @Z40WI3F*/ 03294000
*                                                               01S0258 03295000
*   IF ASMINIT=OFF THEN             /* ASM INITIALIZATION REQUIRED?     03296000
*                                                            @Z40WI3F*/ 03297000
         TM    ASMINIT,B'10000000'                              01S0258 03298000
         BNZ   @RF00258                                         01S0258 03299000
*     DO;                           /* YES -                 @Z40WI3F*/ 03300000
*       VCTCBADR=CVTASMVT;          /* ASMVT ADDR FROM CVT   @Z40WI3F*/ 03301000
         L     @10,CVTPTR                                       01S0260 03302000
         MVC   VCTCBADR(4,VCCTREG),CVTASMVT(@10)                01S0260 03303000
*       VCTCBIDN=VASMVTID;          /* ASMVT CNTRL BLOCK ID  @Z40WI3F*/ 03304000
         MVI   VCTCBIDN(VCCTREG),X'11'                          01S0261 03305000
*       SVC(VCKSVC);                /* CALL AMDSAVCK TO VALIDITY        03306000
*                                      CHECK THE ASMVT       @Z40WI3F*/ 03307000
         SVC   25                                               01S0262 03308000
*       RESPECIFY                                               01S0263 03309000
*         RETCODE RESTRICTED;       /*                       @Z40WI3F*/ 03310000
*       IF RETCODE^=0 THEN          /* ASMVT NOT VALID?      @Z40WI3F*/ 03311000
         LTR   RETCODE,RETCODE                                  01S0264 03312000
         BNZ   @RT00264                                         01S0264 03313000
*         GOTO ASMEXIT;             /* YES - TAKE ERROR PATH @Z40WI3F*/ 03314000
*       VCTCBADR=ASMPART;           /* PART ADDR FROM ASMVT  @Z40WI3F*/ 03315000
         L     @14,CVTPTR                                       01S0266 03316000
         L     @14,ASMVTPTR(,@14)                               01S0266 03317000
         MVC   VCTCBADR(4,VCCTREG),ASMPART(@14)                 01S0266 03318000
*       VCTCBIDN=VPARTID;           /* PART CNTRL BLOCK ID   @Z40WI3F*/ 03319000
         MVI   VCTCBIDN(VCCTREG),X'0C'                          01S0267 03320000
*       SVC(VCKSVC);                /* CALL AMDSAVCK TO VALIDITY        03321000
*                                      CHECK THE PART        @Z40WI3F*/ 03322000
         SVC   25                                               01S0268 03323000
*       IF RETCODE^=0 THEN          /* PART NOT VALID?       @Z40WI3F*/ 03324000
         LTR   RETCODE,RETCODE                                  01S0269 03325000
         BNZ   @RT00269                                         01S0269 03326000
*         GOTO ASMEXIT;             /* YES - TAKE ERROR PATH @Z40WI3F*/ 03327000
*       VCTCBADR=ASMSART;           /* SART ADDR FROM ASMVT  @Z40WI3F*/ 03328000
         L     @14,CVTPTR                                       01S0271 03329000
         L     @14,ASMVTPTR(,@14)                               01S0271 03330000
         MVC   VCTCBADR(4,VCCTREG),ASMSART(@14)                 01S0271 03331000
*       VCTCBIDN=VSARTID;           /* SARD CNTRL BLOCK ID   @Z40WI3F*/ 03332000
         MVI   VCTCBIDN(VCCTREG),X'13'                          01S0272 03333000
*       SVC(VCKSVC);                /* CALL AMDSAVCK TO VALIDITY        03334000
*                                      CHECK THE SART        @Z40WI3F*/ 03335000
         SVC   25                                               01S0273 03336000
*       IF RETCODE^=0 THEN          /* SART NOT VALID?       @Z40WI3F*/ 03337000
         LTR   RETCODE,RETCODE                                  01S0274 03338000
         BZ    @RF00274                                         01S0274 03339000
*         VCTSARTB=ON;              /* YES INDICATE SART BAD @Z40WI3F*/ 03340000
         OI    VCTSARTB(VCCTREG),B'00010000'                    01S0275 03341000
*       ASMINIT=ON;                 /* ASM ININTIALIZATION COMPLETE     03342000
*                                                            @Z40WI3F*/ 03343000
@RF00274 OI    ASMINIT,B'10000000'                              01S0276 03344000
*       SAVEBACK->SAVER15=0;        /* 0 RETURN CODE         @Z40WI3F*/ 03345000
         L     @14,SAVEBACK(,R13)                               01S0277 03346000
         SLR   @10,@10                                          01S0277 03347000
         ST    @10,SAVER15(,@14)                                01S0277 03348000
*       GO TO ASMRET;               /* TAKE RETURN PATH      @Z40WI3F*/ 03349000
         B     ASMRET                                           01S0278 03350000
*     END;                          /*                       @Z40WI3F*/ 03351000
*   RESPECIFY                                                   01S0280 03352000
*     RETCODE UNRESTRICTED;         /*                       @Z40WI3F*/ 03353000
@RF00258 DS    0H                                               01S0281 03354000
*                                                               01S0281 03355000
*/*  ASM INITIALIZATION COMPLETE - THIS IS A REQUEST FOR CONVERSION *   03356000
*  * OF AN LSID TO A SEEK ADDRESS, DEVICE ADDRESS, AND CPU ADDRESS   */ 03357000
*                                                               01S0281 03358000
*   IF BCTSWPDS=OFF THEN            /* ON SWAP OR PAGE DATA SET?        03359000
*                                                            @Z40WI3F*/ 03360000
         L     @10,@CA01592                                     01S0281 03361000
         L     @09,VCTLPA(,VCCTREG)                             01S0281 03362000
         ALR   @10,@09                                          01S0281 03363000
         AL    @09,IODBBCT(,@10)                                01S0281 03364000
         TM    BCTSWPDS(@09),B'00001000'                        01S0281 03365000
         BNZ   @RF00281                                         01S0281 03366000
*     DO;                           /* PAGE D.S. - USE PART  @Z40WI3F*/ 03367000
*       IF BCTINDEX>=PARTEUSE THEN  /* IF THE PART INDEX IS GREATER     03368000
*                                      THAN THE NUMBER OF PART  01S0283 03369000
*                                      ENTRIES IN USE, THEN THE PART    03370000
*                                      ENTRY CORRESPONDING TO THE       03371000
*                                      INDEX IS INVALID. NOTE THAT      03372000
*                                      INDICES RUN 0,1,2,3,... THUS,    03373000
*                                      WHEN PARTEUSE IS 1, THE ONLY     03374000
*                                      VALID INDEX IS 0. HENCE, THE     03375000
*                                      USE OF >= INSTEAD OF >   01S0283 03376000
*                                                            @Z40WI3F*/ 03377000
         SLR   @10,@10                                          01S0283 03378000
         IC    @10,BCTINDEX(,@09)                               01S0283 03379000
         L     @09,CVTPTR                                       01S0283 03380000
         L     @09,ASMVTPTR(,@09)                               01S0283 03381000
         L     @09,PARTPTR(,@09)                                01S0283 03382000
         C     @10,PARTEUSE(,@09)                               01S0283 03383000
         BNL   @RT00283                                         01S0283 03384000
*         GOTO ASMEXIT;             /*                       @Z40WI3F*/ 03385000
*       PAREPTR=ADDR(PARTENTS(BCTINDEX+1));/* COMPUTE PART ENTRY        03386000
*                                      ADDRESS               @Z40WI3F*/ 03387000
         SLA   @10,6                                            01S0285 03388000
         LA    PAREPTR,PARTENTS(@10,@09)                        01S0285 03389000
*       IF PAREDSBD=ON THEN         /* DATA SET BAD          @Z40WI3F*/ 03390000
         TM    PAREDSBD(PAREPTR),B'01000000'                    01S0286 03391000
         BO    @RT00286                                         01S0286 03392000
*         GOTO ASMEXIT;             /* YES - ERROR           @Z40WI3F*/ 03393000
*       EDBPTR=PAREEDBP;            /* EDB ADDR FROM PART    @Z40WI3F*/ 03394000
         L     EDBPTR,PAREEDBP(,PAREPTR)                        01S0288 03395000
*       UCBPTR=PAREUCBP;            /* UCB ADDR FROM PART    @Z40WI3F*/ 03396000
         L     UCBPTR,PAREUCBP(,PAREPTR)                        01S0289 03397000
*     END;                          /*                       @Z40WI3F*/ 03398000
*   ELSE                                                        01S0291 03399000
*     DO;                           /* PAGE ON SWAP DATA SET - USE      03400000
*                                      SART                  @Z40WI3F*/ 03401000
         B     @RC00281                                         01S0291 03402000
@RF00281 DS    0H                                               01S0292 03403000
*       IF VCTSARTB=ON THEN         /* IS THE SART BAD?      @Z40WI3F*/ 03404000
         TM    VCTSARTB(VCCTREG),B'00010000'                    01S0292 03405000
         BO    @RT00292                                         01S0292 03406000
*         GOTO ASMEXIT;             /* YES - ERROR           @Z40WI3F*/ 03407000
*       IF BCTINDEX>=SARUSE THEN    /* IF THE SART INDEX IS GREATER     03408000
*                                      THAN THE NUMBER OF SART  01S0294 03409000
*                                      ENTRIES IN USE, THEN THE SART    03410000
*                                      ENTRY CORRESPONDING TO THE       03411000
*                                      INDEX IS INVALID. NOTE THAT      03412000
*                                      INDICES RUN 0,1,2,3,... THUS,    03413000
*                                      WHEN SARUSE IS 1, THE ONLY       03414000
*                                      VALID INDEX IS 0. HENCE, THE     03415000
*                                      USE OF >= INSTEAD OF >   01S0294 03416000
*                                                            @Z40WI3F*/ 03417000
         L     @10,@CA01592                                     01S0294 03418000
         L     @09,VCTLPA(,VCCTREG)                             01S0294 03419000
         ALR   @10,@09                                          01S0294 03420000
         AL    @09,IODBBCT(,@10)                                01S0294 03421000
         SLR   @10,@10                                          01S0294 03422000
         IC    @10,BCTINDEX(,@09)                               01S0294 03423000
         L     @09,CVTPTR                                       01S0294 03424000
         L     @09,ASMVTPTR(,@09)                               01S0294 03425000
         L     @09,SARTPTR(,@09)                                01S0294 03426000
         C     @10,SARUSE(,@09)                                 01S0294 03427000
         BNL   @RT00294                                         01S0294 03428000
*         GOTO ASMEXIT;             /*                       @Z40WI3F*/ 03429000
*       SAREPTR=ADDR(SARENTS(BCTINDEX+1));/* POINT TO SART ENTRY FOR    03430000
*                                      DATA SET WHICH CONTAINS THE      03431000
*                                      DESIRED PAGE          @Z40WI3F*/ 03432000
         MH    @10,@CH00829                                     01S0296 03433000
         LA    SAREPTR,SARENTS(@10,@09)                         01S0296 03434000
*       IF SREDSBD=ON THEN          /* THIS ENTRY NOT IN USE OR DATA    03435000
*                                                            @Z40WI3F   03436000
*                                      SET BAD               @Z40WI3F*/ 03437000
         TM    SREDSBD(SAREPTR),B'01000000'                     01S0297 03438000
         BO    @RT00297                                         01S0297 03439000
*         GOTO ASMEXIT;             /* IFSO, ERROR           @Z40WI3F*/ 03440000
*       EDBPTR=SREEDB;              /* EDB ADDR FROM SART    @Z40WI3F*/ 03441000
         L     EDBPTR,SREEDB(,SAREPTR)                          01S0299 03442000
*       UCBPTR=SREUCB;              /* UCB ADDR FROM SART    @Z40WI3F*/ 03443000
         L     UCBPTR,SREUCB(,SAREPTR)                          01S0300 03444000
*     END;                          /*                       @Z40WI3F*/ 03445000
*   RESPECIFY                                                   01S0302 03446000
*     IDAEDBHD BASED(EDBPTR);       /*                       @Z40WI3F*/ 03447000
@RC00281 DS    0H                                               01S0303 03448000
*   VCTCBADR=EDBPTR;                /* ADDR OF EDB HEADER    @Z40WI3F*/ 03449000
         ST    EDBPTR,VCTCBADR(,VCCTREG)                        01S0303 03450000
*   VCTCBIDN=VEDBID;                /* EDB CNTRL BLOCK ID    @Z40WI3F*/ 03451000
         MVI   VCTCBIDN(VCCTREG),X'06'                          01S0304 03452000
*   SVC(VCKSVC);                    /* CALL AMDSAVCK TO VALIDITY        03453000
*                                      CHECK THE EDB         @Z40WI3F*/ 03454000
         SVC   25                                               01S0305 03455000
*   RESPECIFY                                                   01S0306 03456000
*     RETCODE RESTRICTED;           /*                       @Z40WI3F*/ 03457000
*   IF RETCODE^=0|EDBNO=0 THEN      /* INVALID EDB OR NO ENTRIES        03458000
*                                                            @Z40WI3F*/ 03459000
         LTR   RETCODE,RETCODE                                  01S0307 03460000
         BNZ   @RT00307                                         01S0307 03461000
         CLI   EDBNO(EDBPTR),0                                  01S0307 03462000
         BE    @RT00307                                         01S0307 03463000
*     GOTO ASMEXIT;                 /* IFSO, ERROR           @Z40WI3F*/ 03464000
*                                                               01S0309 03465000
*/*  AT THIS POINT, SET UP THE INTERFACE TO THE LSID-TO-SEEK-ADDRESS *  03466000
*  * CONVERT ROUTINE.                                        @Z40WI3F*/ 03467000
*                                                               01S0309 03468000
*   CONVOUT(1:4)=BCTRBA*PAGESIZE;   /* SET UP RELATIVE BYTE ADDR FOR    03469000
*                                      ILRCNVRT              @Z40WI3F*/ 03470000
         L     @14,@CA01592                                     01S0309 03471000
         L     @10,VCTLPA(,VCCTREG)                             01S0309 03472000
         ALR   @14,@10                                          01S0309 03473000
         AL    @10,IODBBCT(,@14)                                01S0309 03474000
         SLR   @14,@14                                          01S0309 03475000
         ICM   @14,3,BCTRBA(@10)                                01S0309 03476000
         SLA   @14,12                                           01S0309 03477000
         ST    @14,CONVOUT                                      01S0309 03478000
*   RESPECIFY                                                   01S0310 03479000
*    (R0,                                                       01S0310 03480000
*     R1) RESTRICTED;               /*                       @Z40WI3F*/ 03481000
*   R0=EDBPTR;                      /* SET UP EDB ADDR FOR ILRCNVRT     03482000
*                                                            @Z40WI3F*/ 03483000
         LR    R0,EDBPTR                                        01S0311 03484000
*   R1=ADDR(CONVOUT);               /* DATA COMMUNICATION AREA FOR      03485000
*                                      ILRCNVRT. RBA PUT INTO CONVOUT   03486000
*                                      BEFORE CALL. SEEK ADDRESS IS     03487000
*                                      IN CONVOUT ON RETURN  @Z40WI3F*/ 03488000
         LA    R1,CONVOUT                                       01S0312 03489000
*   VCTASMIC=ON;                    /* INDICATE ASM CODE, NOT SADMP     03490000
*                                      CODE, IS IN CONTROL   @Z40WI3F*/ 03491000
         OI    VCTASMIC(VCCTREG),B'00100000'                    01S0313 03492000
*   CALL ILRCNVRT;                  /* LSID-TO-SEEK ADDR CONVERT        03493000
*                                      ROUTINE               @Z40WI3F*/ 03494000
         BAL   @14,ILRCNVRT                                     01S0314 03495000
*   VCTASMIC=OFF;                   /* RESET ASM-IN-CONTROL FLAG        03496000
*                                                            @Z40WI3F*/ 03497000
         NI    VCTASMIC(VCCTREG),B'11011111'                    01S0315 03498000
*   IF RETCODE^=0 THEN              /* CONVERT UNSUCCESSFUL? @Z40WI3F*/ 03499000
         LTR   RETCODE,RETCODE                                  01S0316 03500000
         BNZ   @RT00316                                         01S0316 03501000
*     GOTO ASMEXIT;                 /* YES--ERROR            @Z40WI3F*/ 03502000
*/*  AMDSAUCB WILL BE CALLED TO OBTAIN DEVICE AND CPU ADDRESSES,AND *   03503000
*  * PLACE THEM IN THE IODB.                                 @Z40WI3F*/ 03504000
*                                                               01S0318 03505000
*   RESPECIFY                                                   01S0318 03506000
*     R1 RESTRICTED;                /*                       @Z40WI3F*/ 03507000
*   R1=UCBPTR;                      /* PASS UCB ADDR         @Z40WI3F*/ 03508000
         LR    R1,UCBPTR                                        01S0319 03509000
*   SVC(UCBSVC);                    /* CALL AMDSAUCB         @Z40WI3F*/ 03510000
         SVC   24                                               01S0320 03511000
*   IODBCCHH=CONVOUT;               /* CONVERT ROUTINE PLACES SEEK      03512000
*                                      ADDRESS IN CONVOUT    @Z40WI3F*/ 03513000
         L     @14,@CA01592                                     01S0321 03514000
         AL    @14,VCTLPA(,VCCTREG)                             01S0321 03515000
         MVC   IODBCCHH(8,@14),CONVOUT                          01S0321 03516000
*   SAVEBACK->SAVER15=RETCODE;      /* PASS SAME RETURN CODE AS 01S0322 03517000
*                                      RECEIVED FROM AMDSAUCB   01S0322 03518000
*                                                            @Z40WI3F*/ 03519000
         L     @14,SAVEBACK(,R13)                               01S0322 03520000
         ST    RETCODE,SAVER15(,@14)                            01S0322 03521000
*                                                               01S0323 03522000
*   /*****************************************************************/ 03523000
*   /*                                                               */ 03524000
*   /* RETURN PATH - DEQUEUE THE RCB, FREE THE WORK AREA, AND RETURN.*/ 03525000
*   /*                                                               */ 03526000
*   /*****************************************************************/ 03527000
*                                                               01S0323 03528000
*/*ASMRET: P DEQUEUE RCB                                             */ 03529000
*/* P RESTORE ORIGINAL BUFFER REQUEST FLAGS                          */ 03530000
*/* P RESET ASM IN CONTROL FLAG                                      */ 03531000
*/* L  AMDSAFRM:  FREE SAVE/WORK AREA                                */ 03532000
*/* P SET RETURN CODE                                                */ 03533000
*/* R RETURN TO CALLER                                               */ 03534000
*                                                               01S0323 03535000
*ASMRET:                                                        01S0323 03536000
*   VCTRCB=RCBNEXT;                 /* DEQUEUE RCB                   */ 03537000
ASMRET   LA    @14,ASMRCB                                       01S0323 03538000
         MVC   VCTRCB(4,VCCTREG),RCBNEXT(@14)                   01S0323 03539000
*   CTBUFTYP=ASMBUFTP;              /* RESTORE BUFFER REQUEST        */ 03540000
         L     @14,VCTCCTV(,VCCTREG)                            01S0324 03541000
         STC   ASMBUFTP,CTBUFTYP(,@14)                          01S0324 03542000
*   VCTASMIC=OFF;                   /* RESET ASM IN CONTROL FLAG     */ 03543000
         NI    VCTASMIC(VCCTREG),B'11011111'                    01S0325 03544000
*   R1=R8;                          /* ADDRESS OF AREA TO BE FREED   */ 03545000
         LR    R1,R8                                            01S0326 03546000
*   SVC(FRMSVC);                    /* CALL AMDSAFRM-FREE WORK AREA  */ 03547000
         SVC   5                                                01S0327 03548000
*   RETURN;                         /* RETURN TO CALLER              */ 03549000
*                                                               01S0328 03550000
@EL00001 L     @13,4(,@13)                                      01S0328 03551000
@EF00001 DS    0H                                               01S0328 03552000
@ER00001 LM    @14,@12,12(@13)                                  01S0328 03553000
         BR    @14                                              01S0328 03554000
*   /*****************************************************************/ 03555000
*   /*                                                               */ 03556000
*   /* ASM ERROR EXIT-SET UP RETURN CODE 4 AND TAKE THE RETURN PATH. */ 03557000
*   /* RECEIVES CONTROL ON ANY PROGRAM CHECK OR PAGING FAILURE, OR IF*/ 03558000
*   /* ANY FUNCTION CANNOT BE PERFORMED SUCCESSFULLY.                */ 03559000
*   /*                                                               */ 03560000
*   /*****************************************************************/ 03561000
*                                                               01S0329 03562000
*/*ASMEXIT: P (,ASMRET) SET UP RETURN CODE OF 4                      */ 03563000
*                                                               01S0329 03564000
*ASMEXIT:                                                       01S0329 03565000
*   SAVEBACK->SAVER15=4;            /* SET UP RETURN CODE 4          */ 03566000
ASMEXIT  L     @14,SAVEBACK(,R13)                               01S0329 03567000
         MVC   SAVER15(4,@14),@CF00054                          01S0329 03568000
*   GO TO ASMRET;                   /* TAKE RETURN PATH              */ 03569000
         B     ASMRET                                           01S0330 03570000
*   END AMDSAASM                                                01S0331 03571000
*                                                               01S0331 03572000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 03573000
*/*%INCLUDE SYSLIB  (ILRCNVRT)                                       */ 03574000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 03575000
*/*%INCLUDE SYSLIB  (ILRPART )                                       */ 03576000
*/*%INCLUDE SYSLIB  (ILRSART )                                       */ 03577000
*/*%INCLUDE SYSLIB  (IDAEDB  )                                       */ 03578000
*/*%INCLUDE SYSLIB  (IDALPMB )                                       */ 03579000
*/*%INCLUDE SYSLIB  (ILRASMVT)                                       */ 03580000
*/*%INCLUDE SYSLIB  (AMDSARMK)                                       */ 03581000
*                                                               01S0331 03582000
*       ;                                                       01S0331 03583000
@DATA    DS    0H                                                       03584000
@CH00829 DC    H'48'                                                    03585000
@DATD    DSECT                                                          03586000
         DS    0F                                                       03587000
@SA00001 DS    18F                                                      03588000
AMDSAASM CSECT                                                          03589000
         DS    0F                                                       03590000
@CF00054 DC    F'4'                                                     03591000
@CH00054 EQU   @CF00054+2                                               03592000
@DATD    DSECT                                                          03593000
         DS    0D                                                       03594000
ASMRCB   DS    CL20                                                     03595000
         ORG   ASMRCB                                                   03596000
@NM00054 DS    AL4                                                      03597000
ASMRSTOR DS    AL4                                                      03598000
@NM00055 DS    3A                                                       03599000
         ORG   ASMRCB+20                                                03600000
CONVOUT  DS    CL8                                                      03601000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                03602000
@ENDDATD EQU   *                                                        03603000
AMDSAASM CSECT                                                          03604000
         NOPR  ((@ENDDATD-@DATD)/257*16)                                03605000
         DS    0F                                                       03606000
@SIZDATD DC    AL1(0)                                                   03607000
         DC    AL3(@ENDDATD-@DATD)                                      03608000
@CA01592 DC    A(IODBDA)                                                03609000
         DS    0D                                                       03610000
@CC01611 DC    C'ASM'                                                   03611000
ASMSWTCH DC    X'00'                                                    03612000
         ORG   ASMSWTCH                                                 03613000
ASMINIT  DS    BL1                                                      03614000
         ORG   ASMSWTCH+1                                               03615000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       03616000
@01      EQU   01                                                       03617000
@02      EQU   02                                                       03618000
@03      EQU   03                                                       03619000
@04      EQU   04                                                       03620000
@05      EQU   05                                                       03621000
@06      EQU   06                                                       03622000
@07      EQU   07                                                       03623000
@08      EQU   08                                                       03624000
@09      EQU   09                                                       03625000
@10      EQU   10                                                       03626000
@11      EQU   11                                                       03627000
@12      EQU   12                                                       03628000
@13      EQU   13                                                       03629000
@14      EQU   14                                                       03630000
@15      EQU   15                                                       03631000
UCBPTR   EQU   @04                                                      03632000
EDBPTR   EQU   @03                                                      03633000
ASMBUFTP EQU   @05                                                      03634000
SAREPTR  EQU   @02                                                      03635000
PAREPTR  EQU   @02                                                      03636000
R1       EQU   @01                                                      03637000
R0       EQU   @00                                                      03638000
R2       EQU   @02                                                      03639000
R3       EQU   @03                                                      03640000
R5       EQU   @05                                                      03641000
R4       EQU   @04                                                      03642000
R15      EQU   @15                                                      03643000
VCCTREG  EQU   @12                                                      03644000
RETREG   EQU   @14                                                      03645000
RETCODE  EQU   @15                                                      03646000
BASEREG  EQU   @11                                                      03647000
R8       EQU   @08                                                      03648000
R12      EQU   @12                                                      03649000
R13      EQU   @13                                                      03650000
R14      EQU   @14                                                      03651000
R10      EQU   @10                                                      03652000
R11      EQU   @11                                                      03653000
R6       EQU   @06                                                      03654000
R7       EQU   @07                                                      03655000
R9       EQU   @09                                                      03656000
         EXTRN IODBDA                                                   03657000
CVTPTR   EQU   16                                                       03658000
SADMPLSD EQU   3312                                                     03659000
CNVRTSKA EQU   0                                                        03660000
CNVRTM   EQU   CNVRTSKA                                                 03661000
CNVRTCC  EQU   CNVRTSKA+3                                               03662000
CNVRTHH  EQU   CNVRTSKA+5                                               03663000
CNVRTR   EQU   CNVRTSKA+7                                               03664000
IDAEDBHD EQU   0                                                        03665000
EDBNO    EQU   IDAEDBHD+1                                               03666000
EDBLEN   EQU   IDAEDBHD+2                                               03667000
CVTMAP   EQU   0                                                        03668000
CVTDAR   EQU   CVTMAP+72                                                03669000
CVTFLGS1 EQU   CVTDAR                                                   03670000
CVTDCB   EQU   CVTMAP+116                                               03671000
CVTIERLC EQU   CVTMAP+144                                               03672000
CVTOPTA  EQU   CVTMAP+182                                               03673000
CVTOPTB  EQU   CVTMAP+183                                               03674000
CVTGTF   EQU   CVTMAP+236                                               03675000
CVTGTFST EQU   CVTGTF                                                   03676000
CVTGTFS  EQU   CVTGTFST                                                 03677000
CVTSTATE EQU   CVTGTFST                                                 03678000
CVTTMODE EQU   CVTGTFST                                                 03679000
CVTFORM  EQU   CVTGTFST                                                 03680000
CVTAQAVT EQU   CVTMAP+240                                               03681000
CVTTCMFG EQU   CVTAQAVT                                                 03682000
CVTVOLM2 EQU   CVTMAP+244                                               03683000
CVTTATA  EQU   CVTVOLM2                                                 03684000
CVTTSKS  EQU   CVTTATA                                                  03685000
CVTVOLF2 EQU   CVTTSKS                                                  03686000
CVTTAT   EQU   CVTTATA+1                                                03687000
CVTATER  EQU   CVTMAP+248                                               03688000
CVTEXT1  EQU   CVTMAP+252                                               03689000
CVTPURG  EQU   CVTMAP+260                                               03690000
CVTQMSG  EQU   CVTMAP+268                                               03691000
CVTDMSR  EQU   CVTMAP+272                                               03692000
CVTRSV37 EQU   CVTDMSR                                                  03693000
CVTDMSRF EQU   CVTRSV37                                                 03694000
CVTERPV  EQU   CVTMAP+316                                               03695000
CVTINTLA EQU   CVTMAP+320                                               03696000
CVTAPF   EQU   CVTMAP+324                                               03697000
CVTEXT2  EQU   CVTMAP+328                                               03698000
CVTHJES  EQU   CVTMAP+332                                               03699000
CVTPGSIA EQU   CVTMAP+348                                               03700000
CVTA1F1  EQU   CVTMAP+356                                               03701000
CVTSYSK  EQU   CVTMAP+357                                               03702000
CVTVOLM1 EQU   CVTMAP+380                                               03703000
CVTVOLF1 EQU   CVTVOLM1                                                 03704000
CVTATMCT EQU   CVTMAP+388                                               03705000
CVTXTNT1 EQU   0                                                        03706000
CVTXTNT2 EQU   0                                                        03707000
CVTDSSV  EQU   CVTXTNT2                                                 03708000
CVTFLGBT EQU   CVTXTNT2+5                                               03709000
CVTQID   EQU   CVTXTNT2+24                                              03710000
CVTSHS   EQU   CVTXTNT2+40                                              03711000
CVTRV400 EQU   CVTXTNT2+52                                              03712000
CVTRV409 EQU   CVTXTNT2+53                                              03713000
CVTATCVT EQU   CVTXTNT2+64                                              03714000
CVTRV429 EQU   CVTXTNT2+84                                              03715000
CVTRV438 EQU   CVTXTNT2+85                                              03716000
CVTRV457 EQU   CVTXTNT2+112                                             03717000
CVTRV466 EQU   CVTXTNT2+113                                             03718000
CVTFIX   EQU   0                                                        03719000
CVTRELNO EQU   CVTFIX+252                                               03720000
PART     EQU   0                                                        03721000
PARTHDR  EQU   PART                                                     03722000
PARTEUSE EQU   PARTHDR+8                                                03723000
PARTTPAR EQU   PARTHDR+24                                               03724000
PARTCOMQ EQU   PARTHDR+48                                               03725000
PARTSPLQ EQU   PARTHDR+56                                               03726000
PARTDUPQ EQU   PARTHDR+64                                               03727000
PARTLOCQ EQU   PARTHDR+72                                               03728000
PARTENTS EQU   PART+80                                                  03729000
PARTENT  EQU   0                                                        03730000
PARELKUP EQU   PARTENT+4                                                03731000
PARELKFL EQU   PARELKUP                                                 03732000
PARETYPE EQU   PARTENT+8                                                03733000
PAREFLG1 EQU   PARTENT+9                                                03734000
PAREDSBD EQU   PAREFLG1                                                 03735000
PAREEDBP EQU   PARTENT+40                                               03736000
PAREUCBP EQU   PARTENT+44                                               03737000
SART     EQU   0                                                        03738000
SARTHDR  EQU   SART                                                     03739000
SARUSE   EQU   SARTHDR+8                                                03740000
SARWAITQ EQU   SARTHDR+40                                               03741000
SARENTS  EQU   SART+80                                                  03742000
SARTE    EQU   0                                                        03743000
SREFLG   EQU   SARTE+9                                                  03744000
SREDSBD  EQU   SREFLG                                                   03745000
SREEDB   EQU   SARTE+40                                                 03746000
SREUCB   EQU   SARTE+44                                                 03747000
IDAEDB   EQU   0                                                        03748000
EDBFLG1  EQU   IDAEDB+2                                                 03749000
EDBM     EQU   IDAEDB+3                                                 03750000
EDBLPMBA EQU   IDAEDB+4                                                 03751000
EDBSTTRK EQU   IDAEDB+8                                                 03752000
EDBLORBA EQU   IDAEDB+12                                                03753000
EDBHIRBA EQU   IDAEDB+16                                                03754000
IDALPMB  EQU   0                                                        03755000
LPMBFLGS EQU   IDALPMB+1                                                03756000
LPMAUSZ  EQU   IDALPMB+4                                                03757000
LPMBPTRK EQU   IDALPMB+8                                                03758000
LPMBLKSZ EQU   IDALPMB+12                                               03759000
LPMTRKAU EQU   IDALPMB+16                                               03760000
LPMTPC   EQU   IDALPMB+18                                               03761000
ASMVT    EQU   0                                                        03762000
ASMFLAG1 EQU   ASMVT                                                    03763000
ASMFLAG2 EQU   ASMVT+1                                                  03764000
ASMSART  EQU   ASMVT+4                                                  03765000
ASMPART  EQU   ASMVT+8                                                  03766000
ASMSTAGQ EQU   ASMVT+32                                                 03767000
ASMPCCWQ EQU   ASMVT+64                                                 03768000
ASMLSAI  EQU   ASMVT+144                                                03769000
ASMGOSQS EQU   ASMVT+152                                                03770000
ASMWKSA1 EQU   ASMVT+368                                                03771000
ASMWKSA2 EQU   ASMVT+448                                                03772000
ASMWKSA3 EQU   ASMVT+528                                                03773000
ASMWKSA4 EQU   ASMVT+608                                                03774000
ASMWKSA5 EQU   ASMVT+688                                                03775000
ASMPOOLS EQU   0                                                        03776000
ASMCPAVQ EQU   ASMPOOLS+8                                               03777000
ASMCPRSQ EQU   ASMPOOLS+16                                              03778000
ARB      EQU   0                                                        03779000
BCTH     EQU   0                                                        03780000
BCT      EQU   0                                                        03781000
BCTLSID  EQU   BCT+40                                                   03782000
BCTINDEX EQU   BCTLSID+1                                                03783000
BCTRBA   EQU   BCTLSID+2                                                03784000
BCTFLGT  EQU   BCT+44                                                   03785000
BCTFLGI  EQU   BCT+45                                                   03786000
BCTSWPDS EQU   BCTFLGI                                                  03787000
CCT      EQU   0                                                        03788000
CTFLG1   EQU   CCT+1                                                    03789000
CTFLG2   EQU   CCT+2                                                    03790000
CTLOWFLG EQU   CCT+48                                                   03791000
CTDMPTYP EQU   CCT+52                                                   03792000
CTIOTYPE EQU   CTDMPTYP                                                 03793000
CTCONFLG EQU   CTDMPTYP+2                                               03794000
CTBUFTYP EQU   CTDMPTYP+3                                               03795000
CTASM    EQU   CTBUFTYP                                                 03796000
CTPRMT1  EQU   CTDMPTYP+24                                              03797000
CTPRMT2  EQU   CTDMPTYP+26                                              03798000
CCW      EQU   0                                                        03799000
CCWFLAGS EQU   CCW+4                                                    03800000
CSW      EQU   0                                                        03801000
CSWKEY00 EQU   CSW                                                      03802000
CSWUSTAT EQU   CSW+4                                                    03803000
CSWCSTAT EQU   CSW+5                                                    03804000
DSCE     EQU   0                                                        03805000
IODB     EQU   0                                                        03806000
IODBFLAG EQU   IODB+8                                                   03807000
IODBBCT  EQU   IODB+16                                                  03808000
IODBCCHH EQU   IODB+32                                                  03809000
IODBSRCH EQU   IODBCCHH+3                                               03810000
MDCE     EQU   0                                                        03811000
MDCB     EQU   0                                                        03812000
MDCBGRS  EQU   MDCB+16                                                  03813000
MDCBFLGS EQU   MDCB+86                                                  03814000
PSW      EQU   0                                                        03815000
PSWSM    EQU   PSW                                                      03816000
@NM00045 EQU   PSW+1                                                    03817000
PSWCCPM  EQU   PSW+2                                                    03818000
@NM00048 EQU   PSW+3                                                    03819000
PTRT     EQU   0                                                        03820000
PTRTRSA  EQU   0                                                        03821000
RCB      EQU   0                                                        03822000
RCBNEXT  EQU   RCB                                                      03823000
RCBSAVE  EQU   RCB+8                                                    03824000
RCBEXIT  EQU   RCB+12                                                   03825000
RCBBASE  EQU   RCB+16                                                   03826000
VCCT     EQU   0                                                        03827000
VCTRCB   EQU   VCCT+4                                                   03828000
VCTRECSN EQU   VCCT+8                                                   03829000
VCTFLGS  EQU   VCCT+9                                                   03830000
VCTASMIC EQU   VCTFLGS                                                  03831000
VCTSARTB EQU   VCTFLGS                                                  03832000
VCTMDCE  EQU   VCCT+12                                                  03833000
VCTDSCE  EQU   VCCT+20                                                  03834000
VCTBCTH  EQU   VCCT+24                                                  03835000
VCTCBID  EQU   VCCT+64                                                  03836000
VCTCBIDN EQU   VCTCBID+7                                                03837000
VCTCBADR EQU   VCCT+80                                                  03838000
VCTLPA   EQU   VCCT+84                                                  03839000
VCTCCTV  EQU   VCCT+104                                                 03840000
SDL      EQU   0                                                        03841000
REGLOCAL EQU   0                                                        03842000
SAVEFORM EQU   0                                                        03843000
SAVENAME EQU   SAVEFORM+1                                               03844000
SAVEBACK EQU   SAVEFORM+4                                               03845000
SAVENEXT EQU   SAVEFORM+8                                               03846000
SAVER15  EQU   SAVEFORM+16                                              03847000
PTRTVSA  EQU   0                                                        03848000
CNVRTRBA EQU   CNVRTSKA                                                 03849000
CVTS01   EQU   CVTPGSIA                                                 03850000
CVTLPDIA EQU   CVTS01+12                                                03851000
CVTDIRST EQU   CVTLPDIA                                                 03852000
CVTSLIDA EQU   CVTS01+24                                                03853000
CVTCTLFG EQU   CVTS01+50                                                03854000
CVTASMVT EQU   CVTS01+356                                               03855000
CVTRV210 EQU   CVTS01+424                                               03856000
CVTRV219 EQU   CVTS01+425                                               03857000
CVTRV228 EQU   CVTS01+426                                               03858000
CVTRV237 EQU   CVTS01+427                                               03859000
CVTMFRTR EQU   CVTS01+452                                               03860000
CVTRV262 EQU   CVTS01+468                                               03861000
CVTRV271 EQU   CVTS01+469                                               03862000
CVTRV280 EQU   CVTS01+470                                               03863000
CVTRV289 EQU   CVTS01+471                                               03864000
CVTGSDA  EQU   CVTS01+600                                               03865000
PARTPTR  EQU   ASMPART                                                  03866000
SARTPTR  EQU   ASMSART                                                  03867000
ASMVTPTR EQU   CVTASMVT                                                 03868000
ASM1WKSV EQU   ASMWKSA1                                                 03869000
ASM1RGSV EQU   ASM1WKSV                                                 03870000
ASM1WRKA EQU   ASM1WKSV+60                                              03871000
ASM2WKSV EQU   ASMWKSA2                                                 03872000
ASM2WRKA EQU   ASM2WKSV+52                                              03873000
ASM2FLGS EQU   ASM2WRKA+12                                              03874000
ASM3WKSV EQU   ASMWKSA3                                                 03875000
ASM4WKSV EQU   ASMWKSA4                                                 03876000
ASM4RGSV EQU   ASM4WKSV                                                 03877000
ASM5WKSV EQU   ASMWKSA5                                                 03878000
ASM5RGSV EQU   ASM5WKSV                                                 03879000
CTLOWDMP EQU   CTDMPTYP                                                 03880000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03881000
CTADDRE  EQU   CTLOWDMP+4                                               03882000
CTADDRS  EQU   CTLOWDMP                                                 03883000
ASM5FLGS EQU   ASM5WKSV+64                                              03884000
ASM5AIA  EQU   ASM5WKSV+60                                              03885000
ASM5GCTR EQU   ASM5WKSV+56                                              03886000
ASM5SR14 EQU   ASM5WKSV+52                                              03887000
@NM00020 EQU   ASM5RGSV+4                                               03888000
ASM5RG2  EQU   ASM5RGSV                                                 03889000
@NM00019 EQU   ASM4RGSV+4                                               03890000
ASM4RG2  EQU   ASM4RGSV                                                 03891000
ASM3SR13 EQU   ASM3WKSV+28                                              03892000
ASM3R14B EQU   ASM3WKSV+24                                              03893000
ASM3R14A EQU   ASM3WKSV+20                                              03894000
ASM3GRPA EQU   ASM3WKSV+16                                              03895000
ASM3TMPA EQU   ASM3WKSV+12                                              03896000
ASM3PIOP EQU   ASM3WKSV+8                                               03897000
ASM3GENQ EQU   ASM3WKSV+4                                               03898000
ASM3SWPQ EQU   ASM3WKSV                                                 03899000
ASM2SR14 EQU   ASM2WRKA+16                                              03900000
@NM00018 EQU   ASM2WRKA+13                                              03901000
ASM2WFLG EQU   ASM2FLGS                                                 03902000
ASM2RFLG EQU   ASM2FLGS                                                 03903000
ASM2DUPQ EQU   ASM2WRKA+8                                               03904000
ASM2CAQ  EQU   ASM2WRKA+4                                               03905000
ASM2PAQ  EQU   ASM2WRKA                                                 03906000
ASM2RGSV EQU   ASM2WKSV                                                 03907000
ASM1NXTA EQU   ASM1WRKA+4                                               03908000
ASM1ASCB EQU   ASM1WRKA                                                 03909000
ASM1RG15 EQU   ASM1RGSV+56                                              03910000
@NM00017 EQU   ASM1RGSV+4                                               03911000
ASM1RG1  EQU   ASM1RGSV                                                 03912000
CVTRV628 EQU   CVTS01+728                                               03913000
CVTRV627 EQU   CVTS01+724                                               03914000
CVTRV626 EQU   CVTS01+720                                               03915000
CVTRV625 EQU   CVTS01+716                                               03916000
CVTRV624 EQU   CVTS01+712                                               03917000
CVTRV623 EQU   CVTS01+708                                               03918000
CVTRV622 EQU   CVTS01+704                                               03919000
CVTRV621 EQU   CVTS01+700                                               03920000
CVTRV620 EQU   CVTS01+696                                               03921000
CVTSUSP  EQU   CVTS01+692                                               03922000
CVTT6SVC EQU   CVTS01+688                                               03923000
CVTCDAL  EQU   CVTS01+684                                               03924000
CVTTCTL  EQU   CVTS01+680                                               03925000
CVTRSUME EQU   CVTS01+676                                               03926000
CVTJTERM EQU   CVTS01+672                                               03927000
CVTASMRM EQU   CVTS01+668                                               03928000
CVTTCASP EQU   CVTS01+664                                               03929000
CVT0PT03 EQU   CVTS01+660                                               03930000
CVT0PT0E EQU   CVTS01+656                                               03931000
CVTIRM   EQU   CVTS01+652                                               03932000
CVTCGK   EQU   CVTS01+648                                               03933000
CVTRAC   EQU   CVTS01+644                                               03934000
CVTRV606 EQU   CVTS01+640                                               03935000
CVTRV605 EQU   CVTS01+636                                               03936000
CVTRV604 EQU   CVTS01+632                                               03937000
CVTEFF02 EQU   CVTS01+628                                               03938000
CVTCBBR  EQU   CVTS01+624                                               03939000
CVTSSCR  EQU   CVTS01+620                                               03940000
CVTEVENT EQU   CVTS01+616                                               03941000
CVTCRCA  EQU   CVTS01+612                                               03942000
CVTTPIO  EQU   CVTS01+608                                               03943000
CVTADV   EQU   CVTS01+604                                               03944000
CVTGSDAB EQU   CVTGSDA                                                  03945000
CVTQV3   EQU   CVTS01+596                                               03946000
CVTQV2   EQU   CVTS01+592                                               03947000
CVTQV1   EQU   CVTS01+588                                               03948000
CVTRPT   EQU   CVTS01+584                                               03949000
CVTSSRB  EQU   CVTS01+580                                               03950000
CVTCSDRL EQU   CVTS01+576                                               03951000
CVTEXP1  EQU   CVTS01+572                                               03952000
CVTRMPMT EQU   CVTS01+568                                               03953000
CVTRMPTT EQU   CVTS01+564                                               03954000
CVTVPSA  EQU   CVTS01+560                                               03955000
CVTVSTOP EQU   CVTS01+556                                               03956000
CVTGTFR8 EQU   CVTS01+552                                               03957000
CVTQUIT  EQU   CVTS01+548                                               03958000
CVTVACR  EQU   CVTS01+544                                               03959000
CVTWTCB  EQU   CVTS01+540                                               03960000
CVTSTPRS EQU   CVTS01+536                                               03961000
CVT0PT02 EQU   CVTS01+532                                               03962000
CVTDARCM EQU   CVTS01+528                                               03963000
CVTIRECM EQU   CVTS01+524                                               03964000
CVTJRECM EQU   CVTS01+520                                               03965000
CVTVEMS0 EQU   CVTS01+516                                               03966000
CVTSPFRR EQU   CVTS01+512                                               03967000
CVTRLSTG EQU   CVTS01+508                                               03968000
CVT0TC0A EQU   CVTS01+504                                               03969000
CVTGMBR  EQU   CVTS01+500                                               03970000
CVTLFRM  EQU   CVTS01+496                                               03971000
CVTRMBR  EQU   CVTS01+492                                               03972000
CVTVIOP  EQU   CVTS01+488                                               03973000
CVTRV307 EQU   CVTS01+486                                               03974000
CVTRV306 EQU   CVTS01+484                                               03975000
CVTRV305 EQU   CVTS01+482                                               03976000
CVTRV304 EQU   CVTS01+480                                               03977000
CVTRV303 EQU   CVTS01+478                                               03978000
CVTRV302 EQU   CVTS01+476                                               03979000
CVTTRCA  EQU   CVTS01+472                                               03980000
CVTRV297 EQU   CVTRV289                                                 03981000
CVTRV296 EQU   CVTRV289                                                 03982000
CVTRV295 EQU   CVTRV289                                                 03983000
CVTRV294 EQU   CVTRV289                                                 03984000
CVTRV293 EQU   CVTRV289                                                 03985000
CVTRV292 EQU   CVTRV289                                                 03986000
CVTRV291 EQU   CVTRV289                                                 03987000
CVTRV290 EQU   CVTRV289                                                 03988000
CVTRV288 EQU   CVTRV280                                                 03989000
CVTRV287 EQU   CVTRV280                                                 03990000
CVTRV286 EQU   CVTRV280                                                 03991000
CVTRV285 EQU   CVTRV280                                                 03992000
CVTRV284 EQU   CVTRV280                                                 03993000
CVTRV283 EQU   CVTRV280                                                 03994000
CVTRV282 EQU   CVTRV280                                                 03995000
CVTRV281 EQU   CVTRV280                                                 03996000
CVTRV279 EQU   CVTRV271                                                 03997000
CVTRV278 EQU   CVTRV271                                                 03998000
CVTRV277 EQU   CVTRV271                                                 03999000
CVTRV276 EQU   CVTRV271                                                 04000000
CVTRV275 EQU   CVTRV271                                                 04001000
CVTRV274 EQU   CVTRV271                                                 04002000
CVTRV273 EQU   CVTRV271                                                 04003000
CVTRV272 EQU   CVTRV271                                                 04004000
CVTRV270 EQU   CVTRV262                                                 04005000
CVTRV269 EQU   CVTRV262                                                 04006000
CVTRV268 EQU   CVTRV262                                                 04007000
CVTRV267 EQU   CVTRV262                                                 04008000
CVTRV266 EQU   CVTRV262                                                 04009000
CVTRV265 EQU   CVTRV262                                                 04010000
CVTRV264 EQU   CVTRV262                                                 04011000
CVTRV263 EQU   CVTRV262                                                 04012000
CVTVFP   EQU   CVTS01+464                                               04013000
CVTVSI   EQU   CVTS01+460                                               04014000
CVTVPSIB EQU   CVTS01+456                                               04015000
CVTMFACT EQU   CVTMFRTR                                                 04016000
CVTMFCTL EQU   CVTS01+448                                               04017000
CVTPVBP  EQU   CVTS01+444                                               04018000
CVTPWI   EQU   CVTS01+440                                               04019000
CVTRV254 EQU   CVTS01+438                                               04020000
CVTRV253 EQU   CVTS01+436                                               04021000
CVTRV252 EQU   CVTS01+434                                               04022000
CVTRV251 EQU   CVTS01+433                                               04023000
CVTRV250 EQU   CVTS01+432                                               04024000
CVTRV249 EQU   CVTS01+431                                               04025000
CVTRV248 EQU   CVTS01+430                                               04026000
CVTRV247 EQU   CVTS01+429                                               04027000
CVTRV246 EQU   CVTS01+428                                               04028000
CVTRV245 EQU   CVTRV237                                                 04029000
CVTRV244 EQU   CVTRV237                                                 04030000
CVTRV243 EQU   CVTRV237                                                 04031000
CVTRV242 EQU   CVTRV237                                                 04032000
CVTRV241 EQU   CVTRV237                                                 04033000
CVTRV240 EQU   CVTRV237                                                 04034000
CVTRV239 EQU   CVTRV237                                                 04035000
CVTRV238 EQU   CVTRV237                                                 04036000
CVTRV236 EQU   CVTRV228                                                 04037000
CVTRV235 EQU   CVTRV228                                                 04038000
CVTRV234 EQU   CVTRV228                                                 04039000
CVTRV233 EQU   CVTRV228                                                 04040000
CVTRV232 EQU   CVTRV228                                                 04041000
CVTRV231 EQU   CVTRV228                                                 04042000
CVTRV230 EQU   CVTRV228                                                 04043000
CVTRV229 EQU   CVTRV228                                                 04044000
CVTRV227 EQU   CVTRV219                                                 04045000
CVTRV226 EQU   CVTRV219                                                 04046000
CVTRV225 EQU   CVTRV219                                                 04047000
CVTRV224 EQU   CVTRV219                                                 04048000
CVTRV223 EQU   CVTRV219                                                 04049000
CVTRV222 EQU   CVTRV219                                                 04050000
CVTRV221 EQU   CVTRV219                                                 04051000
CVTRV220 EQU   CVTRV219                                                 04052000
CVTRV218 EQU   CVTRV210                                                 04053000
CVTRV217 EQU   CVTRV210                                                 04054000
CVTRV216 EQU   CVTRV210                                                 04055000
CVTRV215 EQU   CVTRV210                                                 04056000
CVTRV214 EQU   CVTRV210                                                 04057000
CVTRV213 EQU   CVTRV210                                                 04058000
CVTRV212 EQU   CVTRV210                                                 04059000
CVTRV211 EQU   CVTRV210                                                 04060000
CVTLCCAT EQU   CVTS01+420                                               04061000
CVTPCCAT EQU   CVTS01+416                                               04062000
CVTIPCRP EQU   CVTS01+412                                               04063000
CVTIPCRI EQU   CVTS01+408                                               04064000
CVTIPCDS EQU   CVTS01+404                                               04065000
CVTAIDVT EQU   CVTS01+400                                               04066000
CVTSSAP  EQU   CVTS01+396                                               04067000
CVTEHCIR EQU   CVTS01+392                                               04068000
CVTEHDEF EQU   CVTS01+388                                               04069000
CVTDAIR  EQU   CVTS01+384                                               04070000
CVTPERFM EQU   CVTS01+380                                               04071000
CVT044R2 EQU   CVTS01+376                                               04072000
CVTFETCH EQU   CVTS01+372                                               04073000
CVTRSTWD EQU   CVTS01+368                                               04074000
CVTSPOST EQU   CVTS01+364                                               04075000
CVTIOBP  EQU   CVTS01+360                                               04076000
CVTRECRQ EQU   CVTS01+352                                               04077000
CVTWSAC  EQU   CVTS01+348                                               04078000
CVTRV149 EQU   CVTS01+344                                               04079000
CVTWSAL  EQU   CVTS01+340                                               04080000
CVTSPSA  EQU   CVTS01+336                                               04081000
CVTGLMN  EQU   CVTS01+332                                               04082000
CVTVEAC0 EQU   CVTS01+328                                               04083000
CVT062R1 EQU   CVTS01+324                                               04084000
CVTRPOST EQU   CVTS01+320                                               04085000
CVTDQIQE EQU   CVTS01+316                                               04086000
CVTCSD   EQU   CVTS01+312                                               04087000
CVTLKRMA EQU   CVTS01+308                                               04088000
CVTRSPIE EQU   CVTS01+304                                               04089000
CVTRENQ  EQU   CVTS01+300                                               04090000
CVTLQCB  EQU   CVTS01+296                                               04091000
CVTFQCB  EQU   CVTS01+292                                               04092000
CVTQCS01 EQU   CVTS01+288                                               04093000
CVTAPFT  EQU   CVTS01+284                                               04094000
CVTPARRL EQU   CVTS01+280                                               04095000
CVTVWAIT EQU   CVTS01+276                                               04096000
CVTGSPL  EQU   CVTS01+272                                               04097000
CVTLSMQ  EQU   CVTS01+268                                               04098000
CVTGSMQ  EQU   CVTS01+264                                               04099000
CVTEXPRO EQU   CVTS01+260                                               04100000
CVTOPCTP EQU   CVTS01+256                                               04101000
CVTSIC   EQU   CVTS01+252                                               04102000
CVTTPIOS EQU   CVTS01+248                                               04103000
CVTRTMS  EQU   CVTS01+244                                               04104000
CVTSDBF  EQU   CVTS01+240                                               04105000
CVTSCBP  EQU   CVTS01+236                                               04106000
CVTSDMP  EQU   CVTS01+232                                               04107000
CVTSV60  EQU   CVTS01+228                                               04108000
CVTRTMCT EQU   CVTS01+224                                               04109000
CVTASCBL EQU   CVTS01+220                                               04110000
CVTASCBH EQU   CVTS01+216                                               04111000
CVTGDA   EQU   CVTS01+212                                               04112000
CVTASVT  EQU   CVTS01+208                                               04113000
CVTVVMDI EQU   CVTS01+204                                               04114000
CVTAQTOP EQU   CVTS01+200                                               04115000
CVTIOSCS EQU   CVTS01+196                                               04116000
CVTSDRM  EQU   CVTS01+192                                               04117000
CVTOPTE  EQU   CVTS01+188                                               04118000
CVTSTXU  EQU   CVTS01+184                                               04119000
CVTQUIS  EQU   CVTS01+180                                               04120000
CVTPARS  EQU   CVTS01+176                                               04121000
CVTS1EE  EQU   CVTS01+172                                               04122000
CVTFRAS  EQU   CVTS01+168                                               04123000
CVTQSAS  EQU   CVTS01+164                                               04124000
CVTCRAS  EQU   CVTS01+160                                               04125000
CVTCRMN  EQU   CVTS01+156                                               04126000
CVTDELCP EQU   CVTS01+152                                               04127000
CVTFRECL EQU   CVTS01+148                                               04128000
CVTGETCL EQU   CVTS01+144                                               04129000
CVTBLDCP EQU   CVTS01+140                                               04130000
CVTAUTHL EQU   CVTS01+136                                               04131000
CVTSCAN  EQU   CVTS01+132                                               04132000
CVTRV144 EQU   CVTS01+130                                               04133000
CVTMAXMP EQU   CVTS01+128                                               04134000
CVTSTCK  EQU   CVTS01+124                                               04135000
CVTRV139 EQU   CVTS01+123                                               04136000
CVTDSSAC EQU   CVTS01+122                                               04137000
CVTRV513 EQU   CVTS01+121                                               04138000
CVTIOSPL EQU   CVTS01+120                                               04139000
CVTPTGT  EQU   CVTS01+116                                               04140000
CVTCSPIE EQU   CVTS01+112                                               04141000
CVTSMFEX EQU   CVTS01+108                                               04142000
CVTOLT0A EQU   CVTS01+104                                               04143000
CVTSRBRT EQU   CVTS01+100                                               04144000
CVTPUTL  EQU   CVTS01+96                                                04145000
CVTASCRL EQU   CVTS01+92                                                04146000
CVTASCRF EQU   CVTS01+88                                                04147000
CVTRV326 EQU   CVTS01+84                                                04148000
CVTRV325 EQU   CVTS01+80                                                04149000
CVTRV324 EQU   CVTS01+76                                                04150000
CVT0VL01 EQU   CVTS01+72                                                04151000
CVTSHRVM EQU   CVTS01+68                                                04152000
CVTRV332 EQU   CVTS01+64                                                04153000
CVTTAS   EQU   CVTS01+60                                                04154000
CVTRSCN  EQU   CVTS01+56                                                04155000
CVTTRAC2 EQU   CVTS01+54                                                04156000
CVTTRACE EQU   CVTS01+52                                                04157000
CVTAPG   EQU   CVTS01+51                                                04158000
CVTSDTRC EQU   CVTCTLFG                                                 04159000
CVTGTRCE EQU   CVTCTLFG                                                 04160000
CVTNOMP  EQU   CVTCTLFG                                                 04161000
CVTRSV79 EQU   CVTCTLFG                                                 04162000
CVTDSTAT EQU   CVTCTLFG                                                 04163000
CVTRSV78 EQU   CVTCTLFG                                                 04164000
CVTRV333 EQU   CVTCTLFG                                                 04165000
CVTRV323 EQU   CVTCTLFG                                                 04166000
CVTSPVLK EQU   CVTS01+49                                                04167000
CVTRSV77 EQU   CVTS01+48                                                04168000
CVTRV331 EQU   CVTS01+44                                                04169000
CVTRV330 EQU   CVTS01+40                                                04170000
CVTRV329 EQU   CVTS01+36                                                04171000
CVTRV328 EQU   CVTS01+32                                                04172000
CVTRV322 EQU   CVTS01+28                                                04173000
CVTSLID  EQU   CVTSLIDA+1                                               04174000
CVTSYLK  EQU   CVTSLIDA                                                 04175000
CVTRV321 EQU   CVTS01+20                                                04176000
CVTRV320 EQU   CVTS01+16                                                04177000
CVTLPDIR EQU   CVTLPDIA+1                                               04178000
CVTRSV69 EQU   CVTDIRST                                                 04179000
CVTRSV68 EQU   CVTDIRST                                                 04180000
CVTRSV67 EQU   CVTDIRST                                                 04181000
CVTRSV66 EQU   CVTDIRST                                                 04182000
CVTRSV65 EQU   CVTDIRST                                                 04183000
CVTRSV64 EQU   CVTDIRST                                                 04184000
CVTRSV63 EQU   CVTDIRST                                                 04185000
CVTDICOM EQU   CVTDIRST                                                 04186000
CVTPVTP  EQU   CVTS01+8                                                 04187000
CVTLPDSR EQU   CVTS01+4                                                 04188000
CVTGETL  EQU   CVTS01                                                   04189000
SAVER12  EQU   SAVEFORM+68                                              04190000
SAVER11  EQU   SAVEFORM+64                                              04191000
SAVER10  EQU   SAVEFORM+60                                              04192000
SAVER9   EQU   SAVEFORM+56                                              04193000
SAVER8   EQU   SAVEFORM+52                                              04194000
SAVER7   EQU   SAVEFORM+48                                              04195000
SAVER6   EQU   SAVEFORM+44                                              04196000
SAVER5   EQU   SAVEFORM+40                                              04197000
SAVER4   EQU   SAVEFORM+36                                              04198000
SAVER3   EQU   SAVEFORM+32                                              04199000
SAVER2   EQU   SAVEFORM+28                                              04200000
SAVER1   EQU   SAVEFORM+24                                              04201000
SAVER0   EQU   SAVEFORM+20                                              04202000
SAVER14  EQU   SAVEFORM+12                                              04203000
SAVEID   EQU   SAVEFORM                                                 04204000
REGL15   EQU   REGLOCAL+60                                              04205000
REGL14   EQU   REGLOCAL+56                                              04206000
REGL13   EQU   REGLOCAL+52                                              04207000
REGL12   EQU   REGLOCAL+48                                              04208000
REGL11   EQU   REGLOCAL+44                                              04209000
REGL10   EQU   REGLOCAL+40                                              04210000
REGL9    EQU   REGLOCAL+36                                              04211000
REGL8    EQU   REGLOCAL+32                                              04212000
REGL7    EQU   REGLOCAL+28                                              04213000
REGL6    EQU   REGLOCAL+24                                              04214000
REGL5    EQU   REGLOCAL+20                                              04215000
REGL4    EQU   REGLOCAL+16                                              04216000
REGL3    EQU   REGLOCAL+12                                              04217000
REGL2    EQU   REGLOCAL+8                                               04218000
REGL1    EQU   REGLOCAL+4                                               04219000
REGL0    EQU   REGLOCAL                                                 04220000
SDLSPN   EQU   SDL+1                                                    04221000
SDLNUM   EQU   SDL                                                      04222000
VCTVCCTV EQU   VCCT+108                                                 04223000
@NM00053 EQU   VCCT+102                                                 04224000
VCTEXTRA EQU   VCCT+100                                                 04225000
VCTCPOUT EQU   VCCT+96                                                  04226000
VCTSVCTB EQU   VCCT+92                                                  04227000
VCTPGT   EQU   VCCT+88                                                  04228000
VCTJBNME EQU   VCCT+72                                                  04229000
@NM00052 EQU   VCTCBID                                                  04230000
VCTAUDIT EQU   VCCT+62                                                  04231000
VCTASID  EQU   VCCT+60                                                  04232000
VCTPTRT  EQU   VCCT+56                                                  04233000
@NM00051 EQU   VCCT+52                                                  04234000
VCTASCB  EQU   VCCT+48                                                  04235000
VCTCPUC  EQU   VCCT+46                                                  04236000
VCTWKC   EQU   VCCT+45                                                  04237000
VCTWKHI  EQU   VCCT+44                                                  04238000
VCTSUBPL EQU   VCCT+40                                                  04239000
VCTARB   EQU   VCCT+36                                                  04240000
VCTIODB  EQU   VCCT+32                                                  04241000
VCTBCTC  EQU   VCCT+28                                                  04242000
VCTSTOR  EQU   VCCT+16                                                  04243000
VCTRECVA EQU   VCCT+10                                                  04244000
@NM00050 EQU   VCTFLGS                                                  04245000
VCTNOI22 EQU   VCTFLGS                                                  04246000
VCTLRCLM EQU   VCTFLGS                                                  04247000
VCTMEMIN EQU   VCTFLGS                                                  04248000
VCTSADMP EQU   VCTFLGS                                                  04249000
@NM00049 EQU   VCTRECSN                                                 04250000
VCTRSMR  EQU   VCTRECSN                                                 04251000
VCTEXIR  EQU   VCTRECSN                                                 04252000
VCTUPDR  EQU   VCTRECSN                                                 04253000
VCTPGIR  EQU   VCTRECSN                                                 04254000
VCTVCT   EQU   VCCT                                                     04255000
RCBSTOR  EQU   RCB+4                                                    04256000
PTRTVS   EQU   PTRT+1032                                                04257000
PTRTRS   EQU   PTRT+8                                                   04258000
PTRTLGID EQU   PTRT+4                                                   04259000
PTRTPTRT EQU   PTRT                                                     04260000
PSWEND   EQU   PSW+8                                                    04261000
PSWIA    EQU   PSW+4                                                    04262000
PSWSP    EQU   @NM00048                                                 04263000
PSWSIG   EQU   PSWCCPM                                                  04264000
PSWEU    EQU   PSWCCPM                                                  04265000
PSWDO    EQU   PSWCCPM                                                  04266000
PSWFPO   EQU   PSWCCPM                                                  04267000
@NM00047 EQU   PSWCCPM                                                  04268000
@NM00046 EQU   PSWCCPM                                                  04269000
PSWPRBLM EQU   @NM00045                                                 04270000
PSWAIT   EQU   @NM00045                                                 04271000
PSWMCH   EQU   @NM00045                                                 04272000
PSWMODE  EQU   @NM00045                                                 04273000
PSWKEY   EQU   @NM00045                                                 04274000
PSWXTRNL EQU   PSWSM                                                    04275000
PSWIO    EQU   PSWSM                                                    04276000
PSWDAT   EQU   PSWSM                                                    04277000
@NM00044 EQU   PSWSM                                                    04278000
@NM00043 EQU   PSWSM                                                    04279000
@NM00042 EQU   PSWSM                                                    04280000
PSWPER   EQU   PSWSM                                                    04281000
@NM00041 EQU   PSWSM                                                    04282000
@NM00040 EQU   MDCB+87                                                  04283000
@NM00039 EQU   MDCBFLGS                                                 04284000
MDCBDUMP EQU   MDCBFLGS                                                 04285000
MDCBASMI EQU   MDCBFLGS                                                 04286000
MDCBPI   EQU   MDCB+84                                                  04287000
MDCBSTOR EQU   MDCB+80                                                  04288000
MDCBGR15 EQU   MDCBGRS+60                                               04289000
MDCBGR14 EQU   MDCBGRS+56                                               04290000
MDCBGR13 EQU   MDCBGRS+52                                               04291000
MDCBGR12 EQU   MDCBGRS+48                                               04292000
MDCBGR11 EQU   MDCBGRS+44                                               04293000
MDCBGR10 EQU   MDCBGRS+40                                               04294000
MDCBGR9  EQU   MDCBGRS+36                                               04295000
MDCBGR8  EQU   MDCBGRS+32                                               04296000
MDCBGR7  EQU   MDCBGRS+28                                               04297000
MDCBGR6  EQU   MDCBGRS+24                                               04298000
MDCBGR5  EQU   MDCBGRS+20                                               04299000
MDCBGR4  EQU   MDCBGRS+16                                               04300000
MDCBGR3  EQU   MDCBGRS+12                                               04301000
MDCBGR2  EQU   MDCBGRS+8                                                04302000
MDCBGR1  EQU   MDCBGRS+4                                                04303000
MDCBGR0  EQU   MDCBGRS                                                  04304000
MDCBPSW  EQU   MDCB+8                                                   04305000
MDCBNEXT EQU   MDCB+4                                                   04306000
MDCBMDCB EQU   MDCB                                                     04307000
MDCEAVIL EQU   MDCE+8                                                   04308000
MDCEACTV EQU   MDCE+4                                                   04309000
MDCEMDCE EQU   MDCE                                                     04310000
IODBSENS EQU   IODB+40                                                  04311000
IODBR    EQU   IODBCCHH+7                                               04312000
IODBHH   EQU   IODBSRCH+2                                               04313000
IODBCC   EQU   IODBSRCH                                                 04314000
IODBSEEK EQU   IODBCCHH+1                                               04315000
IODBM    EQU   IODBCCHH                                                 04316000
IODBCSW  EQU   IODB+24                                                  04317000
IODBCAW  EQU   IODB+20                                                  04318000
IODBCPU  EQU   IODB+14                                                  04319000
IODBTYPE EQU   IODB+13                                                  04320000
IODBCLAS EQU   IODB+12                                                  04321000
IODBDEV  EQU   IODB+10                                                  04322000
@NM00038 EQU   IODBFLAG+1                                               04323000
IODBSTRT EQU   IODBFLAG                                                 04324000
IODBCONW EQU   IODBFLAG                                                 04325000
IODBACTV EQU   IODBFLAG                                                 04326000
IODBHALT EQU   IODBFLAG                                                 04327000
IODBIOC  EQU   IODBFLAG                                                 04328000
IODBINT  EQU   IODBFLAG                                                 04329000
IODBPTRM EQU   IODBFLAG                                                 04330000
IODBTERM EQU   IODBFLAG                                                 04331000
IODBIDEN EQU   IODB+4                                                   04332000
IODBIODB EQU   IODB                                                     04333000
DSCETEND EQU   DSCE+20                                                  04334000
DSCETCUR EQU   DSCE+16                                                  04335000
DSCETBEG EQU   DSCE+12                                                  04336000
DSCENEXT EQU   DSCE+8                                                   04337000
DSCEBEGN EQU   DSCE+4                                                   04338000
DSCEDSCE EQU   DSCE                                                     04339000
CSWCNT   EQU   CSW+6                                                    04340000
CSWCHC   EQU   CSWCSTAT                                                 04341000
CSWICC   EQU   CSWCSTAT                                                 04342000
CSWCCC   EQU   CSWCSTAT                                                 04343000
CSWCDC   EQU   CSWCSTAT                                                 04344000
CSWPTC   EQU   CSWCSTAT                                                 04345000
CSWPGC   EQU   CSWCSTAT                                                 04346000
CSWIL    EQU   CSWCSTAT                                                 04347000
CSWPCI   EQU   CSWCSTAT                                                 04348000
CSWUE    EQU   CSWUSTAT                                                 04349000
CSWUC    EQU   CSWUSTAT                                                 04350000
CSWDE    EQU   CSWUSTAT                                                 04351000
CSWCE    EQU   CSWUSTAT                                                 04352000
CSWBUSY  EQU   CSWUSTAT                                                 04353000
CSWCUE   EQU   CSWUSTAT                                                 04354000
CSWSTMOD EQU   CSWUSTAT                                                 04355000
CSWATTN  EQU   CSWUSTAT                                                 04356000
CSWCADDR EQU   CSW+1                                                    04357000
@NM00037 EQU   CSWKEY00                                                 04358000
CSWKEY   EQU   CSWKEY00                                                 04359000
CCWCNT   EQU   CCW+6                                                    04360000
@NM00036 EQU   CCW+5                                                    04361000
@NM00035 EQU   CCWFLAGS                                                 04362000
CCWIDA   EQU   CCWFLAGS                                                 04363000
CCWPCI   EQU   CCWFLAGS                                                 04364000
CCWSKIP  EQU   CCWFLAGS                                                 04365000
CCWSLI   EQU   CCWFLAGS                                                 04366000
CCWCC    EQU   CCWFLAGS                                                 04367000
CCWDC    EQU   CCWFLAGS                                                 04368000
CCWDADDR EQU   CCW+1                                                    04369000
CCWCMD   EQU   CCW                                                      04370000
CTHWMAX  EQU   CTDMPTYP+29                                              04371000
CTHWM    EQU   CTDMPTYP+28                                              04372000
CTPRMT2X EQU   CTPRMT2+1                                                04373000
CTPRMT2Y EQU   CTPRMT2                                                  04374000
CTPRMT1X EQU   CTPRMT1+1                                                04375000
CTPRMT1Y EQU   CTPRMT1                                                  04376000
CTVCCT   EQU   CTDMPTYP+20                                              04377000
CTEOR    EQU   CTDMPTYP+16                                              04378000
CTCOMMIO EQU   CTDMPTYP+12                                              04379000
CTLWKAD  EQU   CTDMPTYP+8                                               04380000
CTCONSOL EQU   CTDMPTYP+4                                               04381000
@NM00034 EQU   CTBUFTYP                                                 04382000
CTDUMP   EQU   CTBUFTYP                                                 04383000
CTLSQA   EQU   CTBUFTYP                                                 04384000
CTPGT    EQU   CTBUFTYP                                                 04385000
CTWKFLE  EQU   CTBUFTYP                                                 04386000
@NM00033 EQU   CTBUFTYP                                                 04387000
@NM00032 EQU   CTCONFLG                                                 04388000
CTREAD   EQU   CTCONFLG                                                 04389000
CTMSGOUT EQU   CTCONFLG                                                 04390000
@NM00031 EQU   CTDMPTYP+1                                               04391000
@NM00030 EQU   CTIOTYPE                                                 04392000
CTIORSET EQU   CTIOTYPE                                                 04393000
CTIOINT  EQU   CTIOTYPE                                                 04394000
CTIOCON  EQU   CTIOTYPE                                                 04395000
CTIOWK   EQU   CTIOTYPE                                                 04396000
CTIODA   EQU   CTIOTYPE                                                 04397000
CTIOOUT  EQU   CTIOTYPE                                                 04398000
CTIOTERM EQU   CTIOTYPE                                                 04399000
CTEBCOPR EQU   CCT+49                                                   04400000
@NM00029 EQU   CTLOWFLG                                                 04401000
CTWKSTUS EQU   CTLOWFLG                                                 04402000
CTINIT   EQU   CTLOWFLG                                                 04403000
CTFP     EQU   CTLOWFLG                                                 04404000
CTVIRTD  EQU   CTLOWFLG                                                 04405000
CTEBCOPD EQU   CCT+45                                                   04406000
CTCONTYP EQU   CCT+44                                                   04407000
CTOUTAD  EQU   CCT+42                                                   04408000
CTCPUI   EQU   CCT+40                                                   04409000
CTERBCON EQU   CCT+36                                                   04410000
CTERBTPE EQU   CCT+32                                                   04411000
CTERBDA  EQU   CCT+28                                                   04412000
CTCCHHW  EQU   CCT+24                                                   04413000
CTCCHHE  EQU   CCT+20                                                   04414000
CTCCHHS  EQU   CCT+16                                                   04415000
CTPGECNT EQU   CCT+15                                                   04416000
CTCCHHR  EQU   CCT+8                                                    04417000
CTINADDR EQU   CCT+6                                                    04418000
CTSENSE  EQU   CCT+4                                                    04419000
CTDEVTYP EQU   CCT+3                                                    04420000
@NM00028 EQU   CTFLG2                                                   04421000
CTALTCON EQU   CTFLG2                                                   04422000
CTWKDONE EQU   CTFLG2                                                   04423000
CTVIRTR  EQU   CTFLG2                                                   04424000
CTNOSTAT EQU   CTFLG2                                                   04425000
CTPGEFLT EQU   CTFLG2                                                   04426000
CTSTOR   EQU   CTFLG2                                                   04427000
CTDUPSW  EQU   CTFLG2                                                   04428000
CTERREC  EQU   CTFLG1                                                   04429000
CTMP     EQU   CTFLG1                                                   04430000
@NM00027 EQU   CTFLG1                                                   04431000
CTDEFO   EQU   CTFLG1                                                   04432000
CTWORK   EQU   CTFLG1                                                   04433000
CTMORTPE EQU   CTFLG1                                                   04434000
CTDEVICE EQU   CTFLG1                                                   04435000
CTERROR  EQU   CTFLG1                                                   04436000
CTWAIT   EQU   CCT                                                      04437000
@NM00026 EQU   BCT+46                                                   04438000
BCTRECLM EQU   BCTFLGI                                                  04439000
BCTIOERR EQU   BCTFLGI                                                  04440000
BCTALLOC EQU   BCTFLGI                                                  04441000
BCTCOMP  EQU   BCTFLGI                                                  04442000
@NM00025 EQU   BCTFLGT                                                  04443000
BCTPGTF  EQU   BCTFLGT                                                  04444000
BCTDUMP  EQU   BCTFLGT                                                  04445000
BCTLSQA  EQU   BCTFLGT                                                  04446000
BCTASM   EQU   BCTFLGT                                                  04447000
BCTPGT   EQU   BCTFLGT                                                  04448000
BCTWKFLE EQU   BCTFLGT                                                  04449000
@NM00024 EQU   BCTFLGT                                                  04450000
@NM00023 EQU   BCTLSID                                                  04451000
@NM00022 EQU   BCT+36                                                   04452000
@NM00021 EQU   BCT+28                                                   04453000
BCTMDCB  EQU   BCT+24                                                   04454000
BCTPGTE  EQU   BCT+20                                                   04455000
BCTRADDR EQU   BCT+16                                                   04456000
BCTVADDR EQU   BCT+12                                                   04457000
BCTASID  EQU   BCT+10                                                   04458000
BCTKEY2  EQU   BCT+9                                                    04459000
BCTKEY1  EQU   BCT+8                                                    04460000
BCTNEXT  EQU   BCT+4                                                    04461000
BCTBCT   EQU   BCT                                                      04462000
BCTHLAST EQU   BCTH+8                                                   04463000
BCTHFRST EQU   BCTH+4                                                   04464000
BCTHBCTH EQU   BCTH                                                     04465000
ARBADDRE EQU   ARB+4                                                    04466000
ARBADDRB EQU   ARB                                                      04467000
ASMCPRES EQU   ASMCPRSQ+4                                               04468000
ASMCPTAK EQU   ASMCPRSQ                                                 04469000
ASMCPCNT EQU   ASMCPAVQ+4                                               04470000
ASMCPAVL EQU   ASMCPAVQ                                                 04471000
ASMCPEXT EQU   ASMPOOLS+6                                               04472000
ASMCPSIZ EQU   ASMPOOLS+4                                               04473000
ASMCPID  EQU   ASMPOOLS                                                 04474000
ASMRSV12 EQU   ASMVT+1000                                               04475000
ASMSAVE  EQU   ASMVT+928                                                04476000
ASMWKSA7 EQU   ASMVT+848                                                04477000
ASMWKSA6 EQU   ASMVT+768                                                04478000
ASMACEPC EQU   ASMVT+344                                                04479000
ASMSWKPC EQU   ASMVT+328                                                04480000
ASMBWKPC EQU   ASMVT+312                                                04481000
ASMIOEPC EQU   ASMVT+296                                                04482000
ASMRSV10 EQU   ASMVT+280                                                04483000
ASMPVACE EQU   ASMVT+276                                                04484000
ASMPIOFR EQU   ASMVT+272                                                04485000
ASMPVACQ EQU   ASMVT+268                                                04486000
ASMPMSGS EQU   ASMVT+264                                                04487000
ASMPMSG0 EQU   ASMVT+260                                                04488000
ASMPFRLG EQU   ASMVT+256                                                04489000
ASMPRLG  EQU   ASMVT+252                                                04490000
ASMPACT  EQU   ASMVT+248                                                04491000
ASMPSAV  EQU   ASMVT+244                                                04492000
ASMPCMP  EQU   ASMVT+240                                                04493000
ASMPCMPA EQU   ASMVT+236                                                04494000
ASMPCMPN EQU   ASMVT+232                                                04495000
ASMPCMPD EQU   ASMVT+228                                                04496000
ASMPEX   EQU   ASMVT+224                                                04497000
ASMVRMTR EQU   ASMVT+220                                                04498000
ASMPSRBC EQU   ASMVT+216                                                04499000
ASMPSRMT EQU   ASMVT+212                                                04500000
ASMPSWPD EQU   ASMVT+208                                                04501000
ASMPTM   EQU   ASMVT+204                                                04502000
ASMPFRSW EQU   ASMVT+200                                                04503000
ASMPFRSL EQU   ASMVT+196                                                04504000
ASMPQIOE EQU   ASMVT+192                                                04505000
ASMRSV8  EQU   ASMVT+184                                                04506000
ASMTASCB EQU   ASMVT+180                                                04507000
ASMRLGWQ EQU   ASMVT+176                                                04508000
ASMRLGRQ EQU   ASMVT+172                                                04509000
ASMTMECB EQU   ASMVT+168                                                04510000
ASMTCBPT EQU   ASMVT+164                                                04511000
ASMREQCT EQU   ASMVT+160                                                04512000
ASMGOSWK EQU   ASMGOSQS+4                                               04513000
ASMGOSWT EQU   ASMGOSQS                                                 04514000
ASMLSAIH EQU   ASMLSAI+4                                                04515000
ASMLSAIL EQU   ASMLSAI                                                  04516000
ASMCINV  EQU   ASMVT+140                                                04517000
ASMSTGXA EQU   ASMVT+136                                                04518000
ASMLGVT  EQU   ASMVT+132                                                04519000
ASMSLOTV EQU   ASMVT+128                                                04520000
ASMERRS  EQU   ASMVT+124                                                04521000
ASMNVSC  EQU   ASMVT+120                                                04522000
ASMVSC   EQU   ASMVT+116                                                04523000
ASMSLOTS EQU   ASMVT+112                                                04524000
ASMBKSLT EQU   ASMVT+108                                                04525000
ASMRSV7  EQU   ASMVT+92                                                 04526000
ASMPSRB  EQU   ASMVT+88                                                 04527000
ASMSRBCT EQU   ASMVT+84                                                 04528000
ASMIOCNT EQU   ASMVT+80                                                 04529000
ASMBURST EQU   ASMVT+76                                                 04530000
ASMPCCWN EQU   ASMVT+72                                                 04531000
ASMPCCWC EQU   ASMPCCWQ+4                                               04532000
ASMPCCWA EQU   ASMPCCWQ                                                 04533000
ASMRSV6  EQU   ASMVT+48                                                 04534000
ASMIORQC EQU   ASMVT+44                                                 04535000
ASMIORQR EQU   ASMVT+40                                                 04536000
ASMSTAGL EQU   ASMSTAGQ+4                                               04537000
ASMSTAGF EQU   ASMSTAGQ                                                 04538000
ASMRSV5  EQU   ASMVT+28                                                 04539000
ASMMSGBF EQU   ASMVT+24                                                 04540000
ASMEREC  EQU   ASMVT+20                                                 04541000
ASMTRPAG EQU   ASMVT+16                                                 04542000
ASMGOS   EQU   ASMVT+12                                                 04543000
ASMRSV4  EQU   ASMVT+2                                                  04544000
ASMWARM  EQU   ASMFLAG2                                                 04545000
ASMQUICK EQU   ASMFLAG2                                                 04546000
ASMNOTPT EQU   ASMFLAG2                                                 04547000
ASMNOTMR EQU   ASMFLAG2                                                 04548000
ASMNOSAV EQU   ASMFLAG2                                                 04549000
ASMCALLQ EQU   ASMFLAG2                                                 04550000
ASMPLPAS EQU   ASMFLAG1                                                 04551000
ASMCOMMF EQU   ASMFLAG1                                                 04552000
ASMPLPAF EQU   ASMFLAG1                                                 04553000
ASMNODPX EQU   ASMFLAG1                                                 04554000
ASMRSV1  EQU   ASMFLAG1                                                 04555000
ASMNOLCL EQU   ASMFLAG1                                                 04556000
ASMNOCWQ EQU   ASMFLAG1                                                 04557000
ASMDUPLX EQU   ASMFLAG1                                                 04558000
LPMBSST  EQU   IDALPMB+28                                               04559000
LPMBEXT  EQU   IDALPMB+24                                               04560000
@NM00016 EQU   IDALPMB+22                                               04561000
LPMBLKTR EQU   IDALPMB+20                                               04562000
LPMBLEN  EQU   IDALPMB+2                                                04563000
@NM00015 EQU   LPMBFLGS                                                 04564000
LPMBSSTH EQU   LPMBFLGS                                                 04565000
LPMBTOFL EQU   LPMBFLGS                                                 04566000
LPMSS    EQU   LPMBFLGS                                                 04567000
LPMREPL  EQU   LPMBFLGS                                                 04568000
LPMBRPS  EQU   LPMBFLGS                                                 04569000
LPMBID   EQU   IDALPMB                                                  04570000
EDBTKBAL EQU   IDAEDB+20                                                04571000
@NM00014 EQU   EDBFLG1                                                  04572000
EDBPSDS  EQU   EDBFLG1                                                  04573000
EDBTOFLW EQU   EDBFLG1                                                  04574000
EDBLKR   EQU   EDBFLG1                                                  04575000
@NM00013 EQU   IDAEDB                                                   04576000
SRESDCTE EQU   SARTE+36                                                 04577000
SRESAT   EQU   SARTE+32                                                 04578000
SREIORB  EQU   SARTE+28                                                 04579000
SRERRCNT EQU   SARTE+24                                                 04580000
SREAVLSL EQU   SARTE+20                                                 04581000
SRETOTSL EQU   SARTE+16                                                 04582000
SRESCCW  EQU   SARTE+12                                                 04583000
SRENN    EQU   SARTE+10                                                 04584000
@NM00012 EQU   SREFLG                                                   04585000
SREFIXED EQU   SREFLG                                                   04586000
SREDRIVE EQU   SREFLG                                                   04587000
SRENUSE  EQU   SREFLG                                                   04588000
@NM00011 EQU   SARTE+8                                                  04589000
SRELOCK  EQU   SARTE+4                                                  04590000
SRENEXT  EQU   SARTE                                                    04591000
@NM00010 EQU   SARTHDR+60                                               04592000
SARSETSZ EQU   SARTHDR+56                                               04593000
SARSRBCT EQU   SARTHDR+52                                               04594000
SARSRBP  EQU   SARTHDR+48                                               04595000
SARWAITL EQU   SARWAITQ+4                                               04596000
SARWAITF EQU   SARWAITQ                                                 04597000
SARSETCT EQU   SARTHDR+36                                               04598000
SARSCCWQ EQU   SARTHDR+32                                               04599000
SARSDCT  EQU   SARTHDR+28                                               04600000
SARDSNL  EQU   SARTHDR+24                                               04601000
SARMOVNX EQU   SARTHDR+20                                               04602000
SARFXDNX EQU   SARTHDR+16                                               04603000
@NM00009 EQU   SARTHDR+12                                               04604000
SARSIZE  EQU   SARTHDR+4                                                04605000
SARID    EQU   SARTHDR                                                  04606000
@NM00008 EQU   PARTENT+62                                               04607000
PARELCYL EQU   PARTENT+60                                               04608000
PARERQTM EQU   PARTENT+56                                               04609000
PAREWTQE EQU   PARTENT+52                                               04610000
PARENODE EQU   PARTENT+48                                               04611000
PAREPCTP EQU   PARTENT+36                                               04612000
PAREPATP EQU   PARTENT+32                                               04613000
PAREIORB EQU   PARTENT+28                                               04614000
PARERRCT EQU   PARTENT+24                                               04615000
PARESLTA EQU   PARTENT+20                                               04616000
PARESZSL EQU   PARTENT+16                                               04617000
PAREIOEQ EQU   PARTENT+12                                               04618000
PARENN   EQU   PARTENT+10                                               04619000
@NM00007 EQU   PAREFLG1                                                 04620000
PAREINCP EQU   PAREFLG1                                                 04621000
PARENUSE EQU   PAREFLG1                                                 04622000
@NM00006 EQU   PARETYPE                                                 04623000
PARELOCL EQU   PARETYPE                                                 04624000
PAREDPLX EQU   PARETYPE                                                 04625000
PARECOMM EQU   PARETYPE                                                 04626000
PAREPLPA EQU   PARETYPE                                                 04627000
PARECPCT EQU   PARELKUP+2                                               04628000
PAREIORN EQU   PARELKUP+1                                               04629000
@NM00005 EQU   PARELKFL                                                 04630000
PAREFSIP EQU   PARELKFL                                                 04631000
PAREPARE EQU   PARTENT                                                  04632000
PARTLOCL EQU   PARTLOCQ+4                                               04633000
PARTLOCF EQU   PARTLOCQ                                                 04634000
PARTDUPL EQU   PARTDUPQ+4                                               04635000
PARTDUPF EQU   PARTDUPQ                                                 04636000
PARTSPLL EQU   PARTSPLQ+4                                               04637000
PARTSPLF EQU   PARTSPLQ                                                 04638000
PARTCOML EQU   PARTCOMQ+4                                               04639000
PARTCOMF EQU   PARTCOMQ                                                 04640000
PARTLOCK EQU   PARTHDR+44                                               04641000
PARTLKUP EQU   PARTHDR+40                                               04642000
@NM00004 EQU   PARTHDR+34                                               04643000
PARTLCNT EQU   PARTHDR+32                                               04644000
PARTPCTQ EQU   PARTHDR+28                                               04645000
PARTDSNL EQU   PARTTPAR                                                 04646000
PARTCIR2 EQU   PARTHDR+20                                               04647000
PARTCIR1 EQU   PARTHDR+16                                               04648000
PARTAIAE EQU   PARTHDR+12                                               04649000
PARTSIZE EQU   PARTHDR+4                                                04650000
PARTIDEN EQU   PARTHDR                                                  04651000
CVTLEVL  EQU   CVTRELNO+2                                               04652000
CVTNUMB  EQU   CVTRELNO                                                 04653000
CVTMDL   EQU   CVTFIX+250                                               04654000
@NM00003 EQU   CVTFIX+248                                               04655000
@NM00002 EQU   CVTFIX                                                   04656000
CVTRV482 EQU   CVTXTNT2+128                                             04657000
CVTRV481 EQU   CVTXTNT2+124                                             04658000
CVTRV480 EQU   CVTXTNT2+120                                             04659000
CVTRV479 EQU   CVTXTNT2+118                                             04660000
CVTRV478 EQU   CVTXTNT2+117                                             04661000
CVTRV477 EQU   CVTXTNT2+116                                             04662000
CVTRV476 EQU   CVTXTNT2+115                                             04663000
CVTRV475 EQU   CVTXTNT2+114                                             04664000
CVTRV474 EQU   CVTRV466                                                 04665000
CVTRV473 EQU   CVTRV466                                                 04666000
CVTRV472 EQU   CVTRV466                                                 04667000
CVTRV471 EQU   CVTRV466                                                 04668000
CVTRV470 EQU   CVTRV466                                                 04669000
CVTRV469 EQU   CVTRV466                                                 04670000
CVTRV468 EQU   CVTRV466                                                 04671000
CVTRV467 EQU   CVTRV466                                                 04672000
CVTRV465 EQU   CVTRV457                                                 04673000
CVTRV464 EQU   CVTRV457                                                 04674000
CVTRV463 EQU   CVTRV457                                                 04675000
CVTRV462 EQU   CVTRV457                                                 04676000
CVTRV461 EQU   CVTRV457                                                 04677000
CVTRV460 EQU   CVTRV457                                                 04678000
CVTRV459 EQU   CVTRV457                                                 04679000
CVTRV458 EQU   CVTRV457                                                 04680000
CVTRV456 EQU   CVTXTNT2+108                                             04681000
CVTRV455 EQU   CVTXTNT2+104                                             04682000
CVTRV454 EQU   CVTXTNT2+100                                             04683000
CVTRV453 EQU   CVTXTNT2+96                                              04684000
CVTRV452 EQU   CVTXTNT2+94                                              04685000
CVTRV451 EQU   CVTXTNT2+92                                              04686000
CVTRV450 EQU   CVTXTNT2+90                                              04687000
CVTRV449 EQU   CVTXTNT2+88                                              04688000
CVTRV448 EQU   CVTXTNT2+87                                              04689000
CVTRV447 EQU   CVTXTNT2+86                                              04690000
CVTRV446 EQU   CVTRV438                                                 04691000
CVTRV445 EQU   CVTRV438                                                 04692000
CVTRV444 EQU   CVTRV438                                                 04693000
CVTRV443 EQU   CVTRV438                                                 04694000
CVTRV442 EQU   CVTRV438                                                 04695000
CVTRV441 EQU   CVTRV438                                                 04696000
CVTRV440 EQU   CVTRV438                                                 04697000
CVTRV439 EQU   CVTRV438                                                 04698000
CVTRV437 EQU   CVTRV429                                                 04699000
CVTRV436 EQU   CVTRV429                                                 04700000
CVTRV435 EQU   CVTRV429                                                 04701000
CVTRV434 EQU   CVTRV429                                                 04702000
CVTRV433 EQU   CVTRV429                                                 04703000
CVTRV432 EQU   CVTRV429                                                 04704000
CVTRV431 EQU   CVTRV429                                                 04705000
CVTRV430 EQU   CVTRV429                                                 04706000
CVTRV428 EQU   CVTXTNT2+80                                              04707000
CVTRV427 EQU   CVTXTNT2+76                                              04708000
CVTRV426 EQU   CVTXTNT2+72                                              04709000
CVTRV425 EQU   CVTXTNT2+68                                              04710000
CVTATACT EQU   CVTATCVT                                                 04711000
CVTRV423 EQU   CVTXTNT2+62                                              04712000
CVTRV422 EQU   CVTXTNT2+60                                              04713000
CVTRV421 EQU   CVTXTNT2+58                                              04714000
CVTRV420 EQU   CVTXTNT2+56                                              04715000
CVTRV419 EQU   CVTXTNT2+55                                              04716000
CVTRV418 EQU   CVTXTNT2+54                                              04717000
CVTRV417 EQU   CVTRV409                                                 04718000
CVTRV416 EQU   CVTRV409                                                 04719000
CVTRV415 EQU   CVTRV409                                                 04720000
CVTRV414 EQU   CVTRV409                                                 04721000
CVTRV413 EQU   CVTRV409                                                 04722000
CVTRV412 EQU   CVTRV409                                                 04723000
CVTRV411 EQU   CVTRV409                                                 04724000
CVTRV410 EQU   CVTRV409                                                 04725000
CVTRV408 EQU   CVTRV400                                                 04726000
CVTRV407 EQU   CVTRV400                                                 04727000
CVTRV406 EQU   CVTRV400                                                 04728000
CVTRV405 EQU   CVTRV400                                                 04729000
CVTRV404 EQU   CVTRV400                                                 04730000
CVTRV403 EQU   CVTRV400                                                 04731000
CVTRV402 EQU   CVTRV400                                                 04732000
CVTRV401 EQU   CVTRV400                                                 04733000
CVTICB   EQU   CVTXTNT2+48                                              04734000
CVTSKTA  EQU   CVTXTNT2+44                                              04735000
CVTSHSB  EQU   CVTSHS                                                   04736000
CVTRSV98 EQU   CVTXTNT2+36                                              04737000
CVTRSV97 EQU   CVTXTNT2+34                                              04738000
CVTRSV96 EQU   CVTXTNT2+32                                              04739000
CVTOLTEP EQU   CVTXTNT2+28                                              04740000
CVTQIDA  EQU   CVTQID+1                                                 04741000
CVTRSV95 EQU   CVTQID                                                   04742000
CVTRSV94 EQU   CVTXTNT2+20                                              04743000
CVTRSV93 EQU   CVTXTNT2+16                                              04744000
CVTRSV92 EQU   CVTXTNT2+12                                              04745000
CVTDEBVR EQU   CVTXTNT2+8                                               04746000
CVTRSV91 EQU   CVTXTNT2+6                                               04747000
CVTRSV9H EQU   CVTFLGBT                                                 04748000
CVTRSV9G EQU   CVTFLGBT                                                 04749000
CVTRSV9F EQU   CVTFLGBT                                                 04750000
CVTRSV9E EQU   CVTFLGBT                                                 04751000
CVTRSV9D EQU   CVTFLGBT                                                 04752000
CVTRSV9C EQU   CVTFLGBT                                                 04753000
CVTVME   EQU   CVTFLGBT                                                 04754000
CVTNPE   EQU   CVTFLGBT                                                 04755000
CVTNUCLS EQU   CVTXTNT2+4                                               04756000
CVTDSSVA EQU   CVTDSSV+1                                                04757000
CVTRSV89 EQU   CVTDSSV                                                  04758000
CVTRSV88 EQU   CVTXTNT1+8                                               04759000
CVTRSV87 EQU   CVTXTNT1+4                                               04760000
CVTFACHN EQU   CVTXTNT1                                                 04761000
CVTRV488 EQU   CVTMAP+412                                               04762000
CVTRV487 EQU   CVTMAP+408                                               04763000
CVTRV486 EQU   CVTMAP+404                                               04764000
CVTRV485 EQU   CVTMAP+400                                               04765000
CVTACTAP EQU   CVTMAP+396                                               04766000
CVTAUTH  EQU   CVTMAP+392                                               04767000
CVTATMCA EQU   CVTATMCT+1                                               04768000
CVTATMST EQU   CVTATMCT                                                 04769000
CVTRSV61 EQU   CVTMAP+384                                               04770000
CVTVOLT1 EQU   CVTVOLM1+1                                               04771000
CVTVOLI1 EQU   CVTVOLF1                                                 04772000
CVTSTOA  EQU   CVTMAP+376                                               04773000
CVTRSV58 EQU   CVTMAP+374                                               04774000
CVTRSV57 EQU   CVTMAP+372                                               04775000
CVTDDCE  EQU   CVTMAP+368                                               04776000
CVTPNWFR EQU   CVTMAP+364                                               04777000
CVTSMF   EQU   CVTMAP+360                                               04778000
CVTSULK  EQU   CVTMAP+358                                               04779000
CVTSLKO  EQU   CVTSYSK                                                  04780000
CVTSLKP  EQU   CVTSYSK                                                  04781000
CVTSLKQ  EQU   CVTSYSK                                                  04782000
CVTSLKR  EQU   CVTSYSK                                                  04783000
CVTRSV56 EQU   CVTSYSK                                                  04784000
CVTRSV55 EQU   CVTSYSK                                                  04785000
CVTRSV54 EQU   CVTSYSK                                                  04786000
CVTRSV53 EQU   CVTSYSK                                                  04787000
CVTRSV52 EQU   CVTA1F1                                                  04788000
CVTRSV51 EQU   CVTA1F1                                                  04789000
CVTRSV50 EQU   CVTA1F1                                                  04790000
CVTRSV49 EQU   CVTA1F1                                                  04791000
CVTRSV48 EQU   CVTA1F1                                                  04792000
CVTRSV47 EQU   CVTA1F1                                                  04793000
CVTSRSW  EQU   CVTA1F1                                                  04794000
CVTPFSW  EQU   CVTA1F1                                                  04795000
CVTPCVT  EQU   CVTMAP+352                                               04796000
CVTRSV46 EQU   CVTMAP+344                                               04797000
CVTRSV45 EQU   CVTMAP+340                                               04798000
CVTRSV44 EQU   CVTMAP+338                                               04799000
CVTRSV43 EQU   CVTMAP+336                                               04800000
CVTHJESA EQU   CVTHJES+1                                                04801000
CVTRSV42 EQU   CVTHJES                                                  04802000
CVTEXT2A EQU   CVTEXT2+1                                                04803000
CVTRSV41 EQU   CVTEXT2                                                  04804000
CVTAPFA  EQU   CVTAPF+1                                                 04805000
CVTRSV40 EQU   CVTAPF                                                   04806000
CVTRV518 EQU   CVTINTLA                                                 04807000
CVTRV517 EQU   CVTERPV                                                  04808000
CVTEORM  EQU   CVTMAP+312                                               04809000
CVTMCHPR EQU   CVTMAP+308                                               04810000
CVTTZ    EQU   CVTMAP+304                                               04811000
CVTJEPS  EQU   CVTMAP+300                                               04812000
CVTJESCT EQU   CVTMAP+296                                               04813000
CVTMODE  EQU   CVTMAP+292                                               04814000
CVTPTRV  EQU   CVTMAP+288                                               04815000
CVTREAL  EQU   CVTMAP+284                                               04816000
CVTRSV39 EQU   CVTMAP+280                                               04817000
CVTRSV38 EQU   CVTMAP+276                                               04818000
CVTDMSRA EQU   CVTDMSR+1                                                04819000
CVTRV634 EQU   CVTDMSRF                                                 04820000
CVTRV633 EQU   CVTDMSRF                                                 04821000
CVTRV632 EQU   CVTDMSRF                                                 04822000
CVTRV631 EQU   CVTDMSRF                                                 04823000
CVTRV630 EQU   CVTDMSRF                                                 04824000
CVTRV629 EQU   CVTDMSRF                                                 04825000
CVTUDUMP EQU   CVTDMSRF                                                 04826000
CVTSDUMP EQU   CVTDMSRF                                                 04827000
CVTQMSGA EQU   CVTQMSG+1                                                04828000
CVTRSV36 EQU   CVTQMSG                                                  04829000
CVTAMFF  EQU   CVTMAP+264                                               04830000
CVTPURGA EQU   CVTPURG+1                                                04831000
CVTRSV35 EQU   CVTPURG                                                  04832000
CVTCBSP  EQU   CVTMAP+256                                               04833000
CVTATERA EQU   CVTATER+1                                                04834000
CVTSYST  EQU   CVTATER                                                  04835000
CVTVOLT2 EQU   CVTTAT                                                   04836000
CVTVOLI2 EQU   CVTVOLF2                                                 04837000
CVTAQAVB EQU   CVTAQAVT+1                                               04838000
CVTRSV34 EQU   CVTTCMFG                                                 04839000
CVTRSV33 EQU   CVTTCMFG                                                 04840000
CVTRSV32 EQU   CVTTCMFG                                                 04841000
CVTRSV31 EQU   CVTTCMFG                                                 04842000
CVTRSV30 EQU   CVTTCMFG                                                 04843000
CVTRSV29 EQU   CVTTCMFG                                                 04844000
CVTRSV28 EQU   CVTTCMFG                                                 04845000
CVTTCRDY EQU   CVTTCMFG                                                 04846000
CVTGTFA  EQU   CVTGTF+1                                                 04847000
CVTRSV27 EQU   CVTGTFST                                                 04848000
CVTRNIO  EQU   CVTGTFST                                                 04849000
CVTUSR   EQU   CVTGTFST                                                 04850000
CVTRV318 EQU   CVTFORM                                                  04851000
CVTRV317 EQU   CVTTMODE                                                 04852000
CVTRV316 EQU   CVTSTATE                                                 04853000
CVTRV315 EQU   CVTGTFS                                                  04854000
CVTGTFAV EQU   CVTGTFS                                                  04855000
CVT0SCR1 EQU   CVTMAP+232                                               04856000
CVTRV515 EQU   CVTMAP+228                                               04857000
CVTRMS   EQU   CVTMAP+224                                               04858000
CVTPATCH EQU   CVTMAP+220                                               04859000
CVTTSCE  EQU   CVTMAP+216                                               04860000
CVTLNKSC EQU   CVTMAP+214                                               04861000
CVTQABST EQU   CVTMAP+212                                               04862000
CVTMDLDS EQU   CVTMAP+208                                               04863000
CVTUSER  EQU   CVTMAP+204                                               04864000
CVTABEND EQU   CVTMAP+200                                               04865000
CVTSMCA  EQU   CVTMAP+196                                               04866000
CVTRSV18 EQU   CVTMAP+192                                               04867000
CVTQLPAQ EQU   CVTMAP+188                                               04868000
CVTQCDSR EQU   CVTMAP+184                                               04869000
CVTRSV17 EQU   CVTOPTB                                                  04870000
CVTRSV16 EQU   CVTOPTB                                                  04871000
CVTFP    EQU   CVTOPTB                                                  04872000
CVTAPTHR EQU   CVTOPTB                                                  04873000
CVTNLOG  EQU   CVTOPTB                                                  04874000
CVTTOD   EQU   CVTOPTB                                                  04875000
CVTCTIMS EQU   CVTOPTB                                                  04876000
CVTPROT  EQU   CVTOPTB                                                  04877000
CVTXPFP  EQU   CVTOPTA                                                  04878000
CVTASCII EQU   CVTOPTA                                                  04879000
CVTRSV13 EQU   CVTOPTA                                                  04880000
CVTRSV12 EQU   CVTOPTA                                                  04881000
CVTNIP   EQU   CVTOPTA                                                  04882000
CVTDDR   EQU   CVTOPTA                                                  04883000
CVTAPR   EQU   CVTOPTA                                                  04884000
CVTCCH   EQU   CVTOPTA                                                  04885000
CVTSNCTR EQU   CVTMAP+180                                               04886000
CVTQMWR  EQU   CVTMAP+176                                               04887000
CVTQOCR  EQU   CVTMAP+172                                               04888000
CVT1EF00 EQU   CVTMAP+168                                               04889000
CVTMZ00  EQU   CVTMAP+164                                               04890000
CVTHEAD  EQU   CVTMAP+160                                               04891000
CVTRSV11 EQU   CVTMAP+156                                               04892000
CVT0PT01 EQU   CVTMAP+152                                               04893000
CVTMSER  EQU   CVTMAP+148                                               04894000
CVTRV516 EQU   CVTIERLC                                                 04895000
CVTILCH  EQU   CVTMAP+140                                               04896000
CVT0DS   EQU   CVTMAP+136                                               04897000
CVTFBOSV EQU   CVTMAP+132                                               04898000
CVTNUCB  EQU   CVTMAP+128                                               04899000
CVTIXAVL EQU   CVTMAP+124                                               04900000
CVTIOQET EQU   CVTMAP+120                                               04901000
CVTDCBA  EQU   CVTMAP+117                                               04902000
CVTMVS2  EQU   CVTDCB                                                   04903000
CVT6DAT  EQU   CVTDCB                                                   04904000
CVT4MPS  EQU   CVTDCB                                                   04905000
CVTRSV09 EQU   CVTDCB                                                   04906000
CVT4MS1  EQU   CVTDCB                                                   04907000
CVT2SPS  EQU   CVTDCB                                                   04908000
CVT1SSS  EQU   CVTDCB                                                   04909000
CVTRSV08 EQU   CVTDCB                                                   04910000
CVTSTB   EQU   CVTMAP+112                                               04911000
CVTQTD00 EQU   CVTMAP+108                                               04912000
CVTQTE00 EQU   CVTMAP+104                                               04913000
CVTCUCB  EQU   CVTMAP+100                                               04914000
CVTSJQ   EQU   CVTMAP+96                                                04915000
CVTPBLDL EQU   CVTMAP+92                                                04916000
CVTTPC   EQU   CVTMAP+88                                                04917000
CVTSVDCB EQU   CVTMAP+84                                                04918000
CVTBRET  EQU   CVTMAP+82                                                04919000
CVTEXIT  EQU   CVTMAP+80                                                04920000
CVT0FN00 EQU   CVTMAP+76                                                04921000
CVTDARA  EQU   CVTDAR+1                                                 04922000
CVTRSV07 EQU   CVTFLGS1                                                 04923000
CVTRSV06 EQU   CVTFLGS1                                                 04924000
CVTRSV05 EQU   CVTFLGS1                                                 04925000
CVTRSV04 EQU   CVTFLGS1                                                 04926000
CVTRSV03 EQU   CVTFLGS1                                                 04927000
CVTRSV02 EQU   CVTFLGS1                                                 04928000
CVTRSV01 EQU   CVTFLGS1                                                 04929000
CVTDMPLK EQU   CVTFLGS1                                                 04930000
CVTXITP  EQU   CVTMAP+68                                                04931000
CVTZDTAB EQU   CVTMAP+64                                                04932000
CVTMSLT  EQU   CVTMAP+60                                                04933000
CVTDATE  EQU   CVTMAP+56                                                04934000
CVTBTERM EQU   CVTMAP+52                                                04935000
CVTSYSAD EQU   CVTMAP+48                                                04936000
CVTXTLER EQU   CVTMAP+44                                                04937000
CVTILK2  EQU   CVTMAP+40                                                04938000
CVTILK1  EQU   CVTMAP+36                                                04939000
CVTPRLTV EQU   CVTMAP+32                                                04940000
CVTPCNVT EQU   CVTMAP+28                                                04941000
CVT0VL00 EQU   CVTMAP+24                                                04942000
CVTXAPG  EQU   CVTMAP+20                                                04943000
CVTBUF   EQU   CVTMAP+16                                                04944000
CVTJOB   EQU   CVTMAP+12                                                04945000
CVTLINK  EQU   CVTMAP+8                                                 04946000
CVT0EF00 EQU   CVTMAP+4                                                 04947000
CVTTCBP  EQU   CVTMAP                                                   04948000
CVT      EQU   CVTMAP                                                   04949000
EDBLPMBC EQU   IDAEDBHD+4                                               04950000
EDBID    EQU   IDAEDBHD                                                 04951000
@NM00001 EQU   CNVRTSKA+1                                               04952000
GTMSAVE  EQU   SADMPLSD+684                                             04953000
GTMNAME  EQU   SADMPLSD+680                                             04954000
FRMSAVE  EQU   SADMPLSD+580                                             04955000
FRMNAME  EQU   SADMPLSD+576                                             04956000
AUDSAVE  EQU   SADMPLSD+476                                             04957000
AUDNAME  EQU   SADMPLSD+472                                             04958000
IOISAVE  EQU   SADMPLSD+372                                             04959000
IOINAME  EQU   SADMPLSD+368                                             04960000
PGISAVE  EQU   SADMPLSD+268                                             04961000
PGINAME  EQU   SADMPLSD+264                                             04962000
SVISAVE  EQU   SADMPLSD+164                                             04963000
SVINAME  EQU   SADMPLSD+160                                             04964000
LOWCRS   EQU   SADMPLSD+96                                              04965000
LOWGRS   EQU   SADMPLSD+32                                              04966000
SAVEDUMP EQU   SADMPLSD+24                                              04967000
AUDPSW   EQU   SADMPLSD+16                                              04968000
SVIRPSW  EQU   SADMPLSD+8                                               04969000
PSWSADMP EQU   SADMPLSD                                                 04970000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04971000
@RT00264 EQU   ASMEXIT                                                  04972000
@RT00269 EQU   ASMEXIT                                                  04973000
@RT00283 EQU   ASMEXIT                                                  04974000
@RT00286 EQU   ASMEXIT                                                  04975000
@RT00292 EQU   ASMEXIT                                                  04976000
@RT00294 EQU   ASMEXIT                                                  04977000
@RT00297 EQU   ASMEXIT                                                  04978000
@RT00307 EQU   ASMEXIT                                                  04979000
@RT00316 EQU   ASMEXIT                                                  04980000
@ENDDATA EQU   *                                                        04981000
         END   AMDSAASM,(C'PLS1149',0603,76071)                         04982000
