         TITLE 'amdsatap  virtual dump cpu to cpu tap function         *00001000
                       '                                                00002000
AMDSATAP CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'AMDSATAP  73.230'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @11,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@11                                         0001 00013000
*   IF CTIOCON = ON THEN                                           0185 00014000
         LH    @10,@CH00739                                        0185 00015000
         TM    CTIOCON(@10),B'00001000'                            0185 00016000
         BNO   @RF00185                                            0185 00017000
*     IODBREG = ADDR(IODBCON);      /* OBTAIN CONSOLE IODB FOR     0186 00018000
*                                      CONSOLE REQUEST               */ 00019000
         L     IODBREG,@CA00917                                    0186 00020000
*   ELSE                                                           0187 00021000
*     IF CTIODA = ON THEN                                          0187 00022000
         B     @RC00185                                            0187 00023000
@RF00185 LH    @10,@CH00739                                        0187 00024000
         TM    CTIODA(@10),B'00100000'                             0187 00025000
         BNO   @RF00187                                            0187 00026000
*       IODBREG = ADDR(IODBDA);     /* OBTAIN DA IODB FOR DA REQUEST */ 00027000
         L     IODBREG,@CA00918                                    0188 00028000
*     ELSE                                                         0189 00029000
*       IF CTIOWK = ON THEN                                        0189 00030000
         B     @RC00187                                            0189 00031000
@RF00187 LH    @10,@CH00739                                        0189 00032000
         TM    CTIOWK(@10),B'00010000'                             0189 00033000
         BNO   @RF00189                                            0189 00034000
*         IODBREG = ADDR(IODBWORK); /* OBTAIN WKFILE IODB FOR WKFILE    00035000
*                                      REQUEST                       */ 00036000
         L     IODBREG,@CA00920                                    0190 00037000
*       ELSE                                                       0191 00038000
*         IF CTIOOUT = ON | CTIOTERM = ON THEN                     0191 00039000
         B     @RC00189                                            0191 00040000
@RF00189 LH    @10,@CH00739                                        0191 00041000
         TM    CTIOOUT(@10),B'11000000'                            0191 00042000
         BZ    @RF00191                                            0191 00043000
*           IODBREG = ADDR(IODBOUT); /* OBTAIN OUTPUT IODB FOR OUTPUT   00044000
*                                      REQUEST                       */ 00045000
         L     IODBREG,@CA00919                                    0192 00046000
*         ELSE                                                     0193 00047000
*           DO;                                                    0193 00048000
         B     @RC00191                                            0193 00049000
@RF00191 DS    0H                                                  0194 00050000
*             VCTAUDIT = TAPAUD1;   /* REQUEST INVALID CODE          */ 00051000
         MVC   VCTAUDIT(2,VCCTREG),TAPAUD1                         0194 00052000
*             SVC (AUDSVC);         /* SADMP ERROR - TAKE A DUMP     */ 00053000
         SVC   13                                                  0195 00054000
*           END;                                                   0196 00055000
*                                                                  0197 00056000
*   /*****************************************************************/ 00057000
*   /*                                                               */ 00058000
*   /* DETERMINE IF AMDSADMP IS ON A CPU IN UNI-PROCESSOR MODE       */ 00059000
*   /*                                                               */ 00060000
*   /*****************************************************************/ 00061000
*                                                                  0197 00062000
*/*TAPCPUCK: D (YES,,NO,%MP) IODBCPU = VCTCPUC ?                     */ 00063000
*/* R RETURN CODE 0                                                  */ 00064000
*/*%MP: D (YES,,NO,EREXIT1) CTMP = 1 ?                               */ 00065000
*/* L GETMAIN DYNAMIC STORAGE                                        */ 00066000
*/* D (NO,,YES,%RCB) OBTAIN STORAGE?                                 */ 00067000
*/*EREXIT1: R RETURN CODE 4                                          */ 00068000
*/*%RCB: P (NORM,,RCB,EREXIT) QUEUE RCB EXIT ON VCTRCB CHAIN         */ 00069000
*   IF IODBCPU = VCTCPUC THEN       /* REQUEST FOR CURRENT CPU       */ 00070000
@RC00191 DS    0H                                                  0197 00071000
@RC00189 DS    0H                                                  0197 00072000
@RC00187 DS    0H                                                  0197 00073000
@RC00185 CLC   IODBCPU(2,IODBREG),VCTCPUC(VCCTREG)                 0197 00074000
         BNE   @RF00197                                            0197 00075000
*     DO;                                                          0198 00076000
*       GEN;                                                       0199 00077000
        LM  14,12,12(13)    RESTORE REGS                                00078000
        SR  RETCODE,RETCODE SET 0 RETURN CODE                           00079000
        BR  RETREG         RETURN                                       00080000
*     END;                                                         0200 00081000
*   IF CTMP ^= ON THEN                                             0201 00082000
@RF00197 LH    @10,@CH00739                                        0201 00083000
         TM    CTMP(@10),B'00000010'                               0201 00084000
         BNO   @RT00201                                            0201 00085000
*     GO TO EREXIT1;                /* CAN CHANGE CPU'S ONLY IF MP   */ 00086000
*   RESPECIFY (R1,R8,RETCODE) RESTRICTED; /* RESTRICT REGS FOR     0203 00087000
*                                      GETMAIN                       */ 00088000
*   SVC (GTMSVC);                   /* GET STORAGE TO BE REENTRANT   */ 00089000
         SVC   4                                                   0204 00090000
*   IF RETCODE ^= 0 THEN            /* GETMAIN OKAY?                 */ 00091000
         LTR   RETCODE,RETCODE                                     0205 00092000
         BZ    @RF00205                                            0205 00093000
*     DO;                                                          0206 00094000
*                                                                  0206 00095000
*EREXIT1:                                                          0207 00096000
*       GEN;                                                       0207 00097000
EREXIT1  DS    0H                                                  0207 00098000
        LM  14,12,12(13)    RESTORE REGS                                00099000
        LA  RETCODE,4       SET 4 RETURN CODE                           00100000
        BR  RETREG          RETURN                                      00101000
*     END;                                                         0208 00102000
*   R8 = R1;                        /* SET BASE FOR DYNAMIC AREA     */ 00103000
@RF00205 LR    R8,R1                                               0209 00104000
*       GEN;                                                       0210 00105000
        USING @DATD,R8     ESTABLISH USING ON DYNAMIC AREA              00106000
        ST    R13,@SA00001+4 CHAIN SAVE AREA                            00107000
        LA    R15,@SA00001 POINT TO SAVE AREA                           00108000
*   SAVENEXT = R15;                 /* CHAIN SAVEA AREA              */ 00109000
         ST    R15,SAVENEXT(,R13)                                  0211 00110000
*   R13 = R15;                      /* SET SAVE AREA PTR             */ 00111000
         LR    R13,R15                                             0212 00112000
*   RESPECIFY (R1,RETCODE) UNRESTRICTED; /* RELEASE REGS             */ 00113000
*   TRCBNEXT = VCTRCB;              /* SAVE CURRENT RCB              */ 00114000
         MVC   TRCBNEXT(4),VCTRCB(VCCTREG)                         0214 00115000
*   TRCBSAVE = R13;                 /* SAVE AREA ADDRESS             */ 00116000
         ST    R13,TRCBSAVE                                        0215 00117000
*   TRCBBASE = BASEREG;             /* SAVE BASE REG IN RCB          */ 00118000
         ST    BASEREG,TRCBBASE                                    0216 00119000
*   TRCBEXIT = ADDR(EREXIT);        /* SET RETURN ADDRESS            */ 00120000
         LA    @10,EREXIT                                          0217 00121000
         ST    @10,TRCBEXIT                                        0217 00122000
*   TRCBSTOR = 0;                   /* INDICATE NOT TRANSLATED       */ 00123000
         SR    @10,@10                                             0218 00124000
         ST    @10,TRCBSTOR                                        0218 00125000
*                                                                  0219 00126000
*   /*****************************************************************/ 00127000
*   /*                                                               */ 00128000
*   /* NOW THE TARGET CPU STATE MUST BE DETERMINED. IF THIS IS THE   */ 00129000
*   /* IPLED CPU, THE STATE WAS INITIALIZED BY IPL. IF THIS IS NOT   */ 00130000
*   /* THE IPLED CPU WE WILL RESET THE STATE ONLY ON AN INITIAL      */ 00131000
*   /* AMDSASIO REQUEST. STATE INITIALIZATION QUIESCES I/O AND RESETS*/ 00132000
*   /* THE STATE OF THE PREFIX REGISTER                              */ 00133000
*   /*                                                               */ 00134000
*   /*****************************************************************/ 00135000
*                                                                  0219 00136000
*/* D (YES,%SAVE,NO,) REQUEST FOR IPLED CPU                          */ 00137000
*/* D (YES,%SAVE,NO,) CTIORSET = ON ?                                */ 00138000
*/* L SIGP INITIAL PROGRAM RESET TO INITIALIZE TARGET CPU            */ 00139000
*/* D (YES,EREXIT,NO,%SAVE) ERROR ON RESET ?                         */ 00140000
*   IF IODBCPU ^= CTCPUI & CTIORSET = ON THEN                      0219 00141000
         LH    @10,IODBCPU(,IODBREG)                               0219 00142000
         LH    @15,@CH00739                                        0219 00143000
         CH    @10,CTCPUI(,@15)                                    0219 00144000
         BE    @RF00219                                            0219 00145000
         TM    CTIORSET(@15),B'00000010'                           0219 00146000
         BNO   @RF00219                                            0219 00147000
*     DO;                           /* IF NOT HEADED TOWARD IPLED CPU   00148000
*                                      AND THIS IS A RESET REQUEST 0220 00149000
*                                      THEN CPU MUST BE INITIALIZED  */ 00150000
*       RESPECIFY (R1,R2) RESTRICTED;                              0221 00151000
*       R2 = IODBCPU;               /* SET UP CPU ADDRESS            */ 00152000
         LR    R2,@10                                              0222 00153000
*       GEN REFS(R2,IPRORDER) SETS(R1);                            0223 00154000
        SIGP R1,R2,IPRORDER RESET TARGET CPU                            00155000
*       BC (7,EREXIT);              /* IF ERROR - IGNORE REQUEST     */ 00156000
         BC    7,EREXIT                                            0224 00157000
*     END;                                                         0225 00158000
*                                                                  0226 00159000
*   /*****************************************************************/ 00160000
*   /*                                                               */ 00161000
*   /* NOW WE CAN PREPARE TO ENTER THE TARGET CPU. FIRST ALL STATUS  */ 00162000
*   /* MUST BE PERSERVED                                             */ 00163000
*   /*                                                               */ 00164000
*   /*****************************************************************/ 00165000
*                                                                  0226 00166000
*/*%SAVE: P SAVE CONTROL REGS IN LOWCRS                              */ 00167000
*/* P SAVE GPR'S OF TAP IN LOWGRS                                    */ 00168000
*/* P SAVE RESTART PSW                                               */ 00169000
*       GEN SETS(LOWCRS,LOWGRS);                                   0226 00170000
@RF00219 DS    0H                                                  0226 00171000
        STCTL R0,R15,LOWCRS SAVE CONTROL REGISTERS OF TAP               00172000
        STM   R0,R15,LOWGRS SAVE GENERAL PURPOSE REGISTERS OF TAP       00173000
*   SVERNPSW = FLCRNPSW;            /* SAVE RESTART PSW              */ 00174000
         MVC   SVERNPSW(8),FLCRNPSW                                0227 00175000
*                                                                  0228 00176000
*   /*****************************************************************/ 00177000
*   /*                                                               */ 00178000
*   /* ISSUE SIGP RESTART ORDER, IF TAP RESTARTS SUCCESSFULLY ON THE */ 00179000
*   /* TARGET CPU - THIS CODE ENTERS A WAIT STATE. ELSE THE OTHER CPU*/ 00180000
*   /* WILL BE STOPPED AND AN ERROR RETURN MADE                      */ 00181000
*   /*                                                               */ 00182000
*   /*****************************************************************/ 00183000
*                                                                  0228 00184000
*/*%TAPRSTR: P SET TAPRSTRT FOR RESTART OPERATION                    */ 00185000
*/* L (CPU1,%CPU1,CPU2,%CPU2) ISSUE SIGP RESTART TO START AMDSATAP ON   00186000
*/*TARGET CPU                                                        */ 00187000
*/*%CPU1: N THIS CODE IS EXECUTING ON ORIGINAL CPU                   */ 00188000
*/* D (YES,%WAIT,NO,%STOP) WAS RESTART SUCCESSFUL ?                  */ 00189000
*/* D (NO,%STOP,YES,%TAPRSTR) CPU BUSY ?                             */ 00190000
*/*%WAIT: R LPSW WAIT STATE ON CPU 1                                 */ 00191000
*/*%STOP: L (,EREXIT) STOP TARGET CPU TO INSURE IT IS QUIESCED       */ 00192000
*   R2 = IODBCPU;                   /* SET UP TARGET CPU ADDRESS     */ 00193000
         LH    R2,IODBCPU(,IODBREG)                                0228 00194000
*   FLCRNPSW = TAPRNPSW;                                           0229 00195000
*                                                                  0229 00196000
         MVC   FLCRNPSW(8),TAPRNPSW                                0229 00197000
*SIGPSTRT:                                                         0230 00198000
*       GEN REFS(R2,RSTORDER)SETS(R1)FLOWS(TAPTGCPU);              0230 00199000
SIGPSTRT DS    0H                                                  0230 00200000
        SIGP R1,R2,RSTORDER RESTART TO START OTHER CPU                  00201000
*   BC (5,RSTERROR);                /* IF ERROR ON RESTART TERMINATE    00202000
*                                      REQUEST                       */ 00203000
         BC    5,RSTERROR                                          0231 00204000
*   BC (2,SIGPSTRT);                /* IF CPU STILL BUSY WITH INITIAL   00205000
*                                      PROGRAM RESET,RE-ISSUE RESTART*/ 00206000
         BC    2,SIGPSTRT                                          0232 00207000
*   LPSW (TAPWAIT);                 /* ENTER WAIT STATE ON THIS CPU  */ 00208000
*                                                                  0233 00209000
         LPSW  TAPWAIT                                             0233 00210000
*RSTERROR:                                                         0234 00211000
*       GEN REFS(R2,STPORDER) SETS(R1);                            0234 00212000
RSTERROR DS    0H                                                  0234 00213000
        SIGP R1,R2,STPORDER SIGP STOP CPU ORDER                         00214000
*   FLCRNPSW = SVERNPSW;            /* RESTORE RESTART PSW IN LOW  0235 00215000
*                                      CORE                          */ 00216000
         MVC   FLCRNPSW(8),SVERNPSW                                0235 00217000
*   RESPECIFY (R1,R2) UNRESTRICTED;                                0236 00218000
*   GO TO EREXIT;                   /* REQUEST COULD NOT BE PERFORMED*/ 00219000
         B     EREXIT                                              0237 00220000
*                                                                  0238 00221000
*   /*****************************************************************/ 00222000
*   /*                                                               */ 00223000
*   /* WE ARE INDEED ON THE TARGET CPU. THIS CODE EXECUTES ON A      */ 00224000
*   /* DIFFERENT CPU FROM ITS CALLER'S. SET UP AMDSADMP ON THIS CPU  */ 00225000
*   /* TO RUN AS NORMAL                                              */ 00226000
*   /*                                                               */ 00227000
*   /*****************************************************************/ 00228000
*                                                                  0238 00229000
*/*%CPU2: N THIS CODE IS EXECUTING ON TARGET CPU                     */ 00230000
*/* N IF RESTART IS UNSUCCESSFUL THIS PATH IS NOT EXECUTED           */ 00231000
*/* P LOAD GPR'S FROM LOWGRS                                         */ 00232000
*/* P LOAD CONTROL REGISTERS FROM LOWCRS                             */ 00233000
*/* P PURGE THE CPU LOOK-ASIDE BUFFER                                */ 00234000
*/* P RESTORE ORIGINAL RESTART PSW                                   */ 00235000
*/* P ENABLE FOR EXTERNAL INTERRUPTS                                 */ 00236000
*/* P (,TAPEXIT) UPDATE VCTCPUC WITH CURRENT CPU ADDRESS             */ 00237000
*                                                                  0238 00238000
*TAPTGCPU:                                                         0238 00239000
*       GEN REFS(LOWCRS,LOWGRS)                                    0238 00240000
*       SETS(R0,R1,R2,R3,R4,R5,R6,R7,R8,R9,R10,R11,R12,R13,R14,R15);    00241000
TAPTGCPU DS    0H                                                  0238 00242000
        LCTL R0,R15,LOWCRS RESTORE CONTROL REGISTERS                    00243000
        LM R0,R15,LOWGRS       RESTORE GENERAL PURPOSE REGISTERS        00244000
        PTLB PURGE HARDWARE TRANSLATION BUFFER                          00245000
*   FLCRNPSW = SVERNPSW;            /* RESTORE RESTART PSW           */ 00246000
         MVC   FLCRNPSW(8),SVERNPSW                                0239 00247000
*   VCTCPUC = IODBCPU;              /* SET NEW CURRENT CPU ADDRESS   */ 00248000
         MVC   VCTCPUC(2,VCCTREG),IODBCPU(IODBREG)                 0240 00249000
*   SSM (PGEMASK);                  /* ENABLE FOR EXTERNAL INTERRUPTS*/ 00250000
         SSM   @CB00741                                            0241 00251000
*   PFTAPCPU = PFTAPCPU + 1;        /* INCREMENT NUMBER OF TIMES HAVE   00252000
*                                      SWITCHED CPU'S                */ 00253000
*                                                                  0242 00254000
         LA    @10,1                                               0242 00255000
         AH    @10,PFTAPCPU                                        0242 00256000
         STH   @10,PFTAPCPU                                        0242 00257000
*                                                                  0243 00258000
*   /*****************************************************************/ 00259000
*   /*                                                               */ 00260000
*   /* THIS IS THE TEMINATION EXIT CODE. EREXIT SETS AN ERROR RETURN */ 00261000
*   /* CODE WHILE TAPEXIT SETS A ZERO RETURN CODE                    */ 00262000
*   /*                                                               */ 00263000
*   /*****************************************************************/ 00264000
*                                                                  0243 00265000
*/*TAPEXIT: P (,TAPREST) RETURN CODE = 0 IN SAVE AREA                */ 00266000
*/*EREXIT: P RETURN CODE = 4 IN SAVE AREA                            */ 00267000
*/*TAPREST: P DEQUEUE RCB FROM VCTRCB                                */ 00268000
*/* L FREEMAIN DYNAMIC AREA                                          */ 00269000
*/* P RESTORE CALLER'S REGISTERS                                     */ 00270000
*/* R RETURN TO CALLER                                               */ 00271000
*/*AMDSATAP: END                                                     */ 00272000
*                                                                  0243 00273000
*TAPEXIT:                                                          0243 00274000
*   SAVEBACK -> SAVER15 = 0;        /* SET ZERO RETURN CODE          */ 00275000
TAPEXIT  L     @10,SAVEBACK(,R13)                                  0243 00276000
         SR    @15,@15                                             0243 00277000
         ST    @15,SAVER15(,@10)                                   0243 00278000
*   GO TO TAPREST;                  /* RETURN TO CALLER              */ 00279000
*                                                                  0244 00280000
         B     TAPREST                                             0244 00281000
*EREXIT:                                                           0245 00282000
*   SAVEBACK -> SAVER15 = 4;        /* ERROR RETURN CODE             */ 00283000
*                                                                  0245 00284000
EREXIT   L     @10,SAVEBACK(,R13)                                  0245 00285000
         MVC   SAVER15(4,@10),@CF00045                             0245 00286000
*TAPREST:                                                          0246 00287000
*   VCTRCB = TRCBNEXT;              /* DEQUEUE TAP'S RCB             */ 00288000
TAPREST  MVC   VCTRCB(4,VCCTREG),TRCBNEXT                          0246 00289000
*   CTIORSET = OFF;                 /* INSURE RESET REQUEST IS RESET */ 00290000
         LH    @10,@CH00739                                        0247 00291000
         NI    CTIORSET(@10),B'11111101'                           0247 00292000
*   RESPECIFY R1 RESTRICTED;        /* RESTRICT FREEMAIN REG         */ 00293000
*   R1 = R8;                        /* SET AREA TO FREE              */ 00294000
         LR    R1,R8                                               0249 00295000
*   SVC (FRMSVC);                   /* FREE STORAGE                  */ 00296000
         SVC   5                                                   0250 00297000
*   RESPECIFY R1 UNRESTRICTED;      /* RELEASE REG                   */ 00298000
*   RETURN;                                                        0252 00299000
@EL00001 L     @13,4(,@13)                                         0252 00300000
@EF00001 DS    0H                                                  0252 00301000
@ER00001 LM    @14,@12,12(@13)                                     0252 00302000
         BR    @14                                                 0252 00303000
*   END AMDSATAP                    /* RETURN                        */ 00304000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00305000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        * 00306000
*/*%INCLUDE SYSLIB  (AMDSARMK)                                        * 00307000
*;                                                                 0253 00308000
@DATA    DS    0H                                                       00309000
@CH00739 DC    H'28672'                                                 00310000
@DATD    DSECT                                                          00311000
         DS    0F                                                       00312000
@SA00001 DS    18F                                                      00313000
AMDSATAP CSECT                                                          00314000
         DS    0F                                                       00315000
@CF00045 DC    F'4'                                                     00316000
@DATD    DSECT                                                          00317000
         DS    0D                                                       00318000
TAPRCB   DS    CL20                                                     00319000
         ORG   TAPRCB                                                   00320000
TRCBNEXT DS    AL4                                                      00321000
TRCBSTOR DS    AL4                                                      00322000
TRCBSAVE DS    AL4                                                      00323000
TRCBEXIT DS    AL4                                                      00324000
TRCBBASE DS    AL4                                                      00325000
         ORG   TAPRCB+20                                                00326000
SVERNPSW DS    CL8                                                      00327000
AMDSATAP CSECT                                                          00328000
         NOPR  ((@ENDDATD-@DATD)/257*16)                                00329000
         DS    0F                                                       00330000
@SIZDATD DC    AL1(0)                                                   00331000
         DC    AL3(@ENDDATD-@DATD)                                      00332000
@CA00917 DC    A(IODBCON)                                               00333000
@CA00918 DC    A(IODBDA)                                                00334000
@CA00919 DC    A(IODBOUT)                                               00335000
@CA00920 DC    A(IODBWORK)                                              00336000
         DS    0D                                                       00337000
@CB00741 DC    X'01'                                                    00338000
TAPAUD1  DS    CL2                                                      00339000
         ORG   TAPAUD1                                                  00340000
@NM00055 DC    X'01'                                                    00341000
@NM00056 DC    AL1(2)                                                   00342000
         ORG   TAPAUD1+2                                                00343000
         DS    CL1                                                      00344000
TAPRNPSW DS    CL8                                                      00345000
         ORG   TAPRNPSW                                                 00346000
@NM00057 DC    X'000C0000'                                              00347000
@NM00058 DC    AL4(TAPTGCPU)                                            00348000
         ORG   TAPRNPSW+8                                               00349000
         DS    CL4                                                      00350000
TAPWAIT  DC    X'000E000000FFFFFF'                                      00351000
AMDSATAP CSECT                                                          00352000
STPORDER EQU 5 SIGP STOP ORDER                                          00353000
RSTORDER EQU 6 SIGP RESTART ORDER                                       00354000
IPRORDER EQU 7 SIGP INITIAL PGM RESET ORDER                             00355000
AMDSATAP CSECT                                                          00356000
         DS   0H                                                        00357000
TAPPATCH DC ((@DATA-@PSTART)/20)X'00'                                   00358000
@DATD    DSECT                                                          00359000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00360000
@ENDDATD EQU   *                                                        00361000
AMDSATAP CSECT                                                          00362000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00363000
@01      EQU   01                                                       00364000
@02      EQU   02                                                       00365000
@03      EQU   03                                                       00366000
@04      EQU   04                                                       00367000
@05      EQU   05                                                       00368000
@06      EQU   06                                                       00369000
@07      EQU   07                                                       00370000
@08      EQU   08                                                       00371000
@09      EQU   09                                                       00372000
@10      EQU   10                                                       00373000
@11      EQU   11                                                       00374000
@12      EQU   12                                                       00375000
@13      EQU   13                                                       00376000
@14      EQU   14                                                       00377000
@15      EQU   15                                                       00378000
VCCTREG  EQU   @12                                                      00379000
RETCODE  EQU   @15                                                      00380000
BASEREG  EQU   @11                                                      00381000
R0       EQU   @00                                                      00382000
R1       EQU   @01                                                      00383000
R2       EQU   @02                                                      00384000
R3       EQU   @03                                                      00385000
R4       EQU   @04                                                      00386000
R5       EQU   @05                                                      00387000
R6       EQU   @06                                                      00388000
R7       EQU   @07                                                      00389000
R8       EQU   @08                                                      00390000
R9       EQU   @09                                                      00391000
R10      EQU   @10                                                      00392000
R11      EQU   @11                                                      00393000
R12      EQU   @12                                                      00394000
R13      EQU   @13                                                      00395000
R14      EQU   @14                                                      00396000
R15      EQU   @15                                                      00397000
IODBREG  EQU   @09                                                      00398000
RETREG   EQU   @14                                                      00399000
         EXTRN IODBCON                                                  00400000
         EXTRN IODBDA                                                   00401000
         EXTRN IODBOUT                                                  00402000
         EXTRN IODBWORK                                                 00403000
PSA      EQU   0                                                        00404000
FLCRNPSW EQU   PSA                                                      00405000
FLCROPSW EQU   PSA+8                                                    00406000
FLCICCW2 EQU   PSA+16                                                   00407000
PSAEEPSW EQU   PSA+132                                                  00408000
PSAESPSW EQU   PSA+136                                                  00409000
FLCSVILC EQU   PSAESPSW+1                                               00410000
PSAEPPSW EQU   PSA+140                                                  00411000
FLCPIILC EQU   PSAEPPSW+1                                               00412000
FLCPICOD EQU   PSAEPPSW+2                                               00413000
PSAPICOD EQU   FLCPICOD+1                                               00414000
FLCTEA   EQU   PSAEPPSW+4                                               00415000
FLCPER   EQU   PSA+152                                                  00416000
FLCMCLA  EQU   PSA+168                                                  00417000
FLCIOEL  EQU   FLCMCLA+4                                                00418000
FLCIOA   EQU   FLCMCLA+16                                               00419000
FLCFSA   EQU   FLCMCLA+80                                               00420000
PSASUPER EQU   PSA+552                                                  00421000
PSASUP1  EQU   PSASUPER                                                 00422000
PSASUP2  EQU   PSASUPER+1                                               00423000
PSASUP3  EQU   PSASUPER+2                                               00424000
PSASUP4  EQU   PSASUPER+3                                               00425000
PSACLHT  EQU   PSA+640                                                  00426000
PSALKSA  EQU   PSA+696                                                  00427000
PSAHLHI  EQU   PSA+760                                                  00428000
PSADSSFL EQU   PSA+836                                                  00429000
PSADSSF1 EQU   PSADSSFL                                                 00430000
PSADSSF3 EQU   PSADSSFL+2                                               00431000
PSADSSF4 EQU   PSADSSFL+3                                               00432000
PSARSVT  EQU   PSA+896                                                  00433000
DEBUGLSD EQU   3286                                                     00434000
PFTAPCPU EQU   DEBUGLSD+4                                               00435000
SADMPLSD EQU   3312                                                     00436000
LOWGRS   EQU   SADMPLSD+32                                              00437000
LOWCRS   EQU   SADMPLSD+96                                              00438000
ARB      EQU   0                                                        00439000
BCTH     EQU   0                                                        00440000
BCT      EQU   0                                                        00441000
BCTLPID  EQU   BCT+28                                                   00442000
BCTFLGT  EQU   BCT+44                                                   00443000
BCTFLGI  EQU   BCT+45                                                   00444000
CCT      EQU   0                                                        00445000
CTFLG1   EQU   CCT+1                                                    00446000
CTMP     EQU   CTFLG1                                                   00447000
CTFLG2   EQU   CCT+2                                                    00448000
CTCPUI   EQU   CCT+40                                                   00449000
CTLOWFLG EQU   CCT+48                                                   00450000
CTDMPTYP EQU   CCT+52                                                   00451000
CTIOTYPE EQU   CTDMPTYP                                                 00452000
CTIOTERM EQU   CTIOTYPE                                                 00453000
CTIOOUT  EQU   CTIOTYPE                                                 00454000
CTIODA   EQU   CTIOTYPE                                                 00455000
CTIOWK   EQU   CTIOTYPE                                                 00456000
CTIOCON  EQU   CTIOTYPE                                                 00457000
CTIORSET EQU   CTIOTYPE                                                 00458000
CTCONFLG EQU   CTDMPTYP+2                                               00459000
CTBUFTYP EQU   CTDMPTYP+3                                               00460000
CTPRMT1  EQU   CTDMPTYP+24                                              00461000
CTPRMT2  EQU   CTDMPTYP+26                                              00462000
CCW      EQU   0                                                        00463000
CCWFLAGS EQU   CCW+4                                                    00464000
CSW      EQU   0                                                        00465000
CSWKEY00 EQU   CSW                                                      00466000
CSWUSTAT EQU   CSW+4                                                    00467000
CSWCSTAT EQU   CSW+5                                                    00468000
DSCE     EQU   0                                                        00469000
IODB     EQU   0                                                        00470000
IODBFLAG EQU   IODB+8                                                   00471000
IODBCPU  EQU   IODB+14                                                  00472000
IODBCCHH EQU   IODB+32                                                  00473000
IODBSRCH EQU   IODBCCHH+3                                               00474000
MDCE     EQU   0                                                        00475000
MDCB     EQU   0                                                        00476000
MDCBGRS  EQU   MDCB+16                                                  00477000
MDCBFLGS EQU   MDCB+86                                                  00478000
PSW      EQU   0                                                        00479000
PSWSM    EQU   PSW                                                      00480000
@NM00047 EQU   PSW+1                                                    00481000
PSWCCPM  EQU   PSW+2                                                    00482000
@NM00050 EQU   PSW+3                                                    00483000
PTRT     EQU   0                                                        00484000
PTRTRSA  EQU   0                                                        00485000
RCB      EQU   0                                                        00486000
VCCT     EQU   0                                                        00487000
VCTRCB   EQU   VCCT+4                                                   00488000
VCTRECSN EQU   VCCT+8                                                   00489000
VCTFLGS  EQU   VCCT+9                                                   00490000
VCTMDCE  EQU   VCCT+12                                                  00491000
VCTDSCE  EQU   VCCT+20                                                  00492000
VCTBCTH  EQU   VCCT+24                                                  00493000
VCTCPUC  EQU   VCCT+46                                                  00494000
VCTAUDIT EQU   VCCT+62                                                  00495000
VCTCBID  EQU   VCCT+64                                                  00496000
SDL      EQU   0                                                        00497000
REGLOCAL EQU   0                                                        00498000
SAVEFORM EQU   0                                                        00499000
SAVEBACK EQU   SAVEFORM+4                                               00500000
SAVENEXT EQU   SAVEFORM+8                                               00501000
SAVER15  EQU   SAVEFORM+16                                              00502000
PTRTVSA  EQU   0                                                        00503000
PSARSVTE EQU   PSARSVT                                                  00504000
CTLOWDMP EQU   CTDMPTYP                                                 00505000
FLC      EQU   PSA                                                      00506000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00507000
CTADDRE  EQU   CTLOWDMP+4                                               00508000
CTADDRS  EQU   CTLOWDMP                                                 00509000
PSARSAV  EQU   PSARSVTE+60                                              00510000
PSARSTK  EQU   PSARSVTE+56                                              00511000
PSAESAV3 EQU   PSARSVTE+52                                              00512000
PSAESTK3 EQU   PSARSVTE+48                                              00513000
PSAESAV2 EQU   PSARSVTE+44                                              00514000
PSAESTK2 EQU   PSARSVTE+40                                              00515000
PSAESAV1 EQU   PSARSVTE+36                                              00516000
PSAESTK1 EQU   PSARSVTE+32                                              00517000
PSAPSAV  EQU   PSARSVTE+28                                              00518000
PSAPSTK  EQU   PSARSVTE+24                                              00519000
PSAMSAV  EQU   PSARSVTE+20                                              00520000
PSAMSTK  EQU   PSARSVTE+16                                              00521000
PSASSAV  EQU   PSARSVTE+12                                              00522000
PSASSTK  EQU   PSARSVTE+8                                               00523000
PSANSTK  EQU   PSARSVTE+4                                               00524000
PSACSTK  EQU   PSARSVTE                                                 00525000
SAVER12  EQU   SAVEFORM+68                                              00526000
SAVER11  EQU   SAVEFORM+64                                              00527000
SAVER10  EQU   SAVEFORM+60                                              00528000
SAVER9   EQU   SAVEFORM+56                                              00529000
SAVER8   EQU   SAVEFORM+52                                              00530000
SAVER7   EQU   SAVEFORM+48                                              00531000
SAVER6   EQU   SAVEFORM+44                                              00532000
SAVER5   EQU   SAVEFORM+40                                              00533000
SAVER4   EQU   SAVEFORM+36                                              00534000
SAVER3   EQU   SAVEFORM+32                                              00535000
SAVER2   EQU   SAVEFORM+28                                              00536000
SAVER1   EQU   SAVEFORM+24                                              00537000
SAVER0   EQU   SAVEFORM+20                                              00538000
SAVER14  EQU   SAVEFORM+12                                              00539000
SAVENAME EQU   SAVEFORM+1                                               00540000
SAVEID   EQU   SAVEFORM                                                 00541000
REGL15   EQU   REGLOCAL+60                                              00542000
REGL14   EQU   REGLOCAL+56                                              00543000
REGL13   EQU   REGLOCAL+52                                              00544000
REGL12   EQU   REGLOCAL+48                                              00545000
REGL11   EQU   REGLOCAL+44                                              00546000
REGL10   EQU   REGLOCAL+40                                              00547000
REGL9    EQU   REGLOCAL+36                                              00548000
REGL8    EQU   REGLOCAL+32                                              00549000
REGL7    EQU   REGLOCAL+28                                              00550000
REGL6    EQU   REGLOCAL+24                                              00551000
REGL5    EQU   REGLOCAL+20                                              00552000
REGL4    EQU   REGLOCAL+16                                              00553000
REGL3    EQU   REGLOCAL+12                                              00554000
REGL2    EQU   REGLOCAL+8                                               00555000
REGL1    EQU   REGLOCAL+4                                               00556000
REGL0    EQU   REGLOCAL                                                 00557000
SDLSPN   EQU   SDL+1                                                    00558000
SDLNUM   EQU   SDL                                                      00559000
VCTVCCTV EQU   VCCT+108                                                 00560000
VCTCCTV  EQU   VCCT+104                                                 00561000
@NM00054 EQU   VCCT+102                                                 00562000
VCTEXTRA EQU   VCCT+100                                                 00563000
VCTCPOUT EQU   VCCT+96                                                  00564000
VCTSVCTB EQU   VCCT+92                                                  00565000
VCTPGT   EQU   VCCT+88                                                  00566000
VCTLPA   EQU   VCCT+84                                                  00567000
VCTCBADR EQU   VCCT+80                                                  00568000
VCTJBNME EQU   VCCT+72                                                  00569000
VCTCBIDN EQU   VCTCBID+7                                                00570000
@NM00053 EQU   VCTCBID                                                  00571000
VCTASID  EQU   VCCT+60                                                  00572000
VCTPTRT  EQU   VCCT+56                                                  00573000
VCTMASCB EQU   VCCT+52                                                  00574000
VCTASCB  EQU   VCCT+48                                                  00575000
VCTWKC   EQU   VCCT+45                                                  00576000
VCTWKHI  EQU   VCCT+44                                                  00577000
VCTSUBPL EQU   VCCT+40                                                  00578000
VCTARB   EQU   VCCT+36                                                  00579000
VCTIODB  EQU   VCCT+32                                                  00580000
VCTBCTC  EQU   VCCT+28                                                  00581000
VCTSTOR  EQU   VCCT+16                                                  00582000
VCTRECVA EQU   VCCT+10                                                  00583000
@NM00052 EQU   VCTFLGS                                                  00584000
VCTLRCLM EQU   VCTFLGS                                                  00585000
VCTARCLM EQU   VCTFLGS                                                  00586000
VCTASMIC EQU   VCTFLGS                                                  00587000
VCTMEMIN EQU   VCTFLGS                                                  00588000
VCTSADMP EQU   VCTFLGS                                                  00589000
@NM00051 EQU   VCTRECSN                                                 00590000
VCTRSMR  EQU   VCTRECSN                                                 00591000
VCTEXIR  EQU   VCTRECSN                                                 00592000
VCTUPDR  EQU   VCTRECSN                                                 00593000
VCTPGIR  EQU   VCTRECSN                                                 00594000
VCTVCT   EQU   VCCT                                                     00595000
RCBBASE  EQU   RCB+16                                                   00596000
RCBEXIT  EQU   RCB+12                                                   00597000
RCBSAVE  EQU   RCB+8                                                    00598000
RCBSTOR  EQU   RCB+4                                                    00599000
RCBNEXT  EQU   RCB                                                      00600000
PTRTVS   EQU   PTRT+1032                                                00601000
PTRTRS   EQU   PTRT+8                                                   00602000
PTRTLGID EQU   PTRT+4                                                   00603000
PTRTPTRT EQU   PTRT                                                     00604000
PSWEND   EQU   PSW+8                                                    00605000
PSWIA    EQU   PSW+4                                                    00606000
PSWSP    EQU   @NM00050                                                 00607000
PSWSIG   EQU   PSWCCPM                                                  00608000
PSWEU    EQU   PSWCCPM                                                  00609000
PSWDO    EQU   PSWCCPM                                                  00610000
PSWFPO   EQU   PSWCCPM                                                  00611000
@NM00049 EQU   PSWCCPM                                                  00612000
@NM00048 EQU   PSWCCPM                                                  00613000
PSWPRBLM EQU   @NM00047                                                 00614000
PSWAIT   EQU   @NM00047                                                 00615000
PSWMCH   EQU   @NM00047                                                 00616000
PSWMODE  EQU   @NM00047                                                 00617000
PSWKEY   EQU   @NM00047                                                 00618000
PSWXTRNL EQU   PSWSM                                                    00619000
PSWIO    EQU   PSWSM                                                    00620000
PSWDAT   EQU   PSWSM                                                    00621000
@NM00046 EQU   PSWSM                                                    00622000
@NM00045 EQU   PSWSM                                                    00623000
@NM00044 EQU   PSWSM                                                    00624000
PSWPER   EQU   PSWSM                                                    00625000
@NM00043 EQU   PSWSM                                                    00626000
@NM00042 EQU   MDCB+87                                                  00627000
@NM00041 EQU   MDCBFLGS                                                 00628000
MDCBDUMP EQU   MDCBFLGS                                                 00629000
MDCBASMI EQU   MDCBFLGS                                                 00630000
MDCBPI   EQU   MDCB+84                                                  00631000
MDCBSTOR EQU   MDCB+80                                                  00632000
MDCBGR15 EQU   MDCBGRS+60                                               00633000
MDCBGR14 EQU   MDCBGRS+56                                               00634000
MDCBGR13 EQU   MDCBGRS+52                                               00635000
MDCBGR12 EQU   MDCBGRS+48                                               00636000
MDCBGR11 EQU   MDCBGRS+44                                               00637000
MDCBGR10 EQU   MDCBGRS+40                                               00638000
MDCBGR9  EQU   MDCBGRS+36                                               00639000
MDCBGR8  EQU   MDCBGRS+32                                               00640000
MDCBGR7  EQU   MDCBGRS+28                                               00641000
MDCBGR6  EQU   MDCBGRS+24                                               00642000
MDCBGR5  EQU   MDCBGRS+20                                               00643000
MDCBGR4  EQU   MDCBGRS+16                                               00644000
MDCBGR3  EQU   MDCBGRS+12                                               00645000
MDCBGR2  EQU   MDCBGRS+8                                                00646000
MDCBGR1  EQU   MDCBGRS+4                                                00647000
MDCBGR0  EQU   MDCBGRS                                                  00648000
MDCBPSW  EQU   MDCB+8                                                   00649000
MDCBNEXT EQU   MDCB+4                                                   00650000
MDCBMDCB EQU   MDCB                                                     00651000
MDCEAVIL EQU   MDCE+8                                                   00652000
MDCEACTV EQU   MDCE+4                                                   00653000
MDCEMDCE EQU   MDCE                                                     00654000
IODBSENS EQU   IODB+40                                                  00655000
IODBR    EQU   IODBCCHH+7                                               00656000
IODBHH   EQU   IODBSRCH+2                                               00657000
IODBCC   EQU   IODBSRCH                                                 00658000
IODBSEEK EQU   IODBCCHH+1                                               00659000
IODBM    EQU   IODBCCHH                                                 00660000
IODBCSW  EQU   IODB+24                                                  00661000
IODBCAW  EQU   IODB+20                                                  00662000
IODBBCT  EQU   IODB+16                                                  00663000
IODBTYPE EQU   IODB+13                                                  00664000
IODBCLAS EQU   IODB+12                                                  00665000
IODBDEV  EQU   IODB+10                                                  00666000
@NM00040 EQU   IODBFLAG+1                                               00667000
IODBSTRT EQU   IODBFLAG                                                 00668000
IODBCONW EQU   IODBFLAG                                                 00669000
IODBACTV EQU   IODBFLAG                                                 00670000
IODBHALT EQU   IODBFLAG                                                 00671000
IODBIOC  EQU   IODBFLAG                                                 00672000
IODBINT  EQU   IODBFLAG                                                 00673000
IODBPTRM EQU   IODBFLAG                                                 00674000
IODBTERM EQU   IODBFLAG                                                 00675000
IODBIDEN EQU   IODB+4                                                   00676000
IODBIODB EQU   IODB                                                     00677000
DSCETEND EQU   DSCE+20                                                  00678000
DSCETCUR EQU   DSCE+16                                                  00679000
DSCETBEG EQU   DSCE+12                                                  00680000
DSCENEXT EQU   DSCE+8                                                   00681000
DSCEBEGN EQU   DSCE+4                                                   00682000
DSCEDSCE EQU   DSCE                                                     00683000
CSWCNT   EQU   CSW+6                                                    00684000
CSWCHC   EQU   CSWCSTAT                                                 00685000
CSWICC   EQU   CSWCSTAT                                                 00686000
CSWCCC   EQU   CSWCSTAT                                                 00687000
CSWCDC   EQU   CSWCSTAT                                                 00688000
CSWPTC   EQU   CSWCSTAT                                                 00689000
CSWPGC   EQU   CSWCSTAT                                                 00690000
CSWIL    EQU   CSWCSTAT                                                 00691000
CSWPCI   EQU   CSWCSTAT                                                 00692000
CSWUE    EQU   CSWUSTAT                                                 00693000
CSWUC    EQU   CSWUSTAT                                                 00694000
CSWDE    EQU   CSWUSTAT                                                 00695000
CSWCE    EQU   CSWUSTAT                                                 00696000
CSWBUSY  EQU   CSWUSTAT                                                 00697000
CSWCUE   EQU   CSWUSTAT                                                 00698000
CSWSTMOD EQU   CSWUSTAT                                                 00699000
CSWATTN  EQU   CSWUSTAT                                                 00700000
CSWCADDR EQU   CSW+1                                                    00701000
@NM00039 EQU   CSWKEY00                                                 00702000
CSWKEY   EQU   CSWKEY00                                                 00703000
CCWCNT   EQU   CCW+6                                                    00704000
@NM00038 EQU   CCW+5                                                    00705000
@NM00037 EQU   CCWFLAGS                                                 00706000
CCWIDA   EQU   CCWFLAGS                                                 00707000
CCWPCI   EQU   CCWFLAGS                                                 00708000
CCWSKIP  EQU   CCWFLAGS                                                 00709000
CCWSLI   EQU   CCWFLAGS                                                 00710000
CCWCC    EQU   CCWFLAGS                                                 00711000
CCWDC    EQU   CCWFLAGS                                                 00712000
CCWDADDR EQU   CCW+1                                                    00713000
CCWCMD   EQU   CCW                                                      00714000
CTHWMAX  EQU   CTDMPTYP+29                                              00715000
CTHWM    EQU   CTDMPTYP+28                                              00716000
CTPRMT2X EQU   CTPRMT2+1                                                00717000
CTPRMT2Y EQU   CTPRMT2                                                  00718000
CTPRMT1X EQU   CTPRMT1+1                                                00719000
CTPRMT1Y EQU   CTPRMT1                                                  00720000
CTVCCT   EQU   CTDMPTYP+20                                              00721000
CTEOR    EQU   CTDMPTYP+16                                              00722000
CTCOMMIO EQU   CTDMPTYP+12                                              00723000
CTLWKAD  EQU   CTDMPTYP+8                                               00724000
CTCONSOL EQU   CTDMPTYP+4                                               00725000
@NM00036 EQU   CTBUFTYP                                                 00726000
CTDUMP   EQU   CTBUFTYP                                                 00727000
CTLSQA   EQU   CTBUFTYP                                                 00728000
CTASM    EQU   CTBUFTYP                                                 00729000
CTPGT    EQU   CTBUFTYP                                                 00730000
CTWKFLE  EQU   CTBUFTYP                                                 00731000
@NM00035 EQU   CTBUFTYP                                                 00732000
@NM00034 EQU   CTCONFLG                                                 00733000
CTREAD   EQU   CTCONFLG                                                 00734000
CTMSGOUT EQU   CTCONFLG                                                 00735000
@NM00033 EQU   CTDMPTYP+1                                               00736000
@NM00032 EQU   CTIOTYPE                                                 00737000
CTIOINT  EQU   CTIOTYPE                                                 00738000
CTEBCOPR EQU   CCT+49                                                   00739000
@NM00031 EQU   CTLOWFLG                                                 00740000
CTWKSTUS EQU   CTLOWFLG                                                 00741000
CTINIT   EQU   CTLOWFLG                                                 00742000
CTFP     EQU   CTLOWFLG                                                 00743000
CTVIRTD  EQU   CTLOWFLG                                                 00744000
CTEBCOPD EQU   CCT+45                                                   00745000
CTCONTYP EQU   CCT+44                                                   00746000
CTOUTAD  EQU   CCT+42                                                   00747000
CTERBCON EQU   CCT+36                                                   00748000
CTERBTPE EQU   CCT+32                                                   00749000
CTERBDA  EQU   CCT+28                                                   00750000
CTCCHHW  EQU   CCT+24                                                   00751000
CTCCHHE  EQU   CCT+20                                                   00752000
CTCCHHS  EQU   CCT+16                                                   00753000
CTPGECNT EQU   CCT+15                                                   00754000
CTCCHHR  EQU   CCT+8                                                    00755000
CTINADDR EQU   CCT+6                                                    00756000
CTSENSE  EQU   CCT+4                                                    00757000
CTDEVTYP EQU   CCT+3                                                    00758000
@NM00030 EQU   CTFLG2                                                   00759000
CTALTCON EQU   CTFLG2                                                   00760000
CTWKDONE EQU   CTFLG2                                                   00761000
CTVIRTR  EQU   CTFLG2                                                   00762000
CTNOSTAT EQU   CTFLG2                                                   00763000
CTPGEFLT EQU   CTFLG2                                                   00764000
CTSTOR   EQU   CTFLG2                                                   00765000
CTDUPSW  EQU   CTFLG2                                                   00766000
CTERREC  EQU   CTFLG1                                                   00767000
@NM00029 EQU   CTFLG1                                                   00768000
CTDEFO   EQU   CTFLG1                                                   00769000
CTWORK   EQU   CTFLG1                                                   00770000
CTMORTPE EQU   CTFLG1                                                   00771000
CTDEVICE EQU   CTFLG1                                                   00772000
CTERROR  EQU   CTFLG1                                                   00773000
CTWAIT   EQU   CCT                                                      00774000
@NM00028 EQU   BCT+46                                                   00775000
BCTRECLM EQU   BCTFLGI                                                  00776000
BCTIOERR EQU   BCTFLGI                                                  00777000
BCTALLOC EQU   BCTFLGI                                                  00778000
BCTCOMP  EQU   BCTFLGI                                                  00779000
@NM00027 EQU   BCTFLGT                                                  00780000
BCTPGTF  EQU   BCTFLGT                                                  00781000
BCTDUMP  EQU   BCTFLGT                                                  00782000
BCTLSQA  EQU   BCTFLGT                                                  00783000
BCTASM   EQU   BCTFLGT                                                  00784000
BCTPGT   EQU   BCTFLGT                                                  00785000
BCTWKFLE EQU   BCTFLGT                                                  00786000
@NM00026 EQU   BCTFLGT                                                  00787000
BCTRBA   EQU   BCT+40                                                   00788000
BCTAMB   EQU   BCT+36                                                   00789000
@NM00025 EQU   BCTLPID+4                                                00790000
BCTLGN   EQU   BCTLPID                                                  00791000
BCTMDCB  EQU   BCT+24                                                   00792000
BCTPGTE  EQU   BCT+20                                                   00793000
BCTRADDR EQU   BCT+16                                                   00794000
BCTVADDR EQU   BCT+12                                                   00795000
BCTASID  EQU   BCT+10                                                   00796000
BCTKEY2  EQU   BCT+9                                                    00797000
BCTKEY1  EQU   BCT+8                                                    00798000
BCTNEXT  EQU   BCT+4                                                    00799000
BCTBCT   EQU   BCT                                                      00800000
BCTHLAST EQU   BCTH+8                                                   00801000
BCTHFRST EQU   BCTH+4                                                   00802000
BCTHBCTH EQU   BCTH                                                     00803000
ARBADDRE EQU   ARB+4                                                    00804000
ARBADDRB EQU   ARB                                                      00805000
GTMSAVE  EQU   SADMPLSD+684                                             00806000
GTMNAME  EQU   SADMPLSD+680                                             00807000
FRMSAVE  EQU   SADMPLSD+580                                             00808000
FRMNAME  EQU   SADMPLSD+576                                             00809000
AUDSAVE  EQU   SADMPLSD+476                                             00810000
AUDNAME  EQU   SADMPLSD+472                                             00811000
IOISAVE  EQU   SADMPLSD+372                                             00812000
IOINAME  EQU   SADMPLSD+368                                             00813000
PGISAVE  EQU   SADMPLSD+268                                             00814000
PGINAME  EQU   SADMPLSD+264                                             00815000
SVISAVE  EQU   SADMPLSD+164                                             00816000
SVINAME  EQU   SADMPLSD+160                                             00817000
SAVEDUMP EQU   SADMPLSD+24                                              00818000
AUDPSW   EQU   SADMPLSD+16                                              00819000
SVIRPSW  EQU   SADMPLSD+8                                               00820000
PSWSADMP EQU   SADMPLSD                                                 00821000
PFIOIRST EQU   DEBUGLSD+24                                              00822000
PFWATOIP EQU   DEBUGLSD+22                                              00823000
PFWATDE  EQU   DEBUGLSD+20                                              00824000
PFWATEN  EQU   DEBUGLSD+18                                              00825000
PFWATENW EQU   DEBUGLSD+16                                              00826000
PFSIOWAT EQU   DEBUGLSD+14                                              00827000
PFSIOPCI EQU   DEBUGLSD+12                                              00828000
PFSIOOUT EQU   DEBUGLSD+10                                              00829000
PFSIOWK  EQU   DEBUGLSD+8                                               00830000
PFSIODA  EQU   DEBUGLSD+6                                               00831000
PFBUFWAT EQU   DEBUGLSD+2                                               00832000
PFTRCLM  EQU   DEBUGLSD                                                 00833000
@NM00024 EQU   PSA+3412                                                 00834000
PSASTAK  EQU   PSA+3072                                                 00835000
@NM00023 EQU   PSA+1024                                                 00836000
PSAUSEND EQU   PSA+1024                                                 00837000
PSARV060 EQU   PSA+1020                                                 00838000
PSARV059 EQU   PSA+1018                                                 00839000
PSASVC13 EQU   PSA+1016                                                 00840000
PSALSFCC EQU   PSA+1012                                                 00841000
PSASFACC EQU   PSA+1008                                                 00842000
PSASTOP  EQU   PSA+992                                                  00843000
PSASTART EQU   PSA+976                                                  00844000
PSARSPSW EQU   PSA+968                                                  00845000
PSASRPSW EQU   PSA+960                                                  00846000
PSARV045 EQU   PSA+892                                                  00847000
PSARV044 EQU   PSA+888                                                  00848000
PSARV043 EQU   PSA+884                                                  00849000
PSARV042 EQU   PSA+880                                                  00850000
PSARV041 EQU   PSA+876                                                  00851000
PSARV040 EQU   PSA+872                                                  00852000
PSARV025 EQU   PSA+868                                                  00853000
PSADSSED EQU   PSA+868                                                  00854000
PSADSSPR EQU   PSA+864                                                  00855000
PSADSSFW EQU   PSA+860                                                  00856000
PSADSS14 EQU   PSA+856                                                  00857000
PSADSSPP EQU   PSA+848                                                  00858000
PSADSSRP EQU   PSA+840                                                  00859000
PSADSS05 EQU   PSADSSF4                                                 00860000
PSADSS10 EQU   PSADSSF4                                                 00861000
PSADSSVE EQU   PSADSSF4                                                 00862000
PSADSSDE EQU   PSADSSF4                                                 00863000
PSADSSC0 EQU   PSADSSF4                                                 00864000
PSADSSIE EQU   PSADSSF4                                                 00865000
PSADSS12 EQU   PSADSSF4                                                 00866000
PSADSSRC EQU   PSADSSF4                                                 00867000
PSARV057 EQU   PSADSSF3                                                 00868000
PSARV056 EQU   PSADSSF3                                                 00869000
PSARV055 EQU   PSADSSF3                                                 00870000
PSARV054 EQU   PSADSSF3                                                 00871000
PSADSSRW EQU   PSADSSF3                                                 00872000
PSADSSNM EQU   PSADSSF3                                                 00873000
PSADSSES EQU   PSADSSF3                                                 00874000
PSADSSGP EQU   PSADSSF3                                                 00875000
PSADSSF2 EQU   PSADSSFL+1                                               00876000
PSADSSPI EQU   PSADSSF1                                                 00877000
PSADSSOI EQU   PSADSSF1                                                 00878000
PSADSSSP EQU   PSADSSF1                                                 00879000
PSADSSTP EQU   PSADSSF1                                                 00880000
PSADSSDW EQU   PSADSSF1                                                 00881000
PSADSSDD EQU   PSADSSF1                                                 00882000
PSADSSDM EQU   PSADSSF1                                                 00883000
PSADSSMV EQU   PSADSSF1                                                 00884000
PSADSSTS EQU   PSA+816                                                  00885000
PSADSSWK EQU   PSA+812                                                  00886000
PSADSSR3 EQU   PSA+808                                                  00887000
PSADSSR2 EQU   PSA+804                                                  00888000
PSADSSRS EQU   PSA+800                                                  00889000
PSASTOR  EQU   PSA+796                                                  00890000
PSARV058 EQU   PSA+794                                                  00891000
PSAVSTAP EQU   PSA+792                                                  00892000
PSAWKVAP EQU   PSA+788                                                  00893000
PSAWKRAP EQU   PSA+784                                                  00894000
PSAMCHIC EQU   PSA+783                                                  00895000
PSAMODE  EQU   PSA+782                                                  00896000
PSASYMSK EQU   PSA+781                                                  00897000
PSAMCHFL EQU   PSA+780                                                  00898000
PSACR0   EQU   PSA+776                                                  00899000
PSAPSWSV EQU   PSA+768                                                  00900000
PSALITA  EQU   PSA+764                                                  00901000
PSACLHS  EQU   PSAHLHI                                                  00902000
PSALKR15 EQU   PSALKSA+60                                               00903000
PSALKR14 EQU   PSALKSA+56                                               00904000
PSALKR13 EQU   PSALKSA+52                                               00905000
PSALKR12 EQU   PSALKSA+48                                               00906000
PSALKR11 EQU   PSALKSA+44                                               00907000
PSALKR10 EQU   PSALKSA+40                                               00908000
PSALKR9  EQU   PSALKSA+36                                               00909000
PSALKR8  EQU   PSALKSA+32                                               00910000
PSALKR7  EQU   PSALKSA+28                                               00911000
PSALKR6  EQU   PSALKSA+24                                               00912000
PSALKR5  EQU   PSALKSA+20                                               00913000
PSALKR4  EQU   PSALKSA+16                                               00914000
PSALKR3  EQU   PSALKSA+12                                               00915000
PSALKR2  EQU   PSALKSA+8                                                00916000
PSALKR1  EQU   PSALKSA+4                                                00917000
PSALKR0  EQU   PSALKSA                                                  00918000
PSARV023 EQU   PSACLHT+52                                               00919000
PSALOCAL EQU   PSACLHT+48                                               00920000
PSACMSL  EQU   PSACLHT+44                                               00921000
PSAOPTL  EQU   PSACLHT+40                                               00922000
PSATPACL EQU   PSACLHT+36                                               00923000
PSATPDNL EQU   PSACLHT+32                                               00924000
PSATPNCL EQU   PSACLHT+28                                               00925000
PSAIOSLL EQU   PSACLHT+24                                               00926000
PSAIOSUL EQU   PSACLHT+20                                               00927000
PSAIOSCL EQU   PSACLHT+16                                               00928000
PSAIOSSL EQU   PSACLHT+12                                               00929000
PSASALCL EQU   PSACLHT+8                                                00930000
PSAASML  EQU   PSACLHT+4                                                00931000
PSADISPL EQU   PSACLHT                                                  00932000
PSASRSA  EQU   PSA+636                                                  00933000
PSARV050 EQU   PSA+634                                                  00934000
PSADSSGO EQU   PSA+633                                                  00935000
PSARECUR EQU   PSA+632                                                  00936000
PSAHLHIS EQU   PSA+628                                                  00937000
PSAIPCSA EQU   PSA+624                                                  00938000
@NM00022 EQU   PSA+621                                                  00939000
PSAIPCDM EQU   PSA+620                                                  00940000
PSAIPCD  EQU   PSA+616                                                  00941000
@NM00021 EQU   PSA+613                                                  00942000
PSAIPCRM EQU   PSA+612                                                  00943000
PSAIPCR  EQU   PSA+608                                                  00944000
PSAMCHEX EQU   PSA+600                                                  00945000
PSAMPSW  EQU   PSA+592                                                  00946000
PSAEXPS2 EQU   PSA+584                                                  00947000
PSAEXPS1 EQU   PSA+576                                                  00948000
PSAPIREG EQU   PSA+572                                                  00949000
PSARSREG EQU   PSA+568                                                  00950000
PSAGPREG EQU   PSA+556                                                  00951000
PSARV022 EQU   PSASUP4                                                  00952000
PSARV021 EQU   PSASUP4                                                  00953000
PSARV020 EQU   PSASUP4                                                  00954000
PSARV019 EQU   PSASUP4                                                  00955000
PSARV018 EQU   PSASUP4                                                  00956000
PSARV017 EQU   PSASUP4                                                  00957000
PSARV016 EQU   PSASUP4                                                  00958000
PSARV015 EQU   PSASUP4                                                  00959000
PSARV014 EQU   PSASUP3                                                  00960000
PSARV013 EQU   PSASUP3                                                  00961000
PSARV012 EQU   PSASUP3                                                  00962000
PSARV011 EQU   PSASUP3                                                  00963000
PSARV010 EQU   PSASUP3                                                  00964000
PSARV009 EQU   PSASUP3                                                  00965000
PSARV008 EQU   PSASUP3                                                  00966000
PSAIOSUP EQU   PSASUP3                                                  00967000
PSALCR   EQU   PSASUP2                                                  00968000
PSARTM   EQU   PSASUP2                                                  00969000
PSAACR   EQU   PSASUP2                                                  00970000
PSAIPCE2 EQU   PSASUP2                                                  00971000
PSAIPCES EQU   PSASUP2                                                  00972000
PSAIPCEC EQU   PSASUP2                                                  00973000
PSAGTF   EQU   PSASUP2                                                  00974000
PSAIPCRI EQU   PSASUP2                                                  00975000
PSAIPCRP EQU   PSASUP1                                                  00976000
PSAIPCDR EQU   PSASUP1                                                  00977000
PSADISP  EQU   PSASUP1                                                  00978000
PSALOCK  EQU   PSASUP1                                                  00979000
PSAPI    EQU   PSASUP1                                                  00980000
PSAEXT   EQU   PSASUP1                                                  00981000
PSASVC   EQU   PSASUP1                                                  00982000
PSAIO    EQU   PSASUP1                                                  00983000
PSAAOLD  EQU   PSA+548                                                  00984000
PSAANEW  EQU   PSA+544                                                  00985000
PSATOLD  EQU   PSA+540                                                  00986000
PSATNEW  EQU   PSA+536                                                  00987000
PSALCCAR EQU   PSA+532                                                  00988000
PSALCCAV EQU   PSA+528                                                  00989000
PSAPCCAR EQU   PSA+524                                                  00990000
PSAPCCAV EQU   PSA+520                                                  00991000
PSACPULA EQU   PSA+518                                                  00992000
PSACPUPA EQU   PSA+516                                                  00993000
PSAPSA   EQU   PSA+512                                                  00994000
FLCHDEND EQU   PSA+512                                                  00995000
FLCCRSAV EQU   FLCMCLA+280                                              00996000
FLCGRSAV EQU   FLCMCLA+216                                              00997000
FLCFPSAV EQU   FLCMCLA+184                                              00998000
FLCFLA   EQU   FLCMCLA+88                                               00999000
FLCRGNCD EQU   FLCMCLA+84                                               01000000
FLCFSAA  EQU   FLCFSA+1                                                 01001000
@NM00020 EQU   FLCFSA                                                   01002000
@NM00019 EQU   FLCMCLA+72                                               01003000
FLCMCIC  EQU   FLCMCLA+64                                               01004000
@NM00018 EQU   FLCMCLA+20                                               01005000
FLCIOAA  EQU   FLCIOA+1                                                 01006000
@NM00017 EQU   FLCIOA                                                   01007000
@NM00016 EQU   FLCMCLA+15                                               01008000
@NM00015 EQU   FLCMCLA+14                                               01009000
@NM00014 EQU   FLCMCLA+12                                               01010000
FLCLCL   EQU   FLCMCLA+8                                                01011000
FLCIOELA EQU   FLCIOEL+1                                                01012000
@NM00013 EQU   FLCIOEL                                                  01013000
FLCCHNID EQU   FLCMCLA                                                  01014000
@NM00012 EQU   PSA+160                                                  01015000
FLCMTRCD EQU   PSA+157                                                  01016000
@NM00011 EQU   PSA+156                                                  01017000
FLCPERA  EQU   FLCPER+1                                                 01018000
@NM00010 EQU   FLCPER                                                   01019000
@NM00009 EQU   PSA+151                                                  01020000
FLCPERCD EQU   PSA+150                                                  01021000
FLCMCNUM EQU   PSA+149                                                  01022000
@NM00008 EQU   PSA+148                                                  01023000
FLCTEAA  EQU   FLCTEA+1                                                 01024000
@NM00007 EQU   FLCTEA                                                   01025000
PSAPIPC  EQU   PSAPICOD                                                 01026000
PSAPIMC  EQU   PSAPICOD                                                 01027000
PSAPIPER EQU   PSAPICOD                                                 01028000
PSARV049 EQU   FLCPICOD                                                 01029000
FLCPILCB EQU   FLCPIILC                                                 01030000
@NM00006 EQU   FLCPIILC                                                 01031000
@NM00005 EQU   PSAEPPSW                                                 01032000
FLCSVCN  EQU   PSAESPSW+2                                               01033000
FLCSILCB EQU   FLCSVILC                                                 01034000
@NM00004 EQU   FLCSVILC                                                 01035000
@NM00003 EQU   PSAESPSW                                                 01036000
FLCEICOD EQU   PSAEEPSW+2                                               01037000
PSASPAD  EQU   PSAEEPSW                                                 01038000
@NM00002 EQU   PSA+128                                                  01039000
FLCINPSW EQU   PSA+120                                                  01040000
FLCMNPSW EQU   PSA+112                                                  01041000
FLCPNPSW EQU   PSA+104                                                  01042000
FLCSNPSW EQU   PSA+96                                                   01043000
FLCENPSW EQU   PSA+88                                                   01044000
FLCTRACE EQU   PSA+84                                                   01045000
FLCTIMER EQU   PSA+80                                                   01046000
FLCCVT2  EQU   PSA+76                                                   01047000
FLCCAW   EQU   PSA+72                                                   01048000
FLCCSW   EQU   PSA+64                                                   01049000
FLCIOPSW EQU   PSA+56                                                   01050000
FLCMOPSW EQU   PSA+48                                                   01051000
FLCPOPSW EQU   PSA+40                                                   01052000
FLCSOPSW EQU   PSA+32                                                   01053000
FLCEOPSW EQU   PSA+24                                                   01054000
@NM00001 EQU   FLCICCW2+4                                               01055000
FLCCVT   EQU   FLCICCW2                                                 01056000
FLCICCW1 EQU   FLCROPSW                                                 01057000
FLCIPPSW EQU   FLCRNPSW                                                 01058000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01059000
@RT00201 EQU   EREXIT1                                                  01060000
@ENDDATA EQU   *                                                        01061000
         END   AMDSATAP,(C'PL/S-II',0502,73230)                         01062000
