       TITLE 'VPSS SUBSYSTEM INITIALIZATION TABLE'                      00020000
**********************************************************************  00040000
*                                                                    *  00060000
*        IGT0VPSS - VPSS SUBSYSTEM INITIALIZATION TABLE              *  00080000
*                                                                    *  00100000
*        MVS/VS1    09/13/76    LEVEL 01.1                           *  00120000
*                                                                    *  00140000
*     METHOD OF ACCESS - IGT0VPSS IS ASSEMBLED AND LINK-EDITED INTO  *  00160000
*                        SYS1.LOADVPSS AS IGT0VPSS. SUBSYSTEM        *  00180000
*                        INITIALIZATIION ISSUES A LOAD OF            *  00200000
*                        IGT0VPSS.                                   *  00220000
*                                                                    *  00240000
*     FUNCTION - IGT0VPSS CONTAINS SEVERAL TABLES ORGANIZED AS       *  00260000
*                FOLLOWS:                                            *  00280000
*                                                                    *  00300000
*                  (1) APOT - VPSS SUBSYSTEM OPTIONS TABLE           *  00320000
*                             THIS PORTION OF THE APOT CONTAINS      *  00340000
*                             POINTERS TO THE OTHER APOT TABLES -    *  00360000
*                             APOTNM,APOTVT,APOTAD                   *  00380000
*                  (2) APCT - VPSS SUBSYSTEM CONTROL TABLE           *  00400000
*                             THE APCT CONTAINS THE ADDRESSES OF     *  00420000
*                             VPSS PROCESSING ROUTINES, POINTERS TO  *  00440000
*                             VARIOUS VPSS TABLES AND INSTALLATION-  *  00460000
*                             DEFINED PROCESSING PARAMETERS.         *  00480000
*                  (3) ARPT - APCP ROUTINE POINTER TABLE                00500000
*                             THIS TABLE CONTAINS ADDRESSES OF       *  00520000
*                             ROUTINES WHICH PERFORM USER CALL       *  00540000
*                             PROCESSING AS DEFINED IN THE APCP.     *  00560000
*                  (4) APCP/APAL - VPSS CALL INTERFACE PROCESSOR     *  00580000
*                             PARAMETERS/VPSS ALGORITHM BUILD MASKS  *  00600000
*                  (5) APOTNM - VPSS MODULE NAME TABLE               *  00620000
*                             THIS TABLE CONTAINS THE NAMES OF VPSS  *  00640000
*                             MODULES TO BE LOADED AND THE APCT      *  00660000
*                             OFFSET WHERE THE LOADED MODULE'S       *  00680000
*                             ADDRESS IS TO BE PLACED.               *  00700000
*                  (6) APOTVT - VPSS SUBSYSTEM VECTOR TABLE          *  00720000
*                             SSVT INITIALIZATION PARAMETERS.        *  00740000
*                  (7) APOTAD - APCT RELOCATION TABLE                *  00760000
*                             USED TO MODIFY THE APCT INTERNAL       *  00780000
*                             POINTERS.                              *  00800000
*                                                                    *  00820000
*      THE FUNCTION AND METHOD OF CHANGE FOR EACH TABLE IS EXPLAINED *  00840000
*     IN THE PROLOGUE TO EACH MACRO DEFINITION.                      *  00860000
*                                                                    *  00880000
**********************************************************************  00900000
         EJECT                                                          00920000
**********************************************************************  00940000
*                                                                    *  00960000
*                   IGT0VPSS INTERNAL MACROS.                        *  00980000
*                                                                    *  01000000
*        THE FOLLOWING MACROS ARE USED INTERNALLY TO GENERATE        *  01020000
*        PORTIONS OF IGT0VPSS. THE EXPLANATION PRECEDING EACH        *  01040000
*        MACRO DEFINITION INDICATES THE FUNCTION AND USE OF THE      *  01060000
*        MACRO.                                                      *  01080000
*                                                                    *  01100000
**********************************************************************  01120000
         EJECT                                                          01140000
**********************************************************************  01160000
*                                                                    *  01180000
*                       IGT0APCT MACRO                               *  01200000
*                                                                    *  01220000
*         FUNCTION - THIS MACRO IS USED TO CHANGE VALUES IN THE      *  01240000
*                    APCT. INVOCATIONS OF THIS MACRO MUST FOLLOW     *  01260000
*                    THE GENERATION OF THE APCT BY THE VPSS MACRO    *  01280000
*                    IGTXAPCT. THIS MACRO ORGS TO THE SPECIFIED      *  01300000
*                    APCT LABEL AND REDEFINES THE DATA AT THAT       *  01320000
*                    LABEL.                                          *  01340000
*        MACRO INVOCATION -                                          *  01360000
*                   APCTLBL  IGT0APCT APCTNVAL                       *  01380000
*                   WHERE APCTLBL IS THE LAST 1-4 CHARACTERS(FOLLOW- *  01400000
*                   THE CHARACTERS APCT) OF THE LABEL IN APCT FOR    *  01420000
*                   WHICH THE CHANGE IS TO BE MADE                   *  01440000
*                   AND APCTNVAL IS THE REPLACEMENT VALUE.           *  01460000
*                   THIS VALUE MUST HAVE THE SAME LENGTH ATTRIBUTE   *  01480000
*                   AS THE VALUE IT REPLACES.                        *  01500000
*        EXAMPLE OF USE -                                            *  01520000
*                   TO CHANGE THE SUBSYSTEM NAME TO XXXX, THE        *  01540000
*                   FOLLOWING MACRO INVOCATION WOULD FOLLOW THE      *  01560000
*                   GENERATION OF THE APCT:                          *  01580000
*                   SSID   IGT0APCT   CL4'XXXX'                      *  01600000
*                                                                    *  01620000
**********************************************************************  01640000
         SPACE 5                                                        01660000
         MACRO                     IGT0APCT                             01680000
&APCTLBL IGT0APCT &APCTVAL         APCT CHANGE MACR0                    01700000
.*                                                                      01720000
.** THIS MACRO IS USED TO CHANGE VALUES IN THE APCT. THIS IS            01740000
.** ACCOMPLISHED BY 'ORG'ING TO THE SPECIFIED APCT LABEL AND            01760000
.**'DC'ING A NEW VALUE AT THAT LABEL.                                   01780000
.** INPUT ---                                                           01800000
.**          &APCTLBL  - THE LAST 1-4 CHARACTERS(FOLLOWING THE          01820000
.**                      CHARACTERS 'APCT') OF THE APCT LABEL FOR WHICH 01840000
.**                      THE CHANGE IS TO BE MADE.                      01860000
.**          &APCTVAL  - THE NEW VALUE TO BE INSERTED AT THE LOCATION   01880000
.**                      SPECIFIED BY &APCTLBL.                         01900000
.*                                                                      01920000
         LCLA  &LNP                HOLDS LENGTH OF &APCTLBL PARAMETER   01940000
&LNP     SETA  K'&APCTLBL          GET NUMBER OF CHARACTERS IN          01960000
.*                                 &APCTLBL PARAMETER                   01980000
         AIF   (&LNP LT 1 OR &LNP GT 4).BADLBL                          02000000
.*                                 .BADLBL IF NUMBER OF CHARACTERS IS   02020000
.*                                 ZERO OR GT 5                         02040000
         ORG   APCT&APCTLBL        ORG TO DESIRED APCT LOCATION         02060000
         DC    &APCTVAL            DEFINE NEW APCT VALUE                02080000
         AGO   .APCTOVR            CHANGE IS MADE - GO TO .APCTOVR      02100000
.BADLBL  ANOP  ,                   &APCTLBL IS BAD - ISSUE ERROR MSG.   02120000
         IGTXMERR ERRN=1,KEYWORD=APCTLBL,ERRLVL=8,VALUE=&APCTLBL        02140000
.APCTOVR ANOP  ,                                                        02160000
         ORG   ,                                                        02180000
         MEND                                                           02200000
         EJECT                                                          02220000
*********************************************************************** 02240000
*                                                                     * 02260000
*                          IGT0MNT MACRO                              * 02280000
*                                                                     * 02300000
*           FUNCTION - THIS MACRO IS USED TO GENERATE APOTNM ENTRIES  * 02320000
*                      WHICH TELL VPSS WHICH MODULES TO LOAD.         * 02340000
*                      SEE THE APOTNM DSECT WITHIN IGTXAPOT FOR       * 02360000
*                      APOTNM FORMAT.                                 * 02380000
*                                                                     * 02400000
*           MACRO INVOCATION -                                        * 02420000
*                                                                     * 02440000
*           LABEL   IGT0MNT SUFFIX,TYPE,SUNBR,LOAD,SYST=,FIX=,NAME=   * 02460000
*                                                                     * 02480000
*                      WHERE:                                         * 02500000
*                           LABEL - LABEL DESIRED FOR THIS APOTNM     * 02520000
*                                   ENTRY. IF OMITTED, A LABEL OF THE * 02540000
*                                   FORM IGTT(TYPE)(SUFFIX) IS        * 02560000
*                           SUFFIX- MODULE SUFFIX(REQUIRED PARAMETER) * 02580000
*                           TYPE  - MODULE TYPE(REQUIRED PARAMETER)   * 02600000
*                                   = Z - VPSS ROUTINE.               * 02620000
*                                   = @ - USER EXIT ROUTINE.          * 02640000
*                           SUNBR - SU NUMBER FOR THIS MODULE(IF      * 02660000
*                                   APPLICABLE)                       * 02670000
*                           LOAD  - MODULE LOAD FLAG(REQUIRED ONLY IF * 02680000
*                                   SUNBR APPLIES.                    * 02690000
*                                   = YES - IF SUNBR APPLID - LOAD    * 02700000
*                                   THIS MODULE.                      * 02720000
*                                   = NO  - IF SUNBR APPLIED - DO NOT * 02740000
*                                   LOAD THIS MODULE.                 * 02760000
*                           SYST= - KEYWORD PARAMETER USED TO SPECIFY * 02762000
*                                   FOR WHICH SYSTEM MODULE APPLIES.  * 02764000
*                                   = VS1 - LOAD THIS MODULE FOR VS1  * 02766000
*                                           ONLY.                     * 02768000
*                                   = MVS - LOAD THIS MODULE FOR MVS  * 02770000
*                                           ONLY.                     * 02772000
*                                   = ALL(DEFAULT) - LOAD THIS MODULE * 02774000
*                                           FOR MVS AND VS1.          * 02776000
*                           FIX=  - KEYWORD PARAMETER USED TO SPECIFY * 02776400
*                                   IF A MODULE IS TO BE PERMANENTLY  * 02776800
*                                   FIXED.                            * 02777200
*                                   = YES - FIX MODULE.               * 02777600
*                                   = NO(DEFAULT) - DO NOT FIX MODULE.* 02778000
*                           NAME= - KEYWORD PARAMETER USED TO         * 02778400
*                                   GENERATE MODULE NAME IF STAN-     * 02778800
*                                   DARD NAME OF IGT(SUFFIX) IS NOT   * 02779200
*                                   TO BE USED.                       * 02779600
*           EXAMPLE OF USE   - TO GENERATE AN APOTNM ENTRY FOR USER   * 02780000
*                              EXIT MODULE IGTXXX, APPLIED FOR SU     * 02800000
*                              NUMBER 99 WITH LOAD = YES, APPLICABLE  * 02820000
*                              TO MVS AND VS1 AND LABELED LABXXX, THE * 02830000
*                              FOLLOWING MACRO STATEMENT WOULD BE     * 02840000
*                              USED:                                  * 02850000
*                                                                     * 02880000
*           LABXXX  IGT0MNT XXX,@,99,YES                              * 02900000
*                                                                     * 02920000
*********************************************************************** 02940000
         SPACE 5                                                        02960000
         MACRO                          IGT0MNT                         02980000
&NMLBL   IGT0MNT &SUFFIX,&TYPE,&SUNBR,&LOAD,&SYST=ALL,&FIX=NO,&NAME=    03000000
.*                                      GENERATE APOTNMT ENTRY          03010000
.*                                                                      03020000
.** THIS MACRO IS USED TO GENERATE APOTNMT ENTRIES. FIRST, THE SYST     03040000
.** KEYWORD IS CHECKED AGAINST THE SYSTEM BEING USED(FROM IGTXSYSA).    03046000
.** IF THE SYSTEM DOES NOT MATCH, THIS MACRO EXITS. OTHERWISE, AN 8     03052000
.** CHARACTER NAME IS DEFINED VIA 'DC'. THE NAME IS OF THE FORM         03060000
.** IGT(SUFFIX) UNLESS A MODULE NAME HAS BEEN SUPPLIED VIA THE NAME     03080000
.** KEYWORD. NEXT, USING THE TYPE PARAMETER, THE APCT OFFSET IS         03090000
.** DETERMINED AND PLACED INTO A HALFWORD LOCATION. THE NEXT TWO        03100000
.** BYTES ARE CONFIGURED ACCORDING TO THE LOAD PARAMETER. AND THE       03120000
.** LAST HALFWORD IS FILLED WITH THE APPLICABLE SU NUMBER, IF ANY.      03140000
.** THE ENTRY LABEL IS THE USER'S IF SUPPLIED. OTHERWISE, THIS MACRO    03160000
.** GENERATES A LABEL OF THE FORM IGTT(TYPE)(SUFFIX).                   03180000
.** INPUT ---                                                           03200000
.**          &NMLBL    - DESIRED ENTRY LABEL OR BLANK IF THIS MACRO IS  03220000
.**                      TO GENERATE LABEL.                             03240000
.**          &SUFFIX   - SUFFIX OF MODULE TO BE LOADED.(MODULE NAME     03260000
.**                      WITHOUT CHARACTERS'IGT').                      03280000
.**          &TYPE     - MODULE TYPE.                                   03300000
.**                      = Z - VPSS ROUTINE.                            03320000
.**                      = @ - APCP ROUTINE POINTER.                    03340000
.**          &SUNBR    - SU NUMBER FOR THIS MODULE, IF APPLICABLE.      03360000
.**          &LOAD     - MODULE LOAD FLAG(APPLICABLE ONLY IF SUNBR      03380000
.**                      USED).                                         03400000
.**                      = YES - IF SUNBR APPLIED - LOAD                03420000
.**                        THIS MODULE.                                 03440000
.**                      = NO  - IF SUNBR APPLIED - DO NOT              03460000
.**                        LOAD THIS MODULE.                            03480000
.**          &SYST    - SYSTEM FLAG.                                    03482000
.**                     = VS1 - VS1 ONLY MODULE.                        03484000
.**                     = MVS - MVS ONLY MODULE.                        03486000
.**                     = ALL(DEFAULT) - MVS AND VS1 MODULE.            03488000
.**          &FIX     - MODULE FIX FLAG.                                03490000
.**                     = YES - FIX MODULE.                             03492000
.**                     = NO  - DO NOT FIX MODULE.                      03494000
.**          &NAME    - MODULE NAME. USED IF MODULE NAME TO             03500000
.**                     BE OTHER THAN THE STANDARD FORM OF              03505000
.**                     IGT(SUFFIX).                                    03510000
.*                                                                      03515000
         COPY  IGTXSYSA                 GET SYSTEM NAME/LEVEL           03520000
         AIF   ('&SYST' EQ 'ALL').DONM  .DONM IF FOR MVS AND VS1        03521000
         AIF   ('&SYST' EQ 'VS1').CKVS1 .CKVS1 IF SYST=VS1              03522000
         AIF   ('&SYST' NE 'MVS').SYSER .SYSER IF SYST NE MVS/VS1/ALL   03523000
.*                                                                      03524000
.**                                     MODULE IS FOR MVS ONLY          03525000
.*                                                                      03526000
         AIF   ('&VPSSSYS' EQ 'MVS').DONM  .DONM IF THIS IS MVS SYSTEM  03527000
         MEXIT                          IGNORE THIS REQUEST IF NOT MVS  03528000
.CKVS1   AIF   ('&VPSSSYS' EQ 'VS1').DONM  .DONM IF THIS IS VS1 SYSTEM  03529000
         MEXIT                          IGNORE THIS REQUEST IF NOT VS1  03530000
.DONM    AIF   ('&SUFFIX' EQ ' ').NOSUF .NOSUF IF SUFFIX OMITTED        03531000
         AIF   ('&TYPE' EQ '').NOTYPE   .NOTYPE IF TYPE OMITTED         03540000
         AIF   ('&FIX' EQ 'YES' OR '&FIX' EQ 'NO').FXOK                 03560000
.*                                      VALIDATE FIX PARAMETER          03563000
         IGTXMERR ERRN=1,ERRLVL=12,KEYWORD=FIX,VALUE=&FIX,             *03566000
               RANGE=(YES,NO)           ISSUE SEVERE ERROR MSG IF FIX   03569000
         MEXIT                          PARM BAD AND EXIT               03572000
.FXOK    AIF   ('&SUNBR' EQ '' AND '&LOAD' NE '').NOSUNB                03575000
.*                                      .NOSUNB IF LOAD SPECIFIED BUT   03580000
.*                                      SUNBR NOT SPECIFIED             03600000
         AIF   ('&LOAD' EQ '' AND '&SUNBR' NE '').NOLOAD                03620000
.*                                      .NOLOAD IF SUNBR SPECIFIED BUT  03640000
.*                                      LOAD NOT SPECIFIED              03660000
         AIF   ('&LOAD' EQ '').LDCK     .LDCK IF LOAD DOES NOT NEED     03680000
.*                                      VALIDITY CHECK                  03700000
         AIF   ('&LOAD' EQ 'YES' OR '&LOAD' EQ 'NO').LDCK               03720000
.*                                      .LDCK IF LOAD OK                03740000
         IGTXMERR ERRN=1,ERRLVL=12,KEYWORD=LOAD,VALUE=&LOAD,           *03760000
               RANGE=(YES,NO)           ISSUE SEVERE ERROR MESSAGE      03780000
         MEXIT                          AND EXIT                        03800000
.LDCK    ANOP  ,                        ALL PARAMETERS CHECKED          03820000
.* DEFINE THE MODULE NAME                                               03840000
         AIF   ('&NMLBL' NE  '').LBLGVN .LBLGVN IF LABEL SUPPLIED       03860000
         AIF   ('&NAME' EQ '').NONMLB   .NONMLB IF NAME NOT SUPPLIED    03864000
IGTT&TYPE&SUFFIX DC CL8'&NAME'          APOTNMLD                        03868000
         AGO   .OFFSET                  .OFFSET W/ MY LABEL,USER NAME   03872000
.NONMLB  ANOP  ,                        NO USER LABEL OR NAME           03876000
IGTT&TYPE&SUFFIX DC CL8'IGT&SUFFIX' APOTNMLD                            03880000
         AGO   .OFFSET                  GIVE IT A LABEL - GO TO .OFFSE  03900000
.LBLGVN  AIF   ('&NAME' EQ '').LBNONM   .LBNONM IF NAME NOT SUPPLIED    03920000
&NMLBL   DC CL8'&NAME'                  APOTNMLD                        03925000
         AGO   .OFFSET                  .OFFSET MY NAME,MY LABEL        03930000
.LBNONM  ANOP  ,                        NO USER LABEL,USER NAME         03935000
&NMLBL   DC    CL8'IGT&SUFFIX'          APOTNMLD                        03940000
.OFFSET  ANOP  ,                        MODULE NAME DEFINED             03960000
         AIF   ('&TYPE' EQ 'Z').TYPEZ   .TYPEZ IF TYPE = Z              03980000
         AIF   ('&TYPE' EQ '@').TYPE@   .TYPE@ IF TYPE = @              04000000
.* DEFINED APCT OFFSET FOR NON-Z OR NON-@ TYPE ROUTINES                 04020000
         DC    Y(APCT&TYPE&SUFFIX-APCT) APOTNMOF                        04040000
         AGO   .FLAGS                   OFFSET DEFINED                  04060000
.TYPEZ   ANOP  ,                                                        04080000
.* DEFINE Z-TYPE APCT OFFSET                                            04100000
         DC    Y(APCTZ&SUFFIX-APCT)     APOTNMOF                        04120000
         AGO   .FLAGS                   Z-TYPE OFFSET DEFINED           04140000
.TYPE@   ANOP  ,                                                        04160000
.* DEFINE @-TYPE APCT OFFSET                                            04180000
         DC    Y(@&SUFFIX-APCT)         APOTNMLD                        04200000
.FLAGS   ANOP  ,                                                        04220000
         AIF   ('&SUNBR' EQ '').NOSULD  .NOSULD IF NO SUNBR             04240000
         AIF   ('&LOAD' EQ 'YES').YESL  .YESL IF LOAD = YES             04260000
         AIF   ('&FIX' EQ 'YES').NOLDFX .NOLDFX IF FIX=YES              04280000
         DC    X'20'                    APOTNMF0                        04286000
         AGO   .SU                      .SU WITH LOAD=NO,FIX=NO         04292000
.NOLDFX  DC    X'A0'                    APOTNMF0                        04298000
         AGO   .SU                      .SU WITH LOAD=NO,FIX=YES        04304000
.YESL    AIF   ('&FIX' EQ 'YES').LDFX   .LDFX IF FIX=YES                04310000
         DC    X'40'                    APOTNMF0                        04316000
         AGO   .SU                      .SU WITH LOAD=YES,FIX=NO        04322000
.LDFX    DC    X'C0'                    APOTNMF0                        04328000
.SU      DC    AL1(&SUNBR)              APOTNMSU                        04340000
         AGO   .NMDONE                                                  04360000
.NOSULD  AIF   ('&FIX' EQ 'YES').FX     .FX IF FIX=YES                  04380000
         DC    X'00'                    APOTNMF0                        04386000
         AGO   .DONMSU                  .DONMSU WITH FIX=NO             04392000
.FX      DC    X'80'                    APOTNMF0                        04398000
.DONMSU  ANOP  ,                        FINISH NO SU PATH               04404000
         DC    AL1(0)                   APOTNMSU                        04410000
         AGO   .NMDONE                                                  04420000
.NOSUF   IGTXMERR ERRN=2,ERRLVL=12,KEYWORD=SUFFIX                       04440000
.*                                      SUFFIX MISSING - ISSUE ERR MSG  04460000
         MEXIT                          AND EXIT                        04480000
.NOTYPE  IGTXMERR ERRN=2,ERRLVL=12,KEYWORD=TYPE                         04500000
.*                                      TYPE MISSING - ISSUE ERR MSG    04520000
         MEXIT                          AND EXIT                        04540000
.NOSUNB  IGTXMERR ERRN=2,ERRLVL=12,KEYWORD=SUNBR                        04560000
.*                                      SUNBR MISSING - ISSUE ERR MSG   04580000
         MEXIT                          AND EXIT                        04600000
.NOLOAD  IGTXMERR ERRN=2,ERRLVL=12,KEYWORD=LOAD,RANGE=(YES,NO)          04620000
.*                                      LOAD MISSING - ISSUE ERR MSG    04640000
.*                                      AND EXIT                        04660000
.NMDONE  MEXIT                                                          04680000
.SYSER   IGTXMERR ERRN=1,ERRLVL=12,KEYWORD=SYST,VALUE=&SYST             04685000
.*                                      ISSUE SEVERE ERROR MESSAGE      04690000
         MEXIT                          AND EXIT                        04695000
         MEND                                                           04700000
       EJECT                                                            04720000
*********************************************************************** 04740000
*                                                                     * 04760000
*                        IGT0CTRT MACRO                               * 04780000
*                                                                     * 04800000
*            FUNCTION - THIS MACRO IS USED TO GENERATE THE SKELETON   * 04820000
*                       APCT RELOCATION TABLE - APOTAD.               * 04840000
*            METHOD OF INVOCATION -                                   * 04860000
*                                                                     * 04880000
*                   LABEL    IGT0CTRT &SUFFIX,&CTRTLN                 * 04900000
*            WHERE:                                                   * 04920000
*                   &SUFFIX    - APCT SUFFIX OF RELOCATION TABLE      * 04940000
*                   &CTRTLN    - NUMBER OF ENTRIES TO GENERATE        * 04960000
*            EXAMPLE OF USE - TO GENERATE 100 APOTAD ENTRIES AT APCT  * 04980000
*                       RELOCATION TABLE U@@@, THE FOLLOWING MACRO    * 05000000
*                       STATEMENT WOULD BE USED:                        05020000
*                                                                     * 05040000
*            LABEL   IGT0CTRT U@@@,100                                  05060000
*                                                                     * 05080000
*********************************************************************** 05100000
       SPACE 5                                                          05120000
       MACRO                        IGT0CTRT                            05140000
&CTRTLBL IGT0CTRT &SUFFIX,&CTRTLN   GENERATE THE APCT RELOCATION TABLE  05160000
.*                                                                      05180000
.** THIS MACRO IS USED TO GENERATE THE APOTAD TABLE. CTRTLN HALFWORD    05200000
.** APOTAD ENTRIES ARE GENERATED FOR APCT(SUFFIX).                      05220000
.*                                                                      05240000
       LCLA  &CTR                   HOLDS &CTRTLN FOR LOOP CONTROL      05260000
       LCLA  &OFF                   HOLDS APCT OFFSETS                  05280000
       AIF   ('&SUFFIX' EQ '').NOSUF                                    05300000
.*                                  .NOSUF IF APCT SUFFIX OMITTED       05320000
       AIF   ('&CTRTLN' EQ '').NOCTL                                    05340000
.*                                  .NOCTL IF CTRTLN OMITTED            05360000
&CTR   SETA  &CTRTLN                GET NUMBER OF ENTRIES TO GENERATE   05380000
&OFF   SETA  0                      START AT OFFSET ZERO                05400000
.* GENERATE AN APOTAD ENTRY                                             05420000
.ADLOOP DC    AL2(APCT&SUFFIX+&OFF-APCT)  APOTADOF                      05440000
&CTR   SETA  &CTR-1                 DECREMENT COUNTER                   05460000
&OFF   SETA  &OFF+4                 BUMP APCT OFFSET BY 4 BYTES         05480000
       AIF   (&CTR GT 0).ADLOOP     LOOP TILL ALL DONE                  05500000
       AGO   .ADDONE                APOTAD GENERATED                    05520000
.* HANDLE IGT0CTRT ERRORS. ISSUE SEVERE ERROR MESSAGE AND EXIT.         05540000
.NOSUF IGTXMERR ERRN=2,ERRLVL=12,KEYWORD=SUFFIX                         05560000
.*                                  SUFFIX OMITTED                      05580000
       MEXIT                        EXIT - NO APOTAD ENTRIES CREATED    05600000
.NOCTL IGTXMERR ERRN=2,ERRLVL=12,KEYWORD=CTRTLN                         05620000
.*                                  CTRTLN OMITTED                      05640000
       MEXIT                        EXIT - NO APOTAD ENTRIES CREATED    05660000
.ADDONE MEND                        END OF IGT0CTRT PROCESSING          05680000
       EJECT                                                            05700000
*********************************************************************** 05720000
*                                                                     * 05740000
*                           IGT0SSVT MACRO                            * 05760000
*                                                                     * 05780000
*            FUNCTION - THIS MACRO IS USED TO GENERATE APOTVT         * 05800000
*  ENTRIES IN THE FORMAT DESCRIBED IN THE APOTVT DSECT WITHIN         * 05820000
*  IGTXAPOT.                                                          * 05840000
*                                                                     * 05860000
*            METHOD OF INVOCATION -                                   * 05880000
*            SSVTLBL IGT0SSVT &MFB,&ACTIVAT,&SUFFIX,&SYSTM=           * 05900000
*            WHERE:                                                   * 05920000
*                 SSVTLBL  - LABEL DESIRED AT GENERATED ENTRY         * 05940000
*                 &MFB     - MATRIX FUNCTION BYTE                     * 05960000
*                            = 0   THE FUNCTION SPECIFIED IN THE SSOB * 05980000
*                                  IS NOT SUPPORTED BY THIS SYSTEM    * 06000000
*                            ^ 0   THE VALUE (FUNCTION BYTE -1)*4     * 06020000
*                                  IS ADDED TO THE ADDRESS OF THE     * 06040000
*                                  SSVTFRTN TO OBTAIN THE ADDRESS     * 06060000
*                                  OF THE WORD CONTAININING THE       * 06080000
*                                  FUNCTION ROUTINE POINTER FOR THIS  * 06100000
*                                  REQUEST.                           * 06120000
*                 &ACTIVAT -                                          * 06140000
*                            = S   FUNCTION IS TO BE ACTIVATED BY     * 06160000
*                                  SUBSYSTEM STARTUP.                 * 06180000
*                            = M   FUNCTION IS TO BE ACTIVATED BY     * 06200000
*                                  MONITOR INITIALIZATION.            * 06220000
*                 &SUFFIX  - MODULE SUFFIX - USED TO DETERMINE OFFSET * 06240000
*                            WITHIN APCT OF THE REQUIRED MODULE.      * 06260000
*                  &SYSTM=  - KEYWORD PARAMETER USED TO SPECIFY FOR   * 06262000
*                             WHICH SYSTEM(MVS,VS1 OR BOTH) THE SSVT  * 06264000
*                             ENTRY IS TO BE GENERATED.               * 06266000
*                             = MVS - GENERATE FOR MVS ONLY.          * 06268000
*                             = VS1 - GENERATE FOR VS1 ONLY.          * 06270000
*                             = ALL(DEFAULT) - GENERATE FOR VS1 & MVS * 06272000
*                                                                     * 06280000
*********************************************************************** 06300000
       SPACE 5                                                          06320000
       MACRO                                   IGT0SSVT                 06340000
&SSVTLBL IGT0SSVT &MFB,&ACTIVAT,&SUFFIX,&SYSTM=ALL   GENERATE APOTVT    06360000
.*                                                   ENTRY              06362000
         COPY  IGTXSYSA                 GET SYSTEM NAME/LEVEL           06364000
         AIF   ('&SYSTM' EQ 'ALL').DOVT .DOVT IF FOR VS1 AND MVS        06366000
         AIF   ('&SYSTM' EQ 'VS1').CKVS1 .CKVS1 IF SYSTM=VS1            06368000
         AIF   ('&SYSTM' NE 'MVS').BADSYS .BADSYS IF ILLEGAL SYSTM VAL  06370000
.*                                                                      06372000
.**                                     SSVT ENTRY TO BE GENERATED FOR  06374000
.**                                     MVS ONLY                        06376000
.*                                                                      06378000
         AIF   ('&VPSSSYS' EQ 'MVS').DOVT .DOVT IF THIS IS MVS SYSTEM   06380000
         MEXIT                          NO SSVT ENTRY IF THIS IS VS1    06382000
.CKVS1   ANOP  ,                        GENERATE SSVT IF THIS IS VS1    06384000
         AIF   ('&VPSSSYS' EQ 'VS1').DOVT .DOVT IF THIS IS VS1 SYSTEM   06386000
         MEXIT                          NO SSVT ENTRY IF THIS IS MVS    06388000
.DOVT    AIF   ('&MFB' EQ ' ').NOMFB   .NOMFB IF MATRIX FUNCTION        06390000
.*                                        BYTE OMITTED                  06400000
       AIF   ('&ACTIVAT' EQ '').NOACT     .NOACT IF ACTIVATE FLAG       06420000
.*                                        OMITTED                       06440000
       AIF   ('&SUFFIX' EQ '').NOSUF      .NOSUF IF SUFFIX OMITTED      06460000
       AIF   ('&ACTIVAT' EQ 'S').GDACT    .GDACT IF ACTIVAT=S           06480000
       AIF   ('&ACTIVAT' NE 'M').BADACT   .BADACT IF ACTIVAT INVALID    06500000
.GDACT ANOP  ,                            ACTIVAT VALID HERE            06520000
.* DEFINE THE MATRIX FUNCTION BYTE                                      06540000
&SSVTLBL DC    AL1(&MFB)                  APOTVTCD                      06560000
       AIF   ('&ACTIVAT' EQ 'S').STARTUP  .STARTUP IF ACTIVAT=S         06580000
.* DEFINE THE ACTIVATE FLAG AS MONITOR.                                 06600000
       DC    X'40'                        APOTVTIT                      06620000
       AGO   .DOOF                        .DOOF                         06640000
.STARTUP DC  X'80'                        APOTVTIT                      06660000
.* USE SUFFIX TO DEFINE OFFSET WITHIN APCT OF ADDRESS OF                06680000
.* REQUIRED MODULE.                                                     06700000
.DOOF  DC    Y(APCTZ&SUFFIX-APCT)         APOTVTOF                      06720000
       AGO   .SSVTDUN                     THAT'S ALL                    06740000
.* HANDLE IGT0SSVT ERRORS. ISSUE SEVERE ERROR MESSAGE AND EXIT.         06760000
.NOMFB IGTXMERR ERRN=2,ERRLVL=12,KEYWORD=MFB                            06780000
.*                                        MFB OMITTED                   06800000
       MEXIT                                                            06820000
.NOACT IGTXMERR ERRN=2,ERRLVL=12,KEYWORD=ACTIVAT                        06840000
.*                                        ACTIVAT OMITTED               06860000
       MEXIT                                                            06880000
.NOSUF IGTXMERR ERRN=2,ERRLVL=12,KEYWORD=SUFFIX                         06900000
.*                                        SUFFIX OMITTED                06920000
       MEXIT                                                            06940000
.BADACT IGTXMERR ERRN=1,ERRLVL=12,KEYWORD=ACTIVAT,VALUE=&ACTIVAT,      *06960000
               RANGE=(S,M)                ACTIVAT INVALID               06980000
       MEXIT                                                            07000000
.BADSYS  IGTXMERR ERRN=1,ERRLVL=12,KEYWORD=SYSTM,VALUE=&SYSTM           07005000
.*                                      ISSUE SEVERE ERROR MESSAGE      07010000
         MEXIT                          AND EXIT                        07015000
.SSVTDUN MEND                             END IGT0SSVT PROCESSING       07020000
       EJECT                                                            07040000
*********************************************************************** 07060000
*                   END OF IGT0VPSS INTERNAL MACROS                   * 07080000
*********************************************************************** 07100000
       EJECT                                                            07120000
*********************************************************************** 07140000
*                            IGT0VPSS                                 * 07160000
*                                                                     * 07180000
*                BEGIN GENERATION OF IGT0VPSS TABLES.                 * 07200000
*                                                                     * 07220000
*********************************************************************** 07240000
       EJECT                                                            07260000
*********************************************************************** 07280000
*                                                                     * 07300000
*                         IGTXAPOT                                    * 07320000
* LIST THE DSECT APOT. THIS WILL BE FOLLOWED BY THE ACTUAL VALUES FOR * 07340000
* THE APOT.                                                           * 07360000
*                                                                     * 07380000
*********************************************************************** 07400000
       SPACE 5                                                          07420000
       IGTXAPOT LIST=YES               LIST THE APOT DSECT              07440000
       SPACE 5                                                          07460000
*********************************************************************** 07480000
*                                                                     * 07500000
*                       APOT DATA TABLE                               * 07520000
*                                                                     * 07540000
*      THE FOLLOWING TABLE IS THE ACTUAL BEGINNING OF THE IGT0VPSS    * 07560000
* DATA SET AND CONTAINS APOT DATA IN THE FORMAT DESCRIBED IN THE      * 07580000
* APOT DSECT WITHIN IGTXAPOT. THIS PORTION OF THE TABLE CONTAINS      * 07600000
* POINTERS TO THE OTHER APOT TABLES. REFER TO THE APOT DSECT WHEN IN- * 07620000
* TERPRETING THIS TABLE. THE COMMENTS FIELD OF EACH FOLLOWING APOT    * 07640000
* DATA DEFINITION INDICATES THE IGTXAPOT LABEL FOR THAT VALUE.        * 07660000
* THIS SECTION OF APOT SHOULD NOT BE CHANGED UNLESS THE IGTXAPOT IS   * 07680000
* REDEFINED.                                                          * 07700000
*      NOTE THAT VALUES IN THIS TABLE ARE ONLY FOR THE APOT DSECT     * 07720000
* WITHIN IGTXAPOT. VALUES FOR THE DSECTS APOTNM, APOTVT AND APOTAD    * 07740000
* ARE GIVEN LATER ON WITHIN IGT0VPSS.                                 * 07760000
*                                                                     * 07780000
*********************************************************************** 07800000
       SPACE 5                                                          07820000
IGT0VPSS CSECT                         VPSS OPTIONS TABLE               07840000
       DS    0F                        APOT                             07860000
       DC    CL4'APOT'                 APOTID                           07880000
       DC    A(*-*)                    APOTUSER                         07900000
       DC    A(APCT)                   APOTCTAD - ADDRESS OF APCT       07920000
       DC    A(APCTEND-APCT)           APOTCTLN - LENGTH OF APCT        07940000
       DC    A(MNT)                    APOTNMAD - ADDRESS OF APOTNM -   07960000
*                                                 MODULE NAME TABLE     07980000
       DC    A(MNT#)                   APOTNMCT - NUMBER OF APOTNM      08000000
*                                                 ENTRIES               08020000
       DC    A(SSVTFT)                 APOTVTAD - ADDRESS OF APOTVT -   08040000
*                                                 SUBSYSTEM VECTOR      08060000
*                                                 TABLE(SSVT)           08080000
       DC    A(SSVT#)                  APOTVTCT - NUMBER OF SSVT        08100000
*                                                 ENTRIES               08120000
       DC    A(APCTRT)                 APOTADAD - ADDRESS OF APCT       08140000
*                                                 RELOCATION TABLE      08160000
       DC    A(APCTRT#)                APOTADCT - NUMBER OF APCT        08180000
*                                      RELOCATION TABLE ENTRIES         08200000
       DC    A(APCTBR14-APCT)          APOTBR14                         08220000
       DC    A(CAPCP)                  APOTCPAD                         08240000
       DC    A(2+(CAPCPZ-CAPCP-APCPLN0)/APCPLN1) APOTCPCT               08260000
       DC    A(APCPLN0)                APOTCPPL                         08280000
       DC    A(APCPLN1)                APOTCPLN                         08300000
       DS    0D                                                         08320000
*********************************************************************** 08340000
*                                                                     * 08360000
*                     END OF APOT DATA TABLE                          * 08380000
*                                                                     * 08400000
*********************************************************************** 08420000
       EJECT                                                            08440000
*********************************************************************** 08460000
*                                                                     * 08480000
*                          APCT DATA TABLE                            * 08500000
*                                                                     * 08520000
*      THE APCT DATA TABLE IS GENERATED BY USING THE CSECT OPTION     * 08540000
* (DSECT=NO) ON THE MACRO INVOCATION IGTXAPCT. REFER TO THE COMMENTS  * 08560000
* IN THE EXPANDED IGTXAPCT FOR INTERPRETATION OF THE APCT. IF A       * 08580000
* CHANGE IS DESIRED TO THE APCT, USE THE INTERNAL MACRO IGT0APCT      * 08600000
* TO EFFECT CHANGES. REFER TO THE IGT0APCT MACRO FOR AN EXPLANATION   * 08620000
* OF ITS USE. CHANGES MUST BE INSERTED AFTER THE GENERATION OF THE    * 08640000
* APCT AT THE SECTION TITLED 'CHANGES TO THE APCT'.                   * 08660000
*                                                                     * 08680000
*********************************************************************** 08700000
         SPACE 5                                                        08720000
         IGTXAPCT LIST=YES,DSECT=NO    GENERATE THE APCT                08740000
ENDAPCT  EQU   *                                                        08760000
         EJECT                                                          08780000
*********************************************************************** 08800000
*                                                                     * 08820000
*                      CHANGES TO THE APCT                            * 08840000
*                                                                     * 08860000
*      CHANGES TO THE APCT ARE TO BE MADE HERE. THE INTERNAL MACRO    * 08880000
* IGT0APCT MUST BE USED TO EFFECT APCT CHANGES. REFER TO THE IGT0APCT * 08900000
* MACRO FOR INSTRUCTIONS ON ITS USE.                                  * 08920000
*                                                                     * 08940000
*********************************************************************** 08960000
         SPACE 5                                                        08980000
CRTN     IGT0APCT   A(CAPCPRTN-APCT)     DEFINE ADDR OF APCP CALL TABLE 09040000
         SPACE 5                                                        09120000
*********************************************************************** 09140000
*                                                                     * 09160000
*                      END OF APCT CHANGES                            * 09180000
*                                                                     * 09200000
*********************************************************************** 09220000
         SPACE 5                                                        09240000
*********************************************************************** 09260000
*                                                                     * 09280000
*                      END OF APCT                                    * 09300000
*                                                                     * 09320000
*********************************************************************** 09340000
         EJECT                                                          09360000
*********************************************************************** 09380000
*                                                                     * 09400000
*                    APCP ROUTINE POINTER TABLE                       * 09420000
*                                                                     * 09440000
*      THIS TABLE CONTAINS POINTERS TO ROUTINES USED IN CALL INTER-   * 09460000
* FACE PROCESSING. ENTRIES ARE REFERRED TO BY LABEL IN THE APCP       * 09480000
* DATA TABLE. AN ENTRY IN THE APCP MUST REFER TO ONE OF THES ENTRIES  * 09500000
* TO DETERMINE WHICH ROUTINE WILL PROCESS THE USER CALL. ENTRIES MUST * 09520000
* BE MADE IN THE SAME FORMAT. ENTRIES ARE CHANGED ONLY IF THE NAME OF * 09540000
* PROCESSING ROUTINE CHANGES OR A NEW ROUTINE IS ADDED TO HANDLE THE  * 09560000
* SAME CALL.                                                          * 09580000
* NOTE: THIS TABLE MUST FOLLOW THE APCT.                                09600000
*                                                                     * 09620000
*********************************************************************** 09640000
         SPACE 5                                                        09660000
CAPCPRTN DS    0A                  APCP ROUTINE POINTER TABLE           09680000
@MJB     DC    V(IGTMJB)           GENERATE ACB                         09700000
@MJC     DC    V(IGTMJC)           OPEN ACB                             09720000
@MJD     DC    V(IGTMJD)           GENERATE AND OPEN ACB                09740000
@MJE     DC    V(IGTMJE)           MODIFY ACB                           09760000
@MJF     DC    V(IGTMJF)           CLOSE ACB                            09780000
@MJG     DC    V(IGTMJG)           FREE ACB                             09800000
@MLA     DC    V(IGTMLA)           INITIAL BUILD REQUEST                09820000
@MFA     DC    V(IGTMFA)           LOGIC OPERATION CONSTRUCTION         09840000
@MDA     DC    V(IGTMDA)           ALGORITHM CONSTRUCTION               09860000
@MDB     DC    V(IGTMDB)           CHANNEL TRANSFER CONSTRUCTION        09880000
@MDC     DC    V(IGTMDC)           NTH ZERO CROSSING CONSTRUCTION       09890000
@MGA     DC    V(IGTMGA)           TRANSLATE                            09900000
@MHA     DC    V(IGTMHA)           RELEASE                              09920000
@MCA     DC    V(IGTMCA)           EXCW/EXC/WAIT ERROR PROCESSING       09940000
APCTEND  EQU   *                   END OF APCT FOR IGT0VPSS PURPOSES    09960000
*********************************************************************** 09980000
*                                                                     * 10000000
*                  END OF APCP ROUTINE POINTER TABLE                  * 10020000
*                                                                     * 10040000
*********************************************************************** 10060000
         EJECT                                                          10080000
*********************************************************************** 10100000
*                                                                     * 10120000
*                        IGTXAPCP DSECT                               * 10140000
*                                                                     * 10160000
*      LIST THE DSECT IGTXAPCP USED TO MAP VALUES IN THE APCP         * 10180000
* PORTIONS OF THE APCP/APAL DATA TABLE. REFER TO THIS DSECT WHEN      * 10200000
* INTERPRETING THE APCP ENTRIES.                                      * 10220000
*                                                                     * 10240000
*********************************************************************** 10260000
         SPACE 5                                                        10280000
         IGTXAPCP LIST=YES            LIST THE APCP DSECT               10300000
         EJECT                                                          10320000
*********************************************************************** 10340000
*                                                                     * 10360000
*                        IGTXAPAL DSECT                               * 10380000
*                                                                     * 10400000
*      LIST THE DSECT IGTXAPAL USED TO MAP VALUES IN THE APAL         * 10420000
* PORTIONS OF THE APCP/APAL DATA TABLE. REFER TO THIS DSECT WHEN      * 10440000
* INTERPRETING THE APAL ENTRIES.                                      * 10460000
*                                                                     * 10480000
*********************************************************************** 10500000
         SPACE 5                                                        10520000
         IGTXAPAL LIST=YES                                              10540000
         EJECT                                                          10560000
*********************************************************************** 10580000
*                                                                     * 10600000
*                        APCP/APAL DATA TABLE                         * 10620000
*                                                                     * 10640000
*      THE FOLLOWING TABLE CONTAINS APCP AND APAL DATA IN THE FORMAT  * 10660000
* DESCRIBED BY THE PRECEDING DSECTS IGTXAPCP AND IGTXAPAL. AN ENTRY   * 10680000
* EXISTS FOR EACH VPSS CALL. IF THE CALL IS NOT A 3838 OPERATION(VPSS * 10700000
* ONLY), CONSTANTS ARE DEFINED ONLY FOR IGTXAPCP. IF THE CALL IS A    * 10720000
* 3838 OPERATION, CONSTANTS ARE DEFINED FOR IGTXAPCP FOLLOWED BY      * 10740000
* THE CONSTANTS FOR IGTXAPAL. REFER TO THE IGTXAPCP AND IGTXAPAL      * 10760000
* DSECTS WHEN INTERPRETING THIS TABLE. THE COMMENTS FIELD OF EACH     * 10780000
* TABLE ENTRY INDICATES THE CORRESPONDING IGTXAPCP OR IGTXAPAL LABEL. * 10800000
* TO CHANGE A CONSTANT IN THIS TABLE, FIRST DETERMINE DESIRED NEW     * 10820000
* VALUE BY REFERRING TO THE APPROPRIATE DSECT. NEXT, FIND THE ENTRY   * 10840000
* IN THE APCP/APAL DATA TABLE FOR WHICH THE CHANGE IS TO BE IMPLE-    * 10860000
* MENTED. LOCATE THE CONSTANT WITHIN THE ENTRY USING THE LABEL NAMES  * 10880000
* IN THE COMMENTS FIELD OF THE ENTRY. FINALLY, MAKE THE DESIRED       * 10900000
* CHANGE, REASSEMBLE IGT0VPSS AND LINK-EDIT INTO SYS1.LOADVPSS AS     * 10920000
* IGT0VPSS. SINCE APCP/APAL DATA IS POSITIONALLY MAPPED VIA DSECT,    * 10940000
* CARE MUST BE EXERCISED IN MAINTAINING THE POSITIONAL CHARACTERIS-   * 10960000
* TICS OF THE ENTRY. A VALUE CANNOT BE DELETED - IT MUST BE CHANGED.  * 10980000
* THE LENGTHS OF THE FIELDS MAY NOT CHANGE.                           * 11000000
*                                                                     * 11020000
*********************************************************************** 11040000
         SPACE 5                                                        11060000
IGT0VPSS CSECT                         APCP/APAL DATA TABLE             11080000
*                                                                       11100000
*********************************************************************** 11120000
*                                                                     * 11140000
*                             APCP HEADER                             * 11160000
*                                                                     * 11180000
*********************************************************************** 11200000
CAPCP    DC    CL4'APCP'           APCPID                               11220000
         DC    F'0'                APCPUSER                             11240000
         DC    A(CAPCPZ-CAPCP)     APCPLAST                             11260000
         DC    F'0'                RESERVED                             11280000
         EJECT                                                          11300000
*********************************************************************** 11320000
*                                                                     * 11340000
*                        BEGIN APCT/APAL ENTRIES                      * 11360000
*                                                                     * 11380000
*********************************************************************** 11400000
         EJECT                                                          11420000
*********************************************************************** 11440000
*                                                                     * 11460000
*                 APCP ENTRY FOR EXCW                                 * 11480000
*                  'EXECUTE AND WAIT'                                 * 11500000
*                                                                     * 11520000
*********************************************************************** 11540000
         DC    CL4'EXCW'           APCPAPFN                             11560000
         DC    A(APOPEXCW)         APCPAPOP                             11580000
         DC    A(@MCA-CAPCPRTN)    APCPRTN                              11600000
         DC    F'0'                APCPUSRX                             11620000
         DC    H'03'               APCPMAXP                             11640000
         DC    H'03'               APCPMINP                             11660000
         DC    XL4'00000000'       RESERVED                             11680000
         DC    XL8'0000000000000000' RESERVED                           11700000
         DC    00XL16'00'          APCPSWS                              11720000
         DC    BL1'10000000'       APCPSACB                             11740000
         DC    BL1'00000000'       APCPSBLD                             11760000
         DC    BL1'10000000'       APCPSOP                              11780000
         DC    BL1'10000000'       APCPSAR                              11800000
         DC    BL1'10000000'       APCPSIO                              11820000
         DC    BL4'00000000'       RESERVED                             11840000
         DC    BL1'01000000'       APCPSWX                              11860000
         DC    BL1'10010000'       APCPSFN                              11880000
         DC    BL1'10000000'       APCPSRCL                             11900000
         DC    BL1'10000000'       APCPSEML                             11920000
         DC    BL1'00000000'       RESERVED                             11940000
         DC    BL1'00000000'       RESERVED                             11960000
         DC    BL1'00000000'       RESERVED                             11980000
         DC    XL48'00'            APAL                                 12000000
         EJECT                                                          12020000
*********************************************************************** 12040000
*                                                                     * 12060000
*                 APCP ENTRY FOR EXC                                  * 12080000
*                     'EXECUTE'                                       * 12100000
*                                                                     * 12120000
*********************************************************************** 12140000
         DC    CL4'EXC '           APCPAPFN                             12160000
         DC    A(APOPEXC)          APCPAPOP                             12180000
         DC    A(@MCA-CAPCPRTN)    APCPRTN                              12200000
         DC    F'0'                APCPUSRX                             12220000
         DC    H'03'               APCPMAXP                             12240000
         DC    H'03'               APCPMINP                             12260000
         DC    XL4'00000000'       RESERVED                             12280000
         DC    XL8'0000000000000000' RESERVED                           12300000
         DC    00XL16'00'          APCPSWS                              12320000
         DC    BL1'10000000'       APCPSACB                             12340000
         DC    BL1'00000000'       APCPSBLD                             12360000
         DC    BL1'10000000'       APCPSOP                              12380000
         DC    BL1'10000000'       APCPSAR                              12400000
         DC    BL1'10000000'       APCPSIO                              12420000
         DC    BL4'00000000'       RESERVED                             12440000
         DC    BL1'01000000'       APCPSWX                              12460000
         DC    BL1'10010000'       APCPSFN                              12480000
         DC    BL1'10000000'       APCPSRCL                             12500000
         DC    BL1'10000000'       APCPSEML                             12520000
         DC    BL1'00000000'       RESERVED                             12540000
         DC    BL1'00000000'       RESERVED                             12560000
         DC    BL1'00000000'       RESERVED                             12580000
         DC    XL48'00'            APAL                                 12600000
         EJECT                                                          12620000
*********************************************************************** 12640000
*                                                                     * 12660000
*                 APCP ENTRY FOR WAIT                                 * 12680000
*                       'WAIT'                                        * 12700000
*                                                                     * 12720000
*********************************************************************** 12740000
         DC    CL4'WAIT'           APCPAPFN                             12760000
         DC    A(APOPWAIT)         APCPAPOP                             12780000
         DC    A(@MCA-CAPCPRTN)    APCPRTN                              12800000
         DC    F'0'                APCPUSRX                             12820000
         DC    H'03'               APCPMAXP                             12840000
         DC    H'03'               APCPMINP                             12860000
         DC    XL4'00000000'       RESERVED                             12880000
         DC    XL8'0000000000000000' RESERVED                           12900000
         DC    00XL16'00'          APCPSWS                              12920000
         DC    BL1'10000000'       APCPSACB                             12940000
         DC    BL1'00000000'       APCPSBLD                             12960000
         DC    BL1'10000000'       APCPSOP                              12980000
         DC    BL1'10000000'       APCPSAR                              13000000
         DC    BL1'10000000'       APCPSIO                              13020000
         DC    BL4'00000000'       RESERVED                             13040000
         DC    BL1'01000000'       APCPSWX                              13060000
         DC    BL1'10010000'       APCPSFN                              13080000
         DC    BL1'10000000'       APCPSRCL                             13100000
         DC    BL1'10000000'       APCPSEML                             13120000
         DC    BL1'00000000'       RESERVED                             13140000
         DC    BL1'00000000'       RESERVED                             13160000
         DC    BL1'00000000'       RESERVED                             13180000
         DC    XL48'00'            APAL                                 13200000
         EJECT                                                          13220000
*********************************************************************** 13240000
*                                                                     * 13260000
*                      APCP ENTRY FOR GEN                             * 13280000
*                        'GENERATE ACB'                               * 13300000
*                                                                     * 13320000
*********************************************************************** 13340000
         DC    CL4'GEN '           APCPAPFN                             13360000
         DC    A(APOPGEN)          APCPAPOP                             13380000
         DC    A(@MJB-CAPCPRTN)    APCPRTN                              13400000
         DC    F'0'                APCPUSRX                             13420000
         DC    H'99'               APCPMAXP                             13440000
         DC    H'03'               APCPMINP                             13460000
         DC    XL4'00000000'       RESERVED                             13480000
         DC    XL8'0000000000000000' RESERVED                           13500000
         DC    00XL16'00'          APCPSWS                              13520000
         DC    BL1'00100000'       APCPSACB                             13540000
         DC    BL1'00000000'       APCPSBLD                             13560000
         DC    BL1'00100000'       APCPSOP                              13580000
         DC    BL1'00000000'       APCPSAR                              13600000
         DC    BL1'00000000'       APCPSIO                              13620000
         DC    BL4'00000000'       RESERVED                             13640000
         DC    BL1'00000000'       APCPSWX                              13660000
         DC    BL1'10010000'       APCPSFN                              13680000
         DC    BL1'00100000'       APCPSRCL                             13700000
         DC    BL1'01000000'       APCPSEML                             13720000
         DC    BL1'00000000'       RESERVED                             13740000
         DC    BL1'00000000'       RESERVED                             13760000
         DC    BL1'00000000'       RESERVED                             13780000
         DC    XL48'00'            APAL                                 13800000
         EJECT                                                          13820000
*********************************************************************** 13840000
*                                                                     * 13860000
*                      APCP ENTRY FOR GENO                            * 13880000
*                    'GENERATE AND OPEN ACB'                          * 13900000
*                                                                     * 13920000
*********************************************************************** 13940000
         DC    CL4'GENO'           APCPAPFN                             13960000
         DC    A(APOPGENO)         APCPAPOP                             13980000
         DC    A(@MJD-CAPCPRTN)    APCPRTN                              14000000
         DC    F'0'                APCPUSRX                             14020000
         DC    H'99'               APCPMAXP                             14040000
         DC    H'03'               APCPMINP                             14060000
         DC    XL4'00000000'       RESERVED                             14080000
         DC    XL8'0000000000000000' RESERVED                           14100000
         DC    00XL16'00'          APCPSWS                              14120000
         DC    BL1'00100000'       APCPSACB                             14140000
         DC    BL1'00000000'       APCPSBLD                             14160000
         DC    BL1'00100000'       APCPSOP                              14180000
         DC    BL1'00000000'       APCPSAR                              14200000
         DC    BL1'00000000'       APCPSIO                              14220000
         DC    BL4'00000000'       RESERVED                             14240000
         DC    BL1'00000000'       APCPSWX                              14260000
         DC    BL1'10010000'       APCPSFN                              14280000
         DC    BL1'00100000'       APCPSRCL                             14300000
         DC    BL1'01000000'       APCPSEML                             14320000
         DC    BL1'00000000'       RESERVED                             14340000
         DC    BL1'00000000'       RESERVED                             14360000
         DC    BL1'00000000'       RESERVED                             14380000
         DC    XL48'00'            APAL                                 14400000
         EJECT                                                          14420000
*********************************************************************** 14440000
*                                                                     * 14460000
*                    APCP ENTRY FOR OPEN                              * 14480000
*                       'OPEN ACB'                                    * 14500000
*                                                                     * 14520000
*********************************************************************** 14540000
         DC    CL4'OPEN'           APCPAPFN                             14560000
         DC    A(APOPOPEN)         APCPAPOP                             14580000
         DC    A(@MJC-CAPCPRTN)    APCPRTN                              14600000
         DC    F'0'                APCPUSRX                             14620000
         DC    H'03'               APCPMAXP                             14640000
         DC    H'03'               APCPMINP                             14660000
         DC    XL4'00000000'       RESERVED                             14680000
         DC    XL8'0000000000000000' RESERVED                           14700000
         DC    00XL16'00'          APCPSWS                              14720000
         DC    BL1'10000000'       APCPSACB                             14740000
         DC    BL1'00000000'       APCPSBLD                             14760000
         DC    BL1'00110000'       APCPSOP                              14780000
         DC    BL1'00000000'       APCPSAR                              14800000
         DC    BL1'00000000'       APCPSIO                              14820000
         DC    BL4'00000000'       RESERVED                             14840000
         DC    BL1'01000000'       APCPSWX                              14860000
         DC    BL1'10010000'       APCPSFN                              14880000
         DC    BL1'00100000'       APCPSRCL                             14900000
         DC    BL1'01000000'       APCPSEML                             14920000
         DC    BL1'00000000'       RESERVED                             14940000
         DC    BL1'00000000'       RESERVED                             14960000
         DC    BL1'00000000'       RESERVED                             14980000
         DC    01XL48'00'          APAL                                 15000000
         EJECT                                                          15020000
*********************************************************************** 15040000
*                                                                     * 15060000
*                       APCP ENTRY FOR MOD                            * 15080000
*                         'MODIFY ACB'                                * 15100000
*                                                                     * 15120000
*********************************************************************** 15140000
         DC    CL4'MOD '           APCPAPFN                             15160000
         DC    A(APOPMOD)          APCPAPOP                             15180000
         DC    A(@MJE-CAPCPRTN)    APCPRTN                              15200000
         DC    F'0'                APCPUSRX                             15220000
         DC    H'99'               APCPMAXP                             15240000
         DC    H'03'               APCPMINP                             15260000
         DC    XL4'00000000'       RESERVED                             15280000
         DC    XL8'0000000000000000' RESERVED                           15300000
         DC    00XL16'00'          APCPSWS                              15320000
         DC    BL1'10000000'       APCPSACB                             15340000
         DC    BL1'01000000'       APCPSBLD                             15360000
         DC    BL1'01000000'       APCPSOP                              15380000
         DC    BL1'00000000'       APCPSAR                              15400000
         DC    BL1'00000000'       APCPSIO                              15420000
         DC    BL4'00000000'       RESERVED                             15440000
         DC    BL1'01000000'       APCPSWX                              15460000
         DC    BL1'10010000'       APCPSFN                              15480000
         DC    BL1'00100000'       APCPSRCL                             15500000
         DC    BL1'01000000'       APCPSEML                             15520000
         DC    BL1'00000000'       RESERVED                             15540000
         DC    BL1'00000000'       RESERVED                             15560000
         DC    BL1'00000000'       RESERVED                             15580000
         DC    01XL48'00'          APAL                                 15600000
         EJECT                                                          15620000
*********************************************************************** 15640000
*                                                                     * 15660000
*                       APCP ENTRY FOR CLSE                           * 15680000
*                          'CLOSE ACB'                                * 15700000
*                                                                     * 15720000
*********************************************************************** 15740000
         DC    CL4'CLSE'           APCPAPFN                             15760000
         DC    A(APOPCLSE)         APCPAPOP                             15780000
         DC    A(@MJF-CAPCPRTN)    APCPRTN                              15800000
         DC    F'0'                APCPUSRX                             15820000
         DC    H'03'               APCPMAXP                             15840000
         DC    H'03'               APCPMINP                             15860000
         DC    XL4'00000000'       RESERVED                             15880000
         DC    XL8'0000000000000000' RESERVED                           15900000
         DC    00XL16'00'          APCPSWS                              15920000
         DC    BL1'10010000'       APCPSACB                             15940000
         DC    BL1'00000000'       APCPSBLD                             15960000
         DC    BL1'10010000'       APCPSOP                              15980000
         DC    BL1'00000000'       APCPSAR                              16000000
         DC    BL1'00000000'       APCPSIO                              16020000
         DC    BL4'00000000'       RESERVED                             16040000
         DC    BL1'00000000'       APCPSWX                              16060000
         DC    BL1'10010000'       APCPSFN                              16080000
         DC    BL1'00100000'       APCPSRCL                             16100000
         DC    BL1'01000000'       APCPSEML                             16120000
         DC    BL1'00000000'       RESERVED                             16140000
         DC    BL1'00000000'       RESERVED                             16160000
         DC    BL1'00000000'       RESERVED                             16180000
         DC    01XL48'00'          APAL                                 16200000
         EJECT                                                          16220000
*********************************************************************** 16240000
*                                                                     * 16260000
*                       APCP ENTRY FOR BLD                            * 16280000
*                    'INITIAL BUILD REQUEST'                          * 16300000
*                                                                     * 16320000
*********************************************************************** 16340000
         DC    CL4'BLD '           APCPAPFN                             16360000
         DC    A(APOPBLD)          APCPAPOP                             16380000
         DC    A(@MLA-CAPCPRTN)    APCPRTN                              16400000
         DC    F'0'                APCPUSRX                             16420000
         DC    H'07'               APCPMAXP                             16440000
         DC    H'07'               APCPMINP                             16460000
         DC    XL4'00000000'       RESERVED                             16480000
         DC    XL8'0000000000000000' RESERVED                           16500000
         DC    00XL16'00'          APCPSWS                              16520000
         DC    BL1'10000000'       APCPSACB                             16540000
         DC    BL1'00000000'       APCPSBLD                             16560000
         DC    BL1'10000000'       APCPSOP                              16580000
         DC    BL1'00000000'       APCPSAR                              16600000
         DC    BL1'00000000'       APCPSIO                              16620000
         DC    BL4'00000000'       RESERVED                             16640000
         DC    BL1'01000000'       APCPSWX                              16660000
         DC    BL1'10010000'       APCPSFN                              16680000
         DC    BL1'01000000'       APCPSRCL                             16700000
         DC    BL1'01000000'       APCPSEML                             16720000
         DC    BL1'00000000'       RESERVED                             16740000
         DC    BL1'00000000'       RESERVED                             16760000
         DC    BL1'00000000'       RESERVED                             16780000
         DC    01XL48'00'          APAL                                 16800000
         EJECT                                                          16820000
*********************************************************************** 16840000
*                                                                     * 16860000
*                       APCP ENTRY FOR XLTE                           * 16880000
*                       'TRANSLATE AND FIX'                           * 16900000
*                                                                     * 16920000
*********************************************************************** 16940000
         DC    CL4'XLTE'           APCPAPFN                             16960000
         DC    A(APOPXLTE)         APCPAPOP                             16980000
         DC    A(@MGA-CAPCPRTN)    APCPRTN                              17000000
         DC    F'0'                APCPUSRX                             17020000
         DC    H'03'               APCPMAXP                             17040000
         DC    H'03'               APCPMINP                             17060000
         DC    XL4'00000000'       RESERVED                             17080000
         DC    XL8'0000000000000000' RESERVED                           17100000
         DC    00XL16'00'          APCPSWS                              17120000
         DC    BL1'10000000'       APCPSACB                             17140000
         DC    BL1'10000000'       APCPSBLD                             17160000
         DC    BL1'10000000'       APCPSOP                              17180000
         DC    BL1'00000000'       APCPSAR                              17200000
         DC    BL1'00000000'       APCPSIO                              17220000
         DC    BL4'00000000'       RESERVE                              17240000
         DC    BL1'01000000'       APCPSWX                              17260000
         DC    BL1'10010000'       APCPSFN                              17280000
         DC    BL1'01000000'       APCPSRCL                             17300000
         DC    BL1'01000000'       APCPSEML                             17320000
         DC    BL1'00000000'       RESERVED                             17340000
         DC    BL1'00000000'       RESERVED                             17360000
         DC    BL1'00000000'       RESERVED                             17380000
         DC    01XL48'00'          APAL                                 17400000
         EJECT                                                          17420000
*********************************************************************** 17440000
*                                                                     * 17460000
*                       APCP ENTRY FOR RLSE                           * 17480000
*                             'RELEASE'                               * 17500000
*                                                                     * 17520000
*********************************************************************** 17540000
         DC    CL4'RLSE'           APCPAPFN                             17560000
         DC    A(APOPRLSE)         APCPAPOP                             17580000
         DC    A(@MHA-CAPCPRTN)    APCPRTN                              17600000
         DC    F'0'                APCPUSRX                             17620000
         DC    H'03'               APCPMAXP                             17640000
         DC    H'03'               APCPMINP                             17660000
         DC    XL4'00000000'       RESERVED                             17680000
         DC    XL8'0000000000000000' RESERVED                           17700000
         DC    00XL16'00'          APCPSWS                              17720000
         DC    BL1'10000000'       APCPSACB                             17740000
         DC    BL1'10000000'       APCPSBLD                             17760000
         DC    BL1'10000000'       APCPSOP                              17780000
         DC    BL1'10000000'       APCPSAR                              17800000
         DC    BL1'00000000'       APCPSIO                              17820000
         DC    BL4'00000000'       RESERVE                              17840000
         DC    BL1'01000000'       APCPSWX                              17860000
         DC    BL1'10010000'       APCPSFN                              17880000
         DC    BL1'01000000'       APCPSRCL                             17900000
         DC    BL1'01000000'       APCPSEML                             17920000
         DC    BL1'00000000'       RESERVED                             17940000
         DC    BL1'00000000'       RESERVED                             17960000
         DC    BL1'00000000'       RESERVED                             17980000
         DC    01XL48'00'          APAL                                 18000000
         EJECT                                                          18020000
*********************************************************************** 18040000
*                                                                     * 18060000
*                    APCP/APAL ENTRY FOR ZMV                          * 18080000
*                         'ZERO MOVE'                                 * 18100000
*                                                                     * 18120000
*********************************************************************** 18140000
**                       DEFINE APCP CONSTANTS                       ** 18160000
         DC    CL4'ZMV '           APCPAPFN                             18180000
         DC    A(APOPZMV)          APCPAPOP                             18200000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              18220000
         DC    F'0'                APCPUSRX                             18240000
         DC    H'10'               APCPMAXP                             18260000
         DC    H'04'               APCPMINP                             18280000
         DC    XL4'00000000'       RESERVED                             18300000
         DC    XL8'0000000000000000' RESERVED                           18320000
         DC    00XL16'00'          APCPSWS                              18340000
         DC    BL1'10000000'       APCPSACB                             18360000
         DC    BL1'10000000'       APCPSBLD                             18380000
         DC    BL1'10000000'       APCPSOP                              18400000
         DC    BL1'00000000'       APCPSAR                              18420000
         DC    BL1'00000000'       APCPSIO                              18440000
         DC    BL4'00000000'       RESERVE                              18460000
         DC    BL1'01000000'       APCPSWX                              18480000
         DC    BL1'10000000'       APCPSFN                              18500000
         DC    BL1'01000000'       APCPSRCL                             18520000
         DC    BL1'01000000'       APCPSEML                             18540000
         DC    BL1'00000000'       RESERVED                             18560000
         DC    BL1'00000000'       RESERVED                             18580000
         DC    BL1'00000000'       RESERVED                             18600000
**                       DEFINE APAL CONSTANTS                       ** 18620000
         DC    01XL48'00'          APAL                                 18640000
         ORG   *-48                                                     18660000
         DC    XL4'00000000'       APALUSER                             18680000
         DC    H'12'               APALCISZ                             18700000
         DC    XL2'0000'           RESERVED                             18720000
         DC    XL1'10'             APALSTAT                             18740000
         DC    XL3'000000'         RESERVED                             18760000
         DC    XL1'87'             APALYFSW                             18780000
         DC    XL1'80'             APALYVS                              18800000
         DC    XL1'41'             APALYCT                              18820000
         DC    XL1'40'             APALYDL                              18840000
         DC    XL1'80'             APALYFMT                             18860000
         DC    XL5'0000000000'     RESERVED                             18880000
         DC    H'0001'             APALYCNT                             18900000
         DC    XL1'00'             APALXFSW                             18920000
         DC    XL1'00'             APALXVS                              18940000
         DC    XL1'00'             APALXCT                              18960000
         DC    XL1'00'             APALXDL                              18980000
         DC    XL1'00'             APALXFMT                             19000000
         DC    XL5'0000000000'     RESERVED                             19020000
         DC    H'0000'             APALXCNT                             19040000
         DC    XL1'00'             APALUFSW                             19060000
         DC    XL1'00'             APALUVS                              19080000
         DC    XL1'00'             APALUCT                              19100000
         DC    XL1'00'             APALUDL                              19120000
         DC    XL1'00'             APALUFMT                             19140000
         DC    XL5'0000000000'     RESERVED                             19160000
         DC    H'0000'             APALUCNT                             19180000
         ORG   ,                                                        19200000
         EJECT                                                          19220000
*********************************************************************** 19240000
*                                                                     * 19260000
*                    APCP/APAL ENTRY FOR VMC                          * 19280000
*                     'VECTOR MOVE/CONVERT'                           * 19300000
*                                                                     * 19320000
*********************************************************************** 19340000
**                       DEFINE APCP CONSTANTS                       ** 19360000
         DC    CL4'VMC '           APCPAPFN                             19380000
         DC    A(APOPVMC)          APCPAPOP                             19400000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              19420000
         DC    F'0'                APCPUSRX                             19440000
         DC    H'13'               APCPMAXP                             19460000
         DC    H'04'               APCPMINP                             19480000
         DC    XL4'00000000'       RESERVED                             19500000
         DC    XL8'0000000000000000' RESERVED                           19520000
         DC    00XL16'00'          APCPSWS                              19540000
         DC    BL1'10000000'       APCPSACB                             19560000
         DC    BL1'10000000'       APCPSBLD                             19580000
         DC    BL1'10000000'       APCPSOP                              19600000
         DC    BL1'00000000'       APCPSAR                              19620000
         DC    BL1'00000000'       APCPSIO                              19640000
         DC    BL4'00000000'       RESERVE                              19660000
         DC    BL1'01000000'       APCPSWX                              19680000
         DC    BL1'10000000'       APCPSFN                              19700000
         DC    BL1'01000000'       APCPSRCL                             19720000
         DC    BL1'01000000'       APCPSEML                             19740000
         DC    BL1'00000000'       RESERVED                             19760000
         DC    BL1'00000000'       RESERVED                             19780000
         DC    BL1'00000000'       RESERVED                             19800000
**                       DEFINE APAL CONSTANTS                       ** 19820000
         DC    01XL48'00'          APAL                                 19840000
         ORG   *-48                                                     19860000
         DC    XL4'00000000'       APALUSER                             19880000
         DC    H'20'               APALCISZ                             19900000
         DC    XL2'0000'           RESERVED                             19920000
         DC    XL1'10'             APALSTAT                             19940000
         DC    XL3'000000'         RESERVED                             19960000
         DC    XL1'87'             APALYFSW                             19980000
         DC    XL1'80'             APALYVS                              20000000
         DC    XL1'80'             APALYCT                              20020000
         DC    XL1'80'             APALYDL                              20040000
         DC    XL1'80'             APALYFMT                             20060000
         DC    XL5'0000000000'     RESERVED                             20080000
         DC    H'0000'             APALYCNT                             20100000
         DC    XL1'6C'             APALXFSW                             20120000
         DC    XL1'80'             APALXVS                              20140000
         DC    XL1'00'             APALXCT                              20160000
         DC    XL1'00'             APALXDL                              20180000
         DC    XL1'80'             APALXFMT                             20200000
         DC    XL5'0000000000'     RESERVED                             20220000
         DC    H'0000'             APALXCNT                             20240000
         DC    XL1'00'             APALUFSW                             20260000
         DC    XL1'00'             APALUVS                              20280000
         DC    XL1'00'             APALUCT                              20300000
         DC    XL1'00'             APALUDL                              20320000
         DC    XL1'00'             APALUFMT                             20340000
         DC    XL5'0000000000'     RESERVED                             20360000
         DC    H'0000'             APALUCNT                             20380000
         ORG   ,                                                        20400000
         EJECT                                                          20420000
*********************************************************************** 20440000
*                                                                     * 20460000
*                    APCP/APAL ENTRY FOR VMV                          * 20480000
*                        'VECTOR MOVE'                                * 20500000
*                                                                     * 20520000
*********************************************************************** 20540000
**                       DEFINE APCP CONSTANTS                       ** 20560000
         DC    CL4'VMV '           APCPAPFN                             20580000
         DC    A(APOPVMV)          APCPAPOP                             20600000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              20620000
         DC    F'0'                APCPUSRX                             20640000
         DC    H'15'               APCPMAXP                             20660000
         DC    H'04'               APCPMINP                             20680000
         DC    XL4'00000000'       RESERVED                             20700000
         DC    XL8'0000000000000000' RESERVED                           20720000
         DC    00XL16'00'          APCPSWS                              20740000
         DC    BL1'10000000'       APCPSACB                             20760000
         DC    BL1'10000000'       APCPSBLD                             20780000
         DC    BL1'10000000'       APCPSOP                              20800000
         DC    BL1'00000000'       APCPSAR                              20820000
         DC    BL1'00000000'       APCPSIO                              20840000
         DC    BL4'00000000'       RESERVE                              20860000
         DC    BL1'01000000'       APCPSWX                              20880000
         DC    BL1'10000000'       APCPSFN                              20900000
         DC    BL1'01000000'       APCPSRCL                             20920000
         DC    BL1'01000000'       APCPSEML                             20940000
         DC    BL1'00000000'       RESERVED                             20960000
         DC    BL1'00000000'       RESERVED                             20980000
         DC    BL1'00000000'       RESERVED                             21000000
**                       DEFINE APAL CONSTANTS                       ** 21020000
         DC    01XL48'00'          APAL                                 21040000
         ORG   *-48                                                     21060000
         DC    XL4'00000000'       APALUSER                             21080000
         DC    H'20'               APALCISZ                             21100000
         DC    XL2'0000'           RESERVED                             21120000
         DC    XL1'10'             APALSTAT                             21140000
         DC    XL3'000000'         RESERVED                             21160000
         DC    XL1'87'             APALYFSW                             21180000
         DC    XL1'80'             APALYVS                              21200000
         DC    XL1'80'             APALYCT                              21220000
         DC    XL1'80'             APALYDL                              21240000
         DC    XL1'80'             APALYFMT                             21260000
         DC    XL5'0000000000'     RESERVED                             21280000
         DC    H'0000'             APALYCNT                             21300000
         DC    XL1'8D'             APALXFSW                             21320000
         DC    XL1'80'             APALXVS                              21340000
         DC    XL1'00'             APALXCT                              21360000
         DC    XL1'40'             APALXDL                              21380000
         DC    XL1'80'             APALXFMT                             21400000
         DC    XL5'0000000000'     RESERVED                             21420000
         DC    H'0000'             APALXCNT                             21440000
         DC    XL1'00'             APALUFSW                             21460000
         DC    XL1'00'             APALUVS                              21480000
         DC    XL1'00'             APALUCT                              21500000
         DC    XL1'00'             APALUDL                              21520000
         DC    XL1'00'             APALUFMT                             21540000
         DC    XL5'0000000000'     RESERVED                             21560000
         DC    H'0000'             APALUCNT                             21580000
         ORG   ,                                                        21600000
         EJECT                                                          21620000
*********************************************************************** 21640000
*                                                                     * 21660000
*                    APCP/APAL ENTRY FOR SMV                          * 21680000
*                        'SCALAR MOVE'                                * 21700000
*                                                                     * 21720000
*********************************************************************** 21740000
**                       DEFINE APCP CONSTANTS                       ** 21760000
         DC    CL4'SMV '           APCPAPFN                             21780000
         DC    A(APOPSMV)          APCPAPOP                             21800000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              21820000
         DC    F'0'                APCPUSRX                             21840000
         DC    H'13'               APCPMAXP                             21860000
         DC    H'04'               APCPMINP                             21880000
         DC    XL4'00000000'       RESERVED                             21900000
         DC    XL8'0000000000000000' RESERVED                           21920000
         DC    00XL16'00'          APCPSWS                              21940000
         DC    BL1'10000000'       APCPSACB                             21960000
         DC    BL1'10000000'       APCPSBLD                             21980000
         DC    BL1'10000000'       APCPSOP                              22000000
         DC    BL1'00000000'       APCPSAR                              22020000
         DC    BL1'00000000'       APCPSIO                              22040000
         DC    BL4'00000000'       RESERVE                              22060000
         DC    BL1'01000000'       APCPSWX                              22080000
         DC    BL1'10000000'       APCPSFN                              22100000
         DC    BL1'01000000'       APCPSRCL                             22120000
         DC    BL1'01000000'       APCPSEML                             22140000
         DC    BL1'00000000'       RESERVED                             22160000
         DC    BL1'00000000'       RESERVED                             22180000
         DC    BL1'00000000'       RESERVED                             22200000
**                       DEFINE APAL CONSTANTS                       ** 22220000
         DC    01XL48'00'          APAL                                 22240000
         ORG   *-48                                                     22260000
         DC    XL4'00000000'       APALUSER                             22280000
         DC    H'20'               APALCISZ                             22300000
         DC    XL2'0000'           RESERVED                             22320000
         DC    XL1'10'             APALSTAT                             22340000
         DC    XL3'000000'         RESERVED                             22360000
         DC    XL1'87'             APALYFSW                             22380000
         DC    XL1'80'             APALYVS                              22400000
         DC    XL1'80'             APALYCT                              22420000
         DC    XL1'80'             APALYDL                              22440000
         DC    XL1'80'             APALYFMT                             22460000
         DC    XL5'0000000000'     RESERVED                             22480000
         DC    H'0000'             APALYCNT                             22500000
         DC    XL1'84'             APALXFSW                             22520000
         DC    XL1'80'             APALXVS                              22540000
         DC    XL1'01'             APALXCT                              22560000
         DC    XL1'00'             APALXDL                              22580000
         DC    XL1'80'             APALXFMT                             22600000
         DC    XL5'0000000000'     RESERVED                             22620000
         DC    H'0001'             APALXCNT                             22640000
         DC    XL1'00'             APALUFSW                             22660000
         DC    XL1'00'             APALUVS                              22680000
         DC    XL1'00'             APALUCT                              22700000
         DC    XL1'00'             APALUDL                              22720000
         DC    XL1'00'             APALUFMT                             22740000
         DC    XL5'0000000000'     RESERVED                             22760000
         DC    H'0000'             APALUCNT                             22780000
         ORG   ,                                                        22800000
         EJECT                                                          22820000
*********************************************************************** 22840000
*                                                                     * 22860000
*                    APCP/APAL ENTRY FOR CEM                          * 22880000
*                      'COMPLEX MULTIPLY'                             * 22900000
*                                                                     * 22920000
*********************************************************************** 22940000
**                       DEFINE APCP CONSTANTS                       ** 22960000
         DC    CL4'CEM '           APCPAPFN                             22980000
         DC    A(APOPCEM)          APCPAPOP                             23000000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              23020000
         DC    F'0'                APCPUSRX                             23040000
         DC    H'14'               APCPMAXP                             23060000
         DC    H'04'               APCPMINP                             23080000
         DC    XL4'00000000'       RESERVED                             23100000
         DC    XL8'0000000000000000' RESERVED                           23120000
         DC    00XL16'00'          APCPSWS                              23140000
         DC    BL1'10000000'       APCPSACB                             23160000
         DC    BL1'10000000'       APCPSBLD                             23180000
         DC    BL1'10000000'       APCPSOP                              23200000
         DC    BL1'00000000'       APCPSAR                              23220000
         DC    BL1'00000000'       APCPSIO                              23240000
         DC    BL4'00000000'       RESERVE                              23260000
         DC    BL1'01000000'       APCPSWX                              23280000
         DC    BL1'10000000'       APCPSFN                              23300000
         DC    BL1'01000000'       APCPSRCL                             23320000
         DC    BL1'01000000'       APCPSEML                             23340000
         DC    BL1'00000000'       RESERVED                             23360000
         DC    BL1'00000000'       RESERVED                             23380000
         DC    BL1'00000000'       RESERVED                             23400000
**                       DEFINE APAL CONSTANTS                       ** 23420000
         DC    01XL48'00'          APAL                                 23440000
         ORG   *-48                                                     23460000
         DC    XL4'00000000'       APALUSER                             23480000
         DC    H'28'               APALCISZ                             23500000
         DC    XL2'0000'           RESERVED                             23520000
         DC    XL1'30'             APALSTAT                             23540000
         DC    XL3'000000'         RESERVED                             23560000
         DC    XL1'86'             APALYFSW                             23580000
         DC    XL1'80'             APALYVS                              23600000
         DC    XL1'41'             APALYCT                              23620000
         DC    XL1'00'             APALYDL                              23640000
         DC    XL1'80'             APALYFMT                             23660000
         DC    XL5'0000000000'     RESERVED                             23680000
         DC    H'0001'             APALYCNT                             23700000
         DC    XL1'8C'             APALXFSW                             23720000
         DC    XL1'40'             APALXVS                              23740000
         DC    XL1'00'             APALXCT                              23760000
         DC    XL1'00'             APALXDL                              23780000
         DC    XL1'40'             APALXFMT                             23800000
         DC    XL5'0000000000'     RESERVED                             23820000
         DC    H'0000'             APALXCNT                             23840000
         DC    XL1'8C'             APALUFSW                             23860000
         DC    XL1'40'             APALUVS                              23880000
         DC    XL1'00'             APALUCT                              23900000
         DC    XL1'00'             APALUDL                              23920000
         DC    XL1'40'             APALUFMT                             23940000
         DC    XL5'0000000000'     RESERVED                             23960000
         DC    H'0000'             APALUCNT                             23980000
         ORG   ,                                                        24000000
         EJECT                                                          24020000
*********************************************************************** 24040000
*                                                                     * 24060000
*                    APCP/APAL ENTRY FOR SCEM                         * 24080000
*                   'SCALAR COMPLEX MULTIPLY'                         * 24100000
*                                                                     * 24120000
*********************************************************************** 24140000
**                       DEFINE APCP CONSTANTS                       ** 24160000
         DC    CL4'SCEM'           APCPAPFN                             24180000
         DC    A(APOPSCEM)         APCPAPOP                             24200000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              24220000
         DC    F'0'                APCPUSRX                             24240000
         DC    H'14'               APCPMAXP                             24260000
         DC    H'04'               APCPMINP                             24280000
         DC    XL4'00000000'       RESERVED                             24300000
         DC    XL8'0000000000000000' RESERVED                           24320000
         DC    00XL16'00'          APCPSWS                              24340000
         DC    BL1'10000000'       APCPSACB                             24360000
         DC    BL1'10000000'       APCPSBLD                             24380000
         DC    BL1'10000000'       APCPSOP                              24400000
         DC    BL1'00000000'       APCPSAR                              24420000
         DC    BL1'00000000'       APCPSIO                              24440000
         DC    BL4'00000000'       RESERVE                              24460000
         DC    BL1'01000000'       APCPSWX                              24480000
         DC    BL1'10000000'       APCPSFN                              24500000
         DC    BL1'01000000'       APCPSRCL                             24520000
         DC    BL1'01000000'       APCPSEML                             24540000
         DC    BL1'00000000'       RESERVED                             24560000
         DC    BL1'00000000'       RESERVED                             24580000
         DC    BL1'00000000'       RESERVED                             24600000
**                       DEFINE APAL CONSTANTS                       ** 24620000
         DC    01XL48'00'          APAL                                 24640000
         ORG   *-48                                                     24660000
         DC    XL4'00000000'       APALUSER                             24680000
         DC    H'28'               APALCISZ                             24700000
         DC    XL2'0000'           RESERVED                             24720000
         DC    XL1'30'             APALSTAT                             24740000
         DC    XL3'000000'         RESERVED                             24760000
         DC    XL1'86'             APALYFSW                             24780000
         DC    XL1'80'             APALYVS                              24800000
         DC    XL1'80'             APALYCT                              24820000
         DC    XL1'00'             APALYDL                              24840000
         DC    XL1'80'             APALYFMT                             24860000
         DC    XL5'0000000000'     RESERVED                             24880000
         DC    H'0000'             APALYCNT                             24900000
         DC    XL1'8C'             APALXFSW                             24920000
         DC    XL1'80'             APALXVS                              24940000
         DC    XL1'00'             APALXCT                              24960000
         DC    XL1'00'             APALXDL                              24980000
         DC    XL1'80'             APALXFMT                             25000000
         DC    XL5'0000000000'     RESERVED                             25020000
         DC    H'0000'             APALXCNT                             25040000
         DC    XL1'8C'             APALUFSW                             25060000
         DC    XL1'80'             APALUVS                              25080000
         DC    XL1'01'             APALUCT                              25100000
         DC    XL1'00'             APALUDL                              25120000
         DC    XL1'80'             APALUFMT                             25140000
         DC    XL5'0000000000'     RESERVED                             25160000
         DC    H'0001'             APALUCNT                             25180000
         ORG   ,                                                        25200000
         EJECT                                                          25220000
*********************************************************************** 25240000
*                                                                     * 25260000
*                    APCP/APAL ENTRY FOR CMCC                         * 25280000
*              'COMPLEX MULTIPLY - COMPLEX CONJUGATE'                 * 25300000
*                                                                     * 25320000
*********************************************************************** 25340000
**                       DEFINE APCP CONSTANTS                       ** 25360000
         DC    CL4'CMCC'           APCPAPFN                             25380000
         DC    A(APOPCMCC)         APCPAPOP                             25400000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              25420000
         DC    F'0'                APCPUSRX                             25440000
         DC    H'11'               APCPMAXP                             25460000
         DC    H'04'               APCPMINP                             25480000
         DC    XL4'00000000'       RESERVED                             25500000
         DC    XL8'0000000000000000' RESERVED                           25520000
         DC    00XL16'00'          APCPSWS                              25540000
         DC    BL1'10000000'       APCPSACB                             25560000
         DC    BL1'10000000'       APCPSBLD                             25580000
         DC    BL1'10000000'       APCPSOP                              25600000
         DC    BL1'00000000'       APCPSAR                              25620000
         DC    BL1'00000000'       APCPSIO                              25640000
         DC    BL4'00000000'       RESERVE                              25660000
         DC    BL1'01000000'       APCPSWX                              25680000
         DC    BL1'10000000'       APCPSFN                              25700000
         DC    BL1'01000000'       APCPSRCL                             25720000
         DC    BL1'01000000'       APCPSEML                             25740000
         DC    BL1'00000000'       RESERVED                             25760000
         DC    BL1'00000000'       RESERVED                             25780000
         DC    BL1'00000000'       RESERVED                             25800000
**                       DEFINE APAL CONSTANTS                       ** 25820000
         DC    01XL48'00'          APAL                                 25840000
         ORG   *-48                                                     25860000
         DC    XL4'00000000'       APALUSER                             25880000
         DC    H'20'               APALCISZ                             25900000
         DC    XL2'0000'           RESERVED                             25920000
         DC    XL1'30'             APALSTAT                             25940000
         DC    XL3'000000'         RESERVED                             25960000
         DC    XL1'86'             APALYFSW                             25980000
         DC    XL1'80'             APALYVS                              26000000
         DC    XL1'80'             APALYCT                              26020000
         DC    XL1'00'             APALYDL                              26040000
         DC    XL1'80'             APALYFMT                             26060000
         DC    XL5'0000000000'     RESERVED                             26080000
         DC    H'0000'             APALYCNT                             26100000
         DC    XL1'84'             APALXFSW                             26120000
         DC    XL1'80'             APALXVS                              26140000
         DC    XL1'00'             APALXCT                              26160000
         DC    XL1'00'             APALXDL                              26180000
         DC    XL1'80'             APALXFMT                             26200000
         DC    XL5'0000000000'     RESERVED                             26220000
         DC    H'0000'             APALXCNT                             26240000
         DC    XL1'00'             APALUFSW                             26260000
         DC    XL1'00'             APALUVS                              26280000
         DC    XL1'00'             APALUCT                              26300000
         DC    XL1'00'             APALUDL                              26320000
         DC    XL1'00'             APALUFMT                             26340000
         DC    XL5'0000000000'     RESERVED                             26360000
         DC    H'0000'             APALUCNT                             26380000
         ORG   ,                                                        26400000
         EJECT                                                          26420000
*********************************************************************** 26440000
*                                                                     * 26460000
*                    APCP/APAL ENTRY FOR CMCO                         * 26480000
*              'COMPLEX MULTIPLY - CONJUGATE OUTPUT'                  * 26500000
*                                                                     * 26520000
*********************************************************************** 26540000
**                       DEFINE APCP CONSTANTS                       ** 26560000
         DC    CL4'CMCO'           APCPAPFN                             26580000
         DC    A(APOPCMCO)         APCPAPOP                             26600000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              26620000
         DC    F'0'                APCPUSRX                             26640000
         DC    H'14'               APCPMAXP                             26660000
         DC    H'04'               APCPMINP                             26680000
         DC    XL4'00000000'       RESERVED                             26700000
         DC    XL8'0000000000000000' RESERVED                           26720000
         DC    00XL16'00'          APCPSWS                              26740000
         DC    BL1'10000000'       APCPSACB                             26760000
         DC    BL1'10000000'       APCPSBLD                             26780000
         DC    BL1'10000000'       APCPSOP                              26800000
         DC    BL1'00000000'       APCPSAR                              26820000
         DC    BL1'00000000'       APCPSIO                              26840000
         DC    BL4'00000000'       RESERVE                              26860000
         DC    BL1'01000000'       APCPSWX                              26880000
         DC    BL1'10000000'       APCPSFN                              26900000
         DC    BL1'01000000'       APCPSRCL                             26920000
         DC    BL1'01000000'       APCPSEML                             26940000
         DC    BL1'00000000'       RESERVED                             26960000
         DC    BL1'00000000'       RESERVED                             26980000
         DC    BL1'00000000'       RESERVED                             27000000
**                       DEFINE APAL CONSTANTS                       ** 27020000
         DC    01XL48'00'          APAL                                 27040000
         ORG   *-48                                                     27060000
         DC    XL4'00000000'       APALUSER                             27080000
         DC    H'28'               APALCISZ                             27100000
         DC    XL2'0000'           RESERVED                             27120000
         DC    XL1'30'             APALSTAT                             27140000
         DC    XL3'000000'         RESERVED                             27160000
         DC    XL1'86'             APALYFSW                             27180000
         DC    XL1'80'             APALYVS                              27200000
         DC    XL1'41'             APALYCT                              27220000
         DC    XL1'00'             APALYDL                              27240000
         DC    XL1'80'             APALYFMT                             27260000
         DC    XL5'0000000000'     RESERVED                             27280000
         DC    H'0001'             APALYCNT                             27300000
         DC    XL1'8C'             APALXFSW                             27320000
         DC    XL1'40'             APALXVS                              27340000
         DC    XL1'00'             APALXCT                              27360000
         DC    XL1'00'             APALXDL                              27380000
         DC    XL1'40'             APALXFMT                             27400000
         DC    XL5'0000000000'     RESERVED                             27420000
         DC    H'0000'             APALXCNT                             27440000
         DC    XL1'8C'             APALUFSW                             27460000
         DC    XL1'40'             APALUVS                              27480000
         DC    XL1'00'             APALUCT                              27500000
         DC    XL1'00'             APALUDL                              27520000
         DC    XL1'40'             APALUFMT                             27540000
         DC    XL5'0000000000'     RESERVED                             27560000
         DC    H'0000'             APALUCNT                             27580000
         ORG   ,                                                        27600000
         EJECT                                                          27620000
*********************************************************************** 27640000
*                                                                     * 27660000
*                    APCP/APAL ENTRY FOR SCMC                         * 27680000
*           'SCALAR COMPLEX MULTIPLY - COMPLEX CONJUGATE'             * 27700000
*                                                                     * 27720000
*********************************************************************** 27740000
**                       DEFINE APCP CONSTANTS                       ** 27760000
         DC    CL4'SCMC'           APCPAPFN                             27780000
         DC    A(APOPSCMC)         APCPAPOP                             27800000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              27820000
         DC    F'0'                APCPUSRX                             27840000
         DC    H'14'               APCPMAXP                             27860000
         DC    H'04'               APCPMINP                             27880000
         DC    XL4'00000000'       RESERVED                             27900000
         DC    XL8'0000000000000000' RESERVED                           27920000
         DC    00XL16'00'          APCPSWS                              27940000
         DC    BL1'10000000'       APCPSACB                             27960000
         DC    BL1'10000000'       APCPSBLD                             27980000
         DC    BL1'10000000'       APCPSOP                              28000000
         DC    BL1'00000000'       APCPSAR                              28020000
         DC    BL1'00000000'       APCPSIO                              28040000
         DC    BL4'00000000'       RESERVE                              28060000
         DC    BL1'01000000'       APCPSWX                              28080000
         DC    BL1'10000000'       APCPSFN                              28100000
         DC    BL1'01000000'       APCPSRCL                             28120000
         DC    BL1'01000000'       APCPSEML                             28140000
         DC    BL1'00000000'       RESERVED                             28160000
         DC    BL1'00000000'       RESERVED                             28180000
         DC    BL1'00000000'       RESERVED                             28200000
**                       DEFINE APAL CONSTANTS                       ** 28220000
         DC    01XL48'00'          APAL                                 28240000
         ORG   *-48                                                     28260000
         DC    XL4'00000000'       APALUSER                             28280000
         DC    H'28'               APALCISZ                             28300000
         DC    XL2'0000'           RESERVED                             28320000
         DC    XL1'30'             APALSTAT                             28340000
         DC    XL3'000000'         RESERVED                             28360000
         DC    XL1'86'             APALYFSW                             28380000
         DC    XL1'80'             APALYVS                              28400000
         DC    XL1'80'             APALYCT                              28420000
         DC    XL1'00'             APALYDL                              28440000
         DC    XL1'80'             APALYFMT                             28460000
         DC    XL5'0000000000'     RESERVED                             28480000
         DC    H'0000'             APALYCNT                             28500000
         DC    XL1'8C'             APALXFSW                             28520000
         DC    XL1'80'             APALXVS                              28540000
         DC    XL1'00'             APALXCT                              28560000
         DC    XL1'00'             APALXDL                              28580000
         DC    XL1'80'             APALXFMT                             28600000
         DC    XL5'0000000000'     RESERVED                             28620000
         DC    H'0000'             APALXCNT                             28640000
         DC    XL1'8C'             APALUFSW                             28660000
         DC    XL1'80'             APALUVS                              28680000
         DC    XL1'01'             APALUCT                              28700000
         DC    XL1'00'             APALUDL                              28720000
         DC    XL1'80'             APALUFMT                             28740000
         DC    XL5'0000000000'     RESERVED                             28760000
         DC    H'0001'             APALUCNT                             28780000
         ORG   ,                                                        28800000
         EJECT                                                          28820000
*********************************************************************** 28840000
*                                                                     * 28860000
*                    APCP/APAL ENTRY FOR VPUT                         * 28880000
*                        'VECTOR WRITE'                               * 28900000
*                                                                     * 28920000
*********************************************************************** 28940000
**                       DEFINE APCP CONSTANTS                       ** 28960000
         DC    CL4'VPUT'           APCPAPFN                             28980000
         DC    A(APOPVPUT)         APCPAPOP                             29000000
         DC    A(@MDB-CAPCPRTN)    APCPRTN                              29020000
         DC    F'0'                APCPUSRX                             29040000
         DC    H'06'               APCPMAXP                             29060000
         DC    H'06'               APCPMINP                             29080000
         DC    XL4'00000000'       RESERVED                             29100000
         DC    XL8'0000000000000000' RESERVED                           29120000
         DC    00XL16'00'          APCPSWS                              29140000
         DC    BL1'10000000'       APCPSACB                             29160000
         DC    BL1'10000000'       APCPSBLD                             29180000
         DC    BL1'10000000'       APCPSOP                              29200000
         DC    BL1'00000000'       APCPSAR                              29220000
         DC    BL1'00000000'       APCPSIO                              29240000
         DC    BL4'00000000'       RESERVE                              29260000
         DC    BL1'01000000'       APCPSWX                              29280000
         DC    BL1'10000000'       APCPSFN                              29300000
         DC    BL1'01000000'       APCPSRCL                             29320000
         DC    BL1'01000000'       APCPSEML                             29340000
         DC    BL1'00000000'       RESERVED                             29360000
         DC    BL1'00000000'       RESERVED                             29380000
         DC    BL1'00000000'       RESERVED                             29400000
**                       DEFINE APAL CONSTANTS                       ** 29420000
         DC    01XL48'00'          APAL                                 29440000
         ORG   *-48                                                     29460000
         DC    XL4'00000000'       APALUSER                             29480000
         DC    H'06'               APALCISZ                             29500000
         DC    XL2'0000'           RESERVED                             29520000
         DC    XL1'80'             APALIOTP                             29540000
         DC    XL1'40'             APALIOCH                             29560000
         DC    XL6'00'             RESERVED                             29580000
         ORG   ,                                                        29600000
         EJECT                                                          29620000
*********************************************************************** 29640000
*                                                                     * 29660000
*                    APCP/APAL ENTRY FOR VGET                         * 29680000
*                        'VECTOR READ'                                * 29700000
*                                                                     * 29720000
*********************************************************************** 29740000
**                       DEFINE APCP CONSTANTS                       ** 29760000
         DC    CL4'VGET'           APCPAPFN                             29780000
         DC    A(APOPVGET)         APCPAPOP                             29800000
         DC    A(@MDB-CAPCPRTN)    APCPRTN                              29820000
         DC    F'0'                APCPUSRX                             29840000
         DC    H'06'               APCPMAXP                             29860000
         DC    H'06'               APCPMINP                             29880000
         DC    XL4'00000000'       RESERVED                             29900000
         DC    XL8'0000000000000000' RESERVED                           29920000
         DC    00XL16'00'          APCPSWS                              29940000
         DC    BL1'10000000'       APCPSACB                             29960000
         DC    BL1'10000000'       APCPSBLD                             29980000
         DC    BL1'10000000'       APCPSOP                              30000000
         DC    BL1'00000000'       APCPSAR                              30020000
         DC    BL1'00000000'       APCPSIO                              30040000
         DC    BL4'00000000'       RESERVE                              30060000
         DC    BL1'01000000'       APCPSWX                              30080000
         DC    BL1'10000000'       APCPSFN                              30100000
         DC    BL1'01000000'       APCPSRCL                             30120000
         DC    BL1'01000000'       APCPSEML                             30140000
         DC    BL1'00000000'       RESERVED                             30160000
         DC    BL1'00000000'       RESERVED                             30180000
         DC    BL1'00000000'       RESERVED                             30200000
**                       DEFINE APAL CONSTANTS                       ** 30220000
         DC    01XL48'00'          APAL                                 30240000
         ORG   *-48                                                     30260000
         DC    XL4'00000000'       APALUSER                             30280000
         DC    H'06'               APALCISZ                             30300000
         DC    XL2'0000'           RESERVED                             30320000
         DC    XL1'80'             APALIOTP                             30340000
         DC    XL1'80'             APALIOCH                             30360000
         DC    XL6'00'             RESERVED                             30380000
         ORG   ,                                                        30400000
         EJECT                                                          30420000
*********************************************************************** 30440000
*                                                                     * 30460000
*                    APCP/APAL ENTRY FOR XWR                          * 30480000
*                         'INDEX WRITE'                               * 30500000
*                                                                     * 30520000
*********************************************************************** 30540000
**                       DEFINE APCP CONSTANTS                       ** 30560000
         DC    CL4'XWR '           APCPAPFN                             30580000
         DC    A(APOPXWR)          APCPAPOP                             30600000
         DC    A(@MDB-CAPCPRTN)    APCPRTN                              30620000
         DC    F'0'                APCPUSRX                             30640000
         DC    H'05'               APCPMAXP                             30660000
         DC    H'05'               APCPMINP                             30680000
         DC    XL4'00000000'       RESERVED                             30700000
         DC    XL8'0000000000000000' RESERVED                           30720000
         DC    00XL16'00'          APCPSWS                              30740000
         DC    BL1'10000000'       APCPSACB                             30760000
         DC    BL1'10000000'       APCPSBLD                             30780000
         DC    BL1'10000000'       APCPSOP                              30800000
         DC    BL1'00000000'       APCPSAR                              30820000
         DC    BL1'00000000'       APCPSIO                              30840000
         DC    BL4'00000000'       RESERVE                              30860000
         DC    BL1'01000000'       APCPSWX                              30880000
         DC    BL1'10000000'       APCPSFN                              30900000
         DC    BL1'01000000'       APCPSRCL                             30920000
         DC    BL1'01000000'       APCPSEML                             30940000
         DC    BL1'00000000'       RESERVED                             30960000
         DC    BL1'00000000'       RESERVED                             30980000
         DC    BL1'00000000'       RESERVED                             31000000
**                       DEFINE APAL CONSTANTS                       ** 31020000
         DC    01XL48'00'          APAL                                 31040000
         ORG   *-48                                                     31060000
         DC    XL4'00000000'       APALUSER                             31080000
         DC    H'04'               APALCISZ                             31100000
         DC    XL2'0000'           RESERVED                             31120000
         DC    XL1'40'             APALIOTP                             31140000
         DC    XL1'40'             APALIOCH                             31160000
         DC    XL6'00'             RESERVED                             31180000
         ORG   ,                                                        31200000
         EJECT                                                          31220000
*********************************************************************** 31240000
*                                                                     * 31260000
*                    APCP/APAL ENTRY FOR XRD                          * 31280000
*                         'INDEX READ'                                * 31300000
*                                                                     * 31320000
*********************************************************************** 31340000
**                       DEFINE APCP CONSTANTS                       ** 31360000
         DC    CL4'XRD '           APCPAPFN                             31380000
         DC    A(APOPXRD)          APCPAPOP                             31400000
         DC    A(@MDB-CAPCPRTN)    APCPRTN                              31420000
         DC    F'0'                APCPUSRX                             31440000
         DC    H'05'               APCPMAXP                             31460000
         DC    H'05'               APCPMINP                             31480000
         DC    XL4'00000000'       RESERVED                             31500000
         DC    XL8'0000000000000000' RESERVED                           31520000
         DC    00XL16'00'          APCPSWS                              31540000
         DC    BL1'10000000'       APCPSACB                             31560000
         DC    BL1'10000000'       APCPSBLD                             31580000
         DC    BL1'10000000'       APCPSOP                              31600000
         DC    BL1'00000000'       APCPSAR                              31620000
         DC    BL1'00000000'       APCPSIO                              31640000
         DC    BL4'00000000'       RESERVE                              31660000
         DC    BL1'01000000'       APCPSWX                              31680000
         DC    BL1'10000000'       APCPSFN                              31700000
         DC    BL1'01000000'       APCPSRCL                             31720000
         DC    BL1'01000000'       APCPSEML                             31740000
         DC    BL1'00000000'       RESERVED                             31760000
         DC    BL1'00000000'       RESERVED                             31780000
         DC    BL1'00000000'       RESERVED                             31800000
**                       DEFINE APAL CONSTANTS                       ** 31820000
         DC    01XL48'00'          APAL                                 31840000
         ORG   *-48                                                     31860000
         DC    XL4'00000000'       APALUSER                             31880000
         DC    H'04'               APALCISZ                             31900000
         DC    XL2'0000'           RESERVED                             31920000
         DC    XL1'40'             APALIOTP                             31940000
         DC    XL1'80'             APALIOCH                             31960000
         DC    XL6'00'             RESERVED                             31980000
         ORG   ,                                                        32000000
         EJECT                                                          32020000
*********************************************************************** 32040000
*                                                                     * 32060000
*                    APCP/APAL ENTRY FOR FFTR                         * 32080000
*              'FAST FOURIER TRANSFORM(FORWARD REAL)'                 * 32100000
*                                                                     * 32120000
*********************************************************************** 32140000
**                       DEFINE APCP CONSTANTS                       ** 32160000
         DC    CL4'FFTR'           APCPAPFN                             32180000
         DC    A(APOPFFTR)         APCPAPOP                             32200000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              32220000
         DC    F'0'                APCPUSRX                             32240000
         DC    H'13'               APCPMAXP                             32260000
         DC    H'04'               APCPMINP                             32280000
         DC    XL4'00000000'       RESERVED                             32300000
         DC    XL8'0000000000000000' RESERVED                           32320000
         DC    00XL16'00'          APCPSWS                              32340000
         DC    BL1'10000000'       APCPSACB                             32360000
         DC    BL1'10000000'       APCPSBLD                             32380000
         DC    BL1'10000000'       APCPSOP                              32400000
         DC    BL1'00000000'       APCPSAR                              32420000
         DC    BL1'00000000'       APCPSIO                              32440000
         DC    BL4'00000000'       RESERVE                              32460000
         DC    BL1'01000000'       APCPSWX                              32480000
         DC    BL1'10000000'       APCPSFN                              32500000
         DC    BL1'01000000'       APCPSRCL                             32520000
         DC    BL1'01000000'       APCPSEML                             32540000
         DC    BL1'00000000'       RESERVED                             32560000
         DC    BL1'00000000'       RESERVED                             32580000
         DC    BL1'00000000'       RESERVED                             32600000
**                       DEFINE APAL CONSTANTS                       ** 32620000
         DC    01XL48'00'          APAL                                 32640000
         ORG   *-48                                                     32660000
         DC    XL4'00000000'       APALUSER                             32680000
         DC    H'20'               APALCISZ                             32700000
         DC    XL2'0000'           RESERVED                             32720000
         DC    XL1'30'             APALSTAT                             32740000
         DC    XL3'000000'         RESERVED                             32760000
         DC    XL1'86'             APALYFSW                             32780000
         DC    XL1'80'             APALYVS                              32800000
         DC    XL1'80'             APALYCT                              32820000
         DC    XL1'00'             APALYDL                              32840000
         DC    XL1'80'             APALYFMT                             32860000
         DC    XL5'0000000000'     RESERVED                             32880000
         DC    H'0000'             APALYCNT                             32900000
         DC    XL1'86'             APALXFSW                             32920000
         DC    XL1'80'             APALXVS                              32940000
         DC    XL1'80'             APALXCT                              32960000
         DC    XL1'00'             APALXDL                              32980000
         DC    XL1'80'             APALXFMT                             33000000
         DC    XL5'0000000000'     RESERVED                             33020000
         DC    H'0000'             APALXCNT                             33040000
         DC    XL1'00'             APALUFSW                             33060000
         DC    XL1'00'             APALUVS                              33080000
         DC    XL1'00'             APALUCT                              33100000
         DC    XL1'00'             APALUDL                              33120000
         DC    XL1'00'             APALUFMT                             33140000
         DC    XL5'0000000000'     RESERVED                             33160000
         DC    H'0000'             APALUCNT                             33180000
         ORG   ,                                                        33200000
         EJECT                                                          33220000
*********************************************************************** 33240000
*                                                                     * 33260000
*                    APCP/APAL ENTRY FOR FFTC                         * 33280000
*             'FAST FOURIER TRANSFORM(FORWARD COMPLEX)'               * 33300000
*                                                                     * 33320000
*********************************************************************** 33340000
**                       DEFINE APCP CONSTANTS                       ** 33360000
         DC    CL4'FFTC'           APCPAPFN                             33380000
         DC    A(APOPFFTC)         APCPAPOP                             33400000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              33420000
         DC    F'0'                APCPUSRX                             33440000
         DC    H'11'               APCPMAXP                             33460000
         DC    H'04'               APCPMINP                             33480000
         DC    XL4'00000000'       RESERVED                             33500000
         DC    XL8'0000000000000000' RESERVED                           33520000
         DC    00XL16'00'          APCPSWS                              33540000
         DC    BL1'10000000'       APCPSACB                             33560000
         DC    BL1'10000000'       APCPSBLD                             33580000
         DC    BL1'10000000'       APCPSOP                              33600000
         DC    BL1'00000000'       APCPSAR                              33620000
         DC    BL1'00000000'       APCPSIO                              33640000
         DC    BL4'00000000'       RESERVE                              33660000
         DC    BL1'01000000'       APCPSWX                              33680000
         DC    BL1'10000000'       APCPSFN                              33700000
         DC    BL1'01000000'       APCPSRCL                             33720000
         DC    BL1'01000000'       APCPSEML                             33740000
         DC    BL1'00000000'       RESERVED                             33760000
         DC    BL1'00000000'       RESERVED                             33780000
         DC    BL1'00000000'       RESERVED                             33800000
**                       DEFINE APAL CONSTANTS                       ** 33820000
         DC    01XL48'00'          APAL                                 33840000
         ORG   *-48                                                     33860000
         DC    XL4'00000000'       APALUSER                             33880000
         DC    H'20'               APALCISZ                             33900000
         DC    XL2'0000'           RESERVED                             33920000
         DC    XL1'30'             APALSTAT                             33940000
         DC    XL3'000000'         RESERVED                             33960000
         DC    XL1'86'             APALYFSW                             33980000
         DC    XL1'80'             APALYVS                              34000000
         DC    XL1'80'             APALYCT                              34020000
         DC    XL1'00'             APALYDL                              34040000
         DC    XL1'80'             APALYFMT                             34060000
         DC    XL5'0000000000'     RESERVED                             34080000
         DC    H'0000'             APALYCNT                             34100000
         DC    XL1'84'             APALXFSW                             34120000
         DC    XL1'80'             APALXVS                              34140000
         DC    XL1'00'             APALXCT                              34160000
         DC    XL1'00'             APALXDL                              34180000
         DC    XL1'80'             APALXFMT                             34200000
         DC    XL5'0000000000'     RESERVED                             34220000
         DC    H'0000'             APALXCNT                             34240000
         DC    XL1'00'             APALUFSW                             34260000
         DC    XL1'00'             APALUVS                              34280000
         DC    XL1'00'             APALUCT                              34300000
         DC    XL1'00'             APALUDL                              34320000
         DC    XL1'00'             APALUFMT                             34340000
         DC    XL5'0000000000'     RESERVED                             34360000
         DC    H'0000'             APALUCNT                             34380000
         ORG   ,                                                        34400000
         EJECT                                                          34420000
*********************************************************************** 34440000
*                                                                     * 34460000
*                    APCP/APAL ENTRY FOR IFTR                         * 34480000
*                'FAST FOURIER TRANSFORM(INVERSE REAL)'               * 34500000
*                                                                     * 34520000
*********************************************************************** 34540000
**                       DEFINE APCP CONSTANTS                       ** 34560000
         DC    CL4'IFTR'           APCPAPFN                             34580000
         DC    A(APOPIFTR)         APCPAPOP                             34600000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              34620000
         DC    F'0'                APCPUSRX                             34640000
         DC    H'13'               APCPMAXP                             34660000
         DC    H'04'               APCPMINP                             34680000
         DC    XL4'00000000'       RESERVED                             34700000
         DC    XL8'0000000000000000' RESERVED                           34720000
         DC    00XL16'00'          APCPSWS                              34740000
         DC    BL1'10000000'       APCPSACB                             34760000
         DC    BL1'10000000'       APCPSBLD                             34780000
         DC    BL1'10000000'       APCPSOP                              34800000
         DC    BL1'00000000'       APCPSAR                              34820000
         DC    BL1'00000000'       APCPSIO                              34840000
         DC    BL4'00000000'       RESERVE                              34860000
         DC    BL1'01000000'       APCPSWX                              34880000
         DC    BL1'10000000'       APCPSFN                              34900000
         DC    BL1'01000000'       APCPSRCL                             34920000
         DC    BL1'01000000'       APCPSEML                             34940000
         DC    BL1'00000000'       RESERVED                             34960000
         DC    BL1'00000000'       RESERVED                             34980000
         DC    BL1'00000000'       RESERVED                             35000000
**                       DEFINE APAL CONSTANTS                       ** 35020000
         DC    01XL48'00'          APAL                                 35040000
         ORG   *-48                                                     35060000
         DC    XL4'00000000'       APALUSER                             35080000
         DC    H'20'               APALCISZ                             35100000
         DC    XL2'0000'           RESERVED                             35120000
         DC    XL1'30'             APALSTAT                             35140000
         DC    XL3'000000'         RESERVED                             35160000
         DC    XL1'86'             APALYFSW                             35180000
         DC    XL1'80'             APALYVS                              35200000
         DC    XL1'80'             APALYCT                              35220000
         DC    XL1'00'             APALYDL                              35240000
         DC    XL1'80'             APALYFMT                             35260000
         DC    XL5'0000000000'     RESERVED                             35280000
         DC    H'0000'             APALYCNT                             35300000
         DC    XL1'86'             APALXFSW                             35320000
         DC    XL1'80'             APALXVS                              35340000
         DC    XL1'80'             APALXCT                              35360000
         DC    XL1'00'             APALXDL                              35380000
         DC    XL1'80'             APALXFMT                             35400000
         DC    XL5'0000000000'     RESERVED                             35420000
         DC    H'0000'             APALXCNT                             35440000
         DC    XL1'00'             APALUFSW                             35460000
         DC    XL1'00'             APALUVS                              35480000
         DC    XL1'00'             APALUCT                              35500000
         DC    XL1'00'             APALUDL                              35520000
         DC    XL1'00'             APALUFMT                             35540000
         DC    XL5'0000000000'     RESERVED                             35560000
         DC    H'0000'             APALUCNT                             35580000
         ORG   ,                                                        35600000
         EJECT                                                          35620000
*********************************************************************** 35640000
*                                                                     * 35660000
*                    APCP/APAL ENTRY FOR IFTC                         * 35680000
*              'FAST FOURIER TRANSFORM(INVERSE COMPLEX)'              * 35700000
*                                                                     * 35720000
*********************************************************************** 35740000
**                       DEFINE APCP CONSTANTS                       ** 35760000
         DC    CL4'IFTC'           APCPAPFN                             35780000
         DC    A(APOPIFTC)         APCPAPOP                             35800000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              35820000
         DC    F'0'                APCPUSRX                             35840000
         DC    H'13'               APCPMAXP                             35860000
         DC    H'04'               APCPMINP                             35880000
         DC    XL4'00000000'       RESERVED                             35900000
         DC    XL8'0000000000000000' RESERVED                           35920000
         DC    00XL16'00'          APCPSWS                              35940000
         DC    BL1'10000000'       APCPSACB                             35960000
         DC    BL1'10000000'       APCPSBLD                             35980000
         DC    BL1'10000000'       APCPSOP                              36000000
         DC    BL1'00000000'       APCPSAR                              36020000
         DC    BL1'00000000'       APCPSIO                              36040000
         DC    BL4'00000000'       RESERVE                              36060000
         DC    BL1'01000000'       APCPSWX                              36080000
         DC    BL1'10000000'       APCPSFN                              36100000
         DC    BL1'01000000'       APCPSRCL                             36120000
         DC    BL1'01000000'       APCPSEML                             36140000
         DC    BL1'00000000'       RESERVED                             36160000
         DC    BL1'00000000'       RESERVED                             36180000
         DC    BL1'00000000'       RESERVED                             36200000
**                       DEFINE APAL CONSTANTS                       ** 36220000
         DC    01XL48'00'          APAL                                 36240000
         ORG   *-48                                                     36260000
         DC    XL4'00000000'       APALUSER                             36280000
         DC    H'20'               APALCISZ                             36300000
         DC    XL2'0000'           RESERVED                             36320000
         DC    XL1'30'             APALSTAT                             36340000
         DC    XL3'000000'         RESERVED                             36360000
         DC    XL1'86'             APALYFSW                             36380000
         DC    XL1'80'             APALYVS                              36400000
         DC    XL1'80'             APALYCT                              36420000
         DC    XL1'00'             APALYDL                              36440000
         DC    XL1'80'             APALYFMT                             36460000
         DC    XL5'0000000000'     RESERVED                             36480000
         DC    H'0000'             APALYCNT                             36500000
         DC    XL1'86'             APALXFSW                             36520000
         DC    XL1'80'             APALXVS                              36540000
         DC    XL1'80'             APALXCT                              36560000
         DC    XL1'00'             APALXDL                              36580000
         DC    XL1'80'             APALXFMT                             36600000
         DC    XL5'0000000000'     RESERVED                             36620000
         DC    H'0000'             APALXCNT                             36640000
         DC    XL1'00'             APALUFSW                             36660000
         DC    XL1'00'             APALUVS                              36680000
         DC    XL1'00'             APALUCT                              36700000
         DC    XL1'00'             APALUDL                              36720000
         DC    XL1'00'             APALUFMT                             36740000
         DC    XL5'0000000000'     RESERVED                             36760000
         DC    H'0000'             APALUCNT                             36780000
         ORG   ,                                                        36800000
         EJECT                                                          36820000
*********************************************************************** 36840000
*                                                                     * 36860000
*                    APCP/APAL ENTRY FOR VFX                          * 36880000
*            'VECTOR FLOATING-POINT TO FIXED-POINT CONVERT'           * 36900000
*                                                                     * 36920000
*********************************************************************** 36940000
**                       DEFINE APCP CONSTANTS                       ** 36960000
         DC    CL4'VFX '           APCPAPFN                             36980000
         DC    A(APOPVFX)          APCPAPOP                             37000000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              37020000
         DC    F'0'                APCPUSRX                             37040000
         DC    H'16'               APCPMAXP                             37060000
         DC    H'04'               APCPMINP                             37080000
         DC    XL4'00000000'       RESERVED                             37100000
         DC    XL8'0000000000000000' RESERVED                           37120000
         DC    00XL16'00'          APCPSWS                              37140000
         DC    BL1'10000000'       APCPSACB                             37160000
         DC    BL1'10000000'       APCPSBLD                             37180000
         DC    BL1'10000000'       APCPSOP                              37200000
         DC    BL1'00000000'       APCPSAR                              37220000
         DC    BL1'00000000'       APCPSIO                              37240000
         DC    BL4'00000000'       RESERVE                              37260000
         DC    BL1'01000000'       APCPSWX                              37280000
         DC    BL1'10000000'       APCPSFN                              37300000
         DC    BL1'01000000'       APCPSRCL                             37320000
         DC    BL1'01000000'       APCPSEML                             37340000
         DC    BL1'00000000'       RESERVED                             37360000
         DC    BL1'00000000'       RESERVED                             37380000
         DC    BL1'00000000'       RESERVED                             37400000
**                       DEFINE APAL CONSTANTS                       ** 37420000
         DC    01XL48'00'          APAL                                 37440000
         ORG   *-48                                                     37460000
         DC    XL4'00000000'       APALUSER                             37480000
         DC    H'28'               APALCISZ                             37500000
         DC    XL2'0000'           RESERVED                             37520000
         DC    XL1'38'             APALSTAT                             37540000
         DC    XL3'000000'         RESERVED                             37560000
         DC    XL1'66'             APALYFSW                             37580000
         DC    XL1'80'             APALYVS                              37600000
         DC    XL1'80'             APALYCT                              37620000
         DC    XL1'00'             APALYDL                              37640000
         DC    XL1'80'             APALYFMT                             37660000
         DC    XL5'0000000000'     RESERVED                             37680000
         DC    H'0000'             APALYCNT                             37700000
         DC    XL1'8D'             APALXFSW                             37720000
         DC    XL1'80'             APALXVS                              37740000
         DC    XL1'00'             APALXCT                              37760000
         DC    XL1'80'             APALXDL                              37780000
         DC    XL1'80'             APALXFMT                             37800000
         DC    XL5'0000000000'     RESERVED                             37820000
         DC    H'0000'             APALXCNT                             37840000
         DC    XL1'84'             APALUFSW                             37860000
         DC    XL1'80'             APALUVS                              37880000
         DC    XL1'01'             APALUCT                              37900000
         DC    XL1'00'             APALUDL                              37920000
         DC    XL1'80'             APALUFMT                             37940000
         DC    XL5'0000000000'     RESERVED                             37960000
         DC    H'0002'             APALUCNT                             37980000
         ORG   ,                                                        38000000
         EJECT                                                          38020000
*********************************************************************** 38040000
*                                                                     * 38060000
*                    APCP/APAL ENTRY FOR CVM                          * 38080000
*                     'CONVOLVING MULTIPLY'                           * 38100000
*                                                                     * 38120000
*********************************************************************** 38140000
**                       DEFINE APCP CONSTANTS                       ** 38160000
         DC    CL4'CVM '           APCPAPFN                             38180000
         DC    A(APOPCVM)          APCPAPOP                             38200000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              38220000
         DC    F'0'                APCPUSRX                             38240000
         DC    H'24'               APCPMAXP                             38260000
         DC    H'04'               APCPMINP                             38280000
         DC    XL4'00000000'       RESERVED                             38300000
         DC    XL8'0000000000000000' RESERVED                           38320000
         DC    00XL16'00'          APCPSWS                              38340000
         DC    BL1'10000000'       APCPSACB                             38360000
         DC    BL1'10000000'       APCPSBLD                             38380000
         DC    BL1'10000000'       APCPSOP                              38400000
         DC    BL1'00000000'       APCPSAR                              38420000
         DC    BL1'00000000'       APCPSIO                              38440000
         DC    BL4'00000000'       RESERVE                              38460000
         DC    BL1'01000000'       APCPSWX                              38480000
         DC    BL1'10000000'       APCPSFN                              38500000
         DC    BL1'01000000'       APCPSRCL                             38520000
         DC    BL1'01000000'       APCPSEML                             38540000
         DC    BL1'00000000'       RESERVED                             38560000
         DC    BL1'00000000'       RESERVED                             38580000
         DC    BL1'00000000'       RESERVED                             38600000
**                       DEFINE APAL CONSTANTS                       ** 38620000
         DC    01XL48'00'          APAL                                 38640000
         ORG   *-48                                                     38660000
         DC    XL4'00000000'       APALUSER                             38680000
         DC    H'28'               APALCISZ                             38700000
         DC    XL2'0000'           RESERVED                             38720000
         DC    XL1'30'             APALSTAT                             38740000
         DC    XL3'000000'         RESERVED                             38760000
         DC    XL1'87'             APALYFSW                             38780000
         DC    XL1'80'             APALYVS                              38800000
         DC    XL1'80'             APALYCT                              38820000
         DC    XL1'80'             APALYDL                              38840000
         DC    XL1'80'             APALYFMT                             38860000
         DC    XL5'0000000000'     RESERVED                             38880000
         DC    H'0000'             APALYCNT                             38900000
         DC    XL1'8F'             APALXFSW                             38920000
         DC    XL1'80'             APALXVS                              38940000
         DC    XL1'80'             APALXCT                              38960000
         DC    XL1'80'             APALXDL                              38980000
         DC    XL1'80'             APALXFMT                             39000000
         DC    XL5'0000000000'     RESERVED                             39020000
         DC    H'0000'             APALXCNT                             39040000
         DC    XL1'8F'             APALUFSW                             39060000
         DC    XL1'80'             APALUVS                              39080000
         DC    XL1'80'             APALUCT                              39100000
         DC    XL1'40'             APALUDL                              39120000
         DC    XL1'80'             APALUFMT                             39140000
         DC    XL5'0000000000'     RESERVED                             39160000
         DC    H'0000'             APALUCNT                             39180000
         ORG   ,                                                        39200000
         EJECT                                                          39220000
*********************************************************************** 39240000
*                                                                     * 39260000
*                    APCP/APAL ENTRY FOR INT                          * 39280000
*                   'QUADRATIC INTERPOLATION'                         * 39300000
*                                                                     * 39320000
*********************************************************************** 39340000
**                       DEFINE APCP CONSTANTS                       ** 39360000
         DC    CL4'INT '           APCPAPFN                             39380000
         DC    A(APOPINT)          APCPAPOP                             39400000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              39420000
         DC    F'0'                APCPUSRX                             39440000
         DC    H'24'               APCPMAXP                             39460000
         DC    H'04'               APCPMINP                             39480000
         DC    XL4'00000000'       RESERVED                             39500000
         DC    XL8'0000000000000000' RESERVED                           39520000
         DC    00XL16'00'          APCPSWS                              39540000
         DC    BL1'10000000'       APCPSACB                             39560000
         DC    BL1'10000000'       APCPSBLD                             39580000
         DC    BL1'10000000'       APCPSOP                              39600000
         DC    BL1'00000000'       APCPSAR                              39620000
         DC    BL1'00000000'       APCPSIO                              39640000
         DC    BL4'00000000'       RESERVE                              39660000
         DC    BL1'01000000'       APCPSWX                              39680000
         DC    BL1'10000000'       APCPSFN                              39700000
         DC    BL1'01000000'       APCPSRCL                             39720000
         DC    BL1'01000000'       APCPSEML                             39740000
         DC    BL1'00000000'       RESERVED                             39760000
         DC    BL1'00000000'       RESERVED                             39780000
         DC    BL1'00000000'       RESERVED                             39800000
**                       DEFINE APAL CONSTANTS                       ** 39820000
         DC    01XL48'00'          APAL                                 39840000
         ORG   *-48                                                     39860000
         DC    XL4'00000000'       APALUSER                             39880000
         DC    H'28'               APALCISZ                             39900000
         DC    XL2'0000'           RESERVED                             39920000
         DC    XL1'30'             APALSTAT                             39940000
         DC    XL3'000000'         RESERVED                             39960000
         DC    XL1'87'             APALYFSW                             39980000
         DC    XL1'80'             APALYVS                              40000000
         DC    XL1'80'             APALYCT                              40020000
         DC    XL1'80'             APALYDL                              40040000
         DC    XL1'80'             APALYFMT                             40060000
         DC    XL5'0000000000'     RESERVED                             40080000
         DC    H'0000'             APALYCNT                             40100000
         DC    XL1'87'             APALXFSW                             40120000
         DC    XL1'80'             APALXVS                              40140000
         DC    XL1'80'             APALXCT                              40160000
         DC    XL1'80'             APALXDL                              40180000
         DC    XL1'80'             APALXFMT                             40200000
         DC    XL5'0000000000'     RESERVED                             40220000
         DC    H'0000'             APALXCNT                             40240000
         DC    XL1'87'             APALUFSW                             40260000
         DC    XL1'80'             APALUVS                              40280000
         DC    XL1'80'             APALUCT                              40300000
         DC    XL1'40'             APALUDL                              40320000
         DC    XL1'80'             APALUFMT                             40340000
         DC    XL5'0000000000'     RESERVED                             40360000
         DC    H'0000'             APALUCNT                             40380000
         ORG   ,                                                        40400000
         EJECT                                                          40420000
*********************************************************************** 40440000
*                                                                     * 40460000
*                    APCP/APAL ENTRY FOR DUMP                         * 40480000
*                            'DUMP'                                   * 40500000
*                                                                     * 40520000
*********************************************************************** 40540000
**                       DEFINE APCP CONSTANTS                       ** 40560000
         DC    CL4'DUMP'           APCPAPFN                             40580000
         DC    A(APOPDUMP)         APCPAPOP                             40600000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              40620000
         DC    F'0'                APCPUSRX                             40640000
         DC    H'02'               APCPMAXP                             40660000
         DC    H'02'               APCPMINP                             40680000
         DC    XL4'00000000'       RESERVED                             40700000
         DC    XL8'0000000000000000' RESERVED                           40720000
         DC    00XL16'00'          APCPSWS                              40740000
         DC    BL1'10000000'       APCPSACB                             40760000
         DC    BL1'10000000'       APCPSBLD                             40780000
         DC    BL1'10000000'       APCPSOP                              40800000
         DC    BL1'00000000'       APCPSAR                              40820000
         DC    BL1'00000000'       APCPSIO                              40840000
         DC    BL4'00000000'       RESERVE                              40860000
         DC    BL1'01000000'       APCPSWX                              40880000
         DC    BL1'10000000'       APCPSFN                              40900000
         DC    BL1'01000000'       APCPSRCL                             40920000
         DC    BL1'01000000'       APCPSEML                             40940000
         DC    BL1'00000000'       RESERVED                             40960000
         DC    BL1'00000000'       RESERVED                             40980000
         DC    BL1'00000000'       RESERVED                             41000000
**                       DEFINE APAL CONSTANTS                       ** 41020000
         DC    01XL48'00'          APAL                                 41040000
         ORG   *-48                                                     41060000
         DC    XL4'00000000'       APALUSER                             41080000
         DC    H'02'               APALCISZ                             41100000
         DC    XL2'0000'           RESERVED                             41120000
         DC    H'08'               APALLTYP                             41140000
         DC    XL1'00'             APALLI1F                             41160000
         DC    XL1'00'             APALLI2F                             41180000
         DC    XL4'00'             RESERVED                             41200000
         ORG   ,                                                        41220000
         EJECT                                                          41220300
*********************************************************************** 41220600
*                                                                     * 41221200
*                    APCP/APAL ENTRY FOR DUMP - MSG ENTRY             * 41221800
*             THIS ENTRY ALLOWS THE CALL ROUTER MESSAGE FORMATTER     * 41222400
*             TO CORRECTLY IDENTIFY A DUMP OPERATION.                 * 41223000
*                                                                     * 41223600
*********************************************************************** 41224200
**                       DEFINE APCP CONSTANTS                       ** 41224800
         DC    CL4'DUMP'           APCPAPFN                             41225400
         DC    A(0)                APCPAPOP - OP CODE OF ZEROS          41226000
         DC    A(0)                APCPRTN  - CALL NOT PROCESSED        41226600
         DC    F'0'                APCPUSRX                             41227200
         DC    H'02'               APCPMAXP                             41227800
         DC    H'02'               APCPMINP                             41228400
         DC    XL4'00000000'       RESERVED                             41229000
         DC    XL8'0000000000000000' RESERVED                           41229600
         DC    00XL16'00'          APCPSWS                              41230200
         DC    BL1'10000000'       APCPSACB                             41230800
         DC    BL1'10000000'       APCPSBLD                             41231400
         DC    BL1'10000000'       APCPSOP                              41232000
         DC    BL1'00000000'       APCPSAR                              41232600
         DC    BL1'00000000'       APCPSIO                              41233200
         DC    BL4'00000000'       RESERVED                             41233800
         DC    BL1'01000000'       APCPSWX                              41234400
         DC    BL1'10000000'       APCPSFN                              41235000
         DC    BL1'01000000'       APCPSRCL                             41235600
         DC    BL1'01000000'       APCPSEML                             41236200
         DC    BL1'00000000'       RESERVED                             41236800
         DC    BL1'00000000'       RESERVED                             41237400
         DC    BL1'00000000'       RESERVED                             41238000
         DC    XL48'00'            APAL                                 41238600
         EJECT                                                          41239200
*********************************************************************** 41260000
*                                                                     * 41280000
*                    APCP/APAL ENTRY FOR BRK                          * 41300000
*                    'BREAK 3838 CIT CHAIN'                           * 41320000
*                                                                     * 41340000
*********************************************************************** 41360000
**                       DEFINE APCP CONSTANTS                       ** 41380000
         DC    CL4'BRK '           APCPAPFN                             41400000
         DC    A(APOPBRK)          APCPAPOP                             41420000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              41440000
         DC    F'0'                APCPUSRX                             41460000
         DC    H'02'               APCPMAXP                             41480000
         DC    H'02'               APCPMINP                             41500000
         DC    XL4'00000000'       RESERVED                             41520000
         DC    XL8'0000000000000000' RESERVED                           41540000
         DC    00XL16'00'          APCPSWS                              41560000
         DC    BL1'10000000'       APCPSACB                             41580000
         DC    BL1'10000000'       APCPSBLD                             41600000
         DC    BL1'10000000'       APCPSOP                              41620000
         DC    BL1'00000000'       APCPSAR                              41640000
         DC    BL1'00000000'       APCPSIO                              41660000
         DC    BL4'00000000'       RESERVE                              41680000
         DC    BL1'01000000'       APCPSWX                              41700000
         DC    BL1'10000000'       APCPSFN                              41720000
         DC    BL1'01000000'       APCPSRCL                             41740000
         DC    BL1'01000000'       APCPSEML                             41760000
         DC    BL1'00000000'       RESERVED                             41780000
         DC    BL1'00000000'       RESERVED                             41800000
         DC    BL1'00000000'       RESERVED                             41820000
**                       DEFINE APAL CONSTANTS                       ** 41840000
         DC    01XL48'00'          APAL                                 41860000
         ORG   *-48                                                     41880000
         DC    XL4'00000000'       APALUSER                             41900000
         DC    H'02'               APALCISZ                             41920000
         DC    XL2'0000'           RESERVED                             41940000
         DC    H'09'               APALLTYP                             41960000
         DC    XL1'00'             APALLI1F                             41980000
         DC    XL1'00'             APALLI2F                             42000000
         DC    XL4'00'             RESERVED                             42020000
         ORG   ,                                                        42040000
         EJECT                                                          42060000
*********************************************************************** 42080000
*                                                                     * 42100000
*                    APCP/APAL ENTRY FOR VES                          * 42120000
*                'VECTOR ELEMENT-BY-ELEMENT SUM'                      * 42140000
*                                                                     * 42160000
*********************************************************************** 42180000
**                       DEFINE APCP CONSTANTS                       ** 42200000
         DC    CL4'VES '           APCPAPFN                             42220000
         DC    A(APOPVES)          APCPAPOP                             42240000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              42260000
         DC    F'0'                APCPUSRX                             42280000
         DC    H'20'               APCPMAXP                             42300000
         DC    H'04'               APCPMINP                             42320000
         DC    XL4'00000000'       RESERVED                             42340000
         DC    XL8'0000000000000000' RESERVED                           42360000
         DC    00XL16'00'          APCPSWS                              42380000
         DC    BL1'10000000'       APCPSACB                             42400000
         DC    BL1'10000000'       APCPSBLD                             42420000
         DC    BL1'10000000'       APCPSOP                              42440000
         DC    BL1'00000000'       APCPSAR                              42460000
         DC    BL1'00000000'       APCPSIO                              42480000
         DC    BL4'00000000'       RESERVE                              42500000
         DC    BL1'01000000'       APCPSWX                              42520000
         DC    BL1'10000000'       APCPSFN                              42540000
         DC    BL1'01000000'       APCPSRCL                             42560000
         DC    BL1'01000000'       APCPSEML                             42580000
         DC    BL1'00000000'       RESERVED                             42600000
         DC    BL1'00000000'       RESERVED                             42620000
         DC    BL1'00000000'       RESERVED                             42640000
**                       DEFINE APAL CONSTANTS                       ** 42660000
         DC    01XL48'00'          APAL                                 42680000
         ORG   *-48                                                     42700000
         DC    XL4'00000000'       APALUSER                             42720000
         DC    H'28'               APALCISZ                             42740000
         DC    XL2'0000'           RESERVED                             42760000
         DC    XL1'30'             APALSTAT                             42780000
         DC    XL3'000000'         RESERVED                             42800000
         DC    XL1'87'             APALYFSW                             42820000
         DC    XL1'80'             APALYVS                              42840000
         DC    XL1'41'             APALYCT                              42860000
         DC    XL1'40'             APALYDL                              42880000
         DC    XL1'80'             APALYFMT                             42900000
         DC    XL5'0000000000'     RESERVED                             42920000
         DC    H'0001'             APALYCNT                             42940000
         DC    XL1'8D'             APALXFSW                             42960000
         DC    XL1'40'             APALXVS                              42980000
         DC    XL1'00'             APALXCT                              43000000
         DC    XL1'40'             APALXDL                              43020000
         DC    XL1'40'             APALXFMT                             43040000
         DC    XL5'0000000000'     RESERVED                             43060000
         DC    H'0000'             APALXCNT                             43080000
         DC    XL1'8D'             APALUFSW                             43100000
         DC    XL1'40'             APALUVS                              43120000
         DC    XL1'00'             APALUCT                              43140000
         DC    XL1'40'             APALUDL                              43160000
         DC    XL1'40'             APALUFMT                             43180000
         DC    XL5'0000000000'     RESERVED                             43200000
         DC    H'0000'             APALUCNT                             43220000
         ORG   ,                                                        43240000
         EJECT                                                          43260000
*********************************************************************** 43280000
*                                                                     * 43300000
*                    APCP/APAL ENTRY FOR SSUM                         * 43320000
*                          'SCALAR SUM'                               * 43340000
*                                                                     * 43360000
*********************************************************************** 43380000
**                       DEFINE APCP CONSTANTS                       ** 43400000
         DC    CL4'SSUM'           APCPAPFN                             43420000
         DC    A(APOPSSUM)         APCPAPOP                             43440000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              43460000
         DC    F'0'                APCPUSRX                             43480000
         DC    H'18'               APCPMAXP                             43500000
         DC    H'04'               APCPMINP                             43520000
         DC    XL4'00000000'       RESERVED                             43540000
         DC    XL8'0000000000000000' RESERVED                           43560000
         DC    00XL16'00'          APCPSWS                              43580000
         DC    BL1'10000000'       APCPSACB                             43600000
         DC    BL1'10000000'       APCPSBLD                             43620000
         DC    BL1'10000000'       APCPSOP                              43640000
         DC    BL1'00000000'       APCPSAR                              43660000
         DC    BL1'00000000'       APCPSIO                              43680000
         DC    BL4'00000000'       RESERVE                              43700000
         DC    BL1'01000000'       APCPSWX                              43720000
         DC    BL1'10000000'       APCPSFN                              43740000
         DC    BL1'01000000'       APCPSRCL                             43760000
         DC    BL1'01000000'       APCPSEML                             43780000
         DC    BL1'00000000'       RESERVED                             43800000
         DC    BL1'00000000'       RESERVED                             43820000
         DC    BL1'00000000'       RESERVED                             43840000
**                       DEFINE APAL CONSTANTS                       ** 43860000
         DC    01XL48'00'          APAL                                 43880000
         ORG   *-48                                                     43900000
         DC    XL4'00000000'       APALUSER                             43920000
         DC    H'28'               APALCISZ                             43940000
         DC    XL2'0000'           RESERVED                             43960000
         DC    XL1'30'             APALSTAT                             43980000
         DC    XL3'000000'         RESERVED                             44000000
         DC    XL1'87'             APALYFSW                             44020000
         DC    XL1'80'             APALYVS                              44040000
         DC    XL1'80'             APALYCT                              44060000
         DC    XL1'80'             APALYDL                              44080000
         DC    XL1'80'             APALYFMT                             44100000
         DC    XL5'0000000000'     RESERVED                             44120000
         DC    H'0000'             APALYCNT                             44140000
         DC    XL1'8D'             APALXFSW                             44160000
         DC    XL1'80'             APALXVS                              44180000
         DC    XL1'00'             APALXCT                              44200000
         DC    XL1'80'             APALXDL                              44220000
         DC    XL1'80'             APALXFMT                             44240000
         DC    XL5'0000000000'     RESERVED                             44260000
         DC    H'0000'             APALXCNT                             44280000
         DC    XL1'8C'             APALUFSW                             44300000
         DC    XL1'80'             APALUVS                              44320000
         DC    XL1'01'             APALUCT                              44340000
         DC    XL1'00'             APALUDL                              44360000
         DC    XL1'80'             APALUFMT                             44380000
         DC    XL5'0000000000'     RESERVED                             44400000
         DC    H'0001'             APALUCNT                             44420000
         ORG   ,                                                        44440000
         EJECT                                                          44460000
*********************************************************************** 44480000
*                                                                     * 44500000
*                    APCP/APAL ENTRY FOR VEM                          * 44520000
*              'VECTOR ELEMENT-BY-ELEMENT MULTIPLY'                   * 44540000
*                                                                     * 44560000
*********************************************************************** 44580000
**                       DEFINE APCP CONSTANTS                       ** 44600000
         DC    CL4'VEM '           APCPAPFN                             44620000
         DC    A(APOPVEM)          APCPAPOP                             44640000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              44660000
         DC    F'0'                APCPUSRX                             44680000
         DC    H'20'               APCPMAXP                             44700000
         DC    H'04'               APCPMINP                             44720000
         DC    XL4'00000000'       RESERVED                             44740000
         DC    XL8'0000000000000000' RESERVED                           44760000
         DC    00XL16'00'          APCPSWS                              44780000
         DC    BL1'10000000'       APCPSACB                             44800000
         DC    BL1'10000000'       APCPSBLD                             44820000
         DC    BL1'10000000'       APCPSOP                              44840000
         DC    BL1'00000000'       APCPSAR                              44860000
         DC    BL1'00000000'       APCPSIO                              44880000
         DC    BL4'00000000'       RESERVE                              44900000
         DC    BL1'01000000'       APCPSWX                              44920000
         DC    BL1'10000000'       APCPSFN                              44940000
         DC    BL1'01000000'       APCPSRCL                             44960000
         DC    BL1'01000000'       APCPSEML                             44980000
         DC    BL1'00000000'       RESERVED                             45000000
         DC    BL1'00000000'       RESERVED                             45020000
         DC    BL1'00000000'       RESERVED                             45040000
**                       DEFINE APAL CONSTANTS                       ** 45060000
         DC    01XL48'00'          APAL                                 45080000
         ORG   *-48                                                     45100000
         DC    XL4'00000000'       APALUSER                             45120000
         DC    H'28'               APALCISZ                             45140000
         DC    XL2'0000'           RESERVED                             45160000
         DC    XL1'30'             APALSTAT                             45180000
         DC    XL3'000000'         RESERVED                             45200000
         DC    XL1'87'             APALYFSW                             45220000
         DC    XL1'80'             APALYVS                              45240000
         DC    XL1'41'             APALYCT                              45260000
         DC    XL1'40'             APALYDL                              45280000
         DC    XL1'80'             APALYFMT                             45300000
         DC    XL5'0000000000'     RESERVED                             45320000
         DC    H'0001'             APALYCNT                             45340000
         DC    XL1'8D'             APALXFSW                             45360000
         DC    XL1'40'             APALXVS                              45380000
         DC    XL1'00'             APALXCT                              45400000
         DC    XL1'40'             APALXDL                              45420000
         DC    XL1'40'             APALXFMT                             45440000
         DC    XL5'0000000000'     RESERVED                             45460000
         DC    H'0000'             APALXCNT                             45480000
         DC    XL1'8D'             APALUFSW                             45500000
         DC    XL1'40'             APALUVS                              45520000
         DC    XL1'00'             APALUCT                              45540000
         DC    XL1'40'             APALUDL                              45560000
         DC    XL1'40'             APALUFMT                             45580000
         DC    XL5'0000000000'     RESERVED                             45600000
         DC    H'0000'             APALUCNT                             45620000
         ORG   ,                                                        45640000
         EJECT                                                          45660000
*********************************************************************** 45680000
*                                                                     * 45700000
*                    APCP/APAL ENTRY FOR SMY                          * 45720000
*                       'SCALAR MULTIPLY'                             * 45740000
*                                                                     * 45760000
*********************************************************************** 45780000
**                       DEFINE APCP CONSTANTS                       ** 45800000
         DC    CL4'SMY '           APCPAPFN                             45820000
         DC    A(APOPSMY)          APCPAPOP                             45840000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              45860000
         DC    F'0'                APCPUSRX                             45880000
         DC    H'18'               APCPMAXP                             45900000
         DC    H'04'               APCPMINP                             45920000
         DC    XL4'00000000'       RESERVED                             45940000
         DC    XL8'0000000000000000' RESERVED                           45960000
         DC    00XL16'00'          APCPSWS                              45980000
         DC    BL1'10000000'       APCPSACB                             46000000
         DC    BL1'10000000'       APCPSBLD                             46020000
         DC    BL1'10000000'       APCPSOP                              46040000
         DC    BL1'00000000'       APCPSAR                              46060000
         DC    BL1'00000000'       APCPSIO                              46080000
         DC    BL4'00000000'       RESERVE                              46100000
         DC    BL1'01000000'       APCPSWX                              46120000
         DC    BL1'10000000'       APCPSFN                              46140000
         DC    BL1'01000000'       APCPSRCL                             46160000
         DC    BL1'01000000'       APCPSEML                             46180000
         DC    BL1'00000000'       RESERVED                             46200000
         DC    BL1'00000000'       RESERVED                             46220000
         DC    BL1'00000000'       RESERVED                             46240000
**                       DEFINE APAL CONSTANTS                       ** 46260000
         DC    01XL48'00'          APAL                                 46280000
         ORG   *-48                                                     46300000
         DC    XL4'00000000'       APALUSER                             46320000
         DC    H'28'               APALCISZ                             46340000
         DC    XL2'0000'           RESERVED                             46360000
         DC    XL1'30'             APALSTAT                             46380000
         DC    XL3'000000'         RESERVED                             46400000
         DC    XL1'87'             APALYFSW                             46420000
         DC    XL1'80'             APALYVS                              46440000
         DC    XL1'80'             APALYCT                              46460000
         DC    XL1'80'             APALYDL                              46480000
         DC    XL1'80'             APALYFMT                             46500000
         DC    XL5'0000000000'     RESERVED                             46520000
         DC    H'0000'             APALYCNT                             46540000
         DC    XL1'8D'             APALXFSW                             46560000
         DC    XL1'80'             APALXVS                              46580000
         DC    XL1'00'             APALXCT                              46600000
         DC    XL1'80'             APALXDL                              46620000
         DC    XL1'80'             APALXFMT                             46640000
         DC    XL5'0000000000'     RESERVED                             46660000
         DC    H'0000'             APALXCNT                             46680000
         DC    XL1'8C'             APALUFSW                             46700000
         DC    XL1'80'             APALUVS                              46720000
         DC    XL1'01'             APALUCT                              46740000
         DC    XL1'00'             APALUDL                              46760000
         DC    XL1'80'             APALUFMT                             46780000
         DC    XL5'0000000000'     RESERVED                             46800000
         DC    H'0001'             APALUCNT                             46820000
         ORG   ,                                                        46840000
         EJECT                                                          46860000
*********************************************************************** 46880000
*                                                                     * 46900000
*                    APCP/APAL ENTRY FOR SSQ                          * 46920000
*                        'SUM OF SQUARES'                             * 46940000
*                                                                     * 46960000
*********************************************************************** 46980000
**                       DEFINE APCP CONSTANTS                       ** 47000000
         DC    CL4'SSQ '           APCPAPFN                             47020000
         DC    A(APOPSSQ)          APCPAPOP                             47040000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              47060000
         DC    F'0'                APCPUSRX                             47080000
         DC    H'13'               APCPMAXP                             47100000
         DC    H'04'               APCPMINP                             47120000
         DC    XL4'00000000'       RESERVED                             47140000
         DC    XL8'0000000000000000' RESERVED                           47160000
         DC    00XL16'00'          APCPSWS                              47180000
         DC    BL1'10000000'       APCPSACB                             47200000
         DC    BL1'10000000'       APCPSBLD                             47220000
         DC    BL1'10000000'       APCPSOP                              47240000
         DC    BL1'00000000'       APCPSAR                              47260000
         DC    BL1'00000000'       APCPSIO                              47280000
         DC    BL4'00000000'       RESERVE                              47300000
         DC    BL1'01000000'       APCPSWX                              47320000
         DC    BL1'10000000'       APCPSFN                              47340000
         DC    BL1'01000000'       APCPSRCL                             47360000
         DC    BL1'01000000'       APCPSEML                             47380000
         DC    BL1'00000000'       RESERVED                             47400000
         DC    BL1'00000000'       RESERVED                             47420000
         DC    BL1'00000000'       RESERVED                             47440000
**                       DEFINE APAL CONSTANTS                       ** 47460000
         DC    01XL48'00'          APAL                                 47480000
         ORG   *-48                                                     47500000
         DC    XL4'00000000'       APALUSER                             47520000
         DC    H'20'               APALCISZ                             47540000
         DC    XL2'0000'           RESERVED                             47560000
         DC    XL1'70'             APALSTAT                             47580000
         DC    XL3'000000'         RESERVED                             47600000
         DC    XL1'84'             APALYFSW                             47620000
         DC    XL1'80'             APALYVS                              47640000
         DC    XL1'01'             APALYCT                              47660000
         DC    XL1'00'             APALYDL                              47680000
         DC    XL1'80'             APALYFMT                             47700000
         DC    XL5'0000000000'     RESERVED                             47720000
         DC    H'0001'             APALYCNT                             47740000
         DC    XL1'87'             APALXFSW                             47760000
         DC    XL1'80'             APALXVS                              47780000
         DC    XL1'41'             APALXCT                              47800000
         DC    XL1'40'             APALXDL                              47820000
         DC    XL1'80'             APALXFMT                             47840000
         DC    XL5'0000000000'     RESERVED                             47860000
         DC    H'0001'             APALXCNT                             47880000
         DC    XL1'00'             APALUFSW                             47900000
         DC    XL1'00'             APALUVS                              47920000
         DC    XL1'00'             APALUCT                              47940000
         DC    XL1'00'             APALUDL                              47960000
         DC    XL1'00'             APALUFMT                             47980000
         DC    XL5'0000000000'     RESERVED                             48000000
         DC    H'0000'             APALUCNT                             48020000
         ORG   ,                                                        48040000
         EJECT                                                          48060000
*********************************************************************** 48080000
*                                                                     * 48100000
*                    APCP/APAL ENTRY FOR SSA                          * 48120000
*                    'SIGNED SQUARED ARRAY'                           * 48140000
*                                                                     * 48160000
*********************************************************************** 48180000
**                       DEFINE APCP CONSTANTS                       ** 48200000
         DC    CL4'SSA '           APCPAPFN                             48220000
         DC    A(APOPSSA)          APCPAPOP                             48240000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              48260000
         DC    F'0'                APCPUSRX                             48280000
         DC    H'15'               APCPMAXP                             48300000
         DC    H'04'               APCPMINP                             48320000
         DC    XL4'00000000'       RESERVED                             48340000
         DC    XL8'0000000000000000' RESERVED                           48360000
         DC    00XL16'00'          APCPSWS                              48380000
         DC    BL1'10000000'       APCPSACB                             48400000
         DC    BL1'10000000'       APCPSBLD                             48420000
         DC    BL1'10000000'       APCPSOP                              48440000
         DC    BL1'00000000'       APCPSAR                              48460000
         DC    BL1'00000000'       APCPSIO                              48480000
         DC    BL4'00000000'       RESERVE                              48500000
         DC    BL1'01000000'       APCPSWX                              48520000
         DC    BL1'10000000'       APCPSFN                              48540000
         DC    BL1'01000000'       APCPSRCL                             48560000
         DC    BL1'01000000'       APCPSEML                             48580000
         DC    BL1'00000000'       RESERVED                             48600000
         DC    BL1'00000000'       RESERVED                             48620000
         DC    BL1'00000000'       RESERVED                             48640000
**                       DEFINE APAL CONSTANTS                       ** 48660000
         DC    01XL48'00'          APAL                                 48680000
         ORG   *-48                                                     48700000
         DC    XL4'00000000'       APALUSER                             48720000
         DC    H'20'               APALCISZ                             48740000
         DC    XL2'0000'           RESERVED                             48760000
         DC    XL1'30'             APALSTAT                             48780000
         DC    XL3'000000'         RESERVED                             48800000
         DC    XL1'87'             APALYFSW                             48820000
         DC    XL1'80'             APALYVS                              48840000
         DC    XL1'41'             APALYCT                              48860000
         DC    XL1'40'             APALYDL                              48880000
         DC    XL1'80'             APALYFMT                             48900000
         DC    XL5'0000000000'     RESERVED                             48920000
         DC    H'0001'             APALYCNT                             48940000
         DC    XL1'8D'             APALXFSW                             48960000
         DC    XL1'40'             APALXVS                              48980000
         DC    XL1'00'             APALXCT                              49000000
         DC    XL1'40'             APALXDL                              49020000
         DC    XL1'40'             APALXFMT                             49040000
         DC    XL5'0000000000'     RESERVED                             49060000
         DC    H'0000'             APALXCNT                             49080000
         DC    XL1'00'             APALUFSW                             49100000
         DC    XL1'00'             APALUVS                              49120000
         DC    XL1'00'             APALUCT                              49140000
         DC    XL1'00'             APALUDL                              49160000
         DC    XL1'00'             APALUFMT                             49180000
         DC    XL5'0000000000'     RESERVED                             49200000
         DC    H'0000'             APALUCNT                             49220000
         ORG   ,                                                        49240000
         EJECT                                                          49260000
*********************************************************************** 49280000
*                                                                     * 49300000
*                    APCP/APAL ENTRY FOR SVE                          * 49320000
*                   'SUM OF VECTOR ELEMENTS'                          * 49340000
*                                                                     * 49360000
*********************************************************************** 49380000
**                       DEFINE APCP CONSTANTS                       ** 49400000
         DC    CL4'SVE '           APCPAPFN                             49420000
         DC    A(APOPSVE)          APCPAPOP                             49440000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              49460000
         DC    F'0'                APCPUSRX                             49480000
         DC    H'13'               APCPMAXP                             49500000
         DC    H'04'               APCPMINP                             49520000
         DC    XL4'00000000'       RESERVED                             49540000
         DC    XL8'0000000000000000' RESERVED                           49560000
         DC    00XL16'00'          APCPSWS                              49580000
         DC    BL1'10000000'       APCPSACB                             49600000
         DC    BL1'10000000'       APCPSBLD                             49620000
         DC    BL1'10000000'       APCPSOP                              49640000
         DC    BL1'00000000'       APCPSAR                              49660000
         DC    BL1'00000000'       APCPSIO                              49680000
         DC    BL4'00000000'       RESERVE                              49700000
         DC    BL1'01000000'       APCPSWX                              49720000
         DC    BL1'10000000'       APCPSFN                              49740000
         DC    BL1'01000000'       APCPSRCL                             49760000
         DC    BL1'01000000'       APCPSEML                             49780000
         DC    BL1'00000000'       RESERVED                             49800000
         DC    BL1'00000000'       RESERVED                             49820000
         DC    BL1'00000000'       RESERVED                             49840000
**                       DEFINE APAL CONSTANTS                       ** 49860000
         DC    01XL48'00'          APAL                                 49880000
         ORG   *-48                                                     49900000
         DC    XL4'00000000'       APALUSER                             49920000
         DC    H'20'               APALCISZ                             49940000
         DC    XL2'0000'           RESERVED                             49960000
         DC    XL1'70'             APALSTAT                             49980000
         DC    XL3'000000'         RESERVED                             50000000
         DC    XL1'84'             APALYFSW                             50020000
         DC    XL1'80'             APALYVS                              50040000
         DC    XL1'01'             APALYCT                              50060000
         DC    XL1'00'             APALYDL                              50080000
         DC    XL1'80'             APALYFMT                             50100000
         DC    XL5'0000000000'     RESERVED                             50120000
         DC    H'0001'             APALYCNT                             50140000
         DC    XL1'8F'             APALXFSW                             50160000
         DC    XL1'80'             APALXVS                              50180000
         DC    XL1'80'             APALXCT                              50200000
         DC    XL1'40'             APALXDL                              50220000
         DC    XL1'80'             APALXFMT                             50240000
         DC    XL5'0000000000'     RESERVED                             50260000
         DC    H'0000'             APALXCNT                             50280000
         DC    XL1'00'             APALUFSW                             50300000
         DC    XL1'00'             APALUVS                              50320000
         DC    XL1'00'             APALUCT                              50340000
         DC    XL1'00'             APALUDL                              50360000
         DC    XL1'00'             APALUFMT                             50380000
         DC    XL5'0000000000'     RESERVED                             50400000
         DC    H'0000'             APALUCNT                             50420000
         ORG   ,                                                        50440000
         EJECT                                                          50460000
*********************************************************************** 50480000
*                                                                     * 50500000
*                    APCP/APAL ENTRY FOR DIV                          * 50520000
*                           'DIVIDE'                                  * 50540000
*                                                                     * 50560000
*********************************************************************** 50580000
**                       DEFINE APCP CONSTANTS                       ** 50600000
         DC    CL4'DIV '           APCPAPFN                             50620000
         DC    A(APOPDIV)          APCPAPOP                             50640000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              50660000
         DC    F'0'                APCPUSRX                             50680000
         DC    H'20'               APCPMAXP                             50700000
         DC    H'04'               APCPMINP                             50720000
         DC    XL4'00000000'       RESERVED                             50740000
         DC    XL8'0000000000000000' RESERVED                           50760000
         DC    00XL16'00'          APCPSWS                              50780000
         DC    BL1'10000000'       APCPSACB                             50800000
         DC    BL1'10000000'       APCPSBLD                             50820000
         DC    BL1'10000000'       APCPSOP                              50840000
         DC    BL1'00000000'       APCPSAR                              50860000
         DC    BL1'00000000'       APCPSIO                              50880000
         DC    BL4'00000000'       RESERVE                              50900000
         DC    BL1'01000000'       APCPSWX                              50920000
         DC    BL1'10000000'       APCPSFN                              50940000
         DC    BL1'01000000'       APCPSRCL                             50960000
         DC    BL1'01000000'       APCPSEML                             50980000
         DC    BL1'00000000'       RESERVED                             51000000
         DC    BL1'00000000'       RESERVED                             51020000
         DC    BL1'00000000'       RESERVED                             51040000
**                       DEFINE APAL CONSTANTS                       ** 51060000
         DC    01XL48'00'          APAL                                 51080000
         ORG   *-48                                                     51100000
         DC    XL4'00000000'       APALUSER                             51120000
         DC    H'28'               APALCISZ                             51140000
         DC    XL2'0000'           RESERVED                             51160000
         DC    XL1'34'             APALSTAT                             51180000
         DC    XL3'000000'         RESERVED                             51200000
         DC    XL1'87'             APALYFSW                             51220000
         DC    XL1'80'             APALYVS                              51240000
         DC    XL1'80'             APALYCT                              51260000
         DC    XL1'80'             APALYDL                              51280000
         DC    XL1'80'             APALYFMT                             51300000
         DC    XL5'0000000000'     RESERVED                             51320000
         DC    H'0000'             APALYCNT                             51340000
         DC    XL1'8D'             APALXFSW                             51360000
         DC    XL1'80'             APALXVS                              51380000
         DC    XL1'00'             APALXCT                              51400000
         DC    XL1'80'             APALXDL                              51420000
         DC    XL1'80'             APALXFMT                             51440000
         DC    XL5'0000000000'     RESERVED                             51460000
         DC    H'0000'             APALXCNT                             51480000
         DC    XL1'8D'             APALUFSW                             51500000
         DC    XL1'80'             APALUVS                              51520000
         DC    XL1'00'             APALUCT                              51540000
         DC    XL1'40'             APALUDL                              51560000
         DC    XL1'80'             APALUFMT                             51580000
         DC    XL5'0000000000'     RESERVED                             51600000
         DC    H'0000'             APALUCNT                             51620000
         ORG   ,                                                        51640000
         EJECT                                                          51660000
*********************************************************************** 51680000
*                                                                     * 51700000
*                    APCP/APAL ENTRY FOR SDIV                         * 51720000
*                       'SCALAR DIVIDE'                               * 51740000
*                                                                     * 51760000
*********************************************************************** 51780000
**                       DEFINE APCP CONSTANTS                       ** 51800000
         DC    CL4'SDIV'           APCPAPFN                             51820000
         DC    A(APOPSDIV)         APCPAPOP                             51840000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              51860000
         DC    F'0'                APCPUSRX                             51880000
         DC    H'18'               APCPMAXP                             51900000
         DC    H'04'               APCPMINP                             51920000
         DC    XL4'00000000'       RESERVED                             51940000
         DC    XL8'0000000000000000' RESERVED                           51960000
         DC    00XL16'00'          APCPSWS                              51980000
         DC    BL1'10000000'       APCPSACB                             52000000
         DC    BL1'10000000'       APCPSBLD                             52020000
         DC    BL1'10000000'       APCPSOP                              52040000
         DC    BL1'00000000'       APCPSAR                              52060000
         DC    BL1'00000000'       APCPSIO                              52080000
         DC    BL4'00000000'       RESERVE                              52100000
         DC    BL1'01000000'       APCPSWX                              52120000
         DC    BL1'10000000'       APCPSFN                              52140000
         DC    BL1'01000000'       APCPSRCL                             52160000
         DC    BL1'01000000'       APCPSEML                             52180000
         DC    BL1'00000000'       RESERVED                             52200000
         DC    BL1'00000000'       RESERVED                             52220000
         DC    BL1'00000000'       RESERVED                             52240000
**                       DEFINE APAL CONSTANTS                       ** 52260000
         DC    01XL48'00'          APAL                                 52280000
         ORG   *-48                                                     52300000
         DC    XL4'00000000'       APALUSER                             52320000
         DC    H'28'               APALCISZ                             52340000
         DC    XL2'0000'           RESERVED                             52360000
         DC    XL1'34'             APALSTAT                             52380000
         DC    XL3'000000'         RESERVED                             52400000
         DC    XL1'87'             APALYFSW                             52420000
         DC    XL1'80'             APALYVS                              52440000
         DC    XL1'80'             APALYCT                              52460000
         DC    XL1'80'             APALYDL                              52480000
         DC    XL1'80'             APALYFMT                             52500000
         DC    XL5'0000000000'     RESERVED                             52520000
         DC    H'0000'             APALYCNT                             52540000
         DC    XL1'8D'             APALXFSW                             52560000
         DC    XL1'80'             APALXVS                              52580000
         DC    XL1'00'             APALXCT                              52600000
         DC    XL1'80'             APALXDL                              52620000
         DC    XL1'80'             APALXFMT                             52640000
         DC    XL5'0000000000'     RESERVED                             52660000
         DC    H'0000'             APALXCNT                             52680000
         DC    XL1'8C'             APALUFSW                             52700000
         DC    XL1'80'             APALUVS                              52720000
         DC    XL1'01'             APALUCT                              52740000
         DC    XL1'00'             APALUDL                              52760000
         DC    XL1'80'             APALUFMT                             52780000
         DC    XL5'0000000000'     RESERVED                             52800000
         DC    H'0001'             APALUCNT                             52820000
         ORG   ,                                                        52840000
         EJECT                                                          52860000
*********************************************************************** 52880000
*                                                                     * 52900000
*                    APCP/APAL ENTRY FOR VIP                          * 52920000
*                    'VECTOR INNER PRODUCT'                           * 52940000
*                                                                     * 52960000
*********************************************************************** 52980000
**                       DEFINE APCP CONSTANTS                       ** 53000000
         DC    CL4'VIP '           APCPAPFN                             53020000
         DC    A(APOPVIP)          APCPAPOP                             53040000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              53060000
         DC    F'0'                APCPUSRX                             53080000
         DC    H'18'               APCPMAXP                             53100000
         DC    H'04'               APCPMINP                             53120000
         DC    XL4'00000000'       RESERVED                             53140000
         DC    XL8'0000000000000000' RESERVED                           53160000
         DC    00XL16'00'          APCPSWS                              53180000
         DC    BL1'10000000'       APCPSACB                             53200000
         DC    BL1'10000000'       APCPSBLD                             53220000
         DC    BL1'10000000'       APCPSOP                              53240000
         DC    BL1'00000000'       APCPSAR                              53260000
         DC    BL1'00000000'       APCPSIO                              53280000
         DC    BL4'00000000'       RESERVE                              53300000
         DC    BL1'01000000'       APCPSWX                              53320000
         DC    BL1'10000000'       APCPSFN                              53340000
         DC    BL1'01000000'       APCPSRCL                             53360000
         DC    BL1'01000000'       APCPSEML                             53380000
         DC    BL1'00000000'       RESERVED                             53400000
         DC    BL1'00000000'       RESERVED                             53420000
         DC    BL1'00000000'       RESERVED                             53440000
**                       DEFINE APAL CONSTANTS                       ** 53460000
         DC    01XL48'00'          APAL                                 53480000
         ORG   *-48                                                     53500000
         DC    XL4'00000000'       APALUSER                             53520000
         DC    H'28'               APALCISZ                             53540000
         DC    XL2'0000'           RESERVED                             53560000
         DC    XL1'70'             APALSTAT                             53580000
         DC    XL3'000000'         RESERVED                             53600000
         DC    XL1'84'             APALYFSW                             53620000
         DC    XL1'80'             APALYVS                              53640000
         DC    XL1'01'             APALYCT                              53660000
         DC    XL1'00'             APALYDL                              53680000
         DC    XL1'80'             APALYFMT                             53700000
         DC    XL5'0000000000'     RESERVED                             53720000
         DC    H'0001'             APALYCNT                             53740000
         DC    XL1'8F'             APALXFSW                             53760000
         DC    XL1'80'             APALXVS                              53780000
         DC    XL1'80'             APALXCT                              53800000
         DC    XL1'40'             APALXDL                              53820000
         DC    XL1'80'             APALXFMT                             53840000
         DC    XL5'0000000000'     RESERVED                             53860000
         DC    H'0000'             APALXCNT                             53880000
         DC    XL1'8D'             APALUFSW                             53900000
         DC    XL1'40'             APALUVS                              53920000
         DC    XL1'00'             APALUCT                              53940000
         DC    XL1'40'             APALUDL                              53960000
         DC    XL1'40'             APALUFMT                             53980000
         DC    XL5'0000000000'     RESERVED                             54000000
         DC    H'0000'             APALUCNT                             54020000
         ORG   ,                                                        54040000
         EJECT                                                          54060000
*********************************************************************** 54080000
*                                                                     * 54100000
*                    APCP/APAL ENTRY FOR MAX                          * 54120000
*                      'SCAN FOR MAXIMUM'                             * 54140000
*                                                                     * 54160000
*********************************************************************** 54180000
**                       DEFINE APCP CONSTANTS                       ** 54200000
         DC    CL4'MAX '           APCPAPFN                             54220000
         DC    A(APOPMAX)          APCPAPOP                             54240000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              54260000
         DC    F'0'                APCPUSRX                             54280000
         DC    H'13'               APCPMAXP                             54300000
         DC    H'04'               APCPMINP                             54320000
         DC    XL4'00000000'       RESERVED                             54340000
         DC    XL8'0000000000000000' RESERVED                           54360000
         DC    00XL16'00'          APCPSWS                              54380000
         DC    BL1'10000000'       APCPSACB                             54400000
         DC    BL1'10000000'       APCPSBLD                             54420000
         DC    BL1'10000000'       APCPSOP                              54440000
         DC    BL1'00000000'       APCPSAR                              54460000
         DC    BL1'00000000'       APCPSIO                              54480000
         DC    BL4'00000000'       RESERVE                              54500000
         DC    BL1'01000000'       APCPSWX                              54520000
         DC    BL1'10000000'       APCPSFN                              54540000
         DC    BL1'01000000'       APCPSRCL                             54560000
         DC    BL1'01000000'       APCPSEML                             54580000
         DC    BL1'00000000'       RESERVED                             54600000
         DC    BL1'00000000'       RESERVED                             54620000
         DC    BL1'00000000'       RESERVED                             54640000
**                       DEFINE APAL CONSTANTS                       ** 54660000
         DC    01XL48'00'          APAL                                 54680000
         ORG   *-48                                                     54700000
         DC    XL4'00000000'       APALUSER                             54720000
         DC    H'20'               APALCISZ                             54740000
         DC    XL2'0000'           RESERVED                             54760000
         DC    XL1'00'             APALSTAT                             54780000
         DC    XL3'000000'         RESERVED                             54800000
         DC    XL1'84'             APALYFSW                             54820000
         DC    XL1'80'             APALYVS                              54840000
         DC    XL1'01'             APALYCT                              54860000
         DC    XL1'00'             APALYDL                              54880000
         DC    XL1'80'             APALYFMT                             54900000
         DC    XL5'0000000000'     RESERVED                             54920000
         DC    H'0002'             APALYCNT                             54940000
         DC    XL1'8F'             APALXFSW                             54960000
         DC    XL1'80'             APALXVS                              54980000
         DC    XL1'80'             APALXCT                              55000000
         DC    XL1'40'             APALXDL                              55020000
         DC    XL1'80'             APALXFMT                             55040000
         DC    XL5'0000000000'     RESERVED                             55060000
         DC    H'0000'             APALXCNT                             55080000
         DC    XL1'00'             APALUFSW                             55100000
         DC    XL1'00'             APALUVS                              55120000
         DC    XL1'00'             APALUCT                              55140000
         DC    XL1'00'             APALUDL                              55160000
         DC    XL1'00'             APALUFMT                             55180000
         DC    XL5'0000000000'     RESERVED                             55200000
         DC    H'0000'             APALUCNT                             55220000
         ORG   ,                                                        55240000
         EJECT                                                          55260000
*********************************************************************** 55280000
*                                                                     * 55300000
*                    APCP/APAL ENTRY FOR SQRT                         * 55320000
*                          'SQUARE ROOT'                              * 55340000
*                                                                     * 55360000
*********************************************************************** 55380000
**                       DEFINE APCP CONSTANTS                       ** 55400000
         DC    CL4'SQRT'           APCPAPFN                             55420000
         DC    A(APOPSQRT)         APCPAPOP                             55440000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              55460000
         DC    F'0'                APCPUSRX                             55480000
         DC    H'15'               APCPMAXP                             55500000
         DC    H'04'               APCPMINP                             55520000
         DC    XL4'00000000'       RESERVED                             55540000
         DC    XL8'0000000000000000' RESERVED                           55560000
         DC    00XL16'00'          APCPSWS                              55580000
         DC    BL1'10000000'       APCPSACB                             55600000
         DC    BL1'10000000'       APCPSBLD                             55620000
         DC    BL1'10000000'       APCPSOP                              55640000
         DC    BL1'00000000'       APCPSAR                              55660000
         DC    BL1'00000000'       APCPSIO                              55680000
         DC    BL4'00000000'       RESERVE                              55700000
         DC    BL1'01000000'       APCPSWX                              55720000
         DC    BL1'10000000'       APCPSFN                              55740000
         DC    BL1'01000000'       APCPSRCL                             55760000
         DC    BL1'01000000'       APCPSEML                             55780000
         DC    BL1'00000000'       RESERVED                             55800000
         DC    BL1'00000000'       RESERVED                             55820000
         DC    BL1'00000000'       RESERVED                             55840000
**                       DEFINE APAL CONSTANTS                       ** 55860000
         DC    01XL48'00'          APAL                                 55880000
         ORG   *-48                                                     55900000
         DC    XL4'00000000'       APALUSER                             55920000
         DC    H'20'               APALCISZ                             55940000
         DC    XL2'0000'           RESERVED                             55960000
         DC    XL1'14'             APALSTAT                             55980000
         DC    XL3'000000'         RESERVED                             56000000
         DC    XL1'87'             APALYFSW                             56020000
         DC    XL1'80'             APALYVS                              56040000
         DC    XL1'80'             APALYCT                              56060000
         DC    XL1'80'             APALYDL                              56080000
         DC    XL1'80'             APALYFMT                             56100000
         DC    XL5'0000000000'     RESERVED                             56120000
         DC    H'0000'             APALYCNT                             56140000
         DC    XL1'8D'             APALXFSW                             56160000
         DC    XL1'80'             APALXVS                              56180000
         DC    XL1'00'             APALXCT                              56200000
         DC    XL1'40'             APALXDL                              56220000
         DC    XL1'80'             APALXFMT                             56240000
         DC    XL5'0000000000'     RESERVED                             56260000
         DC    H'0000'             APALXCNT                             56280000
         DC    XL1'00'             APALUFSW                             56300000
         DC    XL1'00'             APALUVS                              56320000
         DC    XL1'00'             APALUCT                              56340000
         DC    XL1'00'             APALUDL                              56360000
         DC    XL1'00'             APALUFMT                             56380000
         DC    XL5'0000000000'     RESERVED                             56400000
         DC    H'0000'             APALUCNT                             56420000
         ORG   ,                                                        56440000
         EJECT                                                          56460000
*********************************************************************** 56480000
*                                                                     * 56500000
*                    APCP/APAL ENTRY FOR LIM                          * 56520000
*                             'LIMIT'                                 * 56540000
*                                                                     * 56560000
*********************************************************************** 56580000
**                       DEFINE APCP CONSTANTS                       ** 56600000
         DC    CL4'LIM '           APCPAPFN                             56620000
         DC    A(APOPLIM)          APCPAPOP                             56640000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              56660000
         DC    F'0'                APCPUSRX                             56680000
         DC    H'18'               APCPMAXP                             56700000
         DC    H'04'               APCPMINP                             56720000
         DC    XL4'00000000'       RESERVED                             56740000
         DC    XL8'0000000000000000' RESERVED                           56760000
         DC    00XL16'00'          APCPSWS                              56780000
         DC    BL1'10000000'       APCPSACB                             56800000
         DC    BL1'10000000'       APCPSBLD                             56820000
         DC    BL1'10000000'       APCPSOP                              56840000
         DC    BL1'00000000'       APCPSAR                              56860000
         DC    BL1'00000000'       APCPSIO                              56880000
         DC    BL4'00000000'       RESERVE                              56900000
         DC    BL1'01000000'       APCPSWX                              56920000
         DC    BL1'10000000'       APCPSFN                              56940000
         DC    BL1'01000000'       APCPSRCL                             56960000
         DC    BL1'01000000'       APCPSEML                             56980000
         DC    BL1'00000000'       RESERVED                             57000000
         DC    BL1'00000000'       RESERVED                             57020000
         DC    BL1'00000000'       RESERVED                             57040000
**                       DEFINE APAL CONSTANTS                       ** 57060000
         DC    01XL48'00'          APAL                                 57080000
         ORG   *-48                                                     57100000
         DC    XL4'00000000'       APALUSER                             57120000
         DC    H'28'               APALCISZ                             57140000
         DC    XL2'0000'           RESERVED                             57160000
         DC    XL1'00'             APALSTAT                             57180000
         DC    XL3'000000'         RESERVED                             57200000
         DC    XL1'87'             APALYFSW                             57220000
         DC    XL1'80'             APALYVS                              57240000
         DC    XL1'80'             APALYCT                              57260000
         DC    XL1'80'             APALYDL                              57280000
         DC    XL1'80'             APALYFMT                             57300000
         DC    XL5'0000000000'     RESERVED                             57320000
         DC    H'0000'             APALYCNT                             57340000
         DC    XL1'8D'             APALXFSW                             57360000
         DC    XL1'80'             APALXVS                              57380000
         DC    XL1'00'             APALXCT                              57400000
         DC    XL1'80'             APALXDL                              57420000
         DC    XL1'80'             APALXFMT                             57440000
         DC    XL5'0000000000'     RESERVED                             57460000
         DC    H'0000'             APALXCNT                             57480000
         DC    XL1'84'             APALUFSW                             57500000
         DC    XL1'80'             APALUVS                              57520000
         DC    XL1'01'             APALUCT                              57540000
         DC    XL1'00'             APALUDL                              57560000
         DC    XL1'80'             APALUFMT                             57580000
         DC    XL5'0000000000'     RESERVED                             57600000
         DC    H'0002'             APALUCNT                             57620000
         ORG   ,                                                        57640000
         EJECT                                                          57660000
*********************************************************************** 57680000
*                                                                     * 57700000
*                    APCP/APAL ENTRY FOR WLEV                         * 57720000
*                    'WIENER-LEVINSON FILTER'                         * 57740000
*                                                                     * 57760000
*********************************************************************** 57780000
**                       DEFINE APCP CONSTANTS                       ** 57800000
         DC    CL4'WLEV'           APCPAPFN                             57820000
         DC    A(APOPWLEV)         APCPAPOP                             57830000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              57860000
         DC    F'0'                APCPUSRX                             57880000
         DC    H'18'               APCPMAXP                             57900000
         DC    H'04'               APCPMINP                             57920000
         DC    XL4'00000000'       RESERVED                             57940000
         DC    XL8'0000000000000000' RESERVED                           57960000
         DC    00XL16'00'          APCPSWS                              57980000
         DC    BL1'10000000'       APCPSACB                             58000000
         DC    BL1'10000000'       APCPSBLD                             58020000
         DC    BL1'10000000'       APCPSOP                              58040000
         DC    BL1'00000000'       APCPSAR                              58060000
         DC    BL1'00000000'       APCPSIO                              58080000
         DC    BL4'00000000'       RESERVE                              58100000
         DC    BL1'01000000'       APCPSWX                              58120000
         DC    BL1'10000000'       APCPSFN                              58140000
         DC    BL1'01000000'       APCPSRCL                             58160000
         DC    BL1'01000000'       APCPSEML                             58180000
         DC    BL1'00000000'       RESERVED                             58200000
         DC    BL1'00000000'       RESERVED                             58220000
         DC    BL1'00000000'       RESERVED                             58240000
**                       DEFINE APAL CONSTANTS                       ** 58260000
         DC    01XL48'00'          APAL                                 58280000
         ORG   *-48                                                     58300000
         DC    XL4'00000000'       APALUSER                             58320000
         DC    H'28'               APALCISZ                             58340000
         DC    XL2'0000'           RESERVED                             58360000
         DC    XL1'34'             APALSTAT                             58380000
         DC    XL3'000000'         RESERVED                             58400000
         DC    XL1'86'             APALYFSW                             58420000
         DC    XL1'80'             APALYVS                              58440000
         DC    XL1'80'             APALYCT                              58460000
         DC    XL1'00'             APALYDL                              58480000
         DC    XL1'80'             APALYFMT                             58500000
         DC    XL5'0000000000'     RESERVED                             58520000
         DC    H'0000'             APALYCNT                             58540000
         DC    XL1'85'             APALXFSW                             58560000
         DC    XL1'80'             APALXVS                              58580000
         DC    XL1'00'             APALXCT                              58600000
         DC    XL1'80'             APALXDL                              58620000
         DC    XL1'80'             APALXFMT                             58640000
         DC    XL5'0000000000'     RESERVED                             58660000
         DC    H'0000'             APALXCNT                             58680000
         DC    XL1'85'             APALUFSW                             58700000
         DC    XL1'80'             APALUVS                              58720000
         DC    XL1'00'             APALUCT                              58740000
         DC    XL1'40'             APALUDL                              58760000
         DC    XL1'80'             APALUFMT                             58780000
         DC    XL5'0000000000'     RESERVED                             58800000
         DC    H'0000'             APALUCNT                             58820000
         ORG   ,                                                        58840000
         EJECT                                                          58860000
*********************************************************************** 58880000
*                                                                     * 58900000
*                    APCP/APAL ENTRY FOR XMVX                         * 58920000
*                   'MOVE BULK STORE TO INDEX'                        * 58940000
*                                                                     * 58960000
*********************************************************************** 58980000
**                       DEFINE APCP CONSTANTS                       ** 59000000
         DC    CL4'XMVX'           APCPAPFN                             59020000
         DC    A(APOPXMVX)         APCPAPOP                             59040000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              59060000
         DC    F'0'                APCPUSRX                             59080000
         DC    H'06'               APCPMAXP                             59100000
         DC    H'06'               APCPMINP                             59110000
         DC    XL4'00000000'       RESERVED                             59140000
         DC    XL8'0000000000000000' RESERVED                           59160000
         DC    00XL16'00'          APCPSWS                              59180000
         DC    BL1'10000000'       APCPSACB                             59200000
         DC    BL1'10000000'       APCPSBLD                             59220000
         DC    BL1'10000000'       APCPSOP                              59240000
         DC    BL1'00000000'       APCPSAR                              59260000
         DC    BL1'00000000'       APCPSIO                              59280000
         DC    BL4'00000000'       RESERVE                              59300000
         DC    BL1'01000000'       APCPSWX                              59320000
         DC    BL1'10000000'       APCPSFN                              59340000
         DC    BL1'01000000'       APCPSRCL                             59360000
         DC    BL1'01000000'       APCPSEML                             59380000
         DC    BL1'00000000'       RESERVED                             59400000
         DC    BL1'00000000'       RESERVED                             59420000
         DC    BL1'00000000'       RESERVED                             59440000
**                       DEFINE APAL CONSTANTS                       ** 59460000
         DC    01XL48'00'          APAL                                 59480000
         ORG   *-48                                                     59500000
         DC    XL4'00000000'       APALUSER                             59520000
         DC    H'08'               APALCISZ                             59540000
         DC    XL2'0000'           RESERVED                             59560000
         DC    H'01'               APALLTYP                             59580000
         DC    XL1'00'             APALLI1F                             59600000
         DC    XL1'00'             APALLI2F                             59610000
         DC    XL4'00'             RESERVED                             59640000
         ORG   ,                                                        59660000
         EJECT                                                          59680000
*********************************************************************** 59700000
*                                                                     * 59720000
*                    APCP/APAL ENTRY FOR XMVS                         * 59740000
*                   'MOVE INDEX TO BULK STORE'                        * 59760000
*                                                                     * 59780000
*********************************************************************** 59800000
**                       DEFINE APCP CONSTANTS                       ** 59820000
         DC    CL4'XMVS'           APCPAPFN                             59840000
         DC    A(APOPXMVS)         APCPAPOP                             59860000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              59880000
         DC    F'0'                APCPUSRX                             59900000
         DC    H'06'               APCPMAXP                             59920000
         DC    H'06'               APCPMINP                             59930000
         DC    XL4'00000000'       RESERVED                             59960000
         DC    XL8'0000000000000000' RESERVED                           59980000
         DC    00XL16'00'          APCPSWS                              60000000
         DC    BL1'10000000'       APCPSACB                             60020000
         DC    BL1'10000000'       APCPSBLD                             60040000
         DC    BL1'10000000'       APCPSOP                              60060000
         DC    BL1'00000000'       APCPSAR                              60080000
         DC    BL1'00000000'       APCPSIO                              60100000
         DC    BL4'00000000'       RESERVE                              60120000
         DC    BL1'01000000'       APCPSWX                              60140000
         DC    BL1'10000000'       APCPSFN                              60160000
         DC    BL1'01000000'       APCPSRCL                             60180000
         DC    BL1'01000000'       APCPSEML                             60200000
         DC    BL1'00000000'       RESERVED                             60220000
         DC    BL1'00000000'       RESERVED                             60240000
         DC    BL1'00000000'       RESERVED                             60260000
**                       DEFINE APAL CONSTANTS                       ** 60280000
         DC    01XL48'00'          APAL                                 60300000
         ORG   *-48                                                     60320000
         DC    XL4'00000000'       APALUSER                             60340000
         DC    H'08'               APALCISZ                             60360000
         DC    XL2'0000'           RESERVED                             60380000
         DC    H'01'               APALLTYP                             60400000
         DC    XL1'00'             APALLI1F                             60420000
         DC    XL1'00'             APALLI2F                             60430000
         DC    XL4'00'             RESERVED                             60460000
         ORG   ,                                                        60480000
         EJECT                                                          60500000
*********************************************************************** 60520000
*                                                                     * 60540000
*                    APCP/APAL ENTRY FOR XMV                          * 60560000
*                     'MOVE INDEX TO INDEX'                           * 60580000
*                                                                     * 60600000
*********************************************************************** 60620000
**                       DEFINE APCP CONSTANTS                       ** 60640000
         DC    CL4'XMV '           APCPAPFN                             60660000
         DC    A(APOPXMV)          APCPAPOP                             60680000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              60700000
         DC    F'0'                APCPUSRX                             60720000
         DC    H'04'               APCPMAXP                             60740000
         DC    H'04'               APCPMINP                             60760000
         DC    XL4'00000000'       RESERVED                             60780000
         DC    XL8'0000000000000000' RESERVED                           60800000
         DC    00XL16'00'          APCPSWS                              60820000
         DC    BL1'10000000'       APCPSACB                             60840000
         DC    BL1'10000000'       APCPSBLD                             60860000
         DC    BL1'10000000'       APCPSOP                              60880000
         DC    BL1'00000000'       APCPSAR                              60900000
         DC    BL1'00000000'       APCPSIO                              60920000
         DC    BL4'00000000'       RESERVE                              60940000
         DC    BL1'01000000'       APCPSWX                              60960000
         DC    BL1'10000000'       APCPSFN                              60980000
         DC    BL1'01000000'       APCPSRCL                             61000000
         DC    BL1'01000000'       APCPSEML                             61020000
         DC    BL1'00000000'       RESERVED                             61040000
         DC    BL1'00000000'       RESERVED                             61060000
         DC    BL1'00000000'       RESERVED                             61080000
**                       DEFINE APAL CONSTANTS                       ** 61100000
         DC    01XL48'00'          APAL                                 61120000
         ORG   *-48                                                     61140000
         DC    XL4'00000000'       APALUSER                             61160000
         DC    H'04'               APALCISZ                             61180000
         DC    XL2'0000'           RESERVED                             61200000
         DC    H'02'               APALLTYP                             61220000
         DC    XL1'80'             APALLI1F                             61240000
         DC    XL1'80'             APALLI2F                             61260000
         DC    XL4'00'             RESERVED                             61280000
         ORG   ,                                                        61300000
         EJECT                                                          61320000
*********************************************************************** 61340000
*                                                                     * 61360000
*                    APCP/APAL ENTRY FOR XMVI                         * 61380000
*                   'MOVE IMMEDIATE TO INDEX'                         * 61400000
*                                                                     * 61420000
*********************************************************************** 61440000
**                       DEFINE APCP CONSTANTS                       ** 61460000
         DC    CL4'XMVI'           APCPAPFN                             61480000
         DC    A(APOPXMVI)         APCPAPOP                             61500000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              61520000
         DC    F'0'                APCPUSRX                             61540000
         DC    H'04'               APCPMAXP                             61560000
         DC    H'04'               APCPMINP                             61580000
         DC    XL4'00000000'       RESERVED                             61600000
         DC    XL8'0000000000000000' RESERVED                           61620000
         DC    00XL16'00'          APCPSWS                              61640000
         DC    BL1'10000000'       APCPSACB                             61660000
         DC    BL1'10000000'       APCPSBLD                             61680000
         DC    BL1'10000000'       APCPSOP                              61700000
         DC    BL1'00000000'       APCPSAR                              61720000
         DC    BL1'00000000'       APCPSIO                              61740000
         DC    BL4'00000000'       RESERVE                              61760000
         DC    BL1'01000000'       APCPSWX                              61780000
         DC    BL1'10000000'       APCPSFN                              61800000
         DC    BL1'01000000'       APCPSRCL                             61820000
         DC    BL1'01000000'       APCPSEML                             61840000
         DC    BL1'00000000'       RESERVED                             61860000
         DC    BL1'00000000'       RESERVED                             61880000
         DC    BL1'00000000'       RESERVED                             61900000
**                       DEFINE APAL CONSTANTS                       ** 61920000
         DC    01XL48'00'          APAL                                 61940000
         ORG   *-48                                                     61960000
         DC    XL4'00000000'       APALUSER                             61980000
         DC    H'06'               APALCISZ                             62000000
         DC    XL2'0000'           RESERVED                             62020000
         DC    H'03'               APALLTYP                             62040000
         DC    XL1'80'             APALLI1F                             62060000
         DC    XL1'40'             APALLI2F                             62080000
         DC    XL4'00'             RESERVED                             62100000
         ORG   ,                                                        62120000
         EJECT                                                          62140000
*********************************************************************** 62160000
*                                                                     * 62180000
*                    APCP/APAL ENTRY FOR XAD                          * 62200000
*                     'ADD INDEX TO INDEX'                            * 62220000
*                                                                     * 62240000
*********************************************************************** 62260000
**                       DEFINE APCP CONSTANTS                       ** 62280000
         DC    CL4'XAD '           APCPAPFN                             62300000
         DC    A(APOPXAD)          APCPAPOP                             62320000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              62340000
         DC    F'0'                APCPUSRX                             62360000
         DC    H'04'               APCPMAXP                             62380000
         DC    H'04'               APCPMINP                             62400000
         DC    XL4'00000000'       RESERVED                             62420000
         DC    XL8'0000000000000000' RESERVED                           62440000
         DC    00XL16'00'          APCPSWS                              62460000
         DC    BL1'10000000'       APCPSACB                             62480000
         DC    BL1'10000000'       APCPSBLD                             62500000
         DC    BL1'10000000'       APCPSOP                              62520000
         DC    BL1'00000000'       APCPSAR                              62540000
         DC    BL1'00000000'       APCPSIO                              62560000
         DC    BL4'00000000'       RESERVE                              62580000
         DC    BL1'01000000'       APCPSWX                              62600000
         DC    BL1'10000000'       APCPSFN                              62620000
         DC    BL1'01000000'       APCPSRCL                             62640000
         DC    BL1'01000000'       APCPSEML                             62660000
         DC    BL1'00000000'       RESERVED                             62680000
         DC    BL1'00000000'       RESERVED                             62700000
         DC    BL1'00000000'       RESERVED                             62720000
**                       DEFINE APAL CONSTANTS                       ** 62740000
         DC    01XL48'00'          APAL                                 62760000
         ORG   *-48                                                     62780000
         DC    XL4'00000000'       APALUSER                             62800000
         DC    H'04'               APALCISZ                             62820000
         DC    XL2'0000'           RESERVED                             62840000
         DC    H'02'               APALLTYP                             62860000
         DC    XL1'80'             APALLI1F                             62880000
         DC    XL1'80'             APALLI2F                             62900000
         DC    XL4'00'             RESERVED                             62920000
         ORG   ,                                                        62940000
         EJECT                                                          62960000
*********************************************************************** 62980000
*                                                                     * 63000000
*                    APCP/APAL ENTRY FOR XADI                         * 63020000
*                    'ADD IMMEDIATE TO INDEX'                         * 63040000
*                                                                     * 63060000
*********************************************************************** 63080000
**                       DEFINE APCP CONSTANTS                       ** 63100000
         DC    CL4'XADI'           APCPAPFN                             63120000
         DC    A(APOPXADI)         APCPAPOP                             63140000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              63160000
         DC    F'0'                APCPUSRX                             63180000
         DC    H'04'               APCPMAXP                             63200000
         DC    H'04'               APCPMINP                             63220000
         DC    XL4'00000000'       RESERVED                             63240000
         DC    XL8'0000000000000000' RESERVED                           63260000
         DC    00XL16'00'          APCPSWS                              63280000
         DC    BL1'10000000'       APCPSACB                             63300000
         DC    BL1'10000000'       APCPSBLD                             63320000
         DC    BL1'10000000'       APCPSOP                              63340000
         DC    BL1'00000000'       APCPSAR                              63360000
         DC    BL1'00000000'       APCPSIO                              63380000
         DC    BL4'00000000'       RESERVE                              63400000
         DC    BL1'01000000'       APCPSWX                              63420000
         DC    BL1'10000000'       APCPSFN                              63440000
         DC    BL1'01000000'       APCPSRCL                             63460000
         DC    BL1'01000000'       APCPSEML                             63480000
         DC    BL1'00000000'       RESERVED                             63500000
         DC    BL1'00000000'       RESERVED                             63520000
         DC    BL1'00000000'       RESERVED                             63540000
**                       DEFINE APAL CONSTANTS                       ** 63560000
         DC    01XL48'00'          APAL                                 63580000
         ORG   *-48                                                     63600000
         DC    XL4'00000000'       APALUSER                             63620000
         DC    H'06'               APALCISZ                             63640000
         DC    XL2'0000'           RESERVED                             63660000
         DC    H'03'               APALLTYP                             63680000
         DC    XL1'80'             APALLI1F                             63700000
         DC    XL1'40'             APALLI2F                             63720000
         DC    XL4'00'             RESERVED                             63740000
         ORG   ,                                                        63760000
         EJECT                                                          63780000
*********************************************************************** 63800000
*                                                                     * 63820000
*                    APCP/APAL ENTRY FOR XSB                          * 63840000
*                  'SUBTRACT INDEX FROM INDEX'                        * 63860000
*                                                                     * 63880000
*********************************************************************** 63900000
**                       DEFINE APCP CONSTANTS                       ** 63920000
         DC    CL4'XSB '           APCPAPFN                             63940000
         DC    A(APOPXSB)          APCPAPOP                             63960000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              63980000
         DC    F'0'                APCPUSRX                             64000000
         DC    H'04'               APCPMAXP                             64020000
         DC    H'04'               APCPMINP                             64040000
         DC    XL4'00000000'       RESERVED                             64060000
         DC    XL8'0000000000000000' RESERVED                           64080000
         DC    00XL16'00'          APCPSWS                              64100000
         DC    BL1'10000000'       APCPSACB                             64120000
         DC    BL1'10000000'       APCPSBLD                             64140000
         DC    BL1'10000000'       APCPSOP                              64160000
         DC    BL1'00000000'       APCPSAR                              64180000
         DC    BL1'00000000'       APCPSIO                              64200000
         DC    BL4'00000000'       RESERVE                              64220000
         DC    BL1'01000000'       APCPSWX                              64240000
         DC    BL1'10000000'       APCPSFN                              64260000
         DC    BL1'01000000'       APCPSRCL                             64280000
         DC    BL1'01000000'       APCPSEML                             64300000
         DC    BL1'00000000'       RESERVED                             64320000
         DC    BL1'00000000'       RESERVED                             64340000
         DC    BL1'00000000'       RESERVED                             64360000
**                       DEFINE APAL CONSTANTS                       ** 64380000
         DC    01XL48'00'          APAL                                 64400000
         ORG   *-48                                                     64420000
         DC    XL4'00000000'       APALUSER                             64440000
         DC    H'04'               APALCISZ                             64460000
         DC    XL2'0000'           RESERVED                             64480000
         DC    H'02'               APALLTYP                             64500000
         DC    XL1'80'             APALLI1F                             64520000
         DC    XL1'80'             APALLI2F                             64540000
         DC    XL4'00'             RESERVED                             64560000
         ORG   ,                                                        64580000
         EJECT                                                          64600000
*********************************************************************** 64620000
*                                                                     * 64640000
*                    APCP/APAL ENTRY FOR XSBI                         * 64660000
*                'SUBTRACT IMMEDIATE FROM INDEX'                      * 64680000
*                                                                     * 64700000
*********************************************************************** 64720000
**                       DEFINE APCP CONSTANTS                       ** 64740000
         DC    CL4'XSBI'           APCPAPFN                             64760000
         DC    A(APOPXSBI)         APCPAPOP                             64780000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              64800000
         DC    F'0'                APCPUSRX                             64820000
         DC    H'04'               APCPMAXP                             64840000
         DC    H'04'               APCPMINP                             64860000
         DC    XL4'00000000'       RESERVED                             64880000
         DC    XL8'0000000000000000' RESERVED                           64900000
         DC    00XL16'00'          APCPSWS                              64920000
         DC    BL1'10000000'       APCPSACB                             64940000
         DC    BL1'10000000'       APCPSBLD                             64960000
         DC    BL1'10000000'       APCPSOP                              64980000
         DC    BL1'00000000'       APCPSAR                              65000000
         DC    BL1'00000000'       APCPSIO                              65020000
         DC    BL4'00000000'       RESERVE                              65040000
         DC    BL1'01000000'       APCPSWX                              65060000
         DC    BL1'10000000'       APCPSFN                              65080000
         DC    BL1'01000000'       APCPSRCL                             65100000
         DC    BL1'01000000'       APCPSEML                             65120000
         DC    BL1'00000000'       RESERVED                             65140000
         DC    BL1'00000000'       RESERVED                             65160000
         DC    BL1'00000000'       RESERVED                             65180000
**                       DEFINE APAL CONSTANTS                       ** 65200000
         DC    01XL48'00'          APAL                                 65220000
         ORG   *-48                                                     65240000
         DC    XL4'00000000'       APALUSER                             65260000
         DC    H'06'               APALCISZ                             65280000
         DC    XL2'0000'           RESERVED                             65300000
         DC    H'03'               APALLTYP                             65320000
         DC    XL1'80'             APALLI1F                             65340000
         DC    XL1'40'             APALLI2F                             65360000
         DC    XL4'00'             RESERVED                             65380000
         ORG   ,                                                        65400000
         EJECT                                                          65420000
*********************************************************************** 65440000
*                                                                     * 65460000
*                    APCP/APAL ENTRY FOR XML                          * 65480000
*                   'MULTIPLY INDEX BY INDEX'                         * 65500000
*                                                                     * 65520000
*********************************************************************** 65540000
**                       DEFINE APCP CONSTANTS                       ** 65560000
         DC    CL4'XML '           APCPAPFN                             65580000
         DC    A(APOPXML)          APCPAPOP                             65600000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              65620000
         DC    F'0'                APCPUSRX                             65640000
         DC    H'04'               APCPMAXP                             65660000
         DC    H'04'               APCPMINP                             65680000
         DC    XL4'00000000'       RESERVED                             65700000
         DC    XL8'0000000000000000' RESERVED                           65720000
         DC    00XL16'00'          APCPSWS                              65740000
         DC    BL1'10000000'       APCPSACB                             65760000
         DC    BL1'10000000'       APCPSBLD                             65780000
         DC    BL1'10000000'       APCPSOP                              65800000
         DC    BL1'00000000'       APCPSAR                              65820000
         DC    BL1'00000000'       APCPSIO                              65840000
         DC    BL4'00000000'       RESERVE                              65860000
         DC    BL1'01000000'       APCPSWX                              65880000
         DC    BL1'10000000'       APCPSFN                              65900000
         DC    BL1'01000000'       APCPSRCL                             65920000
         DC    BL1'01000000'       APCPSEML                             65940000
         DC    BL1'00000000'       RESERVED                             65960000
         DC    BL1'00000000'       RESERVED                             65980000
         DC    BL1'00000000'       RESERVED                             66000000
**                       DEFINE APAL CONSTANTS                       ** 66020000
         DC    01XL48'00'          APAL                                 66040000
         ORG   *-48                                                     66060000
         DC    XL4'00000000'       APALUSER                             66080000
         DC    H'04'               APALCISZ                             66100000
         DC    XL2'0000'           RESERVED                             66120000
         DC    H'02'               APALLTYP                             66140000
         DC    XL1'80'             APALLI1F                             66160000
         DC    XL1'80'             APALLI2F                             66180000
         DC    XL4'00'             RESERVED                             66200000
         ORG   ,                                                        66220000
         EJECT                                                          66240000
*********************************************************************** 66260000
*                                                                     * 66280000
*                    APCP/APAL ENTRY FOR XMLI                         * 66300000
*                 'MULTIPLY INDEX BY IMMEDIATE'                       * 66320000
*                                                                     * 66340000
*********************************************************************** 66360000
**                       DEFINE APCP CONSTANTS                       ** 66380000
         DC    CL4'XMLI'           APCPAPFN                             66400000
         DC    A(APOPXMLI)         APCPAPOP                             66420000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              66440000
         DC    F'0'                APCPUSRX                             66460000
         DC    H'04'               APCPMAXP                             66480000
         DC    H'04'               APCPMINP                             66500000
         DC    XL4'00000000'       RESERVED                             66520000
         DC    XL8'0000000000000000' RESERVED                           66540000
         DC    00XL16'00'          APCPSWS                              66560000
         DC    BL1'10000000'       APCPSACB                             66580000
         DC    BL1'10000000'       APCPSBLD                             66600000
         DC    BL1'10000000'       APCPSOP                              66620000
         DC    BL1'00000000'       APCPSAR                              66640000
         DC    BL1'00000000'       APCPSIO                              66660000
         DC    BL4'00000000'       RESERVE                              66680000
         DC    BL1'01000000'       APCPSWX                              66700000
         DC    BL1'10000000'       APCPSFN                              66720000
         DC    BL1'01000000'       APCPSRCL                             66740000
         DC    BL1'01000000'       APCPSEML                             66760000
         DC    BL1'00000000'       RESERVED                             66780000
         DC    BL1'00000000'       RESERVED                             66800000
         DC    BL1'00000000'       RESERVED                             66820000
**                       DEFINE APAL CONSTANTS                       ** 66840000
         DC    01XL48'00'          APAL                                 66860000
         ORG   *-48                                                     66880000
         DC    XL4'00000000'       APALUSER                             66900000
         DC    H'06'               APALCISZ                             66920000
         DC    XL2'0000'           RESERVED                             66940000
         DC    H'03'               APALLTYP                             66960000
         DC    XL1'80'             APALLI1F                             66980000
         DC    XL1'40'             APALLI2F                             67000000
         DC    XL4'00'             RESERVED                             67020000
         ORG   ,                                                        67040000
         EJECT                                                          67060000
*********************************************************************** 67080000
*                                                                     * 67100000
*                    APCP/APAL ENTRY FOR XDV                          * 67120000
*                    'DIVIDE INDEX BY INDEX'                          * 67140000
*                                                                     * 67160000
*********************************************************************** 67180000
**                       DEFINE APCP CONSTANTS                       ** 67200000
         DC    CL4'XDV '           APCPAPFN                             67220000
         DC    A(APOPXDV)          APCPAPOP                             67240000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              67260000
         DC    F'0'                APCPUSRX                             67280000
         DC    H'04'               APCPMAXP                             67300000
         DC    H'04'               APCPMINP                             67320000
         DC    XL4'00000000'       RESERVED                             67340000
         DC    XL8'0000000000000000' RESERVED                           67360000
         DC    00XL16'00'          APCPSWS                              67380000
         DC    BL1'10000000'       APCPSACB                             67400000
         DC    BL1'10000000'       APCPSBLD                             67420000
         DC    BL1'10000000'       APCPSOP                              67440000
         DC    BL1'00000000'       APCPSAR                              67460000
         DC    BL1'00000000'       APCPSIO                              67480000
         DC    BL4'00000000'       RESERVE                              67500000
         DC    BL1'01000000'       APCPSWX                              67520000
         DC    BL1'10000000'       APCPSFN                              67540000
         DC    BL1'01000000'       APCPSRCL                             67560000
         DC    BL1'01000000'       APCPSEML                             67580000
         DC    BL1'00000000'       RESERVED                             67600000
         DC    BL1'00000000'       RESERVED                             67620000
         DC    BL1'00000000'       RESERVED                             67640000
**                       DEFINE APAL CONSTANTS                       ** 67660000
         DC    01XL48'00'          APAL                                 67680000
         ORG   *-48                                                     67700000
         DC    XL4'00000000'       APALUSER                             67720000
         DC    H'04'               APALCISZ                             67740000
         DC    XL2'0000'           RESERVED                             67760000
         DC    H'02'               APALLTYP                             67780000
         DC    XL1'80'             APALLI1F                             67800000
         DC    XL1'80'             APALLI2F                             67820000
         DC    XL4'00'             RESERVED                             67840000
         ORG   ,                                                        67860000
         EJECT                                                          67880000
*********************************************************************** 67900000
*                                                                     * 67920000
*                    APCP/APAL ENTRY FOR XDVI                         * 67940000
*                  'DIVIDE INDEX BY IMMEDIATE'                        * 67960000
*                                                                     * 67980000
*********************************************************************** 68000000
**                       DEFINE APCP CONSTANTS                       ** 68020000
         DC    CL4'XDVI'           APCPAPFN                             68040000
         DC    A(APOPXDVI)         APCPAPOP                             68060000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              68080000
         DC    F'0'                APCPUSRX                             68100000
         DC    H'04'               APCPMAXP                             68120000
         DC    H'04'               APCPMINP                             68140000
         DC    XL4'00000000'       RESERVED                             68160000
         DC    XL8'0000000000000000' RESERVED                           68180000
         DC    00XL16'00'          APCPSWS                              68200000
         DC    BL1'10000000'       APCPSACB                             68220000
         DC    BL1'10000000'       APCPSBLD                             68240000
         DC    BL1'10000000'       APCPSOP                              68260000
         DC    BL1'00000000'       APCPSAR                              68280000
         DC    BL1'00000000'       APCPSIO                              68300000
         DC    BL4'00000000'       RESERVE                              68320000
         DC    BL1'01000000'       APCPSWX                              68340000
         DC    BL1'10000000'       APCPSFN                              68360000
         DC    BL1'01000000'       APCPSRCL                             68380000
         DC    BL1'01000000'       APCPSEML                             68400000
         DC    BL1'00000000'       RESERVED                             68420000
         DC    BL1'00000000'       RESERVED                             68440000
         DC    BL1'00000000'       RESERVED                             68460000
**                       DEFINE APAL CONSTANTS                       ** 68480000
         DC    01XL48'00'          APAL                                 68500000
         ORG   *-48                                                     68520000
         DC    XL4'00000000'       APALUSER                             68540000
         DC    H'06'               APALCISZ                             68560000
         DC    XL2'0000'           RESERVED                             68580000
         DC    H'03'               APALLTYP                             68600000
         DC    XL1'80'             APALLI1F                             68620000
         DC    XL1'40'             APALLI2F                             68640000
         DC    XL4'00'             RESERVED                             68660000
         ORG   ,                                                        68680000
         EJECT                                                          68700000
*********************************************************************** 68720000
*                                                                     * 68740000
*                    APCP/APAL ENTRY FOR XDIR                         * 68760000
*                  'DIVIDE IMMEDIATE BY INDEX'                        * 68780000
*                                                                     * 68800000
*********************************************************************** 68820000
**                       DEFINE APCP CONSTANTS                       ** 68840000
         DC    CL4'XDIR'           APCPAPFN                             68860000
         DC    A(APOPXDIR)         APCPAPOP                             68880000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              68900000
         DC    F'0'                APCPUSRX                             68920000
         DC    H'04'               APCPMAXP                             68940000
         DC    H'04'               APCPMINP                             68960000
         DC    XL4'00000000'       RESERVED                             68980000
         DC    XL8'0000000000000000' RESERVED                           69000000
         DC    00XL16'00'          APCPSWS                              69020000
         DC    BL1'10000000'       APCPSACB                             69040000
         DC    BL1'10000000'       APCPSBLD                             69060000
         DC    BL1'10000000'       APCPSOP                              69080000
         DC    BL1'00000000'       APCPSAR                              69100000
         DC    BL1'00000000'       APCPSIO                              69120000
         DC    BL4'00000000'       RESERVE                              69140000
         DC    BL1'01000000'       APCPSWX                              69160000
         DC    BL1'10000000'       APCPSFN                              69180000
         DC    BL1'01000000'       APCPSRCL                             69200000
         DC    BL1'01000000'       APCPSEML                             69220000
         DC    BL1'00000000'       RESERVED                             69240000
         DC    BL1'00000000'       RESERVED                             69260000
         DC    BL1'00000000'       RESERVED                             69280000
**                       DEFINE APAL CONSTANTS                       ** 69300000
         DC    01XL48'00'          APAL                                 69320000
         ORG   *-48                                                     69340000
         DC    XL4'00000000'       APALUSER                             69360000
         DC    H'06'               APALCISZ                             69380000
         DC    XL2'0000'           RESERVED                             69400000
         DC    H'03'               APALLTYP                             69420000
         DC    XL1'80'             APALLI1F                             69440000
         DC    XL1'40'             APALLI2F                             69460000
         DC    XL4'00'             RESERVED                             69480000
         ORG   ,                                                        69500000
         EJECT                                                          69520000
*********************************************************************** 69540000
*                                                                     * 69560000
*                    APCP/APAL ENTRY FOR XID                          * 69580000
*                      'LABEL DEFINITION'                             * 69600000
*                                                                     * 69620000
*********************************************************************** 69640000
**                       DEFINE APCP CONSTANTS                       ** 69660000
         DC    CL4'XID '           APCPAPFN                             69680000
         DC    A(APOPXID)          APCPAPOP                             69700000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              69720000
         DC    F'0'                APCPUSRX                             69740000
         DC    H'03'               APCPMAXP                             69760000
         DC    H'03'               APCPMINP                             69780000
         DC    XL4'00000000'       RESERVED                             69800000
         DC    XL8'0000000000000000' RESERVED                           69820000
         DC    00XL16'00'          APCPSWS                              69840000
         DC    BL1'10000000'       APCPSACB                             69860000
         DC    BL1'10000000'       APCPSBLD                             69880000
         DC    BL1'10000000'       APCPSOP                              69900000
         DC    BL1'00000000'       APCPSAR                              69920000
         DC    BL1'00000000'       APCPSIO                              69940000
         DC    BL4'00000000'       RESERVE                              69960000
         DC    BL1'01000000'       APCPSWX                              69980000
         DC    BL1'10010000'       APCPSFN                              70000000
         DC    BL1'01000000'       APCPSRCL                             70020000
         DC    BL1'01000000'       APCPSEML                             70040000
         DC    BL1'00000000'       RESERVED                             70060000
         DC    BL1'00000000'       RESERVED                             70080000
         DC    BL1'00000000'       RESERVED                             70100000
**                       DEFINE APAL CONSTANTS                       ** 70120000
** NOTE: ALTHOUGH A VPSS FUNCTION ONLY, APAL CONSTANTS ARE DEFINED   ** 70140000
**       TO PROVIDE AN INDEX OPERATION TYPE FOR MODULE IGTMFA.       ** 70160000
         DC    01XL48'00'          APAL                                 70180000
         ORG   *-48                                                     70200000
         DC    XL4'00000000'       APALUSER                             70220000
         DC    H'00'               APALCISZ                             70240000
         DC    XL2'0000'           RESERVED                             70260000
         DC    H'07'               APALLTYP                             70280000
         DC    XL1'00'             APALLI1F                             70300000
         DC    XL1'00'             APALLI2F                             70320000
         DC    XL4'00'             RESERVED                             70340000
         ORG   ,                                                        70360000
         EJECT                                                          70380000
*********************************************************************** 70400000
*                                                                     * 70420000
*                    APCP/APAL ENTRY FOR XC                           * 70440000
*                    'COMPARE INDEX:INDEX'                            * 70460000
*                                                                     * 70480000
*********************************************************************** 70500000
**                       DEFINE APCP CONSTANTS                       ** 70520000
         DC    CL4'XC  '           APCPAPFN                             70540000
         DC    A(APOPXC)           APCPAPOP                             70560000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              70580000
         DC    F'0'                APCPUSRX                             70600000
         DC    H'06'               APCPMAXP                             70620000
         DC    H'06'               APCPMINP                             70640000
         DC    XL4'00000000'       RESERVED                             70660000
         DC    XL8'0000000000000000' RESERVED                           70680000
         DC    00XL16'00'          APCPSWS                              70700000
         DC    BL1'10000000'       APCPSACB                             70720000
         DC    BL1'10000000'       APCPSBLD                             70740000
         DC    BL1'10000000'       APCPSOP                              70760000
         DC    BL1'00000000'       APCPSAR                              70780000
         DC    BL1'00000000'       APCPSIO                              70800000
         DC    BL4'00000000'       RESERVE                              70820000
         DC    BL1'01000000'       APCPSWX                              70840000
         DC    BL1'10000000'       APCPSFN                              70860000
         DC    BL1'01000000'       APCPSRCL                             70880000
         DC    BL1'01000000'       APCPSEML                             70900000
         DC    BL1'00000000'       RESERVED                             70920000
         DC    BL1'00000000'       RESERVED                             70940000
         DC    BL1'00000000'       RESERVED                             70960000
**                       DEFINE APAL CONSTANTS                       ** 70980000
         DC    01XL48'00'          APAL                                 71000000
         ORG   *-48                                                     71020000
         DC    XL4'00000000'       APALUSER                             71040000
         DC    H'08'               APALCISZ                             71060000
         DC    XL2'0000'           RESERVED                             71080000
         DC    H'04'               APALLTYP                             71100000
         DC    XL1'80'             APALLI1F                             71120000
         DC    XL1'80'             APALLI2F                             71140000
         DC    XL4'00'             RESERVED                             71160000
         ORG   ,                                                        71180000
         EJECT                                                          71200000
*********************************************************************** 71220000
*                                                                     * 71240000
*                    APCP/APAL ENTRY FOR XCI                          * 71260000
*                   'COMPARE INDEX:IMMEDIATE'                         * 71280000
*                                                                     * 71300000
*********************************************************************** 71320000
**                       DEFINE APCP CONSTANTS                       ** 71340000
         DC    CL4'XCI '           APCPAPFN                             71360000
         DC    A(APOPXCI)          APCPAPOP                             71380000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              71400000
         DC    F'0'                APCPUSRX                             71420000
         DC    H'06'               APCPMAXP                             71440000
         DC    H'06'               APCPMINP                             71460000
         DC    XL4'00000000'       RESERVED                             71480000
         DC    XL8'0000000000000000' RESERVED                           71500000
         DC    00XL16'00'          APCPSWS                              71520000
         DC    BL1'10000000'       APCPSACB                             71540000
         DC    BL1'10000000'       APCPSBLD                             71560000
         DC    BL1'10000000'       APCPSOP                              71580000
         DC    BL1'00000000'       APCPSAR                              71600000
         DC    BL1'00000000'       APCPSIO                              71620000
         DC    BL4'00000000'       RESERVE                              71640000
         DC    BL1'01000000'       APCPSWX                              71660000
         DC    BL1'10000000'       APCPSFN                              71680000
         DC    BL1'01000000'       APCPSRCL                             71700000
         DC    BL1'01000000'       APCPSEML                             71720000
         DC    BL1'00000000'       RESERVED                             71740000
         DC    BL1'00000000'       RESERVED                             71760000
         DC    BL1'00000000'       RESERVED                             71780000
**                       DEFINE APAL CONSTANTS                       ** 71800000
         DC    01XL48'00'          APAL                                 71820000
         ORG   *-48                                                     71840000
         DC    XL4'00000000'       APALUSER                             71860000
         DC    H'08'               APALCISZ                             71880000
         DC    XL2'0000'           RESERVED                             71900000
         DC    H'04'               APALLTYP                             71920000
         DC    XL1'80'             APALLI1F                             71940000
         DC    XL1'40'             APALLI2F                             71960000
         DC    XL4'00'             RESERVED                             71980000
         ORG   ,                                                        72000000
         EJECT                                                          72020000
*********************************************************************** 72040000
*                                                                     * 72060000
*                    APCP/APAL ENTRY FOR XDC                          * 72080000
*               'DECREMENT AND COMPARE INDEX:INDEX'                   * 72100000
*                                                                     * 72120000
*********************************************************************** 72140000
**                       DEFINE APCP CONSTANTS                       ** 72160000
         DC    CL4'XDC '           APCPAPFN                             72180000
         DC    A(APOPXDC)          APCPAPOP                             72200000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              72220000
         DC    F'0'                APCPUSRX                             72240000
         DC    H'06'               APCPMAXP                             72260000
         DC    H'06'               APCPMINP                             72280000
         DC    XL4'00000000'       RESERVED                             72300000
         DC    XL8'0000000000000000' RESERVED                           72320000
         DC    00XL16'00'          APCPSWS                              72340000
         DC    BL1'10000000'       APCPSACB                             72360000
         DC    BL1'10000000'       APCPSBLD                             72380000
         DC    BL1'10000000'       APCPSOP                              72400000
         DC    BL1'00000000'       APCPSAR                              72420000
         DC    BL1'00000000'       APCPSIO                              72440000
         DC    BL4'00000000'       RESERVE                              72460000
         DC    BL1'01000000'       APCPSWX                              72480000
         DC    BL1'10000000'       APCPSFN                              72500000
         DC    BL1'01000000'       APCPSRCL                             72520000
         DC    BL1'01000000'       APCPSEML                             72540000
         DC    BL1'00000000'       RESERVED                             72560000
         DC    BL1'00000000'       RESERVED                             72580000
         DC    BL1'00000000'       RESERVED                             72600000
**                       DEFINE APAL CONSTANTS                       ** 72620000
         DC    01XL48'00'          APAL                                 72640000
         ORG   *-48                                                     72660000
         DC    XL4'00000000'       APALUSER                             72680000
         DC    H'08'               APALCISZ                             72700000
         DC    XL2'0000'           RESERVED                             72720000
         DC    H'04'               APALLTYP                             72740000
         DC    XL1'80'             APALLI1F                             72760000
         DC    XL1'80'             APALLI2F                             72780000
         DC    XL4'00'             RESERVED                             72800000
         ORG   ,                                                        72820000
         EJECT                                                          72840000
*********************************************************************** 72860000
*                                                                     * 72880000
*                    APCP/APAL ENTRY FOR XDCI                         * 72900000
*            'DECREMENT AND COMPARE INDEX:IMMEDIATE'                  * 72920000
*                                                                     * 72940000
*********************************************************************** 72960000
**                       DEFINE APCP CONSTANTS                       ** 72980000
         DC    CL4'XDCI'           APCPAPFN                             73000000
         DC    A(APOPXDCI)         APCPAPOP                             73020000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              73040000
         DC    F'0'                APCPUSRX                             73060000
         DC    H'06'               APCPMAXP                             73080000
         DC    H'06'               APCPMINP                             73100000
         DC    XL4'00000000'       RESERVED                             73120000
         DC    XL8'0000000000000000' RESERVED                           73140000
         DC    00XL16'00'          APCPSWS                              73160000
         DC    BL1'10000000'       APCPSACB                             73180000
         DC    BL1'10000000'       APCPSBLD                             73200000
         DC    BL1'10000000'       APCPSOP                              73220000
         DC    BL1'00000000'       APCPSAR                              73240000
         DC    BL1'00000000'       APCPSIO                              73260000
         DC    BL4'00000000'       RESERVE                              73280000
         DC    BL1'01000000'       APCPSWX                              73300000
         DC    BL1'10000000'       APCPSFN                              73320000
         DC    BL1'01000000'       APCPSRCL                             73340000
         DC    BL1'01000000'       APCPSEML                             73360000
         DC    BL1'00000000'       RESERVED                             73380000
         DC    BL1'00000000'       RESERVED                             73400000
         DC    BL1'00000000'       RESERVED                             73420000
**                       DEFINE APAL CONSTANTS                       ** 73440000
         DC    01XL48'00'          APAL                                 73460000
         ORG   *-48                                                     73480000
         DC    XL4'00000000'       APALUSER                             73500000
         DC    H'08'               APALCISZ                             73520000
         DC    XL2'0000'           RESERVED                             73540000
         DC    H'04'               APALLTYP                             73560000
         DC    XL1'80'             APALLI1F                             73580000
         DC    XL1'40'             APALLI2F                             73600000
         DC    XL4'00'             RESERVED                             73620000
         ORG   ,                                                        73640000
         EJECT                                                          73660000
*********************************************************************** 73680000
*                                                                     * 73700000
*                    APCP/APAL ENTRY FOR XCF                          * 73720000
*             'FLOATING-POINT COMPARE INDEX:INDEX'                    * 73740000
*                                                                     * 73760000
*********************************************************************** 73780000
**                       DEFINE APCP CONSTANTS                       ** 73800000
         DC    CL4'XCF '           APCPAPFN                             73820000
         DC    A(APOPXCF)          APCPAPOP                             73840000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              73860000
         DC    F'0'                APCPUSRX                             73880000
         DC    H'06'               APCPMAXP                             73900000
         DC    H'06'               APCPMINP                             73920000
         DC    XL4'00000000'       RESERVED                             73940000
         DC    XL8'0000000000000000' RESERVED                           73960000
         DC    00XL16'00'          APCPSWS                              73980000
         DC    BL1'10000000'       APCPSACB                             74000000
         DC    BL1'10000000'       APCPSBLD                             74020000
         DC    BL1'10000000'       APCPSOP                              74040000
         DC    BL1'00000000'       APCPSAR                              74060000
         DC    BL1'00000000'       APCPSIO                              74080000
         DC    BL4'00000000'       RESERVE                              74100000
         DC    BL1'01000000'       APCPSWX                              74120000
         DC    BL1'10000000'       APCPSFN                              74140000
         DC    BL1'01000000'       APCPSRCL                             74160000
         DC    BL1'01000000'       APCPSEML                             74180000
         DC    BL1'00000000'       RESERVED                             74200000
         DC    BL1'00000000'       RESERVED                             74220000
         DC    BL1'00000000'       RESERVED                             74240000
**                       DEFINE APAL CONSTANTS                       ** 74260000
         DC    01XL48'00'          APAL                                 74280000
         ORG   *-48                                                     74300000
         DC    XL4'00000000'       APALUSER                             74320000
         DC    H'08'               APALCISZ                             74340000
         DC    XL2'0000'           RESERVED                             74360000
         DC    H'04'               APALLTYP                             74380000
         DC    XL1'80'             APALLI1F                             74400000
         DC    XL1'80'             APALLI2F                             74420000
         DC    XL4'00'             RESERVED                             74440000
         ORG   ,                                                        74460000
         EJECT                                                          74480000
*********************************************************************** 74500000
*                                                                     * 74520000
*                    APCP/APAL ENTRY FOR XCFI                         * 74540000
*            'FLOATING-POINT COMPARE INDEX:IMMEDIATE'                 * 74560000
*                                                                     * 74580000
*********************************************************************** 74600000
**                       DEFINE APCP CONSTANTS                       ** 74620000
         DC    CL4'XCFI'           APCPAPFN                             74640000
         DC    A(APOPXCFI)         APCPAPOP                             74660000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              74680000
         DC    F'0'                APCPUSRX                             74700000
         DC    H'06'               APCPMAXP                             74720000
         DC    H'06'               APCPMINP                             74740000
         DC    XL4'00000000'       RESERVED                             74760000
         DC    XL8'0000000000000000' RESERVED                           74780000
         DC    00XL16'00'          APCPSWS                              74800000
         DC    BL1'10000000'       APCPSACB                             74820000
         DC    BL1'10000000'       APCPSBLD                             74840000
         DC    BL1'10000000'       APCPSOP                              74860000
         DC    BL1'00000000'       APCPSAR                              74880000
         DC    BL1'00000000'       APCPSIO                              74900000
         DC    BL4'00000000'       RESERVE                              74920000
         DC    BL1'01000000'       APCPSWX                              74940000
         DC    BL1'10000000'       APCPSFN                              74960000
         DC    BL1'01000000'       APCPSRCL                             74980000
         DC    BL1'01000000'       APCPSEML                             75000000
         DC    BL1'00000000'       RESERVED                             75020000
         DC    BL1'00000000'       RESERVED                             75040000
         DC    BL1'00000000'       RESERVED                             75060000
**                       DEFINE APAL CONSTANTS                       ** 75080000
         DC    01XL48'00'          APAL                                 75100000
         ORG   *-48                                                     75120000
         DC    XL4'00000000'       APALUSER                             75140000
         DC    H'08'               APALCISZ                             75160000
         DC    XL2'0000'           RESERVED                             75180000
         DC    H'04'               APALLTYP                             75200000
         DC    XL1'80'             APALLI1F                             75220000
         DC    XL1'40'             APALLI2F                             75240000
         DC    XL4'00'             RESERVED                             75260000
         ORG   ,                                                        75280000
         EJECT                                                          75300000
*********************************************************************** 75320000
*                                                                     * 75340000
*                    APCP/APAL ENTRY FOR XBCT                         * 75360000
*                    'BRANCH AND COUNT LOOP'                          * 75380000
*                                                                     * 75400000
*********************************************************************** 75420000
**                       DEFINE APCP CONSTANTS                       ** 75440000
         DC    CL4'XBCT'           APCPAPFN                             75460000
         DC    A(APOPXBCT)         APCPAPOP                             75480000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              75500000
         DC    F'0'                APCPUSRX                             75520000
         DC    H'04'               APCPMAXP                             75540000
         DC    H'04'               APCPMINP                             75560000
         DC    XL4'00000000'       RESERVED                             75580000
         DC    XL8'0000000000000000' RESERVED                           75600000
         DC    00XL16'00'          APCPSWS                              75620000
         DC    BL1'10000000'       APCPSACB                             75640000
         DC    BL1'10000000'       APCPSBLD                             75660000
         DC    BL1'10000000'       APCPSOP                              75680000
         DC    BL1'00000000'       APCPSAR                              75700000
         DC    BL1'00000000'       APCPSIO                              75720000
         DC    BL4'00000000'       RESERVE                              75740000
         DC    BL1'01000000'       APCPSWX                              75760000
         DC    BL1'10000000'       APCPSFN                              75780000
         DC    BL1'01000000'       APCPSRCL                             75800000
         DC    BL1'01000000'       APCPSEML                             75820000
         DC    BL1'00000000'       RESERVED                             75840000
         DC    BL1'00000000'       RESERVED                             75860000
         DC    BL1'00000000'       RESERVED                             75880000
**                       DEFINE APAL CONSTANTS                       ** 75900000
         DC    01XL48'00'          APAL                                 75920000
         ORG   *-48                                                     75940000
         DC    XL4'00000000'       APALUSER                             75960000
         DC    H'08'               APALCISZ                             75980000
         DC    XL2'0000'           RESERVED                             76000000
         DC    H'06'               APALLTYP                             76020000
         DC    XL1'80'             APALLI1F                             76040000
         DC    XL1'00'             APALLI2F                             76060000
         DC    XL4'00'             RESERVED                             76080000
         ORG   ,                                                        76100000
         EJECT                                                          76120000
*********************************************************************** 76140000
*                                                                     * 76160000
*                    APCP/APAL ENTRY FOR XGO                          * 76180000
*                    'UNCONDITIONAL BRANCH'                           * 76200000
*                                                                     * 76220000
*********************************************************************** 76240000
**                       DEFINE APCP CONSTANTS                       ** 76260000
         DC    CL4'XGO '           APCPAPFN                             76280000
         DC    A(APOPXGO)          APCPAPOP                             76300000
         DC    A(@MFA-CAPCPRTN)    APCPRTN                              76320000
         DC    F'0'                APCPUSRX                             76340000
         DC    H'03'               APCPMAXP                             76360000
         DC    H'03'               APCPMINP                             76380000
         DC    XL4'00000000'       RESERVED                             76400000
         DC    XL8'0000000000000000' RESERVED                           76420000
         DC    00XL16'00'          APCPSWS                              76440000
         DC    BL1'10000000'       APCPSACB                             76460000
         DC    BL1'10000000'       APCPSBLD                             76480000
         DC    BL1'10000000'       APCPSOP                              76500000
         DC    BL1'00000000'       APCPSAR                              76520000
         DC    BL1'00000000'       APCPSIO                              76540000
         DC    BL4'00000000'       RESERVE                              76560000
         DC    BL1'01000000'       APCPSWX                              76580000
         DC    BL1'10000000'       APCPSFN                              76600000
         DC    BL1'01000000'       APCPSRCL                             76620000
         DC    BL1'01000000'       APCPSEML                             76640000
         DC    BL1'00000000'       RESERVED                             76660000
         DC    BL1'00000000'       RESERVED                             76680000
         DC    BL1'00000000'       RESERVED                             76700000
**                       DEFINE APAL CONSTANTS                       ** 76720000
         DC    01XL48'00'          APAL                                 76740000
         ORG   *-48                                                     76760000
         DC    XL4'00000000'       APALUSER                             76780000
         DC    H'08'               APALCISZ                             76800000
         DC    XL2'0000'           RESERVED                             76820000
         DC    H'05'               APALLTYP                             76840000
         DC    XL1'00'             APALLI1F                             76860000
         DC    XL1'00'             LI0F                                 76880000
         DC    XL4'00'             RESERVED                             76900000
         ORG   ,                                                        76920000
         EJECT                                                          76940000
*********************************************************************** 76960000
*                                                                     * 76980000
*                    APCP/APAL ENTRY FOR NZCP                         * 77000000
*               'NTH ZERO CROSSING(FORWARD SCAN)'                     * 77020000
*                                                                     * 77040000
*********************************************************************** 77060000
**                       DEFINE APCP CONSTANTS                       ** 77080000
         DC    CL4'NZCP'           APCPAPFN                             77100000
         DC    A(APOPNZCP)         APCPAPOP                             77120000
         DC    A(@MDC-CAPCPRTN)    APCPRTN                              77140000
         DC    F'0'                APCPUSRX                             77160000
         DC    H'12'               APCPMAXP                             77180000
         DC    H'09'               APCPMINP                             77200000
         DC    XL4'00000000'       RESERVED                             77220000
         DC    XL8'0000000000000000' RESERVED                           77240000
         DC    00XL16'00'          APCPSWS                              77260000
         DC    BL1'10000000'       APCPSACB                             77280000
         DC    BL1'10000000'       APCPSBLD                             77300000
         DC    BL1'10000000'       APCPSOP                              77320000
         DC    BL1'00000000'       APCPSAR                              77340000
         DC    BL1'00000000'       APCPSIO                              77360000
         DC    BL4'00000000'       RESERVE                              77380000
         DC    BL1'01000000'       APCPSWX                              77400000
         DC    BL1'10000000'       APCPSFN                              77420000
         DC    BL1'01000000'       APCPSRCL                             77440000
         DC    BL1'01000000'       APCPSEML                             77460000
         DC    BL1'00000000'       RESERVED                             77480000
         DC    BL1'00000000'       RESERVED                             77500000
         DC    BL1'00000000'       RESERVED                             77520000
**                       DEFINE APAL CONSTANTS                       ** 77540000
         DC    01XL48'00'          APAL                                 77560000
         ORG   *-48                                                     77580000
         DC    XL4'00000000'       APALUSER                             77600000
         DC    H'20'               APALCISZ                             77620000
         DC    XL2'0000'           RESERVED                             77640000
         DC    XL1'00'             APALSTAT                             77660000
         DC    XL3'000000'         RESERVED                             77680000
         DC    XL1'00'             APALYFSW                             77700000
         DC    XL1'00'             APALYVS                              77720000
         DC    XL1'00'             APALYCT                              77740000
         DC    XL1'00'             APALYDL                              77760000
         DC    XL1'00'             APALYFMT                             77780000
         DC    XL5'0000000000'     RESERVED                             77800000
         DC    H'0000'             APALYCNT                             77820000
         DC    XL1'86'             APALXFSW                             77840000
         DC    XL1'80'             APALXVS                              77860000
         DC    XL1'80'             APALXCT                              77880000
         DC    XL1'00'             APALXDL                              77900000
         DC    XL1'80'             APALXFMT                             77920000
         DC    XL5'0000000000'     RESERVED                             77940000
         DC    H'0000'             APALXCNT                             77960000
         DC    XL1'84'             APALUFSW                             77980000
         DC    XL1'80'             APALUVS                              78000000
         DC    XL1'01'             APALUCT                              78020000
         DC    XL1'00'             APALUDL                              78040000
         DC    XL1'80'             APALUFMT                             78060000
         DC    XL5'0000000000'     RESERVED                             78080000
         DC    H'0001'             APALUCNT                             78100000
         ORG   ,                                                        78120000
         EJECT                                                          78140000
*********************************************************************** 78160000
*                                                                     * 78180000
*                    APCP/APAL ENTRY FOR NZCN                         * 78200000
*               'NTH ZERO CROSSING(REVERSE SCAN)'                     * 78220000
*                                                                     * 78240000
*********************************************************************** 78260000
**                       DEFINE APCP CONSTANTS                       ** 78280000
         DC    CL4'NZCN'           APCPAPFN                             78300000
         DC    A(APOPNZCN)         APCPAPOP                             78320000
         DC    A(@MDC-CAPCPRTN)    APCPRTN                              78340000
         DC    F'0'                APCPUSRX                             78360000
         DC    H'12'               APCPMAXP                             78380000
         DC    H'09'               APCPMINP                             78400000
         DC    XL4'00000000'       RESERVED                             78420000
         DC    XL8'0000000000000000' RESERVED                           78440000
         DC    00XL16'00'          APCPSWS                              78460000
         DC    BL1'10000000'       APCPSACB                             78480000
         DC    BL1'10000000'       APCPSBLD                             78500000
         DC    BL1'10000000'       APCPSOP                              78520000
         DC    BL1'00000000'       APCPSAR                              78540000
         DC    BL1'00000000'       APCPSIO                              78560000
         DC    BL4'00000000'       RESERVE                              78580000
         DC    BL1'01000000'       APCPSWX                              78600000
         DC    BL1'10000000'       APCPSFN                              78620000
         DC    BL1'01000000'       APCPSRCL                             78640000
         DC    BL1'01000000'       APCPSEML                             78660000
         DC    BL1'00000000'       RESERVED                             78680000
         DC    BL1'00000000'       RESERVED                             78700000
         DC    BL1'00000000'       RESERVED                             78720000
**                       DEFINE APAL CONSTANTS                       ** 78740000
         DC    01XL48'00'          APAL                                 78760000
         ORG   *-48                                                     78780000
         DC    XL4'00000000'       APALUSER                             78800000
         DC    H'20'               APALCISZ                             78820000
         DC    XL2'0000'           RESERVED                             78840000
         DC    XL1'00'             APALSTAT                             78860000
         DC    XL3'000000'         RESERVED                             78880000
         DC    XL1'00'             APALYFSW                             78900000
         DC    XL1'00'             APALYVS                              78920000
         DC    XL1'00'             APALYCT                              78940000
         DC    XL1'00'             APALYDL                              78960000
         DC    XL1'00'             APALYFMT                             78980000
         DC    XL5'0000000000'     RESERVED                             79000000
         DC    H'0000'             APALYCNT                             79020000
         DC    XL1'86'             APALXFSW                             79040000
         DC    XL1'80'             APALXVS                              79060000
         DC    XL1'80'             APALXCT                              79080000
         DC    XL1'00'             APALXDL                              79100000
         DC    XL1'80'             APALXFMT                             79120000
         DC    XL5'0000000000'     RESERVED                             79140000
         DC    H'0000'             APALXCNT                             79160000
         DC    XL1'84'             APALUFSW                             79180000
         DC    XL1'80'             APALUVS                              79200000
         DC    XL1'01'             APALUCT                              79220000
         DC    XL1'00'             APALUDL                              79240000
         DC    XL1'80'             APALUFMT                             79260000
         DC    XL5'0000000000'     RESERVED                             79280000
         DC    H'0001'             APALUCNT                             79300000
         ORG   ,                                                        79320000
         EJECT                                                          79340000
*********************************************************************** 79360000
*                                                                     * 79380000
*                    APCP/APAL ENTRY FOR EXP                          * 79400000
*                         'EXPONENTIAL'                               * 79420000
*                                                                     * 79440000
*********************************************************************** 79460000
**                       DEFINE APCP CONSTANTS                       ** 79480000
         DC    CL4'EXP '           APCPAPFN                             79500000
         DC    A(APOPEXP)          APCPAPOP                             79520000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              79540000
         DC    F'0'                APCPUSRX                             79560000
         DC    H'15'               APCPMAXP                             79580000
         DC    H'04'               APCPMINP                             79600000
         DC    XL4'00000000'       RESERVED                             79620000
         DC    XL8'0000000000000000' RESERVED                           79640000
         DC    00XL16'00'          APCPSWS                              79660000
         DC    BL1'10000000'       APCPSACB                             79680000
         DC    BL1'10000000'       APCPSBLD                             79700000
         DC    BL1'10000000'       APCPSOP                              79720000
         DC    BL1'00000000'       APCPSAR                              79740000
         DC    BL1'00000000'       APCPSIO                              79760000
         DC    BL4'00000000'       RESERVE                              79780000
         DC    BL1'01000000'       APCPSWX                              79800000
         DC    BL1'10000000'       APCPSFN                              79820000
         DC    BL1'01000000'       APCPSRCL                             79840000
         DC    BL1'01000000'       APCPSEML                             79860000
         DC    BL1'00000000'       RESERVED                             79880000
         DC    BL1'00000000'       RESERVED                             79900000
         DC    BL1'00000000'       RESERVED                             79920000
**                       DEFINE APAL CONSTANTS                       ** 79940000
         DC    01XL48'00'          APAL                                 79960000
         ORG   *-48                                                     79980000
         DC    XL4'00000000'       APALUSER                             80000000
         DC    H'20'               APALCISZ                             80020000
         DC    XL2'0000'           RESERVED                             80040000
         DC    XL1'30'             APALSTAT                             80060000
         DC    XL3'000000'         RESERVED                             80080000
         DC    XL1'87'             APALYFSW                             80100000
         DC    XL1'80'             APALYVS                              80120000
         DC    XL1'80'             APALYCT                              80140000
         DC    XL1'40'             APALYDL                              80160000
         DC    XL1'80'             APALYFMT                             80180000
         DC    XL5'0000000000'     RESERVED                             80200000
         DC    H'0000'             APALYCNT                             80220000
         DC    XL1'85'             APALXFSW                             80240000
         DC    XL1'40'             APALXVS                              80260000
         DC    XL1'00'             APALXCT                              80280000
         DC    XL1'40'             APALXDL                              80300000
         DC    XL1'40'             APALXFMT                             80320000
         DC    XL5'0000000000'     RESERVED                             80340000
         DC    H'0000'             APALXCNT                             80360000
         DC    XL1'00'             APALUFSW                             80380000
         DC    XL1'00'             APALUVS                              80400000
         DC    XL1'00'             APALUCT                              80420000
         DC    XL1'00'             APALUDL                              80440000
         DC    XL1'00'             APALUFMT                             80460000
         DC    XL5'0000000000'     RESERVED                             80480000
         DC    H'0000'             APALUCNT                             80500000
         ORG   ,                                                        80520000
         EJECT                                                          80540000
*********************************************************************** 80560000
*                                                                     * 80580000
*                    APCP/APAL ENTRY FOR TAN                          * 80600000
*                           'TANGENT'                                 * 80620000
*                                                                     * 80640000
*********************************************************************** 80660000
**                       DEFINE APCP CONSTANTS                       ** 80680000
         DC    CL4'TAN '           APCPAPFN                             80700000
         DC    A(APOPTAN)          APCPAPOP                             80720000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              80740000
         DC    F'0'                APCPUSRX                             80760000
         DC    H'15'               APCPMAXP                             80780000
         DC    H'04'               APCPMINP                             80800000
         DC    XL4'00000000'       RESERVED                             80820000
         DC    XL8'0000000000000000' RESERVED                           80840000
         DC    00XL16'00'          APCPSWS                              80860000
         DC    BL1'10000000'       APCPSACB                             80880000
         DC    BL1'10000000'       APCPSBLD                             80900000
         DC    BL1'10000000'       APCPSOP                              80920000
         DC    BL1'00000000'       APCPSAR                              80940000
         DC    BL1'00000000'       APCPSIO                              80960000
         DC    BL4'00000000'       RESERVE                              80980000
         DC    BL1'01000000'       APCPSWX                              81000000
         DC    BL1'10000000'       APCPSFN                              81020000
         DC    BL1'01000000'       APCPSRCL                             81040000
         DC    BL1'01000000'       APCPSEML                             81060000
         DC    BL1'00000000'       RESERVED                             81080000
         DC    BL1'00000000'       RESERVED                             81100000
         DC    BL1'00000000'       RESERVED                             81120000
**                       DEFINE APAL CONSTANTS                       ** 81140000
         DC    01XL48'00'          APAL                                 81160000
         ORG   *-48                                                     81180000
         DC    XL4'00000000'       APALUSER                             81200000
         DC    H'20'               APALCISZ                             81220000
         DC    XL2'0000'           RESERVED                             81240000
         DC    XL1'30'             APALSTAT                             81260000
         DC    XL3'000000'         RESERVED                             81280000
         DC    XL1'87'             APALYFSW                             81300000
         DC    XL1'80'             APALYVS                              81320000
         DC    XL1'80'             APALYCT                              81340000
         DC    XL1'40'             APALYDL                              81360000
         DC    XL1'80'             APALYFMT                             81380000
         DC    XL5'0000000000'     RESERVED                             81400000
         DC    H'0000'             APALYCNT                             81420000
         DC    XL1'85'             APALXFSW                             81440000
         DC    XL1'40'             APALXVS                              81460000
         DC    XL1'00'             APALXCT                              81480000
         DC    XL1'40'             APALXDL                              81500000
         DC    XL1'40'             APALXFMT                             81520000
         DC    XL5'0000000000'     RESERVED                             81540000
         DC    H'0000'             APALXCNT                             81560000
         DC    XL1'00'             APALUFSW                             81580000
         DC    XL1'00'             APALUVS                              81600000
         DC    XL1'00'             APALUCT                              81620000
         DC    XL1'00'             APALUDL                              81640000
         DC    XL1'00'             APALUFMT                             81660000
         DC    XL5'0000000000'     RESERVED                             81680000
         DC    H'0000'             APALUCNT                             81700000
         ORG   ,                                                        81720000
         EJECT                                                          81740000
*********************************************************************** 81760000
*                                                                     * 81780000
*                    APCP/APAL ENTRY FOR LOG                          * 81800000
*                          'LOGARITHM'                                * 81820000
*                                                                     * 81840000
*********************************************************************** 81860000
**                       DEFINE APCP CONSTANTS                       ** 81880000
         DC    CL4'LOG '           APCPAPFN                             81900000
         DC    A(APOPLOG)          APCPAPOP                             81920000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              81940000
         DC    F'0'                APCPUSRX                             81960000
         DC    H'11'               APCPMAXP                             81980000
         DC    H'04'               APCPMINP                             82000000
         DC    XL4'00000000'       RESERVED                             82020000
         DC    XL8'0000000000000000' RESERVED                           82040000
         DC    00XL16'00'          APCPSWS                              82060000
         DC    BL1'10000000'       APCPSACB                             82080000
         DC    BL1'10000000'       APCPSBLD                             82100000
         DC    BL1'10000000'       APCPSOP                              82120000
         DC    BL1'00000000'       APCPSAR                              82140000
         DC    BL1'00000000'       APCPSIO                              82160000
         DC    BL4'00000000'       RESERVE                              82180000
         DC    BL1'01000000'       APCPSWX                              82200000
         DC    BL1'10000000'       APCPSFN                              82220000
         DC    BL1'01000000'       APCPSRCL                             82240000
         DC    BL1'01000000'       APCPSEML                             82260000
         DC    BL1'00000000'       RESERVED                             82280000
         DC    BL1'00000000'       RESERVED                             82300000
         DC    BL1'00000000'       RESERVED                             82320000
**                       DEFINE APAL CONSTANTS                       ** 82340000
         DC    01XL48'00'          APAL                                 82360000
         ORG   *-48                                                     82380000
         DC    XL4'00000000'       APALUSER                             82400000
         DC    H'20'               APALCISZ                             82420000
         DC    XL2'0000'           RESERVED                             82440000
         DC    XL1'30'             APALSTAT                             82460000
         DC    XL3'000000'         RESERVED                             82480000
         DC    XL1'86'             APALYFSW                             82500000
         DC    XL1'80'             APALYVS                              82520000
         DC    XL1'80'             APALYCT                              82540000
         DC    XL1'00'             APALYDL                              82560000
         DC    XL1'80'             APALYFMT                             82580000
         DC    XL5'0000000000'     RESERVED                             82600000
         DC    H'0000'             APALYCNT                             82620000
         DC    XL1'84'             APALXFSW                             82640000
         DC    XL1'40'             APALXVS                              82650000
         DC    XL1'00'             APALXCT                              82680000
         DC    XL1'00'             APALXDL                              82700000
         DC    XL1'40'             APALXFMT                             82710000
         DC    XL5'0000000000'     RESERVED                             82740000
         DC    H'0000'             APALXCNT                             82760000
         DC    XL1'00'             APALUFSW                             82780000
         DC    XL1'00'             APALUVS                              82800000
         DC    XL1'00'             APALUCT                              82820000
         DC    XL1'00'             APALUDL                              82840000
         DC    XL1'00'             APALUFMT                             82860000
         DC    XL5'0000000000'     RESERVED                             82880000
         DC    H'0000'             APALUCNT                             82900000
         ORG   ,                                                        82920000
         EJECT                                                          82940000
*********************************************************************** 82960000
*                                                                     * 82980000
*                    APCP/APAL ENTRY FOR ATAN                         * 83000000
*                         'ARCTANGENT'                                * 83020000
*                                                                     * 83040000
*********************************************************************** 83060000
**                       DEFINE APCP CONSTANTS                       ** 83080000
         DC    CL4'ATAN'           APCPAPFN                             83100000
         DC    A(APOPATAN)         APCPAPOP                             83120000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              83140000
         DC    F'0'                APCPUSRX                             83160000
         DC    H'15'               APCPMAXP                             83180000
         DC    H'04'               APCPMINP                             83200000
         DC    XL4'00000000'       RESERVED                             83220000
         DC    XL8'0000000000000000' RESERVED                           83240000
         DC    00XL16'00'          APCPSWS                              83260000
         DC    BL1'10000000'       APCPSACB                             83280000
         DC    BL1'10000000'       APCPSBLD                             83300000
         DC    BL1'10000000'       APCPSOP                              83320000
         DC    BL1'00000000'       APCPSAR                              83340000
         DC    BL1'00000000'       APCPSIO                              83360000
         DC    BL4'00000000'       RESERVE                              83380000
         DC    BL1'01000000'       APCPSWX                              83400000
         DC    BL1'10000000'       APCPSFN                              83420000
         DC    BL1'01000000'       APCPSRCL                             83440000
         DC    BL1'01000000'       APCPSEML                             83460000
         DC    BL1'00000000'       RESERVED                             83480000
         DC    BL1'00000000'       RESERVED                             83500000
         DC    BL1'00000000'       RESERVED                             83520000
**                       DEFINE APAL CONSTANTS                       ** 83540000
         DC    01XL48'00'          APAL                                 83560000
         ORG   *-48                                                     83580000
         DC    XL4'00000000'       APALUSER                             83600000
         DC    H'20'               APALCISZ                             83620000
         DC    XL2'0000'           RESERVED                             83640000
         DC    XL1'30'             APALSTAT                             83660000
         DC    XL3'000000'         RESERVED                             83680000
         DC    XL1'87'             APALYFSW                             83700000
         DC    XL1'80'             APALYVS                              83720000
         DC    XL1'80'             APALYCT                              83740000
         DC    XL1'40'             APALYDL                              83760000
         DC    XL1'80'             APALYFMT                             83780000
         DC    XL5'0000000000'     RESERVED                             83800000
         DC    H'0000'             APALYCNT                             83820000
         DC    XL1'85'             APALXFSW                             83840000
         DC    XL1'40'             APALXVS                              83860000
         DC    XL1'00'             APALXCT                              83880000
         DC    XL1'40'             APALXDL                              83900000
         DC    XL1'40'             APALXFMT                             83920000
         DC    XL5'0000000000'     RESERVED                             83940000
         DC    H'0000'             APALXCNT                             83960000
         DC    XL1'00'             APALUFSW                             83980000
         DC    XL1'00'             APALUVS                              84000000
         DC    XL1'00'             APALUCT                              84020000
         DC    XL1'00'             APALUDL                              84040000
         DC    XL1'00'             APALUFMT                             84060000
         DC    XL5'0000000000'     RESERVED                             84080000
         DC    H'0000'             APALUCNT                             84100000
         ORG   ,                                                        84120000
         EJECT                                                          84140000
*********************************************************************** 84160000
*                                                                     * 84180000
*                    APCP/APAL ENTRY FOR REC                          * 84200000
*                     'RECURSIVE FILTER'                              * 84210000
*                                                                     * 84240000
*********************************************************************** 84260000
**                       DEFINE APCP CONSTANTS                       ** 84280000
         DC    CL4'REC '           APCPAPFN                             84300000
         DC    A(APOPREC)          APCPAPOP                             84310000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              84340000
         DC    F'0'                APCPUSRX                             84360000
         DC    H'20'               APCPMAXP                             84380000
         DC    H'04'               APCPMINP                             84400000
         DC    XL4'00000000'       RESERVED                             84420000
         DC    XL8'0000000000000000' RESERVED                           84440000
         DC    00XL16'00'          APCPSWS                              84460000
         DC    BL1'10000000'       APCPSACB                             84480000
         DC    BL1'10000000'       APCPSBLD                             84500000
         DC    BL1'10000000'       APCPSOP                              84520000
         DC    BL1'00000000'       APCPSAR                              84540000
         DC    BL1'00000000'       APCPSIO                              84560000
         DC    BL4'00000000'       RESERVE                              84580000
         DC    BL1'01000000'       APCPSWX                              84600000
         DC    BL1'10000000'       APCPSFN                              84620000
         DC    BL1'01000000'       APCPSRCL                             84640000
         DC    BL1'01000000'       APCPSEML                             84660000
         DC    BL1'00000000'       RESERVED                             84680000
         DC    BL1'00000000'       RESERVED                             84700000
         DC    BL1'00000000'       RESERVED                             84720000
**                       DEFINE APAL CONSTANTS                       ** 84740000
         DC    01XL48'00'          APAL                                 84760000
         ORG   *-48                                                     84780000
         DC    XL4'00000000'       APALUSER                             84800000
         DC    H'28'               APALCISZ                             84820000
         DC    XL2'0000'           RESERVED                             84840000
         DC    XL1'30'             APALSTAT                             84860000
         DC    XL3'000000'         RESERVED                             84880000
         DC    XL1'87'             APALYFSW                             84900000
         DC    XL1'80'             APALYVS                              84920000
         DC    XL1'80'             APALYCT                              84940000
         DC    XL1'40'             APALYDL                              84960000
         DC    XL1'80'             APALYFMT                             84980000
         DC    XL5'0000000000'     RESERVED                             85000000
         DC    H'0000'             APALYCNT                             85020000
         DC    XL1'8D'             APALXFSW                             85040000
         DC    XL1'40'             APALXVS                              85050000
         DC    XL1'00'             APALXCT                              85080000
         DC    XL1'40'             APALXDL                              85100000
         DC    XL1'40'             APALXFMT                             85110000
         DC    XL5'0000000000'     RESERVED                             85140000
         DC    H'0000'             APALXCNT                             85160000
         DC    XL1'8D'             APALUFSW                             85180000
         DC    XL1'40'             APALUVS                              85190000
         DC    XL1'00'             APALUCT                              85220000
         DC    XL1'40'             APALUDL                              85240000
         DC    XL1'40'             APALUFMT                             85260000
         DC    XL5'0000000000'     RESERVED                             85280000
         DC    H'0000'             APALUCNT                             85300000
         ORG   ,                                                        85320000
         EJECT                                                          85340000
*********************************************************************** 85360000
*                                                                     * 85380000
*                    APCP/APAL ENTRY FOR POLY                         * 85400000
*                     'POLYNOMIAL EXPANSION'                          * 85420000
*                                                                     * 85440000
*********************************************************************** 85460000
**                       DEFINE APCP CONSTANTS                       ** 85480000
         DC    CL4'POLY'           APCPAPFN                             85500000
         DC    A(APOPPOLY)         APCPAPOP                             85520000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              85540000
         DC    F'0'                APCPUSRX                             85560000
         DC    H'20'               APCPMAXP                             85580000
         DC    H'04'               APCPMINP                             85600000
         DC    XL4'00000000'       RESERVED                             85620000
         DC    XL8'0000000000000000' RESERVED                           85640000
         DC    00XL16'00'          APCPSWS                              85660000
         DC    BL1'10000000'       APCPSACB                             85680000
         DC    BL1'10000000'       APCPSBLD                             85700000
         DC    BL1'10000000'       APCPSOP                              85720000
         DC    BL1'00000000'       APCPSAR                              85740000
         DC    BL1'00000000'       APCPSIO                              85760000
         DC    BL4'00000000'       RESERVE                              85780000
         DC    BL1'01000000'       APCPSWX                              85800000
         DC    BL1'10000000'       APCPSFN                              85820000
         DC    BL1'01000000'       APCPSRCL                             85840000
         DC    BL1'01000000'       APCPSEML                             85860000
         DC    BL1'00000000'       RESERVED                             85880000
         DC    BL1'00000000'       RESERVED                             85900000
         DC    BL1'00000000'       RESERVED                             85920000
**                       DEFINE APAL CONSTANTS                       ** 85940000
         DC    01XL48'00'          APAL                                 85960000
         ORG   *-48                                                     85980000
         DC    XL4'00000000'       APALUSER                             86000000
         DC    H'28'               APALCISZ                             86020000
         DC    XL2'0000'           RESERVED                             86040000
         DC    XL1'30'             APALSTAT                             86060000
         DC    XL3'000000'         RESERVED                             86080000
         DC    XL1'87'             APALYFSW                             86100000
         DC    XL1'80'             APALYVS                              86120000
         DC    XL1'80'             APALYCT                              86140000
         DC    XL1'80'             APALYDL                              86160000
         DC    XL1'80'             APALYFMT                             86180000
         DC    XL5'0000000000'     RESERVED                             86200000
         DC    H'0000'             APALYCNT                             86220000
         DC    XL1'85'             APALXFSW                             86240000
         DC    XL1'80'             APALXVS                              86260000
         DC    XL1'00'             APALXCT                              86280000
         DC    XL1'80'             APALXDL                              86300000
         DC    XL1'80'             APALXFMT                             86320000
         DC    XL5'0000000000'     RESERVED                             86340000
         DC    H'0000'             APALXCNT                             86360000
         DC    XL1'86'             APALUFSW                             86380000
         DC    XL1'80'             APALUVS                              86400000
         DC    XL1'80'             APALUCT                              86420000
         DC    XL1'00'             APALUDL                              86440000
         DC    XL1'80'             APALUFMT                             86460000
         DC    XL5'0000000000'     RESERVED                             86480000
         DC    H'0000'             APALUCNT                             86500000
         ORG   ,                                                        86520000
         EJECT                                                          86540000
*********************************************************************** 86560000
*                                                                     * 86580000
*                    APCP/APAL ENTRY FOR ATN2                         * 86600000
*                  'ARCTANGENT (QUOTIENT FORM)'                       * 86610000
*                                                                     * 86640000
*********************************************************************** 86660000
**                       DEFINE APCP CONSTANTS                       ** 86680000
         DC    CL4'ATN2'           APCPAPFN                             86700000
         DC    A(APOPATN2)         APCPAPOP                             86710000
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              86740000
         DC    F'0'                APCPUSRX                             86760000
         DC    H'20'               APCPMAXP                             86780000
         DC    H'04'               APCPMINP                             86800000
         DC    XL4'00000000'       RESERVED                             86820000
         DC    XL8'0000000000000000' RESERVED                           86840000
         DC    00XL16'00'          APCPSWS                              86860000
         DC    BL1'10000000'       APCPSACB                             86880000
         DC    BL1'10000000'       APCPSBLD                             86900000
         DC    BL1'10000000'       APCPSOP                              86920000
         DC    BL1'00000000'       APCPSAR                              86940000
         DC    BL1'00000000'       APCPSIO                              86960000
         DC    BL4'00000000'       RESERVE                              86980000
         DC    BL1'01000000'       APCPSWX                              87000000
         DC    BL1'10000000'       APCPSFN                              87020000
         DC    BL1'01000000'       APCPSRCL                             87040000
         DC    BL1'01000000'       APCPSEML                             87060000
         DC    BL1'00000000'       RESERVED                             87080000
         DC    BL1'00000000'       RESERVED                             87100000
         DC    BL1'00000000'       RESERVED                             87120000
**                       DEFINE APAL CONSTANTS                       ** 87140000
         DC    01XL48'00'          APAL                                 87160000
         ORG   *-48                                                     87180000
         DC    XL4'00000000'       APALUSER                             87200000
         DC    H'28'               APALCISZ                             87220000
         DC    XL2'0000'           RESERVED                             87240000
         DC    XL1'30'             APALSTAT                             87260000
         DC    XL3'000000'         RESERVED                             87280000
         DC    XL1'87'             APALYFSW                             87300000
         DC    XL1'80'             APALYVS                              87320000
         DC    XL1'80'             APALYCT                              87340000
         DC    XL1'80'             APALYDL                              87360000
         DC    XL1'80'             APALYFMT                             87380000
         DC    XL5'0000000000'     RESERVED                             87400000
         DC    H'0000'             APALYCNT                             87420000
         DC    XL1'85'             APALXFSW                             87440000
         DC    XL1'80'             APALXVS                              87460000
         DC    XL1'00'             APALXCT                              87480000
         DC    XL1'80'             APALXDL                              87500000
         DC    XL1'80'             APALXFMT                             87520000
         DC    XL5'0000000000'     RESERVED                             87540000
         DC    H'0000'             APALXCNT                             87560000
         DC    XL1'85'             APALUFSW                             87580000
         DC    XL1'80'             APALUVS                              87600000
         DC    XL1'00'             APALUCT                              87620000
         DC    XL1'40'             APALUDL                              87640000
         DC    XL1'80'             APALUFMT                             87660000
         DC    XL5'0000000000'     RESERVED                             87680000
         DC    H'0000'             APALUCNT                             87700000
         ORG   ,                                                        87720000
         EJECT                                                          87740000
*********************************************************************** 87740300
*                                                                     * 87740600
*                    APCP/APAL ENTRY FOR REV                          * 87740900
*                        'VECTOR REVERSE'                             * 87741200
*                                                                     * 87741500
*********************************************************************** 87741800
**                       DEFINE APCP CONSTANTS                       ** 87742100
         DC    CL4'REV '           APCPAPFN                             87742400
         DC    A(APOPREV)          APCPAPOP                             87742700
         DC    A(@MDA-CAPCPRTN)    APCPRTN                              87743000
         DC    F'0'                APCPUSRX                             87743300
         DC    H'15'               APCPMAXP                             87743600
         DC    H'04'               APCPMINP                             87743900
         DC    XL4'00000000'       RESERVED                             87744200
         DC    XL8'0000000000000000' RESERVED                           87744500
         DC    00XL16'00'          APCPSWS                              87744800
         DC    BL1'10000000'       APCPSACB                             87745100
         DC    BL1'10000000'       APCPSBLD                             87745400
         DC    BL1'10000000'       APCPSOP                              87745700
         DC    BL1'00000000'       APCPSAR                              87746000
         DC    BL1'00000000'       APCPSIO                              87746300
         DC    BL4'00000000'       RESERVED                             87746600
         DC    BL1'01000000'       APCPSWX                              87746900
         DC    BL1'10000000'       APCPSFN                              87747200
         DC    BL1'01000000'       APCPSRCL                             87747500
         DC    BL1'01000000'       APCPSEML                             87747800
         DC    BL1'00000000'       RESERVED                             87748100
         DC    BL1'00000000'       RESERVED                             87748400
         DC    BL1'00000000'       RESERVED                             87748700
**                       DEFINE APAL CONSTANTS                       ** 87749000
         DC    01XL48'00'          APAL                                 87749300
         ORG   *-48                                                     87749600
         DC    XL4'00000000'       APALUSER                             87749900
         DC    H'20'               APALCISZ                             87750200
         DC    XL2'0000'           RESERVED                             87750500
         DC    XL1'10'             APALSTAT                             87750800
         DC    XL3'000000'         RESERVED                             87751100
         DC    XL1'87'             APALYFSW                             87751400
         DC    XL1'80'             APALYVS                              87751700
         DC    XL1'80'             APALYCT                              87752000
         DC    XL1'40'             APALYDL                              87752300
         DC    XL1'80'             APALYFMT                             87752600
         DC    XL5'0000000000'     RESERVED                             87752900
         DC    H'0000'             APALYCNT                             87753200
         DC    XL1'85'             APALXFSW                             87753500
         DC    XL1'40'             APALXVS                              87753800
         DC    XL1'00'             APALXCT                              87754100
         DC    XL1'40'             APALXDL                              87754400
         DC    XL1'40'             APALXFMT                             87754700
         DC    XL5'0000000000'     RESERVED                             87755000
         DC    H'0000'             APALXCNT                             87755300
         DC    XL1'00'             APALUFSW                             87755600
         DC    XL1'00'             APALUVS                              87755900
         DC    XL1'00'             APALUCT                              87756200
         DC    XL1'00'             APALUDL                              87756500
         DC    XL1'00'             APALUFMT                             87756800
         DC    XL5'0000000000'     RESERVED                             87757100
         DC    H'0000'             APALUCNT                             87757400
         ORG   ,                                                        87757700
         EJECT                                                          87758000
*********************************************************************** 87760000
**                        START OF LAST VALID ENTRY                  ** 87780000
*********************************************************************** 87800000
CAPCPZ   EQU   *                   LAST ENTRY                           87820000
*********************************************************************** 87840000
*                                                                     * 87860000
*                 APCP ENTRY FOR FREE                                 * 87880000
*                      'FREE ACB'                                     * 87900000
*                                                                     * 87920000
*********************************************************************** 87940000
         DC    CL4'FREE'           APCPAPFN                             87960000
         DC    A(APOPFREE)         APCPAPOP                             87980000
         DC    A(@MJG-CAPCPRTN)    APCPRTN                              88000000
         DC    F'0'                APCPUSRX                             88020000
         DC    H'03'               APCPMAXP                             88040000
         DC    H'03'               APCPMINP                             88060000
         DC    XL4'00000000'       RESERVED                             88080000
         DC    XL8'0000000000000000' RESERVED                           88100000
         DC    00XL16'00'          APCPSWS                              88120000
         DC    BL1'10010000'       APCPSACB                             88140000
         DC    BL1'00000000'       APCPSBLD                             88160000
         DC    BL1'00100000'       APCPSOP                              88180000
         DC    BL1'00000000'       APCPSAR                              88200000
         DC    BL1'00000000'       APCPSIO                              88220000
         DC    BL4'00000000'       RESERVED                             88240000
         DC    BL1'00000000'       APCPSWX                              88260000
         DC    BL1'10010000'       APCPSFN                              88280000
         DC    BL1'00100000'       APCPSRCL                             88300000
         DC    BL1'01000000'       APCPSEML                             88320000
         DC    BL1'00000000'       RESERVED                             88340000
         DC    BL1'00000000'       RESERVED                             88360000
         DC    BL1'00000000'       RESERVED                             88380000
         DC    01XL48'00'          APAL                                 88400000
         EJECT                                                          88420000
*********************************************************************** 88440000
*                                                                     * 88460000
*                         DUMMY APCP ENTRY                            * 88480000
*                                                                     * 88500000
*********************************************************************** 88520000
         DC    CL4'UNKN'           APCPAPFN                             88540000
         DC    A(0)                APCPAPOP                             88560000
         DC    A(CAPCPRTN-CAPCPRTN) APCPRTN                             88580000
         DC    F'0'                APCPUSRX                             88600000
         DC    H'99'               APCPMAXP                             88620000
         DC    H'03'               APCPMINP                             88640000
         DC    XL4'00000000'       RESERVED                             88660000
         DC    XL8'0000000000000000' RESERVED                           88680000
         DC    00XL16'00'          APCPSWS                              88700000
         DC    BL1'10000000'       APCPSACB                             88720000
         DC    BL1'00000000'       APCPSBLD                             88740000
         DC    BL1'00000000'       APCPSOP                              88760000
         DC    BL1'00000000'       APCPSAR                              88780000
         DC    BL1'00000000'       APCPSIO                              88800000
         DC    BL4'00000000'       RESERVED                             88820000
         DC    BL1'00000000'       APCPSWX                              88840000
         DC    BL1'00100000'       APCPSFN                              88860000
         DC    BL1'01000000'       APCPSRCL                             88880000
         DC    BL1'01000000'       APCPSEML                             88890000
         DC    BL1'00000000'       RESERVED                             88920000
         DC    BL1'00000000'       RESERVED                             88940000
         DC    BL1'00000000'       RESERVED                             88960000
         DC    01XL48'00'          APAL                                 88980000
         SPACE 5                                                        89000000
*********************************************************************** 89020000
*                                                                     * 89040000
*                  END OF APCP/APAL DATA TABLE                        * 89060000
*                                                                     * 89080000
*********************************************************************** 89100000
         EJECT                                                          89120000
*********************************************************************** 89140000
*                                                                     * 89160000
*                       IGTXAPOP DSECT                                * 89180000
*                                                                     * 89200000
*      INCLUDE THE IGTXAPOP DSECT TO RESOLVE REFERENCES TO IGTXAPOP   * 89220000
* IN THE APCP/APAL DATA TABLE. THIS CAUSES OPERATION IDS FROM         * 89240000
* IGTXAPOP TO BE ASSEMBLED INTO AN APCP ENTRY.                        * 89260000
*                                                                     * 89280000
*********************************************************************** 89300000
         SPACE 5                                                        89320000
         IGTXDSCT IGTXAPOP                                              89340000
         EJECT                                                          89360000
*********************************************************************** 89380000
*                                                                     * 89400000
*                     APOTNM - VPSS MODULE NAME TABLE                 * 89420000
*                                                                     * 89440000
*      THE MODULE NAME TABLE CONTAINS THE NAMES OF VPSS MODULES TO BE * 89460000
* LOADED AND THE APCT OFFSET WHERE THE MODULE'S ADDRESS IS TO BE      * 89480000
* SAVED. REFER TO THE DSECT APOTNM WITHIN IGTXAPOT TO INTERPRET THIS  * 89500000
* TABLE. ENTRIES TO THIS TABLE ARE GENERATED VIA THE INTERNAL MACRO   * 89520000
* IGT0MNT. REFER TO THE PROLOGUE TO IGT0MNT FOR AN EXPLANATION OF THE * 89540000
* USE OF IGT0MNT.                                                     * 89560000
*                                                                     * 89600000
*********************************************************************** 89620000
         SPACE 5                                                        89640000
IGT0VPSS CSECT ,                       RESUME CSECT PROCESSING          89660000
MNT    DS    0D                        APOTNM                           89680000
         IGT0MNT UAA,Z                                                  89700000
         IGT0MNT UAB,Z                                                  89720000
         IGT0MNT UAC,Z                                                  89740000
         IGT0MNT UAD,Z                                                  89760000
         IGT0MNT UAE,Z                                                  89780000
         IGT0MNT UBB,Z                                                  89800000
         IGT0MNT D10,Z                                                  89820000
         IGT0MNT D20,Z                                                  89840000
         IGT0MNT D40,Z                                                  89860000
         IGT0MNT D41,Z                                                  89880000
         IGT0MNT D42,Z                                                  89900000
         IGT0MNT D43,Z                                                  89920000
         IGT0MNT D44,Z                                                  89940000
         IGT0MNT D45,Z                                                  89960000
         IGT0MNT D46,Z                                                  89980000
         IGT0MNT D47,Z                                                  90000000
         IGT0MNT D48,Z                                                  90020000
         IGT0MNT D49,Z                                                  90040000
         IGT0MNT D60,Z                                                  90060000
         IGT0MNT D80,Z                                                  90080000
         IGT0MNT D81,Z,SYST=VS1                                         90085000
         IGT0MNT D82,Z,SYST=VS1                                         90090000
         IGT0MNT D4E,Z                                                  90100000
         IGT0MNT MBA,Z                                                  90120000
         IGT0MNT MBD,Z                                                  90140000
         IGT0MNT MBG,Z                                                  90160000
         IGT0MNT MBR,Z                                                  90180000
         IGT0MNT DX1,Z                                                  90200000
         IGT0MNT DX2,Z                                                  90220000
         IGT0MNT DX3,Z                                                  90240000
         IGT0MNT DX4,Z                                                  90260000
         IGT0MNT MBH,Z                                                  90280000
         IGT0MNT MBK,Z                                                  90300000
         IGT0MNT MBM,Z                                                  90320000
         IGT0MNT MJB,Z                                                  90340000
         IGT0MNT MJC,Z                                                  90360000
         IGT0MNT MJH,Z                                                  90380000
         IGT0MNT MMA,Z                                                  90400000
         IGT0MNT DID,Z                                                  90440000
         IGT0MNT DRI,Z                                                  90460000
         IGT0MNT MJI,Z                                                  90480000
         IGT0MNT DWT,Z                                                  90500000
         IGT0MNT DMM,Z                                                  90520000
         IGT0MNT DAL,Z                                                  90540000
         IGT0MNT DBK,Z                                                  90560000
         IGT0MNT DIP,Z                                                  90580000
         IGT0MNT DDA,Z                                                  90600000
         IGT0MNT DUL,Z                                                  90620000
         IGT0MNT DEQ,Z                                                  90640000
         IGT0MNT DDQ,Z                                                  90660000
         IGT0MNT DUA,Z                                                  90680000
         IGT0MNT UAF,Z                                                  90700000
         IGT0MNT UAG,Z                                                  90720000
         IGT0MNT DIO,Z                                                  90740000
         IGT0MNT UHA,Z                                                  90760000
         IGT0MNT UHB,Z                                                  90780000
         IGT0MNT JFA,Z                                                  90800000
         IGT0MNT JAA,Z                                                  90820000
         IGT0MNT JAD,Z                                                  90840000
         IGT0MNT JAG,Z                                                  90860000
         IGT0MNT JAJ,Z                                                  90880000
         IGT0MNT JAM,Z                                                  90900000
         IGT0MNT JAP,Z                                                  90920000
         IGT0MNT JAX,Z,SYST=VS1                                         90930000
         IGT0MNT JAY,Z                                                  90940000
         IGT0MNT UFA,Z                                                  90960000
         IGT0MNT UJA,Z                                                  90980000
         IGT0MNT DAP,Z                                                  91000000
         IGT0MNT KAA,Z,SYST=MVS                                         91020000
         IGT0MNT MIB,Z                                                  91040000
         IGT0MNT MIC,Z                                                  91060000
         IGT0MNT MIF,Z                                                  91080000
         IGT0MNT JH0,Z                                                  91100000
         IGT0MNT JI0,Z                                                  91120000
         IGT0MNT JI3,Z                                                  91140000
         IGT0MNT JJ0,Z                                                  91160000
         IGT0MNT JBA,Z                                                  91180000
         IGT0MNT JBD,Z                                                  91200000
         IGT0MNT JBG,Z                                                  91220000
         IGT0MNT JBJ,Z                                                  91240000
         IGT0MNT JBM,Z                                                  91260000
         IGT0MNT KBA,Z,SYST=MVS                                         91280000
         IGT0MNT KCA,Z,SYST=MVS                                         91290000
         IGT0MNT KDA,Z,SYST=MVS                                         91300000
         IGT0MNT KBB,Z,SYST=MVS                                         91340000
         IGT0MNT KBC,Z,SYST=MVS                                         91360000
         IGT0MNT JDA,Z,SYST=MVS                                         91380000
         IGT0MNT JDD,Z                                                  91400000
         IGT0MNT JDG,Z,SYST=MVS                                         91420000
         IGT0MNT JDJ,Z                                                  91440000
         IGT0MNT JDM,Z                                                  91460000
         IGT0MNT JH6,Z                                                  91480000
         IGT0MNT JHE,Z                                                  91500000
         IGT0MNT JHF,Z                                                  91520000
         IGT0MNT JHT,Z                                                  91540000
         IGT0MNT JHR,Z                                                  91560000
         IGT0MNT JHW,Z                                                  91580000
         IGT0MNT JHO,Z                                                  91600000
         IGT0MNT JHC,Z                                                  91620000
         IGT0MNT KBD,Z,SYST=MVS                                         91640000
         IGT0MNT KBE,Z,SYST=MVS                                         91660000
         IGT0MNT KBF,Z,SYST=MVS                                         91680000
         IGT0MNT UKA,Z                                                  91700000
         IGT0MNT LCA,Z,SYST=MVS                                         91720000
         IGT0MNT LCB,Z,SYST=MVS                                         91740000
         IGT0MNT DWI,Z                                                  91760000
         IGT0MNT DQR,Z,SYST=VS1                                         91762000
         IGT0MNT JHQ,Z,SYST=VS1                                         91764000
         IGT0MNT KGA,Z,SYST=VS1,FIX=YES IGTKGA MUST BE FIXED IN VS1     91766000
         IGT0MNT KGB,Z,SYST=VS1,FIX=YES IGTKGB MUST BE FIXED IN VS1     91769000
         IGT0MNT KGC,Z,SYST=VS1,FIX=YES IGTKGC MUST BE FIXED IN VS1     91772000
         IGT0MNT KGD,Z,SYST=VS1,FIX=YES IGTKGD MUST BE FIXED IN VS1     91775000
*                                  END OF THE VPSS ROUTINES AND START   91780000
*                                  OF THE USER EXIT ROUTINES.           91800000
         IGT0MNT MJB,@                                                  91820000
         IGT0MNT MJC,@                                                  91840000
         IGT0MNT MJD,@                                                  91860000
         IGT0MNT MJE,@                                                  91880000
         IGT0MNT MJF,@                                                  91900000
         IGT0MNT MJG,@                                                  91920000
         IGT0MNT MLA,@                                                  91940000
         IGT0MNT MFA,@                                                  91960000
         IGT0MNT MDA,@                                                  91980000
         IGT0MNT MDB,@                                                  92000000
         IGT0MNT MDC,@                                                  92010000
         IGT0MNT MGA,@                                                  92020000
         IGT0MNT MHA,@                                                  92040000
         IGT0MNT MCA,@                                                  92060000
*                                                                       92061000
** THE FOLLOWING ENTRIES ARE DUMMY ENTRIES FOR THE INSTALLATION EXITS.  92062000
** THEY ARE ADDED SO THAT INSTALLATION EXITS MAY BE ZAPPED IN.          92063000
*                                                                       92064000
         IGT0MNT MAB,1,NAME=IGTUBR14    APUT INITIALIZED                92065000
         IGT0MNT MBD,1,NAME=IGTUBR14    CALL ROUTER(BEFORE PROCESSING)  92066000
         IGT0MNT MBD,2,NAME=IGTUBR14    CALL ROUTER(AFTER PROCESSING)   92067000
         IGT0MNT CMD,1,NAME=IGTUBR14    COMMAND VERIFICATION            92068000
         IGT0MNT MBM,1,NAME=IGTUBR14    CALL EXLST ENTRY FOR ERROR EXIT 92069000
         IGT0MNT JAA,1,NAME=IGTUBR14    SUBSYSTEM OPEN EXIT(OPEN DONE)  92070000
         IGT0MNT JHC,1,NAME=IGTUBR14    OK SHARED PORT ALLOCATION       92071000
         IGT0MNT JHC,2,NAME=IGTUBR14    OK EXCLUSIVE PORT ALLOCATION    92072000
         IGT0MNT JHT,1,NAME=IGTUBR14    OK ALLOCATION OPERATOR DIALOG   92073000
         IGT0MNT JHL,1,NAME=IGTUBR14    AFTER OPTIONAL CRITERION 1      92074000
         IGT0MNT JHL,2,NAME=IGTUBR14    AFTER OPTIONAL CRITERION 2      92075000
         IGT0MNT JBJ,1,NAME=IGTUBR14    VPSS SUBSYSTEM CLOSE UPDATE SMF 92076000
MNT#   EQU   (*-MNT)/12                DETERMINE NAME TABLE LENGTH      92080000
       DC    120X'00'                  RESERVE ZAP SPACE   - CHANGE     92100000
*                                      MNT#!                            92120000
       SPACE 5                                                          92140000
*********************************************************************** 92160000
*                                                                     * 92180000
*                          END OF APOTNM                              * 92200000
*                                                                     * 92220000
*********************************************************************** 92240000
         EJECT                                                          92260000
*********************************************************************** 92280000
*                                                                     * 92300000
*                       APOTVT DSECT - SSVT                           * 92320000
*                                                                     * 92340000
*      LIST THE SSVT FORMAT - ALSO CORRESPONDS TO DSECT APOTVT        * 92360000
*  WITHIN IGTXAPOT. REFER TO THIS DSECT WHEN INTERPRETING VALUES IN   * 92380000
*  THE APOTVT TABLE.                                                  * 92400000
*                                                                     * 92420000
*********************************************************************** 92440000
         SPACE 5                                                        92460000
         IEFJSSVT ,                SSVT FORMAT                          92480000
         EJECT                                                          92500000
*********************************************************************** 92520000
*                                                                     * 92540000
*                   APOTVT - VPSS SUBSYSTEM VECTOR TABLE              * 92560000
*                                                                     * 92580000
*      THE FOLLOWING TABLE GIVES VALUES FOR THE VPSS SUBSYSTEM VECTOR * 92600000
* TABLE - MAPPED BY DSECTS APOTVT WITHIN IGTXAPOT AND THE PRECEDING   * 92620000
* SSVT DSECT. REFER TO THE DSECTS WHEN INTERPRETING THE APOTVT.       * 92640000
*      ENTRIES IN THIS TABLE ARE GENERATED VIA THE IGT0VPSS INTERNAL  * 92660000
* MACRO IGT0SSVT. USE THIS MACRO TO ADD OR CHANGE AN APOTVT ENTRY.    * 92680000
* EXPLANATION OF THE USE OF IGT0SSVT IS CONTAINED IN THE PROLOGUE TO  * 92700000
* THE IGT0VPSS MACRO.                                                 * 92720000
*                                                                     * 92740000
*********************************************************************** 92760000
       SPACE 5                                                          92780000
IGT0VPSS CSECT                         RESUME CSECT PROCESSING          92800000
SSVTFT DS    0D                        APOTVT                           92820000
       IGT0SSVT    4,M,JDJ             END OF TASK - IGTJDJ             92840000
       IGT0SSVT    7,M,JJ0             UNALLOCATION - IGTJJ0            92860000
       IGT0SSVT    8,M,JDA,SYSTM=MVS   END OF ADDR SPACE - IGTJDA       92880000
       IGT0SSVT    10,M,JFA,SYSTM=MVS  SVC CMD PROCESSOR - IGTJFA       92900000
       IGT0SSVT    16,M,JAA            OPEN - IGTJAA                    92920000
       IGT0SSVT    17,M,JBA            CLOSE - IGTJBA                   92940000
       IGT0SSVT    38,S,JI0            CONVERTER - IGTJI0               92960000
         IGT0SSVT    39,S,JH0,SYSTM=MVS  ALLOCATION - IGTJH0            92980000
         IGT0SSVT    6,S,JH0,SYSTM=VS1   ALLOCATION - IGTJH0            92986000
SSVT#  EQU   (*-SSVTFT)/4                                               93000000
       DC    10XL4'00'                 RESERVE ZAP SPACE - CHANGE SSFT# 93020000
       SPACE 5                                                          93040000
*********************************************************************** 93060000
*                                                                     * 93080000
*                          END OF APOTVT                              * 93100000
*                                                                     * 93120000
*********************************************************************** 93140000
       EJECT                                                            93160000
*********************************************************************** 93180000
*                                                                     * 93200000
*                   APOTAD - VPSS APCT RELOCATION TABLE               * 93220000
*                                                                     * 93240000
*      THIS TABLE COMPRISES THE APCT RELOCATION TABLE USED TO MODIFY  * 93260000
* THE APCT INTERNAL POINTERS. REFER TO THE DSECT APOTAD WITHIN        * 93280000
* IGTXAPOT WHEN INTERPRETING THIS TABLE. THIS TABLE IS GENERTATED     * 93300000
* VIA THE IGT0VPSS INTERNAL MACRO IGT0CTRT. USE OF THIS MACRO IS      * 93320000
* EXPLAINED IN THE PROLOGUE TO THE IGT0CTRT MACRO.                    * 93340000
*                                                                     * 93360000
*********************************************************************** 93380000
       SPACE 5                                                          93400000
APCTRT  DS    0D                       APOTAD                           93420000
        IGT0CTRT U@@@,100              GENERATE THE RELOCATION TABLE    93440000
        DC    Y(APCTABR-APCT)          POINTER TO BR14                  93460000
        DC    Y(APCTCRTN-APCT)         CALL INTERFACE ROUTINES          93480000
APCTRT# EQU   (*-APCTRT)/2             DETERMINE NUMBER OF APCTRT       93500000
*                                      ENTRIES                          93520000
        DC    10A(0)                   ZAP SPACE                        93540000
        SPACE 5                                                         93560000
*********************************************************************** 93580000
*                                                                     * 93600000
*                            END OF APOTAD                            * 93620000
*                                                                     * 93640000
*********************************************************************** 93660000
        EJECT                                                           93680000
IGT0VPSS CSECT                                                          93700000
        IGTXEPLG LIST=YES              GET EPILOGUE                     93720000
        EJECT                                                           93740000
*********************************************************************** 93760000
*                                                                     * 93780000
*                         END OF IGT0VPSS                             * 93800000
*                                                                     * 93820000
*********************************************************************** 93840000
        END   IGT0VPSS                                                  93860000
