TA00     TITLE 'IGTA00 - VPSS SUBSYSTEM INITIALIZATION ROUTINE         *00001000
                        '                                               00002000
IGTA00   CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(16)                                          01S0001 00007000
         DC    C'IGTA00    77.195'                              01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @07,0                                            01S0001 00011000
@PSTART  DS    0H                                               01S0001 00012000
         USING @PSTART,@07                                      01S0001 00013000
         L     @00,@SIZDATD                                     01S0001 00014000
         MODESET EXTKEY=SCHED,SAVEKEY=(2)                               00015000
         GETMAIN  R,LV=(0)                                              00016000
         LR    @06,@01                                          01S0001 00017000
         USING @DATD,@06                                        01S0001 00018000
         ST    @13,@SA00001+4                                   01S0001 00019000
         STC   @02,@OLDKEY                                      01S0001 00020000
         MODESET KEYADDR=(2)                                            00021000
         LM    @00,@02,20(@13)                                  01S0001 00022000
         ST    @06,8(,@13)                                      01S0001 00023000
         LR    @13,@06                                          01S0001 00024000
         MODESET EXTKEY=ZERO                                            00025000
         MVC   @PC00001(12),0(@01)                              01S0001 00026000
         MODESET EXTKEY=SCHED                                           00027000
*   APNPPTR=ADDR(DAPNP);            /* LOAD THE ADDRESS OF APNP.     */ 00028000
         LA    APNPPTR,DAPNP                                    01S0055 00029000
*   APNP30RT=A0030RT;               /* MOVE WORK AREA FOR VS1 STAE   */ 00030000
         MVC   APNP30RT(16,APNPPTR),A0030RT                     01S0056 00031000
*   APNPAPNP=APNPPTR;               /* SAVE THE ADDRESS OF APNP FOR     00032000
*                                      VS1 STAE EXIT                 */ 00033000
         ST    APNPPTR,APNPAPNP(,APNPPTR)                       01S0057 00034000
*   APNPSWIT=APNPZERO;              /* INITIALIZE VPSS SSI SWITCHES  */ 00035000
         SLR   @09,@09                                          01S0058 00036000
         ST    @09,APNPSWIT(,APNPPTR)                           01S0058 00037000
*   RESPECIFY                                                   01S0059 00038000
*     R13P RSTD;                    /* RESTRICT R13.                 */ 00039000
*   APNPSV13=R13P;                  /* SAVE R13 FOR THE STAE EXIT.   */ 00040000
         ST    R13P,APNPSV13(,APNPPTR)                          01S0060 00041000
*   RESPECIFY                                                   01S0061 00042000
*     R13P;                         /* RELEASE R13.                  */ 00043000
*   RESPECIFY                                                   01S0062 00044000
*     APNQ BASED(APNQPTR);          /* POINT TO APNQ ERROR MESSAGES  */ 00045000
*   RESPECIFY                                                   01S0063 00046000
*     R2P RSTD;                     /* RESTRICT R2.                  */ 00047000
*   R2P=ADDR(IGTA30);               /* LOAD THE ADDRESS OF STAE EXIT */ 00048000
         L     R2P,@CV00072                                     01S0064 00049000
*   GENERATE REFS(R2P,APNPPTR,STAEADDR);                        01S0065 00050000
*                                       /*                              00051000
     IGTYSTAE  (R2P),CT,PARAM=(APNPPTR),XCTL=NO,PURGE=NONE,ASYNCH=YES, X00052000
               TERM=YES,BRANCH=NO,RECORD=YES,MF=(E,STAEADDR)            00053000
*   RESPECIFY                                                   01S0066 00054000
*     R2P;                          /* RELEASE R2.                   */ 00055000
*                                                               01S0066 00056000
*   /*****************************************************************/ 00057000
*   /*                                                               */ 00058000
*   /* INITIALIZE ID AND OBTAIN SUBSYSTEM NAME                       */ 00059000
*   /*                                                               */ 00060000
*   /*****************************************************************/ 00061000
*                                                               01S0067 00062000
*   APNPID=A00APNP;                 /* PLACE APNP ID IN APNP         */ 00063000
         MVC   APNPID(4,APNPPTR),A00APNP                        01S0067 00064000
*   APNPSTAT=APNPOFF;               /* INITIALIZE THE ERROR MESSAGE     00065000
*                                      INDICATOR TO ZERO.            */ 00066000
         NI    APNPSTAT(APNPPTR),B'11110111'                    01S0068 00067000
*   SSCTPTR=ADDR(PARMSSCT)&'7FFFFFFF'X;/* GET SSCT ADDR FROM SSI        00068000
*                                      PARAMETER LIST.               */ 00069000
         L     @09,@PC00001                                     01S0069 00070000
         N     @09,@CF01688                                     01S0069 00071000
         ST    @09,SSCTPTR(,APNPPTR)                            01S0069 00072000
*   GEN(MODESET EXTKEY=ZERO)                                    01S0070 00073000
*   NOREFS NOSETS;                  /* KEY ZERO FOR SSCT             */ 00074000
         MODESET EXTKEY=ZERO                                            00075000
*   SSCTUPSS=APNPON;                /* INDICATE SYSOUT SUPPORT REQ.  */ 00076000
         L     @09,SSCTPTR(,APNPPTR)                            01S0071 00077000
         OI    SSCTUPSS(@09),B'01000000'                        01S0071 00078000
*   GEN(MODESET EXTKEY=SCHED)                                   01S0072 00079000
*   NOREFS NOSETS;                  /* KEY ZERO FOR SSCT             */ 00080000
         MODESET EXTKEY=SCHED                                           00081000
*   RESPECIFY                                                   01S0073 00082000
*     R1P;                          /* RELEASE R1.                   */ 00083000
*/*   INDICATE SYSOUT SUPPORT REQUIRED                               */ 00084000
*                                                               01S0074 00085000
*   APNPLOAD=A00XIGT;               /* OBTAIN THE FIRST HALF OF THE     00086000
*                                      OPTION TABLE NAME.            */ 00087000
         MVC   APNPLOAD(8,APNPPTR),A00XIGT                      01S0074 00088000
*   APNPSNAM=SSCTSNAM;              /* OBTAIN THE NAME OF THIS  01S0075 00089000
*                                      SUBSYSTEM FROM THE SSCVT.     */ 00090000
*                                                               01S0075 00091000
         L     @09,SSCTPTR(,APNPPTR)                            01S0075 00092000
         MVC   APNPSNAM(4,APNPPTR),SSCTSNAM(@09)                01S0075 00093000
*   /*****************************************************************/ 00094000
*   /*                                                               */ 00095000
*   /* VERIFY SUBSYSTEM NOT ACTIVE                                   */ 00096000
*   /*                                                               */ 00097000
*   /*****************************************************************/ 00098000
*                                                               01S0076 00099000
*   RESPECIFY                                                   01S0076 00100000
*     SSCT BASED(DSSCTPTR);         /* POINTER FOR SCAN OF SSCT'S    */ 00101000
*   RESPECIFY                                                   01S0077 00102000
*     DSSCTPTR RSTD;                /* RESTRICT SSCT POINTER         */ 00103000
*   DSSCTPTR=FLCCVT->CVTJESCT->JESSSCT;/* POINTER TO FIRST SSCT      */ 00104000
         L     @01,FLCCVT                                       01S0078 00105000
         L     @01,CVTJESCT(,@01)                               01S0078 00106000
         L     DSSCTPTR,JESSSCT(,@01)                           01S0078 00107000
*   DO WHILE(APNPSNAM^=SSCTSNAM)&   /* SSCT NAMES ARE THE SAME       */ 00108000
*         (SSCTSCTA^=APNPZERO);     /* OR THE END OF THE CHAIN.      */ 00109000
         B     @DE00079                                         01S0079 00110000
@DL00079 DS    0H                                               01S0080 00111000
*     DSSCTPTR=SSCTSCTA;            /* POINTER TO NEXT SSCT          */ 00112000
         L     DSSCTPTR,SSCTSCTA(,DSSCTPTR)                     01S0080 00113000
*   END;                                                        01S0081 00114000
@DE00079 CLC   APNPSNAM(4,APNPPTR),SSCTSNAM(DSSCTPTR)           01S0081 00115000
         BE    @DC00079                                         01S0081 00116000
         L     @15,SSCTSCTA(,DSSCTPTR)                          01S0081 00117000
         LTR   @15,@15                                          01S0081 00118000
         BNZ   @DL00079                                         01S0081 00119000
@DC00079 DS    0H                                               01S0082 00120000
*   RESPECIFY                                                   01S0082 00121000
*     SSCT BASED(SSCTPTR);          /* SET SSCT TO ORIGINAL SSCT     */ 00122000
*   IF DSSCTPTR^=SSCTPTR THEN       /* THERE IS A DUPLICATE SSCT     */ 00123000
         C     DSSCTPTR,SSCTPTR(,APNPPTR)                       01S0083 00124000
         BE    @RF00083                                         01S0083 00125000
*     DO;                                                       01S0084 00126000
*       APNPSTAT=APNPON;            /* SET ERROR CONDITION           */ 00127000
         OI    APNPSTAT(APNPPTR),B'00001000'                    01S0085 00128000
*     END;                                                      01S0086 00129000
*   RESPECIFY                                                   01S0087 00130000
*     DSSCTPTR UNRSTD;              /* RELEASE SECOND POINTER REG    */ 00131000
@RF00083 DS    0H                                               01S0088 00132000
*   IF(SSCTSSVT=APNPZERO)&          /* SSCT NOT ALREADY INITIALIZED  */ 00133000
*       (APNPSTAT=APNPOFF) THEN     /* AND NOT A DUPLICATE           */ 00134000
         L     @09,SSCTPTR(,APNPPTR)                            01S0088 00135000
         L     @09,SSCTSSVT(,@09)                               01S0088 00136000
         LTR   @09,@09                                          01S0088 00137000
         BNZ   @RF00088                                         01S0088 00138000
         TM    APNPSTAT(APNPPTR),B'00001000'                    01S0088 00139000
         BNZ   @RF00088                                         01S0088 00140000
*     DO;                                                       01S0089 00141000
*       RESPECIFY                                               01S0090 00142000
*         R3P RSTD;                 /* RESTRICT R3.                  */ 00143000
*       R3P=ADDR(BLDLREC);          /* LOAD THE ADDRESS OF BLDL REC. */ 00144000
*                                                               01S0091 00145000
         LA    R3P,BLDLREC                                      01S0091 00146000
*       /*************************************************************/ 00147000
*       /*                                                           */ 00148000
*       /* ISSUE BLDL FOR THE OPTION TABLE                           */ 00149000
*       /*                                                           */ 00150000
*       /*************************************************************/ 00151000
*                                                               01S0092 00152000
*       CVTPTR=FLCCVT;              /* LOAD THE ADDRESS OF THE CVT   */ 00153000
         L     @09,FLCCVT                                       01S0092 00154000
         ST    @09,CVTPTR(,APNPPTR)                             01S0092 00155000
*       RESPECIFY                                               01S0093 00156000
*         R2P RSTD;                 /* RESTRICT R2 FOR ADDRESS OF THE   00157000
*                                      DCB FOR SYS1.LINKLIB          */ 00158000
*       R2P=FLCCVT->CVTLINK;        /* OBTAIN THE ADDRESS OF THE DCB    00159000
*                                      FOR SYS1.LINKLIB.             */ 00160000
         L     R2P,CVTLINK(,@09)                                01S0094 00161000
*       RESPECIFY                                               01S0095 00162000
*         APNPBLHD BASED(R3P);      /* POINT TO BLDL HEADER.         */ 00163000
*       RESPECIFY                                               01S0096 00164000
*         PDS2 BASED(R3P+APNPBLHL); /* POINT TO BLDL RECORD          */ 00165000
*       APNPBLFF=1;                 /* INSERT NUMBER OF BLDL RECORDS */ 00166000
         MVC   APNPBLFF(2,R3P),@CH00139                         01S0097 00167000
*       APNPBLLL=APNPBLEL;          /* INSERT LENGTH OF BLDL RECORD  */ 00168000
         MVC   APNPBLLL(2,R3P),@CH00440                         01S0098 00169000
*       PDS2NAME=APNPLOAD;          /* INSERT MODULE NAME INTO RECORD*/ 00170000
         MVC   PDS2NAME+4(8,R3P),APNPLOAD(APNPPTR)              01S0099 00171000
*       GENERATE REFS(R2P,R3P);                                 01S0100 00172000
*                                   /*                                  00173000
         BLDL (R2P),(R3P)              ISSUE BLDL FOR OPTION TABLE      00174000
*       RESPECIFY                                               01S0101 00175000
*         R15P RSTD;                /* RESTRICT R15.                 */ 00176000
*                                                               01S0101 00177000
*       /*************************************************************/ 00178000
*       /*                                                           */ 00179000
*       /* IF MODULE LOCATED THEN ISSUE LOAD FOR SAME                */ 00180000
*       /*                                                           */ 00181000
*       /*************************************************************/ 00182000
*                                                               01S0102 00183000
*       IF R15P=APNPZERO THEN       /* THE MODULE WAS LOCATED SO LOAD*/ 00184000
         LTR   R15P,R15P                                        01S0102 00185000
         BNZ   @RF00102                                         01S0102 00186000
*         DO;                                                   01S0103 00187000
*           RESPECIFY                                           01S0104 00188000
*             R4P RSTD;             /* RESTRICT R4.                  */ 00189000
*           R4P=ADDR(PDS2NAME);     /* LOAD THE ADDR OF MODULE NAME  */ 00190000
         LA    R4P,4(,R3P)                                      01S0105 00191000
*           GENERATE REFS(R4P,R2P);                             01S0106 00192000
*                                   /*                                  00193000
             LOAD DE=(R4P),DCB=(R2P)   LOAD THE OPTION TABLE            00194000
*           RESPECIFY                                           01S0107 00195000
*             R0P RSTD;             /* RESTRICT R0.                  */ 00196000
*           APNPAPOT=R0P;           /* SAVE THE ADDRESS OF THE OPTION   00197000
*                                      TABLE.                        */ 00198000
         ST    R0P,APNPAPOT(,APNPPTR)                           01S0108 00199000
*           RESPECIFY                                           01S0109 00200000
*             R0P;                  /* RELEASE R0.                   */ 00201000
*           RESPECIFY                                           01S0110 00202000
*             R2P;                  /* RELEASE R2.                   */ 00203000
*                                                               01S0110 00204000
*           /*********************************************************/ 00205000
*           /*                                                       */ 00206000
*           /* CALL IGTA20 AND DELETE THE OPTION TABLE               */ 00207000
*           /*                                                       */ 00208000
*           /*********************************************************/ 00209000
*                                                               01S0111 00210000
*           CALL IGTA20(APNP);      /* CONTINUE INITIALIZATION       */ 00211000
         ST    APNPPTR,@AL00001                                 01S0111 00212000
         L     @15,@CV00071                                     01S0111 00213000
         LA    @01,@AL00001                                     01S0111 00214000
         BALR  @14,@15                                          01S0111 00215000
*           RESPECIFY                                           01S0112 00216000
*             R15P RSTD;            /* RESTRICT R15.                 */ 00217000
*           IF R15P^=APNPZERO THEN  /* AN ERROR HAS OCCURRED.        */ 00218000
         LTR   R15P,R15P                                        01S0113 00219000
         BZ    @RF00113                                         01S0113 00220000
*             DO;                                               01S0114 00221000
*               APNPSTAT=APNPON;    /* SET THE ERROR INDICATION.     */ 00222000
         OI    APNPSTAT(APNPPTR),B'00001000'                    01S0115 00223000
*             END;                                              01S0116 00224000
*           RESPECIFY                                           01S0117 00225000
*             R15P;                 /* RELEASE R15.                  */ 00226000
@RF00113 DS    0H                                               01S0118 00227000
*           GENERATE REFS(R4P);                                 01S0118 00228000
*                                   /*                                  00229000
             DELETE DE=(R4P)           DELETE THE OPTION TABLE          00230000
*           RESPECIFY                                           01S0119 00231000
*             R4P;                  /* RELEASE R4.                   */ 00232000
*         END;                                                  01S0120 00233000
*                                                               01S0120 00234000
*       /*************************************************************/ 00235000
*       /*                                                           */ 00236000
*       /* WRITE ERROR MESSAGE TO OPERATOR                           */ 00237000
*       /*                                                           */ 00238000
*       /*************************************************************/ 00239000
*                                                               01S0121 00240000
*       ELSE                                                    01S0121 00241000
*         DO;                                                   01S0121 00242000
         B     @RC00102                                         01S0121 00243000
@RF00102 DS    0H                                               01S0122 00244000
*           RESPECIFY                                           01S0122 00245000
*             R15P RSTD;            /* RESTRICT R15.                 */ 00246000
*           APNPBUFF=APNQM03;       /* MOVE MESSAGE IGT103I TO THE      00247000
*                                      OUTPUT BUFFER.                */ 00248000
         MVI   APNPBUFF+59(APNPPTR),C' '                        01S0123 00249000
         MVC   APNPBUFF+60(40,APNPPTR),APNPBUFF+59(APNPPTR)     01S0123 00250000
         L     @14,APNQPTR                                      01S0123 00251000
         L     @14,APNQA03(,@14)                                01S0123 00252000
         MVC   APNPBUFF(59,APNPPTR),APNQM03(@14)                01S0123 00253000
*           RESPECIFY                                           01S0124 00254000
*             APNQM03 BASED(ADDR(APNPBUFF));/* POINT TO OUTPUT  01S0124 00255000
*                                      BUFFER.                       */ 00256000
*                                                               01S0124 00257000
*           /*********************************************************/ 00258000
*           /*                                                       */ 00259000
*           /* PLACE RETURN CODE IN ERROR MESSAGE                    */ 00260000
*           /*                                                       */ 00261000
*           /*********************************************************/ 00262000
*                                                               01S0125 00263000
*           CVD(R15P,APNPCHAR);     /* CONVERT RETURN CODE TO DECIMAL*/ 00264000
         CVD   R15P,@TS00001                                    01S0125 00265000
         MVC   APNPCHAR(4,APNPPTR),@TS00001+4                   01S0125 00266000
*           UNPK(APNQ03T4,APNPCHAR);/* UNPACK THE ABOVE RESULT.      */ 00267000
         LA    @14,128                                          01S0126 00268000
         ALR   @14,APNPPTR                                      01S0126 00269000
         UNPK  APNQ03T4(2,@14),APNPCHAR(4,APNPPTR)              01S0126 00270000
*           APNQ03T4(2)=APNQ03T4(2)|'F0'X;/* UNSIGNED NUMBER.        */ 00271000
         OI    APNQ03T4+1(@14),X'F0'                            01S0127 00272000
*           APNQ03T2=APNPSNAM;      /* PLACE THE SUBSYSTEM NAME IN TO   00273000
*                                      THE MESSAGE TO BE OUTPUT.     */ 00274000
         MVC   APNQ03T2(4,@14),APNPSNAM(APNPPTR)                01S0128 00275000
*           RESPECIFY                                           01S0129 00276000
*             APNPMSGS RSTD;        /* RESTRICT R1.                  */ 00277000
*           APNPMSGS=ADDR(APNPBUFF);/* ADDRESS OF MESSAGE BUFFER     */ 00278000
         LA    APNPMSGS,APNPBUFF(,APNPPTR)                      01S0130 00279000
*           GENERATE REFS(APNPMSGS);                            01S0131 00280000
*                                   /*                                  00281000
             WTO MF=(E,(APNPMSGS))     WRITE ERROR MESSAGE              00282000
*           RESPECIFY                                           01S0132 00283000
*             APNPMSGS;             /* RELEASE R1.                   */ 00284000
*           APNPSTAT=APNPON;        /* SET THE ERROR CONDITION SO       00285000
*                                      THAT THE ERROR MESSAGES WILL     00286000
*                                      BE OUTPUT.                    */ 00287000
         OI    APNPSTAT(APNPPTR),B'00001000'                    01S0133 00288000
*           RESPECIFY                                           01S0134 00289000
*             R15P;                 /* RELEASE R15.                  */ 00290000
*         END;                                                  01S0135 00291000
*     END;                                                      01S0136 00292000
*                                                               01S0136 00293000
*   /*****************************************************************/ 00294000
*   /*                                                               */ 00295000
*   /* WRITE ERROR MESSAGE TO OPERATOR                               */ 00296000
*   /*                                                               */ 00297000
*   /*****************************************************************/ 00298000
*                                                               01S0137 00299000
*   ELSE                                                        01S0137 00300000
*     DO;                                                       01S0137 00301000
         B     @RC00088                                         01S0137 00302000
@RF00088 DS    0H                                               01S0138 00303000
*       APNPBUFF=APNQM02;           /* MOVE MESSAGE IGT102I TO OUTPUT   00304000
*                                      BUFFER.                       */ 00305000
         MVI   APNPBUFF+55(APNPPTR),C' '                        01S0138 00306000
         MVC   APNPBUFF+56(44,APNPPTR),APNPBUFF+55(APNPPTR)     01S0138 00307000
         L     @09,APNQPTR                                      01S0138 00308000
         L     @09,APNQA02(,@09)                                01S0138 00309000
         MVC   APNPBUFF(55,APNPPTR),APNQM02(@09)                01S0138 00310000
*       RESPECIFY                                               01S0139 00311000
*         APNQM02 BASED(ADDR(APNPBUFF));/* POINT TO OUTPUT BUFFER.   */ 00312000
*       APNQ02T2=APNPSNAM;          /* PLACE THE NAME OF THE    01S0140 00313000
*                                      SUBSYSTEM INTO THE MESSAGE TO    00314000
*                                      BE OUTPUT.                    */ 00315000
         MVC   APNQ02T2+128(4,APNPPTR),APNPSNAM(APNPPTR)        01S0140 00316000
*       RESPECIFY                                               01S0141 00317000
*         APNPMSGS RSTD;            /* RESTRICT R1.                  */ 00318000
*       APNPMSGS=ADDR(APNPBUFF);    /* ADDRESS OF MESSAGE BUFFER     */ 00319000
         LA    APNPMSGS,APNPBUFF(,APNPPTR)                      01S0142 00320000
*       GENERATE REFS(APNPMSGS);                                01S0143 00321000
*                               /*                                      00322000
         WTO MF=(E,(APNPMSGS))         WRITE ERROR MESSAGE              00323000
*       RESPECIFY                                               01S0144 00324000
*         APNPMSGS;                 /* RELEASE R1.                   */ 00325000
*       APNPSTAT=APNPON;            /* SET THE ERROR CONDITION TO       00326000
*                                      INDICATE THAT A MESSAGE IS TO    00327000
*                                      BE OUTPUT.                    */ 00328000
         OI    APNPSTAT(APNPPTR),B'00001000'                    01S0145 00329000
*     END;                                                      01S0146 00330000
*                                                               01S0146 00331000
*   /*****************************************************************/ 00332000
*   /*                                                               */ 00333000
*   /* CHECK TO SEE IF INITIALIZATION WAS SUCCESSFUL                 */ 00334000
*   /*                                                               */ 00335000
*   /*****************************************************************/ 00336000
*                                                               01S0147 00337000
*   RESPECIFY                                                   01S0147 00338000
*     APNPRTRG RSTD;                /* RESTRICT THE RETURN REGISTER. */ 00339000
@RC00088 DS    0H                                               01S0148 00340000
*   IF APNPSTAT=APNPOFF THEN        /* INITIALIZATION WAS SUCCESSFUL.*/ 00341000
         TM    APNPSTAT(APNPPTR),B'00001000'                    01S0148 00342000
         BNZ   @RF00148                                         01S0148 00343000
*     DO;                                                       01S0149 00344000
*       APNPRTRG=APNPZERO;          /* SET RETURN REGISTER FOR GOOD     00345000
*                                      STATUS.                       */ 00346000
         SLR   APNPRTRG,APNPRTRG                                01S0150 00347000
*       APNPBUFF=APNQM07;           /* MOVE MESSAGE IGT107I TO OUTPUT   00348000
*                                      BUFFER.                       */ 00349000
         MVI   APNPBUFF+54(APNPPTR),C' '                        01S0151 00350000
         MVC   APNPBUFF+55(45,APNPPTR),APNPBUFF+54(APNPPTR)     01S0151 00351000
         L     @10,APNQPTR                                      01S0151 00352000
         L     @10,APNQA07(,@10)                                01S0151 00353000
         MVC   APNPBUFF(54,APNPPTR),APNQM07(@10)                01S0151 00354000
*       RESPECIFY                                               01S0152 00355000
*         APNQM07 BASED(ADDR(APNPBUFF));/* POINT TO OUTPUT BUFFER.   */ 00356000
*       APNQ07T2=APNPSNAM;          /* INSERT SUBSYSTEM NAME IN THE     00357000
*                                      COMPLETION MESSAGE.           */ 00358000
         MVC   APNQ07T2+128(4,APNPPTR),APNPSNAM(APNPPTR)        01S0153 00359000
*       RESPECIFY                                               01S0154 00360000
*         APNPMSGS RSTD;            /* RESTRICT R1.                  */ 00361000
*       APNPMSGS=ADDR(APNPBUFF);    /* LOAD ADDRESS OF OUTPUT BUFFER.*/ 00362000
         LA    APNPMSGS,APNPBUFF(,APNPPTR)                      01S0155 00363000
*       GENERATE REFS(APNPMSGS);                                01S0156 00364000
*                                   /*                                  00365000
         WTO MF=(E,(APNPMSGS))         WRITE COMPLETION MESSAGE         00366000
*       RESPECIFY                                               01S0157 00367000
*         APNPMSGS;                 /* RELEASE R1.                   */ 00368000
*     END;                                                      01S0158 00369000
*                                                               01S0158 00370000
*   /*****************************************************************/ 00371000
*   /*                                                               */ 00372000
*   /* SET ERROR RETURN STATUS                                       */ 00373000
*   /*                                                               */ 00374000
*   /*****************************************************************/ 00375000
*                                                               01S0159 00376000
*   ELSE                                                        01S0159 00377000
*     DO;                                                       01S0159 00378000
         B     @RC00148                                         01S0159 00379000
@RF00148 DS    0H                                               01S0160 00380000
*       RESPECIFY                                               01S0160 00381000
*         APNPMSGS RSTD;            /* RESTRICT R1.                  */ 00382000
*       APNPBUFF=APNQM01;           /* MOVE MESSAGE IGT101I TO OUTPUT   00383000
*                                      BUFFER.                       */ 00384000
         MVI   APNPBUFF+52(APNPPTR),C' '                        01S0161 00385000
         MVC   APNPBUFF+53(47,APNPPTR),APNPBUFF+52(APNPPTR)     01S0161 00386000
         L     @10,APNQPTR                                      01S0161 00387000
         L     @10,APNQA01(,@10)                                01S0161 00388000
         MVC   APNPBUFF(52,APNPPTR),APNQM01(@10)                01S0161 00389000
*       RESPECIFY                                               01S0162 00390000
*         APNQM01 BASED(ADDR(APNPBUFF));/* POINT TO OUTPUT BUFFER.   */ 00391000
*       APNQ01T2=APNPSNAM;          /* INSERT SUBSYSTEM NAME IN THE     00392000
*                                      FAILURE MESSAGE.              */ 00393000
         MVC   APNQ01T2+128(4,APNPPTR),APNPSNAM(APNPPTR)        01S0163 00394000
*       APNPMSGS=ADDR(APNPBUFF);    /* ADDRESS OF MESSAGE BUFFER     */ 00395000
         LA    APNPMSGS,APNPBUFF(,APNPPTR)                      01S0164 00396000
*       GENERATE REFS(APNPMSGS);                                01S0165 00397000
*                               /*                                      00398000
         WTO MF=(E,(APNPMSGS))         WRITE ERROR MESSAGE              00399000
*       APNPRTRG=APNPEROR;          /* RETURN ERROR CONDITION TO MSI */ 00400000
         LA    APNPRTRG,8                                       01S0166 00401000
*       RESPECIFY                                               01S0167 00402000
*         APNPMSGS;                 /* RELEASE R1.                   */ 00403000
*     END;                                                      01S0168 00404000
*                                                               01S0168 00405000
*   /*****************************************************************/ 00406000
*   /*                                                               */ 00407000
*   /* RESET ERROR RECOVERY ENVIRONMENT                              */ 00408000
*   /*                                                               */ 00409000
*   /*****************************************************************/ 00410000
*                                                               01S0169 00411000
*   GENERATE;                                                   01S0169 00412000
*                                                               01S0169 00413000
@RC00148 DS    0H                                               01S0169 00414000
*                                   /*                                  00415000
     IGTYSTAE  0                    /* DELETE THIS STAE EXIT ROUTINE */ 00416000
*   /*****************************************************************/ 00417000
*   /*                                                               */ 00418000
*   /* RETURN TO CALLER                                              */ 00419000
*   /*                                                               */ 00420000
*   /*****************************************************************/ 00421000
*                                                               01S0170 00422000
*   RETURN CODE(APNPRTRG);                                      01S0170 00423000
         IC    @02,@OLDKEY                                      01S0170 00424000
         L     @13,4(,@13)                                      01S0170 00425000
         L     @00,@SIZDATD                                     01S0170 00426000
         LR    @01,@06                                          01S0170 00427000
         FREEMAIN R,LV=(0),A=(1)                                        00428000
         MODESET KEYADDR=(2)                                            00429000
         LR    @15,@11                                          01S0170 00430000
         L     @14,12(,@13)                                     01S0170 00431000
         LM    @00,@12,20(@13)                                  01S0170 00432000
         BR    @14                                              01S0170 00433000
*   RESPECIFY                                                   01S0171 00434000
*     APNPRTRG;                     /* RELEASE THE RETURN REGISTER   */ 00435000
         EJECT                                                          00436000
*                                   /* IGTXEPLG                      */ 00437000
*                                                               01S0172 00438000
*   /*****************************************************************/ 00439000
*   /*                                                               */ 00440000
*   /* SYSTEM DECLARES                                               */ 00441000
*   /*                                                               */ 00442000
*   /*****************************************************************/ 00443000
*                                                               01S0172 00444000
*   DECLARE                         /* COMMON VARIABLES              */ 00445000
*     I256C CHAR(256) BASED,                                    01S0172 00446000
*     I031F FIXED(31) BASED,                                    01S0172 00447000
*     I031P PTR(31) BASED,                                      01S0172 00448000
*     I015F FIXED(15) BASED,                                    01S0172 00449000
*     I015P PTR(15) BASED,                                      01S0172 00450000
*     I008P PTR(8) BASED,                                       01S0172 00451000
*     I001C CHAR(1) BASED;                                      01S0172 00452000
*                                                               01S0173 00453000
*   /*****************************************************************/ 00454000
*   /*                                                               */ 00455000
*   /* MODULE PATCH AREA                                             */ 00456000
*   /*                                                               */ 00457000
*   /*****************************************************************/ 00458000
*                                                               01S0173 00459000
*   DCL                                                         01S0173 00460000
*     APPATCH CHAR(*) INT STATIC LOCAL GEND;                    01S0173 00461000
*   GENERATE DATA DEFS(APPATCH);                                01S0174 00462000
*                                                               01S0175 00463000
*   /*****************************************************************/ 00464000
*   /*                                                               */ 00465000
*   /* GENERAL REGISTER DECLARES                                     */ 00466000
*   /*                                                               */ 00467000
*   /*****************************************************************/ 00468000
*                                                               01S0175 00469000
*   DCL                                                         01S0175 00470000
*     R0F FIXED(31) REG(0),                                     01S0175 00471000
*     R0P PTR(24) REG(0),                                       01S0175 00472000
*     R0RSTD PTR(31) REG(0),                                    01S0175 00473000
*     R1F FIXED(31) REG(1),                                     01S0175 00474000
*     R1P PTR(24) REG(1),                                       01S0175 00475000
*     R1RSTD PTR(31) REG(1),                                    01S0175 00476000
*     R2F FIXED(31) REG(2),                                     01S0175 00477000
*     R2P PTR(24) REG(2),                                       01S0175 00478000
*     R2RSTD PTR(31) REG(2),                                    01S0175 00479000
*     R3F FIXED(31) REG(3),                                     01S0175 00480000
*     R3P PTR(24) REG(3),                                       01S0175 00481000
*     R3RSTD PTR(31) REG(3),                                    01S0175 00482000
*     R4F FIXED(31) REG(4),                                     01S0175 00483000
*     R4P PTR(24) REG(4),                                       01S0175 00484000
*     R4RSTD PTR(31) REG(4),                                    01S0175 00485000
*     R5F FIXED(31) REG(5),                                     01S0175 00486000
*     R5P PTR(24) REG(5),                                       01S0175 00487000
*     R5RSTD PTR(31) REG(5),                                    01S0175 00488000
*     R6F FIXED(31) REG(6),                                     01S0175 00489000
*     R6P PTR(24) REG(6),                                       01S0175 00490000
*     R6RSTD PTR(31) REG(6),                                    01S0175 00491000
*     R7F FIXED(31) REG(7),                                     01S0175 00492000
*     R7P PTR(24) REG(7),                                       01S0175 00493000
*     R7RSTD PTR(31) REG(7),                                    01S0175 00494000
*     R8F FIXED(31) REG(8),                                     01S0175 00495000
*     R8P PTR(24) REG(8),                                       01S0175 00496000
*     R8RSTD PTR(31) REG(8),                                    01S0175 00497000
*     R9F FIXED(31) REG(9),                                     01S0175 00498000
*     R9P PTR(24) REG(9),                                       01S0175 00499000
*     R9RSTD PTR(31) REG(9),                                    01S0175 00500000
*     R10F FIXED(31) REG(10),                                   01S0175 00501000
*     R10P PTR(24) REG(10),                                     01S0175 00502000
*     R10RSTD PTR(31) REG(10),                                  01S0175 00503000
*     R11F FIXED(31) REG(11),                                   01S0175 00504000
*     R11P PTR(24) REG(11),                                     01S0175 00505000
*     R11RSTD PTR(31) REG(11),                                  01S0175 00506000
*     R12F FIXED(31) REG(12),                                   01S0175 00507000
*     R12P PTR(24) REG(12),                                     01S0175 00508000
*     R12RSTD PTR(31) REG(12),                                  01S0175 00509000
*     R13F FIXED(31) REG(13),                                   01S0175 00510000
*     R13P PTR(24) REG(13),                                     01S0175 00511000
*     R13RSTD PTR(31) REG(13),                                  01S0175 00512000
*     R14F FIXED(31) REG(14),                                   01S0175 00513000
*     R14P PTR(24) REG(14),                                     01S0175 00514000
*     R14RSTD PTR(31) REG(14),                                  01S0175 00515000
*     R15F FIXED(31) REG(15),                                   01S0175 00516000
*     R15P PTR(24) REG(15),                                     01S0175 00517000
*     R15RSTD PTR(31) REG(15),                                  01S0175 00518000
*                                                               01S0175 00519000
*     /***************************************************************/ 00520000
*     /*                                                             */ 00521000
*     /* VPSS CONTROL BLOCK POINTER DECLARES                         */ 00522000
*     /*                                                             */ 00523000
*     /***************************************************************/ 00524000
*                                                               01S0175 00525000
*     APSMPTR PTR(24) REG(01),      /* STORAGE MANAGEMENT BLOCK 01S0175 00526000
*                                      (SUGGESTED POINTER)           */ 00527000
*     APSCPTR PTR(24) REG(01),      /* STORAGE MANAGEMENT CONTROL       00528000
*                                      WORD (SUGGESTED POINTER)      */ 00529000
*     APINPTR PTR(24) REG(01),      /* USER'S INPUT PARAMETER LIST      00530000
*                                      (SUGGESTED POINTER)           */ 00531000
*/*                                                                  */ 00532000
*                                                               01S0175 00533000
*     APDATA PTR(24) REG(06),       /* ADDRESS OF DYNAMIC DATA  01S0175 00534000
*                                      WORKAREA (DATAREG)            */ 00535000
*     APCODE PTR(24) REG(07),       /* PROGRAM CODE BASE REGISTER       00536000
*                                      (CODEREG)                     */ 00537000
*     APDEBPTR PTR(24) REG(08),     /* VPSS DEB (SUGGESTED POINTER)  */ 00538000
*     APNPPTR PTR(24) REG(08),      /* SUBSYSTEM INITIALIZATION 01S0175 00539000
*                                      WORKAREA BLOCK (ONLY USED BY     00540000
*                                      SUBSYSTEM INITIALIZATION)     */ 00541000
*     APRLPTR PTR(24) REG(08),      /* VPSS ACB REQUEST LIST    01S0175 00542000
*                                      (SUGGESTED POINTER)           */ 00543000
*     APCIPTR PTR(24) REG(08),      /* 3838 CONTROL TABLE (SUGGESTED    00544000
*                                      POINTER)                      */ 00545000
*     APCWPTR PTR(24) REG(08),      /* CALL INTERFACE WORKAREA  01S0175 00546000
*                                      (SUGGESTED POINTER)           */ 00547000
*     APERPTR PTR(24) REG(08),      /* ERP/IO APPENDAGE WORKAREA        00548000
*                                      (SUGGESTED POINTER)           */ 00549000
*     APACBPTR PTR(24) REG(09),     /* VPSS ACB (SUGGESTED POINTER)  */ 00550000
*     APCQPTR PTR(24) REG(09),      /* COMMAND QUEUE ELEMENT    01S0175 00551000
*                                      (SUGGESTED POINTER)           */ 00552000
*     APOTPTR PTR(24) REG(09),      /* OPTION TABLE (SUGGESTED  01S0175 00553000
*                                      POINTER)                      */ 00554000
*     APIOPTR PTR(24) REG(10),      /* I/O ELEMENT (SUGGESTED   01S0175 00555000
*                                      POINTER)                      */ 00556000
*     APEXLPTR PTR(24) REG(10),     /* VPSS EXLST (SUGGESTED POINTER)*/ 00557000
*     APUBPTR PTR(24) REG(10),      /* UNIT BLOCK (SUGGESTED POINTER)*/ 00558000
*     APAXPTR PTR(24) REG(10),      /* VPSS ACB EXTENSION (SUGGESTED    00559000
*                                      POINTER)                      */ 00560000
*     APCPPTR PTR(24) REG(10),      /* VPSS CALL PROCESSING     01S0175 00561000
*                                      INDICATORS (SUGGESTED POINTER)*/ 00562000
*     APOCPTR PTR(24) REG(10),      /* VPSS OPEN/CLOSE SUBSYSTEM        00563000
*                                      WORKAREA (REQUIRED POINTER)   */ 00564000
*     APATPTR PTR(24) REG(11),      /* VPSS ACB TABLE (SUGGESTED        00565000
*                                      POINTER)                      */ 00566000
*     APLBPTR PTR(24) REG(11),      /* LABEL RESOLUTION TABLE   01S0175 00567000
*                                      (SUGGESTED POINTER)           */ 00568000
*     APUTPTR PTR(24) REG(11),      /* USER TABLE (SUGGESTED POINTER)*/ 00569000
*     APDSPTR PTR(24) REG(11),      /* VPSS DATASET ENTRY (SUGGESTED    00570000
*                                      POINTER)                      */ 00571000
*     APXLPTR PTR(24) REG(11),      /* TRANSLATION TABLE (SUGGESTED     00572000
*                                      POINTER)                      */ 00573000
*     APDXPTR PTR(24) REG(11),      /* VPSS DEB EXTENSION (SUGGESTED    00574000
*                                      POINTER)                      */ 00575000
*     APCTPTR PTR(24) REG(12) RSTD, /* CONTROL TABLE (REQUIRED  01S0175 00576000
*                                      POINTER)                      */ 00577000
*     APSVPTR PTR(24) REG(13) RSTD, /* OS/VPSS SAVEAREA/WORKAREA        00578000
*                                      (REQUIRED POINTER)            */ 00579000
*     APRETURN PTR(24) REG(14),     /* RETURN ADDRESS FOR SUBROUTINE    00580000
*                                      LINKAGE                       */ 00581000
*     APENTRY PTR(24) REG(15),      /* SUBROUTINE ENTRY POINT LINKAGE*/ 00582000
*     APRCODE PTR(24) REG(15);      /* CONTAINS SUBROUTINE RETURN       00583000
*                                      CODE                          */ 00584000
*                                                               01S0176 00585000
*   /*****************************************************************/ 00586000
*   /*                                                               */ 00587000
*   /* USER REGISTER DECLARES                                        */ 00588000
*   /*                                                               */ 00589000
*   /*****************************************************************/ 00590000
*                                                               01S0176 00591000
*   DECLARE                                                     01S0176 00592000
*     JESCTPTR REG(00)              /* NOT NEEDED, JUST FOR PLS      */ 00593000
*         PTR(31),                                              01S0176 00594000
*     DSSCTPTR REG(09)              /* SECOND POINTER FOR DUP. SEARCH*/ 00595000
*         PTR(31);                                              01S0176 00596000
*   END IGTA00                                                  01S0177 00597000
*                                                               01S0177 00598000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00599000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00600000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00601000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00602000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00603000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00604000
*/*%INCLUDE SYSLIB  (IGTXAPCT)                                       */ 00605000
*/*%INCLUDE SYSLIB  (IGTXAPNP)                                       */ 00606000
*/*%INCLUDE SYSLIB  (IGTXAPNQ)                                       */ 00607000
*/*%INCLUDE SYSLIB  (IGTXAPOT)                                       */ 00608000
*/*%INCLUDE SYSLIB  (IEFJSCVT)                                       */ 00609000
*/*%INCLUDE SYSLIB  (IEFJESCT)                                       */ 00610000
*/*%INCLUDE SYSLIB  (IHAPDS  )                                       */ 00611000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00612000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00613000
*                                                               01S0177 00614000
*       ;                                                       01S0177 00615000
@EL00001 IC    @02,@OLDKEY                                      01S0177 00616000
         L     @13,4(,@13)                                      01S0177 00617000
@EF00001 L     @00,@SIZDATD                                     01S0177 00618000
         LR    @01,@06                                          01S0177 00619000
         FREEMAIN R,LV=(0),A=(1)                                        00620000
         MODESET KEYADDR=(2)                                            00621000
@ER00001 LM    @14,@12,12(@13)                                  01S0177 00622000
         BR    @14                                              01S0177 00623000
@DATA    DS    0H                                                       00624000
@CH00139 DC    H'1'                                                     00625000
@CH00440 DC    H'58'                                                    00626000
@DATD    DSECT                                                          00627000
         DS    0F                                                       00628000
@SA00001 DS    18F                                                      00629000
@PC00001 DS    3F                                                       00630000
@AL00001 DS    1A                                                       00631000
IGTA00   CSECT                                                          00632000
         DS    0F                                                       00633000
@CF01688 DC    XL4'7FFFFFFF'                                            00634000
@DATD    DSECT                                                          00635000
         DS    0D                                                       00636000
         DS    0D                                                       00637000
@TS00001 DS    CL8                                                      00638000
BLDLREC  DS    CL62                                                     00639000
         DS    CL2                                                      00640000
DAPNP    DS    CL500                                                    00641000
@OLDKEY  DS    AL1                                                      00642000
IGTA00   CSECT                                                          00643000
         DS    0F                                                       00644000
@SIZDATD DC    AL1(230)                                                 00645000
         DC    AL3(@ENDDATD-@DATD)                                      00646000
@CV00067 DC    V(IGTA30RT)                                              00647000
@CA00070 DC    A(IGTA10)                                                00648000
@CV00071 DC    V(IGTA20)                                                00649000
@CV00072 DC    V(IGTA30)                                                00650000
         DS    0D                                                       00651000
APNQPTR  DC    AL4(IGTA10)                                              00652000
A00XIGT  DC    CL8'IGT0    '                                            00653000
A00APNP  DC    CL4'APNP'                                                00654000
A0030RT  DS    CL16                                                     00655000
         ORG   A0030RT                                                  00656000
A00L15   DC    X'58F0F00C'                                              00657000
A00BR14  DC    X'05EF'                                                  00658000
@NM00001 DS    FL2                                                      00659000
A00RTRY  DC    VL4(IGTA30RT)                                            00660000
A00NPAD  DS    AL4                                                      00661000
         ORG   A0030RT+16                                               00662000
@DATD    DSECT                                                          00663000
*                                   /*                                  00664000
STAEADDR IGTYSTAE  (R2P),CT,PARAM=(APNPPTR),XCTL=NO,PURGE=NONE,        X00665000
                   ASYNCH=YES,TERM=YES,BRANCH=NO,RECORD=YES,MF=L        00666000
IGTA00   CSECT                                                          00667000
*                                  /* GENERATE PATCH                    00668000
         IGTXZAP ,                 GENERATE PATCH AREA                  00669000
@DATD    DSECT                                                          00670000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00671000
@ENDDATD EQU   *                                                        00672000
IGTA00   CSECT                                                          00673000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00674000
@01      EQU   01                                                       00675000
@02      EQU   02                                                       00676000
@03      EQU   03                                                       00677000
@04      EQU   04                                                       00678000
@05      EQU   05                                                       00679000
@06      EQU   06                                                       00680000
@07      EQU   07                                                       00681000
@08      EQU   08                                                       00682000
@09      EQU   09                                                       00683000
@10      EQU   10                                                       00684000
@11      EQU   11                                                       00685000
@12      EQU   12                                                       00686000
@13      EQU   13                                                       00687000
@14      EQU   14                                                       00688000
@15      EQU   15                                                       00689000
APDATA   EQU   @06                                                      00690000
APCODE   EQU   @07                                                      00691000
APCTPTR  EQU   @12                                                      00692000
APNPMSGS EQU   @09                                                      00693000
APNPRTRG EQU   @11                                                      00694000
APNPPTR  EQU   @08                                                      00695000
R13P     EQU   @13                                                      00696000
R2P      EQU   @02                                                      00697000
R1P      EQU   @01                                                      00698000
DSSCTPTR EQU   @09                                                      00699000
R3P      EQU   @03                                                      00700000
R15P     EQU   @15                                                      00701000
R4P      EQU   @04                                                      00702000
R0P      EQU   @00                                                      00703000
APSVPTR  EQU   @13                                                      00704000
APACBPTR EQU   @09                                                      00705000
APATPTR  EQU   @11                                                      00706000
APAXPTR  EQU   @10                                                      00707000
APCIPTR  EQU   @08                                                      00708000
APCPPTR  EQU   @10                                                      00709000
APCQPTR  EQU   @09                                                      00710000
APCWPTR  EQU   @08                                                      00711000
APDEBPTR EQU   @08                                                      00712000
APDSPTR  EQU   @11                                                      00713000
APDXPTR  EQU   @11                                                      00714000
APENTRY  EQU   @15                                                      00715000
APERPTR  EQU   @08                                                      00716000
APEXLPTR EQU   @10                                                      00717000
APINPTR  EQU   @01                                                      00718000
APIOPTR  EQU   @10                                                      00719000
APLBPTR  EQU   @11                                                      00720000
APNPPNTR EQU   @05                                                      00721000
APOCPTR  EQU   @10                                                      00722000
APOTPTR  EQU   @09                                                      00723000
APRCODE  EQU   @15                                                      00724000
APRETURN EQU   @14                                                      00725000
APRLPTR  EQU   @08                                                      00726000
APSCPTR  EQU   @01                                                      00727000
APSMPTR  EQU   @01                                                      00728000
APUBPTR  EQU   @10                                                      00729000
APUTPTR  EQU   @11                                                      00730000
APXLPTR  EQU   @11                                                      00731000
JESCTPTR EQU   @00                                                      00732000
R0F      EQU   @00                                                      00733000
R0RSTD   EQU   @00                                                      00734000
R1F      EQU   @01                                                      00735000
R1RSTD   EQU   @01                                                      00736000
R10F     EQU   @10                                                      00737000
R10P     EQU   @10                                                      00738000
R10RSTD  EQU   @10                                                      00739000
R11F     EQU   @11                                                      00740000
R11P     EQU   @11                                                      00741000
R11RSTD  EQU   @11                                                      00742000
R12F     EQU   @12                                                      00743000
R12P     EQU   @12                                                      00744000
R12RSTD  EQU   @12                                                      00745000
R13F     EQU   @13                                                      00746000
R13RSTD  EQU   @13                                                      00747000
R14F     EQU   @14                                                      00748000
R14P     EQU   @14                                                      00749000
R14RSTD  EQU   @14                                                      00750000
R15F     EQU   @15                                                      00751000
R15RSTD  EQU   @15                                                      00752000
R2F      EQU   @02                                                      00753000
R2RSTD   EQU   @02                                                      00754000
R3F      EQU   @03                                                      00755000
R3RSTD   EQU   @03                                                      00756000
R4F      EQU   @04                                                      00757000
R4RSTD   EQU   @04                                                      00758000
R5F      EQU   @05                                                      00759000
R5P      EQU   @05                                                      00760000
R5RSTD   EQU   @05                                                      00761000
R6F      EQU   @06                                                      00762000
R6P      EQU   @06                                                      00763000
R6RSTD   EQU   @06                                                      00764000
R7F      EQU   @07                                                      00765000
R7P      EQU   @07                                                      00766000
R7RSTD   EQU   @07                                                      00767000
R8F      EQU   @08                                                      00768000
R8P      EQU   @08                                                      00769000
R8RSTD   EQU   @08                                                      00770000
R9F      EQU   @09                                                      00771000
R9P      EQU   @09                                                      00772000
R9RSTD   EQU   @09                                                      00773000
         EXTRN IGTA10                                                   00774000
PSA      EQU   0                                                        00775000
FLCRNPSW EQU   PSA                                                      00776000
FLCROPSW EQU   PSA+8                                                    00777000
FLCICCW2 EQU   PSA+16                                                   00778000
FLCCVT   EQU   FLCICCW2                                                 00779000
PSAEEPSW EQU   PSA+132                                                  00780000
PSAESPSW EQU   PSA+136                                                  00781000
FLCSVILC EQU   PSAESPSW+1                                               00782000
PSAEPPSW EQU   PSA+140                                                  00783000
FLCPIILC EQU   PSAEPPSW+1                                               00784000
FLCPICOD EQU   PSAEPPSW+2                                               00785000
PSAPICOD EQU   FLCPICOD+1                                               00786000
FLCTEA   EQU   PSAEPPSW+4                                               00787000
FLCPER   EQU   PSA+152                                                  00788000
FLCMCLA  EQU   PSA+168                                                  00789000
FLCIOEL  EQU   FLCMCLA+4                                                00790000
FLCIOA   EQU   FLCMCLA+16                                               00791000
FLCFSA   EQU   FLCMCLA+80                                               00792000
PSASUPER EQU   PSA+552                                                  00793000
PSASUP1  EQU   PSASUPER                                                 00794000
PSASUP2  EQU   PSASUPER+1                                               00795000
PSASUP3  EQU   PSASUPER+2                                               00796000
PSASUP4  EQU   PSASUPER+3                                               00797000
PSACLHT  EQU   PSA+640                                                  00798000
PSALKSA  EQU   PSA+696                                                  00799000
PSAHLHI  EQU   PSA+760                                                  00800000
PSADSSFL EQU   PSA+836                                                  00801000
PSADSSF1 EQU   PSADSSFL                                                 00802000
PSADSSF3 EQU   PSADSSFL+2                                               00803000
PSADSSF4 EQU   PSADSSFL+3                                               00804000
PSARSVT  EQU   PSA+896                                                  00805000
APCT     EQU   0                                                        00806000
APCTENQM EQU   APCT+12                                                  00807000
APCTSMIN EQU   APCT+32                                                  00808000
APCTSMAD EQU   APCT+36                                                  00809000
APCTZ@@@ EQU   APCT+40                                                  00810000
APCTU@@@ EQU   APCT+440                                                 00811000
APCTBR14 EQU   APCT+840                                                 00812000
APCTERRS EQU   APCT+876                                                 00813000
@NM00013 EQU   APCT+936                                                 00814000
APCTSTAT EQU   @NM00013                                                 00815000
APCTPRSW EQU   @NM00013+1                                               00816000
APCTAPCQ EQU   APCT+944                                                 00817000
APCTCQAQ EQU   APCT+952                                                 00818000
APCTZ@@1 EQU   APCT+1120                                                00819000
APNP     EQU   0                                                        00820000
APNPID   EQU   APNP                                                     00821000
APNPAPOT EQU   APNP+120                                                 00822000
APNPBUFF EQU   APNP+128                                                 00823000
APNPCHAR EQU   APNP+228                                                 00824000
APNPCORE EQU   APNP+232                                                 00825000
APNPLOAD EQU   APNP+248                                                 00826000
APNPSNAM EQU   APNPLOAD+4                                               00827000
APNPMODL EQU   APNP+256                                                 00828000
APNPREGS EQU   APNP+272                                                 00829000
APNPSV13 EQU   APNP+336                                                 00830000
APNPSWIT EQU   APNP+348                                                 00831000
APNPBYT0 EQU   APNPSWIT                                                 00832000
APNPSTAT EQU   APNPBYT0                                                 00833000
APNPCVT  EQU   APNP+356                                                 00834000
APNPPDSP EQU   APNP+364                                                 00835000
APNPPDS2 EQU   APNP+368                                                 00836000
APNPSSCT EQU   APNP+372                                                 00837000
APNP30RT EQU   APNP+384                                                 00838000
APNPAPNP EQU   APNP30RT+12                                              00839000
APNPBLHD EQU   0                                                        00840000
APNPBLFF EQU   APNPBLHD                                                 00841000
APNPBLLL EQU   APNPBLHD+2                                               00842000
APNQ     EQU   0                                                        00843000
APNQA01  EQU   APNQ+8                                                   00844000
APNQA02  EQU   APNQ+12                                                  00845000
APNQA03  EQU   APNQ+16                                                  00846000
APNQA04  EQU   APNQ+20                                                  00847000
APNQA05  EQU   APNQ+24                                                  00848000
APNQA06  EQU   APNQ+28                                                  00849000
APNQA07  EQU   APNQ+32                                                  00850000
APNQA08  EQU   APNQ+36                                                  00851000
APNQA09  EQU   APNQ+40                                                  00852000
APNQA10  EQU   APNQ+44                                                  00853000
APNQA11  EQU   APNQ+48                                                  00854000
APNQM01  EQU   0                                                        00855000
APNQ01T2 EQU   APNQM01+12                                               00856000
APNQM02  EQU   0                                                        00857000
APNQ02T2 EQU   APNQM02+32                                               00858000
APNQM03  EQU   0                                                        00859000
APNQ03T2 EQU   APNQM03+45                                               00860000
APNQ03T4 EQU   APNQM03+53                                               00861000
APNQM04  EQU   0                                                        00862000
APNQM05  EQU   0                                                        00863000
APNQM06  EQU   0                                                        00864000
APNQM07  EQU   0                                                        00865000
APNQ07T2 EQU   APNQM07+12                                               00866000
APNQM08  EQU   0                                                        00867000
APNQM09  EQU   0                                                        00868000
APNQM10  EQU   0                                                        00869000
APNQM11  EQU   0                                                        00870000
APOT     EQU   0                                                        00871000
APOTNMAD EQU   APOT+16                                                  00872000
APOTVTAD EQU   APOT+24                                                  00873000
APOTADAD EQU   APOT+32                                                  00874000
APOTNM   EQU   0                                                        00875000
APOTNMFG EQU   APOTNM+10                                                00876000
APOTNMF0 EQU   APOTNMFG                                                 00877000
APOTVT   EQU   0                                                        00878000
APOTVTIT EQU   APOTVT+1                                                 00879000
APOTAD   EQU   0                                                        00880000
SSCT     EQU   0                                                        00881000
SSCTSCTA EQU   SSCT+4                                                   00882000
SSCTSNAM EQU   SSCT+8                                                   00883000
SSCTFLG1 EQU   SSCT+12                                                  00884000
SSCTUPSS EQU   SSCTFLG1                                                 00885000
SSCTSSVT EQU   SSCT+16                                                  00886000
JESCT    EQU   0                                                        00887000
JESWAA   EQU   JESCT+8                                                  00888000
JESSSREQ EQU   JESCT+20                                                 00889000
JESSSCT  EQU   JESCT+24                                                 00890000
JESALLOC EQU   JESCT+32                                                 00891000
JESUNALC EQU   JESCT+36                                                 00892000
JESCATL  EQU   JESCT+40                                                 00893000
PDS2     EQU   0                                                        00894000
PDS2NAME EQU   PDS2                                                     00895000
PDS2INDC EQU   PDS2+13                                                  00896000
PDS2TTRT EQU   PDS2+14                                                  00897000
PDS2ATR  EQU   PDS2+22                                                  00898000
PDS2ATR1 EQU   PDS2ATR                                                  00899000
PDS2ATR2 EQU   PDS2ATR+1                                                00900000
@NM00056 EQU   PDS2+32                                                  00901000
PDS2FTBO EQU   @NM00056                                                 00902000
PDS2FTB1 EQU   PDS2FTBO                                                 00903000
PDSS01   EQU   0                                                        00904000
PDSS02   EQU   0                                                        00905000
PDSS03   EQU   0                                                        00906000
PDSSSIWD EQU   PDSS03                                                   00907000
PDSSSIFB EQU   PDSSSIWD+1                                               00908000
PDSS04   EQU   0                                                        00909000
PDSAPF   EQU   PDSS04                                                   00910000
CVTMAP   EQU   0                                                        00911000
CVTLINK  EQU   CVTMAP+8                                                 00912000
CVTDAR   EQU   CVTMAP+72                                                00913000
CVTFLGS1 EQU   CVTDAR                                                   00914000
CVTDCB   EQU   CVTMAP+116                                               00915000
CVTIOQET EQU   CVTMAP+120                                               00916000
CVTIERLC EQU   CVTMAP+144                                               00917000
CVTHEAD  EQU   CVTMAP+160                                               00918000
CVTSV76C EQU   CVTHEAD                                                  00919000
CVTOPTA  EQU   CVTMAP+182                                               00920000
CVTOPTB  EQU   CVTMAP+183                                               00921000
CVTGTF   EQU   CVTMAP+236                                               00922000
CVTGTFST EQU   CVTGTF                                                   00923000
CVTGTFS  EQU   CVTGTFST                                                 00924000
CVTSTATE EQU   CVTGTFST                                                 00925000
CVTTMODE EQU   CVTGTFST                                                 00926000
CVTFORM  EQU   CVTGTFST                                                 00927000
CVTAQAVT EQU   CVTMAP+240                                               00928000
CVTTCMFG EQU   CVTAQAVT                                                 00929000
CVTVOLM2 EQU   CVTMAP+244                                               00930000
CVTTATA  EQU   CVTVOLM2                                                 00931000
CVTTSKS  EQU   CVTTATA                                                  00932000
CVTVOLF2 EQU   CVTTSKS                                                  00933000
CVTTAT   EQU   CVTTATA+1                                                00934000
CVTATER  EQU   CVTMAP+248                                               00935000
CVTEXT1  EQU   CVTMAP+252                                               00936000
CVTPURG  EQU   CVTMAP+260                                               00937000
CVTQMSG  EQU   CVTMAP+268                                               00938000
CVTDMSR  EQU   CVTMAP+272                                               00939000
CVTRSV37 EQU   CVTDMSR                                                  00940000
CVTDMSRF EQU   CVTRSV37                                                 00941000
CVTJESCT EQU   CVTMAP+296                                               00942000
CVTERPV  EQU   CVTMAP+316                                               00943000
CVTINTLA EQU   CVTMAP+320                                               00944000
CVTAPF   EQU   CVTMAP+324                                               00945000
CVTEXT2  EQU   CVTMAP+328                                               00946000
CVTHJES  EQU   CVTMAP+332                                               00947000
CVTPGSIA EQU   CVTMAP+348                                               00948000
CVTA1F1  EQU   CVTMAP+356                                               00949000
CVTSYSK  EQU   CVTMAP+357                                               00950000
CVTVOLM1 EQU   CVTMAP+380                                               00951000
CVTVOLF1 EQU   CVTVOLM1                                                 00952000
CVTATMCT EQU   CVTMAP+388                                               00953000
CVTXTNT1 EQU   0                                                        00954000
CVTXTNT2 EQU   0                                                        00955000
CVTDSSV  EQU   CVTXTNT2                                                 00956000
CVTFLGBT EQU   CVTXTNT2+5                                               00957000
CVTQID   EQU   CVTXTNT2+24                                              00958000
CVTRV400 EQU   CVTXTNT2+52                                              00959000
CVTRV409 EQU   CVTXTNT2+53                                              00960000
CVTATCVT EQU   CVTXTNT2+64                                              00961000
CVTRV429 EQU   CVTXTNT2+84                                              00962000
CVTRV438 EQU   CVTXTNT2+85                                              00963000
CVTRV457 EQU   CVTXTNT2+112                                             00964000
CVTRV466 EQU   CVTXTNT2+113                                             00965000
CVTFIX   EQU   0                                                        00966000
CVTRELNO EQU   CVTFIX+252                                               00967000
IEFAB4F5 EQU   0                                                        00968000
IEFBB410 EQU   0                                                        00969000
IEFW21SD EQU   0                                                        00970000
I001C    EQU   0                                                        00971000
I008P    EQU   0                                                        00972000
I015F    EQU   0                                                        00973000
I015P    EQU   0                                                        00974000
I031F    EQU   0                                                        00975000
I031P    EQU   0                                                        00976000
I256C    EQU   0                                                        00977000
SSREQ    EQU   0                                                        00978000
SWAMGR   EQU   0                                                        00979000
PARMSSCT EQU   0                                                        00980000
PARMRTE  EQU   0                                                        00981000
PARMAREA EQU   0                                                        00982000
CVTPTR   EQU   APNPCVT                                                  00983000
PDSPTRV  EQU   APNPPDSP                                                 00984000
PDS2PTR  EQU   APNPPDS2                                                 00985000
SSCTPTR  EQU   APNPSSCT                                                 00986000
APCTZ    EQU   APCTZ@@@                                                 00987000
APCTZ1   EQU   APCTZ@@1                                                 00988000
APCTU    EQU   APCTU@@@                                                 00989000
PSARSVTE EQU   PSARSVT                                                  00990000
CVTS01   EQU   CVTPGSIA                                                 00991000
CVTLPDIA EQU   CVTS01+12                                                00992000
CVTDIRST EQU   CVTLPDIA                                                 00993000
CVTSLIDA EQU   CVTS01+24                                                00994000
CVTCTLFG EQU   CVTS01+50                                                00995000
CVTRV210 EQU   CVTS01+424                                               00996000
CVTRV219 EQU   CVTS01+425                                               00997000
CVTRV228 EQU   CVTS01+426                                               00998000
CVTRV237 EQU   CVTS01+427                                               00999000
CVTMFRTR EQU   CVTS01+452                                               01000000
CVTRV262 EQU   CVTS01+468                                               01001000
CVTRV271 EQU   CVTS01+469                                               01002000
CVTRV280 EQU   CVTS01+470                                               01003000
CVTRV289 EQU   CVTS01+471                                               01004000
CVTGSDA  EQU   CVTS01+600                                               01005000
FLC      EQU   PSA                                                      01006000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01007000
CVTRV628 EQU   CVTS01+728                                               01008000
CVTRV627 EQU   CVTS01+724                                               01009000
CVTRV626 EQU   CVTS01+720                                               01010000
CVTRV625 EQU   CVTS01+716                                               01011000
CVTRV624 EQU   CVTS01+712                                               01012000
CVTRV623 EQU   CVTS01+708                                               01013000
CVTRV622 EQU   CVTS01+704                                               01014000
CVTRV621 EQU   CVTS01+700                                               01015000
CVTIHASU EQU   CVTS01+696                                               01016000
CVTSUSP  EQU   CVTS01+692                                               01017000
CVTT6SVC EQU   CVTS01+688                                               01018000
CVTCDAL  EQU   CVTS01+684                                               01019000
CVTTCTL  EQU   CVTS01+680                                               01020000
CVTRSUME EQU   CVTS01+676                                               01021000
CVTJTERM EQU   CVTS01+672                                               01022000
CVTASMRM EQU   CVTS01+668                                               01023000
CVTTCASP EQU   CVTS01+664                                               01024000
CVT0PT03 EQU   CVTS01+660                                               01025000
CVT0PT0E EQU   CVTS01+656                                               01026000
CVTRV609 EQU   CVTS01+652                                               01027000
CVTCGK   EQU   CVTS01+648                                               01028000
CVTRAC   EQU   CVTS01+644                                               01029000
CVTRV606 EQU   CVTS01+640                                               01030000
CVTRV605 EQU   CVTS01+636                                               01031000
CVTRV604 EQU   CVTS01+632                                               01032000
CVTEFF02 EQU   CVTS01+628                                               01033000
CVTCBBR  EQU   CVTS01+624                                               01034000
CVTSSCR  EQU   CVTS01+620                                               01035000
CVTEVENT EQU   CVTS01+616                                               01036000
CVTCRCA  EQU   CVTS01+612                                               01037000
CVTTPIO  EQU   CVTS01+608                                               01038000
CVTADV   EQU   CVTS01+604                                               01039000
CVTGSDAB EQU   CVTGSDA                                                  01040000
CVTQV3   EQU   CVTS01+596                                               01041000
CVTQV2   EQU   CVTS01+592                                               01042000
CVTQV1   EQU   CVTS01+588                                               01043000
CVTRPT   EQU   CVTS01+584                                               01044000
CVTSSRB  EQU   CVTS01+580                                               01045000
CVTCSDRL EQU   CVTS01+576                                               01046000
CVTEXP1  EQU   CVTS01+572                                               01047000
CVTRMPMT EQU   CVTS01+568                                               01048000
CVTRMPTT EQU   CVTS01+564                                               01049000
CVTVPSA  EQU   CVTS01+560                                               01050000
CVTVSTOP EQU   CVTS01+556                                               01051000
CVTGTFR8 EQU   CVTS01+552                                               01052000
CVTQUIT  EQU   CVTS01+548                                               01053000
CVTVACR  EQU   CVTS01+544                                               01054000
CVTWTCB  EQU   CVTS01+540                                               01055000
CVTSTPRS EQU   CVTS01+536                                               01056000
CVT0PT02 EQU   CVTS01+532                                               01057000
CVTDARCM EQU   CVTS01+528                                               01058000
CVTIRECM EQU   CVTS01+524                                               01059000
CVTJRECM EQU   CVTS01+520                                               01060000
CVTVEMS0 EQU   CVTS01+516                                               01061000
CVTSPFRR EQU   CVTS01+512                                               01062000
CVTRLSTG EQU   CVTS01+508                                               01063000
CVT0TC0A EQU   CVTS01+504                                               01064000
CVTGMBR  EQU   CVTS01+500                                               01065000
CVTLFRM  EQU   CVTS01+496                                               01066000
CVTRMBR  EQU   CVTS01+492                                               01067000
CVTVIOP  EQU   CVTS01+488                                               01068000
CVTRV307 EQU   CVTS01+486                                               01069000
CVTRV306 EQU   CVTS01+484                                               01070000
CVTRV305 EQU   CVTS01+482                                               01071000
CVTRV304 EQU   CVTS01+480                                               01072000
CVTRV303 EQU   CVTS01+478                                               01073000
CVTRV302 EQU   CVTS01+476                                               01074000
CVTTRCA  EQU   CVTS01+472                                               01075000
CVTRV297 EQU   CVTRV289                                                 01076000
CVTRV296 EQU   CVTRV289                                                 01077000
CVTRV295 EQU   CVTRV289                                                 01078000
CVTRV294 EQU   CVTRV289                                                 01079000
CVTRV293 EQU   CVTRV289                                                 01080000
CVTRV292 EQU   CVTRV289                                                 01081000
CVTRV291 EQU   CVTRV289                                                 01082000
CVTRV290 EQU   CVTRV289                                                 01083000
CVTRV288 EQU   CVTRV280                                                 01084000
CVTRV287 EQU   CVTRV280                                                 01085000
CVTRV286 EQU   CVTRV280                                                 01086000
CVTRV285 EQU   CVTRV280                                                 01087000
CVTRV284 EQU   CVTRV280                                                 01088000
CVTRV283 EQU   CVTRV280                                                 01089000
CVTRV282 EQU   CVTRV280                                                 01090000
CVTRV281 EQU   CVTRV280                                                 01091000
CVTRV279 EQU   CVTRV271                                                 01092000
CVTRV278 EQU   CVTRV271                                                 01093000
CVTRV277 EQU   CVTRV271                                                 01094000
CVTRV276 EQU   CVTRV271                                                 01095000
CVTRV275 EQU   CVTRV271                                                 01096000
CVTRV274 EQU   CVTRV271                                                 01097000
CVTRV273 EQU   CVTRV271                                                 01098000
CVTRV272 EQU   CVTRV271                                                 01099000
CVTRV270 EQU   CVTRV262                                                 01100000
CVTRV269 EQU   CVTRV262                                                 01101000
CVTRV268 EQU   CVTRV262                                                 01102000
CVTRV267 EQU   CVTRV262                                                 01103000
CVTRV266 EQU   CVTRV262                                                 01104000
CVTRV265 EQU   CVTRV262                                                 01105000
CVTRV264 EQU   CVTRV262                                                 01106000
CVTRV263 EQU   CVTRV262                                                 01107000
CVTVFP   EQU   CVTS01+464                                               01108000
CVTVSI   EQU   CVTS01+460                                               01109000
CVTVPSIB EQU   CVTS01+456                                               01110000
CVTMFACT EQU   CVTMFRTR                                                 01111000
CVTMFCTL EQU   CVTS01+448                                               01112000
CVTPVBP  EQU   CVTS01+444                                               01113000
CVTPWI   EQU   CVTS01+440                                               01114000
CVTRV254 EQU   CVTS01+438                                               01115000
CVTRV253 EQU   CVTS01+436                                               01116000
CVTRV252 EQU   CVTS01+434                                               01117000
CVTRV251 EQU   CVTS01+433                                               01118000
CVTRV250 EQU   CVTS01+432                                               01119000
CVTRV249 EQU   CVTS01+431                                               01120000
CVTRV248 EQU   CVTS01+430                                               01121000
CVTRV247 EQU   CVTS01+429                                               01122000
CVTRV246 EQU   CVTS01+428                                               01123000
CVTRV245 EQU   CVTRV237                                                 01124000
CVTRV244 EQU   CVTRV237                                                 01125000
CVTRV243 EQU   CVTRV237                                                 01126000
CVTRV242 EQU   CVTRV237                                                 01127000
CVTRV241 EQU   CVTRV237                                                 01128000
CVTRV240 EQU   CVTRV237                                                 01129000
CVTRV239 EQU   CVTRV237                                                 01130000
CVTRV238 EQU   CVTRV237                                                 01131000
CVTRV236 EQU   CVTRV228                                                 01132000
CVTRV235 EQU   CVTRV228                                                 01133000
CVTRV234 EQU   CVTRV228                                                 01134000
CVTRV233 EQU   CVTRV228                                                 01135000
CVTRV232 EQU   CVTRV228                                                 01136000
CVTRV231 EQU   CVTRV228                                                 01137000
CVTRV230 EQU   CVTRV228                                                 01138000
CVTRV229 EQU   CVTRV228                                                 01139000
CVTRV227 EQU   CVTRV219                                                 01140000
CVTRV226 EQU   CVTRV219                                                 01141000
CVTRV225 EQU   CVTRV219                                                 01142000
CVTRV224 EQU   CVTRV219                                                 01143000
CVTRV223 EQU   CVTRV219                                                 01144000
CVTRV222 EQU   CVTRV219                                                 01145000
CVTRV221 EQU   CVTRV219                                                 01146000
CVTRV220 EQU   CVTRV219                                                 01147000
CVTRV218 EQU   CVTRV210                                                 01148000
CVTRV217 EQU   CVTRV210                                                 01149000
CVTRV216 EQU   CVTRV210                                                 01150000
CVTRV215 EQU   CVTRV210                                                 01151000
CVTRV214 EQU   CVTRV210                                                 01152000
CVTRV213 EQU   CVTRV210                                                 01153000
CVTRV212 EQU   CVTRV210                                                 01154000
CVTRV211 EQU   CVTRV210                                                 01155000
CVTLCCAT EQU   CVTS01+420                                               01156000
CVTPCCAT EQU   CVTS01+416                                               01157000
CVTIPCRP EQU   CVTS01+412                                               01158000
CVTIPCRI EQU   CVTS01+408                                               01159000
CVTIPCDS EQU   CVTS01+404                                               01160000
CVTAIDVT EQU   CVTS01+400                                               01161000
CVTSSAP  EQU   CVTS01+396                                               01162000
CVTEHCIR EQU   CVTS01+392                                               01163000
CVTEHDEF EQU   CVTS01+388                                               01164000
CVTDAIR  EQU   CVTS01+384                                               01165000
CVTPERFM EQU   CVTS01+380                                               01166000
CVT044R2 EQU   CVTS01+376                                               01167000
CVTFETCH EQU   CVTS01+372                                               01168000
CVTRSTWD EQU   CVTS01+368                                               01169000
CVTSPOST EQU   CVTS01+364                                               01170000
CVTIOBP  EQU   CVTS01+360                                               01171000
CVTASMVT EQU   CVTS01+356                                               01172000
CVTRECRQ EQU   CVTS01+352                                               01173000
CVTWSAC  EQU   CVTS01+348                                               01174000
CVTRV149 EQU   CVTS01+344                                               01175000
CVTWSAL  EQU   CVTS01+340                                               01176000
CVTSPSA  EQU   CVTS01+336                                               01177000
CVTGLMN  EQU   CVTS01+332                                               01178000
CVTVEAC0 EQU   CVTS01+328                                               01179000
CVT062R1 EQU   CVTS01+324                                               01180000
CVTRPOST EQU   CVTS01+320                                               01181000
CVTDQIQE EQU   CVTS01+316                                               01182000
CVTCSD   EQU   CVTS01+312                                               01183000
CVTLKRMA EQU   CVTS01+308                                               01184000
CVTRSPIE EQU   CVTS01+304                                               01185000
CVTRENQ  EQU   CVTS01+300                                               01186000
CVTLQCB  EQU   CVTS01+296                                               01187000
CVTFQCB  EQU   CVTS01+292                                               01188000
CVTQCS01 EQU   CVTS01+288                                               01189000
CVTAPFT  EQU   CVTS01+284                                               01190000
CVTPARRL EQU   CVTS01+280                                               01191000
CVTVWAIT EQU   CVTS01+276                                               01192000
CVTGSPL  EQU   CVTS01+272                                               01193000
CVTLSMQ  EQU   CVTS01+268                                               01194000
CVTGSMQ  EQU   CVTS01+264                                               01195000
CVTEXPRO EQU   CVTS01+260                                               01196000
CVTOPCTP EQU   CVTS01+256                                               01197000
CVTSIC   EQU   CVTS01+252                                               01198000
CVTTPIOS EQU   CVTS01+248                                               01199000
CVTRTMS  EQU   CVTS01+244                                               01200000
CVTSDBF  EQU   CVTS01+240                                               01201000
CVTSCBP  EQU   CVTS01+236                                               01202000
CVTSDMP  EQU   CVTS01+232                                               01203000
CVTSV60  EQU   CVTS01+228                                               01204000
CVTRTMCT EQU   CVTS01+224                                               01205000
CVTASCBL EQU   CVTS01+220                                               01206000
CVTASCBH EQU   CVTS01+216                                               01207000
CVTGDA   EQU   CVTS01+212                                               01208000
CVTASVT  EQU   CVTS01+208                                               01209000
CVTVVMDI EQU   CVTS01+204                                               01210000
CVTAQTOP EQU   CVTS01+200                                               01211000
CVTIOSCS EQU   CVTS01+196                                               01212000
CVTSDRM  EQU   CVTS01+192                                               01213000
CVTOPTE  EQU   CVTS01+188                                               01214000
CVTSTXU  EQU   CVTS01+184                                               01215000
CVTQUIS  EQU   CVTS01+180                                               01216000
CVTPARS  EQU   CVTS01+176                                               01217000
CVTS1EE  EQU   CVTS01+172                                               01218000
CVTFRAS  EQU   CVTS01+168                                               01219000
CVTQSAS  EQU   CVTS01+164                                               01220000
CVTCRAS  EQU   CVTS01+160                                               01221000
CVTCRMN  EQU   CVTS01+156                                               01222000
CVTDELCP EQU   CVTS01+152                                               01223000
CVTFRECL EQU   CVTS01+148                                               01224000
CVTGETCL EQU   CVTS01+144                                               01225000
CVTBLDCP EQU   CVTS01+140                                               01226000
CVTAUTHL EQU   CVTS01+136                                               01227000
CVTSCAN  EQU   CVTS01+132                                               01228000
CVTRV144 EQU   CVTS01+130                                               01229000
CVTMAXMP EQU   CVTS01+128                                               01230000
CVTSTCK  EQU   CVTS01+124                                               01231000
CVTRV139 EQU   CVTS01+123                                               01232000
CVTDSSAC EQU   CVTS01+122                                               01233000
CVTRV513 EQU   CVTS01+121                                               01234000
CVTIOSPL EQU   CVTS01+120                                               01235000
CVTPTGT  EQU   CVTS01+116                                               01236000
CVTCSPIE EQU   CVTS01+112                                               01237000
CVTSMFEX EQU   CVTS01+108                                               01238000
CVTOLT0A EQU   CVTS01+104                                               01239000
CVTSRBRT EQU   CVTS01+100                                               01240000
CVTPUTL  EQU   CVTS01+96                                                01241000
CVTASCRL EQU   CVTS01+92                                                01242000
CVTASCRF EQU   CVTS01+88                                                01243000
CVTRV326 EQU   CVTS01+84                                                01244000
CVTRV325 EQU   CVTS01+80                                                01245000
CVTRV324 EQU   CVTS01+76                                                01246000
CVT0VL01 EQU   CVTS01+72                                                01247000
CVTSHRVM EQU   CVTS01+68                                                01248000
CVTRV332 EQU   CVTS01+64                                                01249000
CVTTAS   EQU   CVTS01+60                                                01250000
CVTRSCN  EQU   CVTS01+56                                                01251000
CVTTRAC2 EQU   CVTS01+54                                                01252000
CVTTRACE EQU   CVTS01+52                                                01253000
CVTAPG   EQU   CVTS01+51                                                01254000
CVTSDTRC EQU   CVTCTLFG                                                 01255000
CVTGTRCE EQU   CVTCTLFG                                                 01256000
CVTNOMP  EQU   CVTCTLFG                                                 01257000
CVTRSV79 EQU   CVTCTLFG                                                 01258000
CVTDSTAT EQU   CVTCTLFG                                                 01259000
CVTRSV78 EQU   CVTCTLFG                                                 01260000
CVTRV333 EQU   CVTCTLFG                                                 01261000
CVTRV323 EQU   CVTCTLFG                                                 01262000
CVTSPVLK EQU   CVTS01+49                                                01263000
CVTRSV77 EQU   CVTS01+48                                                01264000
CVTRV331 EQU   CVTS01+44                                                01265000
CVTRV330 EQU   CVTS01+40                                                01266000
CVTRV329 EQU   CVTS01+36                                                01267000
CVTRV328 EQU   CVTS01+32                                                01268000
CVTRV322 EQU   CVTS01+28                                                01269000
CVTSLID  EQU   CVTSLIDA+1                                               01270000
CVTSYLK  EQU   CVTSLIDA                                                 01271000
CVTRV321 EQU   CVTS01+20                                                01272000
CVTRV320 EQU   CVTS01+16                                                01273000
CVTLPDIR EQU   CVTLPDIA+1                                               01274000
CVTRSV69 EQU   CVTDIRST                                                 01275000
CVTRSV68 EQU   CVTDIRST                                                 01276000
CVTRSV67 EQU   CVTDIRST                                                 01277000
CVTRSV66 EQU   CVTDIRST                                                 01278000
CVTRSV65 EQU   CVTDIRST                                                 01279000
CVTRSV64 EQU   CVTDIRST                                                 01280000
CVTRSV63 EQU   CVTDIRST                                                 01281000
CVTDICOM EQU   CVTDIRST                                                 01282000
CVTPVTP  EQU   CVTS01+8                                                 01283000
CVTLPDSR EQU   CVTS01+4                                                 01284000
CVTGETL  EQU   CVTS01                                                   01285000
PSARSAV  EQU   PSARSVTE+60                                              01286000
PSARSTK  EQU   PSARSVTE+56                                              01287000
PSAESAV3 EQU   PSARSVTE+52                                              01288000
PSAESTK3 EQU   PSARSVTE+48                                              01289000
PSAESAV2 EQU   PSARSVTE+44                                              01290000
PSAESTK2 EQU   PSARSVTE+40                                              01291000
PSAESAV1 EQU   PSARSVTE+36                                              01292000
PSAESTK1 EQU   PSARSVTE+32                                              01293000
PSAPSAV  EQU   PSARSVTE+28                                              01294000
PSAPSTK  EQU   PSARSVTE+24                                              01295000
PSAMSAV  EQU   PSARSVTE+20                                              01296000
PSAMSTK  EQU   PSARSVTE+16                                              01297000
PSASSAV  EQU   PSARSVTE+12                                              01298000
PSASSTK  EQU   PSARSVTE+8                                               01299000
PSANSTK  EQU   PSARSVTE+4                                               01300000
PSACSTK  EQU   PSARSVTE                                                 01301000
@NM00045 EQU   APCTU+48                                                 01302000
APCT1JBJ EQU   APCTU+44                                                 01303000
APCT2JHL EQU   APCTU+40                                                 01304000
APCT1JHL EQU   APCTU+36                                                 01305000
APCT1JHT EQU   APCTU+32                                                 01306000
APCT2JHC EQU   APCTU+28                                                 01307000
APCT1JHC EQU   APCTU+24                                                 01308000
APCT1JAA EQU   APCTU+20                                                 01309000
APCT1MBM EQU   APCTU+16                                                 01310000
APCT1CMD EQU   APCTU+12                                                 01311000
APCT2MBD EQU   APCTU+8                                                  01312000
APCT1MBD EQU   APCTU+4                                                  01313000
APCT1MAB EQU   APCTU                                                    01314000
@NM00044 EQU   APCTZ1+108                                               01315000
APCTZKGD EQU   APCTZ1+104                                               01316000
APCTZKGC EQU   APCTZ1+100                                               01317000
APCTZKGB EQU   APCTZ1+96                                                01318000
APCTZKGA EQU   APCTZ1+92                                                01319000
APCTZJAX EQU   APCTZ1+88                                                01320000
APCTZDWI EQU   APCTZ1+84                                                01321000
APCTZLCB EQU   APCTZ1+80                                                01322000
APCTZLCA EQU   APCTZ1+76                                                01323000
APCTZJDM EQU   APCTZ1+72                                                01324000
APCTZJDG EQU   APCTZ1+68                                                01325000
APCTZJDD EQU   APCTZ1+64                                                01326000
APCTZKBF EQU   APCTZ1+60                                                01327000
APCTZUKA EQU   APCTZ1+56                                                01328000
@NM00043 EQU   APCTZ1+52                                                01329000
@NM00042 EQU   APCTZ1+48                                                01330000
@NM00041 EQU   APCTZ1+44                                                01331000
APCTZKBE EQU   APCTZ1+40                                                01332000
@NM00040 EQU   APCTZ1+36                                                01333000
@NM00039 EQU   APCTZ1+32                                                01334000
APCTZKBD EQU   APCTZ1+28                                                01335000
APCTZJHQ EQU   APCTZ1+24                                                01336000
APCTZJHC EQU   APCTZ1+20                                                01337000
@NM00038 EQU   APCTZ1+16                                                01338000
@NM00037 EQU   APCTZ1+12                                                01339000
APCTZKBB EQU   APCTZ1+8                                                 01340000
APCTZKBC EQU   APCTZ1+4                                                 01341000
APCTZKBA EQU   APCTZ1                                                   01342000
@NM00036 EQU   APCTZ+396                                                01343000
APCTZJHW EQU   APCTZ+392                                                01344000
APCTZJHT EQU   APCTZ+388                                                01345000
APCTZJHR EQU   APCTZ+384                                                01346000
APCTZDQR EQU   APCTZ+380                                                01347000
APCTZJHE EQU   APCTZ+376                                                01348000
APCTZJHF EQU   APCTZ+372                                                01349000
APCTZJHO EQU   APCTZ+368                                                01350000
APCTZJH6 EQU   APCTZ+364                                                01351000
APCTZJDJ EQU   APCTZ+360                                                01352000
APCTZJDA EQU   APCTZ+356                                                01353000
@NM00035 EQU   APCTZ+352                                                01354000
@NM00034 EQU   APCTZ+348                                                01355000
APCTZKDA EQU   APCTZ+344                                                01356000
APCTZKCA EQU   APCTZ+340                                                01357000
@NM00033 EQU   APCTZ+336                                                01358000
APCTZJBM EQU   APCTZ+332                                                01359000
APCTZJBJ EQU   APCTZ+328                                                01360000
APCTZJBG EQU   APCTZ+324                                                01361000
APCTZJBD EQU   APCTZ+320                                                01362000
APCTZJBA EQU   APCTZ+316                                                01363000
APCTZJJ0 EQU   APCTZ+312                                                01364000
APCTZJI3 EQU   APCTZ+308                                                01365000
APCTZJI0 EQU   APCTZ+304                                                01366000
APCTZJH0 EQU   APCTZ+300                                                01367000
APCTZMIF EQU   APCTZ+296                                                01368000
@NM00032 EQU   APCTZ+292                                                01369000
APCTZD83 EQU   APCTZ+288                                                01370000
APCTZMIC EQU   APCTZ+284                                                01371000
APCTZMIB EQU   APCTZ+280                                                01372000
APCTZD82 EQU   APCTZ+276                                                01373000
APCTZKAA EQU   APCTZ+272                                                01374000
APCTZDAP EQU   APCTZ+268                                                01375000
APCTZUJA EQU   APCTZ+264                                                01376000
APCTZUFA EQU   APCTZ+260                                                01377000
APCTZJAY EQU   APCTZ+256                                                01378000
APCTZJAP EQU   APCTZ+252                                                01379000
APCTZJAM EQU   APCTZ+248                                                01380000
APCTZJAJ EQU   APCTZ+244                                                01381000
APCTZJAG EQU   APCTZ+240                                                01382000
APCTZJAD EQU   APCTZ+236                                                01383000
APCTZJAA EQU   APCTZ+232                                                01384000
APCTZJFA EQU   APCTZ+228                                                01385000
APCTZUHB EQU   APCTZ+224                                                01386000
APCTZUHA EQU   APCTZ+220                                                01387000
APCTZDIO EQU   APCTZ+216                                                01388000
APCTZUAG EQU   APCTZ+212                                                01389000
APCTZUAF EQU   APCTZ+208                                                01390000
APCTZDUA EQU   APCTZ+204                                                01391000
APCTZDDQ EQU   APCTZ+200                                                01392000
APCTZDEQ EQU   APCTZ+196                                                01393000
APCTZDUL EQU   APCTZ+192                                                01394000
APCTZDDA EQU   APCTZ+188                                                01395000
APCTZDIP EQU   APCTZ+184                                                01396000
APCTZDBK EQU   APCTZ+180                                                01397000
APCTZDAL EQU   APCTZ+176                                                01398000
APCTZDMM EQU   APCTZ+172                                                01399000
APCTZDWT EQU   APCTZ+168                                                01400000
APCTZMJI EQU   APCTZ+164                                                01401000
APCTZDRI EQU   APCTZ+160                                                01402000
APCTZDID EQU   APCTZ+156                                                01403000
APCTZD81 EQU   APCTZ+152                                                01404000
APCTZDMD EQU   APCTZ+148                                                01405000
APCTZMMA EQU   APCTZ+144                                                01406000
APCTZMJH EQU   APCTZ+140                                                01407000
APCTZMJC EQU   APCTZ+136                                                01408000
APCTZMJB EQU   APCTZ+132                                                01409000
APCTZMBM EQU   APCTZ+128                                                01410000
APCTZMBK EQU   APCTZ+124                                                01411000
APCTZMBH EQU   APCTZ+120                                                01412000
APCTZDX4 EQU   APCTZ+116                                                01413000
APCTZDX3 EQU   APCTZ+112                                                01414000
APCTZDX2 EQU   APCTZ+108                                                01415000
APCTZDX1 EQU   APCTZ+104                                                01416000
APCTZMBR EQU   APCTZ+100                                                01417000
APCTZMBG EQU   APCTZ+96                                                 01418000
APCTZMBD EQU   APCTZ+92                                                 01419000
APCTZMBA EQU   APCTZ+88                                                 01420000
APCTZD4E EQU   APCTZ+84                                                 01421000
APCTZD80 EQU   APCTZ+80                                                 01422000
APCTZD60 EQU   APCTZ+76                                                 01423000
APCTZD49 EQU   APCTZ+72                                                 01424000
APCTZD48 EQU   APCTZ+68                                                 01425000
APCTZD47 EQU   APCTZ+64                                                 01426000
APCTZD46 EQU   APCTZ+60                                                 01427000
APCTZD45 EQU   APCTZ+56                                                 01428000
APCTZD44 EQU   APCTZ+52                                                 01429000
APCTZD43 EQU   APCTZ+48                                                 01430000
APCTZD42 EQU   APCTZ+44                                                 01431000
APCTZD41 EQU   APCTZ+40                                                 01432000
APCTZD40 EQU   APCTZ+36                                                 01433000
APCTZD20 EQU   APCTZ+32                                                 01434000
APCTZD10 EQU   APCTZ+28                                                 01435000
APCTZUBB EQU   APCTZ+24                                                 01436000
@NM00031 EQU   APCTZ+20                                                 01437000
APCTZUAE EQU   APCTZ+16                                                 01438000
APCTZUAD EQU   APCTZ+12                                                 01439000
APCTZUAC EQU   APCTZ+8                                                  01440000
APCTZUAB EQU   APCTZ+4                                                  01441000
APCTZUAA EQU   APCTZ                                                    01442000
CVTLEVL  EQU   CVTRELNO+2                                               01443000
CVTNUMB  EQU   CVTRELNO                                                 01444000
CVTMDL   EQU   CVTFIX+250                                               01445000
@NM00085 EQU   CVTFIX+248                                               01446000
@NM00084 EQU   CVTFIX                                                   01447000
CVTRV482 EQU   CVTXTNT2+128                                             01448000
CVTRV481 EQU   CVTXTNT2+124                                             01449000
CVTRV480 EQU   CVTXTNT2+120                                             01450000
CVTRV479 EQU   CVTXTNT2+118                                             01451000
CVTRV478 EQU   CVTXTNT2+117                                             01452000
CVTRV477 EQU   CVTXTNT2+116                                             01453000
CVTRV476 EQU   CVTXTNT2+115                                             01454000
CVTRV475 EQU   CVTXTNT2+114                                             01455000
CVTRV474 EQU   CVTRV466                                                 01456000
CVTRV473 EQU   CVTRV466                                                 01457000
CVTRV472 EQU   CVTRV466                                                 01458000
CVTRV471 EQU   CVTRV466                                                 01459000
CVTRV470 EQU   CVTRV466                                                 01460000
CVTRV469 EQU   CVTRV466                                                 01461000
CVTRV468 EQU   CVTRV466                                                 01462000
CVTRV467 EQU   CVTRV466                                                 01463000
CVTRV465 EQU   CVTRV457                                                 01464000
CVTRV464 EQU   CVTRV457                                                 01465000
CVTRV463 EQU   CVTRV457                                                 01466000
CVTRV462 EQU   CVTRV457                                                 01467000
CVTRV461 EQU   CVTRV457                                                 01468000
CVTRV460 EQU   CVTRV457                                                 01469000
CVTRV459 EQU   CVTRV457                                                 01470000
CVTRV458 EQU   CVTRV457                                                 01471000
CVTRV456 EQU   CVTXTNT2+108                                             01472000
CVTRV455 EQU   CVTXTNT2+104                                             01473000
CVTRV454 EQU   CVTXTNT2+100                                             01474000
CVTRV453 EQU   CVTXTNT2+96                                              01475000
CVTRV452 EQU   CVTXTNT2+94                                              01476000
CVTRV451 EQU   CVTXTNT2+92                                              01477000
CVTRV450 EQU   CVTXTNT2+90                                              01478000
CVTRV449 EQU   CVTXTNT2+88                                              01479000
CVTRV448 EQU   CVTXTNT2+87                                              01480000
CVTRV447 EQU   CVTXTNT2+86                                              01481000
CVTRV446 EQU   CVTRV438                                                 01482000
CVTRV445 EQU   CVTRV438                                                 01483000
CVTRV444 EQU   CVTRV438                                                 01484000
CVTRV443 EQU   CVTRV438                                                 01485000
CVTRV442 EQU   CVTRV438                                                 01486000
CVTRV441 EQU   CVTRV438                                                 01487000
CVTRV440 EQU   CVTRV438                                                 01488000
CVTRV439 EQU   CVTRV438                                                 01489000
CVTRV437 EQU   CVTRV429                                                 01490000
CVTRV436 EQU   CVTRV429                                                 01491000
CVTRV435 EQU   CVTRV429                                                 01492000
CVTRV434 EQU   CVTRV429                                                 01493000
CVTRV433 EQU   CVTRV429                                                 01494000
CVTRV432 EQU   CVTRV429                                                 01495000
CVTRV431 EQU   CVTRV429                                                 01496000
CVTRV430 EQU   CVTRV429                                                 01497000
CVTRV428 EQU   CVTXTNT2+80                                              01498000
CVTRV427 EQU   CVTXTNT2+76                                              01499000
CVTRV426 EQU   CVTXTNT2+72                                              01500000
CVTRV425 EQU   CVTXTNT2+68                                              01501000
CVTATACT EQU   CVTATCVT                                                 01502000
CVTRV423 EQU   CVTXTNT2+62                                              01503000
CVTRV422 EQU   CVTXTNT2+60                                              01504000
CVTRV421 EQU   CVTXTNT2+58                                              01505000
CVTRV420 EQU   CVTXTNT2+56                                              01506000
CVTRV419 EQU   CVTXTNT2+55                                              01507000
CVTRV418 EQU   CVTXTNT2+54                                              01508000
CVTRV417 EQU   CVTRV409                                                 01509000
CVTRV416 EQU   CVTRV409                                                 01510000
CVTRV415 EQU   CVTRV409                                                 01511000
CVTRV414 EQU   CVTRV409                                                 01512000
CVTRV413 EQU   CVTRV409                                                 01513000
CVTRV412 EQU   CVTRV409                                                 01514000
CVTRV411 EQU   CVTRV409                                                 01515000
CVTRV410 EQU   CVTRV409                                                 01516000
CVTRV408 EQU   CVTRV400                                                 01517000
CVTRV407 EQU   CVTRV400                                                 01518000
CVTRV406 EQU   CVTRV400                                                 01519000
CVTRV405 EQU   CVTRV400                                                 01520000
CVTRV404 EQU   CVTRV400                                                 01521000
CVTRV403 EQU   CVTRV400                                                 01522000
CVTRV402 EQU   CVTRV400                                                 01523000
CVTRV401 EQU   CVTRV400                                                 01524000
CVTICB   EQU   CVTXTNT2+48                                              01525000
CVTSKTA  EQU   CVTXTNT2+44                                              01526000
CVTRSV99 EQU   CVTXTNT2+40                                              01527000
CVTRSV98 EQU   CVTXTNT2+36                                              01528000
CVTRSV97 EQU   CVTXTNT2+34                                              01529000
CVTRSV96 EQU   CVTXTNT2+32                                              01530000
CVTOLTEP EQU   CVTXTNT2+28                                              01531000
CVTQIDA  EQU   CVTQID+1                                                 01532000
CVTRSV95 EQU   CVTQID                                                   01533000
CVTRSV94 EQU   CVTXTNT2+20                                              01534000
CVTRSV93 EQU   CVTXTNT2+16                                              01535000
CVTRSV92 EQU   CVTXTNT2+12                                              01536000
CVTDEBVR EQU   CVTXTNT2+8                                               01537000
CVTRSV91 EQU   CVTXTNT2+6                                               01538000
CVTRSV9H EQU   CVTFLGBT                                                 01539000
CVTRSV9G EQU   CVTFLGBT                                                 01540000
CVTRSV9F EQU   CVTFLGBT                                                 01541000
CVTRSV9E EQU   CVTFLGBT                                                 01542000
CVTRSV9D EQU   CVTFLGBT                                                 01543000
CVTRSV9C EQU   CVTFLGBT                                                 01544000
CVTVME   EQU   CVTFLGBT                                                 01545000
CVTNPE   EQU   CVTFLGBT                                                 01546000
CVTNUCLS EQU   CVTXTNT2+4                                               01547000
CVTDSSVA EQU   CVTDSSV+1                                                01548000
CVTRSV89 EQU   CVTDSSV                                                  01549000
CVTRSV88 EQU   CVTXTNT1+8                                               01550000
CVTRSV87 EQU   CVTXTNT1+4                                               01551000
CVTFACHN EQU   CVTXTNT1                                                 01552000
CVTRV488 EQU   CVTMAP+412                                               01553000
CVTRV487 EQU   CVTMAP+408                                               01554000
CVTRV486 EQU   CVTMAP+404                                               01555000
CVTRV485 EQU   CVTMAP+400                                               01556000
CVTACTAP EQU   CVTMAP+396                                               01557000
CVTAUTH  EQU   CVTMAP+392                                               01558000
CVTATMCA EQU   CVTATMCT+1                                               01559000
CVTATMST EQU   CVTATMCT                                                 01560000
CVTRSV61 EQU   CVTMAP+384                                               01561000
CVTVOLT1 EQU   CVTVOLM1+1                                               01562000
CVTVOLI1 EQU   CVTVOLF1                                                 01563000
CVTSTOA  EQU   CVTMAP+376                                               01564000
CVTRSV58 EQU   CVTMAP+374                                               01565000
CVTRSV57 EQU   CVTMAP+372                                               01566000
CVTDDCE  EQU   CVTMAP+368                                               01567000
CVTPNWFR EQU   CVTMAP+364                                               01568000
CVTSMF   EQU   CVTMAP+360                                               01569000
CVTSULK  EQU   CVTMAP+358                                               01570000
CVTSLKO  EQU   CVTSYSK                                                  01571000
CVTSLKP  EQU   CVTSYSK                                                  01572000
CVTSLKQ  EQU   CVTSYSK                                                  01573000
CVTSLKR  EQU   CVTSYSK                                                  01574000
CVTRSV56 EQU   CVTSYSK                                                  01575000
CVTRSV55 EQU   CVTSYSK                                                  01576000
CVTRSV54 EQU   CVTSYSK                                                  01577000
CVTRSV53 EQU   CVTSYSK                                                  01578000
CVTRSV52 EQU   CVTA1F1                                                  01579000
CVTRSV51 EQU   CVTA1F1                                                  01580000
CVTRSV50 EQU   CVTA1F1                                                  01581000
CVTRSV49 EQU   CVTA1F1                                                  01582000
CVTRSV48 EQU   CVTA1F1                                                  01583000
CVTRSV47 EQU   CVTA1F1                                                  01584000
CVTSRSW  EQU   CVTA1F1                                                  01585000
CVTPFSW  EQU   CVTA1F1                                                  01586000
CVTPCVT  EQU   CVTMAP+352                                               01587000
CVTRSV46 EQU   CVTMAP+344                                               01588000
CVTRSV45 EQU   CVTMAP+340                                               01589000
CVTRSV44 EQU   CVTMAP+338                                               01590000
CVTRSV43 EQU   CVTMAP+336                                               01591000
CVTHJESA EQU   CVTHJES+1                                                01592000
CVTRSV42 EQU   CVTHJES                                                  01593000
CVTEXT2A EQU   CVTEXT2+1                                                01594000
CVTRSV41 EQU   CVTEXT2                                                  01595000
CVTAPFA  EQU   CVTAPF+1                                                 01596000
CVTRSV40 EQU   CVTAPF                                                   01597000
CVTRV518 EQU   CVTINTLA                                                 01598000
CVTRV517 EQU   CVTERPV                                                  01599000
CVTEORM  EQU   CVTMAP+312                                               01600000
CVTMCHPR EQU   CVTMAP+308                                               01601000
CVTTZ    EQU   CVTMAP+304                                               01602000
CVTJEPS  EQU   CVTMAP+300                                               01603000
CVTMODE  EQU   CVTMAP+292                                               01604000
CVTPTRV  EQU   CVTMAP+288                                               01605000
CVTREAL  EQU   CVTMAP+284                                               01606000
CVTRSV39 EQU   CVTMAP+280                                               01607000
CVTRSV38 EQU   CVTMAP+276                                               01608000
CVTDMSRA EQU   CVTDMSR+1                                                01609000
CVTRV634 EQU   CVTDMSRF                                                 01610000
CVTRV633 EQU   CVTDMSRF                                                 01611000
CVTRV632 EQU   CVTDMSRF                                                 01612000
CVTRV631 EQU   CVTDMSRF                                                 01613000
CVTRV630 EQU   CVTDMSRF                                                 01614000
CVTRV629 EQU   CVTDMSRF                                                 01615000
CVTUDUMP EQU   CVTDMSRF                                                 01616000
CVTSDUMP EQU   CVTDMSRF                                                 01617000
CVTQMSGA EQU   CVTQMSG+1                                                01618000
CVTRSV36 EQU   CVTQMSG                                                  01619000
CVTAMFF  EQU   CVTMAP+264                                               01620000
CVTPURGA EQU   CVTPURG+1                                                01621000
CVTRSV35 EQU   CVTPURG                                                  01622000
CVTCBSP  EQU   CVTMAP+256                                               01623000
CVTATERA EQU   CVTATER+1                                                01624000
CVTSYST  EQU   CVTATER                                                  01625000
CVTVOLT2 EQU   CVTTAT                                                   01626000
CVTVOLI2 EQU   CVTVOLF2                                                 01627000
CVTAQAVB EQU   CVTAQAVT+1                                               01628000
CVTRSV34 EQU   CVTTCMFG                                                 01629000
CVTRSV33 EQU   CVTTCMFG                                                 01630000
CVTRSV32 EQU   CVTTCMFG                                                 01631000
CVTRSV31 EQU   CVTTCMFG                                                 01632000
CVTRSV30 EQU   CVTTCMFG                                                 01633000
CVTRSV29 EQU   CVTTCMFG                                                 01634000
CVTLDEV  EQU   CVTTCMFG                                                 01635000
CVTTCRDY EQU   CVTTCMFG                                                 01636000
CVTGTFA  EQU   CVTGTF+1                                                 01637000
CVTRSV27 EQU   CVTGTFST                                                 01638000
CVTRNIO  EQU   CVTGTFST                                                 01639000
CVTUSR   EQU   CVTGTFST                                                 01640000
CVTRV318 EQU   CVTFORM                                                  01641000
CVTRV317 EQU   CVTTMODE                                                 01642000
CVTRV316 EQU   CVTSTATE                                                 01643000
CVTRV315 EQU   CVTGTFS                                                  01644000
CVTGTFAV EQU   CVTGTFS                                                  01645000
CVT0SCR1 EQU   CVTMAP+232                                               01646000
CVTRV515 EQU   CVTMAP+228                                               01647000
CVTRMS   EQU   CVTMAP+224                                               01648000
CVTPATCH EQU   CVTMAP+220                                               01649000
CVTTSCE  EQU   CVTMAP+216                                               01650000
CVTLNKSC EQU   CVTMAP+214                                               01651000
CVTQABST EQU   CVTMAP+212                                               01652000
CVTMDLDS EQU   CVTMAP+208                                               01653000
CVTUSER  EQU   CVTMAP+204                                               01654000
CVTABEND EQU   CVTMAP+200                                               01655000
CVTSMCA  EQU   CVTMAP+196                                               01656000
CVTRSV18 EQU   CVTMAP+192                                               01657000
CVTQLPAQ EQU   CVTMAP+188                                               01658000
CVTQCDSR EQU   CVTMAP+184                                               01659000
CVTRSV17 EQU   CVTOPTB                                                  01660000
CVTRSV16 EQU   CVTOPTB                                                  01661000
CVTFP    EQU   CVTOPTB                                                  01662000
CVTAPTHR EQU   CVTOPTB                                                  01663000
CVTNLOG  EQU   CVTOPTB                                                  01664000
CVTTOD   EQU   CVTOPTB                                                  01665000
CVTCTIMS EQU   CVTOPTB                                                  01666000
CVTPROT  EQU   CVTOPTB                                                  01667000
CVTXPFP  EQU   CVTOPTA                                                  01668000
CVTASCII EQU   CVTOPTA                                                  01669000
CVTRSV13 EQU   CVTOPTA                                                  01670000
CVTRSV12 EQU   CVTOPTA                                                  01671000
CVTNIP   EQU   CVTOPTA                                                  01672000
CVTDDR   EQU   CVTOPTA                                                  01673000
CVTAPR   EQU   CVTOPTA                                                  01674000
CVTCCH   EQU   CVTOPTA                                                  01675000
CVTSNCTR EQU   CVTMAP+180                                               01676000
CVTQMWR  EQU   CVTMAP+176                                               01677000
CVTQOCR  EQU   CVTMAP+172                                               01678000
CVT1EF00 EQU   CVTMAP+168                                               01679000
CVTMZ00  EQU   CVTMAP+164                                               01680000
CVTSV76Q EQU   CVTSV76C                                                 01681000
CVTRSV11 EQU   CVTMAP+156                                               01682000
CVT0PT01 EQU   CVTMAP+152                                               01683000
CVTMSER  EQU   CVTMAP+148                                               01684000
CVTRV516 EQU   CVTIERLC                                                 01685000
CVTILCH  EQU   CVTMAP+140                                               01686000
CVT0DS   EQU   CVTMAP+136                                               01687000
CVTFBOSV EQU   CVTMAP+132                                               01688000
CVTNUCB  EQU   CVTMAP+128                                               01689000
CVTIXAVL EQU   CVTMAP+124                                               01690000
CVTSV76M EQU   CVTIOQET                                                 01691000
CVTDCBA  EQU   CVTMAP+117                                               01692000
CVTMVS2  EQU   CVTDCB                                                   01693000
CVT6DAT  EQU   CVTDCB                                                   01694000
CVT4MPS  EQU   CVTDCB                                                   01695000
CVTRSV09 EQU   CVTDCB                                                   01696000
CVT4MS1  EQU   CVTDCB                                                   01697000
CVT2SPS  EQU   CVTDCB                                                   01698000
CVT1SSS  EQU   CVTDCB                                                   01699000
CVTRSV08 EQU   CVTDCB                                                   01700000
CVTSTB   EQU   CVTMAP+112                                               01701000
CVTQTD00 EQU   CVTMAP+108                                               01702000
CVTQTE00 EQU   CVTMAP+104                                               01703000
CVTCUCB  EQU   CVTMAP+100                                               01704000
CVTSJQ   EQU   CVTMAP+96                                                01705000
CVTPBLDL EQU   CVTMAP+92                                                01706000
CVTTPC   EQU   CVTMAP+88                                                01707000
CVTSVDCB EQU   CVTMAP+84                                                01708000
CVTBRET  EQU   CVTMAP+82                                                01709000
CVTEXIT  EQU   CVTMAP+80                                                01710000
CVT0FN00 EQU   CVTMAP+76                                                01711000
CVTDARA  EQU   CVTDAR+1                                                 01712000
CVTRSV07 EQU   CVTFLGS1                                                 01713000
CVTRSV06 EQU   CVTFLGS1                                                 01714000
CVTRSV05 EQU   CVTFLGS1                                                 01715000
CVTRSV04 EQU   CVTFLGS1                                                 01716000
CVTRSV03 EQU   CVTFLGS1                                                 01717000
CVTRSV02 EQU   CVTFLGS1                                                 01718000
CVTRSV01 EQU   CVTFLGS1                                                 01719000
CVTDMPLK EQU   CVTFLGS1                                                 01720000
CVTXITP  EQU   CVTMAP+68                                                01721000
CVTZDTAB EQU   CVTMAP+64                                                01722000
CVTMSLT  EQU   CVTMAP+60                                                01723000
CVTDATE  EQU   CVTMAP+56                                                01724000
CVTBTERM EQU   CVTMAP+52                                                01725000
CVTSYSAD EQU   CVTMAP+48                                                01726000
CVTXTLER EQU   CVTMAP+44                                                01727000
CVTILK2  EQU   CVTMAP+40                                                01728000
CVTILK1  EQU   CVTMAP+36                                                01729000
CVTPRLTV EQU   CVTMAP+32                                                01730000
CVTPCNVT EQU   CVTMAP+28                                                01731000
CVT0VL00 EQU   CVTMAP+24                                                01732000
CVTXAPG  EQU   CVTMAP+20                                                01733000
CVTBUF   EQU   CVTMAP+16                                                01734000
CVTJOB   EQU   CVTMAP+12                                                01735000
CVT0EF00 EQU   CVTMAP+4                                                 01736000
CVTTCBP  EQU   CVTMAP                                                   01737000
CVT      EQU   CVTMAP                                                   01738000
PDSS04ND EQU   PDSS04+2                                                 01739000
PDSAPFAC EQU   PDSAPF+1                                                 01740000
PDSAPFCT EQU   PDSAPF                                                   01741000
PDSS03ND EQU   PDSS03+4                                                 01742000
PDSMBRSN EQU   PDSSSIWD+2                                               01743000
PDSIBMMB EQU   PDSSSIFB                                                 01744000
PDSSYSGN EQU   PDSSSIFB                                                 01745000
PDSDEPCH EQU   PDSSSIFB                                                 01746000
PDSEMFIX EQU   PDSSSIFB                                                 01747000
PDSUSRCH EQU   PDSSSIFB                                                 01748000
PDSFORCE EQU   PDSSSIFB                                                 01749000
@NM00059 EQU   PDSSSIFB                                                 01750000
PDSCHLVL EQU   PDSSSIWD                                                 01751000
PDSS02ND EQU   PDSS02+11                                                01752000
PDS2MNM  EQU   PDSS02+3                                                 01753000
PDS2EPM  EQU   PDSS02                                                   01754000
PDSS01ND EQU   PDSS01+8                                                 01755000
PDS2ESDC EQU   PDSS01+6                                                 01756000
PDS2ESDT EQU   PDSS01+4                                                 01757000
PDS2TTSZ EQU   PDSS01+2                                                 01758000
PDS2SLSZ EQU   PDSS01                                                   01759000
PDSBCEND EQU   PDS2+35                                                  01760000
PDS2FTB3 EQU   PDS2FTBO+2                                               01761000
PDS2FTB2 EQU   PDS2FTBO+1                                               01762000
@NM00058 EQU   PDS2FTB1                                                 01763000
PDSAPFLG EQU   PDS2FTB1                                                 01764000
PDS2SSI  EQU   PDS2FTB1                                                 01765000
PDS2PAGA EQU   PDS2FTB1                                                 01766000
@NM00057 EQU   PDS2FTB1                                                 01767000
PDSAOSLE EQU   PDS2FTB1                                                 01768000
PDS2EPA  EQU   PDS2+29                                                  01769000
PDS2FTBL EQU   PDS2+27                                                  01770000
PDS2STOR EQU   PDS2+24                                                  01771000
PDS2REFR EQU   PDS2ATR2                                                 01772000
PDS2LEF  EQU   PDS2ATR2                                                 01773000
PDS2TSTN EQU   PDS2ATR2                                                 01774000
PDS2NREP EQU   PDS2ATR2                                                 01775000
PDS2NRLD EQU   PDS2ATR2                                                 01776000
PDS2EP0  EQU   PDS2ATR2                                                 01777000
PDS2ORG0 EQU   PDS2ATR2                                                 01778000
PDS2FLVL EQU   PDS2ATR2                                                 01779000
PDS21BLK EQU   PDS2ATR1                                                 01780000
PDS2EXEC EQU   PDS2ATR1                                                 01781000
PDS2SCTR EQU   PDS2ATR1                                                 01782000
PDS2LOAD EQU   PDS2ATR1                                                 01783000
PDS2TEST EQU   PDS2ATR1                                                 01784000
PDS2OVLY EQU   PDS2ATR1                                                 01785000
PDS2REUS EQU   PDS2ATR1                                                 01786000
PDS2RENT EQU   PDS2ATR1                                                 01787000
PDS2NL   EQU   PDS2+21                                                  01788000
PDS2TTRN EQU   PDS2+18                                                  01789000
PDS2ZERO EQU   PDS2+17                                                  01790000
PDS2USRD EQU   PDS2TTRT                                                 01791000
PDS2LUSR EQU   PDS2INDC                                                 01792000
PDS2NTTR EQU   PDS2INDC                                                 01793000
PDS2ALIS EQU   PDS2INDC                                                 01794000
PDS2LIBF EQU   PDS2+12                                                  01795000
PDS2CNCT EQU   PDS2+11                                                  01796000
PDS2TTRP EQU   PDS2+8                                                   01797000
JESSASTA EQU   JESCT+48                                                 01798000
JESNUCBS EQU   JESCT+44                                                 01799000
JESPJESN EQU   JESCT+28                                                 01800000
JESRESQM EQU   JESCT+16                                                 01801000
JESQMGR  EQU   JESCT+12                                                 01802000
JESUNITS EQU   JESCT+4                                                  01803000
@NM00055 EQU   JESCT                                                    01804000
SSCTSUSE EQU   SSCT+20                                                  01805000
SSCTRSV1 EQU   SSCT+13                                                  01806000
@NM00054 EQU   SSCTFLG1                                                 01807000
SSCTSFOR EQU   SSCTFLG1                                                 01808000
SSCTID   EQU   SSCT                                                     01809000
@NM00053 EQU   APOTAD+2                                                 01810000
APOTADOF EQU   APOTAD                                                   01811000
@NM00052 EQU   APOTVT+4                                                 01812000
APOTVTOF EQU   APOTVT+2                                                 01813000
@NM00051 EQU   APOTVTIT                                                 01814000
APOTVTMN EQU   APOTVTIT                                                 01815000
APOTVTSS EQU   APOTVTIT                                                 01816000
APOTVTCD EQU   APOTVT                                                   01817000
@NM00050 EQU   APOTNM+12                                                01818000
APOTNMSU EQU   APOTNM+11                                                01819000
@NM00049 EQU   APOTNMF0                                                 01820000
APOTNMSD EQU   APOTNMF0                                                 01821000
APOTNMSA EQU   APOTNMF0                                                 01822000
APOTNMFX EQU   APOTNMF0                                                 01823000
APOTNMOF EQU   APOTNM+8                                                 01824000
APOTNMLD EQU   APOTNM                                                   01825000
@NM00048 EQU   APOT+64                                                  01826000
@NM00047 EQU   APOT+60                                                  01827000
APOTCPLN EQU   APOT+56                                                  01828000
APOTCPPL EQU   APOT+52                                                  01829000
APOTCPCT EQU   APOT+48                                                  01830000
APOTCPAD EQU   APOT+44                                                  01831000
APOTBR14 EQU   APOT+40                                                  01832000
APOTADCT EQU   APOT+36                                                  01833000
APOTVTCT EQU   APOT+28                                                  01834000
APOTNMCT EQU   APOT+20                                                  01835000
APOTCTLN EQU   APOT+12                                                  01836000
APOTCTAD EQU   APOT+8                                                   01837000
APOTUSER EQU   APOT+4                                                   01838000
APOTID   EQU   APOT                                                     01839000
APNQ11RC EQU   APNQM11+63                                               01840000
APNQ11DC EQU   APNQM11+61                                               01841000
APNQ11T6 EQU   APNQM11+59                                               01842000
APNQ11T5 EQU   APNQM11+55                                               01843000
APNQ11T4 EQU   APNQM11+51                                               01844000
APNQ11T3 EQU   APNQM11+31                                               01845000
APNQ11T2 EQU   APNQM11+25                                               01846000
APNQ11T1 EQU   APNQM11+4                                                01847000
APNQ11MC EQU   APNQM11+2                                                01848000
APNQ11LN EQU   APNQM11                                                  01849000
APNQ10RC EQU   APNQM10+55                                               01850000
APNQ10DC EQU   APNQM10+53                                               01851000
APNQ10T2 EQU   APNQM10+51                                               01852000
APNQ10T1 EQU   APNQM10+4                                                01853000
APNQ10MC EQU   APNQM10+2                                                01854000
APNQ10LN EQU   APNQM10                                                  01855000
APNQ09RC EQU   APNQM09+58                                               01856000
APNQ09DC EQU   APNQM09+56                                               01857000
APNQ09T4 EQU   APNQM09+53                                               01858000
APNQ09T3 EQU   APNQM09+27                                               01859000
APNQ09T2 EQU   APNQM09+19                                               01860000
APNQ09T1 EQU   APNQM09+4                                                01861000
APNQ09MC EQU   APNQM09+2                                                01862000
APNQ09LN EQU   APNQM09                                                  01863000
APNQ08RC EQU   APNQM08+62                                               01864000
APNQ08DC EQU   APNQM08+60                                               01865000
APNQ08T3 EQU   APNQM08+35                                               01866000
APNQ08T2 EQU   APNQM08+31                                               01867000
APNQ08T1 EQU   APNQM08+4                                                01868000
APNQ08MC EQU   APNQM08+2                                                01869000
APNQ08LN EQU   APNQM08                                                  01870000
APNQ07RC EQU   APNQM07+52                                               01871000
APNQ07DC EQU   APNQM07+50                                               01872000
APNQ07T3 EQU   APNQM07+16                                               01873000
APNQ07T1 EQU   APNQM07+4                                                01874000
APNQ07MC EQU   APNQM07+2                                                01875000
APNQ07LN EQU   APNQM07                                                  01876000
APNQ06RC EQU   APNQM06+47                                               01877000
APNQ06DC EQU   APNQM06+45                                               01878000
APNQ06T2 EQU   APNQM06+41                                               01879000
APNQ06T1 EQU   APNQM06+4                                                01880000
APNQ06MC EQU   APNQM06+2                                                01881000
APNQ06LN EQU   APNQM06                                                  01882000
APNQ05RC EQU   APNQM05+39                                               01883000
APNQ05DC EQU   APNQM05+37                                               01884000
APNQ05T3 EQU   APNQM05+27                                               01885000
APNQ05T2 EQU   APNQM05+19                                               01886000
APNQ05T1 EQU   APNQM05+4                                                01887000
APNQ05MC EQU   APNQM05+2                                                01888000
APNQ05LN EQU   APNQM05                                                  01889000
APNQ04RC EQU   APNQM04+87                                               01890000
APNQ04DC EQU   APNQM04+85                                               01891000
APNQ04T3 EQU   APNQM04+81                                               01892000
APNQ04T2 EQU   APNQM04+42                                               01893000
APNQ04T1 EQU   APNQM04+4                                                01894000
APNQ04MC EQU   APNQM04+2                                                01895000
APNQ04LN EQU   APNQM04                                                  01896000
APNQ03RC EQU   APNQM03+57                                               01897000
APNQ03DC EQU   APNQM03+55                                               01898000
APNQ03T3 EQU   APNQM03+49                                               01899000
APNQ03T1 EQU   APNQM03+4                                                01900000
APNQ03MC EQU   APNQM03+2                                                01901000
APNQ03LN EQU   APNQM03                                                  01902000
APNQ02RC EQU   APNQM02+53                                               01903000
APNQ02DC EQU   APNQM02+51                                               01904000
APNQ02T3 EQU   APNQM02+36                                               01905000
APNQ02T1 EQU   APNQM02+4                                                01906000
APNQ02MC EQU   APNQM02+2                                                01907000
APNQ02LN EQU   APNQM02                                                  01908000
APNQ01RC EQU   APNQM01+50                                               01909000
APNQ01DC EQU   APNQM01+48                                               01910000
APNQ01T3 EQU   APNQM01+16                                               01911000
APNQ01T1 EQU   APNQM01+4                                                01912000
APNQ01MC EQU   APNQM01+2                                                01913000
APNQ01LN EQU   APNQM01                                                  01914000
APNQUSER EQU   APNQ+4                                                   01915000
APNQID   EQU   APNQ                                                     01916000
APNPRTRY EQU   APNP30RT+8                                               01917000
@NM00046 EQU   APNP30RT+6                                               01918000
APNPBR14 EQU   APNP30RT+4                                               01919000
APNPL15  EQU   APNP30RT                                                 01920000
APNPXLST EQU   APNP+380                                                 01921000
APNPSSVT EQU   APNP+376                                                 01922000
APNPLPDE EQU   APNP+360                                                 01923000
APNPCDE  EQU   APNP+352                                                 01924000
APNPBYT3 EQU   APNPSWIT+3                                               01925000
APNPBYT2 EQU   APNPSWIT+2                                               01926000
APNPBYT1 EQU   APNPSWIT+1                                               01927000
APNPFIX  EQU   APNPBYT0                                                 01928000
APNPMINR EQU   APNPBYT0                                                 01929000
APNPSREC EQU   APNPBYT0                                                 01930000
APNPFREE EQU   APNPBYT0                                                 01931000
APNPFLAG EQU   APNPBYT0                                                 01932000
APNPDUP  EQU   APNPBYT0                                                 01933000
APNPCODE EQU   APNPBYT0                                                 01934000
APNPVTSZ EQU   APNP+344                                                 01935000
APNPVTAD EQU   APNP+340                                                 01936000
APNPRG15 EQU   APNPREGS+60                                              01937000
APNPRG14 EQU   APNPREGS+56                                              01938000
APNPRG13 EQU   APNPREGS+52                                              01939000
APNPRG12 EQU   APNPREGS+48                                              01940000
APNPRG11 EQU   APNPREGS+44                                              01941000
APNPRG10 EQU   APNPREGS+40                                              01942000
APNPRG09 EQU   APNPREGS+36                                              01943000
APNPRG08 EQU   APNPREGS+32                                              01944000
APNPRG07 EQU   APNPREGS+28                                              01945000
APNPRG06 EQU   APNPREGS+24                                              01946000
APNPRG05 EQU   APNPREGS+20                                              01947000
APNPRG04 EQU   APNPREGS+16                                              01948000
APNPRG03 EQU   APNPREGS+12                                              01949000
APNPRG02 EQU   APNPREGS+8                                               01950000
APNPRG01 EQU   APNPREGS+4                                               01951000
APNPRG00 EQU   APNPREGS                                                 01952000
APNPSSIZ EQU   APNP+268                                                 01953000
APNPMORG EQU   APNP+264                                                 01954000
APNPMDL2 EQU   APNPMODL+4                                               01955000
APNPMDL1 EQU   APNPMODL                                                 01956000
APNPIGT0 EQU   APNPLOAD                                                 01957000
APNPSSIP EQU   APNP+244                                                 01958000
APNPSSIR EQU   APNP+240                                                 01959000
APNPCPSZ EQU   APNP+236                                                 01960000
APNPLEN  EQU   APNPCORE+1                                               01961000
APNPSPOL EQU   APNPCORE                                                 01962000
APNPBLTL EQU   APNP+124                                                 01963000
APNPAPCT EQU   APNP+116                                                 01964000
APNPAPCP EQU   APNP+112                                                 01965000
APNPADDR EQU   APNP+108                                                 01966000
APNP40WA EQU   APNP+8                                                   01967000
APNPUSER EQU   APNP+4                                                   01968000
@NM00030 EQU   APCT+1556                                                01969000
APCTSVCT EQU   APCT+1552                                                01970000
APCTDAVT EQU   APCT+1548                                                01971000
APCTLOGL EQU   APCT+1544                                                01972000
@NM00029 EQU   APCT+1540                                                01973000
APCTDMPU EQU   APCT+1536                                                01974000
APCTDMPM EQU   APCT+1532                                                01975000
APCTNDMP EQU   APCT+1530                                                01976000
APCTASID EQU   APCT+1528                                                01977000
APCTLGPG EQU   APCT+1526                                                01978000
APCTLGLN EQU   APCT+1524                                                01979000
APCTAPVU EQU   APCT+1520                                                01980000
APCTABR  EQU   APCT+1116                                                01981000
APCTACTR EQU   APCT+1112                                                01982000
APCTLOGD EQU   APCT+1108                                                01983000
APCTDCLD EQU   APCT+1104                                                01984000
APCTIOAP EQU   APCT+1100                                                01985000
@NM00028 EQU   APCT+1080                                                01986000
@NM00027 EQU   APCT+1078                                                01987000
APCTKCAX EQU   APCT+1076                                                01988000
APCTABND EQU   APCT+1072                                                01989000
@NM00026 EQU   APCT+1068                                                01990000
APCTAPIO EQU   APCT+1064                                                01991000
APCTCSCT EQU   APCT+1060                                                01992000
APCTSTDF EQU   APCT+1056                                                01993000
APCTSTMX EQU   APCT+1052                                                01994000
APCTRGMX EQU   APCT+1048                                                01995000
APCTSIZE EQU   APCT+1046                                                01996000
APCTCTUB EQU   APCT+1045                                                01997000
APCTMFID EQU   APCT+1044                                                01998000
APCTMFSZ EQU   APCT+1040                                                01999000
APCTCRTN EQU   APCT+1036                                                02000000
APCTAPCP EQU   APCT+1032                                                02001000
APCTAMNA EQU   APCT+1028                                                02002000
APCTEMNA EQU   APCT+1024                                                02003000
APCTAALP EQU   APCT+1020                                                02004000
APCTEALP EQU   APCT+1016                                                02005000
@NM00025 EQU   APCT+1012                                                02006000
@NM00024 EQU   APCT+1008                                                02007000
@NM00023 EQU   APCT+1004                                                02008000
APCTEIPL EQU   APCT+1000                                                02009000
@NM00022 EQU   APCT+996                                                 02010000
@NM00021 EQU   APCT+992                                                 02011000
@NM00020 EQU   APCT+988                                                 02012000
@NM00019 EQU   APCT+984                                                 02013000
@NM00018 EQU   APCT+980                                                 02014000
APCTECPW EQU   APCT+976                                                 02015000
APCTEULD EQU   APCT+972                                                 02016000
APCTECPT EQU   APCT+968                                                 02017000
APCTEALC EQU   APCT+964                                                 02018000
APCTECBL EQU   APCT+960                                                 02019000
APCTECIT EQU   APCT+956                                                 02020000
APCTCQAF EQU   APCTCQAQ                                                 02021000
APCTCQL  EQU   APCTAPCQ+4                                               02022000
APCTCQF  EQU   APCTAPCQ                                                 02023000
APCTCQLK EQU   APCT+940                                                 02024000
@NM00017 EQU   @NM00013+2                                               02025000
@NM00016 EQU   APCTPRSW                                                 02026000
APCTAPST EQU   APCTPRSW                                                 02027000
@NM00015 EQU   APCTPRSW                                                 02028000
@NM00014 EQU   APCTSTAT                                                 02029000
APCTWARM EQU   APCTSTAT                                                 02030000
APCTTERM EQU   APCTSTAT                                                 02031000
APCTHALT EQU   APCTSTAT                                                 02032000
APCTQSCE EQU   APCTSTAT                                                 02033000
APCTSTRT EQU   APCTSTAT                                                 02034000
APCTACT  EQU   APCTSTAT                                                 02035000
APCTVUNX EQU   APCT+935                                                 02036000
APCTSOUT EQU   APCT+934                                                 02037000
APCTDAID EQU   APCT+933                                                 02038000
APCTSV34 EQU   APCT+932                                                 02039000
APCTMJOB EQU   APCT+928                                                 02040000
APCTTCB  EQU   APCT+924                                                 02041000
APCTASCB EQU   APCT+920                                                 02042000
APCTDCNW EQU   APCT+918                                                 02043000
APCTDCNR EQU   APCT+916                                                 02044000
@NM00012 EQU   APCT+912                                                 02045000
@NM00011 EQU   APCT+908                                                 02046000
@NM00010 EQU   APCT+904                                                 02047000
@NM00009 EQU   APCT+900                                                 02048000
@NM00008 EQU   APCTERRS+22                                              02049000
APCTERTJ EQU   APCTERRS+20                                              02050000
APCTERTD EQU   APCTERRS+18                                              02051000
APCTERTC EQU   APCTERRS+16                                              02052000
APCTERTB EQU   APCTERRS+14                                              02053000
APCTERTA EQU   APCTERRS+12                                              02054000
APCTERT9 EQU   APCTERRS+10                                              02055000
APCTERT3 EQU   APCTERRS+8                                               02056000
APCTERT2 EQU   APCTERRS+6                                               02057000
APCTERT1 EQU   APCTERRS+4                                               02058000
APCTERT0 EQU   APCTERRS+2                                               02059000
APCTERTT EQU   APCTERRS                                                 02060000
APCTDSAP EQU   APCT+872                                                 02061000
APCTISUB EQU   APCT+868                                                 02062000
APCTUBAP EQU   APCT+864                                                 02063000
APCTAPDS EQU   APCT+860                                                 02064000
APCTUBIC EQU   APCT+856                                                 02065000
APCTUBIS EQU   APCT+852                                                 02066000
APCTAPUB EQU   APCT+848                                                 02067000
APCTUBLK EQU   APCT+844                                                 02068000
APCTBR1A EQU   APCTBR14+2                                               02069000
@NM00007 EQU   APCTBR14                                                 02070000
APCTSMSZ EQU   APCTSMAD+2                                               02071000
@NM00006 EQU   APCTSMAD+1                                               02072000
@NM00005 EQU   APCTSMAD                                                 02073000
APCTSMIS EQU   APCTSMIN+2                                               02074000
@NM00004 EQU   APCTSMIN+1                                               02075000
APCTSMSP EQU   APCTSMIN                                                 02076000
@NM00003 EQU   APCT+30                                                  02077000
APCTLINE EQU   APCT+28                                                  02078000
APCTLBSZ EQU   APCT+24                                                  02079000
APCTREG  EQU   APCT+20                                                  02080000
APCTSSID EQU   APCTENQM+4                                               02081000
@NM00002 EQU   APCTENQM                                                 02082000
APCTSSVT EQU   APCT+8                                                   02083000
APCTUSER EQU   APCT+4                                                   02084000
APCTID   EQU   APCT                                                     02085000
@NM00083 EQU   PSA+3668                                                 02086000
PSASTAK  EQU   PSA+3072                                                 02087000
@NM00082 EQU   PSA+1048                                                 02088000
PSAUSEND EQU   PSA+1048                                                 02089000
PSARV062 EQU   PSA+1044                                                 02090000
PSACDAL  EQU   PSA+1040                                                 02091000
PSAWTCOD EQU   PSA+1036                                                 02092000
PSAATCVT EQU   PSA+1032                                                 02093000
PSAPCPSW EQU   PSA+1024                                                 02094000
PSAPIR2  EQU   PSA+1020                                                 02095000
PSARV059 EQU   PSA+1018                                                 02096000
PSASVC13 EQU   PSA+1016                                                 02097000
PSALSFCC EQU   PSA+1012                                                 02098000
PSASFACC EQU   PSA+1008                                                 02099000
PSASTOP  EQU   PSA+992                                                  02100000
PSASTART EQU   PSA+976                                                  02101000
PSARSPSW EQU   PSA+968                                                  02102000
PSASRPSW EQU   PSA+960                                                  02103000
PSARV045 EQU   PSA+892                                                  02104000
PSARV044 EQU   PSA+888                                                  02105000
PSARV043 EQU   PSA+884                                                  02106000
PSARV042 EQU   PSA+880                                                  02107000
PSARV041 EQU   PSA+876                                                  02108000
PSARV040 EQU   PSA+872                                                  02109000
PSARV025 EQU   PSA+868                                                  02110000
PSADSSED EQU   PSA+868                                                  02111000
PSADSSPR EQU   PSA+864                                                  02112000
PSADSSFW EQU   PSA+860                                                  02113000
PSADSS14 EQU   PSA+856                                                  02114000
PSADSSPP EQU   PSA+848                                                  02115000
PSADSSRP EQU   PSA+840                                                  02116000
PSADSS05 EQU   PSADSSF4                                                 02117000
PSADSS10 EQU   PSADSSF4                                                 02118000
PSADSSVE EQU   PSADSSF4                                                 02119000
PSADSSDE EQU   PSADSSF4                                                 02120000
PSADSSC0 EQU   PSADSSF4                                                 02121000
PSADSSIE EQU   PSADSSF4                                                 02122000
PSADSS12 EQU   PSADSSF4                                                 02123000
PSADSSRC EQU   PSADSSF4                                                 02124000
PSARV057 EQU   PSADSSF3                                                 02125000
PSARV056 EQU   PSADSSF3                                                 02126000
PSARV055 EQU   PSADSSF3                                                 02127000
PSADSSMC EQU   PSADSSF3                                                 02128000
PSADSSRW EQU   PSADSSF3                                                 02129000
PSADSSNM EQU   PSADSSF3                                                 02130000
PSADSSES EQU   PSADSSF3                                                 02131000
PSADSSGP EQU   PSADSSF3                                                 02132000
PSADSSF2 EQU   PSADSSFL+1                                               02133000
PSADSSPI EQU   PSADSSF1                                                 02134000
PSADSSOI EQU   PSADSSF1                                                 02135000
PSADSSSP EQU   PSADSSF1                                                 02136000
PSADSSTP EQU   PSADSSF1                                                 02137000
PSADSSDW EQU   PSADSSF1                                                 02138000
PSADSSDD EQU   PSADSSF1                                                 02139000
PSADSSDM EQU   PSADSSF1                                                 02140000
PSADSSMV EQU   PSADSSF1                                                 02141000
PSADSSTS EQU   PSA+816                                                  02142000
PSADSSWK EQU   PSA+812                                                  02143000
PSADSSR3 EQU   PSA+808                                                  02144000
PSADSSR2 EQU   PSA+804                                                  02145000
PSADSSRS EQU   PSA+800                                                  02146000
PSASTOR  EQU   PSA+796                                                  02147000
PSACPUSA EQU   PSA+794                                                  02148000
PSAVSTAP EQU   PSA+792                                                  02149000
PSAWKVAP EQU   PSA+788                                                  02150000
PSAWKRAP EQU   PSA+784                                                  02151000
PSAMCHIC EQU   PSA+783                                                  02152000
PSARV061 EQU   PSA+782                                                  02153000
PSASYMSK EQU   PSA+781                                                  02154000
PSAMCHFL EQU   PSA+780                                                  02155000
PSACR0   EQU   PSA+776                                                  02156000
PSAPSWSV EQU   PSA+768                                                  02157000
PSALITA  EQU   PSA+764                                                  02158000
PSACLHS  EQU   PSAHLHI                                                  02159000
PSALKR15 EQU   PSALKSA+60                                               02160000
PSALKR14 EQU   PSALKSA+56                                               02161000
PSALKR13 EQU   PSALKSA+52                                               02162000
PSALKR12 EQU   PSALKSA+48                                               02163000
PSALKR11 EQU   PSALKSA+44                                               02164000
PSALKR10 EQU   PSALKSA+40                                               02165000
PSALKR9  EQU   PSALKSA+36                                               02166000
PSALKR8  EQU   PSALKSA+32                                               02167000
PSALKR7  EQU   PSALKSA+28                                               02168000
PSALKR6  EQU   PSALKSA+24                                               02169000
PSALKR5  EQU   PSALKSA+20                                               02170000
PSALKR4  EQU   PSALKSA+16                                               02171000
PSALKR3  EQU   PSALKSA+12                                               02172000
PSALKR2  EQU   PSALKSA+8                                                02173000
PSALKR1  EQU   PSALKSA+4                                                02174000
PSALKR0  EQU   PSALKSA                                                  02175000
PSARV023 EQU   PSACLHT+52                                               02176000
PSALOCAL EQU   PSACLHT+48                                               02177000
PSACMSL  EQU   PSACLHT+44                                               02178000
PSAOPTL  EQU   PSACLHT+40                                               02179000
PSATPACL EQU   PSACLHT+36                                               02180000
PSATPDNL EQU   PSACLHT+32                                               02181000
PSATPNCL EQU   PSACLHT+28                                               02182000
PSAIOSLL EQU   PSACLHT+24                                               02183000
PSAIOSUL EQU   PSACLHT+20                                               02184000
PSAIOSCL EQU   PSACLHT+16                                               02185000
PSAIOSSL EQU   PSACLHT+12                                               02186000
PSASALCL EQU   PSACLHT+8                                                02187000
PSAASML  EQU   PSACLHT+4                                                02188000
PSADISPL EQU   PSACLHT                                                  02189000
PSASRSA  EQU   PSA+636                                                  02190000
PSARV050 EQU   PSA+634                                                  02191000
PSADSSGO EQU   PSA+633                                                  02192000
PSARECUR EQU   PSA+632                                                  02193000
PSAHLHIS EQU   PSA+628                                                  02194000
PSAIPCSA EQU   PSA+624                                                  02195000
@NM00081 EQU   PSA+621                                                  02196000
PSAIPCDM EQU   PSA+620                                                  02197000
PSAIPCD  EQU   PSA+616                                                  02198000
@NM00080 EQU   PSA+613                                                  02199000
PSAIPCRM EQU   PSA+612                                                  02200000
PSAIPCR  EQU   PSA+608                                                  02201000
PSAMCHEX EQU   PSA+600                                                  02202000
PSAMPSW  EQU   PSA+592                                                  02203000
PSAEXPS2 EQU   PSA+584                                                  02204000
PSAEXPS1 EQU   PSA+576                                                  02205000
PSAPIREG EQU   PSA+572                                                  02206000
PSARSREG EQU   PSA+568                                                  02207000
PSAGPREG EQU   PSA+556                                                  02208000
PSARV022 EQU   PSASUP4                                                  02209000
PSARV021 EQU   PSASUP4                                                  02210000
PSARV020 EQU   PSASUP4                                                  02211000
PSARV019 EQU   PSASUP4                                                  02212000
PSARV018 EQU   PSASUP4                                                  02213000
PSARV017 EQU   PSASUP4                                                  02214000
PSARV016 EQU   PSASUP4                                                  02215000
PSARV015 EQU   PSASUP4                                                  02216000
PSARV014 EQU   PSASUP3                                                  02217000
PSARV013 EQU   PSASUP3                                                  02218000
PSARV012 EQU   PSASUP3                                                  02219000
PSAESTA  EQU   PSASUP3                                                  02220000
PSASPR   EQU   PSASUP3                                                  02221000
PSAPSREG EQU   PSASUP3                                                  02222000
PSAPI2   EQU   PSASUP3                                                  02223000
PSAIOSUP EQU   PSASUP3                                                  02224000
PSALCR   EQU   PSASUP2                                                  02225000
PSARTM   EQU   PSASUP2                                                  02226000
PSAACR   EQU   PSASUP2                                                  02227000
PSAIPCE2 EQU   PSASUP2                                                  02228000
PSAIPCES EQU   PSASUP2                                                  02229000
PSAIPCEC EQU   PSASUP2                                                  02230000
PSAGTF   EQU   PSASUP2                                                  02231000
PSAIPCRI EQU   PSASUP2                                                  02232000
PSATYPE6 EQU   PSASUP1                                                  02233000
PSATCTL  EQU   PSASUP1                                                  02234000
PSADISP  EQU   PSASUP1                                                  02235000
PSALOCK  EQU   PSASUP1                                                  02236000
PSAPI    EQU   PSASUP1                                                  02237000
PSAEXT   EQU   PSASUP1                                                  02238000
PSASVC   EQU   PSASUP1                                                  02239000
PSAIO    EQU   PSASUP1                                                  02240000
PSAAOLD  EQU   PSA+548                                                  02241000
PSAANEW  EQU   PSA+544                                                  02242000
PSATOLD  EQU   PSA+540                                                  02243000
PSATNEW  EQU   PSA+536                                                  02244000
PSALCCAR EQU   PSA+532                                                  02245000
PSALCCAV EQU   PSA+528                                                  02246000
PSAPCCAR EQU   PSA+524                                                  02247000
PSAPCCAV EQU   PSA+520                                                  02248000
PSACPULA EQU   PSA+518                                                  02249000
PSACPUPA EQU   PSA+516                                                  02250000
PSAPSA   EQU   PSA+512                                                  02251000
FLCHDEND EQU   PSA+512                                                  02252000
FLCCRSAV EQU   FLCMCLA+280                                              02253000
FLCGRSAV EQU   FLCMCLA+216                                              02254000
FLCFPSAV EQU   FLCMCLA+184                                              02255000
FLCFLA   EQU   FLCMCLA+88                                               02256000
FLCRGNCD EQU   FLCMCLA+84                                               02257000
FLCFSAA  EQU   FLCFSA+1                                                 02258000
@NM00079 EQU   FLCFSA                                                   02259000
@NM00078 EQU   FLCMCLA+72                                               02260000
FLCMCIC  EQU   FLCMCLA+64                                               02261000
@NM00077 EQU   FLCMCLA+20                                               02262000
FLCIOAA  EQU   FLCIOA+1                                                 02263000
@NM00076 EQU   FLCIOA                                                   02264000
@NM00075 EQU   FLCMCLA+15                                               02265000
@NM00074 EQU   FLCMCLA+14                                               02266000
@NM00073 EQU   FLCMCLA+12                                               02267000
FLCLCL   EQU   FLCMCLA+8                                                02268000
FLCIOELA EQU   FLCIOEL+1                                                02269000
@NM00072 EQU   FLCIOEL                                                  02270000
FLCCHNID EQU   FLCMCLA                                                  02271000
@NM00071 EQU   PSA+160                                                  02272000
FLCMTRCD EQU   PSA+157                                                  02273000
@NM00070 EQU   PSA+156                                                  02274000
FLCPERA  EQU   FLCPER+1                                                 02275000
@NM00069 EQU   FLCPER                                                   02276000
@NM00068 EQU   PSA+151                                                  02277000
FLCPERCD EQU   PSA+150                                                  02278000
FLCMCNUM EQU   PSA+149                                                  02279000
@NM00067 EQU   PSA+148                                                  02280000
FLCTEAA  EQU   FLCTEA+1                                                 02281000
@NM00066 EQU   FLCTEA                                                   02282000
PSAPIPC  EQU   PSAPICOD                                                 02283000
PSAPIMC  EQU   PSAPICOD                                                 02284000
PSAPIPER EQU   PSAPICOD                                                 02285000
PSARV049 EQU   FLCPICOD                                                 02286000
FLCPILCB EQU   FLCPIILC                                                 02287000
@NM00065 EQU   FLCPIILC                                                 02288000
@NM00064 EQU   PSAEPPSW                                                 02289000
FLCSVCN  EQU   PSAESPSW+2                                               02290000
FLCSILCB EQU   FLCSVILC                                                 02291000
@NM00063 EQU   FLCSVILC                                                 02292000
@NM00062 EQU   PSAESPSW                                                 02293000
FLCEICOD EQU   PSAEEPSW+2                                               02294000
PSASPAD  EQU   PSAEEPSW                                                 02295000
@NM00061 EQU   PSA+128                                                  02296000
FLCINPSW EQU   PSA+120                                                  02297000
FLCMNPSW EQU   PSA+112                                                  02298000
FLCPNPSW EQU   PSA+104                                                  02299000
FLCSNPSW EQU   PSA+96                                                   02300000
FLCENPSW EQU   PSA+88                                                   02301000
FLCTRACE EQU   PSA+84                                                   02302000
FLCTIMER EQU   PSA+80                                                   02303000
FLCCVT2  EQU   PSA+76                                                   02304000
FLCCAW   EQU   PSA+72                                                   02305000
FLCCSW   EQU   PSA+64                                                   02306000
FLCIOPSW EQU   PSA+56                                                   02307000
FLCMOPSW EQU   PSA+48                                                   02308000
FLCPOPSW EQU   PSA+40                                                   02309000
FLCSOPSW EQU   PSA+32                                                   02310000
FLCEOPSW EQU   PSA+24                                                   02311000
@NM00060 EQU   FLCICCW2+4                                               02312000
FLCICCW1 EQU   FLCROPSW                                                 02313000
FLCIPPSW EQU   FLCRNPSW                                                 02314000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02315000
@RC00102 EQU   @RC00088                                                 02316000
@ENDDATA EQU   *                                                        02317000
         END   IGTA00,(C'PLS2037',0701,77195)                           02318000
