TDIP     TITLE 'IGTDIP - COMMON IPL PROCESSING.                        *00001000
                        '                                               00002000
IGTDIP   CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(16)                                          01S0001 00007000
         DC    C'IGTDIP    77.231'                              01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@08,12(@13)                                  01S0001 00010000
         STM   @10,@12,60(@13)                                  01S0001 00011000
         BALR  @07,0                                            01S0001 00012000
@PSTART  DS    0H                                               01S0001 00013000
         USING @PSTART,@07                                      01S0001 00014000
         L     @00,@SIZDATD                                     01S0001 00015000
         IGTYGSV  R,LV=(0)                                              00016000
         LR    @06,@01                                          01S0001 00017000
         USING @DATD,@06                                        01S0001 00018000
         ST    @13,@SA00001+4                                   01S0001 00019000
         LM    @00,@01,20(@13)                                  01S0001 00020000
         ST    @06,8(,@13)                                      01S0001 00021000
         LR    @13,@06                                          01S0001 00022000
*   LOADNAME(1:3)='IPL';            /* BUILD IPL LOAD MODULE NAME.   */ 00023000
         MVC   LOADNAME(3),@CC01135                             01S0111 00024000
*   LOADNAME(4:5)=UCBNAME(1:2);     /* CHANNEL AND SUBCHANNEL.       */ 00025000
         L     @11,UCBPTR(,APUBPTR)                             01S0112 00026000
         MVC   LOADNAME+3(2),UCBNAME(@11)                       01S0112 00027000
*   LOADNAME(6:7)=APUBIPL;          /* LOAD MODULE ID.               */ 00028000
         MVC   LOADNAME+5(2),APUBIPL(APUBPTR)                   01S0113 00029000
*   LOADNAME(8)=' ';                /* BLANK LAST CHAR.              */ 00030000
         MVI   LOADNAME+7,C' '                                  01S0114 00031000
*   IF APCQIINF=APCQRIPL THEN       /* IF THIS IS A REIPL COMMAND,   */ 00032000
         CLC   APCQIINF(4,APCQPTR),@CF00224                     01S0115 00033000
         BNE   @RF00115                                         01S0115 00034000
*     DO;                           /* THEN AN INDICATOR MUST BE SET    00035000
*                                      ON TO SIGNIFY THAT BULK STORE    00036000
*                                      IS BAD.                       */ 00037000
*       SAVEAPUB=APUBPTR;           /* SAVE THE ADDRESS OF THE  01S0117 00038000
*                                      MASTER.                       */ 00039000
         LR    SAVEAPUB,APUBPTR                                 01S0117 00040000
*       DO UNTIL APUBPTR=0;         /* LOOP THRU THE APUBS ON 3838.  */ 00041000
@DL00118 DS    0H                                               01S0119 00042000
*         APUBIRIP='1'B;            /* INDICATE THAT REIPL TAKES        00043000
*                                      PLACE.                        */ 00044000
         L     @11,APUBIRIP-3(,APUBPTR)                         01S0119 00045000
@GL00001 LR    @08,@11                                          01S0119 00046000
         O     @08,@CF01250                                     01S0119 00047000
         CS    @11,@08,APUBIRIP-3(APUBPTR)                      01S0119 00048000
         BNE   @GL00001                                         01S0119 00049000
*         APUBPTR=APUBAPUB;         /* GO TO NEXT APUB.              */ 00050000
         L     APUBPTR,APUBAPUB(,APUBPTR)                       01S0120 00051000
*       END;                        /* END OF LOOP.                  */ 00052000
@DE00118 LTR   APUBPTR,APUBPTR                                  01S0121 00053000
         BNZ   @DL00118                                         01S0121 00054000
*       APUBPTR=SAVEAPUB;           /* RESTORE THE APUB PTR.         */ 00055000
         LR    APUBPTR,SAVEAPUB                                 01S0122 00056000
*     END;                          /* END OF REIPL PROCESSING.      */ 00057000
*   CALL APCVZDIO(LOADNAME);        /* PERFORM IPL I/O.              */ 00058000
@RF00115 LA    @11,LOADNAME                                     01S0124 00059000
         ST    @11,@AL00001                                     01S0124 00060000
         MVI   @AL00001,X'80'                                   01S0124 00061000
         L     @15,APCTZDIO(,APCTPTR)                           01S0124 00062000
         LA    @01,@AL00001                                     01S0124 00063000
         BALR  @14,@15                                          01S0124 00064000
*   RESPECIFY                                                   01S0125 00065000
*     R15P RESTRICTED;              /* SAVE RETURN CODE.             */ 00066000
*   IF R15P^=0 THEN                 /* PROCESS IPL ERRORS.           */ 00067000
         LTR   R15P,R15P                                        01S0126 00068000
         BZ    @RF00126                                         01S0126 00069000
*     CALL ERRPROC;                 /* INVOKE THE IPL ERROR     02S0127 00070000
*                                      PROCEDURE.                    */ 00071000
         BAL   @14,ERRPROC                                      02S0127 00072000
*   ELSE                                                        01S0128 00073000
*     DO;                                                       02S0128 00074000
         B     @RC00126                                         02S0128 00075000
@RF00126 DS    0H                                               02S0129 00076000
*       CALL APCVZDID;              /* COMPLETE THE IPL PROCEDURE.   */ 00077000
         L     @15,APCTZDID(,APCTPTR)                           02S0129 00078000
         BALR  @14,@15                                          02S0129 00079000
*       IF R15P=0 THEN              /* SEE IF EVERYTHING WENT OK.    */ 00080000
         LTR   R15P,R15P                                        02S0130 00081000
         BNZ   @RF00130                                         02S0130 00082000
*         DO;                       /* IF SO UPDATE THE APUBS.       */ 00083000
*           SAVEAPUB=APUBPTR;       /* SAVE THE ORIGINAL APUB   02S0132 00084000
*                                      ADDRESS.                      */ 00085000
         LR    SAVEAPUB,APUBPTR                                 02S0132 00086000
*           DO UNTIL APUBPTR=0;                                 02S0133 00087000
@DL00133 DS    0H                                               02S0134 00088000
*             IF UCBQISCE='0'B THEN /* PRESERVE SETTING OF QUIESCE   */ 00089000
         L     @14,UCBPTR(,APUBPTR)                             02S0134 00090000
         TM    UCBQISCE(@14),B'00000001'                        02S0134 00091000
         BNZ   @RF00134                                         02S0134 00092000
*               APUBQISC='0'B;      /* BIT TO AID IN DEBUGGING.      */ 00093000
         L     @14,APUBQISC(,APUBPTR)                           02S0135 00094000
@GL00002 LR    @11,@14                                          02S0135 00095000
         N     @11,@CF01253                                     02S0135 00096000
         CS    @14,@11,APUBQISC(APUBPTR)                        02S0135 00097000
         BNE   @GL00002                                         02S0135 00098000
*             ELSE                  /* APUBQISC SETTING WILL REFLECT */ 00099000
*               DO;                 /* QUIESCE WAS ON SO RESET IT.   */ 00100000
         B     @RC00134                                         02S0136 00101000
@RF00134 DS    0H                                               02S0137 00102000
*                 APUBQISC='1'B;    /* THE UCBQISCE BIT SETTING.     */ 00103000
         L     @14,APUBQISC(,APUBPTR)                           02S0137 00104000
@GL00003 LR    @11,@14                                          02S0137 00105000
         O     @11,@CF01256                                     02S0137 00106000
         CS    @14,@11,APUBQISC(APUBPTR)                        02S0137 00107000
         BNE   @GL00003                                         02S0137 00108000
*                 RFY                                           02S0138 00109000
*                   R1P RSTD;       /* RESET THE QUIESCE BIT IN CASE    00110000
*                                      THAT WAS THE PROBLEM.         */ 00111000
*                 R1P=1;            /* FUNCTION CODE = RESET QUIESCE.*/ 00112000
         LA    R1P,1                                            02S0139 00113000
*                 CALL APCVZUJA;    /* RESET THE QUIESCE BIT.        */ 00114000
         L     @15,APCTZUJA(,APCTPTR)                           02S0140 00115000
         BALR  @14,@15                                          02S0140 00116000
*                 RFY                                           02S0141 00117000
*                   R1P UNRSTD;     /* QUIESCE NOW OFF,BUT APUBQISC     00118000
*                                      WILL TELL US IT WAS ON.       */ 00119000
*               END;                /* END OF RESET THE QUIESCE BIT. */ 00120000
*             APUBRIPL='0'B;        /* RESET THE ALLOC. RE-IPL FLAG. */ 00121000
@RC00134 L     @14,APUBRIPL(,APUBPTR)                           02S0143 00122000
@GL00004 LR    @11,@14                                          02S0143 00123000
         N     @11,@CF01259                                     02S0143 00124000
         CS    @14,@11,APUBRIPL(APUBPTR)                        02S0143 00125000
         BNE   @GL00004                                         02S0143 00126000
*             APUBBERR='0'B;        /* RESET ALLOCATION ERROR FLAG.  */ 00127000
         L     @14,APUBBERR-1(,APUBPTR)                         02S0144 00128000
@GL00005 LR    @11,@14                                          02S0144 00129000
         N     @11,@CF01262                                     02S0144 00130000
         CS    @14,@11,APUBBERR-1(APUBPTR)                      02S0144 00131000
         BNE   @GL00005                                         02S0144 00132000
*             IF APUBDSBL='0'B THEN /* SEE IF OPERATOR REQUESTED        00133000
*                                                            @ZA25362   00134000
*                                      DISABLE PENDING.      @ZA25362*/ 00135000
         TM    APUBDSBL(APUBPTR),B'01000000'                    02S0145 00136000
         BNZ   @RF00145                                         02S0145 00137000
*               APUBDSBP='0'B;      /* IF NOT RESET DISABLE PENDING.    00138000
*                                                            @ZA25362*/ 00139000
         L     @14,APUBDSBP-1(,APUBPTR)                         02S0146 00140000
@GL00006 LR    @11,@14                                          02S0146 00141000
         N     @11,@CF01265                                     02S0146 00142000
         CS    @14,@11,APUBDSBP-1(APUBPTR)                      02S0146 00143000
         BNE   @GL00006                                         02S0146 00144000
*             APUBIERR='0'B;        /* RESET I/O ERROR FLAG.         */ 00145000
@RF00145 DS    0H                                               02S0148 00146000
*             APUBIIPL='0'B;        /* RESET THE I/O RE-IPL FLAG.    */ 00147000
         L     @14,APUBIIPL-1(,APUBPTR)                         02S0148 00148000
@GL00007 LR    @11,@14                                          02S0148 00149000
         N     @11,@CF01268                                     02S0148 00150000
         CS    @14,@11,APUBIIPL-1(APUBPTR)                      02S0148 00151000
         BNE   @GL00007                                         02S0148 00152000
*             APUBERRS=''X;         /* ZERO ERROR COUNTERS.          */ 00153000
         XC    APUBERRS(22,APUBPTR),APUBERRS(APUBPTR)           02S0149 00154000
*             APUBERRT=0;           /* ZERO TRANSMISSION COUNTER.    */ 00155000
         SLR   @14,@14                                          02S0150 00156000
         ST    @14,APUBERRT(,APUBPTR)                           02S0150 00157000
*             IF APCQIINF=APCQIPL THEN/* IS THIS IS AN IPL?          */ 00158000
         CLC   APCQIINF(4,APCQPTR),@CF00208                     02S0151 00159000
         BNE   @RF00151                                         02S0151 00160000
*               DO;                 /* IF YES, ------                */ 00161000
*                 APUBUNLD='0'B;    /* IT IS NOT UNLOADED,           */ 00162000
*                 APUBUNLP='0'B;    /* OR UNLOAD PENDING,            */ 00163000
*                 APUBDSBP='0'B;    /* OR DISABLE PENDING.           */ 00164000
         L     @14,APUBDSBP-1(,APUBPTR)                         02S0155 00165000
@GL00008 LR    @11,@14                                          02S0155 00166000
         N     @11,@CF01271                                     02S0155 00167000
         CS    @14,@11,APUBDSBP-1(APUBPTR)                      02S0155 00168000
         BNE   @GL00008                                         02S0155 00169000
*                 APUBIDWN='0'B;    /* RESET UNLOADED FOR I/O FLAG.  */ 00170000
         L     @14,APUBIDWN(,APUBPTR)                           02S0156 00171000
@GL00009 LR    @11,@14                                          02S0156 00172000
         N     @11,@CF01259                                     02S0156 00173000
         CS    @14,@11,APUBIDWN(APUBPTR)                        02S0156 00174000
         BNE   @GL00009                                         02S0156 00175000
*                 APUBIEXC='0'B;    /* IT IS NOT EXCLUSIVE,          */ 00176000
         L     @14,APUBIEXC-2(,APUBPTR)                         02S0157 00177000
@GL00010 LR    @11,@14                                          02S0157 00178000
         N     @11,@CF01274                                     02S0157 00179000
         CS    @14,@11,APUBIEXC-2(APUBPTR)                      02S0157 00180000
         BNE   @GL00010                                         02S0157 00181000
*                 APUBIOCT=0;       /* NUMBER OF ACTIVE I/OS.        */ 00182000
         SLR   @14,@14                                          02S0158 00183000
         ST    @14,APUBIOCT(,APUBPTR)                           02S0158 00184000
*                 IF APUBSBCH='0'B& /* IF NOT A CONTROL SUBCHANNEL,  */ 00185000
*                     APUBZRGN='0'B THEN/* AND IT HAS A REGION,      */ 00186000
         TM    APUBSBCH(APUBPTR),B'10000000'                    02S0159 00187000
         BNZ   @RF00159                                         02S0159 00188000
         TM    APUBZRGN(APUBPTR),B'10000000'                    02S0159 00189000
         BNZ   @RF00159                                         02S0159 00190000
*                   DO;                                         02S0160 00191000
*                     APUBDSBL='0'B;/* IT IS NO LONGER DISABLED,     */ 00192000
         L     @14,APUBDSBL-1(,APUBPTR)                         02S0161 00193000
@GL00012 LR    @11,@14                                          02S0161 00194000
         N     @11,@CF01277                                     02S0161 00195000
         CS    @14,@11,APUBDSBL-1(APUBPTR)                      02S0161 00196000
         BNE   @GL00012                                         02S0161 00197000
*                     APUBIDAB='0'B;/* RESET DISABLED FOR I/O FLAG.  */ 00198000
         L     @14,APUBIDAB(,APUBPTR)                           02S0162 00199000
@GL00013 LR    @11,@14                                          02S0162 00200000
         N     @11,@CF01280                                     02S0162 00201000
         CS    @14,@11,APUBIDAB(APUBPTR)                        02S0162 00202000
         BNE   @GL00013                                         02S0162 00203000
*                     APUBISHR='1'B;/* BUT IT IS ELIGABLE FOR SHARED.*/ 00204000
         L     @14,APUBISHR-3(,APUBPTR)                         02S0163 00205000
@GL00014 LR    @11,@14                                          02S0163 00206000
         O     @11,@CF01283                                     02S0163 00207000
         CS    @14,@11,APUBISHR-3(APUBPTR)                      02S0163 00208000
         BNE   @GL00014                                         02S0163 00209000
*                     CALL APCVZUHA(APUB);/* ADD IT TO THE SHARED       00210000
*                                      QUEUE.                        */ 00211000
         ST    APUBPTR,@AL00001                                 02S0164 00212000
         L     @15,APCTZUHA(,APCTPTR)                           02S0164 00213000
         LA    @01,@AL00001                                     02S0164 00214000
         BALR  @14,@15                                          02S0164 00215000
*                   END;                                        02S0165 00216000
*               END;                                            02S0166 00217000
@RF00159 DS    0H                                               02S0167 00218000
*             APUBPTR=APUBAPUB;     /* BUMP TO NEXT APUB ON THE 02S0167 00219000
*                                      CHAIN.                        */ 00220000
@RF00151 L     APUBPTR,APUBAPUB(,APUBPTR)                       02S0167 00221000
*           END;                                                02S0168 00222000
@DE00133 LTR   APUBPTR,APUBPTR                                  02S0168 00223000
         BNZ   @DL00133                                         02S0168 00224000
*           APUBPTR=SAVEAPUB;                                   02S0169 00225000
         LR    APUBPTR,SAVEAPUB                                 02S0169 00226000
*           DO;                     /* IGTYPOST ECB(APCTEULD)        */ 00227000
*             RFY                                               02S0171 00228000
*              (GPR00P,                                         02S0171 00229000
*               GPR01P,                                         02S0171 00230000
*               GPR14F,                                         02S0171 00231000
*               GPR15F) RSTD;       /* REGISTERS USED                */ 00232000
*             GPR15F=APCTEULD;      /* CURRENT ECB CONTENTS          */ 00233000
         L     GPR15F,APCTEULD(,APCTPTR)                        02S0172 00234000
*LTR0009X:                                                      02S0173 00235000
*             IF GPR15F<0 THEN      /* IF ECB ALREADY                */ 00236000
LTR0009X LTR   GPR15F,GPR15F                                    02S0173 00237000
         BNM   @RF00173                                         02S0173 00238000
*               DO;                 /* WAITED UPON, MUST ISSUE POST  */ 00239000
*                 GPR01P=ADDR(APCTEULD);/* ADDRESS OF ECB TO POST    */ 00240000
         LA    GPR01P,APCTEULD(,APCTPTR)                        02S0175 00241000
*                 GPR00P=0;         /* POST CODE                     */ 00242000
         SLR   GPR00P,GPR00P                                    02S0176 00243000
*                 SVC(2);           /* ISSUE POST                    */ 00244000
         SVC   2                                                02S0177 00245000
*               END;                /* ECB POSTED                    */ 00246000
*             ELSE                  /* ECB NOT YET POSTED            */ 00247000
*               DO;                 /* SO TRY 'COMPARE-AND-SWAP' POST*/ 00248000
         B     @RC00173                                         02S0179 00249000
@RF00173 DS    0H                                               02S0180 00250000
*                 GPR14F='40000000'X;/* POST CODE                    */ 00251000
         L     GPR14F,@CF01151                                  02S0180 00252000
*                 CS(GPR15F,GPR14F,APCTEULD);/* POST THE ECB         */ 00253000
         CS    GPR15F,@14,APCTEULD(APCTPTR)                     02S0181 00254000
*                 BC(7,LTR0009X);   /* RETRY IF 'CS' FAILED          */ 00255000
         BC    7,LTR0009X                                       02S0182 00256000
*               END;                /* ECB POSTED VIA 'CS'           */ 00257000
*             RFY                                               02S0184 00258000
*              (GPR00P,                                         02S0184 00259000
*               GPR01P,                                         02S0184 00260000
*               GPR14F,                                         02S0184 00261000
*               GPR15F) UNRSTD;     /* DONE WITH REGS                */ 00262000
@RC00173 DS    0H                                               02S0185 00263000
*           END;                    /* POST LOGIC COMPLETE GENERATE A   00264000
*                                      DISABLE/UNLOAD SCAN.          */ 00265000
*           APCTACTR=APCTACTR+1;    /* UPDATE THE ALLOCATION COUNTER.*/ 00266000
         LA    @14,1                                            02S0186 00267000
         AL    @14,APCTACTR(,APCTPTR)                           02S0186 00268000
         ST    @14,APCTACTR(,APCTPTR)                           02S0186 00269000
*           DO;                     /* IGTYPOST                 02S0187 00270000
*                                      ECB(APCTEALP)ASCBLOC(APCTAALP)*/ 00271000
*             RFY                                               02S0188 00272000
*              (GPR00P,                                         02S0188 00273000
*               GPR01P,                                         02S0188 00274000
*               GPR14F,                                         02S0188 00275000
*               GPR15F) RSTD;       /* REGISTERS USED                */ 00276000
*             GPR15F=APCTEALP;      /* CURRENT ECB CONTENTS          */ 00277000
         L     GPR15F,APCTEALP(,APCTPTR)                        02S0189 00278000
*LTR0011X:                                                      02S0190 00279000
*             IF GPR15F<0 THEN      /* IF ECB ALREADY                */ 00280000
LTR0011X LTR   GPR15F,GPR15F                                    02S0190 00281000
         BNM   @RF00190                                         02S0190 00282000
*               DO;                 /* WAITED UPON, MUST ISSUE POST  */ 00283000
*                 GPR01P=ADDR(APCTEALP);/* ADDRESS OF ECB TO POST    */ 00284000
         LA    GPR01P,APCTEALP(,APCTPTR)                        02S0192 00285000
*                 GPR00P=APCTAALP;  /* ADDR OF ASCB FOR MEMORY TO BE    00286000
*                                      POSTED                        */ 00287000
         L     GPR00P,APCTAALP(,APCTPTR)                        02S0193 00288000
*                 CALL APCVZUBB;    /* ISSUE CROSS-MEMORY POST       */ 00289000
         L     @15,APCTZUBB(,APCTPTR)                           02S0194 00290000
         BALR  @14,@15                                          02S0194 00291000
*               END;                /* ECB POSTED                    */ 00292000
*             ELSE                  /* ECB NOT YET POSTED            */ 00293000
*               DO;                 /* SO TRY 'COMPARE-AND-SWAP' POST*/ 00294000
         B     @RC00190                                         02S0196 00295000
@RF00190 DS    0H                                               02S0197 00296000
*                 GPR14F='40000000'X;/* POST CODE                    */ 00297000
         L     GPR14F,@CF01151                                  02S0197 00298000
*                 CS(GPR15F,GPR14F,APCTEALP);/* POST THE ECB         */ 00299000
         CS    GPR15F,@14,APCTEALP(APCTPTR)                     02S0198 00300000
*                 BC(7,LTR0011X);   /* RETRY IF 'CS' FAILED          */ 00301000
         BC    7,LTR0011X                                       02S0199 00302000
*               END;                /* ECB POSTED VIA 'CS'           */ 00303000
*             RFY                                               02S0201 00304000
*              (GPR00P,                                         02S0201 00305000
*               GPR01P,                                         02S0201 00306000
*               GPR14F,                                         02S0201 00307000
*               GPR15F) UNRSTD;     /* DONE WITH REGS                */ 00308000
@RC00190 DS    0H                                               02S0202 00309000
*           END;                    /* POST LOGIC COMPLETE TELL 02S0202 00310000
*                                      ALLOCATION                    */ 00311000
*           IF APCQIINF=APCQRIPL THEN/* DETERMINE IPL TYPE FOR MSG.  */ 00312000
         CLC   APCQIINF(4,APCQPTR),@CF00224                     02S0203 00313000
         BNE   @RF00203                                         02S0203 00314000
*             TYPE='RE-';                                       02S0204 00315000
         MVC   TYPE(3),@CC01156                                 02S0204 00316000
*           ELSE                                                02S0205 00317000
*             TYPE='';                                          02S0205 00318000
         B     @RC00203                                         02S0205 00319000
@RF00203 MVI   TYPE,C' '                                        02S0205 00320000
         MVC   TYPE+1(2),TYPE                                   02S0205 00321000
*           CALL APCVZDWT(IGT222I,  /* OUTPUT SUCCESS MESSAGE.       */ 00322000
*               14,APCTSSID,4,20,UCBNAME,3,24,TYPE,3);          02S0206 00323000
@RC00203 MVC   @AL00001(40),@AL00206                            02S0206 00324000
         LA    @14,APCTSSID(,APCTPTR)                           02S0206 00325000
         ST    @14,@AL00001+8                                   02S0206 00326000
         L     @14,UCBPTR(,APUBPTR)                             02S0206 00327000
         LA    @14,UCBNAME(,@14)                                02S0206 00328000
         ST    @14,@AL00001+20                                  02S0206 00329000
         LA    @14,TYPE                                         02S0206 00330000
         ST    @14,@AL00001+32                                  02S0206 00331000
         L     @15,APCTZDWT(,APCTPTR)                           02S0206 00332000
         LA    @01,@AL00001                                     02S0206 00333000
         BALR  @14,@15                                          02S0206 00334000
*         END;                                                  02S0207 00335000
*       ELSE                                                    02S0208 00336000
*         CALL ERRPROC;             /* INVOKE THE IPL ERROR     03S0208 00337000
*                                      PROCEDURE.                    */ 00338000
         B     @RC00130                                         03S0208 00339000
@RF00130 BAL   @14,ERRPROC                                      03S0208 00340000
*     END;                                                      02S0209 00341000
*   RETURN;                                                     01S0210 00342000
@EL00001 L     @13,4(,@13)                                      01S0210 00343000
@EF00001 L     @00,@SIZDATD                                     01S0210 00344000
         LR    @01,@06                                          01S0210 00345000
         IGTYFSV  R,LV=(0),A=(1)                                        00346000
@ER00001 LM    @14,@08,12(@13)                                  01S0210 00347000
         LM    @10,@12,60(@13)                                  01S0210 00348000
         BR    @14                                              01S0210 00349000
*ERRPROC:                                                       02S0211 00350000
*   PROC;                           /* PROCESS IPL ERRORS.           */ 00351000
ERRPROC  STM   @14,@12,@SA00002                                 02S0211 00352000
*   DO;                                                         02S0212 00353000
*     CVD(R15P,DIGITS);             /* CONVERT RETURN CODE TO   02S0213 00354000
*                                      DECIMAL.                      */ 00355000
         CVD   R15P,@TS00001                                    02S0213 00356000
         MVC   DIGITS(2),@TS00001+6                             02S0213 00357000
*     UNPK(CODE,DIGITS);            /* UNPACK ANSWER.                */ 00358000
         UNPK  CODE(2),DIGITS(2)                                02S0214 00359000
*     CODE(2)=CODE(2)|'F0'X;        /* MAKE IT AN UNSIGNED NUMBER.   */ 00360000
*                                                               02S0215 00361000
         OI    CODE+1,X'F0'                                     02S0215 00362000
*     /***************************************************************/ 00363000
*     /*                                                             */ 00364000
*     /* ADDRESS OF THE APCT.                                        */ 00365000
*     /*                                                             */ 00366000
*     /***************************************************************/ 00367000
*                                                               02S0216 00368000
*     IF APCQIINF=APCQRIPL THEN     /* IF THIS IS A RE-IPL.          */ 00369000
         CLC   APCQIINF(4,APCQPTR),@CF00224                     02S0216 00370000
         BNE   @RF00216                                         02S0216 00371000
*       TYPE='RE-';                 /* SAY SO.                       */ 00372000
         MVC   TYPE(3),@CC01156                                 02S0217 00373000
*     ELSE                                                      02S0218 00374000
*       TYPE='';                    /* OTHERWISE, BLANK IT OUT.      */ 00375000
         B     @RC00216                                         02S0218 00376000
@RF00216 MVI   TYPE,C' '                                        02S0218 00377000
         MVC   TYPE+1(2),TYPE                                   02S0218 00378000
*     CALL APCVZDWT(IGT240I,14,APCTSSID,4,20,TYPE,3,30,UCBNAME,3,44,    00379000
*         CODE,2);                                              02S0219 00380000
@RC00216 MVC   @AL00001(52),@AL00219                            02S0219 00381000
         LA    @14,APCTSSID(,APCTPTR)                           02S0219 00382000
         ST    @14,@AL00001+8                                   02S0219 00383000
         LA    @14,TYPE                                         02S0219 00384000
         ST    @14,@AL00001+20                                  02S0219 00385000
         L     @14,UCBPTR(,APUBPTR)                             02S0219 00386000
         LA    @14,UCBNAME(,@14)                                02S0219 00387000
         ST    @14,@AL00001+32                                  02S0219 00388000
         LA    @14,CODE                                         02S0219 00389000
         ST    @14,@AL00001+44                                  02S0219 00390000
         L     @15,APCTZDWT(,APCTPTR)                           02S0219 00391000
         LA    @01,@AL00001                                     02S0219 00392000
         BALR  @14,@15                                          02S0219 00393000
*     CALL APCVZDIO('WAITXXXX');    /* RESET THE 3838 TO UNINIT 02S0220 00394000
*                                      STATE.                        */ 00395000
         L     @15,APCTZDIO(,APCTPTR)                           02S0220 00396000
         LA    @01,@AL00220                                     02S0220 00397000
         BALR  @14,@15                                          02S0220 00398000
*     IF APCQIINF=APCQRIPL THEN     /* IF THIS IS A RE-IPL, THE 3838 */ 00399000
         CLC   APCQIINF(4,APCQPTR),@CF00224                     02S0221 00400000
         BNE   @RF00221                                         02S0221 00401000
*       DO;                         /* MUST BE UNLOADED.             */ 00402000
*         SAVEAPCQ=APCQPTR;         /* SAVE ORIGINAL APCQ            */ 00403000
         LR    SAVEAPCQ,APCQPTR                                 02S0223 00404000
*         CALL APCVZDX1;            /* GET A NEW APCQ.               */ 00405000
         L     @15,APCTZDX1(,APCTPTR)                           02S0224 00406000
         BALR  @14,@15                                          02S0224 00407000
*         APCQIINF=APCQUNLD;        /* SET UNLOAD COMMAND.           */ 00408000
         MVC   APCQIINF(4,APCQPTR),@CF00210                     02S0225 00409000
*         APCQTXLN=3;               /* LENGTH OF UNIT NAME.          */ 00410000
         LA    @14,3                                            02S0226 00411000
         STH   @14,APCQTXLN(,APCQPTR)                           02S0226 00412000
*         APCQCMND(1:3)=            /* ACTUAL UNIT NAME (CU0).       */ 00413000
*             UCBNAME;                                          02S0227 00414000
         L     @11,UCBPTR(,APUBPTR)                             02S0227 00415000
         MVC   APCQCMND(3,APCQPTR),UCBNAME(@11)                 02S0227 00416000
*         APCQINT='1'B;             /* INTERNAL COMMAND.             */ 00417000
         OI    APCQINT(APCQPTR),B'10000000'                     02S0228 00418000
*         APCQPSTR=1;               /* START OF PARM FIELD.          */ 00419000
         MVC   APCQPSTR(2,APCQPTR),@CH00191                     02S0229 00420000
*         APCQPLEN=3;               /* LENGTH OF PARM FIELD.         */ 00421000
         STH   @14,APCQPLEN(,APCQPTR)                           02S0230 00422000
*         CALL APCVZDX2;            /* QUEUE IT TO BE PROCESSED.     */ 00423000
         L     @15,APCTZDX2(,APCTPTR)                           02S0231 00424000
         BALR  @14,@15                                          02S0231 00425000
*         APCQPTR=SAVEAPCQ;         /* RESTORE ORIGINAL APCQ.        */ 00426000
         LR    APCQPTR,SAVEAPCQ                                 02S0232 00427000
*       END;                                                    02S0233 00428000
*     ELSE                                                      02S0234 00429000
*       DO;                         /* IF NOT, THEN FREE THE DCB ETC.*/ 00430000
         B     @RC00221                                         02S0234 00431000
@RF00221 DS    0H                                               02S0235 00432000
*         RESPECIFY                                             02S0235 00433000
*           R3P RESTRICTED;                                     02S0235 00434000
*         RESPECIFY                                             02S0236 00435000
*           R2P RESTRICTED;                                     02S0236 00436000
*         R2P=APUBDCB;              /* GET ADDRESS OF DCB.           */ 00437000
         L     R2P,APUBDCB(,APUBPTR)                            02S0237 00438000
*         GEN REFS(STATCLS) SETS(DYNCLS);                       02S0238 00439000
   MVC   DYNCLS,STATCLS             MOVE IN THE PARM LIST.              00440000
   CLOSE  ((R2P)),MF=(E,DYNCLS)     CLOSE THE DCB.                      00441000
*         R3P=FREELN;               /* LENGTH OF GOTTEN MEMORY.      */ 00442000
         L     @14,APUBDCB(,APUBPTR)                            02S0239 00443000
         L     R3P,FREELN(,@14)                                 02S0239 00444000
*         GEN;                                                  02S0240 00445000
   FREEMAIN R,A=(R2P),LV=(R3P)       FREE THE IOB, DCB, AND ECB.        00446000
*         CALL APCVZDUA(8);         /* UNALLOCATE THE PORTS.         */ 00447000
         L     @15,APCTZDUA(,APCTPTR)                           02S0241 00448000
         LA    @01,@AL00241                                     02S0241 00449000
         BALR  @14,@15                                          02S0241 00450000
*       END;                                                    02S0242 00451000
*   END;                                                        02S0243 00452000
*   RETURN;                         /* RETURN TO CALLER.             */ 00453000
@EL00002 DS    0H                                               02S0244 00454000
@EF00002 DS    0H                                               02S0244 00455000
@ER00002 LM    @14,@12,@SA00002                                 02S0244 00456000
         BR    @14                                              02S0244 00457000
*   END;                            /* END OF IPL ERROR PROCEDURE.   */ 00458000
         B     @EL00002                                         02S0245 00459000
*                                   /* IGTXEPLG                      */ 00460000
*                                                               01S0246 00461000
*   /*****************************************************************/ 00462000
*   /*                                                               */ 00463000
*   /* SYSTEM DECLARES                                               */ 00464000
*   /*                                                               */ 00465000
*   /*****************************************************************/ 00466000
*                                                               01S0246 00467000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 00468000
*     GPR14F FIXED(31) REG(14),                                 01S0246 00469000
*     GPR15F FIXED(31) REG(15),                                 01S0246 00470000
*     GPR00P PTR(31) REG(0),                                    01S0246 00471000
*     GPR01P PTR(31) REG(1);                                    01S0246 00472000
*   DECLARE                         /* COMMON VARIABLES              */ 00473000
*     I256C CHAR(256) BASED,                                    01S0247 00474000
*     I031F FIXED(31) BASED,                                    01S0247 00475000
*     I031P PTR(31) BASED,                                      01S0247 00476000
*     I015F FIXED(15) BASED,                                    01S0247 00477000
*     I015P PTR(15) BASED,                                      01S0247 00478000
*     I008P PTR(8) BASED,                                       01S0247 00479000
*     I001C CHAR(1) BASED;                                      01S0247 00480000
*                                                               01S0248 00481000
*   /*****************************************************************/ 00482000
*   /*                                                               */ 00483000
*   /* MODULE PATCH AREA                                             */ 00484000
*   /*                                                               */ 00485000
*   /*****************************************************************/ 00486000
*                                                               01S0248 00487000
*   DCL                                                         01S0248 00488000
*     APPATCH CHAR(*) INT STATIC LOCAL GEND;                    01S0248 00489000
*   GENERATE DATA DEFS(APPATCH);                                01S0249 00490000
*                                                               01S0250 00491000
*   /*****************************************************************/ 00492000
*   /*                                                               */ 00493000
*   /* GENERAL REGISTER DECLARES                                     */ 00494000
*   /*                                                               */ 00495000
*   /*****************************************************************/ 00496000
*                                                               01S0250 00497000
*   DCL                                                         01S0250 00498000
*     R0F FIXED(31) REG(0),                                     01S0250 00499000
*     R0P PTR(24) REG(0),                                       01S0250 00500000
*     R0RSTD PTR(31) REG(0),                                    01S0250 00501000
*     R1F FIXED(31) REG(1),                                     01S0250 00502000
*     R1P PTR(24) REG(1),                                       01S0250 00503000
*     R1RSTD PTR(31) REG(1),                                    01S0250 00504000
*     R2F FIXED(31) REG(2),                                     01S0250 00505000
*     R2P PTR(24) REG(2),                                       01S0250 00506000
*     R2RSTD PTR(31) REG(2),                                    01S0250 00507000
*     R3F FIXED(31) REG(3),                                     01S0250 00508000
*     R3P PTR(24) REG(3),                                       01S0250 00509000
*     R3RSTD PTR(31) REG(3),                                    01S0250 00510000
*     R4F FIXED(31) REG(4),                                     01S0250 00511000
*     R4P PTR(24) REG(4),                                       01S0250 00512000
*     R4RSTD PTR(31) REG(4),                                    01S0250 00513000
*     R5F FIXED(31) REG(5),                                     01S0250 00514000
*     R5P PTR(24) REG(5),                                       01S0250 00515000
*     R5RSTD PTR(31) REG(5),                                    01S0250 00516000
*     R6F FIXED(31) REG(6),                                     01S0250 00517000
*     R6P PTR(24) REG(6),                                       01S0250 00518000
*     R6RSTD PTR(31) REG(6),                                    01S0250 00519000
*     R7F FIXED(31) REG(7),                                     01S0250 00520000
*     R7P PTR(24) REG(7),                                       01S0250 00521000
*     R7RSTD PTR(31) REG(7),                                    01S0250 00522000
*     R8F FIXED(31) REG(8),                                     01S0250 00523000
*     R8P PTR(24) REG(8),                                       01S0250 00524000
*     R8RSTD PTR(31) REG(8),                                    01S0250 00525000
*     R9F FIXED(31) REG(9),                                     01S0250 00526000
*     R9P PTR(24) REG(9),                                       01S0250 00527000
*     R9RSTD PTR(31) REG(9),                                    01S0250 00528000
*     R10F FIXED(31) REG(10),                                   01S0250 00529000
*     R10P PTR(24) REG(10),                                     01S0250 00530000
*     R10RSTD PTR(31) REG(10),                                  01S0250 00531000
*     R11F FIXED(31) REG(11),                                   01S0250 00532000
*     R11P PTR(24) REG(11),                                     01S0250 00533000
*     R11RSTD PTR(31) REG(11),                                  01S0250 00534000
*     R12F FIXED(31) REG(12),                                   01S0250 00535000
*     R12P PTR(24) REG(12),                                     01S0250 00536000
*     R12RSTD PTR(31) REG(12),                                  01S0250 00537000
*     R13F FIXED(31) REG(13),                                   01S0250 00538000
*     R13P PTR(24) REG(13),                                     01S0250 00539000
*     R13RSTD PTR(31) REG(13),                                  01S0250 00540000
*     R14F FIXED(31) REG(14),                                   01S0250 00541000
*     R14P PTR(24) REG(14),                                     01S0250 00542000
*     R14RSTD PTR(31) REG(14),                                  01S0250 00543000
*     R15F FIXED(31) REG(15),                                   01S0250 00544000
*     R15P PTR(24) REG(15),                                     01S0250 00545000
*     R15RSTD PTR(31) REG(15),                                  01S0250 00546000
*                                                               01S0250 00547000
*     /***************************************************************/ 00548000
*     /*                                                             */ 00549000
*     /* VPSS CONTROL BLOCK POINTER DECLARES                         */ 00550000
*     /*                                                             */ 00551000
*     /***************************************************************/ 00552000
*                                                               01S0250 00553000
*     APSMPTR PTR(24) REG(01),      /* STORAGE MANAGEMENT BLOCK 01S0250 00554000
*                                      (SUGGESTED POINTER)           */ 00555000
*     APSCPTR PTR(24) REG(01),      /* STORAGE MANAGEMENT CONTROL       00556000
*                                      WORD (SUGGESTED POINTER)      */ 00557000
*     APINPTR PTR(24) REG(01),      /* USER'S INPUT PARAMETER LIST      00558000
*                                      (SUGGESTED POINTER)           */ 00559000
*/*                                                                  */ 00560000
*                                                               01S0250 00561000
*     APDATA PTR(24) REG(06),       /* ADDRESS OF DYNAMIC DATA  01S0250 00562000
*                                      WORKAREA (DATAREG)            */ 00563000
*     APCODE PTR(24) REG(07),       /* PROGRAM CODE BASE REGISTER       00564000
*                                      (CODEREG)                     */ 00565000
*     APDEBPTR PTR(24) REG(08),     /* VPSS DEB (SUGGESTED POINTER)  */ 00566000
*     APNPPTR PTR(24) REG(08),      /* SUBSYSTEM INITIALIZATION 01S0250 00567000
*                                      WORKAREA BLOCK (ONLY USED BY     00568000
*                                      SUBSYSTEM INITIALIZATION)     */ 00569000
*     APRLPTR PTR(24) REG(08),      /* VPSS ACB REQUEST LIST    01S0250 00570000
*                                      (SUGGESTED POINTER)           */ 00571000
*     APCIPTR PTR(24) REG(08),      /* 3838 CONTROL TABLE (SUGGESTED    00572000
*                                      POINTER)                      */ 00573000
*     APCWPTR PTR(24) REG(08),      /* CALL INTERFACE WORKAREA  01S0250 00574000
*                                      (SUGGESTED POINTER)           */ 00575000
*     APERPTR PTR(24) REG(08),      /* ERP/IO APPENDAGE WORKAREA        00576000
*                                      (SUGGESTED POINTER)           */ 00577000
*     APACBPTR PTR(24) REG(09),     /* VPSS ACB (SUGGESTED POINTER)  */ 00578000
*     APCQPTR PTR(24) REG(09),      /* COMMAND QUEUE ELEMENT    01S0250 00579000
*                                      (SUGGESTED POINTER)           */ 00580000
*     APOTPTR PTR(24) REG(09),      /* OPTION TABLE (SUGGESTED  01S0250 00581000
*                                      POINTER)                      */ 00582000
*     APIOPTR PTR(24) REG(10),      /* I/O ELEMENT (SUGGESTED   01S0250 00583000
*                                      POINTER)                      */ 00584000
*     APEXLPTR PTR(24) REG(10),     /* VPSS EXLST (SUGGESTED POINTER)*/ 00585000
*     APUBPTR PTR(24) REG(10),      /* UNIT BLOCK (SUGGESTED POINTER)*/ 00586000
*     APAXPTR PTR(24) REG(10),      /* VPSS ACB EXTENSION (SUGGESTED    00587000
*                                      POINTER)                      */ 00588000
*     APCPPTR PTR(24) REG(10),      /* VPSS CALL PROCESSING     01S0250 00589000
*                                      INDICATORS (SUGGESTED POINTER)*/ 00590000
*     APOCPTR PTR(24) REG(10),      /* VPSS OPEN/CLOSE SUBSYSTEM        00591000
*                                      WORKAREA (REQUIRED POINTER)   */ 00592000
*     APATPTR PTR(24) REG(11),      /* VPSS ACB TABLE (SUGGESTED        00593000
*                                      POINTER)                      */ 00594000
*     APLBPTR PTR(24) REG(11),      /* LABEL RESOLUTION TABLE   01S0250 00595000
*                                      (SUGGESTED POINTER)           */ 00596000
*     APUTPTR PTR(24) REG(11),      /* USER TABLE (SUGGESTED POINTER)*/ 00597000
*     APDSPTR PTR(24) REG(11),      /* VPSS DATASET ENTRY (SUGGESTED    00598000
*                                      POINTER)                      */ 00599000
*     APXLPTR PTR(24) REG(11),      /* TRANSLATION TABLE (SUGGESTED     00600000
*                                      POINTER)                      */ 00601000
*     APDXPTR PTR(24) REG(11),      /* VPSS DEB EXTENSION (SUGGESTED    00602000
*                                      POINTER)                      */ 00603000
*     APCTPTR PTR(24) REG(12) RSTD, /* CONTROL TABLE (REQUIRED  01S0250 00604000
*                                      POINTER)                      */ 00605000
*     APSVPTR PTR(24) REG(13) RSTD, /* OS/VPSS SAVEAREA/WORKAREA        00606000
*                                      (REQUIRED POINTER)            */ 00607000
*     APRETURN PTR(24) REG(14),     /* RETURN ADDRESS FOR SUBROUTINE    00608000
*                                      LINKAGE                       */ 00609000
*     APENTRY PTR(24) REG(15),      /* SUBROUTINE ENTRY POINT LINKAGE*/ 00610000
*     APRCODE PTR(24) REG(15);      /* CONTAINS SUBROUTINE RETURN       00611000
*                                      CODE                          */ 00612000
*                                                               01S0251 00613000
*   /*****************************************************************/ 00614000
*   /*                                                               */ 00615000
*   /* USER REGISTER DECLARES                                        */ 00616000
*   /*                                                               */ 00617000
*   /*****************************************************************/ 00618000
*                                                               01S0251 00619000
*   END                                                         01S0251 00620000
*                                                               01S0251 00621000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00622000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00623000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00624000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00625000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00626000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00627000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00628000
*/*%INCLUDE SYSLIB  (IGTXAPSV)                                       */ 00629000
*/*%INCLUDE SYSLIB  (IGTXAPMM)                                       */ 00630000
*/*%INCLUDE SYSLIB  (IGTXAPCQ)                                       */ 00631000
*/*%INCLUDE SYSLIB  (IGTXAPCT)                                       */ 00632000
*/*%INCLUDE SYSLIB  (IGTXAPCV)                                       */ 00633000
*/*%INCLUDE SYSLIB  (IGTXAPUB)                                       */ 00634000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 00635000
*/*%INCLUDE SYSUT5  (IPLERR  )                                       */ 00636000
*/*%INCLUDE SYSUT5  (IPLERR  )                                       */ 00637000
*/*%INCLUDE SYSUT5  (GOODIPL )                                       */ 00638000
*/*%INCLUDE SYSUT5  (ERRPROC )                                       */ 00639000
*                                                               01S0251 00640000
*       ;                                                       01S0251 00641000
         B     @EL00001                                         01S0251 00642000
@DATA    DS    0H                                                       00643000
@CH00191 DC    H'1'                                                     00644000
         DS    0F                                                       00645000
@AL00206 DC    A(@CF00126)             LIST WITH  10 ARGUMENT(S)        00646000
         DC    A(@CF00224)                                              00647000
         DC    AL1(X'80')                                               00648000
         DC    AL3(@CC01165)                                            00649000
         DC    A(@CF00091)                                              00650000
         DC    A(@CF00100)                                              00651000
         DC    A(@CF00039)                                              00652000
         DC    A(@CF00048)                                              00653000
         DC    A(@CF00102)                                              00654000
         DC    AL1(X'80')                                               00655000
         DC    AL3(@CC01165)                                            00656000
         DC    AL1(X'80')                                               00657000
         DC    AL3(@CF00048)                                            00658000
@AL00219 DC    A(@CF00086)             LIST WITH  13 ARGUMENT(S)        00659000
         DC    A(@CF00224)                                              00660000
         DC    A(@CF00039)                                              00661000
         DC    A(@CF00091)                                              00662000
         DC    A(@CF00100)                                              00663000
         DC    AL1(X'80')                                               00664000
         DC    AL3(@CC01165)                                            00665000
         DC    A(@CF00048)                                              00666000
         DC    A(@CF01164)                                              00667000
@AL00241 DC    A(@CF00039)             LIST WITH   1 ARGUMENT(S)        00668000
         DC    A(@CF00048)                                              00669000
         DC    A(@CF00111)                                              00670000
@AL00220 DC    AL1(X'80')              LIST WITH   1 ARGUMENT(S)        00671000
         DC    AL3(@CC01165)                                            00672000
         DC    AL1(X'80')                                               00673000
         DC    AL3(@CF00044)                                            00674000
@DATD    DSECT                                                          00675000
         DS    0F                                                       00676000
@SA00001 DS    20F                                                      00677000
@SA00002 DS    15F                                                      00678000
@AL00001 DS    13A                                                      00679000
IGTDIP   CSECT                                                          00680000
         DS    0F                                                       00681000
@CF00044 DC    F'2'                                                     00682000
@CF00048 DC    F'3'                                                     00683000
@CF00091 DC    F'4'                                                     00684000
@CF00208 DC    F'5'                                                     00685000
@CF00210 DC    F'6'                                                     00686000
@CF00039 DC    F'8'                                                     00687000
@CF00224 DC    F'14'                                                    00688000
@CF00100 DC    F'20'                                                    00689000
@CF00102 DC    F'24'                                                    00690000
@CF01164 DC    F'30'                                                    00691000
@CF00111 DC    F'44'                                                    00692000
@CF00126 DC    F'76'                                                    00693000
@CF00086 DC    F'80'                                                    00694000
@CF01151 DC    XL4'40000000'                                            00695000
@CF01250 DC    BL4'00000000000000000000000010000000'                    00696000
@CF01253 DC    BL4'11101111111111111111111111111111'                    00697000
@CF01256 DC    BL4'00010000000000000000000000000000'                    00698000
@CF01259 DC    BL4'01111111111111111111111111111111'                    00699000
@CF01262 DC    BL4'11111111111011111111111111111111'                    00700000
@CF01265 DC    BL4'11111111111101111111111111111111'                    00701000
@CF01268 DC    BL4'11111111001111111111111111111111'                    00702000
@CF01271 DC    BL4'11111111110100111111111111111111'                    00703000
@CF01274 DC    BL4'11111111111111110111111111111111'                    00704000
@CF01277 DC    BL4'11111111101111111111111111111111'                    00705000
@CF01280 DC    BL4'10111111111111111111111111111111'                    00706000
@CF01283 DC    BL4'00000000000000000000000001000000'                    00707000
@DATD    DSECT                                                          00708000
         DS    0D                                                       00709000
         DS    0D                                                       00710000
@TS00001 DS    CL8                                                      00711000
LOADNAME DS    CL8                                                      00712000
CODE     DS    CL2                                                      00713000
DIGITS   DS    CL2                                                      00714000
TYPE     DS    CL3                                                      00715000
IGTDIP   CSECT                                                          00716000
         DS    0F                                                       00717000
@SIZDATD DC    AL1(0)                                                   00718000
         DC    AL3(@ENDDATD-@DATD)                                      00719000
         DS    0D                                                       00720000
@CC01165 DC    C'WAITXXXX'                                              00721000
@CC01135 DC    C'IPL'                                                   00722000
@CC01156 DC    C'RE-'                                                   00723000
@DATD    DSECT                                                          00724000
DYNCLS CLOSE (*-*),MF=L                                                 00725000
IGTDIP   CSECT                                                          00726000
STATCLS CLOSE (*-*),MF=L                                                00727000
IGTDIP   CSECT                                                          00728000
*                                   /* GENERATE PATCH                   00729000
         IGTXZAP ,                 GENERATE PATCH AREA                  00730000
@DATD    DSECT                                                          00731000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00732000
@ENDDATD EQU   *                                                        00733000
IGTDIP   CSECT                                                          00734000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00735000
@01      EQU   01                                                       00736000
@02      EQU   02                                                       00737000
@03      EQU   03                                                       00738000
@04      EQU   04                                                       00739000
@05      EQU   05                                                       00740000
@06      EQU   06                                                       00741000
@07      EQU   07                                                       00742000
@08      EQU   08                                                       00743000
@09      EQU   09                                                       00744000
@10      EQU   10                                                       00745000
@11      EQU   11                                                       00746000
@12      EQU   12                                                       00747000
@13      EQU   13                                                       00748000
@14      EQU   14                                                       00749000
@15      EQU   15                                                       00750000
SAVEAPUB EQU   @04                                                      00751000
SAVEAPCQ EQU   @02                                                      00752000
APCQPTR  EQU   @09                                                      00753000
APDATA   EQU   @06                                                      00754000
APCODE   EQU   @07                                                      00755000
APSVPTR  EQU   @13                                                      00756000
APCTPTR  EQU   @12                                                      00757000
APUBPTR  EQU   @10                                                      00758000
R15P     EQU   @15                                                      00759000
R1P      EQU   @01                                                      00760000
GPR00P   EQU   @00                                                      00761000
GPR01P   EQU   @01                                                      00762000
GPR14F   EQU   @14                                                      00763000
GPR15F   EQU   @15                                                      00764000
R3P      EQU   @03                                                      00765000
R2P      EQU   @02                                                      00766000
APACBPTR EQU   @09                                                      00767000
APATPTR  EQU   @11                                                      00768000
APAXPTR  EQU   @10                                                      00769000
APCIPTR  EQU   @08                                                      00770000
APCPPTR  EQU   @10                                                      00771000
APCWPTR  EQU   @08                                                      00772000
APDEBPTR EQU   @08                                                      00773000
APDSPTR  EQU   @11                                                      00774000
APDXPTR  EQU   @11                                                      00775000
APENTRY  EQU   @15                                                      00776000
APERPTR  EQU   @08                                                      00777000
APEXLPTR EQU   @10                                                      00778000
APINPTR  EQU   @01                                                      00779000
APIOPTR  EQU   @10                                                      00780000
APLBPTR  EQU   @11                                                      00781000
APNPPTR  EQU   @08                                                      00782000
APOCPTR  EQU   @10                                                      00783000
APOTPTR  EQU   @09                                                      00784000
APRCODE  EQU   @15                                                      00785000
APRETURN EQU   @14                                                      00786000
APRLPTR  EQU   @08                                                      00787000
APSCPTR  EQU   @01                                                      00788000
APSMPTR  EQU   @01                                                      00789000
APUTPTR  EQU   @11                                                      00790000
APXLPTR  EQU   @11                                                      00791000
R0F      EQU   @00                                                      00792000
R0P      EQU   @00                                                      00793000
R0RSTD   EQU   @00                                                      00794000
R1F      EQU   @01                                                      00795000
R1RSTD   EQU   @01                                                      00796000
R10F     EQU   @10                                                      00797000
R10P     EQU   @10                                                      00798000
R10RSTD  EQU   @10                                                      00799000
R11F     EQU   @11                                                      00800000
R11P     EQU   @11                                                      00801000
R11RSTD  EQU   @11                                                      00802000
R12F     EQU   @12                                                      00803000
R12P     EQU   @12                                                      00804000
R12RSTD  EQU   @12                                                      00805000
R13F     EQU   @13                                                      00806000
R13P     EQU   @13                                                      00807000
R13RSTD  EQU   @13                                                      00808000
R14F     EQU   @14                                                      00809000
R14P     EQU   @14                                                      00810000
R14RSTD  EQU   @14                                                      00811000
R15F     EQU   @15                                                      00812000
R15RSTD  EQU   @15                                                      00813000
R2F      EQU   @02                                                      00814000
R2RSTD   EQU   @02                                                      00815000
R3F      EQU   @03                                                      00816000
R3RSTD   EQU   @03                                                      00817000
R4F      EQU   @04                                                      00818000
R4P      EQU   @04                                                      00819000
R4RSTD   EQU   @04                                                      00820000
R5F      EQU   @05                                                      00821000
R5P      EQU   @05                                                      00822000
R5RSTD   EQU   @05                                                      00823000
R6F      EQU   @06                                                      00824000
R6P      EQU   @06                                                      00825000
R6RSTD   EQU   @06                                                      00826000
R7F      EQU   @07                                                      00827000
R7P      EQU   @07                                                      00828000
R7RSTD   EQU   @07                                                      00829000
R8F      EQU   @08                                                      00830000
R8P      EQU   @08                                                      00831000
R8RSTD   EQU   @08                                                      00832000
R9F      EQU   @09                                                      00833000
R9P      EQU   @09                                                      00834000
R9RSTD   EQU   @09                                                      00835000
FREELN   EQU   0                                                        00836000
APSV     EQU   0                                                        00837000
APSVREGS EQU   APSV+12                                                  00838000
APCQ     EQU   0                                                        00839000
APCQIINF EQU   APCQ+12                                                  00840000
APCQPLEN EQU   APCQ+20                                                  00841000
APCQPSTR EQU   APCQ+22                                                  00842000
APCQSW   EQU   APCQ+24                                                  00843000
APCQINT  EQU   APCQSW                                                   00844000
APCQTXLN EQU   APCQ+26                                                  00845000
APCQCMND EQU   APCQ+28                                                  00846000
APCT     EQU   0                                                        00847000
APCTENQM EQU   APCT+12                                                  00848000
APCTSSID EQU   APCTENQM+4                                               00849000
APCTSMIN EQU   APCT+32                                                  00850000
APCTSMAD EQU   APCT+36                                                  00851000
APCTZ@@@ EQU   APCT+40                                                  00852000
APCTU@@@ EQU   APCT+440                                                 00853000
APCTBR14 EQU   APCT+840                                                 00854000
APCTERRS EQU   APCT+876                                                 00855000
@NM00017 EQU   APCT+936                                                 00856000
APCTSTAT EQU   @NM00017                                                 00857000
APCTPRSW EQU   @NM00017+1                                               00858000
APCTAPCQ EQU   APCT+944                                                 00859000
APCTCQAQ EQU   APCT+952                                                 00860000
APCTEULD EQU   APCT+972                                                 00861000
APCTEALP EQU   APCT+1016                                                00862000
APCTAALP EQU   APCT+1020                                                00863000
APCTACTR EQU   APCT+1112                                                00864000
APCTZ@@1 EQU   APCT+1120                                                00865000
APCVZUBB EQU   0                                                        00866000
APCVZDX1 EQU   0                                                        00867000
APCVZDX2 EQU   0                                                        00868000
APCVZDID EQU   0                                                        00869000
APCVZDWT EQU   0                                                        00870000
APCVZDUA EQU   0                                                        00871000
APCVZDIO EQU   0                                                        00872000
APCVZUHA EQU   0                                                        00873000
APCVZUJA EQU   0                                                        00874000
APUB     EQU   0                                                        00875000
APUBAPUB EQU   APUB+4                                                   00876000
APUBIOCT EQU   APUB+24                                                  00877000
APUBUCB  EQU   APUB+28                                                  00878000
APUBERRT EQU   APUB+44                                                  00879000
APUBERRS EQU   APUB+52                                                  00880000
APUBIPL  EQU   APUB+74                                                  00881000
APUBALFG EQU   APUB+80                                                  00882000
APUBALF0 EQU   APUBALFG                                                 00883000
APUBSBCH EQU   APUBALF0                                                 00884000
APUBALF1 EQU   APUBALFG+1                                               00885000
APUBZRGN EQU   APUBALF1                                                 00886000
APUBDSBL EQU   APUBALF1                                                 00887000
APUBUNLD EQU   APUBALF1                                                 00888000
APUBBERR EQU   APUBALF1                                                 00889000
APUBDSBP EQU   APUBALF1                                                 00890000
APUBUNLP EQU   APUBALF1                                                 00891000
APUBALF2 EQU   APUBALFG+2                                               00892000
APUBALF3 EQU   APUBALFG+3                                               00893000
APUBSTAT EQU   APUB+84                                                  00894000
APUBRIPL EQU   APUBSTAT                                                 00895000
APUBQISC EQU   APUBSTAT                                                 00896000
APUBIOFG EQU   APUB+88                                                  00897000
APUBIOF0 EQU   APUBIOFG                                                 00898000
APUBIDWN EQU   APUBIOF0                                                 00899000
APUBIDAB EQU   APUBIOF0                                                 00900000
APUBIOF1 EQU   APUBIOFG+1                                               00901000
APUBIERR EQU   APUBIOF1                                                 00902000
APUBIIPL EQU   APUBIOF1                                                 00903000
APUBIOF2 EQU   APUBIOFG+2                                               00904000
APUBIEXC EQU   APUBIOF2                                                 00905000
APUBIOF3 EQU   APUBIOFG+3                                               00906000
APUBIRIP EQU   APUBIOF3                                                 00907000
APUBISHR EQU   APUBIOF3                                                 00908000
APUBDCB  EQU   APUB+96                                                  00909000
UCB      EQU   0                                                        00910000
UCBOB    EQU   0                                                        00911000
UCBJBNR  EQU   UCBOB                                                    00912000
UCBFL5   EQU   UCBOB+1                                                  00913000
UCBAF    EQU   UCBFL5                                                   00914000
UCBSTAT  EQU   UCBOB+3                                                  00915000
UCBCHAN  EQU   UCBOB+4                                                  00916000
UCBSFLS  EQU   UCBOB+6                                                  00917000
UCBFLA   EQU   UCBSFLS                                                  00918000
UCBFL1   EQU   UCBFLA                                                   00919000
UCBBSY   EQU   UCBFL1                                                   00920000
UCBNRY   EQU   UCBFL1                                                   00921000
UCBPST   EQU   UCBFL1                                                   00922000
UCBCUB   EQU   UCBFL1                                                   00923000
UCBQISCE EQU   UCBFL1                                                   00924000
UCBFLB   EQU   UCBSFLS+1                                                00925000
UCBCHM   EQU   UCBOB+8                                                  00926000
UCBCHM1  EQU   UCBCHM                                                   00927000
UCBPTH0  EQU   UCBCHM1                                                  00928000
UCBPTH1  EQU   UCBCHM1                                                  00929000
UCBWGT   EQU   UCBOB+12                                                 00930000
UCBNAME  EQU   UCBOB+13                                                 00931000
UCBTYP   EQU   UCBOB+16                                                 00932000
UCBTBYT1 EQU   UCBTYP                                                   00933000
UCB1FEA5 EQU   UCBTBYT1                                                 00934000
UCB1FEA6 EQU   UCBTBYT1                                                 00935000
UCBTBYT2 EQU   UCBTYP+1                                                 00936000
UCB2OPT2 EQU   UCBTBYT2                                                 00937000
UCBDUDN1 EQU   UCB2OPT2                                                 00938000
UCB2OPT3 EQU   UCBTBYT2                                                 00939000
UCBDUDN2 EQU   UCB2OPT3                                                 00940000
UCB2OPT4 EQU   UCBTBYT2                                                 00941000
UCBRWTAU EQU   UCB2OPT4                                                 00942000
UCB2OPT6 EQU   UCBTBYT2                                                 00943000
UCB2OPT7 EQU   UCBTBYT2                                                 00944000
UCBTBYT3 EQU   UCBTYP+2                                                 00945000
UCBDVCLS EQU   UCBTBYT3                                                 00946000
UCBTBYT4 EQU   UCBTYP+3                                                 00947000
UCBEXTPT EQU   UCBOB+20                                                 00948000
UCBFLC   EQU   UCBEXTPT                                                 00949000
UCBDEV   EQU   UCBOB+24                                                 00950000
UCBCMEXT EQU   0                                                        00951000
UCBATI   EQU   UCBCMEXT+3                                               00952000
@NM00068 EQU   UCBATI                                                   00953000
UCBFLP1  EQU   UCBCMEXT+5                                               00954000
UCBMT    EQU   0                                                        00955000
UCBOCR   EQU   0                                                        00956000
UCB3540X EQU   0                                                        00957000
UCBDKBYT EQU   UCB3540X+6                                               00958000
UCB3800X EQU   0                                                        00959000
UCBOPTNS EQU   UCB3800X                                                 00960000
UCBACTIV EQU   UCB3800X+3                                               00961000
UCBMDRBF EQU   UCB3800X+36                                              00962000
UCBUCS   EQU   0                                                        00963000
UCBUCSOP EQU   UCBUCS+4                                                 00964000
UCBFCBOP EQU   UCBUCS+5                                                 00965000
APCVZDAL EQU   0                                                        00966000
APCVZDAP EQU   0                                                        00967000
APCVZDBK EQU   0                                                        00968000
APCVZDDA EQU   0                                                        00969000
APCVZDDQ EQU   0                                                        00970000
APCVZDEQ EQU   0                                                        00971000
APCVZDIP EQU   0                                                        00972000
APCVZDMD EQU   0                                                        00973000
APCVZDMM EQU   0                                                        00974000
APCVZDQR EQU   0                                                        00975000
APCVZDRI EQU   0                                                        00976000
APCVZDUL EQU   0                                                        00977000
APCVZDWI EQU   0                                                        00978000
APCVZDX3 EQU   0                                                        00979000
APCVZDX4 EQU   0                                                        00980000
APCVZD10 EQU   0                                                        00981000
APCVZD20 EQU   0                                                        00982000
APCVZD4E EQU   0                                                        00983000
APCVZD40 EQU   0                                                        00984000
APCVZD41 EQU   0                                                        00985000
APCVZD42 EQU   0                                                        00986000
APCVZD43 EQU   0                                                        00987000
APCVZD44 EQU   0                                                        00988000
APCVZD45 EQU   0                                                        00989000
APCVZD46 EQU   0                                                        00990000
APCVZD47 EQU   0                                                        00991000
APCVZD48 EQU   0                                                        00992000
APCVZD49 EQU   0                                                        00993000
APCVZD60 EQU   0                                                        00994000
APCVZD80 EQU   0                                                        00995000
APCVZD81 EQU   0                                                        00996000
APCVZD82 EQU   0                                                        00997000
APCVZD83 EQU   0                                                        00998000
APCVZJAA EQU   0                                                        00999000
APCVZJAD EQU   0                                                        01000000
APCVZJAG EQU   0                                                        01001000
APCVZJAJ EQU   0                                                        01002000
APCVZJAM EQU   0                                                        01003000
APCVZJAP EQU   0                                                        01004000
APCVZJAX EQU   0                                                        01005000
APCVZJAY EQU   0                                                        01006000
APCVZJBA EQU   0                                                        01007000
APCVZJBD EQU   0                                                        01008000
APCVZJBG EQU   0                                                        01009000
APCVZJBJ EQU   0                                                        01010000
APCVZJBM EQU   0                                                        01011000
APCVZJDA EQU   0                                                        01012000
APCVZJDD EQU   0                                                        01013000
APCVZJDG EQU   0                                                        01014000
APCVZJDJ EQU   0                                                        01015000
APCVZJDM EQU   0                                                        01016000
APCVZJHC EQU   0                                                        01017000
APCVZJHE EQU   0                                                        01018000
APCVZJHF EQU   0                                                        01019000
APCVZJHO EQU   0                                                        01020000
APCVZJHQ EQU   0                                                        01021000
APCVZJHR EQU   0                                                        01022000
APCVZJHT EQU   0                                                        01023000
APCVZJHW EQU   0                                                        01024000
APCVZJH0 EQU   0                                                        01025000
APCVZJH6 EQU   0                                                        01026000
APCVZJI0 EQU   0                                                        01027000
APCVZJI3 EQU   0                                                        01028000
APCVZJJ0 EQU   0                                                        01029000
APCVZKAA EQU   0                                                        01030000
APCVZKBA EQU   0                                                        01031000
APCVZKBB EQU   0                                                        01032000
APCVZKBC EQU   0                                                        01033000
APCVZKBD EQU   0                                                        01034000
APCVZKBE EQU   0                                                        01035000
APCVZKBF EQU   0                                                        01036000
APCVZKCA EQU   0                                                        01037000
APCVZKDA EQU   0                                                        01038000
APCVZKGA EQU   0                                                        01039000
APCVZKGB EQU   0                                                        01040000
APCVZKGC EQU   0                                                        01041000
APCVZKGD EQU   0                                                        01042000
APCVZLCA EQU   0                                                        01043000
APCVZLCB EQU   0                                                        01044000
APCVZMBA EQU   0                                                        01045000
APCVZMBD EQU   0                                                        01046000
APCVZMBG EQU   0                                                        01047000
APCVZMBH EQU   0                                                        01048000
APCVZMBK EQU   0                                                        01049000
APCVZMBM EQU   0                                                        01050000
APCVZMIB EQU   0                                                        01051000
APCVZMIC EQU   0                                                        01052000
APCVZMIF EQU   0                                                        01053000
APCVZMJB EQU   0                                                        01054000
APCVZMJC EQU   0                                                        01055000
APCVZMJH EQU   0                                                        01056000
APCVZMJI EQU   0                                                        01057000
APCVZMMA EQU   0                                                        01058000
APCVZUAA EQU   0                                                        01059000
APCVZUAB EQU   0                                                        01060000
APCVZUAC EQU   0                                                        01061000
APCVZUAD EQU   0                                                        01062000
APCVZUAE EQU   0                                                        01063000
APCVZUAF EQU   0                                                        01064000
APCVZUAG EQU   0                                                        01065000
APCVZUFA EQU   0                                                        01066000
APCVZUHB EQU   0                                                        01067000
APCVZUKA EQU   0                                                        01068000
APCV1CMD EQU   0                                                        01069000
APCV1JAA EQU   0                                                        01070000
APCV1JBJ EQU   0                                                        01071000
APCV1JHC EQU   0                                                        01072000
APCV1JHL EQU   0                                                        01073000
APCV1JHT EQU   0                                                        01074000
APCV1MAB EQU   0                                                        01075000
APCV1MBD EQU   0                                                        01076000
APCV2JHC EQU   0                                                        01077000
APCV2JHL EQU   0                                                        01078000
APCV2MBD EQU   0                                                        01079000
I001C    EQU   0                                                        01080000
I008P    EQU   0                                                        01081000
I015F    EQU   0                                                        01082000
I015P    EQU   0                                                        01083000
I031F    EQU   0                                                        01084000
I031P    EQU   0                                                        01085000
I256C    EQU   0                                                        01086000
UCBBGN   EQU   0                                                        01087000
UCBPTR   EQU   APUBUCB                                                  01088000
APCTZ    EQU   APCTZ@@@                                                 01089000
APCTZUAA EQU   APCTZ                                                    01090000
APCTZUAB EQU   APCTZ+4                                                  01091000
APCTZUAC EQU   APCTZ+8                                                  01092000
APCTZUAD EQU   APCTZ+12                                                 01093000
APCTZUAE EQU   APCTZ+16                                                 01094000
APCTZUBB EQU   APCTZ+24                                                 01095000
APCTZD10 EQU   APCTZ+28                                                 01096000
APCTZD20 EQU   APCTZ+32                                                 01097000
APCTZD40 EQU   APCTZ+36                                                 01098000
APCTZD41 EQU   APCTZ+40                                                 01099000
APCTZD42 EQU   APCTZ+44                                                 01100000
APCTZD43 EQU   APCTZ+48                                                 01101000
APCTZD44 EQU   APCTZ+52                                                 01102000
APCTZD45 EQU   APCTZ+56                                                 01103000
APCTZD46 EQU   APCTZ+60                                                 01104000
APCTZD47 EQU   APCTZ+64                                                 01105000
APCTZD48 EQU   APCTZ+68                                                 01106000
APCTZD49 EQU   APCTZ+72                                                 01107000
APCTZD60 EQU   APCTZ+76                                                 01108000
APCTZD80 EQU   APCTZ+80                                                 01109000
APCTZD4E EQU   APCTZ+84                                                 01110000
APCTZMBA EQU   APCTZ+88                                                 01111000
APCTZMBD EQU   APCTZ+92                                                 01112000
APCTZMBG EQU   APCTZ+96                                                 01113000
APCTZDX1 EQU   APCTZ+104                                                01114000
APCTZDX2 EQU   APCTZ+108                                                01115000
APCTZDX3 EQU   APCTZ+112                                                01116000
APCTZDX4 EQU   APCTZ+116                                                01117000
APCTZMBH EQU   APCTZ+120                                                01118000
APCTZMBK EQU   APCTZ+124                                                01119000
APCTZMBM EQU   APCTZ+128                                                01120000
APCTZMJB EQU   APCTZ+132                                                01121000
APCTZMJC EQU   APCTZ+136                                                01122000
APCTZMJH EQU   APCTZ+140                                                01123000
APCTZMMA EQU   APCTZ+144                                                01124000
APCTZDMD EQU   APCTZ+148                                                01125000
APCTZD81 EQU   APCTZ+152                                                01126000
APCTZDID EQU   APCTZ+156                                                01127000
APCTZDRI EQU   APCTZ+160                                                01128000
APCTZMJI EQU   APCTZ+164                                                01129000
APCTZDWT EQU   APCTZ+168                                                01130000
APCTZDMM EQU   APCTZ+172                                                01131000
APCTZDAL EQU   APCTZ+176                                                01132000
APCTZDBK EQU   APCTZ+180                                                01133000
APCTZDIP EQU   APCTZ+184                                                01134000
APCTZDDA EQU   APCTZ+188                                                01135000
APCTZDUL EQU   APCTZ+192                                                01136000
APCTZDEQ EQU   APCTZ+196                                                01137000
APCTZDDQ EQU   APCTZ+200                                                01138000
APCTZDUA EQU   APCTZ+204                                                01139000
APCTZUAF EQU   APCTZ+208                                                01140000
APCTZUAG EQU   APCTZ+212                                                01141000
APCTZDIO EQU   APCTZ+216                                                01142000
APCTZUHA EQU   APCTZ+220                                                01143000
APCTZUHB EQU   APCTZ+224                                                01144000
APCTZJAA EQU   APCTZ+232                                                01145000
APCTZJAD EQU   APCTZ+236                                                01146000
APCTZJAG EQU   APCTZ+240                                                01147000
APCTZJAJ EQU   APCTZ+244                                                01148000
APCTZJAM EQU   APCTZ+248                                                01149000
APCTZJAP EQU   APCTZ+252                                                01150000
APCTZJAY EQU   APCTZ+256                                                01151000
APCTZUFA EQU   APCTZ+260                                                01152000
APCTZUJA EQU   APCTZ+264                                                01153000
APCTZDAP EQU   APCTZ+268                                                01154000
APCTZKAA EQU   APCTZ+272                                                01155000
APCTZD82 EQU   APCTZ+276                                                01156000
APCTZMIB EQU   APCTZ+280                                                01157000
APCTZMIC EQU   APCTZ+284                                                01158000
APCTZD83 EQU   APCTZ+288                                                01159000
APCTZMIF EQU   APCTZ+296                                                01160000
APCTZJH0 EQU   APCTZ+300                                                01161000
APCTZJI0 EQU   APCTZ+304                                                01162000
APCTZJI3 EQU   APCTZ+308                                                01163000
APCTZJJ0 EQU   APCTZ+312                                                01164000
APCTZJBA EQU   APCTZ+316                                                01165000
APCTZJBD EQU   APCTZ+320                                                01166000
APCTZJBG EQU   APCTZ+324                                                01167000
APCTZJBJ EQU   APCTZ+328                                                01168000
APCTZJBM EQU   APCTZ+332                                                01169000
APCTZKCA EQU   APCTZ+340                                                01170000
APCTZKDA EQU   APCTZ+344                                                01171000
APCTZJDA EQU   APCTZ+356                                                01172000
APCTZJDJ EQU   APCTZ+360                                                01173000
APCTZJH6 EQU   APCTZ+364                                                01174000
APCTZJHO EQU   APCTZ+368                                                01175000
APCTZJHF EQU   APCTZ+372                                                01176000
APCTZJHE EQU   APCTZ+376                                                01177000
APCTZDQR EQU   APCTZ+380                                                01178000
APCTZJHR EQU   APCTZ+384                                                01179000
APCTZJHT EQU   APCTZ+388                                                01180000
APCTZJHW EQU   APCTZ+392                                                01181000
APCTZ1   EQU   APCTZ@@1                                                 01182000
APCTZKBA EQU   APCTZ1                                                   01183000
APCTZKBC EQU   APCTZ1+4                                                 01184000
APCTZKBB EQU   APCTZ1+8                                                 01185000
APCTZJHC EQU   APCTZ1+20                                                01186000
APCTZJHQ EQU   APCTZ1+24                                                01187000
APCTZKBD EQU   APCTZ1+28                                                01188000
APCTZKBE EQU   APCTZ1+40                                                01189000
APCTZUKA EQU   APCTZ1+56                                                01190000
APCTZKBF EQU   APCTZ1+60                                                01191000
APCTZJDD EQU   APCTZ1+64                                                01192000
APCTZJDG EQU   APCTZ1+68                                                01193000
APCTZJDM EQU   APCTZ1+72                                                01194000
APCTZLCA EQU   APCTZ1+76                                                01195000
APCTZLCB EQU   APCTZ1+80                                                01196000
APCTZDWI EQU   APCTZ1+84                                                01197000
APCTZJAX EQU   APCTZ1+88                                                01198000
APCTZKGA EQU   APCTZ1+92                                                01199000
APCTZKGB EQU   APCTZ1+96                                                01200000
APCTZKGC EQU   APCTZ1+100                                               01201000
APCTZKGD EQU   APCTZ1+104                                               01202000
APCTU    EQU   APCTU@@@                                                 01203000
APCT1MAB EQU   APCTU                                                    01204000
APCT1MBD EQU   APCTU+4                                                  01205000
APCT2MBD EQU   APCTU+8                                                  01206000
APCT1CMD EQU   APCTU+12                                                 01207000
APCT1JAA EQU   APCTU+20                                                 01208000
APCT1JHC EQU   APCTU+24                                                 01209000
APCT2JHC EQU   APCTU+28                                                 01210000
APCT1JHT EQU   APCTU+32                                                 01211000
APCT1JHL EQU   APCTU+36                                                 01212000
APCT2JHL EQU   APCTU+40                                                 01213000
APCT1JBJ EQU   APCTU+44                                                 01214000
UCBOBS01 EQU   UCBDEV                                                   01215000
UCBSTAB  EQU   UCBOBS01+10                                              01216000
UCBBSVL  EQU   UCBSTAB                                                  01217000
UCBPRSRS EQU   UCBSTAB                                                  01218000
UCBDMCT  EQU   UCBOBS01+11                                              01219000
UCBFL4   EQU   UCBOBS01+13                                              01220000
UCBOBS02 EQU   UCBDEV                                                   01221000
UCBTFL1  EQU   UCBOBS02+19                                              01222000
UCBXTN   EQU   UCBOBS02+20                                              01223000
UCBVOPT  EQU   UCBXTN                                                   01224000
UCBOBS03 EQU   UCBDEV                                                   01225000
UCBXTADR EQU   UCBOBS03                                                 01226000
UCBOBS04 EQU   UCBDEV                                                   01227000
UCBBTA   EQU   UCBOBS04+12                                              01228000
UCBOBS06 EQU   UCBDEV                                                   01229000
UCBAOF   EQU   UCBOBS06                                                 01230000
UCBAOF1  EQU   UCBAOF                                                   01231000
UCBAOF2  EQU   UCBAOF+1                                                 01232000
@NM00067 EQU   UCBOBS06+3                                               01233000
UCBIRB   EQU   UCBOBS06+4                                               01234000
UCBGRAF  EQU   UCBIRB                                                   01235000
UCBLDNCA EQU   UCBOBS06+8                                               01236000
UCBRDYQ  EQU   UCBLDNCA                                                 01237000
UCBIRLN  EQU   UCBRDYQ                                                  01238000
UCBLDNCB EQU   UCBRDYQ+1                                                01239000
UCBCTLNK EQU   UCBOBS06+12                                              01240000
UCBOBS07 EQU   UCBDEV                                                   01241000
UCBOBS08 EQU   UCBDEV                                                   01242000
UCBCTCAD EQU   UCBOBS08                                                 01243000
UCBCTCF1 EQU   UCBOBS08+4                                               01244000
UCBOBS09 EQU   UCBDEV                                                   01245000
DCBPTR   EQU   APUBDCB                                                  01246000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01247000
UCBRV066 EQU   UCBOBS09+4                                               01248000
UCBIOSBA EQU   UCBOBS09                                                 01249000
UCBRV042 EQU   UCBOBS08+5                                               01250000
UCBRV082 EQU   UCBCTCF1                                                 01251000
UCBRV081 EQU   UCBCTCF1                                                 01252000
UCBRV080 EQU   UCBCTCF1                                                 01253000
UCBRV079 EQU   UCBCTCF1                                                 01254000
UCBRV078 EQU   UCBCTCF1                                                 01255000
UCBRV077 EQU   UCBCTCF1                                                 01256000
UCBRV076 EQU   UCBCTCF1                                                 01257000
UCBCTC80 EQU   UCBCTCF1                                                 01258000
UCBCTCAL EQU   UCBCTCAD                                                 01259000
UCBICNCB EQU   UCBOBS07+4                                               01260000
UCBRV040 EQU   UCBOBS07                                                 01261000
UCBCTLNA EQU   UCBCTLNK+1                                               01262000
UCBRLN   EQU   UCBCTLNK                                                 01263000
UCBRDYQA EQU   UCBLDNCB                                                 01264000
UCBINRLN EQU   UCBIRLN                                                  01265000
UCBIRBA  EQU   UCBIRB+1                                                 01266000
UCBRV039 EQU   UCBGRAF                                                  01267000
UCBDWNR  EQU   UCBGRAF                                                  01268000
UCBRPND  EQU   UCBGRAF                                                  01269000
UCBUPM   EQU   UCBGRAF                                                  01270000
UCBBTAM  EQU   UCBGRAF                                                  01271000
UCBDRNO  EQU   UCBGRAF                                                  01272000
UCBDRO   EQU   UCBGRAF                                                  01273000
UCBOIP   EQU   UCBGRAF                                                  01274000
UCBATRCD EQU   @NM00067                                                 01275000
UCBSKPFG EQU   @NM00067                                                 01276000
UCBRIPND EQU   @NM00067                                                 01277000
UCBRTIAC EQU   @NM00067                                                 01278000
UCBRSV79 EQU   @NM00067                                                 01279000
UCBRSV78 EQU   @NM00067                                                 01280000
UCBRSV77 EQU   @NM00067                                                 01281000
UCBOLTEP EQU   @NM00067                                                 01282000
UCBATNCT EQU   UCBOBS06+2                                               01283000
UCBRSV76 EQU   UCBAOF2                                                  01284000
UCBRSV75 EQU   UCBAOF2                                                  01285000
UCBRSV74 EQU   UCBAOF2                                                  01286000
UCBRSV73 EQU   UCBAOF2                                                  01287000
UCBRSV72 EQU   UCBAOF2                                                  01288000
UCBRSV71 EQU   UCBAOF2                                                  01289000
UCBRSV70 EQU   UCBAOF2                                                  01290000
UCBRSV69 EQU   UCBAOF2                                                  01291000
UCBRSV68 EQU   UCBAOF1                                                  01292000
UCBRSV67 EQU   UCBAOF1                                                  01293000
UCBRSV66 EQU   UCBAOF1                                                  01294000
UCBRSV65 EQU   UCBAOF1                                                  01295000
UCBRSV64 EQU   UCBAOF1                                                  01296000
UCBOFNL  EQU   UCBAOF1                                                  01297000
UCBOFSP  EQU   UCBAOF1                                                  01298000
UCBOFMCR EQU   UCBAOF1                                                  01299000
UCBBTB   EQU   UCBBTA+1                                                 01300000
UCBDI    EQU   UCBBTA                                                   01301000
UCBSNS   EQU   UCBOBS04+8                                               01302000
UCBTEB   EQU   UCBOBS04+4                                               01303000
UCBGCB   EQU   UCBOBS04+3                                               01304000
UCBOPEN  EQU   UCBOBS04+2                                               01305000
UCBSTART EQU   UCBOBS04                                                 01306000
UCBXTNB  EQU   UCBXTN+1                                                 01307000
UCBRSV22 EQU   UCBVOPT                                                  01308000
UCBRSV21 EQU   UCBVOPT                                                  01309000
UCBRSV20 EQU   UCBVOPT                                                  01310000
UCBESVE  EQU   UCBVOPT                                                  01311000
UCBERPC  EQU   UCBVOPT                                                  01312000
UCBESVC  EQU   UCBVOPT                                                  01313000
UCBEVA   EQU   UCBVOPT                                                  01314000
UCBESV   EQU   UCBVOPT                                                  01315000
UCBRV009 EQU   UCBTFL1                                                  01316000
UCBRV008 EQU   UCBTFL1                                                  01317000
UCBRV007 EQU   UCBTFL1                                                  01318000
UCBRV006 EQU   UCBTFL1                                                  01319000
UCBRV005 EQU   UCBTFL1                                                  01320000
UCBDQDSP EQU   UCBTFL1                                                  01321000
UCBNSLTP EQU   UCBTFL1                                                  01322000
UCBNLTP  EQU   UCBTFL1                                                  01323000
UCBRES1B EQU   UCBOBS02+18                                              01324000
UCBFSER  EQU   UCBOBS02+12                                              01325000
@NM00066 EQU   UCBOBS02+4                                               01326000
UCBFSEQ  EQU   UCBOBS02+2                                               01327000
UCBFSCT  EQU   UCBOBS02                                                 01328000
UCBNEXP  EQU   UCBOBS01+20                                              01329000
UCBBASE  EQU   UCBOBS01+16                                              01330000
UCBRES1A EQU   UCBOBS01+15                                              01331000
UCBUSER  EQU   UCBOBS01+14                                              01332000
UCBFL47  EQU   UCBFL4                                                   01333000
UCBMAT   EQU   UCBFL4                                                   01334000
UCBHOLD  EQU   UCBFL4                                                   01335000
UCBATTN  EQU   UCBFL4                                                   01336000
UCBDSS   EQU   UCBFL4                                                   01337000
UCBRESVP EQU   UCBFL4                                                   01338000
UCBWDAV  EQU   UCBFL4                                                   01339000
UCBDAVV  EQU   UCBFL4                                                   01340000
UCBSQC   EQU   UCBOBS01+12                                              01341000
UCBDATP  EQU   UCBOBS01+12                                              01342000
UCBDMC   EQU   UCBDMCT                                                  01343000
UCBMOUNT EQU   UCBDMCT                                                  01344000
UCBBNUL  EQU   UCBSTAB                                                  01345000
UCBSHAR  EQU   UCBSTAB                                                  01346000
UCBBSTR  EQU   UCBSTAB                                                  01347000
UCBBPUB  EQU   UCBSTAB                                                  01348000
UCBBPRV  EQU   UCBSTAB                                                  01349000
UCBBALB  EQU   UCBPRSRS                                                 01350000
UCBPGFL  EQU   UCBSTAB                                                  01351000
UCBDVSHR EQU   UCBBSVL                                                  01352000
UCBVOLI  EQU   UCBOBS01+4                                               01353000
UCBVTOC  EQU   UCBOBS01                                                 01354000
@NM00049 EQU   APCTU+48                                                 01355000
APCT1MBM EQU   APCTU+16                                                 01356000
@NM00048 EQU   APCTZ1+108                                               01357000
@NM00047 EQU   APCTZ1+52                                                01358000
@NM00046 EQU   APCTZ1+48                                                01359000
@NM00045 EQU   APCTZ1+44                                                01360000
@NM00044 EQU   APCTZ1+36                                                01361000
@NM00043 EQU   APCTZ1+32                                                01362000
@NM00042 EQU   APCTZ1+16                                                01363000
@NM00041 EQU   APCTZ1+12                                                01364000
@NM00040 EQU   APCTZ+396                                                01365000
@NM00039 EQU   APCTZ+352                                                01366000
@NM00038 EQU   APCTZ+348                                                01367000
@NM00037 EQU   APCTZ+336                                                01368000
@NM00036 EQU   APCTZ+292                                                01369000
APCTZJFA EQU   APCTZ+228                                                01370000
APCTZMBR EQU   APCTZ+100                                                01371000
@NM00035 EQU   APCTZ+20                                                 01372000
UCBERADR EQU   UCBUCS+12                                                01373000
UCBFCBID EQU   UCBUCS+8                                                 01374000
UCBERCNT EQU   UCBUCS+7                                                 01375000
UCBRSV51 EQU   UCBUCS+6                                                 01376000
UCBRSV50 EQU   UCBFCBOP                                                 01377000
UCBRSV49 EQU   UCBFCBOP                                                 01378000
UCBRSV48 EQU   UCBFCBOP                                                 01379000
UCBRSV47 EQU   UCBFCBOP                                                 01380000
UCBRSV46 EQU   UCBFCBOP                                                 01381000
UCBRSV45 EQU   UCBFCBOP                                                 01382000
UCBRSV44 EQU   UCBFCBOP                                                 01383000
UCBFCBO1 EQU   UCBFCBOP                                                 01384000
UCBUCSPE EQU   UCBUCSOP                                                 01385000
UCBRSV43 EQU   UCBUCSOP                                                 01386000
UCBRSV42 EQU   UCBUCSOP                                                 01387000
UCBRSV41 EQU   UCBUCSOP                                                 01388000
UCBRSV40 EQU   UCBUCSOP                                                 01389000
UCBRSV39 EQU   UCBUCSOP                                                 01390000
UCBUCSO2 EQU   UCBUCSOP                                                 01391000
UCBUCSO1 EQU   UCBUCSOP                                                 01392000
UCBUCSID EQU   UCBUCS                                                   01393000
UCBMDRBA EQU   UCBMDRBF+1                                               01394000
UCBRV075 EQU   UCBMDRBF                                                 01395000
UCBRV074 EQU   UCB3800X+32                                              01396000
UCBIMAGE EQU   UCB3800X+28                                              01397000
UCBFCBNM EQU   UCB3800X+24                                              01398000
UCBCHAR4 EQU   UCB3800X+20                                              01399000
UCBCHAR3 EQU   UCB3800X+16                                              01400000
UCBCHAR2 EQU   UCB3800X+12                                              01401000
UCBCHAR1 EQU   UCB3800X+8                                               01402000
UCBCGMID EQU   UCB3800X+4                                               01403000
UCBBRSTA EQU   UCBACTIV                                                 01404000
UCBRV063 EQU   UCBACTIV                                                 01405000
UCBRV062 EQU   UCBACTIV                                                 01406000
UCBRV061 EQU   UCBACTIV                                                 01407000
UCBRV060 EQU   UCBACTIV                                                 01408000
UCBRV059 EQU   UCBACTIV                                                 01409000
UCBRV058 EQU   UCBACTIV                                                 01410000
UCBRV057 EQU   UCBACTIV                                                 01411000
UCBRV050 EQU   UCB3800X+2                                               01412000
UCBCGMNO EQU   UCB3800X+1                                               01413000
UCBRV083 EQU   UCBOPTNS                                                 01414000
UCBBRSTR EQU   UCBOPTNS                                                 01415000
UCBRV056 EQU   UCBOPTNS                                                 01416000
UCBRV055 EQU   UCBOPTNS                                                 01417000
UCBRV054 EQU   UCBOPTNS                                                 01418000
UCBRV053 EQU   UCBOPTNS                                                 01419000
UCBRV052 EQU   UCBOPTNS                                                 01420000
UCBRV051 EQU   UCBOPTNS                                                 01421000
UCBRV073 EQU   UCB3540X+7                                               01422000
UCBRV072 EQU   UCBDKBYT                                                 01423000
UCBRV071 EQU   UCBDKBYT                                                 01424000
UCBRV070 EQU   UCBDKBYT                                                 01425000
UCBRV069 EQU   UCBDKBYT                                                 01426000
UCBRV068 EQU   UCBDKBYT                                                 01427000
UCBRV067 EQU   UCBDKBYT                                                 01428000
UCBVLVER EQU   UCBDKBYT                                                 01429000
UCBDKAMX EQU   UCBDKBYT                                                 01430000
UCBVLSER EQU   UCB3540X                                                 01431000
UCBRDATA EQU   UCBOCR+4                                                 01432000
UCBFRID  EQU   UCBOCR                                                   01433000
UCBCLN   EQU   UCBMT+14                                                 01434000
UCBERG   EQU   UCBMT+12                                                 01435000
UCBMS    EQU   UCBMT+11                                                 01436000
UCBNB    EQU   UCBMT+10                                                 01437000
UCBPW    EQU   UCBMT+9                                                  01438000
UCBPR    EQU   UCBMT+8                                                  01439000
UCBSIO   EQU   UCBMT+6                                                  01440000
UCBTW    EQU   UCBMT+5                                                  01441000
UCBTR    EQU   UCBMT+4                                                  01442000
UCBTWT   EQU   UCBMT+3                                                  01443000
UCBTRT   EQU   UCBMT+2                                                  01444000
UCBCTD   EQU   UCBMT                                                    01445000
UCBWTOID EQU   UCBCMEXT+17                                              01446000
UCBMIHTI EQU   UCBCMEXT+16                                              01447000
UCBASID  EQU   UCBCMEXT+14                                              01448000
UCBMFCNT EQU   UCBCMEXT+12                                              01449000
UCBPMSK  EQU   UCBCMEXT+10                                              01450000
UCBCCWOF EQU   UCBCMEXT+8                                               01451000
UCBRV041 EQU   UCBCMEXT+6                                               01452000
UCBRV036 EQU   UCBFLP1                                                  01453000
UCBRV035 EQU   UCBFLP1                                                  01454000
UCBERLOG EQU   UCBFLP1                                                  01455000
UCBRV033 EQU   UCBFLP1                                                  01456000
UCBINHIO EQU   UCBFLP1                                                  01457000
UCBNSWAP EQU   UCBFLP1                                                  01458000
UCBSHRUP EQU   UCBFLP1                                                  01459000
UCBNSRCH EQU   UCBFLP1                                                  01460000
UCBSNSCT EQU   UCBCMEXT+4                                               01461000
UCBHPDV  EQU   @NM00068                                                 01462000
UCBHALI  EQU   @NM00068                                                 01463000
UCBRSV09 EQU   @NM00068                                                 01464000
UCBRSV08 EQU   @NM00068                                                 01465000
UCBRSV07 EQU   @NM00068                                                 01466000
UCBRSV06 EQU   @NM00068                                                 01467000
UCBRSV05 EQU   @NM00068                                                 01468000
UCBRSV04 EQU   @NM00068                                                 01469000
UCBDTI   EQU   UCBCMEXT+2                                               01470000
UCBSTI   EQU   UCBCMEXT+1                                               01471000
UCBETI   EQU   UCBCMEXT                                                 01472000
UCBEXTP  EQU   UCBEXTPT+1                                               01473000
UCBDDRSW EQU   UCBFLC                                                   01474000
UCBTICBT EQU   UCBFLC                                                   01475000
UCBIVRR  EQU   UCBFLC                                                   01476000
UCBIVRS  EQU   UCBFLC                                                   01477000
UCBITF   EQU   UCBFLC                                                   01478000
UCBUDE   EQU   UCBFLC                                                   01479000
UCBWAA   EQU   UCBFLC                                                   01480000
UCBATTP  EQU   UCBFLC                                                   01481000
UCBUNTYP EQU   UCBTBYT4                                                 01482000
UCBRSV11 EQU   UCBDVCLS                                                 01483000
UCBRSV10 EQU   UCBDVCLS                                                 01484000
UCB3CHAR EQU   UCBDVCLS                                                 01485000
UCB3UREC EQU   UCBDVCLS                                                 01486000
UCB3DISP EQU   UCBDVCLS                                                 01487000
UCB3DACC EQU   UCBDVCLS                                                 01488000
UCB3COMM EQU   UCBDVCLS                                                 01489000
UCB3TAPE EQU   UCBDVCLS                                                 01490000
UCBDVPWR EQU   UCB2OPT7                                                 01491000
UCBVLPWR EQU   UCB2OPT6                                                 01492000
UCB2OPT5 EQU   UCBTBYT2                                                 01493000
UCBRVDEV EQU   UCBRWTAU                                                 01494000
UCBRPS   EQU   UCBDUDN2                                                 01495000
UCBRR    EQU   UCBDUDN1                                                 01496000
UCB2OPT1 EQU   UCBTBYT2                                                 01497000
UCB2OPT0 EQU   UCBTBYT2                                                 01498000
UCB1FEA7 EQU   UCBTBYT1                                                 01499000
UCBD6250 EQU   UCB1FEA6                                                 01500000
UCBD1600 EQU   UCB1FEA5                                                 01501000
UCB1FEA4 EQU   UCBTBYT1                                                 01502000
UCB1FEA3 EQU   UCBTBYT1                                                 01503000
UCB1FEA2 EQU   UCBTBYT1                                                 01504000
UCB1FEA1 EQU   UCBTBYT1                                                 01505000
UCB1FEA0 EQU   UCBTBYT1                                                 01506000
UCBRV029 EQU   UCBWGT                                                   01507000
UCBVHRSN EQU   UCBWGT                                                   01508000
UCBVORSN EQU   UCBWGT                                                   01509000
UCBMTPXP EQU   UCBWGT                                                   01510000
UCBREW   EQU   UCBWGT                                                   01511000
UCBPUB   EQU   UCBWGT                                                   01512000
UCBOUT   EQU   UCBWGT                                                   01513000
UCBIN    EQU   UCBWGT                                                   01514000
UCBCPU   EQU   UCBOB+11                                                 01515000
UCBLCI   EQU   UCBOB+10                                                 01516000
UCBCNT   EQU   UCBOB+9                                                  01517000
UCBRV017 EQU   UCBCHM1                                                  01518000
UCBRV016 EQU   UCBCHM1                                                  01519000
UCBRV015 EQU   UCBCHM1                                                  01520000
UCBRV014 EQU   UCBCHM1                                                  01521000
UCBSPB   EQU   UCBPTH1                                                  01522000
UCBPPB   EQU   UCBPTH1                                                  01523000
UCBSPA   EQU   UCBPTH0                                                  01524000
UCBPPA   EQU   UCBPTH0                                                  01525000
UCBSIGP  EQU   UCBFLB                                                   01526000
UCBVALPH EQU   UCBFLB                                                   01527000
UCBCRHSN EQU   UCBFLB                                                   01528000
UCBCRHRV EQU   UCBFLB                                                   01529000
UCBRESVH EQU   UCBFLB                                                   01530000
UCBSPST  EQU   UCBFLB                                                   01531000
UCBASNS  EQU   UCBFLB                                                   01532000
UCBIORST EQU   UCBFLB                                                   01533000
UCBACTV  EQU   UCBFL1                                                   01534000
UCBSAP   EQU   UCBFL1                                                   01535000
UCBNOTRC EQU   UCBCUB                                                   01536000
UCBPSNS  EQU   UCBFL1                                                   01537000
UCBUSING EQU   UCBPST                                                   01538000
UCBNOTRD EQU   UCBNRY                                                   01539000
UCBBUSYD EQU   UCBBSY                                                   01540000
UCBUA    EQU   UCBCHAN+1                                                01541000
UCBCHA   EQU   UCBCHAN                                                  01542000
UCBDADI  EQU   UCBSTAT                                                  01543000
UCBSYSR  EQU   UCBSTAT                                                  01544000
UCBPRES  EQU   UCBSTAT                                                  01545000
UCBALOC  EQU   UCBSTAT                                                  01546000
UCBUNLD  EQU   UCBSTAT                                                  01547000
UCBRESV  EQU   UCBSTAT                                                  01548000
UCBCHGS  EQU   UCBSTAT                                                  01549000
UCBONLI  EQU   UCBSTAT                                                  01550000
UCBID    EQU   UCBOB+2                                                  01551000
UCBALTPH EQU   UCBFL5                                                   01552000
UCBALTCU EQU   UCBFL5                                                   01553000
UCBNALOC EQU   UCBFL5                                                   01554000
UCBENVRD EQU   UCBFL5                                                   01555000
UCBVSDR  EQU   UCBFL5                                                   01556000
UCBSASK  EQU   UCBFL5                                                   01557000
UCBAMV   EQU   UCBAF                                                    01558000
UCBDCC   EQU   UCBFL5                                                   01559000
UCBMONT  EQU   UCBJBNR                                                  01560000
UCBRV011 EQU   UCBJBNR                                                  01561000
UCBMMSGP EQU   UCBJBNR                                                  01562000
UCBOLDSM EQU   UCBJBNR                                                  01563000
UCBRV003 EQU   UCBJBNR                                                  01564000
UCBDUC   EQU   UCBJBNR                                                  01565000
UCBJES3  EQU   UCBJBNR                                                  01566000
UCBVRDEV EQU   UCBJBNR                                                  01567000
UCBCMSEG EQU   UCBOB                                                    01568000
UCBPFXND EQU   UCB+512                                                  01569000
UCBIOQ   EQU   UCB+508                                                  01570000
UCBLOCK  EQU   UCB+504                                                  01571000
UCBPXST  EQU   UCB+504                                                  01572000
@NM00065 EQU   UCB                                                      01573000
@NM00064 EQU   APUB+120                                                 01574000
@NM00063 EQU   APUB+112                                                 01575000
APUBJBNM EQU   APUB+104                                                 01576000
APUBSIZE EQU   APUB+102                                                 01577000
APUBRSVD EQU   APUB+100                                                 01578000
APUBASCB EQU   APUBDCB                                                  01579000
@NM00062 EQU   APUBIOFG+4                                               01580000
@NM00061 EQU   APUBIOF3                                                 01581000
@NM00060 EQU   APUBIOF2                                                 01582000
@NM00059 EQU   APUBIOF1                                                 01583000
@NM00058 EQU   APUBIOF0                                                 01584000
APUBICNL EQU   APUBIOF0                                                 01585000
APUBINRG EQU   APUBIOF0                                                 01586000
@NM00057 EQU   APUB+85                                                  01587000
@NM00056 EQU   APUBSTAT                                                 01588000
APUBPDMP EQU   APUBSTAT                                                 01589000
APUBFDMP EQU   APUBSTAT                                                 01590000
@NM00055 EQU   APUBALF3                                                 01591000
APUBSCAL EQU   APUBALF3                                                 01592000
APUBSCAV EQU   APUBALF3                                                 01593000
APUBBIST EQU   APUBALF3                                                 01594000
APUBBTST EQU   APUBALF3                                                 01595000
@NM00054 EQU   APUBALF2                                                 01596000
APUBBIER EQU   APUBALF2                                                 01597000
APUBBOPT EQU   APUBALF2                                                 01598000
APUBBREQ EQU   APUBALF2                                                 01599000
APUBBYT1 EQU   APUBALF2                                                 01600000
@NM00053 EQU   APUBALF1                                                 01601000
@NM00052 EQU   APUBALF0                                                 01602000
APUBOWN  EQU   APUBALF0                                                 01603000
APUBCPU  EQU   APUB+78                                                  01604000
APUBINIT EQU   APUB+76                                                  01605000
APUBERRJ EQU   APUBERRS+20                                              01606000
APUBERRD EQU   APUBERRS+18                                              01607000
APUBERRC EQU   APUBERRS+16                                              01608000
APUBERRB EQU   APUBERRS+14                                              01609000
APUBERRA EQU   APUBERRS+12                                              01610000
APUBERR9 EQU   APUBERRS+10                                              01611000
APUBERR3 EQU   APUBERRS+8                                               01612000
APUBERR2 EQU   APUBERRS+6                                               01613000
APUBERR1 EQU   APUBERRS+4                                               01614000
APUBERR0 EQU   APUBERRS+2                                               01615000
@NM00051 EQU   APUBERRS                                                 01616000
@NM00050 EQU   APUB+50                                                  01617000
APUBRGN  EQU   APUB+48                                                  01618000
APUBMSTP EQU   APUB+40                                                  01619000
APUBUBAP EQU   APUB+36                                                  01620000
APUBAPDS EQU   APUB+32                                                  01621000
APUBAPCT EQU   APUB+20                                                  01622000
APUBUSER EQU   APUB+16                                                  01623000
APUBNXIO EQU   APUB+12                                                  01624000
APUBMSTR EQU   APUB+8                                                   01625000
APUBID   EQU   APUB                                                     01626000
@NM00034 EQU   APCT+1556                                                01627000
APCTSVCT EQU   APCT+1552                                                01628000
APCTDAVT EQU   APCT+1548                                                01629000
APCTLOGL EQU   APCT+1544                                                01630000
@NM00033 EQU   APCT+1540                                                01631000
APCTDMPU EQU   APCT+1536                                                01632000
APCTDMPM EQU   APCT+1532                                                01633000
APCTNDMP EQU   APCT+1530                                                01634000
APCTASID EQU   APCT+1528                                                01635000
APCTLGPG EQU   APCT+1526                                                01636000
APCTLGLN EQU   APCT+1524                                                01637000
APCTAPVU EQU   APCT+1520                                                01638000
APCTABR  EQU   APCT+1116                                                01639000
APCTLOGD EQU   APCT+1108                                                01640000
APCTDCLD EQU   APCT+1104                                                01641000
APCTIOAP EQU   APCT+1100                                                01642000
@NM00032 EQU   APCT+1080                                                01643000
@NM00031 EQU   APCT+1078                                                01644000
APCTKCAX EQU   APCT+1076                                                01645000
APCTABND EQU   APCT+1072                                                01646000
@NM00030 EQU   APCT+1068                                                01647000
APCTAPIO EQU   APCT+1064                                                01648000
APCTCSCT EQU   APCT+1060                                                01649000
APCTSTDF EQU   APCT+1056                                                01650000
APCTSTMX EQU   APCT+1052                                                01651000
APCTRGMX EQU   APCT+1048                                                01652000
APCTSIZE EQU   APCT+1046                                                01653000
APCTCTUB EQU   APCT+1045                                                01654000
APCTMFID EQU   APCT+1044                                                01655000
APCTMFSZ EQU   APCT+1040                                                01656000
APCTCRTN EQU   APCT+1036                                                01657000
APCTAPCP EQU   APCT+1032                                                01658000
APCTAMNA EQU   APCT+1028                                                01659000
APCTEMNA EQU   APCT+1024                                                01660000
@NM00029 EQU   APCT+1012                                                01661000
@NM00028 EQU   APCT+1008                                                01662000
@NM00027 EQU   APCT+1004                                                01663000
APCTEIPL EQU   APCT+1000                                                01664000
@NM00026 EQU   APCT+996                                                 01665000
@NM00025 EQU   APCT+992                                                 01666000
@NM00024 EQU   APCT+988                                                 01667000
@NM00023 EQU   APCT+984                                                 01668000
@NM00022 EQU   APCT+980                                                 01669000
APCTECPW EQU   APCT+976                                                 01670000
APCTECPT EQU   APCT+968                                                 01671000
APCTEALC EQU   APCT+964                                                 01672000
APCTECBL EQU   APCT+960                                                 01673000
APCTECIT EQU   APCT+956                                                 01674000
APCTCQAF EQU   APCTCQAQ                                                 01675000
APCTCQL  EQU   APCTAPCQ+4                                               01676000
APCTCQF  EQU   APCTAPCQ                                                 01677000
APCTCQLK EQU   APCT+940                                                 01678000
@NM00021 EQU   @NM00017+2                                               01679000
@NM00020 EQU   APCTPRSW                                                 01680000
APCTAPST EQU   APCTPRSW                                                 01681000
@NM00019 EQU   APCTPRSW                                                 01682000
@NM00018 EQU   APCTSTAT                                                 01683000
APCTWARM EQU   APCTSTAT                                                 01684000
APCTTERM EQU   APCTSTAT                                                 01685000
APCTHALT EQU   APCTSTAT                                                 01686000
APCTQSCE EQU   APCTSTAT                                                 01687000
APCTSTRT EQU   APCTSTAT                                                 01688000
APCTACT  EQU   APCTSTAT                                                 01689000
APCTVUNX EQU   APCT+935                                                 01690000
APCTSOUT EQU   APCT+934                                                 01691000
APCTDAID EQU   APCT+933                                                 01692000
APCTSV34 EQU   APCT+932                                                 01693000
APCTMJOB EQU   APCT+928                                                 01694000
APCTTCB  EQU   APCT+924                                                 01695000
APCTASCB EQU   APCT+920                                                 01696000
APCTDCNW EQU   APCT+918                                                 01697000
APCTDCNR EQU   APCT+916                                                 01698000
@NM00016 EQU   APCT+912                                                 01699000
@NM00015 EQU   APCT+908                                                 01700000
@NM00014 EQU   APCT+904                                                 01701000
@NM00013 EQU   APCT+900                                                 01702000
@NM00012 EQU   APCTERRS+22                                              01703000
APCTERTJ EQU   APCTERRS+20                                              01704000
APCTERTD EQU   APCTERRS+18                                              01705000
APCTERTC EQU   APCTERRS+16                                              01706000
APCTERTB EQU   APCTERRS+14                                              01707000
APCTERTA EQU   APCTERRS+12                                              01708000
APCTERT9 EQU   APCTERRS+10                                              01709000
APCTERT3 EQU   APCTERRS+8                                               01710000
APCTERT2 EQU   APCTERRS+6                                               01711000
APCTERT1 EQU   APCTERRS+4                                               01712000
APCTERT0 EQU   APCTERRS+2                                               01713000
APCTERTT EQU   APCTERRS                                                 01714000
APCTDSAP EQU   APCT+872                                                 01715000
APCTISUB EQU   APCT+868                                                 01716000
APCTUBAP EQU   APCT+864                                                 01717000
APCTAPDS EQU   APCT+860                                                 01718000
APCTUBIC EQU   APCT+856                                                 01719000
APCTUBIS EQU   APCT+852                                                 01720000
APCTAPUB EQU   APCT+848                                                 01721000
APCTUBLK EQU   APCT+844                                                 01722000
APCTBR1A EQU   APCTBR14+2                                               01723000
@NM00011 EQU   APCTBR14                                                 01724000
APCTSMSZ EQU   APCTSMAD+2                                               01725000
@NM00010 EQU   APCTSMAD+1                                               01726000
@NM00009 EQU   APCTSMAD                                                 01727000
APCTSMIS EQU   APCTSMIN+2                                               01728000
@NM00008 EQU   APCTSMIN+1                                               01729000
APCTSMSP EQU   APCTSMIN                                                 01730000
@NM00007 EQU   APCT+30                                                  01731000
APCTLINE EQU   APCT+28                                                  01732000
APCTLBSZ EQU   APCT+24                                                  01733000
APCTREG  EQU   APCT+20                                                  01734000
@NM00006 EQU   APCTENQM                                                 01735000
APCTSSVT EQU   APCT+8                                                   01736000
APCTUSER EQU   APCT+4                                                   01737000
APCTID   EQU   APCT                                                     01738000
@NM00005 EQU   APCQ+176                                                 01739000
@NM00004 EQU   APCQ+172                                                 01740000
@NM00003 EQU   APCQ+168                                                 01741000
APCQSCID EQU   APCQ+25                                                  01742000
APCQNEMG EQU   APCQSW                                                   01743000
APCQNMSG EQU   APCQSW                                                   01744000
@NM00002 EQU   APCQSW                                                   01745000
APCQPRTY EQU   APCQSW                                                   01746000
APCQCQAP EQU   APCQ+16                                                  01747000
APCQUSER EQU   APCQ+8                                                   01748000
APCQAPCQ EQU   APCQ+4                                                   01749000
APCQID   EQU   APCQ                                                     01750000
APSVWORK EQU   APSV+80                                                  01751000
@NM00001 EQU   APSV+80                                                  01752000
APSVFREE EQU   APSV+76                                                  01753000
APSVAPSM EQU   APSV+72                                                  01754000
APSVRG12 EQU   APSVREGS+56                                              01755000
APSVRG11 EQU   APSVREGS+52                                              01756000
APSVRG10 EQU   APSVREGS+48                                              01757000
APSVRG9  EQU   APSVREGS+44                                              01758000
APSVRG8  EQU   APSVREGS+40                                              01759000
APSVRG7  EQU   APSVREGS+36                                              01760000
APSVRG6  EQU   APSVREGS+32                                              01761000
APSVRG5  EQU   APSVREGS+28                                              01762000
APSVRG4  EQU   APSVREGS+24                                              01763000
APSVRG3  EQU   APSVREGS+20                                              01764000
APSVRG2  EQU   APSVREGS+16                                              01765000
APSVRG1  EQU   APSVREGS+12                                              01766000
APSVRG0  EQU   APSVREGS+8                                               01767000
APSVRG15 EQU   APSVREGS+4                                               01768000
APSVRG14 EQU   APSVREGS                                                 01769000
APSVNEXT EQU   APSV+8                                                   01770000
APSVPREV EQU   APSV+4                                                   01771000
APSVAPSC EQU   APSV                                                     01772000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01773000
@RC00126 EQU   @EL00001                                                 01774000
@RC00130 EQU   @EL00001                                                 01775000
@RC00221 EQU   @EL00002                                                 01776000
@ENDDATA EQU   *                                                        01777000
         END   IGTDIP,(C'PLS0001',0701,77231)                           01778000
