TDDQ     TITLE 'IGTDDQ - CONTROL THE APUBS.                            *00001000
                        '                                               00002000
IGTDDQ   CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(16)                                          01S0001 00007000
         DC    C'IGTDDQ    77.092'                              01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @07,0                                            01S0001 00011000
@PSTART  DS    0H                                               01S0001 00012000
         USING @PSTART,@07                                      01S0001 00013000
         L     @00,@SIZDATD                                     01S0001 00014000
         IGTYGSV  R,LV=(0)                                              00015000
         LR    @06,@01                                          01S0001 00016000
         USING @DATD,@06                                        01S0001 00017000
         ST    @13,@SA00001+4                                   01S0001 00018000
         LM    @00,@01,20(@13)                                  01S0001 00019000
         ST    @06,8(,@13)                                      01S0001 00020000
         LR    @13,@06                                          01S0001 00021000
          MVC DYNDEQ,STATDEQ       MOVE THE PARM LIST TO THE DYN AREA.  00022000
          DEQ (APCTENQM-APCT(,APCTPTR)),MF=(E,DYNDEQ) DEQUEUE ON APUBS  00023000
*   RETURN;                         /* IGTXEPLG                      */ 00024000
@EL00001 L     @13,4(,@13)                                      01S0017 00025000
@EF00001 L     @00,@SIZDATD                                     01S0017 00026000
         LR    @01,@06                                          01S0017 00027000
         IGTYFSV  R,LV=(0),A=(1)                                        00028000
@ER00001 LM    @14,@12,12(@13)                                  01S0017 00029000
         BR    @14                                              01S0017 00030000
*                                                               01S0018 00031000
*   /*****************************************************************/ 00032000
*   /*                                                               */ 00033000
*   /* SYSTEM DECLARES                                               */ 00034000
*   /*                                                               */ 00035000
*   /*****************************************************************/ 00036000
*                                                               01S0018 00037000
*   DECLARE                         /* COMMON VARIABLES              */ 00038000
*     I256C CHAR(256) BASED,                                    01S0018 00039000
*     I031F FIXED(31) BASED,                                    01S0018 00040000
*     I031P PTR(31) BASED,                                      01S0018 00041000
*     I015F FIXED(15) BASED,                                    01S0018 00042000
*     I015P PTR(15) BASED,                                      01S0018 00043000
*     I008P PTR(8) BASED,                                       01S0018 00044000
*     I001C CHAR(1) BASED;                                      01S0018 00045000
*                                                               01S0019 00046000
*   /*****************************************************************/ 00047000
*   /*                                                               */ 00048000
*   /* MODULE PATCH AREA                                             */ 00049000
*   /*                                                               */ 00050000
*   /*****************************************************************/ 00051000
*                                                               01S0019 00052000
*   DCL                                                         01S0019 00053000
*     APPATCH CHAR(*) INT STATIC LOCAL GEND;                    01S0019 00054000
*   GENERATE DATA DEFS(APPATCH);                                01S0020 00055000
*                                                               01S0021 00056000
*   /*****************************************************************/ 00057000
*   /*                                                               */ 00058000
*   /* GENERAL REGISTER DECLARES                                     */ 00059000
*   /*                                                               */ 00060000
*   /*****************************************************************/ 00061000
*                                                               01S0021 00062000
*   DCL                                                         01S0021 00063000
*     R0F FIXED(31) REG(0),                                     01S0021 00064000
*     R0P PTR(24) REG(0),                                       01S0021 00065000
*     R0RSTD PTR(31) REG(0),                                    01S0021 00066000
*     R1F FIXED(31) REG(1),                                     01S0021 00067000
*     R1P PTR(24) REG(1),                                       01S0021 00068000
*     R1RSTD PTR(31) REG(1),                                    01S0021 00069000
*     R2F FIXED(31) REG(2),                                     01S0021 00070000
*     R2P PTR(24) REG(2),                                       01S0021 00071000
*     R2RSTD PTR(31) REG(2),                                    01S0021 00072000
*     R3F FIXED(31) REG(3),                                     01S0021 00073000
*     R3P PTR(24) REG(3),                                       01S0021 00074000
*     R3RSTD PTR(31) REG(3),                                    01S0021 00075000
*     R4F FIXED(31) REG(4),                                     01S0021 00076000
*     R4P PTR(24) REG(4),                                       01S0021 00077000
*     R4RSTD PTR(31) REG(4),                                    01S0021 00078000
*     R5F FIXED(31) REG(5),                                     01S0021 00079000
*     R5P PTR(24) REG(5),                                       01S0021 00080000
*     R5RSTD PTR(31) REG(5),                                    01S0021 00081000
*     R6F FIXED(31) REG(6),                                     01S0021 00082000
*     R6P PTR(24) REG(6),                                       01S0021 00083000
*     R6RSTD PTR(31) REG(6),                                    01S0021 00084000
*     R7F FIXED(31) REG(7),                                     01S0021 00085000
*     R7P PTR(24) REG(7),                                       01S0021 00086000
*     R7RSTD PTR(31) REG(7),                                    01S0021 00087000
*     R8F FIXED(31) REG(8),                                     01S0021 00088000
*     R8P PTR(24) REG(8),                                       01S0021 00089000
*     R8RSTD PTR(31) REG(8),                                    01S0021 00090000
*     R9F FIXED(31) REG(9),                                     01S0021 00091000
*     R9P PTR(24) REG(9),                                       01S0021 00092000
*     R9RSTD PTR(31) REG(9),                                    01S0021 00093000
*     R10F FIXED(31) REG(10),                                   01S0021 00094000
*     R10P PTR(24) REG(10),                                     01S0021 00095000
*     R10RSTD PTR(31) REG(10),                                  01S0021 00096000
*     R11F FIXED(31) REG(11),                                   01S0021 00097000
*     R11P PTR(24) REG(11),                                     01S0021 00098000
*     R11RSTD PTR(31) REG(11),                                  01S0021 00099000
*     R12F FIXED(31) REG(12),                                   01S0021 00100000
*     R12P PTR(24) REG(12),                                     01S0021 00101000
*     R12RSTD PTR(31) REG(12),                                  01S0021 00102000
*     R13F FIXED(31) REG(13),                                   01S0021 00103000
*     R13P PTR(24) REG(13),                                     01S0021 00104000
*     R13RSTD PTR(31) REG(13),                                  01S0021 00105000
*     R14F FIXED(31) REG(14),                                   01S0021 00106000
*     R14P PTR(24) REG(14),                                     01S0021 00107000
*     R14RSTD PTR(31) REG(14),                                  01S0021 00108000
*     R15F FIXED(31) REG(15),                                   01S0021 00109000
*     R15P PTR(24) REG(15),                                     01S0021 00110000
*     R15RSTD PTR(31) REG(15),                                  01S0021 00111000
*                                                               01S0021 00112000
*     /***************************************************************/ 00113000
*     /*                                                             */ 00114000
*     /* VPSS CONTROL BLOCK POINTER DECLARES                         */ 00115000
*     /*                                                             */ 00116000
*     /***************************************************************/ 00117000
*                                                               01S0021 00118000
*     APSMPTR PTR(24) REG(01),      /* STORAGE MANAGEMENT BLOCK 01S0021 00119000
*                                      (SUGGESTED POINTER)           */ 00120000
*     APSCPTR PTR(24) REG(01),      /* STORAGE MANAGEMENT CONTROL       00121000
*                                      WORD (SUGGESTED POINTER)      */ 00122000
*     APINPTR PTR(24) REG(01),      /* USER'S INPUT PARAMETER LIST      00123000
*                                      (SUGGESTED POINTER)           */ 00124000
*/*                                                                  */ 00125000
*                                                               01S0021 00126000
*     APDATA PTR(24) REG(06),       /* ADDRESS OF DYNAMIC DATA  01S0021 00127000
*                                      WORKAREA (DATAREG)            */ 00128000
*     APCODE PTR(24) REG(07),       /* PROGRAM CODE BASE REGISTER       00129000
*                                      (CODEREG)                     */ 00130000
*     APDEBPTR PTR(24) REG(08),     /* VPSS DEB (SUGGESTED POINTER)  */ 00131000
*     APNPPTR PTR(24) REG(08),      /* SUBSYSTEM INITIALIZATION 01S0021 00132000
*                                      WORKAREA BLOCK (ONLY USED BY     00133000
*                                      SUBSYSTEM INITIALIZATION)     */ 00134000
*     APRLPTR PTR(24) REG(08),      /* VPSS ACB REQUEST LIST    01S0021 00135000
*                                      (SUGGESTED POINTER)           */ 00136000
*     APCIPTR PTR(24) REG(08),      /* 3838 CONTROL TABLE (SUGGESTED    00137000
*                                      POINTER)                      */ 00138000
*     APCWPTR PTR(24) REG(08),      /* CALL INTERFACE WORKAREA  01S0021 00139000
*                                      (SUGGESTED POINTER)           */ 00140000
*     APERPTR PTR(24) REG(08),      /* ERP/IO APPENDAGE WORKAREA        00141000
*                                      (SUGGESTED POINTER)           */ 00142000
*     APACBPTR PTR(24) REG(09),     /* VPSS ACB (SUGGESTED POINTER)  */ 00143000
*     APCQPTR PTR(24) REG(09),      /* COMMAND QUEUE ELEMENT    01S0021 00144000
*                                      (SUGGESTED POINTER)           */ 00145000
*     APOTPTR PTR(24) REG(09),      /* OPTION TABLE (SUGGESTED  01S0021 00146000
*                                      POINTER)                      */ 00147000
*     APIOPTR PTR(24) REG(10),      /* I/O ELEMENT (SUGGESTED   01S0021 00148000
*                                      POINTER)                      */ 00149000
*     APEXLPTR PTR(24) REG(10),     /* VPSS EXLST (SUGGESTED POINTER)*/ 00150000
*     APUBPTR PTR(24) REG(10),      /* UNIT BLOCK (SUGGESTED POINTER)*/ 00151000
*     APAXPTR PTR(24) REG(10),      /* VPSS ACB EXTENSION (SUGGESTED    00152000
*                                      POINTER)                      */ 00153000
*     APCPPTR PTR(24) REG(10),      /* VPSS CALL PROCESSING     01S0021 00154000
*                                      INDICATORS (SUGGESTED POINTER)*/ 00155000
*     APOCPTR PTR(24) REG(10),      /* VPSS OPEN/CLOSE SUBSYSTEM        00156000
*                                      WORKAREA (REQUIRED POINTER)   */ 00157000
*     APATPTR PTR(24) REG(11),      /* VPSS ACB TABLE (SUGGESTED        00158000
*                                      POINTER)                      */ 00159000
*     APLBPTR PTR(24) REG(11),      /* LABEL RESOLUTION TABLE   01S0021 00160000
*                                      (SUGGESTED POINTER)           */ 00161000
*     APUTPTR PTR(24) REG(11),      /* USER TABLE (SUGGESTED POINTER)*/ 00162000
*     APDSPTR PTR(24) REG(11),      /* VPSS DATASET ENTRY (SUGGESTED    00163000
*                                      POINTER)                      */ 00164000
*     APXLPTR PTR(24) REG(11),      /* TRANSLATION TABLE (SUGGESTED     00165000
*                                      POINTER)                      */ 00166000
*     APDXPTR PTR(24) REG(11),      /* VPSS DEB EXTENSION (SUGGESTED    00167000
*                                      POINTER)                      */ 00168000
*     APCTPTR PTR(24) REG(12) RSTD, /* CONTROL TABLE (REQUIRED  01S0021 00169000
*                                      POINTER)                      */ 00170000
*     APSVPTR PTR(24) REG(13) RSTD, /* OS/VPSS SAVEAREA/WORKAREA        00171000
*                                      (REQUIRED POINTER)            */ 00172000
*     APRETURN PTR(24) REG(14),     /* RETURN ADDRESS FOR SUBROUTINE    00173000
*                                      LINKAGE                       */ 00174000
*     APENTRY PTR(24) REG(15),      /* SUBROUTINE ENTRY POINT LINKAGE*/ 00175000
*     APRCODE PTR(24) REG(15);      /* CONTAINS SUBROUTINE RETURN       00176000
*                                      CODE                          */ 00177000
*                                                               01S0022 00178000
*   /*****************************************************************/ 00179000
*   /*                                                               */ 00180000
*   /* USER REGISTER DECLARES                                        */ 00181000
*   /*                                                               */ 00182000
*   /*****************************************************************/ 00183000
*                                                               01S0022 00184000
*   END                                                         01S0022 00185000
*                                                               01S0022 00186000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00187000
*/*%INCLUDE SYSLIB  (IGTXAPCT)                                       */ 00188000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00189000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00190000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00191000
*/*%INCLUDE SYSLIB  (IGTXAPSV)                                       */ 00192000
*/*%INCLUDE SYSLIB  (IGTXAPCV)                                       */ 00193000
*                                                               01S0022 00194000
*       ;                                                       01S0022 00195000
         B     @EL00001                                         01S0022 00196000
@DATA    DS    0H                                                       00197000
@DATD    DSECT                                                          00198000
         DS    0F                                                       00199000
@SA00001 DS    20F                                                      00200000
IGTDDQ   CSECT                                                          00201000
         DS    0F                                                       00202000
@DATD    DSECT                                                          00203000
         DS    0D                                                       00204000
IGTDDQ   CSECT                                                          00205000
         DS    0F                                                       00206000
@SIZDATD DC    AL1(0)                                                   00207000
         DC    AL3(@ENDDATD-@DATD)                                      00208000
         DS    0D                                                       00209000
APUB     DC    CL4'APUB'                                                00210000
IGTDDQ   CSECT                                                          00211000
STATDEQ DEQ (,APUB,4,SYSTEM),MF=L                                    */ 00212000
@DATD    DSECT                                                          00213000
DYNDEQX DEQ (,),MF=L                                                    00214000
DYNDEQ  EQU DYNDEQX,*-DYNDEQX,C'C'                                      00215000
IGTDDQ   CSECT                                                          00216000
*                                   /* GENERATE PATCH                   00217000
         IGTXZAP ,                 GENERATE PATCH AREA                  00218000
@DATD    DSECT                                                          00219000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00220000
@ENDDATD EQU   *                                                        00221000
IGTDDQ   CSECT                                                          00222000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00223000
@01      EQU   01                                                       00224000
@02      EQU   02                                                       00225000
@03      EQU   03                                                       00226000
@04      EQU   04                                                       00227000
@05      EQU   05                                                       00228000
@06      EQU   06                                                       00229000
@07      EQU   07                                                       00230000
@08      EQU   08                                                       00231000
@09      EQU   09                                                       00232000
@10      EQU   10                                                       00233000
@11      EQU   11                                                       00234000
@12      EQU   12                                                       00235000
@13      EQU   13                                                       00236000
@14      EQU   14                                                       00237000
@15      EQU   15                                                       00238000
APDATA   EQU   @06                                                      00239000
APCODE   EQU   @07                                                      00240000
APCTPTR  EQU   @12                                                      00241000
APSVPTR  EQU   @13                                                      00242000
APACBPTR EQU   @09                                                      00243000
APATPTR  EQU   @11                                                      00244000
APAXPTR  EQU   @10                                                      00245000
APCIPTR  EQU   @08                                                      00246000
APCPPTR  EQU   @10                                                      00247000
APCQPTR  EQU   @09                                                      00248000
APCWPTR  EQU   @08                                                      00249000
APDEBPTR EQU   @08                                                      00250000
APDSPTR  EQU   @11                                                      00251000
APDXPTR  EQU   @11                                                      00252000
APENTRY  EQU   @15                                                      00253000
APERPTR  EQU   @08                                                      00254000
APEXLPTR EQU   @10                                                      00255000
APINPTR  EQU   @01                                                      00256000
APIOPTR  EQU   @10                                                      00257000
APLBPTR  EQU   @11                                                      00258000
APNPPTR  EQU   @08                                                      00259000
APOCPTR  EQU   @10                                                      00260000
APOTPTR  EQU   @09                                                      00261000
APRCODE  EQU   @15                                                      00262000
APRETURN EQU   @14                                                      00263000
APRLPTR  EQU   @08                                                      00264000
APSCPTR  EQU   @01                                                      00265000
APSMPTR  EQU   @01                                                      00266000
APUBPTR  EQU   @10                                                      00267000
APUTPTR  EQU   @11                                                      00268000
APXLPTR  EQU   @11                                                      00269000
R0F      EQU   @00                                                      00270000
R0P      EQU   @00                                                      00271000
R0RSTD   EQU   @00                                                      00272000
R1F      EQU   @01                                                      00273000
R1P      EQU   @01                                                      00274000
R1RSTD   EQU   @01                                                      00275000
R10F     EQU   @10                                                      00276000
R10P     EQU   @10                                                      00277000
R10RSTD  EQU   @10                                                      00278000
R11F     EQU   @11                                                      00279000
R11P     EQU   @11                                                      00280000
R11RSTD  EQU   @11                                                      00281000
R12F     EQU   @12                                                      00282000
R12P     EQU   @12                                                      00283000
R12RSTD  EQU   @12                                                      00284000
R13F     EQU   @13                                                      00285000
R13P     EQU   @13                                                      00286000
R13RSTD  EQU   @13                                                      00287000
R14F     EQU   @14                                                      00288000
R14P     EQU   @14                                                      00289000
R14RSTD  EQU   @14                                                      00290000
R15F     EQU   @15                                                      00291000
R15P     EQU   @15                                                      00292000
R15RSTD  EQU   @15                                                      00293000
R2F      EQU   @02                                                      00294000
R2P      EQU   @02                                                      00295000
R2RSTD   EQU   @02                                                      00296000
R3F      EQU   @03                                                      00297000
R3P      EQU   @03                                                      00298000
R3RSTD   EQU   @03                                                      00299000
R4F      EQU   @04                                                      00300000
R4P      EQU   @04                                                      00301000
R4RSTD   EQU   @04                                                      00302000
R5F      EQU   @05                                                      00303000
R5P      EQU   @05                                                      00304000
R5RSTD   EQU   @05                                                      00305000
R6F      EQU   @06                                                      00306000
R6P      EQU   @06                                                      00307000
R6RSTD   EQU   @06                                                      00308000
R7F      EQU   @07                                                      00309000
R7P      EQU   @07                                                      00310000
R7RSTD   EQU   @07                                                      00311000
R8F      EQU   @08                                                      00312000
R8P      EQU   @08                                                      00313000
R8RSTD   EQU   @08                                                      00314000
R9F      EQU   @09                                                      00315000
R9P      EQU   @09                                                      00316000
R9RSTD   EQU   @09                                                      00317000
APCT     EQU   0                                                        00318000
APCTENQM EQU   APCT+12                                                  00319000
APCTSMIN EQU   APCT+32                                                  00320000
APCTSMAD EQU   APCT+36                                                  00321000
APCTZ@@@ EQU   APCT+40                                                  00322000
APCTU@@@ EQU   APCT+440                                                 00323000
APCTBR14 EQU   APCT+840                                                 00324000
APCTERRS EQU   APCT+876                                                 00325000
@NM00013 EQU   APCT+936                                                 00326000
APCTSTAT EQU   @NM00013                                                 00327000
APCTPRSW EQU   @NM00013+1                                               00328000
APCTAPCQ EQU   APCT+944                                                 00329000
APCTCQAQ EQU   APCT+952                                                 00330000
APCTZ@@1 EQU   APCT+1120                                                00331000
APSV     EQU   0                                                        00332000
APSVREGS EQU   APSV+12                                                  00333000
APCVZDAL EQU   0                                                        00334000
APCVZDAP EQU   0                                                        00335000
APCVZDBK EQU   0                                                        00336000
APCVZDDA EQU   0                                                        00337000
APCVZDDQ EQU   0                                                        00338000
APCVZDEQ EQU   0                                                        00339000
APCVZDID EQU   0                                                        00340000
APCVZDIO EQU   0                                                        00341000
APCVZDIP EQU   0                                                        00342000
APCVZDMD EQU   0                                                        00343000
APCVZDMM EQU   0                                                        00344000
APCVZDQR EQU   0                                                        00345000
APCVZDRI EQU   0                                                        00346000
APCVZDUA EQU   0                                                        00347000
APCVZDUL EQU   0                                                        00348000
APCVZDWI EQU   0                                                        00349000
APCVZDWT EQU   0                                                        00350000
APCVZDX1 EQU   0                                                        00351000
APCVZDX2 EQU   0                                                        00352000
APCVZDX3 EQU   0                                                        00353000
APCVZDX4 EQU   0                                                        00354000
APCVZD10 EQU   0                                                        00355000
APCVZD20 EQU   0                                                        00356000
APCVZD4E EQU   0                                                        00357000
APCVZD40 EQU   0                                                        00358000
APCVZD41 EQU   0                                                        00359000
APCVZD42 EQU   0                                                        00360000
APCVZD43 EQU   0                                                        00361000
APCVZD44 EQU   0                                                        00362000
APCVZD45 EQU   0                                                        00363000
APCVZD46 EQU   0                                                        00364000
APCVZD47 EQU   0                                                        00365000
APCVZD48 EQU   0                                                        00366000
APCVZD49 EQU   0                                                        00367000
APCVZD60 EQU   0                                                        00368000
APCVZD80 EQU   0                                                        00369000
APCVZD81 EQU   0                                                        00370000
APCVZD82 EQU   0                                                        00371000
APCVZD83 EQU   0                                                        00372000
APCVZJAA EQU   0                                                        00373000
APCVZJAD EQU   0                                                        00374000
APCVZJAG EQU   0                                                        00375000
APCVZJAJ EQU   0                                                        00376000
APCVZJAM EQU   0                                                        00377000
APCVZJAP EQU   0                                                        00378000
APCVZJAX EQU   0                                                        00379000
APCVZJAY EQU   0                                                        00380000
APCVZJBA EQU   0                                                        00381000
APCVZJBD EQU   0                                                        00382000
APCVZJBG EQU   0                                                        00383000
APCVZJBJ EQU   0                                                        00384000
APCVZJBM EQU   0                                                        00385000
APCVZJDA EQU   0                                                        00386000
APCVZJDD EQU   0                                                        00387000
APCVZJDG EQU   0                                                        00388000
APCVZJDJ EQU   0                                                        00389000
APCVZJDM EQU   0                                                        00390000
APCVZJHC EQU   0                                                        00391000
APCVZJHE EQU   0                                                        00392000
APCVZJHF EQU   0                                                        00393000
APCVZJHO EQU   0                                                        00394000
APCVZJHQ EQU   0                                                        00395000
APCVZJHR EQU   0                                                        00396000
APCVZJHT EQU   0                                                        00397000
APCVZJHW EQU   0                                                        00398000
APCVZJH0 EQU   0                                                        00399000
APCVZJH6 EQU   0                                                        00400000
APCVZJI0 EQU   0                                                        00401000
APCVZJI3 EQU   0                                                        00402000
APCVZJJ0 EQU   0                                                        00403000
APCVZKAA EQU   0                                                        00404000
APCVZKBA EQU   0                                                        00405000
APCVZKBB EQU   0                                                        00406000
APCVZKBC EQU   0                                                        00407000
APCVZKBD EQU   0                                                        00408000
APCVZKBE EQU   0                                                        00409000
APCVZKBF EQU   0                                                        00410000
APCVZKCA EQU   0                                                        00411000
APCVZKDA EQU   0                                                        00412000
APCVZKGA EQU   0                                                        00413000
APCVZKGB EQU   0                                                        00414000
APCVZKGC EQU   0                                                        00415000
APCVZKGD EQU   0                                                        00416000
APCVZLCA EQU   0                                                        00417000
APCVZLCB EQU   0                                                        00418000
APCVZMBA EQU   0                                                        00419000
APCVZMBD EQU   0                                                        00420000
APCVZMBG EQU   0                                                        00421000
APCVZMBH EQU   0                                                        00422000
APCVZMBK EQU   0                                                        00423000
APCVZMBM EQU   0                                                        00424000
APCVZMIB EQU   0                                                        00425000
APCVZMIC EQU   0                                                        00426000
APCVZMIF EQU   0                                                        00427000
APCVZMJB EQU   0                                                        00428000
APCVZMJC EQU   0                                                        00429000
APCVZMJH EQU   0                                                        00430000
APCVZMJI EQU   0                                                        00431000
APCVZMMA EQU   0                                                        00432000
APCVZUAA EQU   0                                                        00433000
APCVZUAB EQU   0                                                        00434000
APCVZUAC EQU   0                                                        00435000
APCVZUAD EQU   0                                                        00436000
APCVZUAE EQU   0                                                        00437000
APCVZUAF EQU   0                                                        00438000
APCVZUAG EQU   0                                                        00439000
APCVZUBB EQU   0                                                        00440000
APCVZUFA EQU   0                                                        00441000
APCVZUHA EQU   0                                                        00442000
APCVZUHB EQU   0                                                        00443000
APCVZUJA EQU   0                                                        00444000
APCVZUKA EQU   0                                                        00445000
APCV1CMD EQU   0                                                        00446000
APCV1JAA EQU   0                                                        00447000
APCV1JBJ EQU   0                                                        00448000
APCV1JHC EQU   0                                                        00449000
APCV1JHL EQU   0                                                        00450000
APCV1JHT EQU   0                                                        00451000
APCV1MAB EQU   0                                                        00452000
APCV1MBD EQU   0                                                        00453000
APCV2JHC EQU   0                                                        00454000
APCV2JHL EQU   0                                                        00455000
APCV2MBD EQU   0                                                        00456000
I001C    EQU   0                                                        00457000
I008P    EQU   0                                                        00458000
I015F    EQU   0                                                        00459000
I015P    EQU   0                                                        00460000
I031F    EQU   0                                                        00461000
I031P    EQU   0                                                        00462000
I256C    EQU   0                                                        00463000
APCTZ    EQU   APCTZ@@@                                                 00464000
APCTZUAA EQU   APCTZ                                                    00465000
APCTZUAB EQU   APCTZ+4                                                  00466000
APCTZUAC EQU   APCTZ+8                                                  00467000
APCTZUAD EQU   APCTZ+12                                                 00468000
APCTZUAE EQU   APCTZ+16                                                 00469000
APCTZUBB EQU   APCTZ+24                                                 00470000
APCTZD10 EQU   APCTZ+28                                                 00471000
APCTZD20 EQU   APCTZ+32                                                 00472000
APCTZD40 EQU   APCTZ+36                                                 00473000
APCTZD41 EQU   APCTZ+40                                                 00474000
APCTZD42 EQU   APCTZ+44                                                 00475000
APCTZD43 EQU   APCTZ+48                                                 00476000
APCTZD44 EQU   APCTZ+52                                                 00477000
APCTZD45 EQU   APCTZ+56                                                 00478000
APCTZD46 EQU   APCTZ+60                                                 00479000
APCTZD47 EQU   APCTZ+64                                                 00480000
APCTZD48 EQU   APCTZ+68                                                 00481000
APCTZD49 EQU   APCTZ+72                                                 00482000
APCTZD60 EQU   APCTZ+76                                                 00483000
APCTZD80 EQU   APCTZ+80                                                 00484000
APCTZD4E EQU   APCTZ+84                                                 00485000
APCTZMBA EQU   APCTZ+88                                                 00486000
APCTZMBD EQU   APCTZ+92                                                 00487000
APCTZMBG EQU   APCTZ+96                                                 00488000
APCTZDX1 EQU   APCTZ+104                                                00489000
APCTZDX2 EQU   APCTZ+108                                                00490000
APCTZDX3 EQU   APCTZ+112                                                00491000
APCTZDX4 EQU   APCTZ+116                                                00492000
APCTZMBH EQU   APCTZ+120                                                00493000
APCTZMBK EQU   APCTZ+124                                                00494000
APCTZMBM EQU   APCTZ+128                                                00495000
APCTZMJB EQU   APCTZ+132                                                00496000
APCTZMJC EQU   APCTZ+136                                                00497000
APCTZMJH EQU   APCTZ+140                                                00498000
APCTZMMA EQU   APCTZ+144                                                00499000
APCTZDMD EQU   APCTZ+148                                                00500000
APCTZD81 EQU   APCTZ+152                                                00501000
APCTZDID EQU   APCTZ+156                                                00502000
APCTZDRI EQU   APCTZ+160                                                00503000
APCTZMJI EQU   APCTZ+164                                                00504000
APCTZDWT EQU   APCTZ+168                                                00505000
APCTZDMM EQU   APCTZ+172                                                00506000
APCTZDAL EQU   APCTZ+176                                                00507000
APCTZDBK EQU   APCTZ+180                                                00508000
APCTZDIP EQU   APCTZ+184                                                00509000
APCTZDDA EQU   APCTZ+188                                                00510000
APCTZDUL EQU   APCTZ+192                                                00511000
APCTZDEQ EQU   APCTZ+196                                                00512000
APCTZDDQ EQU   APCTZ+200                                                00513000
APCTZDUA EQU   APCTZ+204                                                00514000
APCTZUAF EQU   APCTZ+208                                                00515000
APCTZUAG EQU   APCTZ+212                                                00516000
APCTZDIO EQU   APCTZ+216                                                00517000
APCTZUHA EQU   APCTZ+220                                                00518000
APCTZUHB EQU   APCTZ+224                                                00519000
APCTZJAA EQU   APCTZ+232                                                00520000
APCTZJAD EQU   APCTZ+236                                                00521000
APCTZJAG EQU   APCTZ+240                                                00522000
APCTZJAJ EQU   APCTZ+244                                                00523000
APCTZJAM EQU   APCTZ+248                                                00524000
APCTZJAP EQU   APCTZ+252                                                00525000
APCTZJAY EQU   APCTZ+256                                                00526000
APCTZUFA EQU   APCTZ+260                                                00527000
APCTZUJA EQU   APCTZ+264                                                00528000
APCTZDAP EQU   APCTZ+268                                                00529000
APCTZKAA EQU   APCTZ+272                                                00530000
APCTZD82 EQU   APCTZ+276                                                00531000
APCTZMIB EQU   APCTZ+280                                                00532000
APCTZMIC EQU   APCTZ+284                                                00533000
APCTZD83 EQU   APCTZ+288                                                00534000
APCTZMIF EQU   APCTZ+296                                                00535000
APCTZJH0 EQU   APCTZ+300                                                00536000
APCTZJI0 EQU   APCTZ+304                                                00537000
APCTZJI3 EQU   APCTZ+308                                                00538000
APCTZJJ0 EQU   APCTZ+312                                                00539000
APCTZJBA EQU   APCTZ+316                                                00540000
APCTZJBD EQU   APCTZ+320                                                00541000
APCTZJBG EQU   APCTZ+324                                                00542000
APCTZJBJ EQU   APCTZ+328                                                00543000
APCTZJBM EQU   APCTZ+332                                                00544000
APCTZKCA EQU   APCTZ+340                                                00545000
APCTZKDA EQU   APCTZ+344                                                00546000
APCTZJDA EQU   APCTZ+356                                                00547000
APCTZJDJ EQU   APCTZ+360                                                00548000
APCTZJH6 EQU   APCTZ+364                                                00549000
APCTZJHO EQU   APCTZ+368                                                00550000
APCTZJHF EQU   APCTZ+372                                                00551000
APCTZJHE EQU   APCTZ+376                                                00552000
APCTZDQR EQU   APCTZ+380                                                00553000
APCTZJHR EQU   APCTZ+384                                                00554000
APCTZJHT EQU   APCTZ+388                                                00555000
APCTZJHW EQU   APCTZ+392                                                00556000
APCTZ1   EQU   APCTZ@@1                                                 00557000
APCTZKBA EQU   APCTZ1                                                   00558000
APCTZKBC EQU   APCTZ1+4                                                 00559000
APCTZKBB EQU   APCTZ1+8                                                 00560000
APCTZJHC EQU   APCTZ1+20                                                00561000
APCTZJHQ EQU   APCTZ1+24                                                00562000
APCTZKBD EQU   APCTZ1+28                                                00563000
APCTZKBE EQU   APCTZ1+40                                                00564000
APCTZUKA EQU   APCTZ1+56                                                00565000
APCTZKBF EQU   APCTZ1+60                                                00566000
APCTZJDD EQU   APCTZ1+64                                                00567000
APCTZJDG EQU   APCTZ1+68                                                00568000
APCTZJDM EQU   APCTZ1+72                                                00569000
APCTZLCA EQU   APCTZ1+76                                                00570000
APCTZLCB EQU   APCTZ1+80                                                00571000
APCTZDWI EQU   APCTZ1+84                                                00572000
APCTZJAX EQU   APCTZ1+88                                                00573000
APCTZKGA EQU   APCTZ1+92                                                00574000
APCTZKGB EQU   APCTZ1+96                                                00575000
APCTZKGC EQU   APCTZ1+100                                               00576000
APCTZKGD EQU   APCTZ1+104                                               00577000
APCTU    EQU   APCTU@@@                                                 00578000
APCT1MAB EQU   APCTU                                                    00579000
APCT1MBD EQU   APCTU+4                                                  00580000
APCT2MBD EQU   APCTU+8                                                  00581000
APCT1CMD EQU   APCTU+12                                                 00582000
APCT1JAA EQU   APCTU+20                                                 00583000
APCT1JHC EQU   APCTU+24                                                 00584000
APCT2JHC EQU   APCTU+28                                                 00585000
APCT1JHT EQU   APCTU+32                                                 00586000
APCT1JHL EQU   APCTU+36                                                 00587000
APCT2JHL EQU   APCTU+40                                                 00588000
APCT1JBJ EQU   APCTU+44                                                 00589000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00590000
@NM00045 EQU   APCTU+48                                                 00591000
APCT1MBM EQU   APCTU+16                                                 00592000
@NM00044 EQU   APCTZ1+108                                               00593000
@NM00043 EQU   APCTZ1+52                                                00594000
@NM00042 EQU   APCTZ1+48                                                00595000
@NM00041 EQU   APCTZ1+44                                                00596000
@NM00040 EQU   APCTZ1+36                                                00597000
@NM00039 EQU   APCTZ1+32                                                00598000
@NM00038 EQU   APCTZ1+16                                                00599000
@NM00037 EQU   APCTZ1+12                                                00600000
@NM00036 EQU   APCTZ+396                                                00601000
@NM00035 EQU   APCTZ+352                                                00602000
@NM00034 EQU   APCTZ+348                                                00603000
@NM00033 EQU   APCTZ+336                                                00604000
@NM00032 EQU   APCTZ+292                                                00605000
APCTZJFA EQU   APCTZ+228                                                00606000
APCTZMBR EQU   APCTZ+100                                                00607000
@NM00031 EQU   APCTZ+20                                                 00608000
APSVWORK EQU   APSV+80                                                  00609000
@NM00046 EQU   APSV+80                                                  00610000
APSVFREE EQU   APSV+76                                                  00611000
APSVAPSM EQU   APSV+72                                                  00612000
APSVRG12 EQU   APSVREGS+56                                              00613000
APSVRG11 EQU   APSVREGS+52                                              00614000
APSVRG10 EQU   APSVREGS+48                                              00615000
APSVRG9  EQU   APSVREGS+44                                              00616000
APSVRG8  EQU   APSVREGS+40                                              00617000
APSVRG7  EQU   APSVREGS+36                                              00618000
APSVRG6  EQU   APSVREGS+32                                              00619000
APSVRG5  EQU   APSVREGS+28                                              00620000
APSVRG4  EQU   APSVREGS+24                                              00621000
APSVRG3  EQU   APSVREGS+20                                              00622000
APSVRG2  EQU   APSVREGS+16                                              00623000
APSVRG1  EQU   APSVREGS+12                                              00624000
APSVRG0  EQU   APSVREGS+8                                               00625000
APSVRG15 EQU   APSVREGS+4                                               00626000
APSVRG14 EQU   APSVREGS                                                 00627000
APSVNEXT EQU   APSV+8                                                   00628000
APSVPREV EQU   APSV+4                                                   00629000
APSVAPSC EQU   APSV                                                     00630000
@NM00030 EQU   APCT+1556                                                00631000
APCTSVCT EQU   APCT+1552                                                00632000
APCTDAVT EQU   APCT+1548                                                00633000
APCTLOGL EQU   APCT+1544                                                00634000
@NM00029 EQU   APCT+1540                                                00635000
APCTDMPU EQU   APCT+1536                                                00636000
APCTDMPM EQU   APCT+1532                                                00637000
APCTNDMP EQU   APCT+1530                                                00638000
APCTASID EQU   APCT+1528                                                00639000
APCTLGPG EQU   APCT+1526                                                00640000
APCTLGLN EQU   APCT+1524                                                00641000
APCTAPVU EQU   APCT+1520                                                00642000
APCTABR  EQU   APCT+1116                                                00643000
APCTACTR EQU   APCT+1112                                                00644000
APCTLOGD EQU   APCT+1108                                                00645000
APCTDCLD EQU   APCT+1104                                                00646000
APCTIOAP EQU   APCT+1100                                                00647000
@NM00028 EQU   APCT+1080                                                00648000
@NM00027 EQU   APCT+1078                                                00649000
APCTKCAX EQU   APCT+1076                                                00650000
APCTABND EQU   APCT+1072                                                00651000
@NM00026 EQU   APCT+1068                                                00652000
APCTAPIO EQU   APCT+1064                                                00653000
APCTCSCT EQU   APCT+1060                                                00654000
APCTSTDF EQU   APCT+1056                                                00655000
APCTSTMX EQU   APCT+1052                                                00656000
APCTRGMX EQU   APCT+1048                                                00657000
APCTSIZE EQU   APCT+1046                                                00658000
APCTCTUB EQU   APCT+1045                                                00659000
APCTMFID EQU   APCT+1044                                                00660000
APCTMFSZ EQU   APCT+1040                                                00661000
APCTCRTN EQU   APCT+1036                                                00662000
APCTAPCP EQU   APCT+1032                                                00663000
APCTAMNA EQU   APCT+1028                                                00664000
APCTEMNA EQU   APCT+1024                                                00665000
APCTAALP EQU   APCT+1020                                                00666000
APCTEALP EQU   APCT+1016                                                00667000
@NM00025 EQU   APCT+1012                                                00668000
@NM00024 EQU   APCT+1008                                                00669000
@NM00023 EQU   APCT+1004                                                00670000
APCTEIPL EQU   APCT+1000                                                00671000
@NM00022 EQU   APCT+996                                                 00672000
@NM00021 EQU   APCT+992                                                 00673000
@NM00020 EQU   APCT+988                                                 00674000
@NM00019 EQU   APCT+984                                                 00675000
@NM00018 EQU   APCT+980                                                 00676000
APCTECPW EQU   APCT+976                                                 00677000
APCTEULD EQU   APCT+972                                                 00678000
APCTECPT EQU   APCT+968                                                 00679000
APCTEALC EQU   APCT+964                                                 00680000
APCTECBL EQU   APCT+960                                                 00681000
APCTECIT EQU   APCT+956                                                 00682000
APCTCQAF EQU   APCTCQAQ                                                 00683000
APCTCQL  EQU   APCTAPCQ+4                                               00684000
APCTCQF  EQU   APCTAPCQ                                                 00685000
APCTCQLK EQU   APCT+940                                                 00686000
@NM00017 EQU   @NM00013+2                                               00687000
@NM00016 EQU   APCTPRSW                                                 00688000
APCTAPST EQU   APCTPRSW                                                 00689000
@NM00015 EQU   APCTPRSW                                                 00690000
@NM00014 EQU   APCTSTAT                                                 00691000
APCTWARM EQU   APCTSTAT                                                 00692000
APCTTERM EQU   APCTSTAT                                                 00693000
APCTHALT EQU   APCTSTAT                                                 00694000
APCTQSCE EQU   APCTSTAT                                                 00695000
APCTSTRT EQU   APCTSTAT                                                 00696000
APCTACT  EQU   APCTSTAT                                                 00697000
@NM00012 EQU   APCT+935                                                 00698000
APCTSOUT EQU   APCT+934                                                 00699000
APCTDAID EQU   APCT+933                                                 00700000
APCTSV34 EQU   APCT+932                                                 00701000
APCTMJOB EQU   APCT+928                                                 00702000
APCTTCB  EQU   APCT+924                                                 00703000
APCTASCB EQU   APCT+920                                                 00704000
APCTDCNW EQU   APCT+918                                                 00705000
APCTDCNR EQU   APCT+916                                                 00706000
@NM00011 EQU   APCT+912                                                 00707000
@NM00010 EQU   APCT+908                                                 00708000
@NM00009 EQU   APCT+904                                                 00709000
@NM00008 EQU   APCT+900                                                 00710000
@NM00007 EQU   APCTERRS+22                                              00711000
APCTERTJ EQU   APCTERRS+20                                              00712000
APCTERTD EQU   APCTERRS+18                                              00713000
APCTERTC EQU   APCTERRS+16                                              00714000
APCTERTB EQU   APCTERRS+14                                              00715000
APCTERTA EQU   APCTERRS+12                                              00716000
APCTERT9 EQU   APCTERRS+10                                              00717000
APCTERT3 EQU   APCTERRS+8                                               00718000
APCTERT2 EQU   APCTERRS+6                                               00719000
APCTERT1 EQU   APCTERRS+4                                               00720000
APCTERT0 EQU   APCTERRS+2                                               00721000
APCTERTT EQU   APCTERRS                                                 00722000
APCTDSAP EQU   APCT+872                                                 00723000
APCTISUB EQU   APCT+868                                                 00724000
APCTUBAP EQU   APCT+864                                                 00725000
APCTAPDS EQU   APCT+860                                                 00726000
APCTUBIC EQU   APCT+856                                                 00727000
APCTUBIS EQU   APCT+852                                                 00728000
APCTAPUB EQU   APCT+848                                                 00729000
APCTUBLK EQU   APCT+844                                                 00730000
APCTBR1A EQU   APCTBR14+2                                               00731000
@NM00006 EQU   APCTBR14                                                 00732000
APCTSMSZ EQU   APCTSMAD+2                                               00733000
@NM00005 EQU   APCTSMAD+1                                               00734000
@NM00004 EQU   APCTSMAD                                                 00735000
APCTSMIS EQU   APCTSMIN+2                                               00736000
@NM00003 EQU   APCTSMIN+1                                               00737000
APCTSMSP EQU   APCTSMIN                                                 00738000
@NM00002 EQU   APCT+30                                                  00739000
APCTLINE EQU   APCT+28                                                  00740000
APCTLBSZ EQU   APCT+24                                                  00741000
APCTREG  EQU   APCT+20                                                  00742000
APCTSSID EQU   APCTENQM+4                                               00743000
@NM00001 EQU   APCTENQM                                                 00744000
APCTSSVT EQU   APCT+8                                                   00745000
APCTUSER EQU   APCT+4                                                   00746000
APCTID   EQU   APCT                                                     00747000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00748000
@ENDDATA EQU   *                                                        00749000
         END   IGTDDQ,(C'PLS1847',0701,77092)                           00750000
