TJHW     TITLE 'IGTJHW-3838 SS ALLOCATION RECOVERY SUBROUTINE-WAIT.    *00001000
                        '                                               00002000
IGTJHW   CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(16)                                          01S0001 00007000
         DC    C'IGTJHW    77.092'                              01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @07,0                                            01S0001 00011000
@PSTART  DS    0H                                               01S0001 00012000
         USING @PSTART,@07                                      01S0001 00013000
         L     @00,@SIZDATD                                     01S0001 00014000
         IGTYGSV  R,LV=(0)                                              00015000
         LR    @06,@01                                          01S0001 00016000
         USING @DATD,@06                                        01S0001 00017000
         ST    @13,@SA00001+4                                   01S0001 00018000
         LM    @00,@01,20(@13)                                  01S0001 00019000
         ST    @06,8(,@13)                                      01S0001 00020000
         LR    @13,@06                                          01S0001 00021000
*                                      SAVED BY RESTART FLIH MDC078  */ 00022000
         EJECT                                                          00023000
*                                                               02S0063 00024000
*   /*****************************************************************/ 00025000
*   /*                                                               */ 00026000
*   /* THIS SEGMENT CREATES AN ECB LIST FOR USE FOLLOWING AN ENQ WITH*/ 00027000
*   /* ECB OPTION.                                                   */ 00028000
*   /*                                                               */ 00029000
*   /*****************************************************************/ 00030000
*                                                               02S0063 00031000
*   DO;                             /* INSURE ENTIRE SEGMENT IS INCLD*/ 00032000
*     THEECBP=ADDR(ENQECB);         /* POINTER TO ENQ ECB            */ 00033000
         LA    @05,ENQECB                                       02S0064 00034000
         ST    @05,THEECBP                                      02S0064 00035000
*     CNCLECBP=ACNCLECB;            /* POINTER TO CANCEL ECB OR DUMMY*/ 00036000
         L     @05,ACNCLECB(,ALLCWAPT)                          02S0065 00037000
         ST    @05,CNCLECBP                                     02S0065 00038000
*     LASTECBI=BON;                 /* ADDRESSES SET, INDICATE LAST  */ 00039000
         OI    LASTECBI,B'10000000'                             02S0066 00040000
*   END;                            /* END OF SEGMENT.               */ 00041000
*   IF ALLOCNTR=APCTACTR THEN       /* IF NO RESOURCES UNALLOCATED   */ 00042000
         CLC   ALLOCNTR(4,ALLCWAPT),APCTACTR(APCTPTR)           01S0068 00043000
         BNE   @RF00068                                         01S0068 00044000
*     DO;                           /* SINCE LAST WE TRIED, THEN     */ 00045000
*       ENQECB=0;                   /* CLEAR ENQ ECB                 */ 00046000
         SLR   @05,@05                                          02S0070 00047000
         ST    @05,ENQECB                                       02S0070 00048000
*       RFY                                                     02S0071 00049000
*         R15P RSTD;                /* NEED REG 15 FOR ENQ RETCODE   */ 00050000
*       GEN REFS(APCTENQM,ALLOWAIT,ENQECB,ENQLISTE,NQLISTEL) SETS(      00051000
*           DYNQLIST);                                          02S0072 00052000
*                                   /*                                  00053000
         MVC   DYNQLIST(L'NQLISTEL),ENQLISTE INIT ENQ DYN LIST AREA     00054000
         ENQ   (APCTENQM-APCT(,APCTPTR),ALLOWAIT,E,8,SYSTEM),          *00055000
               ECB=ENQECB,MF=(E,DYNQLIST)                               00056000
*       ALLCWAIT=BON;               /* INDICATE ENQ RES (TO BE) OWNED*/ 00057000
         OI    ALLCWAIT(ALLCWAPT),B'00001000'                   02S0073 00058000
*       IF R15P^=0&ENQRC^=8 THEN    /* IF TASK DOES NOT HAVE SHR'D   */ 00059000
         LTR   R15P,R15P                                        02S0074 00060000
         BZ    @RF00074                                         02S0074 00061000
         CLI   ENQRC(R15P),8                                    02S0074 00062000
         BE    @RF00074                                         02S0074 00063000
*         DO;                       /* CONTROL OR RESOURCE THEN WAIT */ 00064000
*           RFY                                                 02S0076 00065000
*             R15P UNRSTD;          /* NO LONGER NEED IT             */ 00066000
*           DO;                     /* IGTYWAIT                 02S0077 00067000
*                                      (1)ECBLIST(ECBLIST)LONG(YES)  */ 00068000
*             RFY                                               02S0078 00069000
*              (GPR00F,                                         02S0078 00070000
*               GPR01P) RSTD;       /* REGISTERS USED                */ 00071000
*             GPR01P=-ADDR(ECBLIST);/* POINT TO ECB LIST             */ 00072000
         LA    GPR01P,ECBLIST                                   02S0079 00073000
         LCR   GPR01P,GPR01P                                    02S0079 00074000
*             GPR00F=1|'80000000'X; /* WAIT COUNT                    */ 00075000
         L     GPR00F,@CF01722                                  02S0080 00076000
*             SVC(1);               /* WAIT FOR ECB POSTING          */ 00077000
         SVC   1                                                02S0081 00078000
*             RFY                                               02S0082 00079000
*              (GPR00F,                                         02S0082 00080000
*               GPR01P) UNRSTD;     /* FINISHED WITH REGISTERS       */ 00081000
*           END;                    /* ECB WAIT COMPLETE LONG WAIT      00082000
*                                      WAIT FOR ONE TO COMPLETE      */ 00083000
*           IF CNCLECBP->ECBPOSTB=BON THEN/* IF POSTED,              */ 00084000
         L     @05,CNCLECBP                                     02S0084 00085000
         TM    ECBPOSTB(@05),B'01000000'                        02S0084 00086000
         BNO   @RF00084                                         02S0084 00087000
*             DO;                   /* CANCELED. SO INDICATE.        */ 00088000
*               ALLFAIL=BON;        /* ALLOCATION & JOB FAIL         */ 00089000
*                                                               02S0086 00090000
         OI    ALLFAIL(ALLCWAPT),B'10000000'                    02S0086 00091000
*               /*****************************************************/ 00092000
*               /*                                                   */ 00093000
*               /* IGTYJHE ERR(496)                                  */ 00094000
*               /*                                                   */ 00095000
*               /*****************************************************/ 00096000
*                                                               02S0087 00097000
*               RFY                                             02S0087 00098000
*                 R1F RSTD;                                     02S0087 00099000
*               R1F=17;             /* PROVIDE INDEX                 */ 00100000
         LA    R1F,17                                           02S0088 00101000
*               CALL APCVZJHE;      /* SPECIFY ERROR INFORMATION        00102000
*                                      PRIOR TO RETURN               */ 00103000
         L     @15,APCTZJHE(,APCTPTR)                           02S0089 00104000
         BALR  @14,@15                                          02S0089 00105000
*               RFY                                             02S0090 00106000
*                 R1F UNRSTD;       /* DONE WITH REG PROVIDE ERR INFO*/ 00107000
*             END;                                              02S0091 00108000
*         END;                                                  02S0092 00109000
@RF00084 DS    0H                                               02S0093 00110000
*       IF ALLCWAIT=BON THEN        /* IF ENQ RESOURCE OWNED THEN    */ 00111000
@RF00074 TM    ALLCWAIT(ALLCWAPT),B'00001000'                   01S0093 00112000
         BNO   @RF00093                                         01S0093 00113000
*         DO WHILE APCTACTR=ALLOCNTR/* DO WAIT UNTIL RESOURCES MADE  */ 00114000
*               &ALLFAIL=BOFF;      /* AVAILABLE OR ATTEMPT FAILS    */ 00115000
         B     @DE00094                                         01S0094 00116000
@DL00094 DS    0H                                               01S0095 00117000
*           APCTAALP=CURASCB;       /* ASCB ADDR FOR X-MEMORY POST   */ 00118000
         L     @05,CVTPTR                                       01S0095 00119000
         L     @05,CVTTCBP(,@05)                                01S0095 00120000
         L     @05,CURASCB(,@05)                                01S0095 00121000
         ST    @05,APCTAALP(,APCTPTR)                           01S0095 00122000
*           THEECBP=ADDR(APCTEALP); /* ADDR OF ALLOC PENDING ECB     */ 00123000
         LA    @05,APCTEALP(,APCTPTR)                           01S0096 00124000
         ST    @05,THEECBP                                      01S0096 00125000
*           DO;                     /* IGTYWAIT                 01S0097 00126000
*                                      (1)ECBLIST(ECBLIST)LONG(YES)  */ 00127000
*             RFY                                               01S0098 00128000
*              (GPR00F,                                         01S0098 00129000
*               GPR01P) RSTD;       /* REGISTERS USED                */ 00130000
*             GPR01P=-ADDR(ECBLIST);/* POINT TO ECB LIST             */ 00131000
         LA    GPR01P,ECBLIST                                   01S0099 00132000
         LCR   GPR01P,GPR01P                                    01S0099 00133000
*             GPR00F=1|'80000000'X; /* WAIT COUNT                    */ 00134000
         L     GPR00F,@CF01722                                  01S0100 00135000
*             SVC(1);               /* WAIT FOR ECB POSTING          */ 00136000
         SVC   1                                                01S0101 00137000
*             RFY                                               01S0102 00138000
*              (GPR00F,                                         01S0102 00139000
*               GPR01P) UNRSTD;     /* FINISHED WITH REGISTERS       */ 00140000
*           END;                    /* ECB WAIT COMPLETE WAIT FOR ONE   00141000
*                                      ECB                           */ 00142000
*           IF CNCLECBP->ECBPOSTB=BON THEN/* IF CANCELLED DURING     */ 00143000
         L     @05,CNCLECBP                                     01S0104 00144000
         TM    ECBPOSTB(@05),B'01000000'                        01S0104 00145000
         BNO   @RF00104                                         01S0104 00146000
*             DO;                   /* WAIT THEN JOB FAILS ALLOCATION*/ 00147000
*               ALLFAIL=BON;        /* INDICATE END OF ATTEMPT       */ 00148000
*                                                               01S0106 00149000
         OI    ALLFAIL(ALLCWAPT),B'10000000'                    01S0106 00150000
*               /*****************************************************/ 00151000
*               /*                                                   */ 00152000
*               /* IGTYJHE ERR(496)                                  */ 00153000
*               /*                                                   */ 00154000
*               /*****************************************************/ 00155000
*                                                               01S0107 00156000
*               RFY                                             01S0107 00157000
*                 R1F RSTD;                                     01S0107 00158000
*               R1F=17;             /* PROVIDE INDEX                 */ 00159000
         LA    R1F,17                                           01S0108 00160000
*               CALL APCVZJHE;      /* SPECIFY ERROR INFORMATION        00161000
*                                      PRIOR TO RETURN               */ 00162000
         L     @15,APCTZJHE(,APCTPTR)                           01S0109 00163000
         BALR  @14,@15                                          01S0109 00164000
*               RFY                                             01S0110 00165000
*                 R1F UNRSTD;       /* DONE WITH REG PROVIDE    01S0110 00166000
*                                      INFORMATION FOR USER          */ 00167000
*             END;                  /* END OF CANCELLED SEGMENT      */ 00168000
*           ELSE                    /* ALLOCATION PENDING ECB POSTED */ 00169000
*             APCTEALP=0;           /* CLEAR ALLOCATION PENDING ECB  */ 00170000
         B     @RC00104                                         01S0112 00171000
@RF00104 SLR   @05,@05                                          01S0112 00172000
         ST    @05,APCTEALP(,APCTPTR)                           01S0112 00173000
*         END;                      /* DO WHILE WAITING FOR RESOURCES*/ 00174000
@RC00104 DS    0H                                               01S0113 00175000
@DE00094 CLC   APCTACTR(4,APCTPTR),ALLOCNTR(ALLCWAPT)           01S0113 00176000
         BNE   @DC00094                                         01S0113 00177000
         TM    ALLFAIL(ALLCWAPT),B'10000000'                    01S0113 00178000
         BZ    @DL00094                                         01S0113 00179000
@DC00094 DS    0H                                               01S0114 00180000
*       DO;                         /* INSURE ENTIRE SEGMENT INCLUDED*/ 00181000
@RF00093 DS    0H                                               02S0115 00182000
*         GEN REFS(DEQLIST1,DQLIST1L,APCTENQM,ALLOWAIT) SETS(DYNDEQLA); 00183000
*                                   /*                                  00184000
         MVC   DYNDEQLA(L'DQLIST1L),DEQLIST1 INIT DYN DEQ AREA          00185000
         DEQ   (APCTENQM-APCT(,APCTPTR),ALLOWAIT,8,SYSTEM),            *00186000
               MF=(E,DYNDEQLA)                                          00187000
*         ALLCWAIT=BOFF;            /* NO LONGER CONTROL RESOURCE    */ 00188000
         NI    ALLCWAIT(ALLCWAPT),B'11110111'                   02S0116 00189000
*       END;                        /* END OF SEGMENT                */ 00190000
*     END;                          /* DO IF APCTACTR = ALLOCNTR        00191000
*                                      IGTXEPLG                      */ 00192000
*                                                               01S0119 00193000
*   /*****************************************************************/ 00194000
*   /*                                                               */ 00195000
*   /* SYSTEM DECLARES                                               */ 00196000
*   /*                                                               */ 00197000
*   /*****************************************************************/ 00198000
*                                                               01S0119 00199000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 00200000
*     GPR00F FIXED(31) REG(0),                                  01S0119 00201000
*     GPR01P PTR(31) REG(1);                                    01S0119 00202000
@RF00068 DS    0H                                               01S0120 00203000
*   DECLARE                         /* COMMON VARIABLES              */ 00204000
*     I256C CHAR(256) BASED,                                    01S0120 00205000
*     I031F FIXED(31) BASED,                                    01S0120 00206000
*     I031P PTR(31) BASED,                                      01S0120 00207000
*     I015F FIXED(15) BASED,                                    01S0120 00208000
*     I015P PTR(15) BASED,                                      01S0120 00209000
*     I008P PTR(8) BASED,                                       01S0120 00210000
*     I001C CHAR(1) BASED;                                      01S0120 00211000
*                                                               01S0121 00212000
*/*   MODULE PATCH AREA                                              */ 00213000
*                                                               01S0121 00214000
*   DCL                                                         01S0121 00215000
*     APPATCH CHAR(*) INT STATIC LOCAL GEND;                    01S0121 00216000
*   GENERATE DATA DEFS(APPATCH);                                01S0122 00217000
*                                                               01S0123 00218000
*   /*****************************************************************/ 00219000
*   /*                                                               */ 00220000
*   /* GENERAL REGISTER DECLARES                                     */ 00221000
*   /*                                                               */ 00222000
*   /*****************************************************************/ 00223000
*                                                               01S0123 00224000
*   DCL                                                         01S0123 00225000
*     R0F FIXED(31) REG(0),                                     01S0123 00226000
*     R0P PTR(24) REG(0),                                       01S0123 00227000
*     R0RSTD PTR(31) REG(0),                                    01S0123 00228000
*     R1F FIXED(31) REG(1),                                     01S0123 00229000
*     R1P PTR(24) REG(1),                                       01S0123 00230000
*     R1RSTD PTR(31) REG(1),                                    01S0123 00231000
*     R2F FIXED(31) REG(2),                                     01S0123 00232000
*     R2P PTR(24) REG(2),                                       01S0123 00233000
*     R2RSTD PTR(31) REG(2),                                    01S0123 00234000
*     R3F FIXED(31) REG(3),                                     01S0123 00235000
*     R3P PTR(24) REG(3),                                       01S0123 00236000
*     R3RSTD PTR(31) REG(3),                                    01S0123 00237000
*     R4F FIXED(31) REG(4),                                     01S0123 00238000
*     R4P PTR(24) REG(4),                                       01S0123 00239000
*     R4RSTD PTR(31) REG(4),                                    01S0123 00240000
*     R5F FIXED(31) REG(5),                                     01S0123 00241000
*     R5P PTR(24) REG(5),                                       01S0123 00242000
*     R5RSTD PTR(31) REG(5),                                    01S0123 00243000
*     R6F FIXED(31) REG(6),                                     01S0123 00244000
*     R6P PTR(24) REG(6),                                       01S0123 00245000
*     R6RSTD PTR(31) REG(6),                                    01S0123 00246000
*     R7F FIXED(31) REG(7),                                     01S0123 00247000
*     R7P PTR(24) REG(7),                                       01S0123 00248000
*     R7RSTD PTR(31) REG(7),                                    01S0123 00249000
*     R8F FIXED(31) REG(8),                                     01S0123 00250000
*     R8P PTR(24) REG(8),                                       01S0123 00251000
*     R8RSTD PTR(31) REG(8),                                    01S0123 00252000
*     R9F FIXED(31) REG(9),                                     01S0123 00253000
*     R9P PTR(24) REG(9),                                       01S0123 00254000
*     R9RSTD PTR(31) REG(9),                                    01S0123 00255000
*     R10F FIXED(31) REG(10),                                   01S0123 00256000
*     R10P PTR(24) REG(10),                                     01S0123 00257000
*     R10RSTD PTR(31) REG(10),                                  01S0123 00258000
*     R11F FIXED(31) REG(11),                                   01S0123 00259000
*     R11P PTR(24) REG(11),                                     01S0123 00260000
*     R11RSTD PTR(31) REG(11),                                  01S0123 00261000
*     R12F FIXED(31) REG(12),                                   01S0123 00262000
*     R12P PTR(24) REG(12),                                     01S0123 00263000
*     R12RSTD PTR(31) REG(12),                                  01S0123 00264000
*     R13F FIXED(31) REG(13),                                   01S0123 00265000
*     R13P PTR(24) REG(13),                                     01S0123 00266000
*     R13RSTD PTR(31) REG(13),                                  01S0123 00267000
*     R14F FIXED(31) REG(14),                                   01S0123 00268000
*     R14P PTR(24) REG(14),                                     01S0123 00269000
*     R14RSTD PTR(31) REG(14),                                  01S0123 00270000
*     R15F FIXED(31) REG(15),                                   01S0123 00271000
*     R15P PTR(24) REG(15),                                     01S0123 00272000
*     R15RSTD PTR(31) REG(15),                                  01S0123 00273000
*                                                               01S0123 00274000
*     /***************************************************************/ 00275000
*     /*                                                             */ 00276000
*     /* VPSS CONTROL BLOCK POINTER DECLARES                         */ 00277000
*     /*                                                             */ 00278000
*     /***************************************************************/ 00279000
*                                                               01S0123 00280000
*     APSMPTR PTR(24) REG(01),      /* STORAGE MANAGEMENT BLOCK 01S0123 00281000
*                                      (SUGGESTED POINTER)           */ 00282000
*     APSCPTR PTR(24) REG(01),      /* STORAGE MANAGEMENT CONTROL       00283000
*                                      WORD (SUGGESTED POINTER)      */ 00284000
*     APINPTR PTR(24) REG(01),      /* USER'S INPUT PARAMETER LIST      00285000
*                                      (SUGGESTED POINTER)           */ 00286000
*/*                                                                  */ 00287000
*                                                               01S0123 00288000
*     APDATA PTR(24) REG(06),       /* ADDRESS OF DYNAMIC DATA  01S0123 00289000
*                                      WORKAREA (DATAREG)            */ 00290000
*     APCODE PTR(24) REG(07),       /* PROGRAM CODE BASE REGISTER       00291000
*                                      (CODEREG)                     */ 00292000
*     APDEBPTR PTR(24) REG(08),     /* VPSS DEB (SUGGESTED POINTER)  */ 00293000
*     APNPPTR PTR(24) REG(08),      /* SUBSYSTEM INITIALIZATION 01S0123 00294000
*                                      WORKAREA BLOCK (ONLY USED BY     00295000
*                                      SUBSYSTEM INITIALIZATION)     */ 00296000
*     APRLPTR PTR(24) REG(08),      /* VPSS ACB REQUEST LIST    01S0123 00297000
*                                      (SUGGESTED POINTER)           */ 00298000
*     APCIPTR PTR(24) REG(08),      /* 3838 CONTROL TABLE (SUGGESTED    00299000
*                                      POINTER)                      */ 00300000
*     APCWPTR PTR(24) REG(08),      /* CALL INTERFACE WORKAREA  01S0123 00301000
*                                      (SUGGESTED POINTER)           */ 00302000
*     APERPTR PTR(24) REG(08),      /* ERP/IO APPENDAGE WORKAREA        00303000
*                                      (SUGGESTED POINTER)           */ 00304000
*     APACBPTR PTR(24) REG(09),     /* VPSS ACB (SUGGESTED POINTER)  */ 00305000
*     APCQPTR PTR(24) REG(09),      /* COMMAND QUEUE ELEMENT    01S0123 00306000
*                                      (SUGGESTED POINTER)           */ 00307000
*     APOTPTR PTR(24) REG(09),      /* OPTION TABLE (SUGGESTED  01S0123 00308000
*                                      POINTER)                      */ 00309000
*     APIOPTR PTR(24) REG(10),      /* I/O ELEMENT (SUGGESTED   01S0123 00310000
*                                      POINTER)                      */ 00311000
*     APEXLPTR PTR(24) REG(10),     /* VPSS EXLST (SUGGESTED POINTER)*/ 00312000
*     APUBPTR PTR(24) REG(10),      /* UNIT BLOCK (SUGGESTED POINTER)*/ 00313000
*     APAXPTR PTR(24) REG(10),      /* VPSS ACB EXTENSION (SUGGESTED    00314000
*                                      POINTER)                      */ 00315000
*     APCPPTR PTR(24) REG(10),      /* VPSS CALL PROCESSING     01S0123 00316000
*                                      INDICATORS (SUGGESTED POINTER)*/ 00317000
*     APOCPTR PTR(24) REG(10),      /* VPSS OPEN/CLOSE SUBSYSTEM        00318000
*                                      WORKAREA (REQUIRED POINTER)   */ 00319000
*     APATPTR PTR(24) REG(11),      /* VPSS ACB TABLE (SUGGESTED        00320000
*                                      POINTER)                      */ 00321000
*     APLBPTR PTR(24) REG(11),      /* LABEL RESOLUTION TABLE   01S0123 00322000
*                                      (SUGGESTED POINTER)           */ 00323000
*     APUTPTR PTR(24) REG(11),      /* USER TABLE (SUGGESTED POINTER)*/ 00324000
*     APDSPTR PTR(24) REG(11),      /* VPSS DATASET ENTRY (SUGGESTED    00325000
*                                      POINTER)                      */ 00326000
*     APXLPTR PTR(24) REG(11),      /* TRANSLATION TABLE (SUGGESTED     00327000
*                                      POINTER)                      */ 00328000
*     APDXPTR PTR(24) REG(11),      /* VPSS DEB EXTENSION (SUGGESTED    00329000
*                                      POINTER)                      */ 00330000
*     APCTPTR PTR(24) REG(12) RSTD, /* CONTROL TABLE (REQUIRED  01S0123 00331000
*                                      POINTER)                      */ 00332000
*     APSVPTR PTR(24) REG(13) RSTD, /* OS/VPSS SAVEAREA/WORKAREA        00333000
*                                      (REQUIRED POINTER)            */ 00334000
*     APRETURN PTR(24) REG(14),     /* RETURN ADDRESS FOR SUBROUTINE    00335000
*                                      LINKAGE                       */ 00336000
*     APENTRY PTR(24) REG(15),      /* SUBROUTINE ENTRY POINT LINKAGE*/ 00337000
*     APRCODE PTR(24) REG(15);      /* CONTAINS SUBROUTINE RETURN       00338000
*                                      CODE                          */ 00339000
*                                                               01S0124 00340000
*   /*****************************************************************/ 00341000
*   /*                                                               */ 00342000
*   /* USER REGISTER DECLARES                                        */ 00343000
*   /*                                                               */ 00344000
*   /*****************************************************************/ 00345000
*                                                               01S0124 00346000
*   DCL                                                         01S0124 00347000
*     ALLCWAPT PTR(24) REG(04) RSTD;/* POINTER TO SUBSYS ALLC WORK      00348000
*                                      AREA                          */ 00349000
*   END IGTJHW                                                  01S0125 00350000
*                                                               01S0125 00351000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00352000
*/*%INCLUDE SYSLIB  (IGTXAPAW)                                       */ 00353000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00354000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00355000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00356000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00357000
*/*%INCLUDE SYSLIB  (IGTJHM  )                                       */ 00358000
*/*%INCLUDE SYSLIB  (IGTXAPCT)                                       */ 00359000
*/*%INCLUDE SYSLIB  (IGTXAPSV)                                       */ 00360000
*/*%INCLUDE SYSLIB  (IGTXAPCV)                                       */ 00361000
*/*%INCLUDE SYSLIB  (IEFJSSOB)                                       */ 00362000
*/*%INCLUDE SYSLIB  (IEFSSARB)                                       */ 00363000
*/*%INCLUDE SYSLIB  (IHAECB  )                                       */ 00364000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00365000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00366000
*/*%INCLUDE SYSUT5  (BLDNQECB)                                       */ 00367000
*/*%INCLUDE SYSUT5  (ALCWENQ )                                       */ 00368000
*/*%INCLUDE SYSUT5  (ALCWDEQ )                                       */ 00369000
*                                                               01S0125 00370000
*       ;                                                       01S0125 00371000
@EL00001 L     @13,4(,@13)                                      01S0125 00372000
@EF00001 L     @00,@SIZDATD                                     01S0125 00373000
         LR    @01,@06                                          01S0125 00374000
         IGTYFSV  R,LV=(0),A=(1)                                        00375000
@ER00001 LM    @14,@12,12(@13)                                  01S0125 00376000
         BR    @14                                              01S0125 00377000
@DATA    DS    0H                                                       00378000
@DATD    DSECT                                                          00379000
         DS    0F                                                       00380000
@SA00001 DS    20F                                                      00381000
IGTJHW   CSECT                                                          00382000
         DS    0F                                                       00383000
@CF01722 DC    F'-2147483647'                                           00384000
@DATD    DSECT                                                          00385000
         DS    0D                                                       00386000
ECBLIST  DS    CL12                                                     00387000
         ORG   ECBLIST                                                  00388000
THEECBP  DS    AL4                                                      00389000
CNCLECBP DS    AL4                                                      00390000
         ORG   CNCLECBP                                                 00391000
@NM00001 DS    BL1                                                      00392000
         ORG   @NM00001                                                 00393000
LASTECBI DS    BL1                                                      00394000
@NM00002 EQU   @NM00001+0                                               00395000
         ORG   ECBLIST+8                                                00396000
ENQECB   DS    AL4                                                      00397000
         ORG   ECBLIST+12                                               00398000
IGTJHW   CSECT                                                          00399000
         DS    0F                                                       00400000
@SIZDATD DC    AL1(0)                                                   00401000
         DC    AL3(@ENDDATD-@DATD)                                      00402000
         DS    0D                                                       00403000
ALLOWAIT DC    CL8'ALLCWAIT'                                            00404000
IGTJHW   CSECT                                                          00405000
*                                     /*                                00406000
ENQLISTE ENQ   (*-*,*-*,E,0,SYSTEM),ECB=*-*,MF=L                        00407000
NQLISTEL EQU   ENQLISTE,*-ENQLISTE,C'C' LENGTH OF STATIC PARM LIST      00408000
@DATD    DSECT                                                          00409000
*                                   /*                                  00410000
DYNQLIST ENQ   (*-*,*-*,E,0,SYSTEM),ECB=*-*,MF=L                        00411000
IGTJHW   CSECT                                                          00412000
*                                                        /*             00413000
DEQLIST1 DEQ   (*-*,*-*,0,SYSTEM),MF=L                                  00414000
DQLIST1L EQU   DEQLIST1,*-DEQLIST1,C'C'                                 00415000
DEQLIST2 DEQ   (*-*,*-*,0,SYSTEM,                                      *00416000
               *-*,*-*,0,SYSTEM),MF=L                                   00417000
DQLIST2L EQU   DEQLIST2,*-DEQLIST2,C'C'                                 00418000
@DATD    DSECT                                                          00419000
*                                   /*                                  00420000
DYNDEQLA DEQ   (*-*,*-*,0,SYSTEM,                                      *00421000
               *-*,*-*,0,SYSTEM),                                      *00422000
               TCB=0,MF=L                                               00423000
IGTJHW   CSECT                                                          00424000
*                                /* GENERATE PATCH                      00425000
         IGTXZAP ,                 GENERATE PATCH AREA                  00426000
@DATD    DSECT                                                          00427000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00428000
@ENDDATD EQU   *                                                        00429000
IGTJHW   CSECT                                                          00430000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00431000
@01      EQU   01                                                       00432000
@02      EQU   02                                                       00433000
@03      EQU   03                                                       00434000
@04      EQU   04                                                       00435000
@05      EQU   05                                                       00436000
@06      EQU   06                                                       00437000
@07      EQU   07                                                       00438000
@08      EQU   08                                                       00439000
@09      EQU   09                                                       00440000
@10      EQU   10                                                       00441000
@11      EQU   11                                                       00442000
@12      EQU   12                                                       00443000
@13      EQU   13                                                       00444000
@14      EQU   14                                                       00445000
@15      EQU   15                                                       00446000
APDATA   EQU   @06                                                      00447000
APCODE   EQU   @07                                                      00448000
R15P     EQU   @15                                                      00449000
ALLCWAPT EQU   @04                                                      00450000
APCTPTR  EQU   @12                                                      00451000
APSVPTR  EQU   @13                                                      00452000
GPR00F   EQU   @00                                                      00453000
GPR01P   EQU   @01                                                      00454000
R1F      EQU   @01                                                      00455000
APACBPTR EQU   @09                                                      00456000
APATPTR  EQU   @11                                                      00457000
APAXPTR  EQU   @10                                                      00458000
APCIPTR  EQU   @08                                                      00459000
APCPPTR  EQU   @10                                                      00460000
APCQPTR  EQU   @09                                                      00461000
APCWPTR  EQU   @08                                                      00462000
APDEBPTR EQU   @08                                                      00463000
APDSPTR  EQU   @11                                                      00464000
APDXPTR  EQU   @11                                                      00465000
APENTRY  EQU   @15                                                      00466000
APERPTR  EQU   @08                                                      00467000
APEXLPTR EQU   @10                                                      00468000
APINPTR  EQU   @01                                                      00469000
APIOPTR  EQU   @10                                                      00470000
APLBPTR  EQU   @11                                                      00471000
APNPPTR  EQU   @08                                                      00472000
APOCPTR  EQU   @10                                                      00473000
APOTPTR  EQU   @09                                                      00474000
APRCODE  EQU   @15                                                      00475000
APRETURN EQU   @14                                                      00476000
APRLPTR  EQU   @08                                                      00477000
APSCPTR  EQU   @01                                                      00478000
APSMPTR  EQU   @01                                                      00479000
APUBPTR  EQU   @10                                                      00480000
APUTPTR  EQU   @11                                                      00481000
APXLPTR  EQU   @11                                                      00482000
R0F      EQU   @00                                                      00483000
R0P      EQU   @00                                                      00484000
R0RSTD   EQU   @00                                                      00485000
R1P      EQU   @01                                                      00486000
R1RSTD   EQU   @01                                                      00487000
R10F     EQU   @10                                                      00488000
R10P     EQU   @10                                                      00489000
R10RSTD  EQU   @10                                                      00490000
R11F     EQU   @11                                                      00491000
R11P     EQU   @11                                                      00492000
R11RSTD  EQU   @11                                                      00493000
R12F     EQU   @12                                                      00494000
R12P     EQU   @12                                                      00495000
R12RSTD  EQU   @12                                                      00496000
R13F     EQU   @13                                                      00497000
R13P     EQU   @13                                                      00498000
R13RSTD  EQU   @13                                                      00499000
R14F     EQU   @14                                                      00500000
R14P     EQU   @14                                                      00501000
R14RSTD  EQU   @14                                                      00502000
R15F     EQU   @15                                                      00503000
R15RSTD  EQU   @15                                                      00504000
R2F      EQU   @02                                                      00505000
R2P      EQU   @02                                                      00506000
R2RSTD   EQU   @02                                                      00507000
R3F      EQU   @03                                                      00508000
R3P      EQU   @03                                                      00509000
R3RSTD   EQU   @03                                                      00510000
R4F      EQU   @04                                                      00511000
R4P      EQU   @04                                                      00512000
R4RSTD   EQU   @04                                                      00513000
R5F      EQU   @05                                                      00514000
R5P      EQU   @05                                                      00515000
R5RSTD   EQU   @05                                                      00516000
R6F      EQU   @06                                                      00517000
R6P      EQU   @06                                                      00518000
R6RSTD   EQU   @06                                                      00519000
R7F      EQU   @07                                                      00520000
R7P      EQU   @07                                                      00521000
R7RSTD   EQU   @07                                                      00522000
R8F      EQU   @08                                                      00523000
R8P      EQU   @08                                                      00524000
R8RSTD   EQU   @08                                                      00525000
R9F      EQU   @09                                                      00526000
R9P      EQU   @09                                                      00527000
R9RSTD   EQU   @09                                                      00528000
PSA      EQU   0                                                        00529000
FLCRNPSW EQU   PSA                                                      00530000
FLCROPSW EQU   PSA+8                                                    00531000
FLCICCW2 EQU   PSA+16                                                   00532000
FLCCVT   EQU   FLCICCW2                                                 00533000
PSAEEPSW EQU   PSA+132                                                  00534000
PSAESPSW EQU   PSA+136                                                  00535000
FLCSVILC EQU   PSAESPSW+1                                               00536000
PSAEPPSW EQU   PSA+140                                                  00537000
FLCPIILC EQU   PSAEPPSW+1                                               00538000
FLCPICOD EQU   PSAEPPSW+2                                               00539000
PSAPICOD EQU   FLCPICOD+1                                               00540000
FLCTEA   EQU   PSAEPPSW+4                                               00541000
FLCPER   EQU   PSA+152                                                  00542000
FLCMCLA  EQU   PSA+168                                                  00543000
FLCIOEL  EQU   FLCMCLA+4                                                00544000
FLCIOA   EQU   FLCMCLA+16                                               00545000
FLCFSA   EQU   FLCMCLA+80                                               00546000
PSASUPER EQU   PSA+552                                                  00547000
PSASUP1  EQU   PSASUPER                                                 00548000
PSASUP2  EQU   PSASUPER+1                                               00549000
PSASUP3  EQU   PSASUPER+2                                               00550000
PSASUP4  EQU   PSASUPER+3                                               00551000
PSACLHT  EQU   PSA+640                                                  00552000
PSALKSA  EQU   PSA+696                                                  00553000
PSAHLHI  EQU   PSA+760                                                  00554000
PSADSSFL EQU   PSA+836                                                  00555000
PSADSSF1 EQU   PSADSSFL                                                 00556000
PSADSSF3 EQU   PSADSSFL+2                                               00557000
PSADSSF4 EQU   PSADSSFL+3                                               00558000
PSARSVT  EQU   PSA+896                                                  00559000
SSARBPTR EQU   0                                                        00560000
ECBPTR   EQU   0                                                        00561000
@NM00003 EQU   0                                                        00562000
ENQRC    EQU   @NM00003+3                                               00563000
TASKINFO EQU   0                                                        00564000
CURASCB  EQU   TASKINFO+12                                              00565000
APAW     EQU   0                                                        00566000
SSOBPTR  EQU   APAW                                                     00567000
ALLSTAT  EQU   APAW+8                                                   00568000
ALLSTAT0 EQU   ALLSTAT                                                  00569000
ALLFAIL  EQU   ALLSTAT0                                                 00570000
ALLSTAT1 EQU   ALLSTAT+1                                                00571000
ALLSTAT2 EQU   ALLSTAT+2                                                00572000
ALLSTAT3 EQU   ALLSTAT+3                                                00573000
ALLRSRCE EQU   APAW+12                                                  00574000
ALLCWAIT EQU   ALLRSRCE                                                 00575000
ALLOCNTR EQU   APAW+24                                                  00576000
ACNCLECB EQU   APAW+28                                                  00577000
EXITINFO EQU   APAW+48                                                  00578000
EXITINF0 EQU   EXITINFO                                                 00579000
EXITINF1 EQU   EXITINFO+1                                               00580000
APCT     EQU   0                                                        00581000
APCTENQM EQU   APCT+12                                                  00582000
APCTSMIN EQU   APCT+32                                                  00583000
APCTSMAD EQU   APCT+36                                                  00584000
APCTZ@@@ EQU   APCT+40                                                  00585000
APCTU@@@ EQU   APCT+440                                                 00586000
APCTBR14 EQU   APCT+840                                                 00587000
APCTERRS EQU   APCT+876                                                 00588000
@NM00024 EQU   APCT+936                                                 00589000
APCTSTAT EQU   @NM00024                                                 00590000
APCTPRSW EQU   @NM00024+1                                               00591000
APCTAPCQ EQU   APCT+944                                                 00592000
APCTCQAQ EQU   APCT+952                                                 00593000
APCTEALP EQU   APCT+1016                                                00594000
APCTAALP EQU   APCT+1020                                                00595000
APCTACTR EQU   APCT+1112                                                00596000
APCTZ@@1 EQU   APCT+1120                                                00597000
APSV     EQU   0                                                        00598000
APSVREGS EQU   APSV+12                                                  00599000
APCVZJHE EQU   0                                                        00600000
SSOB     EQU   0                                                        00601000
SSOBINDV EQU   SSOB+16                                                  00602000
SSAG     EQU   0                                                        00603000
SSAGEHDR EQU   SSAG                                                     00604000
SSAGFLGS EQU   SSAGEHDR+2                                               00605000
SSAGGMGP EQU   SSAGEHDR+24                                              00606000
SSAGARBK EQU   0                                                        00607000
SSAGDMGP EQU   SSAGARBK+56                                              00608000
SSAGDMBK EQU   0                                                        00609000
SSAGGMBK EQU   0                                                        00610000
ECB      EQU   0                                                        00611000
ECBRB    EQU   ECB                                                      00612000
ECBEVTB  EQU   ECBRB                                                    00613000
ECBEXTB  EQU   ECBEVTB                                                  00614000
ECBCC    EQU   ECBEXTB                                                  00615000
ECBPOSTB EQU   ECBCC                                                    00616000
ECBCCCNT EQU   ECBEXTB+1                                                00617000
ECBRBA   EQU   ECBCCCNT                                                 00618000
ECBEVTBA EQU   ECBRBA                                                   00619000
ECBEXTBA EQU   ECBEVTBA                                                 00620000
ECBBYTE3 EQU   ECBEXTBA+2                                               00621000
ECBEXTND EQU   ECBBYTE3                                                 00622000
CVTMAP   EQU   0                                                        00623000
CVTTCBP  EQU   CVTMAP                                                   00624000
CVTDAR   EQU   CVTMAP+72                                                00625000
CVTFLGS1 EQU   CVTDAR                                                   00626000
CVTDCB   EQU   CVTMAP+116                                               00627000
CVTIERLC EQU   CVTMAP+144                                               00628000
CVTOPTA  EQU   CVTMAP+182                                               00629000
CVTOPTB  EQU   CVTMAP+183                                               00630000
CVTGTF   EQU   CVTMAP+236                                               00631000
CVTGTFST EQU   CVTGTF                                                   00632000
CVTGTFS  EQU   CVTGTFST                                                 00633000
CVTSTATE EQU   CVTGTFST                                                 00634000
CVTTMODE EQU   CVTGTFST                                                 00635000
CVTFORM  EQU   CVTGTFST                                                 00636000
CVTAQAVT EQU   CVTMAP+240                                               00637000
CVTTCMFG EQU   CVTAQAVT                                                 00638000
CVTVOLM2 EQU   CVTMAP+244                                               00639000
CVTTATA  EQU   CVTVOLM2                                                 00640000
CVTTSKS  EQU   CVTTATA                                                  00641000
CVTVOLF2 EQU   CVTTSKS                                                  00642000
CVTTAT   EQU   CVTTATA+1                                                00643000
CVTATER  EQU   CVTMAP+248                                               00644000
CVTEXT1  EQU   CVTMAP+252                                               00645000
CVTPURG  EQU   CVTMAP+260                                               00646000
CVTQMSG  EQU   CVTMAP+268                                               00647000
CVTDMSR  EQU   CVTMAP+272                                               00648000
CVTRSV37 EQU   CVTDMSR                                                  00649000
CVTDMSRF EQU   CVTRSV37                                                 00650000
CVTERPV  EQU   CVTMAP+316                                               00651000
CVTINTLA EQU   CVTMAP+320                                               00652000
CVTAPF   EQU   CVTMAP+324                                               00653000
CVTEXT2  EQU   CVTMAP+328                                               00654000
CVTHJES  EQU   CVTMAP+332                                               00655000
CVTPGSIA EQU   CVTMAP+348                                               00656000
CVTA1F1  EQU   CVTMAP+356                                               00657000
CVTSYSK  EQU   CVTMAP+357                                               00658000
CVTVOLM1 EQU   CVTMAP+380                                               00659000
CVTVOLF1 EQU   CVTVOLM1                                                 00660000
CVTATMCT EQU   CVTMAP+388                                               00661000
CVTXTNT1 EQU   0                                                        00662000
CVTXTNT2 EQU   0                                                        00663000
CVTDSSV  EQU   CVTXTNT2                                                 00664000
CVTFLGBT EQU   CVTXTNT2+5                                               00665000
CVTQID   EQU   CVTXTNT2+24                                              00666000
CVTRV400 EQU   CVTXTNT2+52                                              00667000
CVTRV409 EQU   CVTXTNT2+53                                              00668000
CVTATCVT EQU   CVTXTNT2+64                                              00669000
CVTRV429 EQU   CVTXTNT2+84                                              00670000
CVTRV438 EQU   CVTXTNT2+85                                              00671000
CVTRV457 EQU   CVTXTNT2+112                                             00672000
CVTRV466 EQU   CVTXTNT2+113                                             00673000
CVTFIX   EQU   0                                                        00674000
CVTRELNO EQU   CVTFIX+252                                               00675000
APCVZDAL EQU   0                                                        00676000
APCVZDAP EQU   0                                                        00677000
APCVZDBK EQU   0                                                        00678000
APCVZDDA EQU   0                                                        00679000
APCVZDDQ EQU   0                                                        00680000
APCVZDEQ EQU   0                                                        00681000
APCVZDID EQU   0                                                        00682000
APCVZDIO EQU   0                                                        00683000
APCVZDIP EQU   0                                                        00684000
APCVZDMD EQU   0                                                        00685000
APCVZDMM EQU   0                                                        00686000
APCVZDQR EQU   0                                                        00687000
APCVZDRI EQU   0                                                        00688000
APCVZDUA EQU   0                                                        00689000
APCVZDUL EQU   0                                                        00690000
APCVZDWI EQU   0                                                        00691000
APCVZDWT EQU   0                                                        00692000
APCVZDX1 EQU   0                                                        00693000
APCVZDX2 EQU   0                                                        00694000
APCVZDX3 EQU   0                                                        00695000
APCVZDX4 EQU   0                                                        00696000
APCVZD10 EQU   0                                                        00697000
APCVZD20 EQU   0                                                        00698000
APCVZD4E EQU   0                                                        00699000
APCVZD40 EQU   0                                                        00700000
APCVZD41 EQU   0                                                        00701000
APCVZD42 EQU   0                                                        00702000
APCVZD43 EQU   0                                                        00703000
APCVZD44 EQU   0                                                        00704000
APCVZD45 EQU   0                                                        00705000
APCVZD46 EQU   0                                                        00706000
APCVZD47 EQU   0                                                        00707000
APCVZD48 EQU   0                                                        00708000
APCVZD49 EQU   0                                                        00709000
APCVZD60 EQU   0                                                        00710000
APCVZD80 EQU   0                                                        00711000
APCVZD81 EQU   0                                                        00712000
APCVZD82 EQU   0                                                        00713000
APCVZD83 EQU   0                                                        00714000
APCVZJAA EQU   0                                                        00715000
APCVZJAD EQU   0                                                        00716000
APCVZJAG EQU   0                                                        00717000
APCVZJAJ EQU   0                                                        00718000
APCVZJAM EQU   0                                                        00719000
APCVZJAP EQU   0                                                        00720000
APCVZJAX EQU   0                                                        00721000
APCVZJAY EQU   0                                                        00722000
APCVZJBA EQU   0                                                        00723000
APCVZJBD EQU   0                                                        00724000
APCVZJBG EQU   0                                                        00725000
APCVZJBJ EQU   0                                                        00726000
APCVZJBM EQU   0                                                        00727000
APCVZJDA EQU   0                                                        00728000
APCVZJDD EQU   0                                                        00729000
APCVZJDG EQU   0                                                        00730000
APCVZJDJ EQU   0                                                        00731000
APCVZJDM EQU   0                                                        00732000
APCVZJHC EQU   0                                                        00733000
APCVZJHF EQU   0                                                        00734000
APCVZJHO EQU   0                                                        00735000
APCVZJHQ EQU   0                                                        00736000
APCVZJHR EQU   0                                                        00737000
APCVZJHT EQU   0                                                        00738000
APCVZJHW EQU   0                                                        00739000
APCVZJH0 EQU   0                                                        00740000
APCVZJH6 EQU   0                                                        00741000
APCVZJI0 EQU   0                                                        00742000
APCVZJI3 EQU   0                                                        00743000
APCVZJJ0 EQU   0                                                        00744000
APCVZKAA EQU   0                                                        00745000
APCVZKBA EQU   0                                                        00746000
APCVZKBB EQU   0                                                        00747000
APCVZKBC EQU   0                                                        00748000
APCVZKBD EQU   0                                                        00749000
APCVZKBE EQU   0                                                        00750000
APCVZKBF EQU   0                                                        00751000
APCVZKCA EQU   0                                                        00752000
APCVZKDA EQU   0                                                        00753000
APCVZKGA EQU   0                                                        00754000
APCVZKGB EQU   0                                                        00755000
APCVZKGC EQU   0                                                        00756000
APCVZKGD EQU   0                                                        00757000
APCVZLCA EQU   0                                                        00758000
APCVZLCB EQU   0                                                        00759000
APCVZMBA EQU   0                                                        00760000
APCVZMBD EQU   0                                                        00761000
APCVZMBG EQU   0                                                        00762000
APCVZMBH EQU   0                                                        00763000
APCVZMBK EQU   0                                                        00764000
APCVZMBM EQU   0                                                        00765000
APCVZMIB EQU   0                                                        00766000
APCVZMIC EQU   0                                                        00767000
APCVZMIF EQU   0                                                        00768000
APCVZMJB EQU   0                                                        00769000
APCVZMJC EQU   0                                                        00770000
APCVZMJH EQU   0                                                        00771000
APCVZMJI EQU   0                                                        00772000
APCVZMMA EQU   0                                                        00773000
APCVZUAA EQU   0                                                        00774000
APCVZUAB EQU   0                                                        00775000
APCVZUAC EQU   0                                                        00776000
APCVZUAD EQU   0                                                        00777000
APCVZUAE EQU   0                                                        00778000
APCVZUAF EQU   0                                                        00779000
APCVZUAG EQU   0                                                        00780000
APCVZUBB EQU   0                                                        00781000
APCVZUFA EQU   0                                                        00782000
APCVZUHA EQU   0                                                        00783000
APCVZUHB EQU   0                                                        00784000
APCVZUJA EQU   0                                                        00785000
APCVZUKA EQU   0                                                        00786000
APCV1CMD EQU   0                                                        00787000
APCV1JAA EQU   0                                                        00788000
APCV1JBJ EQU   0                                                        00789000
APCV1JHC EQU   0                                                        00790000
APCV1JHL EQU   0                                                        00791000
APCV1JHT EQU   0                                                        00792000
APCV1MAB EQU   0                                                        00793000
APCV1MBD EQU   0                                                        00794000
APCV2JHC EQU   0                                                        00795000
APCV2JHL EQU   0                                                        00796000
APCV2MBD EQU   0                                                        00797000
CNCLECB  EQU   0                                                        00798000
I001C    EQU   0                                                        00799000
I008P    EQU   0                                                        00800000
I015F    EQU   0                                                        00801000
I015P    EQU   0                                                        00802000
I031F    EQU   0                                                        00803000
I031P    EQU   0                                                        00804000
I256C    EQU   0                                                        00805000
CVTPTR   EQU   FLCCVT                                                   00806000
APCTZ    EQU   APCTZ@@@                                                 00807000
APCTZUAA EQU   APCTZ                                                    00808000
APCTZUAB EQU   APCTZ+4                                                  00809000
APCTZUAC EQU   APCTZ+8                                                  00810000
APCTZUAD EQU   APCTZ+12                                                 00811000
APCTZUAE EQU   APCTZ+16                                                 00812000
APCTZUBB EQU   APCTZ+24                                                 00813000
APCTZD10 EQU   APCTZ+28                                                 00814000
APCTZD20 EQU   APCTZ+32                                                 00815000
APCTZD40 EQU   APCTZ+36                                                 00816000
APCTZD41 EQU   APCTZ+40                                                 00817000
APCTZD42 EQU   APCTZ+44                                                 00818000
APCTZD43 EQU   APCTZ+48                                                 00819000
APCTZD44 EQU   APCTZ+52                                                 00820000
APCTZD45 EQU   APCTZ+56                                                 00821000
APCTZD46 EQU   APCTZ+60                                                 00822000
APCTZD47 EQU   APCTZ+64                                                 00823000
APCTZD48 EQU   APCTZ+68                                                 00824000
APCTZD49 EQU   APCTZ+72                                                 00825000
APCTZD60 EQU   APCTZ+76                                                 00826000
APCTZD80 EQU   APCTZ+80                                                 00827000
APCTZD4E EQU   APCTZ+84                                                 00828000
APCTZMBA EQU   APCTZ+88                                                 00829000
APCTZMBD EQU   APCTZ+92                                                 00830000
APCTZMBG EQU   APCTZ+96                                                 00831000
APCTZDX1 EQU   APCTZ+104                                                00832000
APCTZDX2 EQU   APCTZ+108                                                00833000
APCTZDX3 EQU   APCTZ+112                                                00834000
APCTZDX4 EQU   APCTZ+116                                                00835000
APCTZMBH EQU   APCTZ+120                                                00836000
APCTZMBK EQU   APCTZ+124                                                00837000
APCTZMBM EQU   APCTZ+128                                                00838000
APCTZMJB EQU   APCTZ+132                                                00839000
APCTZMJC EQU   APCTZ+136                                                00840000
APCTZMJH EQU   APCTZ+140                                                00841000
APCTZMMA EQU   APCTZ+144                                                00842000
APCTZDMD EQU   APCTZ+148                                                00843000
APCTZD81 EQU   APCTZ+152                                                00844000
APCTZDID EQU   APCTZ+156                                                00845000
APCTZDRI EQU   APCTZ+160                                                00846000
APCTZMJI EQU   APCTZ+164                                                00847000
APCTZDWT EQU   APCTZ+168                                                00848000
APCTZDMM EQU   APCTZ+172                                                00849000
APCTZDAL EQU   APCTZ+176                                                00850000
APCTZDBK EQU   APCTZ+180                                                00851000
APCTZDIP EQU   APCTZ+184                                                00852000
APCTZDDA EQU   APCTZ+188                                                00853000
APCTZDUL EQU   APCTZ+192                                                00854000
APCTZDEQ EQU   APCTZ+196                                                00855000
APCTZDDQ EQU   APCTZ+200                                                00856000
APCTZDUA EQU   APCTZ+204                                                00857000
APCTZUAF EQU   APCTZ+208                                                00858000
APCTZUAG EQU   APCTZ+212                                                00859000
APCTZDIO EQU   APCTZ+216                                                00860000
APCTZUHA EQU   APCTZ+220                                                00861000
APCTZUHB EQU   APCTZ+224                                                00862000
APCTZJAA EQU   APCTZ+232                                                00863000
APCTZJAD EQU   APCTZ+236                                                00864000
APCTZJAG EQU   APCTZ+240                                                00865000
APCTZJAJ EQU   APCTZ+244                                                00866000
APCTZJAM EQU   APCTZ+248                                                00867000
APCTZJAP EQU   APCTZ+252                                                00868000
APCTZJAY EQU   APCTZ+256                                                00869000
APCTZUFA EQU   APCTZ+260                                                00870000
APCTZUJA EQU   APCTZ+264                                                00871000
APCTZDAP EQU   APCTZ+268                                                00872000
APCTZKAA EQU   APCTZ+272                                                00873000
APCTZD82 EQU   APCTZ+276                                                00874000
APCTZMIB EQU   APCTZ+280                                                00875000
APCTZMIC EQU   APCTZ+284                                                00876000
APCTZD83 EQU   APCTZ+288                                                00877000
APCTZMIF EQU   APCTZ+296                                                00878000
APCTZJH0 EQU   APCTZ+300                                                00879000
APCTZJI0 EQU   APCTZ+304                                                00880000
APCTZJI3 EQU   APCTZ+308                                                00881000
APCTZJJ0 EQU   APCTZ+312                                                00882000
APCTZJBA EQU   APCTZ+316                                                00883000
APCTZJBD EQU   APCTZ+320                                                00884000
APCTZJBG EQU   APCTZ+324                                                00885000
APCTZJBJ EQU   APCTZ+328                                                00886000
APCTZJBM EQU   APCTZ+332                                                00887000
APCTZKCA EQU   APCTZ+340                                                00888000
APCTZKDA EQU   APCTZ+344                                                00889000
APCTZJDA EQU   APCTZ+356                                                00890000
APCTZJDJ EQU   APCTZ+360                                                00891000
APCTZJH6 EQU   APCTZ+364                                                00892000
APCTZJHO EQU   APCTZ+368                                                00893000
APCTZJHF EQU   APCTZ+372                                                00894000
APCTZJHE EQU   APCTZ+376                                                00895000
APCTZDQR EQU   APCTZ+380                                                00896000
APCTZJHR EQU   APCTZ+384                                                00897000
APCTZJHT EQU   APCTZ+388                                                00898000
APCTZJHW EQU   APCTZ+392                                                00899000
APCTZ1   EQU   APCTZ@@1                                                 00900000
APCTZKBA EQU   APCTZ1                                                   00901000
APCTZKBC EQU   APCTZ1+4                                                 00902000
APCTZKBB EQU   APCTZ1+8                                                 00903000
APCTZJHC EQU   APCTZ1+20                                                00904000
APCTZJHQ EQU   APCTZ1+24                                                00905000
APCTZKBD EQU   APCTZ1+28                                                00906000
APCTZKBE EQU   APCTZ1+40                                                00907000
APCTZUKA EQU   APCTZ1+56                                                00908000
APCTZKBF EQU   APCTZ1+60                                                00909000
APCTZJDD EQU   APCTZ1+64                                                00910000
APCTZJDG EQU   APCTZ1+68                                                00911000
APCTZJDM EQU   APCTZ1+72                                                00912000
APCTZLCA EQU   APCTZ1+76                                                00913000
APCTZLCB EQU   APCTZ1+80                                                00914000
APCTZDWI EQU   APCTZ1+84                                                00915000
APCTZJAX EQU   APCTZ1+88                                                00916000
APCTZKGA EQU   APCTZ1+92                                                00917000
APCTZKGB EQU   APCTZ1+96                                                00918000
APCTZKGC EQU   APCTZ1+100                                               00919000
APCTZKGD EQU   APCTZ1+104                                               00920000
APCTU    EQU   APCTU@@@                                                 00921000
APCT1MAB EQU   APCTU                                                    00922000
APCT1MBD EQU   APCTU+4                                                  00923000
APCT2MBD EQU   APCTU+8                                                  00924000
APCT1CMD EQU   APCTU+12                                                 00925000
APCT1JAA EQU   APCTU+20                                                 00926000
APCT1JHC EQU   APCTU+24                                                 00927000
APCT2JHC EQU   APCTU+28                                                 00928000
APCT1JHT EQU   APCTU+32                                                 00929000
APCT1JHL EQU   APCTU+36                                                 00930000
APCT2JHL EQU   APCTU+40                                                 00931000
APCT1JBJ EQU   APCTU+44                                                 00932000
CVTS01   EQU   CVTPGSIA                                                 00933000
CVTLPDIA EQU   CVTS01+12                                                00934000
CVTDIRST EQU   CVTLPDIA                                                 00935000
CVTSLIDA EQU   CVTS01+24                                                00936000
CVTCTLFG EQU   CVTS01+50                                                00937000
CVTRV210 EQU   CVTS01+424                                               00938000
CVTRV219 EQU   CVTS01+425                                               00939000
CVTRV228 EQU   CVTS01+426                                               00940000
CVTRV237 EQU   CVTS01+427                                               00941000
CVTMFRTR EQU   CVTS01+452                                               00942000
CVTRV262 EQU   CVTS01+468                                               00943000
CVTRV271 EQU   CVTS01+469                                               00944000
CVTRV280 EQU   CVTS01+470                                               00945000
CVTRV289 EQU   CVTS01+471                                               00946000
CVTGSDA  EQU   CVTS01+600                                               00947000
PSARSVTE EQU   PSARSVT                                                  00948000
ALLCWA   EQU   APAW                                                     00949000
FLC      EQU   PSA                                                      00950000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00951000
PSARSAV  EQU   PSARSVTE+60                                              00952000
PSARSTK  EQU   PSARSVTE+56                                              00953000
PSAESAV3 EQU   PSARSVTE+52                                              00954000
PSAESTK3 EQU   PSARSVTE+48                                              00955000
PSAESAV2 EQU   PSARSVTE+44                                              00956000
PSAESTK2 EQU   PSARSVTE+40                                              00957000
PSAESAV1 EQU   PSARSVTE+36                                              00958000
PSAESTK1 EQU   PSARSVTE+32                                              00959000
PSAPSAV  EQU   PSARSVTE+28                                              00960000
PSAPSTK  EQU   PSARSVTE+24                                              00961000
PSAMSAV  EQU   PSARSVTE+20                                              00962000
PSAMSTK  EQU   PSARSVTE+16                                              00963000
PSASSAV  EQU   PSARSVTE+12                                              00964000
PSASSTK  EQU   PSARSVTE+8                                               00965000
PSANSTK  EQU   PSARSVTE+4                                               00966000
PSACSTK  EQU   PSARSVTE                                                 00967000
CVTRV628 EQU   CVTS01+728                                               00968000
CVTRV627 EQU   CVTS01+724                                               00969000
CVTRV626 EQU   CVTS01+720                                               00970000
CVTRV625 EQU   CVTS01+716                                               00971000
CVTRV624 EQU   CVTS01+712                                               00972000
CVTRV623 EQU   CVTS01+708                                               00973000
CVTRV622 EQU   CVTS01+704                                               00974000
CVTRV621 EQU   CVTS01+700                                               00975000
CVTIHASU EQU   CVTS01+696                                               00976000
CVTSUSP  EQU   CVTS01+692                                               00977000
CVTT6SVC EQU   CVTS01+688                                               00978000
CVTCDAL  EQU   CVTS01+684                                               00979000
CVTTCTL  EQU   CVTS01+680                                               00980000
CVTRSUME EQU   CVTS01+676                                               00981000
CVTJTERM EQU   CVTS01+672                                               00982000
CVTASMRM EQU   CVTS01+668                                               00983000
CVTTCASP EQU   CVTS01+664                                               00984000
CVT0PT03 EQU   CVTS01+660                                               00985000
CVT0PT0E EQU   CVTS01+656                                               00986000
CVTRV609 EQU   CVTS01+652                                               00987000
CVTCGK   EQU   CVTS01+648                                               00988000
CVTRAC   EQU   CVTS01+644                                               00989000
CVTRV606 EQU   CVTS01+640                                               00990000
CVTRV605 EQU   CVTS01+636                                               00991000
CVTRV604 EQU   CVTS01+632                                               00992000
CVTEFF02 EQU   CVTS01+628                                               00993000
CVTCBBR  EQU   CVTS01+624                                               00994000
CVTSSCR  EQU   CVTS01+620                                               00995000
CVTEVENT EQU   CVTS01+616                                               00996000
CVTCRCA  EQU   CVTS01+612                                               00997000
CVTTPIO  EQU   CVTS01+608                                               00998000
CVTADV   EQU   CVTS01+604                                               00999000
CVTGSDAB EQU   CVTGSDA                                                  01000000
CVTQV3   EQU   CVTS01+596                                               01001000
CVTQV2   EQU   CVTS01+592                                               01002000
CVTQV1   EQU   CVTS01+588                                               01003000
CVTRPT   EQU   CVTS01+584                                               01004000
CVTSSRB  EQU   CVTS01+580                                               01005000
CVTCSDRL EQU   CVTS01+576                                               01006000
CVTEXP1  EQU   CVTS01+572                                               01007000
CVTRMPMT EQU   CVTS01+568                                               01008000
CVTRMPTT EQU   CVTS01+564                                               01009000
CVTVPSA  EQU   CVTS01+560                                               01010000
CVTVSTOP EQU   CVTS01+556                                               01011000
CVTGTFR8 EQU   CVTS01+552                                               01012000
CVTQUIT  EQU   CVTS01+548                                               01013000
CVTVACR  EQU   CVTS01+544                                               01014000
CVTWTCB  EQU   CVTS01+540                                               01015000
CVTSTPRS EQU   CVTS01+536                                               01016000
CVT0PT02 EQU   CVTS01+532                                               01017000
CVTDARCM EQU   CVTS01+528                                               01018000
CVTIRECM EQU   CVTS01+524                                               01019000
CVTJRECM EQU   CVTS01+520                                               01020000
CVTVEMS0 EQU   CVTS01+516                                               01021000
CVTSPFRR EQU   CVTS01+512                                               01022000
CVTRLSTG EQU   CVTS01+508                                               01023000
CVT0TC0A EQU   CVTS01+504                                               01024000
CVTGMBR  EQU   CVTS01+500                                               01025000
CVTLFRM  EQU   CVTS01+496                                               01026000
CVTRMBR  EQU   CVTS01+492                                               01027000
CVTVIOP  EQU   CVTS01+488                                               01028000
CVTRV307 EQU   CVTS01+486                                               01029000
CVTRV306 EQU   CVTS01+484                                               01030000
CVTRV305 EQU   CVTS01+482                                               01031000
CVTRV304 EQU   CVTS01+480                                               01032000
CVTRV303 EQU   CVTS01+478                                               01033000
CVTRV302 EQU   CVTS01+476                                               01034000
CVTTRCA  EQU   CVTS01+472                                               01035000
CVTRV297 EQU   CVTRV289                                                 01036000
CVTRV296 EQU   CVTRV289                                                 01037000
CVTRV295 EQU   CVTRV289                                                 01038000
CVTRV294 EQU   CVTRV289                                                 01039000
CVTRV293 EQU   CVTRV289                                                 01040000
CVTRV292 EQU   CVTRV289                                                 01041000
CVTRV291 EQU   CVTRV289                                                 01042000
CVTRV290 EQU   CVTRV289                                                 01043000
CVTRV288 EQU   CVTRV280                                                 01044000
CVTRV287 EQU   CVTRV280                                                 01045000
CVTRV286 EQU   CVTRV280                                                 01046000
CVTRV285 EQU   CVTRV280                                                 01047000
CVTRV284 EQU   CVTRV280                                                 01048000
CVTRV283 EQU   CVTRV280                                                 01049000
CVTRV282 EQU   CVTRV280                                                 01050000
CVTRV281 EQU   CVTRV280                                                 01051000
CVTRV279 EQU   CVTRV271                                                 01052000
CVTRV278 EQU   CVTRV271                                                 01053000
CVTRV277 EQU   CVTRV271                                                 01054000
CVTRV276 EQU   CVTRV271                                                 01055000
CVTRV275 EQU   CVTRV271                                                 01056000
CVTRV274 EQU   CVTRV271                                                 01057000
CVTRV273 EQU   CVTRV271                                                 01058000
CVTRV272 EQU   CVTRV271                                                 01059000
CVTRV270 EQU   CVTRV262                                                 01060000
CVTRV269 EQU   CVTRV262                                                 01061000
CVTRV268 EQU   CVTRV262                                                 01062000
CVTRV267 EQU   CVTRV262                                                 01063000
CVTRV266 EQU   CVTRV262                                                 01064000
CVTRV265 EQU   CVTRV262                                                 01065000
CVTRV264 EQU   CVTRV262                                                 01066000
CVTRV263 EQU   CVTRV262                                                 01067000
CVTVFP   EQU   CVTS01+464                                               01068000
CVTVSI   EQU   CVTS01+460                                               01069000
CVTVPSIB EQU   CVTS01+456                                               01070000
CVTMFACT EQU   CVTMFRTR                                                 01071000
CVTMFCTL EQU   CVTS01+448                                               01072000
CVTPVBP  EQU   CVTS01+444                                               01073000
CVTPWI   EQU   CVTS01+440                                               01074000
CVTRV254 EQU   CVTS01+438                                               01075000
CVTRV253 EQU   CVTS01+436                                               01076000
CVTRV252 EQU   CVTS01+434                                               01077000
CVTRV251 EQU   CVTS01+433                                               01078000
CVTRV250 EQU   CVTS01+432                                               01079000
CVTRV249 EQU   CVTS01+431                                               01080000
CVTRV248 EQU   CVTS01+430                                               01081000
CVTRV247 EQU   CVTS01+429                                               01082000
CVTRV246 EQU   CVTS01+428                                               01083000
CVTRV245 EQU   CVTRV237                                                 01084000
CVTRV244 EQU   CVTRV237                                                 01085000
CVTRV243 EQU   CVTRV237                                                 01086000
CVTRV242 EQU   CVTRV237                                                 01087000
CVTRV241 EQU   CVTRV237                                                 01088000
CVTRV240 EQU   CVTRV237                                                 01089000
CVTRV239 EQU   CVTRV237                                                 01090000
CVTRV238 EQU   CVTRV237                                                 01091000
CVTRV236 EQU   CVTRV228                                                 01092000
CVTRV235 EQU   CVTRV228                                                 01093000
CVTRV234 EQU   CVTRV228                                                 01094000
CVTRV233 EQU   CVTRV228                                                 01095000
CVTRV232 EQU   CVTRV228                                                 01096000
CVTRV231 EQU   CVTRV228                                                 01097000
CVTRV230 EQU   CVTRV228                                                 01098000
CVTRV229 EQU   CVTRV228                                                 01099000
CVTRV227 EQU   CVTRV219                                                 01100000
CVTRV226 EQU   CVTRV219                                                 01101000
CVTRV225 EQU   CVTRV219                                                 01102000
CVTRV224 EQU   CVTRV219                                                 01103000
CVTRV223 EQU   CVTRV219                                                 01104000
CVTRV222 EQU   CVTRV219                                                 01105000
CVTRV221 EQU   CVTRV219                                                 01106000
CVTRV220 EQU   CVTRV219                                                 01107000
CVTRV218 EQU   CVTRV210                                                 01108000
CVTRV217 EQU   CVTRV210                                                 01109000
CVTRV216 EQU   CVTRV210                                                 01110000
CVTRV215 EQU   CVTRV210                                                 01111000
CVTRV214 EQU   CVTRV210                                                 01112000
CVTRV213 EQU   CVTRV210                                                 01113000
CVTRV212 EQU   CVTRV210                                                 01114000
CVTRV211 EQU   CVTRV210                                                 01115000
CVTLCCAT EQU   CVTS01+420                                               01116000
CVTPCCAT EQU   CVTS01+416                                               01117000
CVTIPCRP EQU   CVTS01+412                                               01118000
CVTIPCRI EQU   CVTS01+408                                               01119000
CVTIPCDS EQU   CVTS01+404                                               01120000
CVTAIDVT EQU   CVTS01+400                                               01121000
CVTSSAP  EQU   CVTS01+396                                               01122000
CVTEHCIR EQU   CVTS01+392                                               01123000
CVTEHDEF EQU   CVTS01+388                                               01124000
CVTDAIR  EQU   CVTS01+384                                               01125000
CVTPERFM EQU   CVTS01+380                                               01126000
CVT044R2 EQU   CVTS01+376                                               01127000
CVTFETCH EQU   CVTS01+372                                               01128000
CVTRSTWD EQU   CVTS01+368                                               01129000
CVTSPOST EQU   CVTS01+364                                               01130000
CVTIOBP  EQU   CVTS01+360                                               01131000
CVTASMVT EQU   CVTS01+356                                               01132000
CVTRECRQ EQU   CVTS01+352                                               01133000
CVTWSAC  EQU   CVTS01+348                                               01134000
CVTRV149 EQU   CVTS01+344                                               01135000
CVTWSAL  EQU   CVTS01+340                                               01136000
CVTSPSA  EQU   CVTS01+336                                               01137000
CVTGLMN  EQU   CVTS01+332                                               01138000
CVTVEAC0 EQU   CVTS01+328                                               01139000
CVT062R1 EQU   CVTS01+324                                               01140000
CVTRPOST EQU   CVTS01+320                                               01141000
CVTDQIQE EQU   CVTS01+316                                               01142000
CVTCSD   EQU   CVTS01+312                                               01143000
CVTLKRMA EQU   CVTS01+308                                               01144000
CVTRSPIE EQU   CVTS01+304                                               01145000
CVTRENQ  EQU   CVTS01+300                                               01146000
CVTLQCB  EQU   CVTS01+296                                               01147000
CVTFQCB  EQU   CVTS01+292                                               01148000
CVTQCS01 EQU   CVTS01+288                                               01149000
CVTAPFT  EQU   CVTS01+284                                               01150000
CVTPARRL EQU   CVTS01+280                                               01151000
CVTVWAIT EQU   CVTS01+276                                               01152000
CVTGSPL  EQU   CVTS01+272                                               01153000
CVTLSMQ  EQU   CVTS01+268                                               01154000
CVTGSMQ  EQU   CVTS01+264                                               01155000
CVTEXPRO EQU   CVTS01+260                                               01156000
CVTOPCTP EQU   CVTS01+256                                               01157000
CVTSIC   EQU   CVTS01+252                                               01158000
CVTTPIOS EQU   CVTS01+248                                               01159000
CVTRTMS  EQU   CVTS01+244                                               01160000
CVTSDBF  EQU   CVTS01+240                                               01161000
CVTSCBP  EQU   CVTS01+236                                               01162000
CVTSDMP  EQU   CVTS01+232                                               01163000
CVTSV60  EQU   CVTS01+228                                               01164000
CVTRTMCT EQU   CVTS01+224                                               01165000
CVTASCBL EQU   CVTS01+220                                               01166000
CVTASCBH EQU   CVTS01+216                                               01167000
CVTGDA   EQU   CVTS01+212                                               01168000
CVTASVT  EQU   CVTS01+208                                               01169000
CVTVVMDI EQU   CVTS01+204                                               01170000
CVTAQTOP EQU   CVTS01+200                                               01171000
CVTIOSCS EQU   CVTS01+196                                               01172000
CVTSDRM  EQU   CVTS01+192                                               01173000
CVTOPTE  EQU   CVTS01+188                                               01174000
CVTSTXU  EQU   CVTS01+184                                               01175000
CVTQUIS  EQU   CVTS01+180                                               01176000
CVTPARS  EQU   CVTS01+176                                               01177000
CVTS1EE  EQU   CVTS01+172                                               01178000
CVTFRAS  EQU   CVTS01+168                                               01179000
CVTQSAS  EQU   CVTS01+164                                               01180000
CVTCRAS  EQU   CVTS01+160                                               01181000
CVTCRMN  EQU   CVTS01+156                                               01182000
CVTDELCP EQU   CVTS01+152                                               01183000
CVTFRECL EQU   CVTS01+148                                               01184000
CVTGETCL EQU   CVTS01+144                                               01185000
CVTBLDCP EQU   CVTS01+140                                               01186000
CVTAUTHL EQU   CVTS01+136                                               01187000
CVTSCAN  EQU   CVTS01+132                                               01188000
CVTRV144 EQU   CVTS01+130                                               01189000
CVTMAXMP EQU   CVTS01+128                                               01190000
CVTSTCK  EQU   CVTS01+124                                               01191000
CVTRV139 EQU   CVTS01+123                                               01192000
CVTDSSAC EQU   CVTS01+122                                               01193000
CVTRV513 EQU   CVTS01+121                                               01194000
CVTIOSPL EQU   CVTS01+120                                               01195000
CVTPTGT  EQU   CVTS01+116                                               01196000
CVTCSPIE EQU   CVTS01+112                                               01197000
CVTSMFEX EQU   CVTS01+108                                               01198000
CVTOLT0A EQU   CVTS01+104                                               01199000
CVTSRBRT EQU   CVTS01+100                                               01200000
CVTPUTL  EQU   CVTS01+96                                                01201000
CVTASCRL EQU   CVTS01+92                                                01202000
CVTASCRF EQU   CVTS01+88                                                01203000
CVTRV326 EQU   CVTS01+84                                                01204000
CVTRV325 EQU   CVTS01+80                                                01205000
CVTRV324 EQU   CVTS01+76                                                01206000
CVT0VL01 EQU   CVTS01+72                                                01207000
CVTSHRVM EQU   CVTS01+68                                                01208000
CVTRV332 EQU   CVTS01+64                                                01209000
CVTTAS   EQU   CVTS01+60                                                01210000
CVTRSCN  EQU   CVTS01+56                                                01211000
CVTTRAC2 EQU   CVTS01+54                                                01212000
CVTTRACE EQU   CVTS01+52                                                01213000
CVTAPG   EQU   CVTS01+51                                                01214000
CVTSDTRC EQU   CVTCTLFG                                                 01215000
CVTGTRCE EQU   CVTCTLFG                                                 01216000
CVTNOMP  EQU   CVTCTLFG                                                 01217000
CVTRSV79 EQU   CVTCTLFG                                                 01218000
CVTDSTAT EQU   CVTCTLFG                                                 01219000
CVTRSV78 EQU   CVTCTLFG                                                 01220000
CVTRV333 EQU   CVTCTLFG                                                 01221000
CVTRV323 EQU   CVTCTLFG                                                 01222000
CVTSPVLK EQU   CVTS01+49                                                01223000
CVTRSV77 EQU   CVTS01+48                                                01224000
CVTRV331 EQU   CVTS01+44                                                01225000
CVTRV330 EQU   CVTS01+40                                                01226000
CVTRV329 EQU   CVTS01+36                                                01227000
CVTRV328 EQU   CVTS01+32                                                01228000
CVTRV322 EQU   CVTS01+28                                                01229000
CVTSLID  EQU   CVTSLIDA+1                                               01230000
CVTSYLK  EQU   CVTSLIDA                                                 01231000
CVTRV321 EQU   CVTS01+20                                                01232000
CVTRV320 EQU   CVTS01+16                                                01233000
CVTLPDIR EQU   CVTLPDIA+1                                               01234000
CVTRSV69 EQU   CVTDIRST                                                 01235000
CVTRSV68 EQU   CVTDIRST                                                 01236000
CVTRSV67 EQU   CVTDIRST                                                 01237000
CVTRSV66 EQU   CVTDIRST                                                 01238000
CVTRSV65 EQU   CVTDIRST                                                 01239000
CVTRSV64 EQU   CVTDIRST                                                 01240000
CVTRSV63 EQU   CVTDIRST                                                 01241000
CVTDICOM EQU   CVTDIRST                                                 01242000
CVTPVTP  EQU   CVTS01+8                                                 01243000
CVTLPDSR EQU   CVTS01+4                                                 01244000
CVTGETL  EQU   CVTS01                                                   01245000
@NM00056 EQU   APCTU+48                                                 01246000
APCT1MBM EQU   APCTU+16                                                 01247000
@NM00055 EQU   APCTZ1+108                                               01248000
@NM00054 EQU   APCTZ1+52                                                01249000
@NM00053 EQU   APCTZ1+48                                                01250000
@NM00052 EQU   APCTZ1+44                                                01251000
@NM00051 EQU   APCTZ1+36                                                01252000
@NM00050 EQU   APCTZ1+32                                                01253000
@NM00049 EQU   APCTZ1+16                                                01254000
@NM00048 EQU   APCTZ1+12                                                01255000
@NM00047 EQU   APCTZ+396                                                01256000
@NM00046 EQU   APCTZ+352                                                01257000
@NM00045 EQU   APCTZ+348                                                01258000
@NM00044 EQU   APCTZ+336                                                01259000
@NM00043 EQU   APCTZ+292                                                01260000
APCTZJFA EQU   APCTZ+228                                                01261000
APCTZMBR EQU   APCTZ+100                                                01262000
@NM00042 EQU   APCTZ+20                                                 01263000
CVTLEVL  EQU   CVTRELNO+2                                               01264000
CVTNUMB  EQU   CVTRELNO                                                 01265000
CVTMDL   EQU   CVTFIX+250                                               01266000
@NM00065 EQU   CVTFIX+248                                               01267000
@NM00064 EQU   CVTFIX                                                   01268000
CVTRV482 EQU   CVTXTNT2+128                                             01269000
CVTRV481 EQU   CVTXTNT2+124                                             01270000
CVTRV480 EQU   CVTXTNT2+120                                             01271000
CVTRV479 EQU   CVTXTNT2+118                                             01272000
CVTRV478 EQU   CVTXTNT2+117                                             01273000
CVTRV477 EQU   CVTXTNT2+116                                             01274000
CVTRV476 EQU   CVTXTNT2+115                                             01275000
CVTRV475 EQU   CVTXTNT2+114                                             01276000
CVTRV474 EQU   CVTRV466                                                 01277000
CVTRV473 EQU   CVTRV466                                                 01278000
CVTRV472 EQU   CVTRV466                                                 01279000
CVTRV471 EQU   CVTRV466                                                 01280000
CVTRV470 EQU   CVTRV466                                                 01281000
CVTRV469 EQU   CVTRV466                                                 01282000
CVTRV468 EQU   CVTRV466                                                 01283000
CVTRV467 EQU   CVTRV466                                                 01284000
CVTRV465 EQU   CVTRV457                                                 01285000
CVTRV464 EQU   CVTRV457                                                 01286000
CVTRV463 EQU   CVTRV457                                                 01287000
CVTRV462 EQU   CVTRV457                                                 01288000
CVTRV461 EQU   CVTRV457                                                 01289000
CVTRV460 EQU   CVTRV457                                                 01290000
CVTRV459 EQU   CVTRV457                                                 01291000
CVTRV458 EQU   CVTRV457                                                 01292000
CVTRV456 EQU   CVTXTNT2+108                                             01293000
CVTRV455 EQU   CVTXTNT2+104                                             01294000
CVTRV454 EQU   CVTXTNT2+100                                             01295000
CVTRV453 EQU   CVTXTNT2+96                                              01296000
CVTRV452 EQU   CVTXTNT2+94                                              01297000
CVTRV451 EQU   CVTXTNT2+92                                              01298000
CVTRV450 EQU   CVTXTNT2+90                                              01299000
CVTRV449 EQU   CVTXTNT2+88                                              01300000
CVTRV448 EQU   CVTXTNT2+87                                              01301000
CVTRV447 EQU   CVTXTNT2+86                                              01302000
CVTRV446 EQU   CVTRV438                                                 01303000
CVTRV445 EQU   CVTRV438                                                 01304000
CVTRV444 EQU   CVTRV438                                                 01305000
CVTRV443 EQU   CVTRV438                                                 01306000
CVTRV442 EQU   CVTRV438                                                 01307000
CVTRV441 EQU   CVTRV438                                                 01308000
CVTRV440 EQU   CVTRV438                                                 01309000
CVTRV439 EQU   CVTRV438                                                 01310000
CVTRV437 EQU   CVTRV429                                                 01311000
CVTRV436 EQU   CVTRV429                                                 01312000
CVTRV435 EQU   CVTRV429                                                 01313000
CVTRV434 EQU   CVTRV429                                                 01314000
CVTRV433 EQU   CVTRV429                                                 01315000
CVTRV432 EQU   CVTRV429                                                 01316000
CVTRV431 EQU   CVTRV429                                                 01317000
CVTRV430 EQU   CVTRV429                                                 01318000
CVTRV428 EQU   CVTXTNT2+80                                              01319000
CVTRV427 EQU   CVTXTNT2+76                                              01320000
CVTRV426 EQU   CVTXTNT2+72                                              01321000
CVTRV425 EQU   CVTXTNT2+68                                              01322000
CVTATACT EQU   CVTATCVT                                                 01323000
CVTRV423 EQU   CVTXTNT2+62                                              01324000
CVTRV422 EQU   CVTXTNT2+60                                              01325000
CVTRV421 EQU   CVTXTNT2+58                                              01326000
CVTRV420 EQU   CVTXTNT2+56                                              01327000
CVTRV419 EQU   CVTXTNT2+55                                              01328000
CVTRV418 EQU   CVTXTNT2+54                                              01329000
CVTRV417 EQU   CVTRV409                                                 01330000
CVTRV416 EQU   CVTRV409                                                 01331000
CVTRV415 EQU   CVTRV409                                                 01332000
CVTRV414 EQU   CVTRV409                                                 01333000
CVTRV413 EQU   CVTRV409                                                 01334000
CVTRV412 EQU   CVTRV409                                                 01335000
CVTRV411 EQU   CVTRV409                                                 01336000
CVTRV410 EQU   CVTRV409                                                 01337000
CVTRV408 EQU   CVTRV400                                                 01338000
CVTRV407 EQU   CVTRV400                                                 01339000
CVTRV406 EQU   CVTRV400                                                 01340000
CVTRV405 EQU   CVTRV400                                                 01341000
CVTRV404 EQU   CVTRV400                                                 01342000
CVTRV403 EQU   CVTRV400                                                 01343000
CVTRV402 EQU   CVTRV400                                                 01344000
CVTRV401 EQU   CVTRV400                                                 01345000
CVTICB   EQU   CVTXTNT2+48                                              01346000
CVTSKTA  EQU   CVTXTNT2+44                                              01347000
CVTRSV99 EQU   CVTXTNT2+40                                              01348000
CVTRSV98 EQU   CVTXTNT2+36                                              01349000
CVTRSV97 EQU   CVTXTNT2+34                                              01350000
CVTRSV96 EQU   CVTXTNT2+32                                              01351000
CVTOLTEP EQU   CVTXTNT2+28                                              01352000
CVTQIDA  EQU   CVTQID+1                                                 01353000
CVTRSV95 EQU   CVTQID                                                   01354000
CVTRSV94 EQU   CVTXTNT2+20                                              01355000
CVTRSV93 EQU   CVTXTNT2+16                                              01356000
CVTRSV92 EQU   CVTXTNT2+12                                              01357000
CVTDEBVR EQU   CVTXTNT2+8                                               01358000
CVTRSV91 EQU   CVTXTNT2+6                                               01359000
CVTRSV9H EQU   CVTFLGBT                                                 01360000
CVTRSV9G EQU   CVTFLGBT                                                 01361000
CVTRSV9F EQU   CVTFLGBT                                                 01362000
CVTRSV9E EQU   CVTFLGBT                                                 01363000
CVTRSV9D EQU   CVTFLGBT                                                 01364000
CVTRSV9C EQU   CVTFLGBT                                                 01365000
CVTVME   EQU   CVTFLGBT                                                 01366000
CVTNPE   EQU   CVTFLGBT                                                 01367000
CVTNUCLS EQU   CVTXTNT2+4                                               01368000
CVTDSSVA EQU   CVTDSSV+1                                                01369000
CVTRSV89 EQU   CVTDSSV                                                  01370000
CVTRSV88 EQU   CVTXTNT1+8                                               01371000
CVTRSV87 EQU   CVTXTNT1+4                                               01372000
CVTFACHN EQU   CVTXTNT1                                                 01373000
CVTRV488 EQU   CVTMAP+412                                               01374000
CVTRV487 EQU   CVTMAP+408                                               01375000
CVTRV486 EQU   CVTMAP+404                                               01376000
CVTRV485 EQU   CVTMAP+400                                               01377000
CVTACTAP EQU   CVTMAP+396                                               01378000
CVTAUTH  EQU   CVTMAP+392                                               01379000
CVTATMCA EQU   CVTATMCT+1                                               01380000
CVTATMST EQU   CVTATMCT                                                 01381000
CVTRSV61 EQU   CVTMAP+384                                               01382000
CVTVOLT1 EQU   CVTVOLM1+1                                               01383000
CVTVOLI1 EQU   CVTVOLF1                                                 01384000
CVTSTOA  EQU   CVTMAP+376                                               01385000
CVTRSV58 EQU   CVTMAP+374                                               01386000
CVTRSV57 EQU   CVTMAP+372                                               01387000
CVTDDCE  EQU   CVTMAP+368                                               01388000
CVTPNWFR EQU   CVTMAP+364                                               01389000
CVTSMF   EQU   CVTMAP+360                                               01390000
CVTSULK  EQU   CVTMAP+358                                               01391000
CVTSLKO  EQU   CVTSYSK                                                  01392000
CVTSLKP  EQU   CVTSYSK                                                  01393000
CVTSLKQ  EQU   CVTSYSK                                                  01394000
CVTSLKR  EQU   CVTSYSK                                                  01395000
CVTRSV56 EQU   CVTSYSK                                                  01396000
CVTRSV55 EQU   CVTSYSK                                                  01397000
CVTRSV54 EQU   CVTSYSK                                                  01398000
CVTRSV53 EQU   CVTSYSK                                                  01399000
CVTRSV52 EQU   CVTA1F1                                                  01400000
CVTRSV51 EQU   CVTA1F1                                                  01401000
CVTRSV50 EQU   CVTA1F1                                                  01402000
CVTRSV49 EQU   CVTA1F1                                                  01403000
CVTRSV48 EQU   CVTA1F1                                                  01404000
CVTRSV47 EQU   CVTA1F1                                                  01405000
CVTSRSW  EQU   CVTA1F1                                                  01406000
CVTPFSW  EQU   CVTA1F1                                                  01407000
CVTPCVT  EQU   CVTMAP+352                                               01408000
CVTRSV46 EQU   CVTMAP+344                                               01409000
CVTRSV45 EQU   CVTMAP+340                                               01410000
CVTRSV44 EQU   CVTMAP+338                                               01411000
CVTRSV43 EQU   CVTMAP+336                                               01412000
CVTHJESA EQU   CVTHJES+1                                                01413000
CVTRSV42 EQU   CVTHJES                                                  01414000
CVTEXT2A EQU   CVTEXT2+1                                                01415000
CVTRSV41 EQU   CVTEXT2                                                  01416000
CVTAPFA  EQU   CVTAPF+1                                                 01417000
CVTRSV40 EQU   CVTAPF                                                   01418000
CVTRV518 EQU   CVTINTLA                                                 01419000
CVTRV517 EQU   CVTERPV                                                  01420000
CVTEORM  EQU   CVTMAP+312                                               01421000
CVTMCHPR EQU   CVTMAP+308                                               01422000
CVTTZ    EQU   CVTMAP+304                                               01423000
CVTJEPS  EQU   CVTMAP+300                                               01424000
CVTJESCT EQU   CVTMAP+296                                               01425000
CVTMODE  EQU   CVTMAP+292                                               01426000
CVTPTRV  EQU   CVTMAP+288                                               01427000
CVTREAL  EQU   CVTMAP+284                                               01428000
CVTRSV39 EQU   CVTMAP+280                                               01429000
CVTRSV38 EQU   CVTMAP+276                                               01430000
CVTDMSRA EQU   CVTDMSR+1                                                01431000
CVTRV634 EQU   CVTDMSRF                                                 01432000
CVTRV633 EQU   CVTDMSRF                                                 01433000
CVTRV632 EQU   CVTDMSRF                                                 01434000
CVTRV631 EQU   CVTDMSRF                                                 01435000
CVTRV630 EQU   CVTDMSRF                                                 01436000
CVTRV629 EQU   CVTDMSRF                                                 01437000
CVTUDUMP EQU   CVTDMSRF                                                 01438000
CVTSDUMP EQU   CVTDMSRF                                                 01439000
CVTQMSGA EQU   CVTQMSG+1                                                01440000
CVTRSV36 EQU   CVTQMSG                                                  01441000
CVTAMFF  EQU   CVTMAP+264                                               01442000
CVTPURGA EQU   CVTPURG+1                                                01443000
CVTRSV35 EQU   CVTPURG                                                  01444000
CVTCBSP  EQU   CVTMAP+256                                               01445000
CVTATERA EQU   CVTATER+1                                                01446000
CVTSYST  EQU   CVTATER                                                  01447000
CVTVOLT2 EQU   CVTTAT                                                   01448000
CVTVOLI2 EQU   CVTVOLF2                                                 01449000
CVTAQAVB EQU   CVTAQAVT+1                                               01450000
CVTRSV34 EQU   CVTTCMFG                                                 01451000
CVTRSV33 EQU   CVTTCMFG                                                 01452000
CVTRSV32 EQU   CVTTCMFG                                                 01453000
CVTRSV31 EQU   CVTTCMFG                                                 01454000
CVTRSV30 EQU   CVTTCMFG                                                 01455000
CVTRSV29 EQU   CVTTCMFG                                                 01456000
CVTLDEV  EQU   CVTTCMFG                                                 01457000
CVTTCRDY EQU   CVTTCMFG                                                 01458000
CVTGTFA  EQU   CVTGTF+1                                                 01459000
CVTRSV27 EQU   CVTGTFST                                                 01460000
CVTRNIO  EQU   CVTGTFST                                                 01461000
CVTUSR   EQU   CVTGTFST                                                 01462000
CVTRV318 EQU   CVTFORM                                                  01463000
CVTRV317 EQU   CVTTMODE                                                 01464000
CVTRV316 EQU   CVTSTATE                                                 01465000
CVTRV315 EQU   CVTGTFS                                                  01466000
CVTGTFAV EQU   CVTGTFS                                                  01467000
CVT0SCR1 EQU   CVTMAP+232                                               01468000
CVTRV515 EQU   CVTMAP+228                                               01469000
CVTRMS   EQU   CVTMAP+224                                               01470000
CVTPATCH EQU   CVTMAP+220                                               01471000
CVTTSCE  EQU   CVTMAP+216                                               01472000
CVTLNKSC EQU   CVTMAP+214                                               01473000
CVTQABST EQU   CVTMAP+212                                               01474000
CVTMDLDS EQU   CVTMAP+208                                               01475000
CVTUSER  EQU   CVTMAP+204                                               01476000
CVTABEND EQU   CVTMAP+200                                               01477000
CVTSMCA  EQU   CVTMAP+196                                               01478000
CVTRSV18 EQU   CVTMAP+192                                               01479000
CVTQLPAQ EQU   CVTMAP+188                                               01480000
CVTQCDSR EQU   CVTMAP+184                                               01481000
CVTRSV17 EQU   CVTOPTB                                                  01482000
CVTRSV16 EQU   CVTOPTB                                                  01483000
CVTFP    EQU   CVTOPTB                                                  01484000
CVTAPTHR EQU   CVTOPTB                                                  01485000
CVTNLOG  EQU   CVTOPTB                                                  01486000
CVTTOD   EQU   CVTOPTB                                                  01487000
CVTCTIMS EQU   CVTOPTB                                                  01488000
CVTPROT  EQU   CVTOPTB                                                  01489000
CVTXPFP  EQU   CVTOPTA                                                  01490000
CVTASCII EQU   CVTOPTA                                                  01491000
CVTRSV13 EQU   CVTOPTA                                                  01492000
CVTRSV12 EQU   CVTOPTA                                                  01493000
CVTNIP   EQU   CVTOPTA                                                  01494000
CVTDDR   EQU   CVTOPTA                                                  01495000
CVTAPR   EQU   CVTOPTA                                                  01496000
CVTCCH   EQU   CVTOPTA                                                  01497000
CVTSNCTR EQU   CVTMAP+180                                               01498000
CVTQMWR  EQU   CVTMAP+176                                               01499000
CVTQOCR  EQU   CVTMAP+172                                               01500000
CVT1EF00 EQU   CVTMAP+168                                               01501000
CVTMZ00  EQU   CVTMAP+164                                               01502000
CVTHEAD  EQU   CVTMAP+160                                               01503000
CVTRSV11 EQU   CVTMAP+156                                               01504000
CVT0PT01 EQU   CVTMAP+152                                               01505000
CVTMSER  EQU   CVTMAP+148                                               01506000
CVTRV516 EQU   CVTIERLC                                                 01507000
CVTILCH  EQU   CVTMAP+140                                               01508000
CVT0DS   EQU   CVTMAP+136                                               01509000
CVTFBOSV EQU   CVTMAP+132                                               01510000
CVTNUCB  EQU   CVTMAP+128                                               01511000
CVTIXAVL EQU   CVTMAP+124                                               01512000
CVTIOQET EQU   CVTMAP+120                                               01513000
CVTDCBA  EQU   CVTMAP+117                                               01514000
CVTMVS2  EQU   CVTDCB                                                   01515000
CVT6DAT  EQU   CVTDCB                                                   01516000
CVT4MPS  EQU   CVTDCB                                                   01517000
CVTRSV09 EQU   CVTDCB                                                   01518000
CVT4MS1  EQU   CVTDCB                                                   01519000
CVT2SPS  EQU   CVTDCB                                                   01520000
CVT1SSS  EQU   CVTDCB                                                   01521000
CVTRSV08 EQU   CVTDCB                                                   01522000
CVTSTB   EQU   CVTMAP+112                                               01523000
CVTQTD00 EQU   CVTMAP+108                                               01524000
CVTQTE00 EQU   CVTMAP+104                                               01525000
CVTCUCB  EQU   CVTMAP+100                                               01526000
CVTSJQ   EQU   CVTMAP+96                                                01527000
CVTPBLDL EQU   CVTMAP+92                                                01528000
CVTTPC   EQU   CVTMAP+88                                                01529000
CVTSVDCB EQU   CVTMAP+84                                                01530000
CVTBRET  EQU   CVTMAP+82                                                01531000
CVTEXIT  EQU   CVTMAP+80                                                01532000
CVT0FN00 EQU   CVTMAP+76                                                01533000
CVTDARA  EQU   CVTDAR+1                                                 01534000
CVTRSV07 EQU   CVTFLGS1                                                 01535000
CVTRSV06 EQU   CVTFLGS1                                                 01536000
CVTRSV05 EQU   CVTFLGS1                                                 01537000
CVTRSV04 EQU   CVTFLGS1                                                 01538000
CVTRSV03 EQU   CVTFLGS1                                                 01539000
CVTRSV02 EQU   CVTFLGS1                                                 01540000
CVTRSV01 EQU   CVTFLGS1                                                 01541000
CVTDMPLK EQU   CVTFLGS1                                                 01542000
CVTXITP  EQU   CVTMAP+68                                                01543000
CVTZDTAB EQU   CVTMAP+64                                                01544000
CVTMSLT  EQU   CVTMAP+60                                                01545000
CVTDATE  EQU   CVTMAP+56                                                01546000
CVTBTERM EQU   CVTMAP+52                                                01547000
CVTSYSAD EQU   CVTMAP+48                                                01548000
CVTXTLER EQU   CVTMAP+44                                                01549000
CVTILK2  EQU   CVTMAP+40                                                01550000
CVTILK1  EQU   CVTMAP+36                                                01551000
CVTPRLTV EQU   CVTMAP+32                                                01552000
CVTPCNVT EQU   CVTMAP+28                                                01553000
CVT0VL00 EQU   CVTMAP+24                                                01554000
CVTXAPG  EQU   CVTMAP+20                                                01555000
CVTBUF   EQU   CVTMAP+16                                                01556000
CVTJOB   EQU   CVTMAP+12                                                01557000
CVTLINK  EQU   CVTMAP+8                                                 01558000
CVT0EF00 EQU   CVTMAP+4                                                 01559000
CVT      EQU   CVTMAP                                                   01560000
ECBEVNT  EQU   ECBEXTND                                                 01561000
@NM00063 EQU   ECBEXTND                                                 01562000
@NM00062 EQU   ECBBYTE3                                                 01563000
@NM00061 EQU   ECBEXTBA                                                 01564000
@NM00060 EQU   ECBCC                                                    01565000
ECBWAITB EQU   ECBCC                                                    01566000
SSAGGMSG EQU   SSAGGMBK+2                                               01567000
SSAGGMGL EQU   SSAGGMBK                                                 01568000
SSAGDMSG EQU   SSAGDMBK+2                                               01569000
SSAGDMGL EQU   SSAGDMBK                                                 01570000
SSAGSSCM EQU   SSAGARBK+52                                              01571000
SSAGSSWA EQU   SSAGARBK+48                                              01572000
SSAGJFCB EQU   SSAGARBK+44                                              01573000
SSAGSSNM EQU   SSAGARBK+40                                              01574000
SSAGADSP EQU   SSAGARBK+36                                              01575000
SSAGUNIT EQU   SSAGARBK+32                                              01576000
SSAGSOUT EQU   SSAGARBK+28                                              01577000
SSAGDUMY EQU   SSAGARBK+24                                              01578000
SSAGDISP EQU   SSAGARBK+20                                              01579000
SSAGDDNM EQU   SSAGARBK+16                                              01580000
SSAGNRBP EQU   SSAGARBK+12                                              01581000
@NM00059 EQU   SSAGARBK+10                                              01582000
SSAGDMLN EQU   SSAGARBK+8                                               01583000
SSAGRBIC EQU   SSAGARBK+6                                               01584000
SSAGRBEC EQU   SSAGARBK+4                                               01585000
SSAGRBFL EQU   SSAGARBK+2                                               01586000
SSAGRBLN EQU   SSAGARBK                                                 01587000
SSAGGMLN EQU   SSAGEHDR+20                                              01588000
SSAGJBNM EQU   SSAGEHDR+16                                              01589000
SSAGCNCL EQU   SSAGEHDR+12                                              01590000
SSAGARBP EQU   SSAGEHDR+8                                               01591000
SSAGGPIC EQU   SSAGEHDR+6                                               01592000
SSAGGPEC EQU   SSAGEHDR+4                                               01593000
@NM00058 EQU   SSAGFLGS                                                 01594000
SSAGSMSG EQU   SSAGFLGS                                                 01595000
SSAGWAIT EQU   SSAGFLGS                                                 01596000
SSAGLEN  EQU   SSAGEHDR                                                 01597000
SSOBRETN EQU   SSOB+12                                                  01598000
SSOBSSIB EQU   SSOB+8                                                   01599000
SSOBFUNC EQU   SSOB+6                                                   01600000
SSOBLEN  EQU   SSOB+4                                                   01601000
SSOBID   EQU   SSOB                                                     01602000
APSVWORK EQU   APSV+80                                                  01603000
@NM00057 EQU   APSV+80                                                  01604000
APSVFREE EQU   APSV+76                                                  01605000
APSVAPSM EQU   APSV+72                                                  01606000
APSVRG12 EQU   APSVREGS+56                                              01607000
APSVRG11 EQU   APSVREGS+52                                              01608000
APSVRG10 EQU   APSVREGS+48                                              01609000
APSVRG9  EQU   APSVREGS+44                                              01610000
APSVRG8  EQU   APSVREGS+40                                              01611000
APSVRG7  EQU   APSVREGS+36                                              01612000
APSVRG6  EQU   APSVREGS+32                                              01613000
APSVRG5  EQU   APSVREGS+28                                              01614000
APSVRG4  EQU   APSVREGS+24                                              01615000
APSVRG3  EQU   APSVREGS+20                                              01616000
APSVRG2  EQU   APSVREGS+16                                              01617000
APSVRG1  EQU   APSVREGS+12                                              01618000
APSVRG0  EQU   APSVREGS+8                                               01619000
APSVRG15 EQU   APSVREGS+4                                               01620000
APSVRG14 EQU   APSVREGS                                                 01621000
APSVNEXT EQU   APSV+8                                                   01622000
APSVPREV EQU   APSV+4                                                   01623000
APSVAPSC EQU   APSV                                                     01624000
@NM00041 EQU   APCT+1556                                                01625000
APCTSVCT EQU   APCT+1552                                                01626000
APCTDAVT EQU   APCT+1548                                                01627000
APCTLOGL EQU   APCT+1544                                                01628000
@NM00040 EQU   APCT+1540                                                01629000
APCTDMPU EQU   APCT+1536                                                01630000
APCTDMPM EQU   APCT+1532                                                01631000
APCTNDMP EQU   APCT+1530                                                01632000
APCTASID EQU   APCT+1528                                                01633000
APCTLGPG EQU   APCT+1526                                                01634000
APCTLGLN EQU   APCT+1524                                                01635000
APCTAPVU EQU   APCT+1520                                                01636000
APCTABR  EQU   APCT+1116                                                01637000
APCTLOGD EQU   APCT+1108                                                01638000
APCTDCLD EQU   APCT+1104                                                01639000
APCTIOAP EQU   APCT+1100                                                01640000
@NM00039 EQU   APCT+1080                                                01641000
@NM00038 EQU   APCT+1078                                                01642000
APCTKCAX EQU   APCT+1076                                                01643000
APCTABND EQU   APCT+1072                                                01644000
@NM00037 EQU   APCT+1068                                                01645000
APCTAPIO EQU   APCT+1064                                                01646000
APCTCSCT EQU   APCT+1060                                                01647000
APCTSTDF EQU   APCT+1056                                                01648000
APCTSTMX EQU   APCT+1052                                                01649000
APCTRGMX EQU   APCT+1048                                                01650000
APCTSIZE EQU   APCT+1046                                                01651000
APCTCTUB EQU   APCT+1045                                                01652000
APCTMFID EQU   APCT+1044                                                01653000
APCTMFSZ EQU   APCT+1040                                                01654000
APCTCRTN EQU   APCT+1036                                                01655000
APCTAPCP EQU   APCT+1032                                                01656000
APCTAMNA EQU   APCT+1028                                                01657000
APCTEMNA EQU   APCT+1024                                                01658000
@NM00036 EQU   APCT+1012                                                01659000
@NM00035 EQU   APCT+1008                                                01660000
@NM00034 EQU   APCT+1004                                                01661000
APCTEIPL EQU   APCT+1000                                                01662000
@NM00033 EQU   APCT+996                                                 01663000
@NM00032 EQU   APCT+992                                                 01664000
@NM00031 EQU   APCT+988                                                 01665000
@NM00030 EQU   APCT+984                                                 01666000
@NM00029 EQU   APCT+980                                                 01667000
APCTECPW EQU   APCT+976                                                 01668000
APCTEULD EQU   APCT+972                                                 01669000
APCTECPT EQU   APCT+968                                                 01670000
APCTEALC EQU   APCT+964                                                 01671000
APCTECBL EQU   APCT+960                                                 01672000
APCTECIT EQU   APCT+956                                                 01673000
APCTCQAF EQU   APCTCQAQ                                                 01674000
APCTCQL  EQU   APCTAPCQ+4                                               01675000
APCTCQF  EQU   APCTAPCQ                                                 01676000
APCTCQLK EQU   APCT+940                                                 01677000
@NM00028 EQU   @NM00024+2                                               01678000
@NM00027 EQU   APCTPRSW                                                 01679000
APCTAPST EQU   APCTPRSW                                                 01680000
@NM00026 EQU   APCTPRSW                                                 01681000
@NM00025 EQU   APCTSTAT                                                 01682000
APCTWARM EQU   APCTSTAT                                                 01683000
APCTTERM EQU   APCTSTAT                                                 01684000
APCTHALT EQU   APCTSTAT                                                 01685000
APCTQSCE EQU   APCTSTAT                                                 01686000
APCTSTRT EQU   APCTSTAT                                                 01687000
APCTACT  EQU   APCTSTAT                                                 01688000
@NM00023 EQU   APCT+935                                                 01689000
APCTSOUT EQU   APCT+934                                                 01690000
APCTDAID EQU   APCT+933                                                 01691000
APCTSV34 EQU   APCT+932                                                 01692000
APCTMJOB EQU   APCT+928                                                 01693000
APCTTCB  EQU   APCT+924                                                 01694000
APCTASCB EQU   APCT+920                                                 01695000
APCTDCNW EQU   APCT+918                                                 01696000
APCTDCNR EQU   APCT+916                                                 01697000
@NM00022 EQU   APCT+912                                                 01698000
@NM00021 EQU   APCT+908                                                 01699000
@NM00020 EQU   APCT+904                                                 01700000
@NM00019 EQU   APCT+900                                                 01701000
@NM00018 EQU   APCTERRS+22                                              01702000
APCTERTJ EQU   APCTERRS+20                                              01703000
APCTERTD EQU   APCTERRS+18                                              01704000
APCTERTC EQU   APCTERRS+16                                              01705000
APCTERTB EQU   APCTERRS+14                                              01706000
APCTERTA EQU   APCTERRS+12                                              01707000
APCTERT9 EQU   APCTERRS+10                                              01708000
APCTERT3 EQU   APCTERRS+8                                               01709000
APCTERT2 EQU   APCTERRS+6                                               01710000
APCTERT1 EQU   APCTERRS+4                                               01711000
APCTERT0 EQU   APCTERRS+2                                               01712000
APCTERTT EQU   APCTERRS                                                 01713000
APCTDSAP EQU   APCT+872                                                 01714000
APCTISUB EQU   APCT+868                                                 01715000
APCTUBAP EQU   APCT+864                                                 01716000
APCTAPDS EQU   APCT+860                                                 01717000
APCTUBIC EQU   APCT+856                                                 01718000
APCTUBIS EQU   APCT+852                                                 01719000
APCTAPUB EQU   APCT+848                                                 01720000
APCTUBLK EQU   APCT+844                                                 01721000
APCTBR1A EQU   APCTBR14+2                                               01722000
@NM00017 EQU   APCTBR14                                                 01723000
APCTSMSZ EQU   APCTSMAD+2                                               01724000
@NM00016 EQU   APCTSMAD+1                                               01725000
@NM00015 EQU   APCTSMAD                                                 01726000
APCTSMIS EQU   APCTSMIN+2                                               01727000
@NM00014 EQU   APCTSMIN+1                                               01728000
APCTSMSP EQU   APCTSMIN                                                 01729000
@NM00013 EQU   APCT+30                                                  01730000
APCTLINE EQU   APCT+28                                                  01731000
APCTLBSZ EQU   APCT+24                                                  01732000
APCTREG  EQU   APCT+20                                                  01733000
APCTSSID EQU   APCTENQM+4                                               01734000
@NM00012 EQU   APCTENQM                                                 01735000
APCTSSVT EQU   APCT+8                                                   01736000
APCTUSER EQU   APCT+4                                                   01737000
APCTID   EQU   APCT                                                     01738000
@NM00011 EQU   APAW+68                                                  01739000
LASTARB  EQU   APAW+64                                                  01740000
ALLMSGID EQU   APAW+60                                                  01741000
BSRTOT   EQU   APAW+56                                                  01742000
NUMIER   EQU   APAW+54                                                  01743000
NPNTOT   EQU   APAW+52                                                  01744000
EXITINF3 EQU   EXITINFO+3                                               01745000
EXITINF2 EQU   EXITINFO+2                                               01746000
@NM00010 EQU   EXITINF1                                                 01747000
EXITHOLD EQU   EXITINF1                                                 01748000
EXITCANC EQU   EXITINF1                                                 01749000
EXITCOMM EQU   EXITINF1                                                 01750000
EXITREJ  EQU   EXITINF1                                                 01751000
@NM00009 EQU   EXITINF0                                                 01752000
EXITRCON EQU   EXITINF0                                                 01753000
EXITENRQ EQU   EXITINF0                                                 01754000
EXITALOK EQU   EXITINF0                                                 01755000
EXITIMPS EQU   EXITINF0                                                 01756000
EXITIMPP EQU   EXITINF0                                                 01757000
@NM00008 EQU   APAW+46                                                  01758000
BSAVAIL  EQU   APAW+44                                                  01759000
BSUNLD   EQU   APAW+42                                                  01760000
USCAVAIL EQU   APAW+40                                                  01761000
USCUNLD  EQU   APAW+38                                                  01762000
NUMNTSAT EQU   APAW+36                                                  01763000
NUMALREQ EQU   APAW+32                                                  01764000
@NM00007 EQU   APAW+21                                                  01765000
ALLENQRC EQU   APAW+20                                                  01766000
INITTCB  EQU   APAW+16                                                  01767000
ALLSTART EQU   ALLRSRCE                                                 01768000
ALLAPUB  EQU   ALLRSRCE                                                 01769000
ALLALL   EQU   ALLRSRCE                                                 01770000
ALLSER   EQU   ALLRSRCE                                                 01771000
@NM00006 EQU   ALLSTAT3                                                 01772000
ALLQUE2  EQU   ALLSTAT2                                                 01773000
ALLERRN2 EQU   ALLSTAT2                                                 01774000
ALLMLWTO EQU   ALLSTAT2                                                 01775000
ALLRES   EQU   ALLSTAT2                                                 01776000
ALLQRMV  EQU   ALLSTAT2                                                 01777000
ALLQADD  EQU   ALLSTAT2                                                 01778000
ALLQUE   EQU   ALLSTAT2                                                 01779000
ALLDYN   EQU   ALLSTAT2                                                 01780000
@NM00005 EQU   ALLSTAT1                                                 01781000
ALLMARK  EQU   ALLSTAT1                                                 01782000
ALLINST  EQU   ALLSTAT1                                                 01783000
ALLHOLD  EQU   ALLSTAT1                                                 01784000
ALLNLAA  EQU   ALLSTAT1                                                 01785000
ALLAPDS  EQU   ALLSTAT0                                                 01786000
ALLERREN EQU   ALLSTAT0                                                 01787000
ALLRQVAL EQU   ALLSTAT0                                                 01788000
ALLMONWT EQU   ALLSTAT0                                                 01789000
ALLJCLOK EQU   ALLSTAT0                                                 01790000
ALLMONUP EQU   ALLSTAT0                                                 01791000
ALLWAIT  EQU   ALLSTAT0                                                 01792000
FIRSTARB EQU   APAW+4                                                   01793000
NEXTASCB EQU   TASKINFO+8                                               01794000
CURTCB   EQU   TASKINFO+4                                               01795000
NEXTTCB  EQU   TASKINFO                                                 01796000
@NM00004 EQU   @NM00003                                                 01797000
@NM00089 EQU   PSA+3668                                                 01798000
PSASTAK  EQU   PSA+3072                                                 01799000
@NM00088 EQU   PSA+1048                                                 01800000
PSAUSEND EQU   PSA+1048                                                 01801000
PSARV062 EQU   PSA+1044                                                 01802000
PSACDAL  EQU   PSA+1040                                                 01803000
PSAWTCOD EQU   PSA+1036                                                 01804000
PSAATCVT EQU   PSA+1032                                                 01805000
PSAPCPSW EQU   PSA+1024                                                 01806000
PSAPIR2  EQU   PSA+1020                                                 01807000
PSARV059 EQU   PSA+1018                                                 01808000
PSASVC13 EQU   PSA+1016                                                 01809000
PSALSFCC EQU   PSA+1012                                                 01810000
PSASFACC EQU   PSA+1008                                                 01811000
PSASTOP  EQU   PSA+992                                                  01812000
PSASTART EQU   PSA+976                                                  01813000
PSARSPSW EQU   PSA+968                                                  01814000
PSASRPSW EQU   PSA+960                                                  01815000
PSARV045 EQU   PSA+892                                                  01816000
PSARV044 EQU   PSA+888                                                  01817000
PSARV043 EQU   PSA+884                                                  01818000
PSARV042 EQU   PSA+880                                                  01819000
PSARV041 EQU   PSA+876                                                  01820000
PSARV040 EQU   PSA+872                                                  01821000
PSARV025 EQU   PSA+868                                                  01822000
PSADSSED EQU   PSA+868                                                  01823000
PSADSSPR EQU   PSA+864                                                  01824000
PSADSSFW EQU   PSA+860                                                  01825000
PSADSS14 EQU   PSA+856                                                  01826000
PSADSSPP EQU   PSA+848                                                  01827000
PSADSSRP EQU   PSA+840                                                  01828000
PSADSS05 EQU   PSADSSF4                                                 01829000
PSADSS10 EQU   PSADSSF4                                                 01830000
PSADSSVE EQU   PSADSSF4                                                 01831000
PSADSSDE EQU   PSADSSF4                                                 01832000
PSADSSC0 EQU   PSADSSF4                                                 01833000
PSADSSIE EQU   PSADSSF4                                                 01834000
PSADSS12 EQU   PSADSSF4                                                 01835000
PSADSSRC EQU   PSADSSF4                                                 01836000
PSARV057 EQU   PSADSSF3                                                 01837000
PSARV056 EQU   PSADSSF3                                                 01838000
PSARV055 EQU   PSADSSF3                                                 01839000
PSADSSMC EQU   PSADSSF3                                                 01840000
PSADSSRW EQU   PSADSSF3                                                 01841000
PSADSSNM EQU   PSADSSF3                                                 01842000
PSADSSES EQU   PSADSSF3                                                 01843000
PSADSSGP EQU   PSADSSF3                                                 01844000
PSADSSF2 EQU   PSADSSFL+1                                               01845000
PSADSSPI EQU   PSADSSF1                                                 01846000
PSADSSOI EQU   PSADSSF1                                                 01847000
PSADSSSP EQU   PSADSSF1                                                 01848000
PSADSSTP EQU   PSADSSF1                                                 01849000
PSADSSDW EQU   PSADSSF1                                                 01850000
PSADSSDD EQU   PSADSSF1                                                 01851000
PSADSSDM EQU   PSADSSF1                                                 01852000
PSADSSMV EQU   PSADSSF1                                                 01853000
PSADSSTS EQU   PSA+816                                                  01854000
PSADSSWK EQU   PSA+812                                                  01855000
PSADSSR3 EQU   PSA+808                                                  01856000
PSADSSR2 EQU   PSA+804                                                  01857000
PSADSSRS EQU   PSA+800                                                  01858000
PSASTOR  EQU   PSA+796                                                  01859000
PSACPUSA EQU   PSA+794                                                  01860000
PSAVSTAP EQU   PSA+792                                                  01861000
PSAWKVAP EQU   PSA+788                                                  01862000
PSAWKRAP EQU   PSA+784                                                  01863000
PSAMCHIC EQU   PSA+783                                                  01864000
PSARV061 EQU   PSA+782                                                  01865000
PSASYMSK EQU   PSA+781                                                  01866000
PSAMCHFL EQU   PSA+780                                                  01867000
PSACR0   EQU   PSA+776                                                  01868000
PSAPSWSV EQU   PSA+768                                                  01869000
PSALITA  EQU   PSA+764                                                  01870000
PSACLHS  EQU   PSAHLHI                                                  01871000
PSALKR15 EQU   PSALKSA+60                                               01872000
PSALKR14 EQU   PSALKSA+56                                               01873000
PSALKR13 EQU   PSALKSA+52                                               01874000
PSALKR12 EQU   PSALKSA+48                                               01875000
PSALKR11 EQU   PSALKSA+44                                               01876000
PSALKR10 EQU   PSALKSA+40                                               01877000
PSALKR9  EQU   PSALKSA+36                                               01878000
PSALKR8  EQU   PSALKSA+32                                               01879000
PSALKR7  EQU   PSALKSA+28                                               01880000
PSALKR6  EQU   PSALKSA+24                                               01881000
PSALKR5  EQU   PSALKSA+20                                               01882000
PSALKR4  EQU   PSALKSA+16                                               01883000
PSALKR3  EQU   PSALKSA+12                                               01884000
PSALKR2  EQU   PSALKSA+8                                                01885000
PSALKR1  EQU   PSALKSA+4                                                01886000
PSALKR0  EQU   PSALKSA                                                  01887000
PSARV023 EQU   PSACLHT+52                                               01888000
PSALOCAL EQU   PSACLHT+48                                               01889000
PSACMSL  EQU   PSACLHT+44                                               01890000
PSAOPTL  EQU   PSACLHT+40                                               01891000
PSATPACL EQU   PSACLHT+36                                               01892000
PSATPDNL EQU   PSACLHT+32                                               01893000
PSATPNCL EQU   PSACLHT+28                                               01894000
PSAIOSLL EQU   PSACLHT+24                                               01895000
PSAIOSUL EQU   PSACLHT+20                                               01896000
PSAIOSCL EQU   PSACLHT+16                                               01897000
PSAIOSSL EQU   PSACLHT+12                                               01898000
PSASALCL EQU   PSACLHT+8                                                01899000
PSAASML  EQU   PSACLHT+4                                                01900000
PSADISPL EQU   PSACLHT                                                  01901000
PSASRSA  EQU   PSA+636                                                  01902000
PSARV050 EQU   PSA+634                                                  01903000
PSADSSGO EQU   PSA+633                                                  01904000
PSARECUR EQU   PSA+632                                                  01905000
PSAHLHIS EQU   PSA+628                                                  01906000
PSAIPCSA EQU   PSA+624                                                  01907000
@NM00087 EQU   PSA+621                                                  01908000
PSAIPCDM EQU   PSA+620                                                  01909000
PSAIPCD  EQU   PSA+616                                                  01910000
@NM00086 EQU   PSA+613                                                  01911000
PSAIPCRM EQU   PSA+612                                                  01912000
PSAIPCR  EQU   PSA+608                                                  01913000
PSAMCHEX EQU   PSA+600                                                  01914000
PSAMPSW  EQU   PSA+592                                                  01915000
PSAEXPS2 EQU   PSA+584                                                  01916000
PSAEXPS1 EQU   PSA+576                                                  01917000
PSAPIREG EQU   PSA+572                                                  01918000
PSARSREG EQU   PSA+568                                                  01919000
PSAGPREG EQU   PSA+556                                                  01920000
PSARV022 EQU   PSASUP4                                                  01921000
PSARV021 EQU   PSASUP4                                                  01922000
PSARV020 EQU   PSASUP4                                                  01923000
PSARV019 EQU   PSASUP4                                                  01924000
PSARV018 EQU   PSASUP4                                                  01925000
PSARV017 EQU   PSASUP4                                                  01926000
PSARV016 EQU   PSASUP4                                                  01927000
PSARV015 EQU   PSASUP4                                                  01928000
PSARV014 EQU   PSASUP3                                                  01929000
PSARV013 EQU   PSASUP3                                                  01930000
PSARV012 EQU   PSASUP3                                                  01931000
PSAESTA  EQU   PSASUP3                                                  01932000
PSASPR   EQU   PSASUP3                                                  01933000
PSAPSREG EQU   PSASUP3                                                  01934000
PSAPI2   EQU   PSASUP3                                                  01935000
PSAIOSUP EQU   PSASUP3                                                  01936000
PSALCR   EQU   PSASUP2                                                  01937000
PSARTM   EQU   PSASUP2                                                  01938000
PSAACR   EQU   PSASUP2                                                  01939000
PSAIPCE2 EQU   PSASUP2                                                  01940000
PSAIPCES EQU   PSASUP2                                                  01941000
PSAIPCEC EQU   PSASUP2                                                  01942000
PSAGTF   EQU   PSASUP2                                                  01943000
PSAIPCRI EQU   PSASUP2                                                  01944000
PSATYPE6 EQU   PSASUP1                                                  01945000
PSATCTL  EQU   PSASUP1                                                  01946000
PSADISP  EQU   PSASUP1                                                  01947000
PSALOCK  EQU   PSASUP1                                                  01948000
PSAPI    EQU   PSASUP1                                                  01949000
PSAEXT   EQU   PSASUP1                                                  01950000
PSASVC   EQU   PSASUP1                                                  01951000
PSAIO    EQU   PSASUP1                                                  01952000
PSAAOLD  EQU   PSA+548                                                  01953000
PSAANEW  EQU   PSA+544                                                  01954000
PSATOLD  EQU   PSA+540                                                  01955000
PSATNEW  EQU   PSA+536                                                  01956000
PSALCCAR EQU   PSA+532                                                  01957000
PSALCCAV EQU   PSA+528                                                  01958000
PSAPCCAR EQU   PSA+524                                                  01959000
PSAPCCAV EQU   PSA+520                                                  01960000
PSACPULA EQU   PSA+518                                                  01961000
PSACPUPA EQU   PSA+516                                                  01962000
PSAPSA   EQU   PSA+512                                                  01963000
FLCHDEND EQU   PSA+512                                                  01964000
FLCCRSAV EQU   FLCMCLA+280                                              01965000
FLCGRSAV EQU   FLCMCLA+216                                              01966000
FLCFPSAV EQU   FLCMCLA+184                                              01967000
FLCFLA   EQU   FLCMCLA+88                                               01968000
FLCRGNCD EQU   FLCMCLA+84                                               01969000
FLCFSAA  EQU   FLCFSA+1                                                 01970000
@NM00085 EQU   FLCFSA                                                   01971000
@NM00084 EQU   FLCMCLA+72                                               01972000
FLCMCIC  EQU   FLCMCLA+64                                               01973000
@NM00083 EQU   FLCMCLA+20                                               01974000
FLCIOAA  EQU   FLCIOA+1                                                 01975000
@NM00082 EQU   FLCIOA                                                   01976000
@NM00081 EQU   FLCMCLA+15                                               01977000
@NM00080 EQU   FLCMCLA+14                                               01978000
@NM00079 EQU   FLCMCLA+12                                               01979000
FLCLCL   EQU   FLCMCLA+8                                                01980000
FLCIOELA EQU   FLCIOEL+1                                                01981000
@NM00078 EQU   FLCIOEL                                                  01982000
FLCCHNID EQU   FLCMCLA                                                  01983000
@NM00077 EQU   PSA+160                                                  01984000
FLCMTRCD EQU   PSA+157                                                  01985000
@NM00076 EQU   PSA+156                                                  01986000
FLCPERA  EQU   FLCPER+1                                                 01987000
@NM00075 EQU   FLCPER                                                   01988000
@NM00074 EQU   PSA+151                                                  01989000
FLCPERCD EQU   PSA+150                                                  01990000
FLCMCNUM EQU   PSA+149                                                  01991000
@NM00073 EQU   PSA+148                                                  01992000
FLCTEAA  EQU   FLCTEA+1                                                 01993000
@NM00072 EQU   FLCTEA                                                   01994000
PSAPIPC  EQU   PSAPICOD                                                 01995000
PSAPIMC  EQU   PSAPICOD                                                 01996000
PSAPIPER EQU   PSAPICOD                                                 01997000
PSARV049 EQU   FLCPICOD                                                 01998000
FLCPILCB EQU   FLCPIILC                                                 01999000
@NM00071 EQU   FLCPIILC                                                 02000000
@NM00070 EQU   PSAEPPSW                                                 02001000
FLCSVCN  EQU   PSAESPSW+2                                               02002000
FLCSILCB EQU   FLCSVILC                                                 02003000
@NM00069 EQU   FLCSVILC                                                 02004000
@NM00068 EQU   PSAESPSW                                                 02005000
FLCEICOD EQU   PSAEEPSW+2                                               02006000
PSASPAD  EQU   PSAEEPSW                                                 02007000
@NM00067 EQU   PSA+128                                                  02008000
FLCINPSW EQU   PSA+120                                                  02009000
FLCMNPSW EQU   PSA+112                                                  02010000
FLCPNPSW EQU   PSA+104                                                  02011000
FLCSNPSW EQU   PSA+96                                                   02012000
FLCENPSW EQU   PSA+88                                                   02013000
FLCTRACE EQU   PSA+84                                                   02014000
FLCTIMER EQU   PSA+80                                                   02015000
FLCCVT2  EQU   PSA+76                                                   02016000
FLCCAW   EQU   PSA+72                                                   02017000
FLCCSW   EQU   PSA+64                                                   02018000
FLCIOPSW EQU   PSA+56                                                   02019000
FLCMOPSW EQU   PSA+48                                                   02020000
FLCPOPSW EQU   PSA+40                                                   02021000
FLCSOPSW EQU   PSA+32                                                   02022000
FLCEOPSW EQU   PSA+24                                                   02023000
@NM00066 EQU   FLCICCW2+4                                               02024000
FLCICCW1 EQU   FLCROPSW                                                 02025000
FLCIPPSW EQU   FLCRNPSW                                                 02026000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02027000
@ENDDATA EQU   *                                                        02028000
         END   IGTJHW,(C'PLS2142',0701,77092)                           02029000
