TUDA     TITLE 'IGTUDA - SSCVT LOCATE ROUTINE                          *00001000
                        '                                               00002000
IGTUDA   CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(16)                                          01S0001 00007000
         DC    C'IGTUDA    77.093'                              01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @09,0                                            01S0001 00011000
@PSTART  DS    0H                                               01S0001 00012000
         USING @PSTART,@09                                      01S0001 00013000
         L     @00,@SIZDATD                                     01S0001 00014000
         GETMAIN  R,LV=(0)                                              00015000
         LR    @08,@01                                          01S0001 00016000
         USING @DATD,@08                                        01S0001 00017000
         LM    @00,@01,20(@13)                                  01S0001 00018000
         MVC   @PC00001(4),0(@01)                               01S0001 00019000
*   SSNAME=R1P->SSINPUT;            /* OBTAIN THE SUBSYSTEM NAME TO     00020000
*                                      BE LOCATED IN SSNAME          */ 00021000
         L     SSNAME,SSINPUT(,R1P)                             01S0021 00022000
*   RESPECIFY                                                   01S0022 00023000
*     R1P;                          /* RELEASE R1.                   */ 00024000
*   SSCTPTR=FLCCVT->CVTJESCT->JESSSCT;/* LOAD THE ADDRESS OF THE        00025000
*                                      FIRST SSCVT.                  */ 00026000
         L     @14,FLCCVT                                       01S0023 00027000
         L     @14,CVTJESCT(,@14)                               01S0023 00028000
         L     SSCTPTR,JESSSCT(,@14)                            01S0023 00029000
*   SSLOOP=SSZERO;                  /* INITIALIZE LOOP CONTROL TO       00030000
*                                      FORCE INITIAL SEARCH.         */ 00031000
         SLR   SSLOOP,SSLOOP                                    01S0024 00032000
*   SSRETREG=SSZERO;                /* INITIALIZE TO INDICATE THAT NO   00033000
*                                      SSCVT FOR THIS NAME EXIST     */ 00034000
         SLR   SSRETREG,SSRETREG                                01S0025 00035000
*/*                                                                  */ 00036000
*/* **************************************************************** */ 00037000
*/*                                                                  */ 00038000
*/*   CHECK FOR AT LEAST ONE SUBSYSTEM                               */ 00039000
*/*                                                                  */ 00040000
*/* **************************************************************** */ 00041000
*/*                                                                  */ 00042000
*                                                               01S0026 00043000
*   IF SSCTPTR^=SSZERO THEN         /* AT LEAST ONE SSVCT EXIST.     */ 00044000
         LTR   SSCTPTR,SSCTPTR                                  01S0026 00045000
         BZ    @RF00026                                         01S0026 00046000
*     DO UNTIL SSLOOP=SSTERM;       /* UNTIL NEXT POINTER = ZERO        00047000
*                                      INDICATING THIS IS THE LAST      00048000
*                                      SSCVT, OR A MATCH IS FOUND    */ 00049000
@DL00027 DS    0H                                               01S0028 00050000
*       IF SSNAME=SSCTSNAM THEN     /* COMPARE SEARCH NAME WITH THE     00051000
*                                      NAME IN THE SSCVT.            */ 00052000
         CL    SSNAME,SSCTSNAM(,SSCTPTR)                        01S0028 00053000
         BNE   @RF00028                                         01S0028 00054000
*         DO;                                                   01S0029 00055000
*           SSRETREG=SSCTPTR;       /* A MATCHING SUBSYSTEM NAME HAS    00056000
*                                      BEEN FOUND, AND R15 = THE        00057000
*                                      ADDRESS OF THE SSCVT FOR THAT    00058000
*                                      SUBSYSTEM.                    */ 00059000
         LR    SSRETREG,SSCTPTR                                 01S0030 00060000
*           SSLOOP=SSTERM;          /* TERMINATE SEARCH LOOP         */ 00061000
         LA    SSLOOP,8                                         01S0031 00062000
*         END;                                                  01S0032 00063000
*                                                               01S0032 00064000
*/*                                                                  */ 00065000
*/* **************************************************************** */ 00066000
*/*                                                                  */ 00067000
*/*   IF NOT DETERMINE IF ANY MORE                                   */ 00068000
*/*                                                                  */ 00069000
*/* **************************************************************** */ 00070000
*/*                                                                  */ 00071000
*                                                               01S0033 00072000
*       ELSE                                                    01S0033 00073000
*         DO;                                                   01S0033 00074000
         B     @RC00028                                         01S0033 00075000
@RF00028 DS    0H                                               01S0034 00076000
*           IF SSCTSCTA=SSZERO THEN /* THIS IS THE LAST SSCVT.       */ 00077000
         L     @14,SSCTSCTA(,SSCTPTR)                           01S0034 00078000
         LTR   @14,@14                                          01S0034 00079000
         BNZ   @RF00034                                         01S0034 00080000
*             DO;                                               01S0035 00081000
*               SSLOOP=SSTERM;      /* FORCE TERMINATION OF DO LOOP  */ 00082000
         LA    SSLOOP,8                                         01S0036 00083000
*             END;                                              01S0037 00084000
*           ELSE                                                01S0038 00085000
*             DO;                                               01S0038 00086000
         B     @RC00034                                         01S0038 00087000
@RF00034 DS    0H                                               01S0039 00088000
*               SSCTPTR=SSCTSCTA;   /* OBTAIN POINTER TO THE NEXT       00089000
*                                      SSCVT.                        */ 00090000
         L     SSCTPTR,SSCTSCTA(,SSCTPTR)                       01S0039 00091000
*             END;                                              01S0040 00092000
*         END;                                                  01S0041 00093000
@RC00034 DS    0H                                               01S0042 00094000
*     END;                                                      01S0042 00095000
*                                                               01S0042 00096000
@RC00028 DS    0H                                               01S0042 00097000
@DE00027 C     SSLOOP,@CF00043                                  01S0042 00098000
         BNE   @DL00027                                         01S0042 00099000
*/*                                                                  */ 00100000
*/* **************************************************************** */ 00101000
*/*                                                                  */ 00102000
*/*   RETURN TO CALLER                                               */ 00103000
*/*                                                                  */ 00104000
*/* **************************************************************** */ 00105000
*/*                                                                  */ 00106000
*                                                               01S0043 00107000
*   RETURN CODE(SSRETREG);          /* RETURN TO CALLING ROUTINE     */ 00108000
@RF00026 LR    @12,@15                                          01S0043 00109000
         L     @00,@SIZDATD                                     01S0043 00110000
         LR    @01,@08                                          01S0043 00111000
         FREEMAIN R,LV=(0),A=(1)                                        00112000
         LR    @15,@12                                          01S0043 00113000
         L     @14,12(,@13)                                     01S0043 00114000
         LM    @00,@12,20(@13)                                  01S0043 00115000
         BR    @14                                              01S0043 00116000
         EJECT                                                          00117000
*                                                               01S0044 00118000
*/*                                                                  */ 00119000
*/* **************************************************************** */ 00120000
*/*                                                                  */ 00121000
*/*   MODULE PATCH AREA                                              */ 00122000
*/*                                                                  */ 00123000
*/* **************************************************************** */ 00124000
*/*                                                                  */ 00125000
*                                                               01S0044 00126000
*   DECLARE                                                     01S0044 00127000
*     ZAPPATCH CHAR(*)              /* MODULE PATCH AREA             */ 00128000
*         INTERNAL STATIC LOCAL GENERATED;                      01S0044 00129000
*   GENERATE DATA DEFS(ZAPPATCH);                               01S0045 00130000
*                                                               01S0045 00131000
*/*                                                                  */ 00132000
*/* **************************************************************** */ 00133000
*/*                                                                  */ 00134000
*/*   REGISTER DECLARATIONS                                          */ 00135000
*/*                                                                  */ 00136000
*/* **************************************************************** */ 00137000
*/*                                                                  */ 00138000
*                                                               01S0046 00139000
*   DECLARE                                                     01S0046 00140000
*     R1P REG(1),                   /* GENERAL REGISTER ONE - ADDRESS   00141000
*                                      OF THE SUBSYSTEM NAME TO BE      00142000
*                                      SEARCHED FOR ON THE SSCVT        00143000
*                                      CHAIN (INPUT)                 */ 00144000
*     SSDATA REG(08)                /* POINTER TO APNP.              */ 00145000
*         RSTD,                                                 01S0046 00146000
*     SSCODE REG(09)                /* BASE REGISTER FOR THIS MODULE */ 00147000
*         RSTD,                                                 01S0046 00148000
*     SSLOOP REG(10)                /* LOOP CONTROL REGISTER         */ 00149000
*         RSTD,                                                 01S0046 00150000
*     SSNAME REG(11)                /* SUBSYSTEM SEARCH NAME         */ 00151000
*         RSTD,                                                 01S0046 00152000
*     SSRETREG REG(15);             /* GENERAL REGISTER FIFTEEN -       00153000
*                                      ADDRESS OF THE SSCVT IF FOUND    00154000
*                                      (OUTPUT) OR - ZEROS IF THE       00155000
*                                      SSCVT WAS NOT FOUND (OUTPUT)  */ 00156000
*   END IGTUDA                                                  01S0047 00157000
*                                                               01S0047 00158000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00159000
*/*%INCLUDE SYSLIB  (IGTXSYSI)                                       */ 00160000
*/*%INCLUDE SYSLIB  (IEFJESCT)                                       */ 00161000
*/*%INCLUDE SYSLIB  (IEFJSCVT)                                       */ 00162000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00163000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00164000
*                                                               01S0047 00165000
*       ;                                                       01S0047 00166000
@EL00001 DS    0H                                               01S0047 00167000
@EF00001 L     @00,@SIZDATD                                     01S0047 00168000
         LR    @01,@08                                          01S0047 00169000
         FREEMAIN R,LV=(0),A=(1)                                        00170000
@ER00001 LM    @14,@12,12(@13)                                  01S0047 00171000
         BR    @14                                              01S0047 00172000
@DATA    DS    0H                                                       00173000
@DATD    DSECT                                                          00174000
         DS    0F                                                       00175000
@PC00001 DS    1F                                                       00176000
IGTUDA   CSECT                                                          00177000
         DS    0F                                                       00178000
@CF00043 DC    F'8'                                                     00179000
@DATD    DSECT                                                          00180000
         DS    0D                                                       00181000
CVTPTR   DS    A                                                        00182000
IGTUDA   CSECT                                                          00183000
         DS    0F                                                       00184000
@SIZDATD DC    AL1(0)                                                   00185000
         DC    AL3(@ENDDATD-@DATD)                                      00186000
         DS    0D                                                       00187000
IGTUDA   CSECT                                                          00188000
*                                   /*                                  00189000
ZAPPATCH DS     0D                                                      00190000
         DC     50X'00'                                                 00191000
@DATD    DSECT                                                          00192000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00193000
@ENDDATD EQU   *                                                        00194000
IGTUDA   CSECT                                                          00195000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00196000
@01      EQU   01                                                       00197000
@02      EQU   02                                                       00198000
@03      EQU   03                                                       00199000
@04      EQU   04                                                       00200000
@05      EQU   05                                                       00201000
@06      EQU   06                                                       00202000
@07      EQU   07                                                       00203000
@08      EQU   08                                                       00204000
@09      EQU   09                                                       00205000
@10      EQU   10                                                       00206000
@11      EQU   11                                                       00207000
@12      EQU   12                                                       00208000
@13      EQU   13                                                       00209000
@14      EQU   14                                                       00210000
@15      EQU   15                                                       00211000
SSCTPTR  EQU   @05                                                      00212000
SSDATA   EQU   @08                                                      00213000
SSCODE   EQU   @09                                                      00214000
SSRETREG EQU   @15                                                      00215000
R1P      EQU   @01                                                      00216000
SSNAME   EQU   @11                                                      00217000
SSLOOP   EQU   @10                                                      00218000
PSA      EQU   0                                                        00219000
FLCRNPSW EQU   PSA                                                      00220000
FLCROPSW EQU   PSA+8                                                    00221000
FLCICCW2 EQU   PSA+16                                                   00222000
FLCCVT   EQU   FLCICCW2                                                 00223000
PSAEEPSW EQU   PSA+132                                                  00224000
PSAESPSW EQU   PSA+136                                                  00225000
FLCSVILC EQU   PSAESPSW+1                                               00226000
PSAEPPSW EQU   PSA+140                                                  00227000
FLCPIILC EQU   PSAEPPSW+1                                               00228000
FLCPICOD EQU   PSAEPPSW+2                                               00229000
PSAPICOD EQU   FLCPICOD+1                                               00230000
FLCTEA   EQU   PSAEPPSW+4                                               00231000
FLCPER   EQU   PSA+152                                                  00232000
FLCMCLA  EQU   PSA+168                                                  00233000
FLCIOEL  EQU   FLCMCLA+4                                                00234000
FLCIOA   EQU   FLCMCLA+16                                               00235000
FLCFSA   EQU   FLCMCLA+80                                               00236000
PSASUPER EQU   PSA+552                                                  00237000
PSASUP1  EQU   PSASUPER                                                 00238000
PSASUP2  EQU   PSASUPER+1                                               00239000
PSASUP3  EQU   PSASUPER+2                                               00240000
PSASUP4  EQU   PSASUPER+3                                               00241000
PSACLHT  EQU   PSA+640                                                  00242000
PSALKSA  EQU   PSA+696                                                  00243000
PSAHLHI  EQU   PSA+760                                                  00244000
PSADSSFL EQU   PSA+836                                                  00245000
PSADSSF1 EQU   PSADSSFL                                                 00246000
PSADSSF3 EQU   PSADSSFL+2                                               00247000
PSADSSF4 EQU   PSADSSFL+3                                               00248000
PSARSVT  EQU   PSA+896                                                  00249000
SSINPUT  EQU   0                                                        00250000
JESCT    EQU   0                                                        00251000
JESWAA   EQU   JESCT+8                                                  00252000
JESSSREQ EQU   JESCT+20                                                 00253000
JESSSCT  EQU   JESCT+24                                                 00254000
JESALLOC EQU   JESCT+32                                                 00255000
JESUNALC EQU   JESCT+36                                                 00256000
JESCATL  EQU   JESCT+40                                                 00257000
SSCT     EQU   0                                                        00258000
SSCTSCTA EQU   SSCT+4                                                   00259000
SSCTSNAM EQU   SSCT+8                                                   00260000
SSCTFLG1 EQU   SSCT+12                                                  00261000
CVTMAP   EQU   0                                                        00262000
CVTDAR   EQU   CVTMAP+72                                                00263000
CVTFLGS1 EQU   CVTDAR                                                   00264000
CVTDCB   EQU   CVTMAP+116                                               00265000
CVTIERLC EQU   CVTMAP+144                                               00266000
CVTOPTA  EQU   CVTMAP+182                                               00267000
CVTOPTB  EQU   CVTMAP+183                                               00268000
CVTGTF   EQU   CVTMAP+236                                               00269000
CVTGTFST EQU   CVTGTF                                                   00270000
CVTGTFS  EQU   CVTGTFST                                                 00271000
CVTSTATE EQU   CVTGTFST                                                 00272000
CVTTMODE EQU   CVTGTFST                                                 00273000
CVTFORM  EQU   CVTGTFST                                                 00274000
CVTAQAVT EQU   CVTMAP+240                                               00275000
CVTTCMFG EQU   CVTAQAVT                                                 00276000
CVTVOLM2 EQU   CVTMAP+244                                               00277000
CVTTATA  EQU   CVTVOLM2                                                 00278000
CVTTSKS  EQU   CVTTATA                                                  00279000
CVTVOLF2 EQU   CVTTSKS                                                  00280000
CVTTAT   EQU   CVTTATA+1                                                00281000
CVTATER  EQU   CVTMAP+248                                               00282000
CVTEXT1  EQU   CVTMAP+252                                               00283000
CVTPURG  EQU   CVTMAP+260                                               00284000
CVTQMSG  EQU   CVTMAP+268                                               00285000
CVTDMSR  EQU   CVTMAP+272                                               00286000
CVTRSV37 EQU   CVTDMSR                                                  00287000
CVTDMSRF EQU   CVTRSV37                                                 00288000
CVTJESCT EQU   CVTMAP+296                                               00289000
CVTERPV  EQU   CVTMAP+316                                               00290000
CVTINTLA EQU   CVTMAP+320                                               00291000
CVTAPF   EQU   CVTMAP+324                                               00292000
CVTEXT2  EQU   CVTMAP+328                                               00293000
CVTHJES  EQU   CVTMAP+332                                               00294000
CVTPGSIA EQU   CVTMAP+348                                               00295000
CVTA1F1  EQU   CVTMAP+356                                               00296000
CVTSYSK  EQU   CVTMAP+357                                               00297000
CVTVOLM1 EQU   CVTMAP+380                                               00298000
CVTVOLF1 EQU   CVTVOLM1                                                 00299000
CVTATMCT EQU   CVTMAP+388                                               00300000
CVTXTNT1 EQU   0                                                        00301000
CVTXTNT2 EQU   0                                                        00302000
CVTDSSV  EQU   CVTXTNT2                                                 00303000
CVTFLGBT EQU   CVTXTNT2+5                                               00304000
CVTQID   EQU   CVTXTNT2+24                                              00305000
CVTRV400 EQU   CVTXTNT2+52                                              00306000
CVTRV409 EQU   CVTXTNT2+53                                              00307000
CVTATCVT EQU   CVTXTNT2+64                                              00308000
CVTRV429 EQU   CVTXTNT2+84                                              00309000
CVTRV438 EQU   CVTXTNT2+85                                              00310000
CVTRV457 EQU   CVTXTNT2+112                                             00311000
CVTRV466 EQU   CVTXTNT2+113                                             00312000
CVTFIX   EQU   0                                                        00313000
CVTRELNO EQU   CVTFIX+252                                               00314000
IEFAB4F5 EQU   0                                                        00315000
IEFBB410 EQU   0                                                        00316000
IEFW21SD EQU   0                                                        00317000
SSFLCPTR EQU   0                                                        00318000
SSREQ    EQU   0                                                        00319000
SWAMGR   EQU   0                                                        00320000
SSPARM   EQU   0                                                        00321000
CVTS01   EQU   CVTPGSIA                                                 00322000
CVTLPDIA EQU   CVTS01+12                                                00323000
CVTDIRST EQU   CVTLPDIA                                                 00324000
CVTSLIDA EQU   CVTS01+24                                                00325000
CVTCTLFG EQU   CVTS01+50                                                00326000
CVTRV210 EQU   CVTS01+424                                               00327000
CVTRV219 EQU   CVTS01+425                                               00328000
CVTRV228 EQU   CVTS01+426                                               00329000
CVTRV237 EQU   CVTS01+427                                               00330000
CVTMFRTR EQU   CVTS01+452                                               00331000
CVTRV262 EQU   CVTS01+468                                               00332000
CVTRV271 EQU   CVTS01+469                                               00333000
CVTRV280 EQU   CVTS01+470                                               00334000
CVTRV289 EQU   CVTS01+471                                               00335000
CVTGSDA  EQU   CVTS01+600                                               00336000
PSARSVTE EQU   PSARSVT                                                  00337000
FLC      EQU   PSA                                                      00338000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00339000
PSARSAV  EQU   PSARSVTE+60                                              00340000
PSARSTK  EQU   PSARSVTE+56                                              00341000
PSAESAV3 EQU   PSARSVTE+52                                              00342000
PSAESTK3 EQU   PSARSVTE+48                                              00343000
PSAESAV2 EQU   PSARSVTE+44                                              00344000
PSAESTK2 EQU   PSARSVTE+40                                              00345000
PSAESAV1 EQU   PSARSVTE+36                                              00346000
PSAESTK1 EQU   PSARSVTE+32                                              00347000
PSAPSAV  EQU   PSARSVTE+28                                              00348000
PSAPSTK  EQU   PSARSVTE+24                                              00349000
PSAMSAV  EQU   PSARSVTE+20                                              00350000
PSAMSTK  EQU   PSARSVTE+16                                              00351000
PSASSAV  EQU   PSARSVTE+12                                              00352000
PSASSTK  EQU   PSARSVTE+8                                               00353000
PSANSTK  EQU   PSARSVTE+4                                               00354000
PSACSTK  EQU   PSARSVTE                                                 00355000
CVTRV628 EQU   CVTS01+728                                               00356000
CVTRV627 EQU   CVTS01+724                                               00357000
CVTRV626 EQU   CVTS01+720                                               00358000
CVTRV625 EQU   CVTS01+716                                               00359000
CVTRV624 EQU   CVTS01+712                                               00360000
CVTRV623 EQU   CVTS01+708                                               00361000
CVTRV622 EQU   CVTS01+704                                               00362000
CVTRV621 EQU   CVTS01+700                                               00363000
CVTIHASU EQU   CVTS01+696                                               00364000
CVTSUSP  EQU   CVTS01+692                                               00365000
CVTT6SVC EQU   CVTS01+688                                               00366000
CVTCDAL  EQU   CVTS01+684                                               00367000
CVTTCTL  EQU   CVTS01+680                                               00368000
CVTRSUME EQU   CVTS01+676                                               00369000
CVTJTERM EQU   CVTS01+672                                               00370000
CVTASMRM EQU   CVTS01+668                                               00371000
CVTTCASP EQU   CVTS01+664                                               00372000
CVT0PT03 EQU   CVTS01+660                                               00373000
CVT0PT0E EQU   CVTS01+656                                               00374000
CVTRV609 EQU   CVTS01+652                                               00375000
CVTCGK   EQU   CVTS01+648                                               00376000
CVTRAC   EQU   CVTS01+644                                               00377000
CVTRV606 EQU   CVTS01+640                                               00378000
CVTRV605 EQU   CVTS01+636                                               00379000
CVTRV604 EQU   CVTS01+632                                               00380000
CVTEFF02 EQU   CVTS01+628                                               00381000
CVTCBBR  EQU   CVTS01+624                                               00382000
CVTSSCR  EQU   CVTS01+620                                               00383000
CVTEVENT EQU   CVTS01+616                                               00384000
CVTCRCA  EQU   CVTS01+612                                               00385000
CVTTPIO  EQU   CVTS01+608                                               00386000
CVTADV   EQU   CVTS01+604                                               00387000
CVTGSDAB EQU   CVTGSDA                                                  00388000
CVTQV3   EQU   CVTS01+596                                               00389000
CVTQV2   EQU   CVTS01+592                                               00390000
CVTQV1   EQU   CVTS01+588                                               00391000
CVTRPT   EQU   CVTS01+584                                               00392000
CVTSSRB  EQU   CVTS01+580                                               00393000
CVTCSDRL EQU   CVTS01+576                                               00394000
CVTEXP1  EQU   CVTS01+572                                               00395000
CVTRMPMT EQU   CVTS01+568                                               00396000
CVTRMPTT EQU   CVTS01+564                                               00397000
CVTVPSA  EQU   CVTS01+560                                               00398000
CVTVSTOP EQU   CVTS01+556                                               00399000
CVTGTFR8 EQU   CVTS01+552                                               00400000
CVTQUIT  EQU   CVTS01+548                                               00401000
CVTVACR  EQU   CVTS01+544                                               00402000
CVTWTCB  EQU   CVTS01+540                                               00403000
CVTSTPRS EQU   CVTS01+536                                               00404000
CVT0PT02 EQU   CVTS01+532                                               00405000
CVTDARCM EQU   CVTS01+528                                               00406000
CVTIRECM EQU   CVTS01+524                                               00407000
CVTJRECM EQU   CVTS01+520                                               00408000
CVTVEMS0 EQU   CVTS01+516                                               00409000
CVTSPFRR EQU   CVTS01+512                                               00410000
CVTRLSTG EQU   CVTS01+508                                               00411000
CVT0TC0A EQU   CVTS01+504                                               00412000
CVTGMBR  EQU   CVTS01+500                                               00413000
CVTLFRM  EQU   CVTS01+496                                               00414000
CVTRMBR  EQU   CVTS01+492                                               00415000
CVTVIOP  EQU   CVTS01+488                                               00416000
CVTRV307 EQU   CVTS01+486                                               00417000
CVTRV306 EQU   CVTS01+484                                               00418000
CVTRV305 EQU   CVTS01+482                                               00419000
CVTRV304 EQU   CVTS01+480                                               00420000
CVTRV303 EQU   CVTS01+478                                               00421000
CVTRV302 EQU   CVTS01+476                                               00422000
CVTTRCA  EQU   CVTS01+472                                               00423000
CVTRV297 EQU   CVTRV289                                                 00424000
CVTRV296 EQU   CVTRV289                                                 00425000
CVTRV295 EQU   CVTRV289                                                 00426000
CVTRV294 EQU   CVTRV289                                                 00427000
CVTRV293 EQU   CVTRV289                                                 00428000
CVTRV292 EQU   CVTRV289                                                 00429000
CVTRV291 EQU   CVTRV289                                                 00430000
CVTRV290 EQU   CVTRV289                                                 00431000
CVTRV288 EQU   CVTRV280                                                 00432000
CVTRV287 EQU   CVTRV280                                                 00433000
CVTRV286 EQU   CVTRV280                                                 00434000
CVTRV285 EQU   CVTRV280                                                 00435000
CVTRV284 EQU   CVTRV280                                                 00436000
CVTRV283 EQU   CVTRV280                                                 00437000
CVTRV282 EQU   CVTRV280                                                 00438000
CVTRV281 EQU   CVTRV280                                                 00439000
CVTRV279 EQU   CVTRV271                                                 00440000
CVTRV278 EQU   CVTRV271                                                 00441000
CVTRV277 EQU   CVTRV271                                                 00442000
CVTRV276 EQU   CVTRV271                                                 00443000
CVTRV275 EQU   CVTRV271                                                 00444000
CVTRV274 EQU   CVTRV271                                                 00445000
CVTRV273 EQU   CVTRV271                                                 00446000
CVTRV272 EQU   CVTRV271                                                 00447000
CVTRV270 EQU   CVTRV262                                                 00448000
CVTRV269 EQU   CVTRV262                                                 00449000
CVTRV268 EQU   CVTRV262                                                 00450000
CVTRV267 EQU   CVTRV262                                                 00451000
CVTRV266 EQU   CVTRV262                                                 00452000
CVTRV265 EQU   CVTRV262                                                 00453000
CVTRV264 EQU   CVTRV262                                                 00454000
CVTRV263 EQU   CVTRV262                                                 00455000
CVTVFP   EQU   CVTS01+464                                               00456000
CVTVSI   EQU   CVTS01+460                                               00457000
CVTVPSIB EQU   CVTS01+456                                               00458000
CVTMFACT EQU   CVTMFRTR                                                 00459000
CVTMFCTL EQU   CVTS01+448                                               00460000
CVTPVBP  EQU   CVTS01+444                                               00461000
CVTPWI   EQU   CVTS01+440                                               00462000
CVTRV254 EQU   CVTS01+438                                               00463000
CVTRV253 EQU   CVTS01+436                                               00464000
CVTRV252 EQU   CVTS01+434                                               00465000
CVTRV251 EQU   CVTS01+433                                               00466000
CVTRV250 EQU   CVTS01+432                                               00467000
CVTRV249 EQU   CVTS01+431                                               00468000
CVTRV248 EQU   CVTS01+430                                               00469000
CVTRV247 EQU   CVTS01+429                                               00470000
CVTRV246 EQU   CVTS01+428                                               00471000
CVTRV245 EQU   CVTRV237                                                 00472000
CVTRV244 EQU   CVTRV237                                                 00473000
CVTRV243 EQU   CVTRV237                                                 00474000
CVTRV242 EQU   CVTRV237                                                 00475000
CVTRV241 EQU   CVTRV237                                                 00476000
CVTRV240 EQU   CVTRV237                                                 00477000
CVTRV239 EQU   CVTRV237                                                 00478000
CVTRV238 EQU   CVTRV237                                                 00479000
CVTRV236 EQU   CVTRV228                                                 00480000
CVTRV235 EQU   CVTRV228                                                 00481000
CVTRV234 EQU   CVTRV228                                                 00482000
CVTRV233 EQU   CVTRV228                                                 00483000
CVTRV232 EQU   CVTRV228                                                 00484000
CVTRV231 EQU   CVTRV228                                                 00485000
CVTRV230 EQU   CVTRV228                                                 00486000
CVTRV229 EQU   CVTRV228                                                 00487000
CVTRV227 EQU   CVTRV219                                                 00488000
CVTRV226 EQU   CVTRV219                                                 00489000
CVTRV225 EQU   CVTRV219                                                 00490000
CVTRV224 EQU   CVTRV219                                                 00491000
CVTRV223 EQU   CVTRV219                                                 00492000
CVTRV222 EQU   CVTRV219                                                 00493000
CVTRV221 EQU   CVTRV219                                                 00494000
CVTRV220 EQU   CVTRV219                                                 00495000
CVTRV218 EQU   CVTRV210                                                 00496000
CVTRV217 EQU   CVTRV210                                                 00497000
CVTRV216 EQU   CVTRV210                                                 00498000
CVTRV215 EQU   CVTRV210                                                 00499000
CVTRV214 EQU   CVTRV210                                                 00500000
CVTRV213 EQU   CVTRV210                                                 00501000
CVTRV212 EQU   CVTRV210                                                 00502000
CVTRV211 EQU   CVTRV210                                                 00503000
CVTLCCAT EQU   CVTS01+420                                               00504000
CVTPCCAT EQU   CVTS01+416                                               00505000
CVTIPCRP EQU   CVTS01+412                                               00506000
CVTIPCRI EQU   CVTS01+408                                               00507000
CVTIPCDS EQU   CVTS01+404                                               00508000
CVTAIDVT EQU   CVTS01+400                                               00509000
CVTSSAP  EQU   CVTS01+396                                               00510000
CVTEHCIR EQU   CVTS01+392                                               00511000
CVTEHDEF EQU   CVTS01+388                                               00512000
CVTDAIR  EQU   CVTS01+384                                               00513000
CVTPERFM EQU   CVTS01+380                                               00514000
CVT044R2 EQU   CVTS01+376                                               00515000
CVTFETCH EQU   CVTS01+372                                               00516000
CVTRSTWD EQU   CVTS01+368                                               00517000
CVTSPOST EQU   CVTS01+364                                               00518000
CVTIOBP  EQU   CVTS01+360                                               00519000
CVTASMVT EQU   CVTS01+356                                               00520000
CVTRECRQ EQU   CVTS01+352                                               00521000
CVTWSAC  EQU   CVTS01+348                                               00522000
CVTRV149 EQU   CVTS01+344                                               00523000
CVTWSAL  EQU   CVTS01+340                                               00524000
CVTSPSA  EQU   CVTS01+336                                               00525000
CVTGLMN  EQU   CVTS01+332                                               00526000
CVTVEAC0 EQU   CVTS01+328                                               00527000
CVT062R1 EQU   CVTS01+324                                               00528000
CVTRPOST EQU   CVTS01+320                                               00529000
CVTDQIQE EQU   CVTS01+316                                               00530000
CVTCSD   EQU   CVTS01+312                                               00531000
CVTLKRMA EQU   CVTS01+308                                               00532000
CVTRSPIE EQU   CVTS01+304                                               00533000
CVTRENQ  EQU   CVTS01+300                                               00534000
CVTLQCB  EQU   CVTS01+296                                               00535000
CVTFQCB  EQU   CVTS01+292                                               00536000
CVTQCS01 EQU   CVTS01+288                                               00537000
CVTAPFT  EQU   CVTS01+284                                               00538000
CVTPARRL EQU   CVTS01+280                                               00539000
CVTVWAIT EQU   CVTS01+276                                               00540000
CVTGSPL  EQU   CVTS01+272                                               00541000
CVTLSMQ  EQU   CVTS01+268                                               00542000
CVTGSMQ  EQU   CVTS01+264                                               00543000
CVTEXPRO EQU   CVTS01+260                                               00544000
CVTOPCTP EQU   CVTS01+256                                               00545000
CVTSIC   EQU   CVTS01+252                                               00546000
CVTTPIOS EQU   CVTS01+248                                               00547000
CVTRTMS  EQU   CVTS01+244                                               00548000
CVTSDBF  EQU   CVTS01+240                                               00549000
CVTSCBP  EQU   CVTS01+236                                               00550000
CVTSDMP  EQU   CVTS01+232                                               00551000
CVTSV60  EQU   CVTS01+228                                               00552000
CVTRTMCT EQU   CVTS01+224                                               00553000
CVTASCBL EQU   CVTS01+220                                               00554000
CVTASCBH EQU   CVTS01+216                                               00555000
CVTGDA   EQU   CVTS01+212                                               00556000
CVTASVT  EQU   CVTS01+208                                               00557000
CVTVVMDI EQU   CVTS01+204                                               00558000
CVTAQTOP EQU   CVTS01+200                                               00559000
CVTIOSCS EQU   CVTS01+196                                               00560000
CVTSDRM  EQU   CVTS01+192                                               00561000
CVTOPTE  EQU   CVTS01+188                                               00562000
CVTSTXU  EQU   CVTS01+184                                               00563000
CVTQUIS  EQU   CVTS01+180                                               00564000
CVTPARS  EQU   CVTS01+176                                               00565000
CVTS1EE  EQU   CVTS01+172                                               00566000
CVTFRAS  EQU   CVTS01+168                                               00567000
CVTQSAS  EQU   CVTS01+164                                               00568000
CVTCRAS  EQU   CVTS01+160                                               00569000
CVTCRMN  EQU   CVTS01+156                                               00570000
CVTDELCP EQU   CVTS01+152                                               00571000
CVTFRECL EQU   CVTS01+148                                               00572000
CVTGETCL EQU   CVTS01+144                                               00573000
CVTBLDCP EQU   CVTS01+140                                               00574000
CVTAUTHL EQU   CVTS01+136                                               00575000
CVTSCAN  EQU   CVTS01+132                                               00576000
CVTRV144 EQU   CVTS01+130                                               00577000
CVTMAXMP EQU   CVTS01+128                                               00578000
CVTSTCK  EQU   CVTS01+124                                               00579000
CVTRV139 EQU   CVTS01+123                                               00580000
CVTDSSAC EQU   CVTS01+122                                               00581000
CVTRV513 EQU   CVTS01+121                                               00582000
CVTIOSPL EQU   CVTS01+120                                               00583000
CVTPTGT  EQU   CVTS01+116                                               00584000
CVTCSPIE EQU   CVTS01+112                                               00585000
CVTSMFEX EQU   CVTS01+108                                               00586000
CVTOLT0A EQU   CVTS01+104                                               00587000
CVTSRBRT EQU   CVTS01+100                                               00588000
CVTPUTL  EQU   CVTS01+96                                                00589000
CVTASCRL EQU   CVTS01+92                                                00590000
CVTASCRF EQU   CVTS01+88                                                00591000
CVTRV326 EQU   CVTS01+84                                                00592000
CVTRV325 EQU   CVTS01+80                                                00593000
CVTRV324 EQU   CVTS01+76                                                00594000
CVT0VL01 EQU   CVTS01+72                                                00595000
CVTSHRVM EQU   CVTS01+68                                                00596000
CVTRV332 EQU   CVTS01+64                                                00597000
CVTTAS   EQU   CVTS01+60                                                00598000
CVTRSCN  EQU   CVTS01+56                                                00599000
CVTTRAC2 EQU   CVTS01+54                                                00600000
CVTTRACE EQU   CVTS01+52                                                00601000
CVTAPG   EQU   CVTS01+51                                                00602000
CVTSDTRC EQU   CVTCTLFG                                                 00603000
CVTGTRCE EQU   CVTCTLFG                                                 00604000
CVTNOMP  EQU   CVTCTLFG                                                 00605000
CVTRSV79 EQU   CVTCTLFG                                                 00606000
CVTDSTAT EQU   CVTCTLFG                                                 00607000
CVTRSV78 EQU   CVTCTLFG                                                 00608000
CVTRV333 EQU   CVTCTLFG                                                 00609000
CVTRV323 EQU   CVTCTLFG                                                 00610000
CVTSPVLK EQU   CVTS01+49                                                00611000
CVTRSV77 EQU   CVTS01+48                                                00612000
CVTRV331 EQU   CVTS01+44                                                00613000
CVTRV330 EQU   CVTS01+40                                                00614000
CVTRV329 EQU   CVTS01+36                                                00615000
CVTRV328 EQU   CVTS01+32                                                00616000
CVTRV322 EQU   CVTS01+28                                                00617000
CVTSLID  EQU   CVTSLIDA+1                                               00618000
CVTSYLK  EQU   CVTSLIDA                                                 00619000
CVTRV321 EQU   CVTS01+20                                                00620000
CVTRV320 EQU   CVTS01+16                                                00621000
CVTLPDIR EQU   CVTLPDIA+1                                               00622000
CVTRSV69 EQU   CVTDIRST                                                 00623000
CVTRSV68 EQU   CVTDIRST                                                 00624000
CVTRSV67 EQU   CVTDIRST                                                 00625000
CVTRSV66 EQU   CVTDIRST                                                 00626000
CVTRSV65 EQU   CVTDIRST                                                 00627000
CVTRSV64 EQU   CVTDIRST                                                 00628000
CVTRSV63 EQU   CVTDIRST                                                 00629000
CVTDICOM EQU   CVTDIRST                                                 00630000
CVTPVTP  EQU   CVTS01+8                                                 00631000
CVTLPDSR EQU   CVTS01+4                                                 00632000
CVTGETL  EQU   CVTS01                                                   00633000
CVTLEVL  EQU   CVTRELNO+2                                               00634000
CVTNUMB  EQU   CVTRELNO                                                 00635000
CVTMDL   EQU   CVTFIX+250                                               00636000
@NM00004 EQU   CVTFIX+248                                               00637000
@NM00003 EQU   CVTFIX                                                   00638000
CVTRV482 EQU   CVTXTNT2+128                                             00639000
CVTRV481 EQU   CVTXTNT2+124                                             00640000
CVTRV480 EQU   CVTXTNT2+120                                             00641000
CVTRV479 EQU   CVTXTNT2+118                                             00642000
CVTRV478 EQU   CVTXTNT2+117                                             00643000
CVTRV477 EQU   CVTXTNT2+116                                             00644000
CVTRV476 EQU   CVTXTNT2+115                                             00645000
CVTRV475 EQU   CVTXTNT2+114                                             00646000
CVTRV474 EQU   CVTRV466                                                 00647000
CVTRV473 EQU   CVTRV466                                                 00648000
CVTRV472 EQU   CVTRV466                                                 00649000
CVTRV471 EQU   CVTRV466                                                 00650000
CVTRV470 EQU   CVTRV466                                                 00651000
CVTRV469 EQU   CVTRV466                                                 00652000
CVTRV468 EQU   CVTRV466                                                 00653000
CVTRV467 EQU   CVTRV466                                                 00654000
CVTRV465 EQU   CVTRV457                                                 00655000
CVTRV464 EQU   CVTRV457                                                 00656000
CVTRV463 EQU   CVTRV457                                                 00657000
CVTRV462 EQU   CVTRV457                                                 00658000
CVTRV461 EQU   CVTRV457                                                 00659000
CVTRV460 EQU   CVTRV457                                                 00660000
CVTRV459 EQU   CVTRV457                                                 00661000
CVTRV458 EQU   CVTRV457                                                 00662000
CVTRV456 EQU   CVTXTNT2+108                                             00663000
CVTRV455 EQU   CVTXTNT2+104                                             00664000
CVTRV454 EQU   CVTXTNT2+100                                             00665000
CVTRV453 EQU   CVTXTNT2+96                                              00666000
CVTRV452 EQU   CVTXTNT2+94                                              00667000
CVTRV451 EQU   CVTXTNT2+92                                              00668000
CVTRV450 EQU   CVTXTNT2+90                                              00669000
CVTRV449 EQU   CVTXTNT2+88                                              00670000
CVTRV448 EQU   CVTXTNT2+87                                              00671000
CVTRV447 EQU   CVTXTNT2+86                                              00672000
CVTRV446 EQU   CVTRV438                                                 00673000
CVTRV445 EQU   CVTRV438                                                 00674000
CVTRV444 EQU   CVTRV438                                                 00675000
CVTRV443 EQU   CVTRV438                                                 00676000
CVTRV442 EQU   CVTRV438                                                 00677000
CVTRV441 EQU   CVTRV438                                                 00678000
CVTRV440 EQU   CVTRV438                                                 00679000
CVTRV439 EQU   CVTRV438                                                 00680000
CVTRV437 EQU   CVTRV429                                                 00681000
CVTRV436 EQU   CVTRV429                                                 00682000
CVTRV435 EQU   CVTRV429                                                 00683000
CVTRV434 EQU   CVTRV429                                                 00684000
CVTRV433 EQU   CVTRV429                                                 00685000
CVTRV432 EQU   CVTRV429                                                 00686000
CVTRV431 EQU   CVTRV429                                                 00687000
CVTRV430 EQU   CVTRV429                                                 00688000
CVTRV428 EQU   CVTXTNT2+80                                              00689000
CVTRV427 EQU   CVTXTNT2+76                                              00690000
CVTRV426 EQU   CVTXTNT2+72                                              00691000
CVTRV425 EQU   CVTXTNT2+68                                              00692000
CVTATACT EQU   CVTATCVT                                                 00693000
CVTRV423 EQU   CVTXTNT2+62                                              00694000
CVTRV422 EQU   CVTXTNT2+60                                              00695000
CVTRV421 EQU   CVTXTNT2+58                                              00696000
CVTRV420 EQU   CVTXTNT2+56                                              00697000
CVTRV419 EQU   CVTXTNT2+55                                              00698000
CVTRV418 EQU   CVTXTNT2+54                                              00699000
CVTRV417 EQU   CVTRV409                                                 00700000
CVTRV416 EQU   CVTRV409                                                 00701000
CVTRV415 EQU   CVTRV409                                                 00702000
CVTRV414 EQU   CVTRV409                                                 00703000
CVTRV413 EQU   CVTRV409                                                 00704000
CVTRV412 EQU   CVTRV409                                                 00705000
CVTRV411 EQU   CVTRV409                                                 00706000
CVTRV410 EQU   CVTRV409                                                 00707000
CVTRV408 EQU   CVTRV400                                                 00708000
CVTRV407 EQU   CVTRV400                                                 00709000
CVTRV406 EQU   CVTRV400                                                 00710000
CVTRV405 EQU   CVTRV400                                                 00711000
CVTRV404 EQU   CVTRV400                                                 00712000
CVTRV403 EQU   CVTRV400                                                 00713000
CVTRV402 EQU   CVTRV400                                                 00714000
CVTRV401 EQU   CVTRV400                                                 00715000
CVTICB   EQU   CVTXTNT2+48                                              00716000
CVTSKTA  EQU   CVTXTNT2+44                                              00717000
CVTRSV99 EQU   CVTXTNT2+40                                              00718000
CVTRSV98 EQU   CVTXTNT2+36                                              00719000
CVTRSV97 EQU   CVTXTNT2+34                                              00720000
CVTRSV96 EQU   CVTXTNT2+32                                              00721000
CVTOLTEP EQU   CVTXTNT2+28                                              00722000
CVTQIDA  EQU   CVTQID+1                                                 00723000
CVTRSV95 EQU   CVTQID                                                   00724000
CVTRSV94 EQU   CVTXTNT2+20                                              00725000
CVTRSV93 EQU   CVTXTNT2+16                                              00726000
CVTRSV92 EQU   CVTXTNT2+12                                              00727000
CVTDEBVR EQU   CVTXTNT2+8                                               00728000
CVTRSV91 EQU   CVTXTNT2+6                                               00729000
CVTRSV9H EQU   CVTFLGBT                                                 00730000
CVTRSV9G EQU   CVTFLGBT                                                 00731000
CVTRSV9F EQU   CVTFLGBT                                                 00732000
CVTRSV9E EQU   CVTFLGBT                                                 00733000
CVTRSV9D EQU   CVTFLGBT                                                 00734000
CVTRSV9C EQU   CVTFLGBT                                                 00735000
CVTVME   EQU   CVTFLGBT                                                 00736000
CVTNPE   EQU   CVTFLGBT                                                 00737000
CVTNUCLS EQU   CVTXTNT2+4                                               00738000
CVTDSSVA EQU   CVTDSSV+1                                                00739000
CVTRSV89 EQU   CVTDSSV                                                  00740000
CVTRSV88 EQU   CVTXTNT1+8                                               00741000
CVTRSV87 EQU   CVTXTNT1+4                                               00742000
CVTFACHN EQU   CVTXTNT1                                                 00743000
CVTRV488 EQU   CVTMAP+412                                               00744000
CVTRV487 EQU   CVTMAP+408                                               00745000
CVTRV486 EQU   CVTMAP+404                                               00746000
CVTRV485 EQU   CVTMAP+400                                               00747000
CVTACTAP EQU   CVTMAP+396                                               00748000
CVTAUTH  EQU   CVTMAP+392                                               00749000
CVTATMCA EQU   CVTATMCT+1                                               00750000
CVTATMST EQU   CVTATMCT                                                 00751000
CVTRSV61 EQU   CVTMAP+384                                               00752000
CVTVOLT1 EQU   CVTVOLM1+1                                               00753000
CVTVOLI1 EQU   CVTVOLF1                                                 00754000
CVTSTOA  EQU   CVTMAP+376                                               00755000
CVTRSV58 EQU   CVTMAP+374                                               00756000
CVTRSV57 EQU   CVTMAP+372                                               00757000
CVTDDCE  EQU   CVTMAP+368                                               00758000
CVTPNWFR EQU   CVTMAP+364                                               00759000
CVTSMF   EQU   CVTMAP+360                                               00760000
CVTSULK  EQU   CVTMAP+358                                               00761000
CVTSLKO  EQU   CVTSYSK                                                  00762000
CVTSLKP  EQU   CVTSYSK                                                  00763000
CVTSLKQ  EQU   CVTSYSK                                                  00764000
CVTSLKR  EQU   CVTSYSK                                                  00765000
CVTRSV56 EQU   CVTSYSK                                                  00766000
CVTRSV55 EQU   CVTSYSK                                                  00767000
CVTRSV54 EQU   CVTSYSK                                                  00768000
CVTRSV53 EQU   CVTSYSK                                                  00769000
CVTRSV52 EQU   CVTA1F1                                                  00770000
CVTRSV51 EQU   CVTA1F1                                                  00771000
CVTRSV50 EQU   CVTA1F1                                                  00772000
CVTRSV49 EQU   CVTA1F1                                                  00773000
CVTRSV48 EQU   CVTA1F1                                                  00774000
CVTRSV47 EQU   CVTA1F1                                                  00775000
CVTSRSW  EQU   CVTA1F1                                                  00776000
CVTPFSW  EQU   CVTA1F1                                                  00777000
CVTPCVT  EQU   CVTMAP+352                                               00778000
CVTRSV46 EQU   CVTMAP+344                                               00779000
CVTRSV45 EQU   CVTMAP+340                                               00780000
CVTRSV44 EQU   CVTMAP+338                                               00781000
CVTRSV43 EQU   CVTMAP+336                                               00782000
CVTHJESA EQU   CVTHJES+1                                                00783000
CVTRSV42 EQU   CVTHJES                                                  00784000
CVTEXT2A EQU   CVTEXT2+1                                                00785000
CVTRSV41 EQU   CVTEXT2                                                  00786000
CVTAPFA  EQU   CVTAPF+1                                                 00787000
CVTRSV40 EQU   CVTAPF                                                   00788000
CVTRV518 EQU   CVTINTLA                                                 00789000
CVTRV517 EQU   CVTERPV                                                  00790000
CVTEORM  EQU   CVTMAP+312                                               00791000
CVTMCHPR EQU   CVTMAP+308                                               00792000
CVTTZ    EQU   CVTMAP+304                                               00793000
CVTJEPS  EQU   CVTMAP+300                                               00794000
CVTMODE  EQU   CVTMAP+292                                               00795000
CVTPTRV  EQU   CVTMAP+288                                               00796000
CVTREAL  EQU   CVTMAP+284                                               00797000
CVTRSV39 EQU   CVTMAP+280                                               00798000
CVTRSV38 EQU   CVTMAP+276                                               00799000
CVTDMSRA EQU   CVTDMSR+1                                                00800000
CVTRV634 EQU   CVTDMSRF                                                 00801000
CVTRV633 EQU   CVTDMSRF                                                 00802000
CVTRV632 EQU   CVTDMSRF                                                 00803000
CVTRV631 EQU   CVTDMSRF                                                 00804000
CVTRV630 EQU   CVTDMSRF                                                 00805000
CVTRV629 EQU   CVTDMSRF                                                 00806000
CVTUDUMP EQU   CVTDMSRF                                                 00807000
CVTSDUMP EQU   CVTDMSRF                                                 00808000
CVTQMSGA EQU   CVTQMSG+1                                                00809000
CVTRSV36 EQU   CVTQMSG                                                  00810000
CVTAMFF  EQU   CVTMAP+264                                               00811000
CVTPURGA EQU   CVTPURG+1                                                00812000
CVTRSV35 EQU   CVTPURG                                                  00813000
CVTCBSP  EQU   CVTMAP+256                                               00814000
CVTATERA EQU   CVTATER+1                                                00815000
CVTSYST  EQU   CVTATER                                                  00816000
CVTVOLT2 EQU   CVTTAT                                                   00817000
CVTVOLI2 EQU   CVTVOLF2                                                 00818000
CVTAQAVB EQU   CVTAQAVT+1                                               00819000
CVTRSV34 EQU   CVTTCMFG                                                 00820000
CVTRSV33 EQU   CVTTCMFG                                                 00821000
CVTRSV32 EQU   CVTTCMFG                                                 00822000
CVTRSV31 EQU   CVTTCMFG                                                 00823000
CVTRSV30 EQU   CVTTCMFG                                                 00824000
CVTRSV29 EQU   CVTTCMFG                                                 00825000
CVTLDEV  EQU   CVTTCMFG                                                 00826000
CVTTCRDY EQU   CVTTCMFG                                                 00827000
CVTGTFA  EQU   CVTGTF+1                                                 00828000
CVTRSV27 EQU   CVTGTFST                                                 00829000
CVTRNIO  EQU   CVTGTFST                                                 00830000
CVTUSR   EQU   CVTGTFST                                                 00831000
CVTRV318 EQU   CVTFORM                                                  00832000
CVTRV317 EQU   CVTTMODE                                                 00833000
CVTRV316 EQU   CVTSTATE                                                 00834000
CVTRV315 EQU   CVTGTFS                                                  00835000
CVTGTFAV EQU   CVTGTFS                                                  00836000
CVT0SCR1 EQU   CVTMAP+232                                               00837000
CVTRV515 EQU   CVTMAP+228                                               00838000
CVTRMS   EQU   CVTMAP+224                                               00839000
CVTPATCH EQU   CVTMAP+220                                               00840000
CVTTSCE  EQU   CVTMAP+216                                               00841000
CVTLNKSC EQU   CVTMAP+214                                               00842000
CVTQABST EQU   CVTMAP+212                                               00843000
CVTMDLDS EQU   CVTMAP+208                                               00844000
CVTUSER  EQU   CVTMAP+204                                               00845000
CVTABEND EQU   CVTMAP+200                                               00846000
CVTSMCA  EQU   CVTMAP+196                                               00847000
CVTRSV18 EQU   CVTMAP+192                                               00848000
CVTQLPAQ EQU   CVTMAP+188                                               00849000
CVTQCDSR EQU   CVTMAP+184                                               00850000
CVTRSV17 EQU   CVTOPTB                                                  00851000
CVTRSV16 EQU   CVTOPTB                                                  00852000
CVTFP    EQU   CVTOPTB                                                  00853000
CVTAPTHR EQU   CVTOPTB                                                  00854000
CVTNLOG  EQU   CVTOPTB                                                  00855000
CVTTOD   EQU   CVTOPTB                                                  00856000
CVTCTIMS EQU   CVTOPTB                                                  00857000
CVTPROT  EQU   CVTOPTB                                                  00858000
CVTXPFP  EQU   CVTOPTA                                                  00859000
CVTASCII EQU   CVTOPTA                                                  00860000
CVTRSV13 EQU   CVTOPTA                                                  00861000
CVTRSV12 EQU   CVTOPTA                                                  00862000
CVTNIP   EQU   CVTOPTA                                                  00863000
CVTDDR   EQU   CVTOPTA                                                  00864000
CVTAPR   EQU   CVTOPTA                                                  00865000
CVTCCH   EQU   CVTOPTA                                                  00866000
CVTSNCTR EQU   CVTMAP+180                                               00867000
CVTQMWR  EQU   CVTMAP+176                                               00868000
CVTQOCR  EQU   CVTMAP+172                                               00869000
CVT1EF00 EQU   CVTMAP+168                                               00870000
CVTMZ00  EQU   CVTMAP+164                                               00871000
CVTHEAD  EQU   CVTMAP+160                                               00872000
CVTRSV11 EQU   CVTMAP+156                                               00873000
CVT0PT01 EQU   CVTMAP+152                                               00874000
CVTMSER  EQU   CVTMAP+148                                               00875000
CVTRV516 EQU   CVTIERLC                                                 00876000
CVTILCH  EQU   CVTMAP+140                                               00877000
CVT0DS   EQU   CVTMAP+136                                               00878000
CVTFBOSV EQU   CVTMAP+132                                               00879000
CVTNUCB  EQU   CVTMAP+128                                               00880000
CVTIXAVL EQU   CVTMAP+124                                               00881000
CVTIOQET EQU   CVTMAP+120                                               00882000
CVTDCBA  EQU   CVTMAP+117                                               00883000
CVTMVS2  EQU   CVTDCB                                                   00884000
CVT6DAT  EQU   CVTDCB                                                   00885000
CVT4MPS  EQU   CVTDCB                                                   00886000
CVTRSV09 EQU   CVTDCB                                                   00887000
CVT4MS1  EQU   CVTDCB                                                   00888000
CVT2SPS  EQU   CVTDCB                                                   00889000
CVT1SSS  EQU   CVTDCB                                                   00890000
CVTRSV08 EQU   CVTDCB                                                   00891000
CVTSTB   EQU   CVTMAP+112                                               00892000
CVTQTD00 EQU   CVTMAP+108                                               00893000
CVTQTE00 EQU   CVTMAP+104                                               00894000
CVTCUCB  EQU   CVTMAP+100                                               00895000
CVTSJQ   EQU   CVTMAP+96                                                00896000
CVTPBLDL EQU   CVTMAP+92                                                00897000
CVTTPC   EQU   CVTMAP+88                                                00898000
CVTSVDCB EQU   CVTMAP+84                                                00899000
CVTBRET  EQU   CVTMAP+82                                                00900000
CVTEXIT  EQU   CVTMAP+80                                                00901000
CVT0FN00 EQU   CVTMAP+76                                                00902000
CVTDARA  EQU   CVTDAR+1                                                 00903000
CVTRSV07 EQU   CVTFLGS1                                                 00904000
CVTRSV06 EQU   CVTFLGS1                                                 00905000
CVTRSV05 EQU   CVTFLGS1                                                 00906000
CVTRSV04 EQU   CVTFLGS1                                                 00907000
CVTRSV03 EQU   CVTFLGS1                                                 00908000
CVTRSV02 EQU   CVTFLGS1                                                 00909000
CVTRSV01 EQU   CVTFLGS1                                                 00910000
CVTDMPLK EQU   CVTFLGS1                                                 00911000
CVTXITP  EQU   CVTMAP+68                                                00912000
CVTZDTAB EQU   CVTMAP+64                                                00913000
CVTMSLT  EQU   CVTMAP+60                                                00914000
CVTDATE  EQU   CVTMAP+56                                                00915000
CVTBTERM EQU   CVTMAP+52                                                00916000
CVTSYSAD EQU   CVTMAP+48                                                00917000
CVTXTLER EQU   CVTMAP+44                                                00918000
CVTILK2  EQU   CVTMAP+40                                                00919000
CVTILK1  EQU   CVTMAP+36                                                00920000
CVTPRLTV EQU   CVTMAP+32                                                00921000
CVTPCNVT EQU   CVTMAP+28                                                00922000
CVT0VL00 EQU   CVTMAP+24                                                00923000
CVTXAPG  EQU   CVTMAP+20                                                00924000
CVTBUF   EQU   CVTMAP+16                                                00925000
CVTJOB   EQU   CVTMAP+12                                                00926000
CVTLINK  EQU   CVTMAP+8                                                 00927000
CVT0EF00 EQU   CVTMAP+4                                                 00928000
CVTTCBP  EQU   CVTMAP                                                   00929000
CVT      EQU   CVTMAP                                                   00930000
SSCTSUSE EQU   SSCT+20                                                  00931000
SSCTSSVT EQU   SSCT+16                                                  00932000
SSCTRSV1 EQU   SSCT+13                                                  00933000
@NM00002 EQU   SSCTFLG1                                                 00934000
SSCTUPSS EQU   SSCTFLG1                                                 00935000
SSCTSFOR EQU   SSCTFLG1                                                 00936000
SSCTID   EQU   SSCT                                                     00937000
JESSASTA EQU   JESCT+48                                                 00938000
JESNUCBS EQU   JESCT+44                                                 00939000
JESPJESN EQU   JESCT+28                                                 00940000
JESRESQM EQU   JESCT+16                                                 00941000
JESQMGR  EQU   JESCT+12                                                 00942000
JESUNITS EQU   JESCT+4                                                  00943000
@NM00001 EQU   JESCT                                                    00944000
@NM00028 EQU   PSA+3668                                                 00945000
PSASTAK  EQU   PSA+3072                                                 00946000
@NM00027 EQU   PSA+1048                                                 00947000
PSAUSEND EQU   PSA+1048                                                 00948000
PSARV062 EQU   PSA+1044                                                 00949000
PSACDAL  EQU   PSA+1040                                                 00950000
PSAWTCOD EQU   PSA+1036                                                 00951000
PSAATCVT EQU   PSA+1032                                                 00952000
PSAPCPSW EQU   PSA+1024                                                 00953000
PSAPIR2  EQU   PSA+1020                                                 00954000
PSARV059 EQU   PSA+1018                                                 00955000
PSASVC13 EQU   PSA+1016                                                 00956000
PSALSFCC EQU   PSA+1012                                                 00957000
PSASFACC EQU   PSA+1008                                                 00958000
PSASTOP  EQU   PSA+992                                                  00959000
PSASTART EQU   PSA+976                                                  00960000
PSARSPSW EQU   PSA+968                                                  00961000
PSASRPSW EQU   PSA+960                                                  00962000
PSARV045 EQU   PSA+892                                                  00963000
PSARV044 EQU   PSA+888                                                  00964000
PSARV043 EQU   PSA+884                                                  00965000
PSARV042 EQU   PSA+880                                                  00966000
PSARV041 EQU   PSA+876                                                  00967000
PSARV040 EQU   PSA+872                                                  00968000
PSARV025 EQU   PSA+868                                                  00969000
PSADSSED EQU   PSA+868                                                  00970000
PSADSSPR EQU   PSA+864                                                  00971000
PSADSSFW EQU   PSA+860                                                  00972000
PSADSS14 EQU   PSA+856                                                  00973000
PSADSSPP EQU   PSA+848                                                  00974000
PSADSSRP EQU   PSA+840                                                  00975000
PSADSS05 EQU   PSADSSF4                                                 00976000
PSADSS10 EQU   PSADSSF4                                                 00977000
PSADSSVE EQU   PSADSSF4                                                 00978000
PSADSSDE EQU   PSADSSF4                                                 00979000
PSADSSC0 EQU   PSADSSF4                                                 00980000
PSADSSIE EQU   PSADSSF4                                                 00981000
PSADSS12 EQU   PSADSSF4                                                 00982000
PSADSSRC EQU   PSADSSF4                                                 00983000
PSARV057 EQU   PSADSSF3                                                 00984000
PSARV056 EQU   PSADSSF3                                                 00985000
PSARV055 EQU   PSADSSF3                                                 00986000
PSADSSMC EQU   PSADSSF3                                                 00987000
PSADSSRW EQU   PSADSSF3                                                 00988000
PSADSSNM EQU   PSADSSF3                                                 00989000
PSADSSES EQU   PSADSSF3                                                 00990000
PSADSSGP EQU   PSADSSF3                                                 00991000
PSADSSF2 EQU   PSADSSFL+1                                               00992000
PSADSSPI EQU   PSADSSF1                                                 00993000
PSADSSOI EQU   PSADSSF1                                                 00994000
PSADSSSP EQU   PSADSSF1                                                 00995000
PSADSSTP EQU   PSADSSF1                                                 00996000
PSADSSDW EQU   PSADSSF1                                                 00997000
PSADSSDD EQU   PSADSSF1                                                 00998000
PSADSSDM EQU   PSADSSF1                                                 00999000
PSADSSMV EQU   PSADSSF1                                                 01000000
PSADSSTS EQU   PSA+816                                                  01001000
PSADSSWK EQU   PSA+812                                                  01002000
PSADSSR3 EQU   PSA+808                                                  01003000
PSADSSR2 EQU   PSA+804                                                  01004000
PSADSSRS EQU   PSA+800                                                  01005000
PSASTOR  EQU   PSA+796                                                  01006000
PSACPUSA EQU   PSA+794                                                  01007000
PSAVSTAP EQU   PSA+792                                                  01008000
PSAWKVAP EQU   PSA+788                                                  01009000
PSAWKRAP EQU   PSA+784                                                  01010000
PSAMCHIC EQU   PSA+783                                                  01011000
PSARV061 EQU   PSA+782                                                  01012000
PSASYMSK EQU   PSA+781                                                  01013000
PSAMCHFL EQU   PSA+780                                                  01014000
PSACR0   EQU   PSA+776                                                  01015000
PSAPSWSV EQU   PSA+768                                                  01016000
PSALITA  EQU   PSA+764                                                  01017000
PSACLHS  EQU   PSAHLHI                                                  01018000
PSALKR15 EQU   PSALKSA+60                                               01019000
PSALKR14 EQU   PSALKSA+56                                               01020000
PSALKR13 EQU   PSALKSA+52                                               01021000
PSALKR12 EQU   PSALKSA+48                                               01022000
PSALKR11 EQU   PSALKSA+44                                               01023000
PSALKR10 EQU   PSALKSA+40                                               01024000
PSALKR9  EQU   PSALKSA+36                                               01025000
PSALKR8  EQU   PSALKSA+32                                               01026000
PSALKR7  EQU   PSALKSA+28                                               01027000
PSALKR6  EQU   PSALKSA+24                                               01028000
PSALKR5  EQU   PSALKSA+20                                               01029000
PSALKR4  EQU   PSALKSA+16                                               01030000
PSALKR3  EQU   PSALKSA+12                                               01031000
PSALKR2  EQU   PSALKSA+8                                                01032000
PSALKR1  EQU   PSALKSA+4                                                01033000
PSALKR0  EQU   PSALKSA                                                  01034000
PSARV023 EQU   PSACLHT+52                                               01035000
PSALOCAL EQU   PSACLHT+48                                               01036000
PSACMSL  EQU   PSACLHT+44                                               01037000
PSAOPTL  EQU   PSACLHT+40                                               01038000
PSATPACL EQU   PSACLHT+36                                               01039000
PSATPDNL EQU   PSACLHT+32                                               01040000
PSATPNCL EQU   PSACLHT+28                                               01041000
PSAIOSLL EQU   PSACLHT+24                                               01042000
PSAIOSUL EQU   PSACLHT+20                                               01043000
PSAIOSCL EQU   PSACLHT+16                                               01044000
PSAIOSSL EQU   PSACLHT+12                                               01045000
PSASALCL EQU   PSACLHT+8                                                01046000
PSAASML  EQU   PSACLHT+4                                                01047000
PSADISPL EQU   PSACLHT                                                  01048000
PSASRSA  EQU   PSA+636                                                  01049000
PSARV050 EQU   PSA+634                                                  01050000
PSADSSGO EQU   PSA+633                                                  01051000
PSARECUR EQU   PSA+632                                                  01052000
PSAHLHIS EQU   PSA+628                                                  01053000
PSAIPCSA EQU   PSA+624                                                  01054000
@NM00026 EQU   PSA+621                                                  01055000
PSAIPCDM EQU   PSA+620                                                  01056000
PSAIPCD  EQU   PSA+616                                                  01057000
@NM00025 EQU   PSA+613                                                  01058000
PSAIPCRM EQU   PSA+612                                                  01059000
PSAIPCR  EQU   PSA+608                                                  01060000
PSAMCHEX EQU   PSA+600                                                  01061000
PSAMPSW  EQU   PSA+592                                                  01062000
PSAEXPS2 EQU   PSA+584                                                  01063000
PSAEXPS1 EQU   PSA+576                                                  01064000
PSAPIREG EQU   PSA+572                                                  01065000
PSARSREG EQU   PSA+568                                                  01066000
PSAGPREG EQU   PSA+556                                                  01067000
PSARV022 EQU   PSASUP4                                                  01068000
PSARV021 EQU   PSASUP4                                                  01069000
PSARV020 EQU   PSASUP4                                                  01070000
PSARV019 EQU   PSASUP4                                                  01071000
PSARV018 EQU   PSASUP4                                                  01072000
PSARV017 EQU   PSASUP4                                                  01073000
PSARV016 EQU   PSASUP4                                                  01074000
PSARV015 EQU   PSASUP4                                                  01075000
PSARV014 EQU   PSASUP3                                                  01076000
PSARV013 EQU   PSASUP3                                                  01077000
PSARV012 EQU   PSASUP3                                                  01078000
PSAESTA  EQU   PSASUP3                                                  01079000
PSASPR   EQU   PSASUP3                                                  01080000
PSAPSREG EQU   PSASUP3                                                  01081000
PSAPI2   EQU   PSASUP3                                                  01082000
PSAIOSUP EQU   PSASUP3                                                  01083000
PSALCR   EQU   PSASUP2                                                  01084000
PSARTM   EQU   PSASUP2                                                  01085000
PSAACR   EQU   PSASUP2                                                  01086000
PSAIPCE2 EQU   PSASUP2                                                  01087000
PSAIPCES EQU   PSASUP2                                                  01088000
PSAIPCEC EQU   PSASUP2                                                  01089000
PSAGTF   EQU   PSASUP2                                                  01090000
PSAIPCRI EQU   PSASUP2                                                  01091000
PSATYPE6 EQU   PSASUP1                                                  01092000
PSATCTL  EQU   PSASUP1                                                  01093000
PSADISP  EQU   PSASUP1                                                  01094000
PSALOCK  EQU   PSASUP1                                                  01095000
PSAPI    EQU   PSASUP1                                                  01096000
PSAEXT   EQU   PSASUP1                                                  01097000
PSASVC   EQU   PSASUP1                                                  01098000
PSAIO    EQU   PSASUP1                                                  01099000
PSAAOLD  EQU   PSA+548                                                  01100000
PSAANEW  EQU   PSA+544                                                  01101000
PSATOLD  EQU   PSA+540                                                  01102000
PSATNEW  EQU   PSA+536                                                  01103000
PSALCCAR EQU   PSA+532                                                  01104000
PSALCCAV EQU   PSA+528                                                  01105000
PSAPCCAR EQU   PSA+524                                                  01106000
PSAPCCAV EQU   PSA+520                                                  01107000
PSACPULA EQU   PSA+518                                                  01108000
PSACPUPA EQU   PSA+516                                                  01109000
PSAPSA   EQU   PSA+512                                                  01110000
FLCHDEND EQU   PSA+512                                                  01111000
FLCCRSAV EQU   FLCMCLA+280                                              01112000
FLCGRSAV EQU   FLCMCLA+216                                              01113000
FLCFPSAV EQU   FLCMCLA+184                                              01114000
FLCFLA   EQU   FLCMCLA+88                                               01115000
FLCRGNCD EQU   FLCMCLA+84                                               01116000
FLCFSAA  EQU   FLCFSA+1                                                 01117000
@NM00024 EQU   FLCFSA                                                   01118000
@NM00023 EQU   FLCMCLA+72                                               01119000
FLCMCIC  EQU   FLCMCLA+64                                               01120000
@NM00022 EQU   FLCMCLA+20                                               01121000
FLCIOAA  EQU   FLCIOA+1                                                 01122000
@NM00021 EQU   FLCIOA                                                   01123000
@NM00020 EQU   FLCMCLA+15                                               01124000
@NM00019 EQU   FLCMCLA+14                                               01125000
@NM00018 EQU   FLCMCLA+12                                               01126000
FLCLCL   EQU   FLCMCLA+8                                                01127000
FLCIOELA EQU   FLCIOEL+1                                                01128000
@NM00017 EQU   FLCIOEL                                                  01129000
FLCCHNID EQU   FLCMCLA                                                  01130000
@NM00016 EQU   PSA+160                                                  01131000
FLCMTRCD EQU   PSA+157                                                  01132000
@NM00015 EQU   PSA+156                                                  01133000
FLCPERA  EQU   FLCPER+1                                                 01134000
@NM00014 EQU   FLCPER                                                   01135000
@NM00013 EQU   PSA+151                                                  01136000
FLCPERCD EQU   PSA+150                                                  01137000
FLCMCNUM EQU   PSA+149                                                  01138000
@NM00012 EQU   PSA+148                                                  01139000
FLCTEAA  EQU   FLCTEA+1                                                 01140000
@NM00011 EQU   FLCTEA                                                   01141000
PSAPIPC  EQU   PSAPICOD                                                 01142000
PSAPIMC  EQU   PSAPICOD                                                 01143000
PSAPIPER EQU   PSAPICOD                                                 01144000
PSARV049 EQU   FLCPICOD                                                 01145000
FLCPILCB EQU   FLCPIILC                                                 01146000
@NM00010 EQU   FLCPIILC                                                 01147000
@NM00009 EQU   PSAEPPSW                                                 01148000
FLCSVCN  EQU   PSAESPSW+2                                               01149000
FLCSILCB EQU   FLCSVILC                                                 01150000
@NM00008 EQU   FLCSVILC                                                 01151000
@NM00007 EQU   PSAESPSW                                                 01152000
FLCEICOD EQU   PSAEEPSW+2                                               01153000
PSASPAD  EQU   PSAEEPSW                                                 01154000
@NM00006 EQU   PSA+128                                                  01155000
FLCINPSW EQU   PSA+120                                                  01156000
FLCMNPSW EQU   PSA+112                                                  01157000
FLCPNPSW EQU   PSA+104                                                  01158000
FLCSNPSW EQU   PSA+96                                                   01159000
FLCENPSW EQU   PSA+88                                                   01160000
FLCTRACE EQU   PSA+84                                                   01161000
FLCTIMER EQU   PSA+80                                                   01162000
FLCCVT2  EQU   PSA+76                                                   01163000
FLCCAW   EQU   PSA+72                                                   01164000
FLCCSW   EQU   PSA+64                                                   01165000
FLCIOPSW EQU   PSA+56                                                   01166000
FLCMOPSW EQU   PSA+48                                                   01167000
FLCPOPSW EQU   PSA+40                                                   01168000
FLCSOPSW EQU   PSA+32                                                   01169000
FLCEOPSW EQU   PSA+24                                                   01170000
@NM00005 EQU   FLCICCW2+4                                               01171000
FLCICCW1 EQU   FLCROPSW                                                 01172000
FLCIPPSW EQU   FLCRNPSW                                                 01173000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01174000
@ENDDATA EQU   *                                                        01175000
         END   IGTUDA,(C'PLS0220',0701,77093)                           01176000
