         TITLE 'IGG0CLAS VSAM CATALOG DEFINITION                       *00001000
                        '                                               00002000
IGG0CLAS CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IGG0CLAS  75.056'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
         USING @MAINENT,@15                                             00011000
         USING @DATD-(CCATEMPS-IGGCCA),R11                              00012000
         DS 0F                                                          00013000
         DC CL8'IGGPDEFC'                                               00014000
         EJECT                                                          00015000
         B     @PB00002                                            0116 00016000
IGGPDEFC DS    0H                                                  0117 00017000
         ENTRY IGGPDEFC                                                 00018000
         DROP @15                                                       00019000
Z003     DS    0H                                                  0119 00020000
Z003DEFC DS    0H                                                  0120 00021000
         BALR 12,0                                                      00022000
IGGSEGST DS 0H                                                          00023000
         USING *,12                                                     00024000
*   CCAF2CB=ON;                     /* SET CATALOG BUILD INDIC       */ 00025000
         OI    CCAF2CB(R11),B'00000010'                            0125 00026000
*   ACBSAVAR=CCAACB;                /* SAVE CCA ACB ADDRESS          */ 00027000
         L     @10,CCACMSWA(,R11)                                  0126 00028000
         MVC   ACBSAVAR+192(4,@10),CCAACB(R11)                     0126 00029000
*   RPLSAVAR=CCARPL1;               /* SAVE CAT RPL ADDRESS          */ 00030000
         MVC   RPLSAVAR+196(4,@10),CCARPL1(R11)                    0127 00031000
*   IF CCAF1CR=ON THEN              /* CCR NEED CHECK POINT          */ 00032000
         TM    CCAF1CR(R11),B'00000100'                            0128 00033000
         BNO   @RF00128                                            0128 00034000
*     DO;                                                          0129 00035000
*       CCAMLRET=R13+SASIZ;         /* INSURE ERROR RET HERE @YM05713*/ 00036000
*                                                                  0130 00037000
         LA    @10,12                                              0130 00038000
         ALR   @10,R13                                             0130 00039000
         ST    @10,CCAMLRET(,R11)                                  0130 00040000
*       /*************************************************************/ 00041000
*       /*                                                           */ 00042000
*       /* CALL TO MODULE IGG0CLAG                                   */ 00043000
*       /*                                                           */ 00044000
*       /*************************************************************/ 00045000
*                                                                  0131 00046000
*Z004CCCR:                                                         0131 00047000
*       CALL IGGPCCCR;              /* CALL THE CCR CHECK POINT      */ 00048000
Z004CCCR L     @15,@CV00036                                        0131 00049000
         BALR  @14,@15                                             0131 00050000
*     END;                                                         0132 00051000
*   ELSE                                                           0133 00052000
*     ;                             /* NO CCR CHECK POINT            */ 00053000
@RF00128 DS    0H                                                  0134 00054000
*   CCAACB=NONE;                    /* CLEAR CAT ACB ADDRESS         */ 00055000
         SLR   @10,@10                                             0134 00056000
         ST    @10,CCAACB(,R11)                                    0134 00057000
*Z005DCSP:                                                         0135 00058000
*   CALL IGGPDCSP;                  /* SPACE GETTING SUB FUNCTON     */ 00059000
Z005DCSP BAL   @14,IGGPDCSP                                        0135 00060000
*   IF CCACD1=OKAY THEN             /* CHECK FOR OKAY SPACE GET      */ 00061000
         CLI   CCACD1(R11),0                                       0136 00062000
         BNE   @RF00136                                            0136 00063000
*Z006DCVO:                                                         0137 00064000
*     CALL IGGPDCVO;                /* BUILD VOLUME OCCURRENCES      */ 00065000
Z006DCVO BAL   @14,IGGPDCVO                                        0137 00066000
*   ELSE                                                           0138 00067000
*     ;                             /* VOL OCCURRS NOT BUILT         */ 00068000
@RF00136 DS    0H                                                  0139 00069000
*   IF CCACD1=OKAY THEN             /* CHECK FOR OKAY TO PROCESS     */ 00070000
         CLI   CCACD1(R11),0                                       0139 00071000
         BNE   @RF00139                                            0139 00072000
*Z007DCBE:                                                         0140 00073000
*     CALL IGGPDCBE;                /* BUILD RECORDS                 */ 00074000
Z007DCBE BAL   @14,IGGPDCBE                                        0140 00075000
*   ELSE                                                           0141 00076000
*     ;                             /* RECORDS NOT BUILT             */ 00077000
*                                                                  0141 00078000
@RF00139 DS    0H                                                  0142 00079000
*   /*****************************************************************/ 00080000
*   /*                                                               */ 00081000
*   /* CALL THE MODIFY ENTRY ROUTINE                         @Y30SSDC*/ 00082000
*   /* CALL TO MODULE IGG0CLAE                                       */ 00083000
*   /*                                                               */ 00084000
*   /*****************************************************************/ 00085000
*                                                                  0142 00086000
*Z008DCME:                                                         0142 00087000
*   CALL IGGPDCME;                  /* MODIFY ENTRY          @Y30SSDC*/ 00088000
Z008DCME L     @15,@CV00042                                        0142 00089000
         BALR  @14,@15                                             0142 00090000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 00091000
         BAL   @14,EXIT                                            0143 00092000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 00093000
         DS 0F                                                          00094000
*   GEN(DC CL8'IGGPDCSP');          /* NAME OF FOLLOWING PROCEDURE   */ 00095000
         DC CL8'IGGPDCSP'                                               00096000
*   END;                            /* END OF INNER PROCEDURE        */ 00097000
@EL00002 DS    0H                                                  0146 00098000
@EF00002 DS    0H                                                  0146 00099000
@ER00002 BR    @14                                                 0146 00100000
@PB00002 DS    0H                                                  0147 00101000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 00102000
         EJECT                                                          00103000
*                                                                  0148 00104000
*/********************************************************************/ 00105000
*/*                                                                  */ 00106000
*/*        IGGPDCSP  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */ 00107000
*/*                                                                  */ 00108000
*/********************************************************************/ 00109000
*                                                                  0148 00110000
*IGGPDCSP:                                                         0148 00111000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 00112000
         B     @PB00003                                            0148 00113000
IGGPDCSP DS    0H                                                  0149 00114000
*Z009:                              /* LABEL FOR PROCEDURE TRACKING  */ 00115000
*Z009DCSP:                          /* LABEL FOR PROCEDURE TRACKING  */ 00116000
*   RFY                                                            0149 00117000
*    (R5,                                                          0149 00118000
*     R6,                                                          0149 00119000
*     R7,                                                          0149 00120000
*     R8,                                                          0149 00121000
*     R9,                                                          0149 00122000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 00123000
Z009     DS    0H                                                  0149 00124000
Z009DCSP DS    0H                                                  0150 00125000
*   RFY                                                            0150 00126000
*    (R2,                                                          0150 00127000
*     R3,                                                          0150 00128000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 00129000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 00130000
         STM 12,14,12(13)                                               00131000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 00132000
*                                                                  0152 00133000
         LA 13,12(13)                                                   00134000
*   /*****************************************************************/ 00135000
*   /*                                                               */ 00136000
*   /* INTERNAL ROUTINE TO OBTAIN THE CATALOG PHYSICAL SPACE BY THE  */ 00137000
*   /* USE OF DEFINE SPACE AND TO THEN SUBDIVIDE THAT SPACE BY THE   */ 00138000
*   /* USE OF THE SUBALLOCATE FUNCTION GET CORE FOR THE EXTRA RECORD */ 00139000
*   /* AREAS THAT ARE REQUIRED                                       */ 00140000
*   /*                                                               */ 00141000
*   /*****************************************************************/ 00142000
*                                                                  0153 00143000
*   CCAMNLEN=(NOXCTREC*CTRECSIZ)+   /* SET CORE SIZE                 */ 00144000
*       (NOVGOS*LENGTH(CMFPLSTR))+LENGTH(CMASFPST)+LENGTH(USERWKA)+(    00145000
*       MAXEXTS*LENGTH(CMFXECTS))+(NOMODFPL*LENGTH(CTGFIELD))+(NORAS*   00146000
*       LENGTH(CCARAB))+LENGTH(CTGPL);                             0153 00147000
         LH    @10,@CH03357                                        0153 00148000
         STCM  @10,7,CCAMNLEN(R11)                                 0153 00149000
*   CMFPLIDX=CCAMNLEN;              /* SAVE WORK CORE SIZE           */ 00150000
         L     @05,CCACMSWA(,R11)                                  0154 00151000
         ST    @10,CMFPLIDX(,@05)                                  0154 00152000
*   RFY                                                            0155 00153000
*    (R1) RSTD;                                                    0155 00154000
*   R1=ADDR(CCAMSSPL);              /* POINT TO STRG MGMT P.L.       */ 00155000
         LA    R1,CCAMSSPL(,R11)                                   0156 00156000
*   CCAMNSPL=USUBPOOL;              /* STORE SUBPOOL VALUE           */ 00157000
*                                                                  0157 00158000
         MVI   CCAMNSPL(R11),X'FC'                                 0157 00159000
*   /*****************************************************************/ 00160000
*   /*                                                               */ 00161000
*   /* ALLOCATE MAIN STORAGE FROM USER SUBPOOL 252                   */ 00162000
*   /*                                                               */ 00163000
*   /*****************************************************************/ 00164000
*                                                                  0158 00165000
*   GEN(GETMAIN LC,MF=(E,(1)));     /* GET MAIN STORAGE SPACE        */ 00166000
         GETMAIN LC,MF=(E,(1))                                          00167000
*   GEN(LR R1,R15);                 /* PICK UP RETURN CODE           */ 00168000
         LR R1,R15                                                      00169000
*   IF R1^=NOGETMSE THEN            /* CHECK FOR ERROR RETURN        */ 00170000
*                                                                  0160 00171000
         LTR   R1,R1                                               0160 00172000
         BZ    @RF00160                                            0160 00173000
*     /***************************************************************/ 00174000
*     /*                                                             */ 00175000
*     /* SET CCAMODID='AS', CCAREASN=RSN2, CCARETRN=RCINSSWA         */ 00176000
*     /*                                                             */ 00177000
*     /***************************************************************/ 00178000
*                                                                  0161 00179000
*     CCAPROB=IGGSEGID+(RSN2*K256)+RCINSSWA;/* INSUFFICIENT CORE   0161 00180000
*                                      ERROR                         */ 00181000
         MVC   CCAPROB(4,R11),@CF03359                             0161 00182000
*   ELSE                            /* GETMAIN SUCCESSFUL            */ 00183000
*     DO;                                                          0162 00184000
         B     @RC00160                                            0162 00185000
@RF00160 DS    0H                                                  0163 00186000
*       DO;                                                        0163 00187000
*         IF MNATFULL=ON THEN       /* TRACKING TABLE FULL           */ 00188000
*                                                                  0164 00189000
         TM    MNATFULL(R11),B'10000000'                           0164 00190000
         BNO   @RF00164                                            0164 00191000
*           /*********************************************************/ 00192000
*           /*                                                       */ 00193000
*           /* CALL TO MODULE IGG0CLAT                               */ 00194000
*           /*                                                       */ 00195000
*           /*********************************************************/ 00196000
*                                                                  0165 00197000
*Z013ARFS:                                                         0165 00198000
*           CALL IGGPARFS;          /* YES,CALL SPILL ROUTINE        */ 00199000
Z013ARFS L     @15,@CV00037                                        0165 00200000
         BALR  @14,@15                                             0165 00201000
*         GEN REFS(CCAMNAT)(MVC CCAMNAT(248,11),CCAMNAT+8(11));/*  0166 00202000
*                                      PUSH AND TRACK                */ 00203000
@RF00164 DS    0H                                                  0166 00204000
         MVC CCAMNAT(248,11),CCAMNAT+8(11)                              00205000
*       END;                                                       0167 00206000
*     END;                                                         0168 00207000
*   RFY                                                            0169 00208000
*    (R1) UNRSTD;                                                  0169 00209000
@RC00160 DS    0H                                                  0170 00210000
*   IF CCACD1^=OKAY THEN            /* CHECK IF CORE OBTAINED        */ 00211000
         CLI   CCACD1(R11),0                                       0170 00212000
         BE    @RF00170                                            0170 00213000
*     CALL EXIT;                    /* NO STORAGE ERROR EXIT         */ 00214000
         BAL   @14,EXIT                                            0171 00215000
*   CMSRCCOR=CCAMNADR;              /* SAVE RECORD BUILD CORE PT     */ 00216000
*                                                                  0172 00217000
@RF00170 L     @10,CCACMSWA(,R11)                                  0172 00218000
         L     @05,CCAMNADR(,R11)                                  0172 00219000
         ST    @05,CMSRCCOR(,@10)                                  0172 00220000
*   /*****************************************************************/ 00221000
*   /*                                                               */ 00222000
*   /* CLEAR THE NEWLY OBTAINED RECORD CONSTRUCTION STORAGE          */ 00223000
*   /*                                                               */ 00224000
*   /*****************************************************************/ 00225000
*                                                                  0173 00226000
*   R2=CCAMNADR;                    /* GET CORE ADDRESS              */ 00227000
         LR    R2,@05                                              0173 00228000
*   R3=CCAMNLEN;                    /* GET CORE LENGTH               */ 00229000
         SLR   R3,R3                                               0174 00230000
         ICM   R3,7,CCAMNLEN(R11)                                  0174 00231000
*   RFY                                                            0175 00232000
*    (R5) RSTD;                                                    0175 00233000
*   R5=NONE;                        /* CLEAR THE REGISTER            */ 00234000
         SLR   R5,R5                                               0176 00235000
*   GEN(MVCL R2,R4);                /* CLEAR THE CORE                */ 00236000
         MVCL R2,R4                                                     00237000
*   R2=CCAR0REC;                    /* SET START RECORD AREA         */ 00238000
         L     R2,CCAR0REC(,R11)                                   0178 00239000
*   R3=(NORABRC1*CTRECSIZ);         /* SIZE OF CORE TO CLEAR         */ 00240000
         LA    R3,1024                                             0179 00241000
*   GEN(MVCL R2,R4);                /* CLEAR VIRTUAL STORAGE         */ 00242000
         MVCL R2,R4                                                     00243000
*   R2=CCAR3REC;                    /* GET RECORD AREA PTR           */ 00244000
         L     R2,CCAR3REC(,R11)                                   0181 00245000
*   R3=(NORABRC2*CTRECSIZ);         /* GET VIRTUAL STORAGE SIZE      */ 00246000
         LA    R3,1536                                             0182 00247000
*   GEN(MVCL R2,R4);                /* CLEAR THE VIRTUAL STORAGE     */ 00248000
         MVCL R2,R4                                                     00249000
*   RFY                                                            0184 00250000
*    (R5) UNRSTD;                                                  0184 00251000
*                                                                  0184 00252000
*   /*****************************************************************/ 00253000
*   /*                                                               */ 00254000
*   /* SET UP THE MASTER INDEX TO THE IN CORE CATALOG RECORD         */ 00255000
*   /* CONSTRUCTION AREAS                                            */ 00256000
*   /*                                                               */ 00257000
*   /*****************************************************************/ 00258000
*                                                                  0185 00259000
*   CMSCTREC(1)=CMSRCCOR+(NOXCTREC*LENGTH(CCARAB));                0185 00260000
         L     @10,CCACMSWA(,R11)                                  0185 00261000
         LA    @05,200                                             0185 00262000
         AL    @05,CMSRCCOR(,@10)                                  0185 00263000
         ST    @05,CMSCTREC(,@10)                                  0185 00264000
*   CMSCTREC(2)=CMSCTREC(1)+CTRECSIZ;/* INDEX RECORD REFER           */ 00265000
         LA    @15,512                                             0186 00266000
         ALR   @05,@15                                             0186 00267000
         ST    @05,CMSCTREC+4(,@10)                                0186 00268000
*   CMSCTREC(3)=CCAR2REC;           /* CLUSTER RECORD REFERENCE      */ 00269000
         MVC   CMSCTREC+8(4,@10),CCAR2REC(R11)                     0187 00270000
*   CMSCTREC(4)=CCAR0REC;           /* CCR REFERENCE                 */ 00271000
         MVC   CMSCTREC+12(4,@10),CCAR0REC(R11)                    0188 00272000
*   CMSCTREC(5)=CMSCTREC(2)+CTRECSIZ;/* HIGH LEVEL INDEX             */ 00273000
         L     @05,CMSCTREC+4(,@10)                                0189 00274000
         ALR   @05,@15                                             0189 00275000
         ST    @05,CMSCTREC+16(,@10)                               0189 00276000
*   CMSCTREC(6)=CMSCTREC(5)+CTRECSIZ;/* LOW KEY RANGE RECRD          */ 00277000
         ALR   @05,@15                                             0190 00278000
         ST    @05,CMSCTREC+20(,@10)                               0190 00279000
*   CMSCTREC(7)=CMSCTREC(6)+CTRECSIZ;/* LOW KEY RANGE SS             */ 00280000
         ALR   @05,@15                                             0191 00281000
         ST    @05,CMSCTREC+24(,@10)                               0191 00282000
*   CMSCTREC(8)=CMSCTREC(7)+CTRECSIZ;/* HIGH KEY RANGE DATA          */ 00283000
         ALR   @05,@15                                             0192 00284000
         ST    @05,CMSCTREC+28(,@10)                               0192 00285000
*   CMSCTREC(9)=CMSCTREC(8)+CTRECSIZ;/* HIGH KEY RANGE SS            */ 00286000
         ALR   @05,@15                                             0193 00287000
         ST    @05,CMSCTREC+32(,@10)                               0193 00288000
*   CMSCTREC(10)=CCAR3REC;          /* VOLUME RECORD(BASE) REF       */ 00289000
         MVC   CMSCTREC+36(4,@10),CCAR3REC(R11)                    0194 00290000
*   CMSCTREC(11)=CCAR4REC;          /* VOL EXTENSION REC 1 REF       */ 00291000
         MVC   CMSCTREC+40(4,@10),CCAR4REC(R11)                    0195 00292000
*   CMSCTREC(12)=CCAR5REC;          /* VOL EXTENSION REC 2 REF       */ 00293000
         MVC   CMSCTREC+44(4,@10),CCAR5REC(R11)                    0196 00294000
*   CMSCTREC(13)=CMSCTREC(9)+CTRECSIZ;/* VOL EXTENSION RCRD          */ 00295000
         L     @05,CMSCTREC+32(,@10)                               0197 00296000
         ALR   @05,@15                                             0197 00297000
         ST    @05,CMSCTREC+48(,@10)                               0197 00298000
*   CMSCTREC(14)=CMSCTREC(13)+CTRECSIZ;/* VOL EXT RECORD             */ 00299000
         ALR   @05,@15                                             0198 00300000
         ST    @05,CMSCTREC+52(,@10)                               0198 00301000
*   CMSCTREC(15)=CMSCTREC(14)+CTRECSIZ;/* VOL EXT RECORD             */ 00302000
*                                                                  0199 00303000
         ALR   @05,@15                                             0199 00304000
         ST    @05,CMSCTREC+56(,@10)                               0199 00305000
*   /*****************************************************************/ 00306000
*   /*                                                               */ 00307000
*   /* SET UP TO CALL DEFINE SPACE TO GET THE DATA SPACE THE SPACE   */ 00308000
*   /* FVT IS INITIALIZED ON ENTRY TO THIS FCN                       */ 00309000
*   /*                                                               */ 00310000
*   /*****************************************************************/ 00311000
*                                                                  0200 00312000
*PLSBG1:                                                           0200 00313000
*   CMCPLFVT=CTGFVT;                /* SAVE MAIN FVT ADDRESS         */ 00314000
PLSBG1   L     @10,CCACMSWA(,R11)                                  0200 00315000
         L     @05,CCACPL(,R11)                                    0200 00316000
         L     @15,CTGFVT(,@05)                                    0200 00317000
         ST    @15,CMCPLFVT(,@10)                                  0200 00318000
*   CTGFVT=CTGFVVCH;                /* SET UP SPACE FVT ADDRESS      */ 00319000
         L     @10,CTGFVVCH(,@15)                                  0201 00320000
         ST    @10,CTGFVT(,@05)                                    0201 00321000
*   CCAASCI(1)=MAINVRCI;            /* SET VOL RECORD CI VALUE       */ 00322000
         MVC   CCAASCI(3,R11),@CF00095+1                           0202 00323000
*   CCADESA=CCADESA&&CCADESA;       /* CLEAR THE EXTENT RETURN       */ 00324000
*                                                                  0203 00325000
         XC    CCADESA(44,R11),CCADESA(R11)                        0203 00326000
*   /*****************************************************************/ 00327000
*   /*                                                               */ 00328000
*   /* CALL THE DEFINE SPACE FUNCTION TO GET THE CATALOG DATA SPACE  */ 00329000
*   /*                                                               */ 00330000
*   /*****************************************************************/ 00331000
*                                                                  0204 00332000
*   IF CMCPLFVT->CTGFVDCH->CTGFVATR->CTGFLPT(1)->/*          @Y30SSDC*/ 00333000
*       CTGDSREC=ON THEN            /*                       @Y30SSDC*/ 00334000
         L     @05,CTGFVDCH(,@15)                                  0204 00335000
         L     @05,CTGFVATR(,@05)                                  0204 00336000
         L     @05,CTGFLPT(,@05)                                   0204 00337000
         TM    CTGDSREC(@05),B'00001000'                           0204 00338000
         BNO   @RF00204                                            0204 00339000
*     CTGFVDRC=ON;                  /* IND RECOV CAT         @Y30SSDC*/ 00340000
         OI    CTGFVDRC(@10),B'00010000'                           0205 00341000
*   ELSE                                                           0206 00342000
*     ;                             /* NOT RECOV CAT         @Y30SSDC*/ 00343000
@RF00204 DS    0H                                                  0207 00344000
*   CCAURAB=ADDR(CCARAB3);          /* SET VOL RECORD RAB ADDR       */ 00345000
*                                                                  0207 00346000
         LA    @10,CCARAB3(,R11)                                   0207 00347000
         ST    @10,CCAURAB(,R11)                                   0207 00348000
*   /*****************************************************************/ 00349000
*   /*                                                               */ 00350000
*   /* CALL TO MODULE IGG0CLAQ                                       */ 00351000
*   /*                                                               */ 00352000
*   /*****************************************************************/ 00353000
*                                                                  0208 00354000
*Z014DEFS:                                                         0208 00355000
*   CALL IGGPDEFS;                                                 0208 00356000
*                                                                  0208 00357000
Z014DEFS L     @15,@CV00039                                        0208 00358000
         BALR  @14,@15                                             0208 00359000
*   /*****************************************************************/ 00360000
*   /*                                                               */ 00361000
*   /* RETURN FORM DEFINE SPACE                                      */ 00362000
*   /*                                                               */ 00363000
*   /*****************************************************************/ 00364000
*                                                                  0209 00365000
*   CTGFVT=CMCPLFVT;                /* RE-SET THE MAIN FVT ADDR      */ 00366000
         L     @10,CCACPL(,R11)                                    0209 00367000
         L     @05,CCACMSWA(,R11)                                  0209 00368000
         L     @15,CMCPLFVT(,@05)                                  0209 00369000
         ST    @15,CTGFVT(,@10)                                    0209 00370000
*   CMDEFSWA=NONE;                  /* CLEAR DEFINE SPACE FIELD      */ 00371000
         SLR   @10,@10                                             0210 00372000
         ST    @10,CMDEFSWA(,@05)                                  0210 00373000
*   SAVFSTXT=CCAEXTDE(1);           /* SAVE FIRST EXTENT     @XZ02675*/ 00374000
         MVC   SAVFSTXT(8,@05),CCAEXTDE(R11)                       0211 00375000
*   IF CCACD1=OKAY THEN             /* CHECK FOR SUCCESSFUL PROC     */ 00376000
         CLI   CCACD1(R11),0                                       0212 00377000
         BNE   @RF00212                                            0212 00378000
*     DO;                           /* PREPARE TO CALL SUBALLOC      */ 00379000
*                                                                  0213 00380000
*       /*************************************************************/ 00381000
*       /*                                                           */ 00382000
*       /* CONSTRUCT THE SUBALLOCATE ROUTINE INTERFACE               */ 00383000
*       /*                                                           */ 00384000
*       /*************************************************************/ 00385000
*                                                                  0214 00386000
*       CCAALPTR=CCAR1REC;          /* SUB ALLOCATE PARM LIST        */ 00387000
         L     @10,CCAR1REC(,R11)                                  0214 00388000
         ST    @10,CCAALPTR(,R11)                                  0214 00389000
*       SALPARL(1:256)=SALPARL(1:256)&&SALPARL(1:256);             0215 00390000
         XC    SALPARL(256,@10),SALPARL(@10)                       0215 00391000
*       CMVLVOL=CTGFVVCH->CTGFVVLT->LTVOLSER(1);/* VOL SER           */ 00392000
         L     @10,CTGFVVCH(,@15)                                  0216 00393000
         L     @10,CTGFVVLT(,@10)                                  0216 00394000
         MVC   CMVLVOL(6,@05),LTVOLSER(@10)                        0216 00395000
*       CMVLLTLN=LENGTH(CMVLLIST)-LENGTH(CMVLLTLN);/* LNG            */ 00396000
         MVC   CMVLLTLN(2,@05),@CH00054                            0217 00397000
*       SALOPTNS=SACANOPT;          /* SET CANDIDATE REQUEST FLG     */ 00398000
         L     @10,CCAALPTR(,R11)                                  0218 00399000
         MVI   SALOPTNS(@10),X'00'                                 0218 00400000
*       SALSOURC=SARABS;            /* VER SOURCE IS RABS            */ 00401000
         MVI   SALSOURC(@10),X'01'                                 0219 00402000
*       SALDSCIN=CATCLSCI;          /* SET DATA SET CI ID VALUE      */ 00403000
         MVC   SALDSCIN(3,@10),@CF00066+1                          0220 00404000
*       SALCALN=CMTRKPCA(1);        /* CONTROL AREA SIZE             */ 00405000
         MVC   SALCALN(2,@10),CMTRKPCA(@05)                        0221 00406000
*       SALVLIST=ADDR(CMVLLIST);    /* VOLUME LIST ADDRESS           */ 00407000
         LA    @15,CMVLLIST(,@05)                                  0222 00408000
         ST    @15,SALVLIST(,@10)                                  0222 00409000
*       SALRLIST=ADDR(CMDEFSWA);    /* RESPONSE LIST ADDRESS         */ 00410000
         LA    @05,CMDEFSWA(,@05)                                  0223 00411000
         ST    @05,SALRLIST(,@10)                                  0223 00412000
*       SALMXEXT=MAXEXTS;           /* SET MAX NO. EXTENTS           */ 00413000
         MVI   SALMXEXT(@10),X'05'                                 0224 00414000
*       PRLLN=INCR1;                /* SET NO. RESPONSE ELEMENTS     */ 00415000
*                                                                  0225 00416000
         MVI   PRLLN(@05),X'01'                                    0225 00417000
*       /*************************************************************/ 00418000
*       /*                                                           */ 00419000
*       /* CALL TO MODULE IGG0CLAR                                   */ 00420000
*       /*                                                           */ 00421000
*       /*************************************************************/ 00422000
*                                                                  0226 00423000
*Z015SALL:                                                         0226 00424000
*       CALL IGGPSALL;                                             0226 00425000
Z015SALL L     @15,@CV00043                                        0226 00426000
         BALR  @14,@15                                             0226 00427000
*       IF CCACD1=OKAY THEN         /* PROCESS FOR DS DIR OKAY       */ 00428000
         CLI   CCACD1(R11),0                                       0227 00429000
         BNE   @RF00227                                            0227 00430000
*         DO;                                                      0228 00431000
*           IF CCANDEXT>INCR1 THEN  /* MANY EXTENTS USE ALL SPC      */ 00432000
         CLI   CCANDEXT(R11),1                                     0229 00433000
         BNH   @RF00229                                            0229 00434000
*             DO;                   /*                       @XZ02675*/ 00435000
*               SALUNITS=CTGFVVCH->CTGFVSPC->CTGFLPT(1)->SPCPRIMQ; 0231 00436000
         L     @10,CCAALPTR(,R11)                                  0231 00437000
         L     @05,CCACPL(,R11)                                    0231 00438000
         L     @05,CTGFVT(,@05)                                    0231 00439000
         L     @05,CTGFVVCH(,@05)                                  0231 00440000
         L     @05,CTGFVSPC(,@05)                                  0231 00441000
         L     @05,CTGFLPT(,@05)                                   0231 00442000
         MVC   SALUNITS(2,@10),SPCPRIMQ+1(@05)                     0231 00443000
*               SALOPTNS=CTGFVVCH->CTGFVSPC->CTGFLPT(1)->SPCOPTNS; 0232 00444000
         MVC   SALOPTNS(1,@10),SPCOPTNS(@05)                       0232 00445000
*             END;                  /*                       @XZ02675*/ 00446000
*           ELSE                    /* ONE EXTENT, USE NEEDED        */ 00447000
*             DO;                   /*                       @XZ02675*/ 00448000
         B     @RC00229                                            0234 00449000
@RF00229 DS    0H                                                  0235 00450000
*               SALUNITS=CTGFVSPC->CTGFLPT(1)->SPCPRIMQ;           0235 00451000
         L     @10,CCAALPTR(,R11)                                  0235 00452000
         L     @05,CCACPL(,R11)                                    0235 00453000
         L     @05,CTGFVT(,@05)                                    0235 00454000
         L     @05,CTGFVSPC(,@05)                                  0235 00455000
         L     @05,CTGFLPT(,@05)                                   0235 00456000
         MVC   SALUNITS(2,@10),SPCPRIMQ+1(@05)                     0235 00457000
*               SALOPTNS=CTGFVSPC->CTGFLPT(1)->SPCOPTNS;/*   @XZ02675*/ 00458000
         MVC   SALOPTNS(1,@10),SPCOPTNS(@05)                       0236 00459000
*             END;                  /*                       @XZ02675*/ 00460000
*           CCADESA=CCADESA&&CCADESA;/* CLEAR EXTENT RETURN LOC      */ 00461000
*                                                                  0238 00462000
@RC00229 XC    CCADESA(44,R11),CCADESA(R11)                        0238 00463000
*           /*********************************************************/ 00464000
*           /*                                                       */ 00465000
*           /* CALL TO MODULE IGG0CLAR                               */ 00466000
*           /*                                                       */ 00467000
*           /*********************************************************/ 00468000
*                                                                  0239 00469000
*Z016SALL:                                                         0239 00470000
*           CALL IGGPSALL;                                         0239 00471000
Z016SALL L     @15,@CV00043                                        0239 00472000
         BALR  @14,@15                                             0239 00473000
*           CCASSVOL=PRLENT(1);     /* SAVE DS DIR SEQ #     @Y30SSDC*/ 00474000
         L     @10,CCAALPTR(,R11)                                  0240 00475000
         L     @10,SALRLIST(,@10)                                  0240 00476000
         MVC   CCASSVOL(2,R11),PRLENT(@10)                         0240 00477000
*           IF CCANDEXT>INCR1 THEN  /* MULTIPLE EXTENTS              */ 00478000
*                                                                  0241 00479000
         CLI   CCANDEXT(R11),1                                     0241 00480000
         BNH   @RF00241                                            0241 00481000
*             /*******************************************************/ 00482000
*             /*                                                     */ 00483000
*             /* CALL TO MODULE IGG0CLAE                             */ 00484000
*             /*                                                     */ 00485000
*             /*******************************************************/ 00486000
*                                                                  0242 00487000
*Z017MEBM:                                                         0242 00488000
*             CALL IGGPMEBM;        /* RETURN UNUSED CAT SPACE       */ 00489000
Z017MEBM L     @15,@CV00041                                        0242 00490000
         BALR  @14,@15                                             0242 00491000
*           ELSE                                                   0243 00492000
*             ;                     /* NOT MULTIPLE EXTENTS          */ 00493000
*                                                                  0243 00494000
@RF00241 DS    0H                                                  0244 00495000
*           /*********************************************************/ 00496000
*           /*                                                       */ 00497000
*           /* TEST FOR RECOVERABLE CATALOG                  @Y30SSSB*/ 00498000
*           /* AND IF ENOUGH SPACE FOR CAT AND CRA.          @Y30SSSB*/ 00499000
*           /*                                                       */ 00500000
*           /*********************************************************/ 00501000
*                                                                  0244 00502000
*           IF CTGFVDCH->CTGFVATR->CTGFLPT(1)->/*            @Y30SSSB*/ 00503000
*               CTGDSREC=ON THEN    /*                       @Y30SSSB*/ 00504000
         L     @10,CCACPL(,R11)                                    0244 00505000
         L     @10,CTGFVT(,@10)                                    0244 00506000
         L     @05,CTGFVDCH(,@10)                                  0244 00507000
         L     @05,CTGFVATR(,@05)                                  0244 00508000
         L     @05,CTGFLPT(,@05)                                   0244 00509000
         TM    CTGDSREC(@05),B'00001000'                           0244 00510000
         BNO   @RF00244                                            0244 00511000
*             IF CTGFVVCH->CTGFVSPC->CTGFLPT(1)/*            @Y30SSSB*/ 00512000
*                 ->SPCPRIMQ<       /*                       @Y30SSSB*/ 00513000
*                 (CTGFVSPC->CTGFLPT(1)->SPCPRIMQ/*          @Y30SSSB*/ 00514000
*                 +CMTRKCYL(1)) THEN/*                       @Y30SSSB*/ 00515000
*                                                                  0245 00516000
         L     @05,CTGFVVCH(,@10)                                  0245 00517000
         L     @05,CTGFVSPC(,@05)                                  0245 00518000
         L     @05,CTGFLPT(,@05)                                   0245 00519000
         L     @10,CTGFVSPC(,@10)                                  0245 00520000
         L     @10,CTGFLPT(,@10)                                   0245 00521000
         L     @01,CCACMSWA(,R11)                                  0245 00522000
         SLR   @00,@00                                             0245 00523000
         ICM   @00,7,SPCPRIMQ(@10)                                 0245 00524000
         AH    @00,CMTRKCYL(,@01)                                  0245 00525000
         SLR   @10,@10                                             0245 00526000
         ICM   @10,7,SPCPRIMQ(@05)                                 0245 00527000
         CR    @00,@10                                             0245 00528000
         BNH   @RF00245                                            0245 00529000
*               /*****************************************************/ 00530000
*               /*                                                   */ 00531000
*               /* IF NOT SET ERROR CODE                     @Y30SSSB*/ 00532000
*               /* SET CCAMODID='AS', CCAREASN=RSN6, CCARETRN=RCCRAOP*/ 00533000
*               /*                                                   */ 00534000
*               /*****************************************************/ 00535000
*                                                                  0246 00536000
*               CCAPROB=IGGSEGID+(RSN6*K256)+RCCRAOP;/*      @Y30SSSB*/ 00537000
         MVC   CCAPROB(4,R11),@CF03363                             0246 00538000
*             ELSE                  /*                       @Y30SSSB*/ 00539000
*                                                                  0247 00540000
*               /*****************************************************/ 00541000
*               /*                                                   */ 00542000
*               /* CALL TO MODULE IGG0CLB4                           */ 00543000
*               /*                                                   */ 00544000
*               /*****************************************************/ 00545000
*                                                                  0247 00546000
*Z019DCRA:                                                         0247 00547000
*               CALL IGGPDCRA;      /* DEFINE CRA            @Y30SSSB*/ 00548000
         B     @RC00245                                            0247 00549000
@RF00245 DS    0H                                                  0247 00550000
Z019DCRA L     @15,@CV00038                                        0247 00551000
         BALR  @14,@15                                             0247 00552000
*           ELSE                                                   0248 00553000
*             ;                     /* NOT RECOV CAT         @Y30SSSB*/ 00554000
@RF00244 DS    0H                                                  0249 00555000
*         END;                                                     0249 00556000
*       ELSE                                                       0250 00557000
*         ;                         /* ERROR IN SUBALLOC PROC        */ 00558000
@RF00227 DS    0H                                                  0251 00559000
*     END;                          /* END SUBALLOCATE FUNCTION      */ 00560000
@RC00227 DS    0H                                                  0252 00561000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 00562000
@RF00212 BAL   @14,EXIT                                            0252 00563000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 00564000
         DS 0F                                                          00565000
*   GEN(DC CL8'IGGPDCVO');          /* NAME OF FOLLOWING PROCEDURE   */ 00566000
         DC CL8'IGGPDCVO'                                               00567000
*   END;                            /* END OF INNER PROCEDURE        */ 00568000
@EL00003 DS    0H                                                  0255 00569000
@EF00003 DS    0H                                                  0255 00570000
@ER00003 BR    @14                                                 0255 00571000
@PB00003 DS    0H                                                  0256 00572000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 00573000
         EJECT                                                          00574000
*                                                                  0257 00575000
*/********************************************************************/ 00576000
*/*                                                                  */ 00577000
*/*        IGGPDCVO  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */ 00578000
*/*                                                                  */ 00579000
*/********************************************************************/ 00580000
*                                                                  0257 00581000
*IGGPDCVO:                                                         0257 00582000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 00583000
         B     @PB00004                                            0257 00584000
IGGPDCVO DS    0H                                                  0258 00585000
*Z020:                              /* LABEL FOR PROCEDURE TRACKING  */ 00586000
*Z020DCVO:                          /* LABEL FOR PROCEDURE TRACKING  */ 00587000
*   RFY                                                            0258 00588000
*    (R5,                                                          0258 00589000
*     R6,                                                          0258 00590000
*     R7,                                                          0258 00591000
*     R8,                                                          0258 00592000
*     R9,                                                          0258 00593000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 00594000
Z020     DS    0H                                                  0258 00595000
Z020DCVO DS    0H                                                  0259 00596000
*   RFY                                                            0259 00597000
*    (R2,                                                          0259 00598000
*     R3,                                                          0259 00599000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 00600000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 00601000
         STM 12,14,12(13)                                               00602000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 00603000
*                                                                  0261 00604000
         LA 13,12(13)                                                   00605000
*   /*****************************************************************/ 00606000
*   /*                                                               */ 00607000
*   /* INTERNAL PROCEDURE TO BUILD VOLUME OCCURRENCES, CONVERT       */ 00608000
*   /* PHYSICAL TO LOGICAL ADDRESS AND TO SET UP THE CATALOG KEY     */ 00609000
*   /* RANGES ESTABLISH ADDRESSABILITY TO THE DATA FPL VOLUME        */ 00610000
*   /* OCCURRENCES AND BUILD THE OCCURRENCES                         */ 00611000
*   /*                                                               */ 00612000
*   /*****************************************************************/ 00613000
*                                                                  0262 00614000
*   CCAMCPL=CMSCTREC(15)+CTRECSIZ;  /* ADDRESS OF MODIFY CPL         */ 00615000
*                                                                  0262 00616000
         L     @10,CCACMSWA(,R11)                                  0262 00617000
         LA    @05,512                                             0262 00618000
         AL    @05,CMSCTREC+56(,@10)                               0262 00619000
         ST    @05,CCAMCPL(,R11)                                   0262 00620000
*   /*****************************************************************/ 00621000
*   /*                                                               */ 00622000
*   /* ASSOCIATION FPL ADDRESS                                       */ 00623000
*   /*                                                               */ 00624000
*   /*****************************************************************/ 00625000
*                                                                  0263 00626000
*   CMASCFPL=CCAMCPL+LENGTH(CTGPL)+(5*LENGTH(CTGFIELD));           0263 00627000
*                                                                  0263 00628000
         AH    @05,@CH00276                                        0263 00629000
         ST    @05,CMASCFPL(,@10)                                  0263 00630000
*   /*****************************************************************/ 00631000
*   /*                                                               */ 00632000
*   /* HIGHEST INDEX LEVELS VOLUME OCCURRENCE FPL ADDRESS            */ 00633000
*   /*                                                               */ 00634000
*   /*****************************************************************/ 00635000
*                                                                  0264 00636000
*   CMHIXFPL=CMASCFPL+LENGTH(CMASFPST);                            0264 00637000
*                                                                  0264 00638000
         AH    @05,@CH00271                                        0264 00639000
         ST    @05,CMHIXFPL(,@10)                                  0264 00640000
*   /*****************************************************************/ 00641000
*   /*                                                               */ 00642000
*   /* DATA LOW KEY RANGE VOLUME OCCURRENCE FPL ADDRESS              */ 00643000
*   /*                                                               */ 00644000
*   /*****************************************************************/ 00645000
*                                                                  0265 00646000
*   CMLDTFPL=CMHIXFPL+LENGTH(CMFPLSTR)+LENGTH(CMFXECTS);           0265 00647000
         AH    @05,@CH03364                                        0265 00648000
         ST    @05,CMLDTFPL(,@10)                                  0265 00649000
*   RFY                                                            0266 00650000
*    (CMFPLREF) RSTD;                                              0266 00651000
*   RFY                                                            0267 00652000
*     CMFPLSTR BASED(CMFPLREF);                                    0267 00653000
*Z021DCLD:                                                         0268 00654000
*   CALL IGGPDCLD;                  /* BUILD LOW DATA RANGE OCCR     */ 00655000
Z021DCLD BAL   @14,IGGPDCLD                                        0268 00656000
*   RFY                                                            0269 00657000
*    (CMFPLREF) RSTD;                                              0269 00658000
*                                                                  0269 00659000
*   /*****************************************************************/ 00660000
*   /*                                                               */ 00661000
*   /* SET UP ADDRESSABILITY FOR THE HIGH DATA KEY RANGE FPL AND     */ 00662000
*   /* VOLUME OCCURRENCE STRUCTURE                                   */ 00663000
*   /*                                                               */ 00664000
*   /*****************************************************************/ 00665000
*                                                                  0270 00666000
*   CMHDTFPL=CMEXTLST+CMEXTLST->VARWRKLN+LENGTH(CMFLEXLN);         0270 00667000
*                                                                  0270 00668000
         L     @10,CCACMSWA(,R11)                                  0270 00669000
         L     @15,CMEXTLST(,@10)                                  0270 00670000
         LH    @14,VARWRKLN(,@15)                                  0270 00671000
         ALR   @14,@15                                             0270 00672000
         AH    @14,@CH00066                                        0270 00673000
         ST    @14,CMHDTFPL(,@10)                                  0270 00674000
*   /*****************************************************************/ 00675000
*   /*                                                               */ 00676000
*   /* COPY THE BASIC FPL AND VOLUME OCCURRENCE OF THE LOW DATA KEY  */ 00677000
*   /* RANGE INFORMATION INTO THE HIGH KEY RANGE INFO                */ 00678000
*   /*                                                               */ 00679000
*   /*****************************************************************/ 00680000
*                                                                  0271 00681000
*   GENWRKRG=LENGTH(CMFPLSTR)+(NOKEYRNG*LENGTH(CTRNGVLU));         0271 00682000
         LA    GENWRKRG,79                                         0271 00683000
*   CMHDTFPL->CMFPLSTR(1:GENWRKRG)=CMFPLSTR(1:GENWRKRG);           0272 00684000
         LR    @10,GENWRKRG                                        0272 00685000
         BCTR  @10,0                                               0272 00686000
         EX    @10,@SM03372                                        0272 00687000
*Z022DCIX:                                                         0273 00688000
*   CALL IGGPDCIX;                  /* BUILD HIGH LEVEL IX OCCR      */ 00689000
Z022DCIX BAL   @14,IGGPDCIX                                        0273 00690000
*   RFY                                                            0274 00691000
*    (CMFPLREF) RSTD;                                              0274 00692000
*Z023DCHD:                                                         0275 00693000
*   CALL IGGPDCHD;                  /* BUILD HIGH DATA RANGE OCR     */ 00694000
Z023DCHD BAL   @14,IGGPDCHD                                        0275 00695000
*   RFY                                                            0276 00696000
*    (CMFPLREF) RSTD;                                              0276 00697000
*                                                                  0276 00698000
*   /*****************************************************************/ 00699000
*   /*                                                               */ 00700000
*   /* BUILD AN ASSOCIATION FPL FOR THE CLUSTER                      */ 00701000
*   /*                                                               */ 00702000
*   /*****************************************************************/ 00703000
*                                                                  0277 00704000
*   CMFPLREF=CMASCFPL;              /* GET THE FPL ADDRESS           */ 00705000
         L     @10,CCACMSWA(,R11)                                  0277 00706000
         L     @15,CMASCFPL(,@10)                                  0277 00707000
         LR    CMFPLREF,@15                                        0277 00708000
*   RFY                                                            0278 00709000
*     CTGFL BASED(CMFPLREF);                                       0278 00710000
*   CTGFLDNO=INCR1;                 /* NO. OF LENGTH/ADDR PAIRS      */ 00711000
         MVI   CTGFLDNO(CMFPLREF),X'01'                            0279 00712000
*   CTGFLDNM=ADDR(CMAFDNAM);        /* FIELD NAME ADDRESS            */ 00713000
         LA    @14,CMAFDNAM(,@15)                                  0280 00714000
         ST    @14,CTGFLDNM(,CMFPLREF)                             0280 00715000
*   CMAFDNAM='NAMEDS  ';            /* FIELD NAME                    */ 00716000
         MVC   CMAFDNAM(8,@15),@CC03248                            0281 00717000
*   CTGFLNG(1)=LENGTH(CMAFTYPE)+LENGTH(CMAFNAME);                  0282 00718000
         MVC   CTGFLNG(4,CMFPLREF),@CF00126                        0282 00719000
*   CTGFLPT(1)=ADDR(CMAFTYPE);      /* DATA LOCATION                 */ 00720000
         LA    @14,CMAFTYPE(,@15)                                  0283 00721000
         ST    @14,CTGFLPT(,CMFPLREF)                              0283 00722000
*   CMAFTYPE=CTGFVCL;               /* SET CLUSTER TYPE ASSOC        */ 00723000
         MVI   CMAFTYPE(@15),C'C'                                  0284 00724000
*   CMAFNAME=CATCLSCI;              /* SET CATALOG CLUSTER CI        */ 00725000
*                                                                  0285 00726000
         MVC   CMAFNAME(3,@15),@CF00066+1                          0285 00727000
*   /*****************************************************************/ 00728000
*   /*                                                               */ 00729000
*   /* COMPLETE THE ENTVOL FPLS AND PREPARE THE CPL IN CORE FOR THE  */ 00730000
*   /* FIRST USE OF MODIFY                                           */ 00731000
*   /*                                                               */ 00732000
*   /*****************************************************************/ 00733000
*                                                                  0286 00734000
*   CMFPLREF=CMHIXFPL;              /* HIGH LEVELS INDEX FPL ADR     */ 00735000
         L     CMFPLREF,CMHIXFPL(,@10)                             0286 00736000
*   GENWRKRG=(ADDR(CMFLEND)-ADDR(CMFLRLRP))+LENGTH(CMFXECTS);/* SET     00737000
*                                      DATA LENGTH                   */ 00738000
         LA    GENWRKRG,CMFLEND(,CMFPLREF)                         0287 00739000
         LA    @10,CMFLRLRP(,CMFPLREF)                             0287 00740000
         SLR   GENWRKRG,@10                                        0287 00741000
         AH    GENWRKRG,@CH00179                                   0287 00742000
*Z024DCFL:                                                         0288 00743000
*   CALL IGGPDCFL;                  /* USE FIELD LIST INIT RTN       */ 00744000
Z024DCFL BAL   @14,IGGPDCFL                                        0288 00745000
*   RFY                                                            0289 00746000
*    (CMFPLREF) RSTD;                                              0289 00747000
*   CMFPLREF=CMLDTFPL;              /* LOW DATA RANGE FPL ADDR       */ 00748000
         L     @10,CCACMSWA(,R11)                                  0290 00749000
         L     CMFPLREF,CMLDTFPL(,@10)                             0290 00750000
*   GENWRKRG=GENWRKRG+(2*LENGTH(CTRNGVLU))+((CMFLNOEX-INCR1)*LENGTH(    00751000
*       CMFXECTS));                 /* DATA LENGTH                   */ 00752000
         LA    @10,2                                               0291 00753000
         ALR   @10,GENWRKRG                                        0291 00754000
         SLR   @15,@15                                             0291 00755000
         IC    @15,CMFLNOEX(,CMFPLREF)                             0291 00756000
         BCTR  @15,0                                               0291 00757000
         MH    @15,@CH00179                                        0291 00758000
         ALR   @10,@15                                             0291 00759000
         LR    GENWRKRG,@10                                        0291 00760000
*Z025DCFL:                                                         0292 00761000
*   CALL IGGPDCFL;                  /* USE FIELD LIST INIT RTN       */ 00762000
Z025DCFL BAL   @14,IGGPDCFL                                        0292 00763000
*   RFY                                                            0293 00764000
*    (CMFPLREF) RSTD;                                              0293 00765000
*   CMFPLREF=CMHDTFPL;              /* HIGH DATA RANGE FPL ADDR      */ 00766000
         L     @10,CCACMSWA(,R11)                                  0294 00767000
         L     CMFPLREF,CMHDTFPL(,@10)                             0294 00768000
*   GENWRKRG=(ADDR(CMFLEND)-ADDR(CMFLRLRP))+(2*LENGTH(CTRNGVLU))+( 0295 00769000
*       CMFLNOEX*LENGTH(CMFXECTS));                                0295 00770000
         LA    GENWRKRG,CMFLEND(,CMFPLREF)                         0295 00771000
         LA    @10,CMFLRLRP(,CMFPLREF)                             0295 00772000
         SLR   GENWRKRG,@10                                        0295 00773000
         AH    GENWRKRG,@CH00066                                   0295 00774000
         SLR   @10,@10                                             0295 00775000
         IC    @10,CMFLNOEX(,CMFPLREF)                             0295 00776000
         MH    @10,@CH00179                                        0295 00777000
         ALR   GENWRKRG,@10                                        0295 00778000
*Z026DCFL:                                                         0296 00779000
*   CALL IGGPDCFL;                  /* USE FIELD LIST INIT RTN       */ 00780000
Z026DCFL BAL   @14,IGGPDCFL                                        0296 00781000
*   RFY                                                            0297 00782000
*    (CMFPLREF) RSTD;                                              0297 00783000
*                                                                  0297 00784000
*   /*****************************************************************/ 00785000
*   /*                                                               */ 00786000
*   /* PREPARE THE MODIFY CPL FOR USAGE FOR THE DATA RECORD          */ 00787000
*   /*                                                               */ 00788000
*   /*****************************************************************/ 00789000
*                                                                  0298 00790000
*   RFY                                                            0298 00791000
*     CTGPL BASED(CCAMCPL);                                        0298 00792000
*   CTGNOFLD=NODATAOC;              /* NUMBER OF DATA OCCURENCES     */ 00793000
         L     @10,CCAMCPL(,R11)                                   0299 00794000
         MVI   CTGNOFLD(@10),X'04'                                 0299 00795000
*   CTGFIELD(1)=CMASCFPL;           /* ASSOCIATION FPL               */ 00796000
         L     @15,CCACMSWA(,R11)                                  0300 00797000
         MVC   CTGFIELD(4,@10),CMASCFPL(@15)                       0300 00798000
*   CTGFIELD(2)=CCACPL->CTGFVT->CTGFVDCH->CTGFVAMD;                0301 00799000
         L     @01,CCACPL(,R11)                                    0301 00800000
         L     @01,CTGFVT(,@01)                                    0301 00801000
         L     @01,CTGFVDCH(,@01)                                  0301 00802000
         MVC   CTGFIELD+4(4,@10),CTGFVAMD(@01)                     0301 00803000
*   CTGFIELD(3)=CMLDTFPL;           /* LOW RANGE DATA OCCURENCE      */ 00804000
         MVC   CTGFIELD+8(4,@10),CMLDTFPL(@15)                     0302 00805000
*   CTGFIELD(4)=CMHDTFPL;           /* HIGH RANGE DATA OCCURENCE     */ 00806000
         MVC   CTGFIELD+12(4,@10),CMHDTFPL(@15)                    0303 00807000
*   RFY                                                            0304 00808000
*     CTGPL BASED(CCACPL);                                         0304 00809000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 00810000
         BAL   @14,EXIT                                            0305 00811000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 00812000
         DS 0F                                                          00813000
*   GEN(DC CL8'IGGPDCLD');          /* NAME OF FOLLOWING PROCEDURE   */ 00814000
         DC CL8'IGGPDCLD'                                               00815000
*   END;                            /* END OF INNER PROCEDURE        */ 00816000
@EL00004 DS    0H                                                  0308 00817000
@EF00004 DS    0H                                                  0308 00818000
@ER00004 BR    @14                                                 0308 00819000
@PB00004 DS    0H                                                  0309 00820000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 00821000
         EJECT                                                          00822000
*                                                                  0310 00823000
*/********************************************************************/ 00824000
*/*                                                                  */ 00825000
*/*        IGGPDCLD  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */ 00826000
*/*                                                                  */ 00827000
*/********************************************************************/ 00828000
*                                                                  0310 00829000
*IGGPDCLD:                                                         0310 00830000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 00831000
         B     @PB00005                                            0310 00832000
IGGPDCLD DS    0H                                                  0311 00833000
*Z027:                              /* LABEL FOR PROCEDURE TRACKING  */ 00834000
*Z027DCLD:                          /* LABEL FOR PROCEDURE TRACKING  */ 00835000
*   RFY                                                            0311 00836000
*    (R5,                                                          0311 00837000
*     R6,                                                          0311 00838000
*     R7,                                                          0311 00839000
*     R8,                                                          0311 00840000
*     R9,                                                          0311 00841000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 00842000
Z027     DS    0H                                                  0311 00843000
Z027DCLD DS    0H                                                  0312 00844000
*   RFY                                                            0312 00845000
*    (R2,                                                          0312 00846000
*     R3,                                                          0312 00847000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 00848000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 00849000
         STM 12,14,12(13)                                               00850000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 00851000
*                                                                  0314 00852000
         LA 13,12(13)                                                   00853000
*   /*****************************************************************/ 00854000
*   /*                                                               */ 00855000
*   /* INTERNAL PROCEDURE TO PROCESS THE LOW RANGE DATA INFO         */ 00856000
*   /*                                                               */ 00857000
*   /*****************************************************************/ 00858000
*                                                                  0315 00859000
*   RFY                                                            0315 00860000
*    (CMFPLREF) RSTD;                                              0315 00861000
*                                                                  0315 00862000
*   /*****************************************************************/ 00863000
*   /*                                                               */ 00864000
*   /* CONSTRUCT THE FPL AND OCCURRENCE FOR THE USE OF MODIFY        */ 00865000
*   /*                                                               */ 00866000
*   /*****************************************************************/ 00867000
*                                                                  0316 00868000
*   CMFPLREF=CMLDTFPL;              /* SET DATA FPL ADDRESS          */ 00869000
         L     @10,CCACMSWA(,R11)                                  0316 00870000
         L     CMFPLREF,CMLDTFPL(,@10)                             0316 00871000
*   CMFLDNAM='ENTVOL  ';            /* SET FIELD NAME                */ 00872000
         MVC   CMFLDNAM(8,CMFPLREF),@CC03264                       0317 00873000
*   CMFLDEVT=CMSWADTY(1);           /* SET DEVICE TYPE               */ 00874000
         MVC   CMFLDEVT(4,CMFPLREF),CMSWADTY(@10)                  0318 00875000
*   CMFLVOL=CTGFVVCH->CTGFVVLT->LTVOLSER(1);/* VOLUME ID             */ 00876000
         L     @01,CCACPL(,R11)                                    0319 00877000
         L     @15,CTGFVT(,@01)                                    0319 00878000
         L     @01,CTGFVVCH(,@15)                                  0319 00879000
         L     @01,CTGFVVLT(,@01)                                  0319 00880000
         MVC   CMFLVOL(6,CMFPLREF),LTVOLSER(@01)                   0319 00881000
*   CMFLVLPR=ON;                    /* SET PRIMARY VOLUME            */ 00882000
         OI    CMFLVLPR(CMFPLREF),B'10000000'                      0320 00883000
*   CMFLPHYB=CMPHYBLK(1);           /* SET PHYSICAL BLOCK SIZE       */ 00884000
         MVC   CMFLPHYB(4,CMFPLREF),CMPHYBLK(@10)                  0321 00885000
*   CMFLNBTK=CMBLKTRK(1);           /* SET NO. OF BLOCKS/TRACK       */ 00886000
         MVC   CMFLNBTK(2,CMFPLREF),CMBLKTRK(@10)                  0322 00887000
*   CMFLNTKA=CMTRKPCA(1);           /* SET NO. TRACKS PER CA         */ 00888000
         LH    @14,CMTRKPCA(,@10)                                  0323 00889000
         STH   @14,CMFLNTKA(,CMFPLREF)                             0323 00890000
*   CMFLSSDS=CCASSVOL;              /* SET DS DIR SEQ #      @Y30SSDC*/ 00891000
*                                                                  0324 00892000
         MVC   CMFLSSDS(2,CMFPLREF),CCASSVOL(R11)                  0324 00893000
*   /*****************************************************************/ 00894000
*   /*                                                               */ 00895000
*   /* SET UP THE KEY RANGES FOR THE LOW DATA RANGE                  */ 00896000
*   /*                                                               */ 00897000
*   /*****************************************************************/ 00898000
*                                                                  0325 00899000
*   CMFLLKLN=INCR1;                 /* SET LOW RANGE LENGTH          */ 00900000
         LA    @09,1                                               0325 00901000
         STH   @09,CMFLLKLN(,CMFPLREF)                             0325 00902000
*   RFY                                                            0326 00903000
*    (RANGLOCR) RSTD;                                              0326 00904000
*   RANGLOCR=ADDR(CMFLLKLN)+LENGTH(CMFLLKLN);/* KEY POSITON          */ 00905000
         LA    @08,2                                               0327 00906000
         LA    RANGLOCR,CMFLLKLN(,CMFPLREF)                        0327 00907000
         ALR   RANGLOCR,@08                                        0327 00908000
*   RANGLOCR->CTRNGVLU=LOWKEYLO;    /* SET LOW RANGE LOW KEY         */ 00909000
         MVI   CTRNGVLU(RANGLOCR),X'00'                            0328 00910000
*   RANGLOCR=RANGLOCR+CMFLLKLN;     /* HIGH KEY LENGTH LOCATION      */ 00911000
         ALR   RANGLOCR,@09                                        0329 00912000
*   RANGLOCR->VARWRKLN=INCR1;       /* LOW KEY RANGE HI KEY LEN      */ 00913000
         STH   @09,VARWRKLN(,RANGLOCR)                             0330 00914000
*   RANGLOCR=RANGLOCR+LENGTH(VARWRKLN);/* HI KEY POSITION            */ 00915000
         ALR   RANGLOCR,@08                                        0331 00916000
*   RANGLOCR->CTRNGVLU=LOWKEYHI;    /* LOW KEY RANGE HIGH VALUE      */ 00917000
         MVI   CTRNGVLU(RANGLOCR),X'3F'                            0332 00918000
*   CMEXTLST=RANGLOCR+CMFLLKLN;     /* LOCATION OF EXTENT LENGTH     */ 00919000
         ALR   @09,RANGLOCR                                        0333 00920000
         ST    @09,CMEXTLST(,@10)                                  0333 00921000
*   RFY                                                            0334 00922000
*    (RANGLOCR) UNRSTD;                                            0334 00923000
*                                                                  0334 00924000
*   /*****************************************************************/ 00925000
*   /*                                                               */ 00926000
*   /* PROCESS THE TOTAL CATALOG EXTENTS IN THE CCA AND SUB DIVIDE   */ 00927000
*   /* THE TOTAL SPACE BETWEEN THE LOW DATA KEY RANGE, THE HIGHER    */ 00928000
*   /* LEVELS OF THE INDEX, AND THE HIGH DATA KEY RANGE - TOTAL SPACE*/ 00929000
*   /* IS IN THE CCA FROM SUBALLOCATE                                */ 00930000
*   /*                                                               */ 00931000
*   /*****************************************************************/ 00932000
*                                                                  0335 00933000
*   GENWRKRG=CTGFVSPC->CTGFLPT(1)->SPCPRIMQ;/* CATALOG QT            */ 00934000
         L     @10,CTGFVSPC(,@15)                                  0335 00935000
         L     @10,CTGFLPT(,@10)                                   0335 00936000
         SLR   GENWRKRG,GENWRKRG                                   0335 00937000
         ICM   GENWRKRG,7,SPCPRIMQ(@10)                            0335 00938000
*   GENWRKRG=GENWRKRG-CMFLNTKA;     /* REMOVE HIGH LEVEL IX QTY      */ 00939000
         SLR   GENWRKRG,@14                                        0336 00940000
*   HIRANGEQ=(GENWRKRG/(CMFLNTKA*HIRNGPCT))*CMFLNTKA;              0337 00941000
         LR    @01,@14                                             0337 00942000
         MH    @01,@CH00092                                        0337 00943000
         LR    @06,GENWRKRG                                        0337 00944000
         SRDA  @06,32                                              0337 00945000
         DR    @06,@01                                             0337 00946000
         MR    @06,@14                                             0337 00947000
         LR    HIRANGEQ,@07                                        0337 00948000
*   IF HIRANGEQ=NONE THEN           /* CHECK FOR NO QUOTIENT         */ 00949000
         LTR   HIRANGEQ,HIRANGEQ                                   0338 00950000
         BNZ   @RF00338                                            0338 00951000
*     HIRANGEQ=CMFLNTKA;            /* SET HIGH RANGE QUANTITY       */ 00952000
         LR    HIRANGEQ,@14                                        0339 00953000
*   ELSE                                                           0340 00954000
*     ;                             /* HIGH RANGE ALREADY SET        */ 00955000
@RF00338 DS    0H                                                  0341 00956000
*   GENWRKRG=GENWRKRG-HIRANGEQ;     /* SPACE FOR LOW KEY RANGE       */ 00957000
         SLR   GENWRKRG,HIRANGEQ                                   0341 00958000
*   CCAIXEXT=INCR1;                 /* SET EXTENT INDEX VALUE        */ 00959000
         MVI   CCAIXEXT(R11),X'01'                                 0342 00960000
*   CMEXTLST=CMEXTLST+LENGTH(CMFLEXLN);/* EXTENTS POSITION           */ 00961000
         L     @10,CCACMSWA(,R11)                                  0343 00962000
         LA    @15,2                                               0343 00963000
         AL    @15,CMEXTLST(,@10)                                  0343 00964000
         ST    @15,CMEXTLST(,@10)                                  0343 00965000
*   RECRDRFR=CMSCTREC(1);           /* REFERENCE TO DATA RECORD      */ 00966000
         L     RECRDRFR,CMSCTREC(,@10)                             0344 00967000
*   RCDID=CTGTDATA;                 /* SET RECORD TYPE               */ 00968000
         MVI   RCDID(RECRDRFR),C'D'                                0345 00969000
*   CHIA=-INCR1;                    /* SET STARTING RBA IN DATA      */ 00970000
         MVC   CHIA(4,RECRDRFR),@CF03366                           0346 00971000
*Z028DCRC:                                                         0347 00972000
*   CALL IGGPDCRC;                  /* RBA AND CCHH PROCESS RTN      */ 00973000
Z028DCRC BAL   @14,IGGPDCRC                                        0347 00974000
*   RFY                                                            0348 00975000
*    (CMFPLREF) RSTD;                                              0348 00976000
*   CMEXTLST=CMEXTLST-LENGTH(CMFLEXLN);/* EXTENT LENGTH ADR          */ 00977000
         L     @10,CCACMSWA(,R11)                                  0349 00978000
         L     @15,CMEXTLST(,@10)                                  0349 00979000
         BCTR  @15,0                                               0349 00980000
         BCTR  @15,0                                               0349 00981000
         ST    @15,CMEXTLST(,@10)                                  0349 00982000
*   CMEXTLST->VARWRKLN=CMFLNOEX*LENGTH(CMFXECTS);/* LENGTH           */ 00983000
         SLR   @10,@10                                             0350 00984000
         IC    @10,CMFLNOEX(,CMFPLREF)                             0350 00985000
         MH    @10,@CH00179                                        0350 00986000
         STH   @10,VARWRKLN(,@15)                                  0350 00987000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 00988000
         BAL   @14,EXIT                                            0351 00989000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 00990000
         DS 0F                                                          00991000
*   GEN(DC CL8'IGGPDCIX');          /* NAME OF FOLLOWING PROCEDURE   */ 00992000
         DC CL8'IGGPDCIX'                                               00993000
*   END;                            /* END OF INNER PROCEDURE        */ 00994000
@EL00005 DS    0H                                                  0354 00995000
@EF00005 DS    0H                                                  0354 00996000
@ER00005 BR    @14                                                 0354 00997000
@PB00005 DS    0H                                                  0355 00998000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 00999000
         EJECT                                                          01000000
*                                                                  0356 01001000
*/********************************************************************/ 01002000
*/*                                                                  */ 01003000
*/*        IGGPDCIX  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */ 01004000
*/*                                                                  */ 01005000
*/********************************************************************/ 01006000
*                                                                  0356 01007000
*IGGPDCIX:                                                         0356 01008000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 01009000
         B     @PB00006                                            0356 01010000
IGGPDCIX DS    0H                                                  0357 01011000
*Z029:                              /* LABEL FOR PROCEDURE TRACKING  */ 01012000
*Z029DCIX:                          /* LABEL FOR PROCEDURE TRACKING  */ 01013000
*   RFY                                                            0357 01014000
*    (R5,                                                          0357 01015000
*     R6,                                                          0357 01016000
*     R7,                                                          0357 01017000
*     R8,                                                          0357 01018000
*     R9,                                                          0357 01019000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 01020000
Z029     DS    0H                                                  0357 01021000
Z029DCIX DS    0H                                                  0358 01022000
*   RFY                                                            0358 01023000
*    (R2,                                                          0358 01024000
*     R3,                                                          0358 01025000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 01026000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 01027000
         STM 12,14,12(13)                                               01028000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 01029000
*                                                                  0360 01030000
         LA 13,12(13)                                                   01031000
*   /*****************************************************************/ 01032000
*   /*                                                               */ 01033000
*   /* INTERNAL PROCEDURE TO PROCESS THE HIGH LEVEL INDEX DATA       */ 01034000
*   /*                                                               */ 01035000
*   /*****************************************************************/ 01036000
*                                                                  0361 01037000
*   RFY                                                            0361 01038000
*    (CMFPLREF) RSTD;                                              0361 01039000
*                                                                  0361 01040000
*   /*****************************************************************/ 01041000
*   /*                                                               */ 01042000
*   /* BUILD THE FPL AND VOLUME OCCURRENCE STRUCTURE FOR THE         */ 01043000
*   /* NON-SEQUENCE SET LEVELS OF THE CATALOG INDEX SECTION          */ 01044000
*   /*                                                               */ 01045000
*   /*****************************************************************/ 01046000
*                                                                  0362 01047000
*   CMFPLREF=CMHIXFPL;              /* GET STRUCTURE ADDRESS         */ 01048000
         L     @10,CCACMSWA(,R11)                                  0362 01049000
         L     CMFPLREF,CMHIXFPL(,@10)                             0362 01050000
*   CMFLDNAM='ENTVOL  ';            /* SET FIELD NAME                */ 01051000
         MVC   CMFLDNAM(8,CMFPLREF),@CC03264                       0363 01052000
*   CMFLDEVT=CMSWADTY(2);           /* SET DEVICE TYPE               */ 01053000
         MVC   CMFLDEVT(4,CMFPLREF),CMSWADTY+16(@10)               0364 01054000
*   CMFLVOL=CMLDTFPL->CMFLVOL;      /* VOLUME ID-SAME AS DATA        */ 01055000
         L     @01,CMLDTFPL(,@10)                                  0365 01056000
         MVC   CMFLVOL(6,CMFPLREF),CMFLVOL(@01)                    0365 01057000
*   CMFLVLPR=ON;                    /* SET PRIME VOLUME              */ 01058000
         OI    CMFLVLPR(CMFPLREF),B'10000000'                      0366 01059000
*   CMFLPHYB=CMPHYBLK(2);           /* PHYSICAL BLOCK SIZE           */ 01060000
         MVC   CMFLPHYB(4,CMFPLREF),CMPHYBLK+16(@10)               0367 01061000
*   CMFLNBTK=CMBLKTRK(2);           /* NO. BLOCKS PER TRACK          */ 01062000
         MVC   CMFLNBTK(2,CMFPLREF),CMBLKTRK+16(@10)               0368 01063000
*   CMFLNTKA=CMTRKPCA(2);           /* TRACKS PER ALLOCATE UNIT      */ 01064000
         MVC   CMFLNTKA(2,CMFPLREF),CMTRKPCA+16(@10)               0369 01065000
*   CMFLLKLN=CLEAR;                 /* NO KEY LENGTH FOR INDEX       */ 01066000
         SLR   @15,@15                                             0370 01067000
         STH   @15,CMFLLKLN(,CMFPLREF)                             0370 01068000
*   CMFLHKLN=CLEAR;                 /* NO KEY LENGTH FOR INDEX       */ 01069000
*                                                                  0371 01070000
         STH   @15,CMFLHKLN(,CMFPLREF)                             0371 01071000
*   /*****************************************************************/ 01072000
*   /*                                                               */ 01073000
*   /* NEED TO CALL SUBALLOCATE TO SET UP AN INDEX DATA SET DIRECTORY*/ 01074000
*   /* GROUP IN THE VOLUME RECORD PREPARE AND GET THE INDEX PHYSICAL */ 01075000
*   /* SPACE                                                         */ 01076000
*   /*                                                               */ 01077000
*   /*****************************************************************/ 01078000
*                                                                  0372 01079000
*   GENWRKRG=CMTRKPCA(1);           /* SIZE OF 1 DATA CNTRL AREA     */ 01080000
         LH    GENWRKRG,CMTRKPCA(,@10)                             0372 01081000
*   CMEXTLST=ADDR(CMFLEND);         /* POSITION FOR EXTENT           */ 01082000
         LA    @15,CMFLEND(,CMFPLREF)                              0373 01083000
         ST    @15,CMEXTLST(,@10)                                  0373 01084000
*   RECRDRFR=CMSCTREC(2);           /* INDEX RECORD ADDRESSABLTY     */ 01085000
         L     RECRDRFR,CMSCTREC+4(,@10)                           0374 01086000
*   RCDID=CTGTINDX;                 /* SET RECORD TYPE               */ 01087000
         MVI   RCDID(RECRDRFR),C'I'                                0375 01088000
*   CHIA=-INCR1;                    /* STARTING INDEX RBA            */ 01089000
         MVC   CHIA(4,RECRDRFR),@CF03366                           0376 01090000
*Z030DCRC:                                                         0377 01091000
*   CALL IGGPDCRC;                  /* RBA AND CCHH PROCESS RTN      */ 01092000
Z030DCRC BAL   @14,IGGPDCRC                                        0377 01093000
*   RFY                                                            0378 01094000
*    (CMFPLREF) RSTD;                                              0378 01095000
*   CMFLEXLN=CMFLNOEX*LENGTH(CMFXECTS);/* LENGTH OF EXTENTS          */ 01096000
*                                                                  0379 01097000
         SLR   @10,@10                                             0379 01098000
         IC    @10,CMFLNOEX(,CMFPLREF)                             0379 01099000
         LR    @15,@10                                             0379 01100000
         MH    @15,@CH00179                                        0379 01101000
         STH   @15,CMFLEXLN(,CMFPLREF)                             0379 01102000
*   /*****************************************************************/ 01103000
*   /*                                                               */ 01104000
*   /* UPDATE THE INDEX AMDSB - EXTENTS                              */ 01105000
*   /*                                                               */ 01106000
*   /*****************************************************************/ 01107000
*                                                                  0380 01108000
*   CTGFVICH->CTGFVAMD->CTGFLPT(1)->AMDNEXT=CMFLNOEX;              0380 01109000
         L     @01,CCACPL(,R11)                                    0380 01110000
         L     @01,CTGFVT(,@01)                                    0380 01111000
         L     @01,CTGFVICH(,@01)                                  0380 01112000
         L     @01,CTGFVAMD(,@01)                                  0380 01113000
         L     @01,CTGFLPT(,@01)                                   0380 01114000
         STH   @10,AMDNEXT(,@01)                                   0380 01115000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 01116000
         BAL   @14,EXIT                                            0381 01117000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 01118000
         DS 0F                                                          01119000
*   GEN(DC CL8'IGGPDCHD');          /* NAME OF FOLLOWING PROCEDURE   */ 01120000
         DC CL8'IGGPDCHD'                                               01121000
*   END;                            /* END OF INNER PROCEDURE        */ 01122000
@EL00006 DS    0H                                                  0384 01123000
@EF00006 DS    0H                                                  0384 01124000
@ER00006 BR    @14                                                 0384 01125000
@PB00006 DS    0H                                                  0385 01126000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 01127000
         EJECT                                                          01128000
*                                                                  0386 01129000
*/********************************************************************/ 01130000
*/*                                                                  */ 01131000
*/*        IGGPDCHD  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */ 01132000
*/*                                                                  */ 01133000
*/********************************************************************/ 01134000
*                                                                  0386 01135000
*IGGPDCHD:                                                         0386 01136000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 01137000
         B     @PB00007                                            0386 01138000
IGGPDCHD DS    0H                                                  0387 01139000
*Z031:                              /* LABEL FOR PROCEDURE TRACKING  */ 01140000
*Z031DCHD:                          /* LABEL FOR PROCEDURE TRACKING  */ 01141000
*   RFY                                                            0387 01142000
*    (R5,                                                          0387 01143000
*     R6,                                                          0387 01144000
*     R7,                                                          0387 01145000
*     R8,                                                          0387 01146000
*     R9,                                                          0387 01147000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 01148000
Z031     DS    0H                                                  0387 01149000
Z031DCHD DS    0H                                                  0388 01150000
*   RFY                                                            0388 01151000
*    (R2,                                                          0388 01152000
*     R3,                                                          0388 01153000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 01154000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 01155000
         STM 12,14,12(13)                                               01156000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 01157000
*                                                                  0390 01158000
         LA 13,12(13)                                                   01159000
*   /*****************************************************************/ 01160000
*   /*                                                               */ 01161000
*   /* INTERNAL PROCEDURE TO PROCESS THE HIGH RANGE DATA INFO        */ 01162000
*   /*                                                               */ 01163000
*   /*****************************************************************/ 01164000
*                                                                  0391 01165000
*   RFY                                                            0391 01166000
*    (CMFPLREF) RSTD;                                              0391 01167000
*                                                                  0391 01168000
*   /*****************************************************************/ 01169000
*   /*                                                               */ 01170000
*   /* MODIFY AND COMPLETE THE HIGH DATA KEY RANGE VOLUME AND FPL    */ 01171000
*   /* STRUCTURE                                                     */ 01172000
*   /*                                                               */ 01173000
*   /*****************************************************************/ 01174000
*                                                                  0392 01175000
*   CMFPLREF=CMHDTFPL;              /* STRUCTURE ADDRESS             */ 01176000
         L     @10,CCACMSWA(,R11)                                  0392 01177000
         L     CMFPLREF,CMHDTFPL(,@10)                             0392 01178000
*   CMFLNOEX=OKAY;                  /* CLEAR NO. OF EXTENTS          */ 01179000
*                                                                  0393 01180000
         MVI   CMFLNOEX(CMFPLREF),X'00'                            0393 01181000
*   /*****************************************************************/ 01182000
*   /*                                                               */ 01183000
*   /* RE-SET THE KEY RANGE VALUES                                   */ 01184000
*   /*                                                               */ 01185000
*   /*****************************************************************/ 01186000
*                                                                  0394 01187000
*   RFY                                                            0394 01188000
*    (RANGLOCR) RSTD;                                              0394 01189000
*   RANGLOCR=ADDR(CMFLLKLN)+LENGTH(CMFLLKLN);/* KEY POSITION         */ 01190000
         LA    @15,2                                               0395 01191000
         LA    RANGLOCR,CMFLLKLN(,CMFPLREF)                        0395 01192000
         ALR   RANGLOCR,@15                                        0395 01193000
*   RANGLOCR->CTRNGVLU=HIKEYLOW;    /* HIGH RANGE LOW KEY VALUE      */ 01194000
         MVI   CTRNGVLU(RANGLOCR),X'40'                            0396 01195000
*   RANGLOCR=RANGLOCR+CMFLLKLN+LENGTH(CMFLHKLN);                   0397 01196000
         LH    @06,CMFLLKLN(,CMFPLREF)                             0397 01197000
         LR    @14,RANGLOCR                                        0397 01198000
         ALR   @14,@06                                             0397 01199000
         ALR   @14,@15                                             0397 01200000
         LR    RANGLOCR,@14                                        0397 01201000
*   RANGLOCR->CTRNGVLU=HIKEYHI;     /* HIGH RANGE HIGH KEY VALUE     */ 01202000
         MVI   CTRNGVLU(RANGLOCR),X'FF'                            0398 01203000
*   CMEXTLST=RANGLOCR+CMFLLKLN+LENGTH(CMFLEXLN);                   0399 01204000
         ALR   @06,RANGLOCR                                        0399 01205000
         ALR   @06,@15                                             0399 01206000
         ST    @06,CMEXTLST(,@10)                                  0399 01207000
*   RFY                                                            0400 01208000
*    (RANGLOCR) UNRSTD;                                            0400 01209000
*   GENWRKRG=HIRANGEQ;              /* SPACE FOR HIGH KEY RANGE      */ 01210000
         LR    GENWRKRG,HIRANGEQ                                   0401 01211000
*   RECRDRFR=CMSCTREC(1);           /* REFERENCE TO DATA RECORD      */ 01212000
         L     RECRDRFR,CMSCTREC(,@10)                             0402 01213000
*Z032DCRC:                                                         0403 01214000
*   CALL IGGPDCRC;                  /* RBA AND CCHH PROCESS RTN      */ 01215000
Z032DCRC BAL   @14,IGGPDCRC                                        0403 01216000
*   RFY                                                            0404 01217000
*    (CMFPLREF) RSTD;                                              0404 01218000
*   CMEXTLST=CMEXTLST-LENGTH(CMFLEXLN);/* EXTENT LENGTH ADDR         */ 01219000
         L     @10,CCACMSWA(,R11)                                  0405 01220000
         L     @15,CMEXTLST(,@10)                                  0405 01221000
         BCTR  @15,0                                               0405 01222000
         BCTR  @15,0                                               0405 01223000
         ST    @15,CMEXTLST(,@10)                                  0405 01224000
*   CMEXTLST->VARWRKLN=CMFLNOEX*LENGTH(CMFXECTS);/* LENGTH           */ 01225000
         SLR   @14,@14                                             0406 01226000
         IC    @14,CMFLNOEX(,CMFPLREF)                             0406 01227000
         LR    @09,@14                                             0406 01228000
         MH    @09,@CH00179                                        0406 01229000
         STH   @09,VARWRKLN(,@15)                                  0406 01230000
*   CHIA=CHIA+INCR1;                /* ADJUST DATA HIGH RBA          */ 01231000
*                                                                  0407 01232000
         LA    @15,1                                               0407 01233000
         AL    @15,CHIA(,RECRDRFR)                                 0407 01234000
         ST    @15,CHIA(,RECRDRFR)                                 0407 01235000
*   /*****************************************************************/ 01236000
*   /*                                                               */ 01237000
*   /* UPDATE THE DATA AMDSB - EXTENTS AND FREE BYTES                */ 01238000
*   /*                                                               */ 01239000
*   /*****************************************************************/ 01240000
*                                                                  0408 01241000
*   CTGFVDCH->CTGFVAMD->CTGFLPT(1)->AMDASPA=CHIA;                  0408 01242000
         L     @01,CCACPL(,R11)                                    0408 01243000
         L     @01,CTGFVT(,@01)                                    0408 01244000
         L     @01,CTGFVDCH(,@01)                                  0408 01245000
         L     @01,CTGFVAMD(,@01)                                  0408 01246000
         L     @09,CTGFLPT(,@01)                                   0408 01247000
         ST    @15,AMDASPA(,@09)                                   0408 01248000
*   CTGFVDCH->CTGFVAMD->CTGFLPT(1)->AMDNEXT=CMFLNOEX+CMLDTFPL->CMFLNOEX 01249000
*       ;                           /* TOTAL DATA EXTENTS            */ 01250000
         L     @10,CMLDTFPL(,@10)                                  0409 01251000
         SLR   @15,@15                                             0409 01252000
         IC    @15,CMFLNOEX(,@10)                                  0409 01253000
         ALR   @14,@15                                             0409 01254000
         STH   @14,AMDNEXT(,@09)                                   0409 01255000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 01256000
         BAL   @14,EXIT                                            0410 01257000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 01258000
         DS 0F                                                          01259000
*   GEN(DC CL8'IGGPDCFL');          /* NAME OF FOLLOWING PROCEDURE   */ 01260000
         DC CL8'IGGPDCFL'                                               01261000
*   END;                            /* END OF INNER PROCEDURE        */ 01262000
@EL00007 DS    0H                                                  0413 01263000
@EF00007 DS    0H                                                  0413 01264000
@ER00007 BR    @14                                                 0413 01265000
@PB00007 DS    0H                                                  0414 01266000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 01267000
         EJECT                                                          01268000
*                                                                  0415 01269000
*/********************************************************************/ 01270000
*/*                                                                  */ 01271000
*/*        IGGPDCFL  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */ 01272000
*/*                                                                  */ 01273000
*/********************************************************************/ 01274000
*                                                                  0415 01275000
*IGGPDCFL:                                                         0415 01276000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 01277000
         B     @PB00008                                            0415 01278000
IGGPDCFL DS    0H                                                  0416 01279000
*Z033:                              /* LABEL FOR PROCEDURE TRACKING  */ 01280000
*Z033DCFL:                          /* LABEL FOR PROCEDURE TRACKING  */ 01281000
*   RFY                                                            0416 01282000
*    (R5,                                                          0416 01283000
*     R6,                                                          0416 01284000
*     R7,                                                          0416 01285000
*     R8,                                                          0416 01286000
*     R9,                                                          0416 01287000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 01288000
Z033     DS    0H                                                  0416 01289000
Z033DCFL DS    0H                                                  0417 01290000
*   RFY                                                            0417 01291000
*    (R2,                                                          0417 01292000
*     R3,                                                          0417 01293000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 01294000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 01295000
         STM 12,14,12(13)                                               01296000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 01297000
*                                                                  0419 01298000
         LA 13,12(13)                                                   01299000
*   /*****************************************************************/ 01300000
*   /*                                                               */ 01301000
*   /* INTERNAL PROCEDURE TO PREPARE THE VOLUME FPLS                 */ 01302000
*   /*                                                               */ 01303000
*   /*****************************************************************/ 01304000
*                                                                  0420 01305000
*   RFY                                                            0420 01306000
*    (CMFPLREF) RSTD;                                              0420 01307000
*   RFY                                                            0421 01308000
*     CTGFL BASED(CMFPLREF);                                       0421 01309000
*   CTGFLDNO=INCR1;                 /* SET NO. LENGTH/ADDR PAIRS     */ 01310000
         MVI   CTGFLDNO(CMFPLREF),X'01'                            0422 01311000
*   CTGFLDNM=ADDR(CMFLDNAM);        /* FIELD NAME ADDRESS            */ 01312000
         LA    @10,CMFLDNAM(,CMFPLREF)                             0423 01313000
         ST    @10,CTGFLDNM(,CMFPLREF)                             0423 01314000
*   CTGFLNG(1)=GENWRKRG;            /* LENGTH OF DATA                */ 01315000
         ST    GENWRKRG,CTGFLNG(,CMFPLREF)                         0424 01316000
*   CTGFLPT(1)=ADDR(CMFLRLRP);      /* DATA ADDRESS                  */ 01317000
         LA    @10,CMFLRLRP(,CMFPLREF)                             0425 01318000
         ST    @10,CTGFLPT(,CMFPLREF)                              0425 01319000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 01320000
         BAL   @14,EXIT                                            0426 01321000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 01322000
         DS 0F                                                          01323000
*   GEN(DC CL8'IGGPDCRC');          /* NAME OF FOLLOWING PROCEDURE   */ 01324000
         DC CL8'IGGPDCRC'                                               01325000
*   END;                            /* END OF INNER PROCEDURE        */ 01326000
@EL00008 DS    0H                                                  0429 01327000
@EF00008 DS    0H                                                  0429 01328000
@ER00008 BR    @14                                                 0429 01329000
@PB00008 DS    0H                                                  0430 01330000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 01331000
         EJECT                                                          01332000
*                                                                  0431 01333000
*/********************************************************************/ 01334000
*/*                                                                  */ 01335000
*/*        IGGPDCRC  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */ 01336000
*/*                                                                  */ 01337000
*/********************************************************************/ 01338000
*                                                                  0431 01339000
*IGGPDCRC:                                                         0431 01340000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 01341000
         B     @PB00009                                            0431 01342000
IGGPDCRC DS    0H                                                  0432 01343000
*   GEN(ENTRY IGGPDCRC );           /* IDENTIFY ENTRY-POINT SYMBOL   */ 01344000
         ENTRY IGGPDCRC                                                 01345000
*Z034:                              /* LABEL FOR PROCEDURE TRACKING  */ 01346000
*Z034DCRC:                          /* LABEL FOR PROCEDURE TRACKING  */ 01347000
*   RFY                                                            0433 01348000
*    (R5,                                                          0433 01349000
*     R6,                                                          0433 01350000
*     R7,                                                          0433 01351000
*     R8,                                                          0433 01352000
*     R9,                                                          0433 01353000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 01354000
Z034     DS    0H                                                  0433 01355000
Z034DCRC DS    0H                                                  0434 01356000
*   RFY                                                            0434 01357000
*    (R2,                                                          0434 01358000
*     R3,                                                          0434 01359000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 01360000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 01361000
         STM 12,14,12(13)                                               01362000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 01363000
         LA 13,12(13)                                                   01364000
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */ 01365000
         BALR 12,0                                                      01366000
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */ 01367000
         LA 15,*-IGGSEGST(0,0)                                          01368000
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE       */ 01369000
*                                                                  0439 01370000
         SR 12,15                                                       01371000
*   /*****************************************************************/ 01372000
*   /*                                                               */ 01373000
*   /*                                                       @Y30SSDC*/ 01374000
*   /* INTERNAL ROUTINE TO DETERMINE LOGICAL DIVISION OF THE CATALOG */ 01375000
*   /* PHYSICAL SPACE AND TO COMPUTE THE PROPER PHYSICAL AND LOGICAL */ 01376000
*   /* BOUNDARIES                                                    */ 01377000
*   /*                                                               */ 01378000
*   /*****************************************************************/ 01379000
*                                                                  0440 01380000
*   RFY                                                            0440 01381000
*    (CMFPLREF) RSTD;                                              0440 01382000
*   SPACINDC='GO';                  /* SET PROCESS INDICATOR         */ 01383000
         L     @10,CCACMSWA(,R11)                                  0441 01384000
         MVC   SPACINDC(2,@10),@CC03301                            0441 01385000
*   IF CMFLNOEX=OKAY THEN           /* PROCESSING NEW EXTENTS        */ 01386000
         CLI   CMFLNOEX(CMFPLREF),0                                0442 01387000
         BNE   @RF00442                                            0442 01388000
*     DO CCAIXEXT=CCAIXEXT TO CCANDEXT WHILE(SPACINDC='GO');       0443 01389000
         SLR   @10,@10                                             0443 01390000
         IC    @10,CCAIXEXT(,R11)                                  0443 01391000
         B     @DE00443                                            0443 01392000
@DL00443 L     @10,CCACMSWA(,R11)                                  0443 01393000
         CLC   SPACINDC(2,@10),@CC03301                            0443 01394000
         BNE   @DC00443                                            0443 01395000
*       CMFLNOEX=CMFLNOEX+INCR1;    /* INCREMENT EXTENT COUNTER      */ 01396000
         LA    @15,1                                               0444 01397000
         SLR   @14,@14                                             0444 01398000
         IC    @14,CMFLNOEX(,CMFPLREF)                             0444 01399000
         ALR   @15,@14                                             0444 01400000
         STC   @15,CMFLNOEX(,CMFPLREF)                             0444 01401000
*       CMFXEXSS(CMFLNOEX)=CCAEXTSS(CCAIXEXT);/* EXTENT SS           */ 01402000
         MH    @15,@CH00179                                        0445 01403000
         L     @10,CMEXTLST(,@10)                                  0445 01404000
         SLR   @14,@14                                             0445 01405000
         IC    @14,CCAIXEXT(,R11)                                  0445 01406000
         SLA   @14,3                                               0445 01407000
         ST    @14,@TF00001                                        0445 01408000
         ALR   @14,R11                                             0445 01409000
         SLR   @09,@09                                             0445 01410000
         ICM   @09,3,CCAEXTSS-8(@14)                               0445 01411000
         LA    @08,0(@15,@10)                                      0445 01412000
         AL    @08,@CF03375                                        0445 01413000
         STH   @09,CMFXEXSS(,@08)                                  0445 01414000
*       CMFXEXST(CMFLNOEX)=CCAEXTAD(CCAIXEXT);/* START CCHH          */ 01415000
         ST    @15,@TF00002                                        0446 01416000
         ALR   @15,@10                                             0446 01417000
         AL    @15,@CF03376                                        0446 01418000
         LR    @14,R11                                             0446 01419000
         AL    @14,@TF00001                                        0446 01420000
         MVC   CMFXEXST-2(4,@15),CCAEXTAD-8(@14)                   0446 01421000
*       IF GENWRKRG>CCAEXTTH(CCAIXEXT) THEN/* SMALL EXTENT           */ 01422000
         L     @01,@TF00001                                        0447 01423000
         LH    @15,CCAEXTTH-8(@01,R11)                             0447 01424000
         CR    GENWRKRG,@15                                        0447 01425000
         BNH   @RF00447                                            0447 01426000
*         CMFXNOTT(CMFLNOEX)=CCAEXTTH(CCAIXEXT);/* USE ALL           */ 01427000
         L     @14,@TF00002                                        0448 01428000
         AL    @10,@CF03377                                        0448 01429000
         STH   @15,CMFXNOTT-10(@14,@10)                            0448 01430000
*       ELSE                        /* EXTENT LARGER THEN NEED       */ 01431000
*         DO;                                                      0449 01432000
         B     @RC00447                                            0449 01433000
@RF00447 DS    0H                                                  0450 01434000
*           CMFXNOTT(CMFLNOEX)=GENWRKRG;/* SET TRACKS NEED           */ 01435000
         SLR   @10,@10                                             0450 01436000
         IC    @10,CMFLNOEX(,CMFPLREF)                             0450 01437000
         MH    @10,@CH00179                                        0450 01438000
         L     @15,CCACMSWA(,R11)                                  0450 01439000
         L     @01,CMEXTLST(,@15)                                  0450 01440000
         AL    @01,@CF03377                                        0450 01441000
         STH   GENWRKRG,CMFXNOTT-10(@10,@01)                       0450 01442000
*           CCAEXTTH(CCAIXEXT)=CCAEXTTH(CCAIXEXT)-GENWRKRG;        0451 01443000
         SLR   @10,@10                                             0451 01444000
         IC    @10,CCAIXEXT(,R11)                                  0451 01445000
         SLA   @10,3                                               0451 01446000
         LH    @14,CCAEXTTH-8(@10,R11)                             0451 01447000
         SLR   @14,GENWRKRG                                        0451 01448000
         STH   @14,CCAEXTTH-8(@10,R11)                             0451 01449000
*           SPACINDC='NG';          /* SET PROCESS DONE              */ 01450000
         MVC   SPACINDC(2,@15),@CC03302                            0452 01451000
*         END;                                                     0453 01452000
*       CMFXEDCC(CMFLNOEX)=(CMFXSTHH(CMFLNOEX)-INCR1+CMFXNOTT(CMFLNOEX) 01453000
*           )/CMTRKCYL(1);                                         0454 01454000
@RC00447 SLR   @10,@10                                             0454 01455000
         IC    @10,CMFLNOEX(,CMFPLREF)                             0454 01456000
         MH    @10,@CH00179                                        0454 01457000
         L     @15,CCACMSWA(,R11)                                  0454 01458000
         L     @14,CMEXTLST(,@15)                                  0454 01459000
         LA    @01,0(@10,@14)                                      0454 01460000
         AL    @01,@CF03378                                        0454 01461000
         LH    @09,CMFXSTHH-4(,@01)                                0454 01462000
         BCTR  @09,0                                               0454 01463000
         LA    @08,0(@10,@14)                                      0454 01464000
         AL    @08,@CF03377                                        0454 01465000
         AH    @09,CMFXNOTT-10(,@08)                               0454 01466000
         LH    @15,CMTRKCYL(,@15)                                  0454 01467000
         LR    @00,@09                                             0454 01468000
         SRDA  @00,32                                              0454 01469000
         DR    @00,@15                                             0454 01470000
         LA    @09,0(@10,@14)                                      0454 01471000
         AL    @09,@CF03379                                        0454 01472000
         STH   @01,CMFXEDCC-6(,@09)                                0454 01473000
*       CMFXEDHH(CMFLNOEX)=(CMFXSTHH(CMFLNOEX)-INCR1+CMFXNOTT(CMFLNOEX) 01474000
*           )//CMTRKCYL(1);         /* END HH VALUE                  */ 01475000
         LA    @01,0(@10,@14)                                      0455 01476000
         AL    @01,@CF03378                                        0455 01477000
         LH    @09,CMFXSTHH-4(,@01)                                0455 01478000
         BCTR  @09,0                                               0455 01479000
         LA    @08,0(@10,@14)                                      0455 01480000
         AL    @08,@CF03377                                        0455 01481000
         AH    @09,CMFXNOTT-10(,@08)                               0455 01482000
         LR    @00,@09                                             0455 01483000
         SRDA  @00,32                                              0455 01484000
         DR    @00,@15                                             0455 01485000
         LA    @01,0(@10,@14)                                      0455 01486000
         AL    @01,@CF03380                                        0455 01487000
         STH   @00,CMFXEDHH-8(,@01)                                0455 01488000
*       CMFXEDCC(CMFLNOEX)=CMFXEDCC(CMFLNOEX)+CMFXSTCC(CMFLNOEX);/*     01489000
*                                      INDING CC VALUE               */ 01490000
*                                                                  0456 01491000
         LA    @01,0(@10,@14)                                      0456 01492000
         AL    @01,@CF03379                                        0456 01493000
         LH    @15,CMFXEDCC-6(,@01)                                0456 01494000
         LA    @01,0(@10,@14)                                      0456 01495000
         AL    @01,@CF03376                                        0456 01496000
         AH    @15,CMFXSTCC-2(,@01)                                0456 01497000
         AL    @14,@CF03379                                        0456 01498000
         STH   @15,CMFXEDCC-6(@10,@14)                             0456 01499000
*       /*************************************************************/ 01500000
*       /*                                                           */ 01501000
*       /* COMPUTE RBAS                                              */ 01502000
*       /*                                                           */ 01503000
*       /*************************************************************/ 01504000
*                                                                  0457 01505000
*PLSFIXA:                                                          0457 01506000
*       CMFXLRBA(CMFLNOEX)=CHIA+INCR1;/* SET START DDDD              */ 01507000
PLSFIXA  SLR   @10,@10                                             0457 01508000
         IC    @10,CMFLNOEX(,CMFPLREF)                             0457 01509000
         MH    @10,@CH00179                                        0457 01510000
         L     @15,CCACMSWA(,R11)                                  0457 01511000
         L     @14,CMEXTLST(,@15)                                  0457 01512000
         LA    @09,1                                               0457 01513000
         AL    @09,CHIA(,RECRDRFR)                                 0457 01514000
         LA    @08,0(@10,@14)                                      0457 01515000
         AL    @08,@CF03381                                        0457 01516000
         ST    @09,CMFXLRBA-12(,@08)                               0457 01517000
*       IF RCDID=CTGTDATA THEN      /* DATA WITH SEQ SET W/DATA      */ 01518000
         CLI   RCDID(RECRDRFR),C'D'                                0458 01519000
         BNE   @RF00458                                            0458 01520000
*         CMFXHRBA(CMFLNOEX)=CMBLKTRK(1)*CMPHYBLK(1)*(CMFXNOTT(CMFLNOEX 01521000
*             )-(CMFXNOTT(CMFLNOEX)/CMTRKPCA(1)))+CMFXLRBA(CMFLNOEX)-   01522000
*             INCR1;                                               0459 01523000
         L     @01,CMPHYBLK(,@15)                                  0459 01524000
         MH    @01,CMBLKTRK(,@15)                                  0459 01525000
         LA    @08,0(@10,@14)                                      0459 01526000
         AL    @08,@CF03377                                        0459 01527000
         LH    @08,CMFXNOTT-10(,@08)                               0459 01528000
         LR    @06,@08                                             0459 01529000
         SRDA  @06,32                                              0459 01530000
         LH    @15,CMTRKPCA(,@15)                                  0459 01531000
         DR    @06,@15                                             0459 01532000
         SLR   @08,@07                                             0459 01533000
         MR    @00,@08                                             0459 01534000
         ALR   @01,@09                                             0459 01535000
         BCTR  @01,0                                               0459 01536000
         AL    @14,@CF03382                                        0459 01537000
         ST    @01,CMFXHRBA-16(@10,@14)                            0459 01538000
*       ELSE                        /* HIGH LEVEL INDEX EXTENT       */ 01539000
*         CMFXHRBA(CMFLNOEX)=CMPHYBLK(2)*CMFXNOTT(CMFLNOEX)*CMBLKTRK(2) 01540000
*             +CMFXLRBA(CMFLNOEX)-INCR1;                           0460 01541000
         B     @RC00458                                            0460 01542000
@RF00458 SLR   @10,@10                                             0460 01543000
         IC    @10,CMFLNOEX(,CMFPLREF)                             0460 01544000
         MH    @10,@CH00179                                        0460 01545000
         L     @15,CCACMSWA(,R11)                                  0460 01546000
         L     @14,CMEXTLST(,@15)                                  0460 01547000
         L     @01,CMPHYBLK+16(,@15)                               0460 01548000
         LA    @09,0(@10,@14)                                      0460 01549000
         AL    @09,@CF03377                                        0460 01550000
         MH    @01,CMFXNOTT-10(,@09)                               0460 01551000
         MH    @01,CMBLKTRK+16(,@15)                               0460 01552000
         LA    @15,0(@10,@14)                                      0460 01553000
         AL    @15,@CF03381                                        0460 01554000
         AL    @01,CMFXLRBA-12(,@15)                               0460 01555000
         BCTR  @01,0                                               0460 01556000
         AL    @14,@CF03382                                        0460 01557000
         ST    @01,CMFXHRBA-16(@10,@14)                            0460 01558000
*       CHIA=CMFXHRBA(CMFLNOEX);    /* NEW HIGH ALLOCATED            */ 01559000
@RC00458 SLR   @10,@10                                             0461 01560000
         IC    @10,CMFLNOEX(,CMFPLREF)                             0461 01561000
         MH    @10,@CH00179                                        0461 01562000
         L     @15,CCACMSWA(,R11)                                  0461 01563000
         L     @14,CMEXTLST(,@15)                                  0461 01564000
         LA    @01,0(@10,@14)                                      0461 01565000
         AL    @01,@CF03382                                        0461 01566000
         L     @09,CMFXHRBA-16(,@01)                               0461 01567000
         ST    @09,CHIA(,RECRDRFR)                                 0461 01568000
*       IF CCAEXTTH(CCAIXEXT)^=CLEAR THEN/* NEED TO UPDATE           */ 01569000
         SLR   @09,@09                                             0462 01570000
         SLR   @08,@08                                             0462 01571000
         IC    @08,CCAIXEXT(,R11)                                  0462 01572000
         SLA   @08,3                                               0462 01573000
         CH    @09,CCAEXTTH-8(@08,R11)                             0462 01574000
         BE    @RF00462                                            0462 01575000
*         DO;                                                      0463 01576000
*           CCAEXTCC(CCAIXEXT)=CMFXEDCC(CMFLNOEX);                 0464 01577000
         LA    @01,0(@10,@14)                                      0464 01578000
         AL    @01,@CF03379                                        0464 01579000
         LH    @07,CMFXEDCC-6(,@01)                                0464 01580000
         STH   @07,CCAEXTCC-8(@08,R11)                             0464 01581000
*           CCAEXTHH(CCAIXEXT)=CMFXEDHH(CMFLNOEX)+INCR1;           0465 01582000
         LA    @07,1                                               0465 01583000
         AL    @14,@CF03380                                        0465 01584000
         LH    @10,CMFXEDHH-8(@10,@14)                             0465 01585000
         ALR   @10,@07                                             0465 01586000
         STH   @10,CCAEXTHH-8(@08,R11)                             0465 01587000
*           IF CCAEXTHH(CCAIXEXT)=CMTRKCYL(1) THEN                 0466 01588000
         CH    @10,CMTRKCYL(,@15)                                  0466 01589000
         BNE   @RF00466                                            0466 01590000
*             DO;                   /* UPDATE TO NEXT CYLINDER       */ 01591000
*               CCAEXTHH(CCAIXEXT)=CLEAR;                          0468 01592000
         STH   @09,CCAEXTHH-8(@08,R11)                             0468 01593000
*               CCAEXTCC(CCAIXEXT)=CCAEXTCC(CCAIXEXT)+INCR1;       0469 01594000
         AH    @07,CCAEXTCC-8(@08,R11)                             0469 01595000
         STH   @07,CCAEXTCC-8(@08,R11)                             0469 01596000
*             END;                                                 0470 01597000
*         END;                                                     0471 01598000
@RF00466 DS    0H                                                  0472 01599000
*       IF SPACINDC='NG' THEN       /* CHECK FOR PROCESS STATUS      */ 01600000
@RF00462 L     @10,CCACMSWA(,R11)                                  0472 01601000
         CLC   SPACINDC(2,@10),@CC03302                            0472 01602000
         BNE   @RF00472                                            0472 01603000
*         CCAIXEXT=CCAIXEXT-INCR1;  /* DECREMENT INDEX TO CCA        */ 01604000
         SLR   @10,@10                                             0473 01605000
         IC    @10,CCAIXEXT(,R11)                                  0473 01606000
         BCTR  @10,0                                               0473 01607000
         STC   @10,CCAIXEXT(,R11)                                  0473 01608000
*       ELSE                        /* ADJUST TRACKS NEEDED          */ 01609000
*         GENWRKRG=GENWRKRG-CCAEXTTH(CCAIXEXT);                    0474 01610000
         B     @RC00472                                            0474 01611000
@RF00472 SLR   @10,@10                                             0474 01612000
         IC    @10,CCAIXEXT(,R11)                                  0474 01613000
         SLA   @10,3                                               0474 01614000
         SH    GENWRKRG,CCAEXTTH-8(@10,R11)                        0474 01615000
*     END;                                                         0475 01616000
@RC00472 LA    @10,1                                               0475 01617000
         SLR   @15,@15                                             0475 01618000
         IC    @15,CCAIXEXT(,R11)                                  0475 01619000
         ALR   @10,@15                                             0475 01620000
         STC   @10,CCAIXEXT(,R11)                                  0475 01621000
@DE00443 SLR   @15,@15                                             0475 01622000
         IC    @15,CCANDEXT(,R11)                                  0475 01623000
         CR    @10,@15                                             0475 01624000
         BNH   @DL00443                                            0475 01625000
@DC00443 DS    0H                                                  0476 01626000
*   ELSE                            /* CONVERT SEQ SET RBAS          */ 01627000
*     DO;                                                          0476 01628000
         B     @RC00442                                            0476 01629000
@RF00442 DS    0H                                                  0477 01630000
*       DO CCAIXEXT=INCR1 TO CMFLNOEX;                             0477 01631000
         LA    @10,1                                               0477 01632000
         B     @DE00477                                            0477 01633000
@DL00477 DS    0H                                                  0478 01634000
*         CMFXLRBA(CCAIXEXT)=CHIA+INCR1;/* SET LOW DDDD              */ 01635000
         LA    @10,20                                              0478 01636000
         SLR   @01,@01                                             0478 01637000
         IC    @01,CCAIXEXT(,R11)                                  0478 01638000
         MR    @00,@10                                             0478 01639000
         L     @15,CCACMSWA(,R11)                                  0478 01640000
         L     @14,CMEXTLST(,@15)                                  0478 01641000
         LA    @00,1                                               0478 01642000
         AL    @00,CHIA(,RECRDRFR)                                 0478 01643000
         LA    @09,0(@01,@14)                                      0478 01644000
         AL    @09,@CF03381                                        0478 01645000
         ST    @00,CMFXLRBA-12(,@09)                               0478 01646000
*         CMFXHRBA(CCAIXEXT)=(CMPHYBLK(2)*(CMFXNOTT(CCAIXEXT)/CMTRKPCA( 01647000
*             1)))+CMFXLRBA(CMFLNOEX)-INCR1;                       0479 01648000
         LA    @09,0(@01,@14)                                      0479 01649000
         AL    @09,@CF03377                                        0479 01650000
         LH    @06,CMFXNOTT-10(,@09)                               0479 01651000
         SRDA  @06,32                                              0479 01652000
         LH    @00,CMTRKPCA(,@15)                                  0479 01653000
         DR    @06,@00                                             0479 01654000
         M     @06,CMPHYBLK+16(,@15)                               0479 01655000
         LR    @09,@10                                             0479 01656000
         SLR   @10,@10                                             0479 01657000
         IC    @10,CMFLNOEX(,CMFPLREF)                             0479 01658000
         MR    @08,@10                                             0479 01659000
         AL    @09,@CF03381                                        0479 01660000
         AL    @07,CMFXLRBA-12(@09,@14)                            0479 01661000
         BCTR  @07,0                                               0479 01662000
         AL    @14,@CF03382                                        0479 01663000
         ST    @07,CMFXHRBA-16(@01,@14)                            0479 01664000
*         CHIA=CMFXHRBA(CCAIXEXT);  /* SET NEW HIGH RBA              */ 01665000
         ST    @07,CHIA(,RECRDRFR)                                 0480 01666000
*       END;                                                       0481 01667000
         LA    @10,1                                               0481 01668000
         SLR   @15,@15                                             0481 01669000
         IC    @15,CCAIXEXT(,R11)                                  0481 01670000
         ALR   @10,@15                                             0481 01671000
@DE00477 STC   @10,CCAIXEXT(,R11)                                  0481 01672000
         SLR   @15,@15                                             0481 01673000
         IC    @15,CMFLNOEX(,CMFPLREF)                             0481 01674000
         CR    @10,@15                                             0481 01675000
         BNH   @DL00477                                            0481 01676000
*       CMFLSSDT=ON;                /* INDICATE SEQ SET WITH DAT     */ 01677000
         OI    CMFLSSDT(CMFPLREF),B'10000000'                      0482 01678000
*       CTGFVICH->CTGFVAMD->CTGFLPT(1)->AMDNEXT=CTGFVICH->CTGFVAMD->    01679000
*           CTGFLPT(1)->AMDNEXT+CMFLNOEX;/* SET NO. OF EXTENTS       */ 01680000
         L     @10,CCACPL(,R11)                                    0483 01681000
         L     @10,CTGFVT(,@10)                                    0483 01682000
         L     @10,CTGFVICH(,@10)                                  0483 01683000
         L     @10,CTGFVAMD(,@10)                                  0483 01684000
         L     @10,CTGFLPT(,@10)                                   0483 01685000
         SLR   @15,@15                                             0483 01686000
         IC    @15,CMFLNOEX(,CMFPLREF)                             0483 01687000
         AH    @15,AMDNEXT(,@10)                                   0483 01688000
         STH   @15,AMDNEXT(,@10)                                   0483 01689000
*     END;                                                         0484 01690000
*   CMFLHABA=CHIA+INCR1;            /* SET HIGH ALLOCATED RBA        */ 01691000
@RC00442 LA    @10,1                                               0485 01692000
         AL    @10,CHIA(,RECRDRFR)                                 0485 01693000
         ST    @10,CMFLHABA(,CMFPLREF)                             0485 01694000
*   CMFLHUBA=CMFXLRBA(1);           /* SET HIGH USED RBA             */ 01695000
         L     @10,CCACMSWA(,R11)                                  0486 01696000
         L     @10,CMEXTLST(,@10)                                  0486 01697000
         MVC   CMFLHUBA(4,CMFPLREF),CMFXLRBA(@10)                  0486 01698000
*   RFY                                                            0487 01699000
*    (CMFPLREF) UNRSTD;                                            0487 01700000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 01701000
         BAL   @14,EXIT                                            0488 01702000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 01703000
         DS 0F                                                          01704000
*   GEN(DC CL8'IGGPDCBE');          /* NAME OF FOLLOWING PROCEDURE   */ 01705000
         DC CL8'IGGPDCBE'                                               01706000
*   END;                            /* END OF INNER PROCEDURE        */ 01707000
@EL00009 DS    0H                                                  0491 01708000
@EF00009 DS    0H                                                  0491 01709000
@ER00009 BR    @14                                                 0491 01710000
@PB00009 DS    0H                                                  0492 01711000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 01712000
         EJECT                                                          01713000
*                                                                  0493 01714000
*/********************************************************************/ 01715000
*/*                                                                  */ 01716000
*/*        IGGPDCBE  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */ 01717000
*/*                                                                  */ 01718000
*/********************************************************************/ 01719000
*                                                                  0493 01720000
*IGGPDCBE:                                                         0493 01721000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 01722000
         B     @PB00010                                            0493 01723000
IGGPDCBE DS    0H                                                  0494 01724000
*Z035:                              /* LABEL FOR PROCEDURE TRACKING  */ 01725000
*Z035DCBE:                          /* LABEL FOR PROCEDURE TRACKING  */ 01726000
*   RFY                                                            0494 01727000
*    (R5,                                                          0494 01728000
*     R6,                                                          0494 01729000
*     R7,                                                          0494 01730000
*     R8,                                                          0494 01731000
*     R9,                                                          0494 01732000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 01733000
Z035     DS    0H                                                  0494 01734000
Z035DCBE DS    0H                                                  0495 01735000
*   RFY                                                            0495 01736000
*    (R2,                                                          0495 01737000
*     R3,                                                          0495 01738000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 01739000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 01740000
         STM 12,14,12(13)                                               01741000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 01742000
*                                                                  0497 01743000
         LA 13,12(13)                                                   01744000
*   /*****************************************************************/ 01745000
*   /*                                                               */ 01746000
*   /* INTERNAL PROCEDURE TO INITIALIZE THE RECORDS WITH KEY AND ANY */ 01747000
*   /* NECESSARY FIXED INFORMATION                                   */ 01748000
*   /*                                                               */ 01749000
*   /*****************************************************************/ 01750000
*                                                                  0498 01751000
*   RFY                                                            0498 01752000
*     CATRCD BASED(RECRDRFR);                                      0498 01753000
*   RECRDRFR=CMSCTREC(1);           /* SET DATA RECORD REFERENCE     */ 01754000
         L     @10,CCACMSWA(,R11)                                  0499 01755000
         L     RECRDRFR,CMSCTREC(,@10)                             0499 01756000
*   CMWFVTPT=CTGFVDCH;              /* SET UP THE DATA FVT ADDR      */ 01757000
         L     @05,CCACPL(,R11)                                    0500 01758000
         L     @05,CTGFVT(,@05)                                    0500 01759000
         MVC   CMWFVTPT(4,@10),CTGFVDCH(@05)                       0500 01760000
*   RFY                                                            0501 01761000
*     CTGFV BASED(CMWFVTPT);                                       0501 01762000
*   CCAURAB=CMSRCCOR;               /* LOCATION OF FIRST RAB         */ 01763000
         MVC   CCAURAB(4,R11),CMSRCCOR(@10)                        0502 01764000
*   PROCESS='GO';                   /* SET PROCESS INDICATOR         */ 01765000
         MVC   PROCESS(2,@10),@CC03301                             0503 01766000
*   DO WHILE PROCESS='GO';          /* INITIALIZE DATA AND INDEX     */ 01767000
         B     @DE00504                                            0504 01768000
@DL00504 DS    0H                                                  0505 01769000
*     RCDID=CTGFVTYP;               /* SET RECORD ID TYPE            */ 01770000
         L     @10,CCACMSWA(,R11)                                  0505 01771000
         L     @10,CMWFVTPT(,@10)                                  0505 01772000
         MVC   RCDID(1,RECRDRFR),CTGFVTYP(@10)                     0505 01773000
*     NREPLF=LENGTH(CATRCD)+LENGTH(CTGRBASE);/* LENGTH FIXED         */ 01774000
*                                                                  0506 01775000
         LA    @05,143                                             0506 01776000
         STC   @05,NREPLF(,RECRDRFR)                               0506 01777000
*     /***************************************************************/ 01778000
*     /*                                                             */ 01779000
*     /* INITIALIZE THE CONTROL INFORMATION FOR REPEATING FLDS       */ 01780000
*     /*                                                             */ 01781000
*     /***************************************************************/ 01782000
*                                                                  0507 01783000
*     CCACPE1=RECRDRFR;             /* START OF RECORD AREA          */ 01784000
         L     @15,CCAURAB(,R11)                                   0507 01785000
         ST    RECRDRFR,CCACPE1(,@15)                              0507 01786000
*     CCACPE2=RECRDRFR+NREPLF;      /* REPEATING FIELD PTR           */ 01787000
         ALR   @05,RECRDRFR                                        0508 01788000
         ST    @05,CCACPE2(,@15)                                   0508 01789000
*     CCACPE3=CCACPE2+LENGTH(EXTRCDPT)+LENGTH(REPCNT);             0509 01790000
         AH    @05,@CH00129                                        0509 01791000
         ST    @05,CCACPE3(,@15)                                   0509 01792000
*     CCACPE5=CCACPE3;              /* SET FIRST GOP POINTER         */ 01793000
*                                                                  0510 01794000
         ST    @05,CCACPE5(,R11)                                   0510 01795000
*     /***************************************************************/ 01796000
*     /*                                                             */ 01797000
*     /* INITIALIZE THE FIXED INFORMATION IN THE RECORD              */ 01798000
*     /*                                                             */ 01799000
*     /***************************************************************/ 01800000
*                                                                  0511 01801000
*     IF CTGFVOWN^=NONE THEN        /* CHECK FOR OWNER ID FIELD      */ 01802000
         L     @10,CTGFVOWN(,@10)                                  0511 01803000
         LTR   @10,@10                                             0511 01804000
         BZ    @RF00511                                            0511 01805000
*       COWNID=CTGFVOWN->CTGFLPT(1)->OWNIDFLD;/* SET ID              */ 01806000
         L     @10,CTGFLPT(,@10)                                   0512 01807000
         MVC   COWNID(8,RECRDRFR),OWNIDFLD(@10)                    0512 01808000
*     ELSE                          /* SET NULL NAME VALUE           */ 01809000
*       COWNID=NULLNAME;            /* SET NULL VALUE                */ 01810000
         B     @RC00511                                            0513 01811000
@RF00511 MVC   COWNID(8,RECRDRFR),NULLNAME                         0513 01812000
*     IF CTGFVEXT^=NONE THEN        /* EXCEPTION EXIT        @Y30SSSB*/ 01813000
@RC00511 L     @10,CCACMSWA(,R11)                                  0514 01814000
         L     @10,CMWFVTPT(,@10)                                  0514 01815000
         L     @10,CTGFVEXT(,@10)                                  0514 01816000
         LTR   @10,@10                                             0514 01817000
         BZ    @RF00514                                            0514 01818000
*       CEXT=CTGFVEXT->CTGFLPT(1)->EXCPNAME;/* INIT          @Y30SSSB*/ 01819000
         L     @10,CTGFLPT(,@10)                                   0515 01820000
         MVC   CEXT(8,RECRDRFR),EXCPNAME(@10)                      0515 01821000
*     ELSE                          /* NO EXIT MODULE        @Y30SSSB*/ 01822000
*       CEXT=NULLNAME;              /* NULL FIELD VALUE      @Y30SSSB*/ 01823000
         B     @RC00514                                            0516 01824000
@RF00514 MVC   CEXT(8,RECRDRFR),NULLNAME                           0516 01825000
*     CATTR=CTGFVATR->CTGFLPT(1)->CTGDSATR;/* ATTRIBUTES             */ 01826000
*                                                                  0517 01827000
@RC00514 L     @10,CCACMSWA(,R11)                                  0517 01828000
         L     @05,CMWFVTPT(,@10)                                  0517 01829000
         L     @01,CTGFVATR(,@05)                                  0517 01830000
         L     @01,CTGFLPT(,@01)                                   0517 01831000
         MVC   CATTR(2,RECRDRFR),CTGDSATR(@01)                     0517 01832000
*     /***************************************************************/ 01833000
*     /*                                                             */ 01834000
*     /* PERFORM SPECIAL DATA OR INDEX PROCESSING                    */ 01835000
*     /*                                                             */ 01836000
*     /***************************************************************/ 01837000
*                                                                  0518 01838000
*     IF CTGFVTYP=CTGFVDTA THEN     /* CHECK FOR DATA OBJECT         */ 01839000
         CLI   CTGFVTYP(@05),C'D'                                  0518 01840000
         BNE   @RF00518                                            0518 01841000
*       DO;                         /* BUILD DELETED GOPS            */ 01842000
*         CNAME=CATDTANM;           /* SET MAIN DATA RECORD NAME     */ 01843000
         MVC   CNAME(44,RECRDRFR),@CC00073                         0520 01844000
*         CBUF=MINBUFSZ;            /* SET MINIMUM BUFFER SIZE       */ 01845000
         MVC   CBUF(4,RECRDRFR),@CF00097                           0521 01846000
*         CLRECL=CTGFVLRS->CTGFLPT(1)->LRECL;/* AVG REC SIZE         */ 01847000
         L     @05,CTGFVLRS(,@05)                                  0522 01848000
         L     @05,CTGFLPT(,@05)                                   0522 01849000
         MVC   CLRECL(4,RECRDRFR),LRECL(@05)                       0522 01850000
*         CSPACPRM=CTGFVT->CTGFVSPC->CTGFLPT(1)->SPACEPRM;         0523 01851000
         L     @05,CCACPL(,R11)                                    0523 01852000
         L     @05,CTGFVT(,@05)                                    0523 01853000
         L     @05,CTGFVSPC(,@05)                                  0523 01854000
         L     @05,CTGFLPT(,@05)                                   0523 01855000
         MVC   CSPACPRM(7,RECRDRFR),SPACEPRM(@05)                  0523 01856000
*         CPRIM=CPRIM-CMTRKPCA(1);  /* SET DATA PRIMARY QTY          */ 01857000
         SLR   @05,@05                                             0524 01858000
         ICM   @05,7,CPRIM(RECRDRFR)                               0524 01859000
         SH    @05,CMTRKPCA(,@10)                                  0524 01860000
         STCM  @05,7,CPRIM(RECRDRFR)                               0524 01861000
*         REPCNT=DATADELT;          /* SET COUNT OF DATA DEL GOP     */ 01862000
         L     @10,CCAURAB(,R11)                                   0525 01863000
         L     @10,CCACPE2(,@10)                                   0525 01864000
         MVI   REPCNT(@10),X'02'                                   0525 01865000
*         GENWRKRG=DTALORCI;        /* SET LOW RANGE EXTENTS CI      */ 01866000
         LA    GENWRKRG,5                                          0526 01867000
*         INCRREG=INCR1;            /* SET SEQUENCE COUNTER          */ 01868000
         LA    INCRREG,1                                           0527 01869000
*Z036DCPB:                                                         0528 01870000
*         CALL IGGPDCPB;            /* BUILD THE DELETED GOP         */ 01871000
Z036DCPB BAL   @14,IGGPDCPB                                        0528 01872000
*         GENWRKRG=DTAHIRCI;        /* SET HIGH RANGE EXTS CI        */ 01873000
         LA    GENWRKRG,7                                          0529 01874000
*         INCRREG=INCRREG+INCR1;    /* UPDATE SEQUENCE COUNTER       */ 01875000
         AH    INCRREG,@CH00083                                    0530 01876000
*Z037DCPB:                                                         0531 01877000
*         CALL IGGPDCPB;            /* BUILD THE DELETED GOP         */ 01878000
Z037DCPB BAL   @14,IGGPDCPB                                        0531 01879000
*         CCACPE4=CCACPE5;          /* END OF DATA IN REC ADDR       */ 01880000
         L     @10,CCAURAB(,R11)                                   0532 01881000
         L     @05,CCACPE5(,R11)                                   0532 01882000
         ST    @05,CCACPE4(,@10)                                   0532 01883000
*         RCDSIZ=CCACPE4-CCACPE1;   /* LENGTH OF USED INFO           */ 01884000
         SL    @05,CCACPE1(,@10)                                   0533 01885000
         STH   @05,RCDSIZ(,RECRDRFR)                               0533 01886000
*         RECRDRFR=CMSCTREC(2);     /* SET INDEX RECORD REF          */ 01887000
         L     @05,CCACMSWA(,R11)                                  0534 01888000
         L     RECRDRFR,CMSCTREC+4(,@05)                           0534 01889000
*         CCAURAB=CCAURAB+LENGTH(CCARAB);/* SET INDEX RAB            */ 01890000
         AH    @10,@CH00179                                        0535 01891000
         ST    @10,CCAURAB(,R11)                                   0535 01892000
*         CMWFVTPT=CTGFVT->CTGFVICH;/* SET INDEX FVT ADDR            */ 01893000
         L     @10,CCACPL(,R11)                                    0536 01894000
         L     @10,CTGFVT(,@10)                                    0536 01895000
         MVC   CMWFVTPT(4,@05),CTGFVICH(@10)                       0536 01896000
*       END;                                                       0537 01897000
*     ELSE                          /* INDEX OBJECT                  */ 01898000
*       DO;                         /* BUILD ALL NEEDED GOPS         */ 01899000
         B     @RC00518                                            0538 01900000
@RF00518 DS    0H                                                  0539 01901000
*         CNAME=CATIDXNM;           /* SET MAIN IDX RECORD NAME      */ 01902000
         MVC   CNAME(44,RECRDRFR),@CC00078                         0539 01903000
*         CBUF=NULLWORD;            /* SET NULL BUFFER SIZE VALU     */ 01904000
         L     @10,NULLWORD                                        0540 01905000
         ST    @10,CBUF(,RECRDRFR)                                 0540 01906000
*         CLRECL=NULLWORD;          /* SET NULL LRECL VALUE          */ 01907000
         ST    @10,CLRECL(,RECRDRFR)                               0541 01908000
*         CPRIM=CMTRKPCA(1);        /* SET HIGH LEVEL TRACKS         */ 01909000
         L     @10,CCACMSWA(,R11)                                  0542 01910000
         LH    @10,CMTRKPCA(,@10)                                  0542 01911000
         STCM  @10,7,CPRIM(RECRDRFR)                               0542 01912000
*         CSEC=CMTRKPCA(1);         /* SET EXTENSION QUANTITY        */ 01913000
         STCM  @10,7,CSEC(RECRDRFR)                                0543 01914000
*         CSORT=CMSALTRK;           /* SET TRACK ALLOCATION QTY      */ 01915000
         MVI   CSORT(RECRDRFR),B'10000000'                         0544 01916000
*         REPCNT=INDXDELT;          /* COUNT OF DELETED GOPS         */ 01917000
         L     @10,CCAURAB(,R11)                                   0545 01918000
         L     @10,CCACPE2(,@10)                                   0545 01919000
         MVI   REPCNT(@10),X'03'                                   0545 01920000
*         GENWRKRG=IDXHILCI;        /* HIGH LEVEL INDEX EXTS CI      */ 01921000
         LA    GENWRKRG,4                                          0546 01922000
*         INCRREG=INCR1;            /* SET GOP SEQUENCE COUNTER      */ 01923000
         LA    INCRREG,1                                           0547 01924000
*Z038DCPB:                                                         0548 01925000
*         CALL IGGPDCPB;            /* BUILD A DELETED GOP           */ 01926000
Z038DCPB BAL   @14,IGGPDCPB                                        0548 01927000
*         GENWRKRG=IDXLSSCI;        /* LOW SEQ SET EXTENTS CI        */ 01928000
         LA    GENWRKRG,6                                          0549 01929000
*         INCRREG=INCRREG+INCR1;    /* UPDATE SEQUENCE COUNTER       */ 01930000
         AH    INCRREG,@CH00083                                    0550 01931000
*Z039DCPB:                                                         0551 01932000
*         CALL IGGPDCPB;            /* BUILD A DELETED GOP           */ 01933000
Z039DCPB BAL   @14,IGGPDCPB                                        0551 01934000
*         GENWRKRG=IDXHSSCI;        /* HIGH SEQ SET EXTENTS CI       */ 01935000
         LA    GENWRKRG,8                                          0552 01936000
*         INCRREG=INCRREG+INCR1;    /* UPDATE SEQUENCE COUNTER       */ 01937000
         AH    INCRREG,@CH00083                                    0553 01938000
*Z040DCPB:                                                         0554 01939000
*         CALL IGGPDCPB;            /* BUILD A DELETED GOP           */ 01940000
Z040DCPB BAL   @14,IGGPDCPB                                        0554 01941000
*         CCACPE4=CCACPE5;          /* END OF DATA IN REC ADDR       */ 01942000
         L     @10,CCAURAB(,R11)                                   0555 01943000
         L     @05,CCACPE5(,R11)                                   0555 01944000
         ST    @05,CCACPE4(,@10)                                   0555 01945000
*         RCDSIZ=CCACPE4-CCACPE1;   /* LENGTH OF USED INFO           */ 01946000
         SL    @05,CCACPE1(,@10)                                   0556 01947000
         STH   @05,RCDSIZ(,RECRDRFR)                               0556 01948000
*         RCDCINO=INDXCINO;         /* SET INDEX RECORD CI NO.       */ 01949000
         MVC   RCDCINO(3,RECRDRFR),@CF00083+1                      0557 01950000
*         PROCESS='NG';             /* SET PROCESS COMPLETE INDC     */ 01951000
         L     @10,CCACMSWA(,R11)                                  0558 01952000
         MVC   PROCESS(2,@10),@CC03302                             0558 01953000
*       END;                                                       0559 01954000
*   END;                                                           0560 01955000
@RC00518 DS    0H                                                  0560 01956000
@DE00504 L     @10,CCACMSWA(,R11)                                  0560 01957000
         CLC   PROCESS(2,@10),@CC03301                             0560 01958000
         BE    @DL00504                                            0560 01959000
*   RFY                                                            0561 01960000
*     CTGFV BASED(CTGFVT);                                         0561 01961000
*Z041DCEB:                                                         0562 01962000
*   CALL IGGPDCEB;                  /* BUILD EXTENSION RECORDS       */ 01963000
Z041DCEB BAL   @14,IGGPDCEB                                        0562 01964000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 01965000
         BAL   @14,EXIT                                            0563 01966000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 01967000
         DS 0F                                                          01968000
*   GEN(DC CL8'IGGPDCPB');          /* NAME OF FOLLOWING PROCEDURE   */ 01969000
         DC CL8'IGGPDCPB'                                               01970000
*   END;                            /* END OF INNER PROCEDURE        */ 01971000
@EL00010 DS    0H                                                  0566 01972000
@EF00010 DS    0H                                                  0566 01973000
@ER00010 BR    @14                                                 0566 01974000
@PB00010 DS    0H                                                  0567 01975000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 01976000
         EJECT                                                          01977000
*                                                                  0568 01978000
*/********************************************************************/ 01979000
*/*                                                                  */ 01980000
*/*        IGGPDCPB  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */ 01981000
*/*                                                                  */ 01982000
*/********************************************************************/ 01983000
*                                                                  0568 01984000
*IGGPDCPB:                                                         0568 01985000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 01986000
         B     @PB00011                                            0568 01987000
IGGPDCPB DS    0H                                                  0569 01988000
*Z042:                              /* LABEL FOR PROCEDURE TRACKING  */ 01989000
*Z042DCPB:                          /* LABEL FOR PROCEDURE TRACKING  */ 01990000
*   RFY                                                            0569 01991000
*    (R5,                                                          0569 01992000
*     R6,                                                          0569 01993000
*     R7,                                                          0569 01994000
*     R8,                                                          0569 01995000
*     R9,                                                          0569 01996000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 01997000
Z042     DS    0H                                                  0569 01998000
Z042DCPB DS    0H                                                  0570 01999000
*   RFY                                                            0570 02000000
*    (R2,                                                          0570 02001000
*     R3,                                                          0570 02002000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 02003000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 02004000
         STM 12,14,12(13)                                               02005000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 02006000
*                                                                  0572 02007000
         LA 13,12(13)                                                   02008000
*   /*****************************************************************/ 02009000
*   /*                                                               */ 02010000
*   /* INTERNAL PROCEDURE TO BUILD DELETED GROUP OCCURRENCE POINTERS */ 02011000
*   /* IN THE DATA AND INDEX RECORDS                                 */ 02012000
*   /*                                                               */ 02013000
*   /*****************************************************************/ 02014000
*                                                                  0573 02015000
*   CATGOCI=GENWRKRG;               /* SET RECORD CI NUMBER          */ 02016000
         L     @10,CCACPE5(,R11)                                   0573 02017000
         STCM  GENWRKRG,7,CATGOCI(@10)                             0573 02018000
*   CATGOGC1=VOLGROUP;              /* SET GROUP CODE                */ 02019000
         MVI   CATGOGC1(@10),X'03'                                 0574 02020000
*   CATGODEL=ON;                    /* SET DELETED GOP FLAG          */ 02021000
*   CATGOEXT=ON;                    /* SET OCCURRENCE OUTSIDE        */ 02022000
         OI    CATGODEL(@10),B'11000000'                           0576 02023000
*   CATGOSEQ=INCRREG;               /* SET THE GOP SEQUENCE NO.      */ 02024000
         STC   INCRREG,CATGOSEQ(,@10)                              0577 02025000
*   CCACPE5=CCACPE5+LENGTH(REPGOPT);                               0578 02026000
         AH    @10,@CH00090                                        0578 02027000
         ST    @10,CCACPE5(,R11)                                   0578 02028000
*   CCACPE3=CCACPE5;                /* SET GO ADDRESS                */ 02029000
         L     @05,CCAURAB(,R11)                                   0579 02030000
         ST    @10,CCACPE3(,@05)                                   0579 02031000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 02032000
         BAL   @14,EXIT                                            0580 02033000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 02034000
         DS 0F                                                          02035000
*   GEN(DC CL8'IGGPDCEB');          /* NAME OF FOLLOWING PROCEDURE   */ 02036000
         DC CL8'IGGPDCEB'                                               02037000
*   END;                            /* END OF INNER PROCEDURE        */ 02038000
@EL00011 DS    0H                                                  0583 02039000
@EF00011 DS    0H                                                  0583 02040000
@ER00011 BR    @14                                                 0583 02041000
@PB00011 DS    0H                                                  0584 02042000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 02043000
         EJECT                                                          02044000
*                                                                  0585 02045000
*/********************************************************************/ 02046000
*/*                                                                  */ 02047000
*/*        IGGPDCEB  -  PROCEDURE  INTERNALLY  CALLED  UNNESTED      */ 02048000
*/*                                                                  */ 02049000
*/********************************************************************/ 02050000
*                                                                  0585 02051000
*IGGPDCEB:                                                         0585 02052000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 02053000
         B     @PB00012                                            0585 02054000
IGGPDCEB DS    0H                                                  0586 02055000
*Z043:                              /* LABEL FOR PROCEDURE TRACKING  */ 02056000
*Z043DCEB:                          /* LABEL FOR PROCEDURE TRACKING  */ 02057000
*   RFY                                                            0586 02058000
*    (R5,                                                          0586 02059000
*     R6,                                                          0586 02060000
*     R7,                                                          0586 02061000
*     R8,                                                          0586 02062000
*     R9,                                                          0586 02063000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 02064000
Z043     DS    0H                                                  0586 02065000
Z043DCEB DS    0H                                                  0587 02066000
*   RFY                                                            0587 02067000
*    (R2,                                                          0587 02068000
*     R3,                                                          0587 02069000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 02070000
*                                                                  0587 02071000
*   /*****************************************************************/ 02072000
*   /*                                                               */ 02073000
*   /* INTERNAL PROCEDURE TO BUILD EXTENSION RECORDS FOR THE DATA AND*/ 02074000
*   /* INDEX EXTENTS AND TO BUILD THE CCR AND CALL MODIFY TO COMPLETE*/ 02075000
*   /* THE DATA RECORDS AND THEN TO USE MODIFY TO COMPLETE THE INDEX */ 02076000
*   /* RECORDS                                                       */ 02077000
*   /*                                                               */ 02078000
*   /*****************************************************************/ 02079000
*                                                                  0588 02080000
*   DO GENWRKRG=FRSTEREC TO LASTEREC;/* BUILD EXTENSION RECS         */ 02081000
         LA    GENWRKRG,5                                          0588 02082000
@DL00588 DS    0H                                                  0589 02083000
*     RECRDRFR=CMSCTREC(GENWRKRG);  /* SET RECORD REFERENCE          */ 02084000
         LR    @10,GENWRKRG                                        0589 02085000
         SLA   @10,2                                               0589 02086000
         L     @05,CCACMSWA(,R11)                                  0589 02087000
         L     RECRDRFR,CMSCTREC-4(@10,@05)                        0589 02088000
*     CCAURAB=CCAURAB+LENGTH(CCARAB);/* SET RAB POINTER              */ 02089000
         LA    @10,20                                              0590 02090000
         AL    @10,CCAURAB(,R11)                                   0590 02091000
         ST    @10,CCAURAB(,R11)                                   0590 02092000
*     RCDID=CATEXTID;               /* SET EXTENSION RECORD ID       */ 02093000
         MVI   RCDID(RECRDRFR),C'E'                                0591 02094000
*     RCDCINO=GENWRKRG-INCR1;       /* SET THE CI NUMBER             */ 02095000
         LR    @05,GENWRKRG                                        0592 02096000
         BCTR  @05,0                                               0592 02097000
         STCM  @05,7,RCDCINO(RECRDRFR)                             0592 02098000
*     NREPLF=LENGTH(CATRCD);        /* SET LENGTH OF FIXED INFO      */ 02099000
         LA    @05,49                                              0593 02100000
         STC   @05,NREPLF(,RECRDRFR)                               0593 02101000
*     CCACPE1=RECRDRFR;             /* SET START ADDR OF RECORD      */ 02102000
         ST    RECRDRFR,CCACPE1(,@10)                              0594 02103000
*     CCACPE2=RECRDRFR+NREPLF;      /* SET REPEATING FIELD PTR       */ 02104000
         ALR   @05,RECRDRFR                                        0595 02105000
         ST    @05,CCACPE2(,@10)                                   0595 02106000
*     CCACPE3=CCACPE2+LENGTH(EXTRCDPT)+LENGTH(REPCNT);             0596 02107000
         LA    @15,6                                               0596 02108000
         ALR   @15,@05                                             0596 02109000
         ST    @15,CCACPE3(,@10)                                   0596 02110000
*     CCACPE4=CCACPE3;              /* LENGTH OF USED INFO           */ 02111000
         ST    @15,CCACPE4(,@10)                                   0597 02112000
*     RCDSIZ=CCACPE4-CCACPE1;       /* SET SIZE OF RECORD INFO       */ 02113000
         L     @10,CCAURAB(,R11)                                   0598 02114000
         L     @10,CCACPE1(,@10)                                   0598 02115000
         SLR   @15,@10                                             0598 02116000
         STH   @15,RCDSIZ(,RECRDRFR)                               0598 02117000
*     REPCNT=OKAY;                  /* COUNT OF GOPS IN RECORD       */ 02118000
         MVI   REPCNT(@05),X'00'                                   0599 02119000
*   END;                                                           0600 02120000
*                                                                  0600 02121000
         AH    GENWRKRG,@CH00083                                   0600 02122000
         CH    GENWRKRG,@CH00095                                   0600 02123000
         BNH   @DL00588                                            0600 02124000
*   /*****************************************************************/ 02125000
*   /*                                                               */ 02126000
*   /* BUILD THE CATALOG CONTROL RECORD IN RAB 0                     */ 02127000
*   /*                                                               */ 02128000
*   /*****************************************************************/ 02129000
*                                                                  0601 02130000
*   RECRDRFR=CMSCTREC(4);           /* SET THE CCR IN CORE REFR      */ 02131000
         L     @10,CCACMSWA(,R11)                                  0601 02132000
         L     RECRDRFR,CMSCTREC+12(,@10)                          0601 02133000
*   RFY                                                            0602 02134000
*     CATRECRD BASED(RECRDRFR);                                    0602 02135000
*   CATRECRD(1)=CATRECRD(1)&&CATRECRD(1);/* CLEAR RECORD AREA        */ 02136000
         XC    CATRECRD(256,RECRDRFR),CATRECRD(RECRDRFR)           0603 02137000
*   CATRECRD(2)=CATRECRD(2)&&CATRECRD(2);/* CLEAR RECORD AREA        */ 02138000
         XC    CATRECRD+256(256,RECRDRFR),CATRECRD+256(RECRDRFR)   0604 02139000
*   RCDID=CCRRECID;                 /* SET CCR ID                    */ 02140000
         MVI   RCDID(RECRDRFR),C'L'                                0605 02141000
*   RCDCINO=CCRCINO;                /* SET CCR CI NUMBER             */ 02142000
         MVC   RCDCINO(3,RECRDRFR),@CF00101+1                      0606 02143000
*   RFY                                                            0607 02144000
*    (CMFPLREF) RSTD;                                              0607 02145000
*   CMFPLREF=CMLDTFPL;              /* GET LOW DATA FPL ADDRESS      */ 02146000
         L     CMFPLREF,CMLDTFPL(,@10)                             0608 02147000
*   CCRHACI=(CMFLHABA/CTRECSIZ)-INCR1;/* TOTAL LOW DATA CIS          */ 02148000
         L     @10,CMFLHABA(,CMFPLREF)                             0609 02149000
         SRL   @10,9                                               0609 02150000
         BCTR  @10,0                                               0609 02151000
         STCM  @10,7,CCRHACI+44(RECRDRFR)                          0609 02152000
*   RFY                                                            0610 02153000
*    (CMFPLREF) UNRSTD;                                            0610 02154000
*                                                                  0610 02155000
*   /*****************************************************************/ 02156000
*   /*                                                               */ 02157000
*   /* DETERMINE HIGHEST USED CI FOR VOLUME RECORD & EXTENSIONS      */ 02158000
*   /*                                                               */ 02159000
*   /*****************************************************************/ 02160000
*                                                                  0611 02161000
*   CCAURAB=ADDR(CCARAB0);          /* RAB FOR FIRST EXTENSION       */ 02162000
         LA    @10,CCARAB0(,R11)                                   0611 02163000
         ST    @10,CCAURAB(,R11)                                   0611 02164000
*   RFY                                                            0612 02165000
*     CATRCD BASED(CCACPE1);                                       0612 02166000
*   DO GENWRKRG=FRSTWREC TO DIM(CMSCTREC) BY INCR1;/*        @Y30SSSB*/ 02167000
         LA    GENWRKRG,11                                         0613 02168000
@DL00613 DS    0H                                                  0614 02169000
*     RECRDRFR=CMSCTREC(GENWRKRG);                                 0614 02170000
         LR    @10,GENWRKRG                                        0614 02171000
         SLA   @10,2                                               0614 02172000
         L     @05,CCACMSWA(,R11)                                  0614 02173000
         L     RECRDRFR,CMSCTREC-4(@10,@05)                        0614 02174000
*     IF RECRDRFR^=NONE&            /* VALID RECORD ADDRESS AND      */ 02175000
*         RECRDRFR->RCDID=VOLEXTID THEN/* EXTENSION RECORD           */ 02176000
         LTR   RECRDRFR,RECRDRFR                                   0615 02177000
         BZ    @RF00615                                            0615 02178000
         CLI   RCDID(RECRDRFR),C'W'                                0615 02179000
         BNE   @RF00615                                            0615 02180000
*       CCRNFCI=RECRDRFR->RCDCINO+INCR1;/* NEXT AVAIL CI NO          */ 02181000
         L     @10,CCAURAB(,R11)                                   0616 02182000
         L     @10,CCACPE1(,@10)                                   0616 02183000
         LA    @05,1                                               0616 02184000
         SLR   @15,@15                                             0616 02185000
         ICM   @15,7,RCDCINO(RECRDRFR)                             0616 02186000
         ALR   @05,@15                                             0616 02187000
         STCM  @05,7,CCRNFCI+44(@10)                               0616 02188000
*     ELSE                                                         0617 02189000
*       ;                           /* ADDR OR ID ERROR              */ 02190000
@RF00615 DS    0H                                                  0618 02191000
*   END;                                                           0618 02192000
         AH    GENWRKRG,@CH00083                                   0618 02193000
         CH    GENWRKRG,@CH00179                                   0618 02194000
         BNH   @DL00613                                            0618 02195000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 02196000
         BAL   @14,EXIT                                            0619 02197000
*   END;                            /* END OF INNER PROCEDURE        */ 02198000
@EL00012 DS    0H                                                  0620 02199000
@EF00012 DS    0H                                                  0620 02200000
@ER00012 BR    @14                                                 0620 02201000
@PB00012 DS    0H                                                  0621 02202000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 02203000
         EJECT                                                          02204000
*                                                                  0622 02205000
*/********************************************************************/ 02206000
*/*                                                                  */ 02207000
*/*         RETURN-TO-CALLER  PROCEDURE-EXITING  SUBFUNCTION         */ 02208000
*/*                                                                  */ 02209000
*/********************************************************************/ 02210000
*                                                                  0622 02211000
*EXIT:                                                             0622 02212000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 02213000
         B     @PB00013                                            0622 02214000
EXIT     DS    0H                                                  0623 02215000
*   GEN(LM 12,14,0(13));            /* RESTORE REGISTERS OF CALLER   */ 02216000
         LM 12,14,0(13)                                                 02217000
*   GEN(MVI 12(13),255);            /* MARK END OF PDL               */ 02218000
         MVI 12(13),255                                                 02219000
*   GEN(BR 14);                     /* RETURN TO CALLER              */ 02220000
         BR 14                                                          02221000
*PATCH:                                                            0626 02222000
*   GEN(DC (12+((*+139-@MAINENT)/140))A(0));/* PATCH AREA            */ 02223000
PATCH    DC (12+((*+139-@MAINENT)/140))A(0)                             02224000
*   END;                            /* END OF EXIT PROCEDURE         */ 02225000
@EL00013 DS    0H                                                  0627 02226000
@EF00013 DS    0H                                                  0627 02227000
@ER00013 BR    @14                                                 0627 02228000
*   END                                                            0628 02229000
*                                                                  0628 02230000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02231000
*/*%INCLUDE SYSLIB  (IGGMCDCL)                                       */ 02232000
*/*%INCLUDE SYSLIB  (IGGMCTRC)                                       */ 02233000
*/*%INCLUDE SYSLIB  (IGGCCA  )                                       */ 02234000
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */ 02235000
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                       */ 02236000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 02237000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 02238000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 02239000
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */ 02240000
*/*%INCLUDE SYSLIB  (AMCBS   )                                       */ 02241000
*/*%INCLUDE SYSLIB  (IGGCAXWA)                                       */ 02242000
*/*%INCLUDE SYSLIB  (IEZCTGFV)                                       */ 02243000
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                       */ 02244000
*/*%INCLUDE SYSLIB  (IEZCTGVL)                                       */ 02245000
*/*%INCLUDE SYSLIB  (IEZCTGCV)                                       */ 02246000
*/*%INCLUDE SYSLIB  (IGGMCMDM)                                       */ 02247000
*/*%INCLUDE SYSLIB  (IDAAMDSB)                                       */ 02248000
*/*%INCLUDE SYSLIB  (IGGMCMWA)                                       */ 02249000
*/*%INCLUDE SYSLIB  (IGGMSAWA)                                       */ 02250000
*                                                                  0628 02251000
*       ;                                                          0628 02252000
@EL00001 DS    0H                                                  0628 02253000
@EF00001 DS    0H                                                  0628 02254000
@ER00001 BR    @14                                                 0628 02255000
@DATA    DS    0H                                                       02256000
@CH00090 DC    H'5'                                                     02257000
@CH00129 DC    H'6'                                                     02258000
@CH00054 DC    H'8'                                                     02259000
@CH00092 DC    H'10'                                                    02260000
@CH00179 DC    H'20'                                                    02261000
@CH00271 DC    H'36'                                                    02262000
@CH00276 DC    H'48'                                                    02263000
@CH03364 DC    H'97'                                                    02264000
@CH03357 DC    H'5739'                                                  02265000
@SM03372 MVC   CMFPLSTR(0,@14),CMFPLSTR(CMFPLREF)                       02266000
@DATD    DSECT                                                          02267000
         DS    0F                                                       02268000
@TF00001 DS    F                                                        02269000
@TF00002 DS    F                                                        02270000
IGG0CLAS CSECT                                                          02271000
         DS    0F                                                       02272000
@CF00083 DC    F'1'                                                     02273000
@CH00083 EQU   @CF00083+2                                               02274000
@CF00066 DC    F'2'                                                     02275000
@CH00066 EQU   @CF00066+2                                               02276000
@CF00101 DC    F'3'                                                     02277000
@CF00126 DC    F'4'                                                     02278000
@CF00095 DC    F'9'                                                     02279000
@CH00095 EQU   @CF00095+2                                               02280000
@CF00097 DC    F'3072'                                                  02281000
@CF03359 DC    F'-1042152796'                                           02282000
@CF03363 DC    F'-1042151848'                                           02283000
@CF03375 DC    F'-20'                                                   02284000
@CF03376 DC    F'-18'                                                   02285000
@CF03378 DC    F'-16'                                                   02286000
@CF03379 DC    F'-14'                                                   02287000
@CF03380 DC    F'-12'                                                   02288000
@CF03377 DC    F'-10'                                                   02289000
@CF03381 DC    F'-8'                                                    02290000
@CF03382 DC    F'-4'                                                    02291000
@CF03366 DC    F'-1'                                                    02292000
@DATD    DSECT                                                          02293000
         DS    0D                                                       02294000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02295000
@ENDDATD EQU   *                                                        02296000
IGG0CLAS CSECT                                                          02297000
         DS    0F                                                       02298000
@SIZDATD DC    AL1(0)                                                   02299000
         DC    AL3(@ENDDATD-@DATD)                                      02300000
@CV00036 DC    V(IGGPCCCR)                                              02301000
@CV00037 DC    V(IGGPARFS)                                              02302000
@CV00038 DC    V(IGGPDCRA)                                              02303000
@CV00039 DC    V(IGGPDEFS)                                              02304000
@CV00041 DC    V(IGGPMEBM)                                              02305000
@CV00042 DC    V(IGGPDCME)                                              02306000
@CV00043 DC    V(IGGPSALL)                                              02307000
@CV00040 DC    V(IGGPMOD)                                               02308000
         DS    0D                                                       02309000
@CC00073 DC    C'VSAM.CATALOG.BASE.DATA.RECORD               '          02310000
@CC00078 DC    C'VSAM.CATALOG.BASE.INDEX.RECORD              '          02311000
@CC03248 DC    C'NAMEDS  '                                              02312000
@CC03264 DC    C'ENTVOL  '                                              02313000
@CC03301 DC    C'GO'                                                    02314000
@CC03302 DC    C'NG'                                                    02315000
NULLNAME DC    X'FFFFFFFFFFFFFFFF'                                      02316000
NULLWORD DC    X'FFFFFFFF'                                              02317000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02318000
@01      EQU   01                                                       02319000
@02      EQU   02                                                       02320000
@03      EQU   03                                                       02321000
@04      EQU   04                                                       02322000
@05      EQU   05                                                       02323000
@06      EQU   06                                                       02324000
@07      EQU   07                                                       02325000
@08      EQU   08                                                       02326000
@09      EQU   09                                                       02327000
@10      EQU   10                                                       02328000
@11      EQU   11                                                       02329000
@12      EQU   12                                                       02330000
@13      EQU   13                                                       02331000
@14      EQU   14                                                       02332000
@15      EQU   15                                                       02333000
IGGSEGBR EQU   @12                                                      02334000
RECRDRFR EQU   @02                                                      02335000
GENWRKRG EQU   @03                                                      02336000
HIRANGEQ EQU   @04                                                      02337000
INCRREG  EQU   @04                                                      02338000
CMFPLREF EQU   @05                                                      02339000
RANGLOCR EQU   @07                                                      02340000
RWA      EQU   @02                                                      02341000
R1       EQU   @01                                                      02342000
R2       EQU   @02                                                      02343000
R3       EQU   @03                                                      02344000
R4       EQU   @04                                                      02345000
R5       EQU   @05                                                      02346000
R6       EQU   @06                                                      02347000
R7       EQU   @07                                                      02348000
R8       EQU   @08                                                      02349000
R9       EQU   @09                                                      02350000
R10      EQU   @10                                                      02351000
R11      EQU   @11                                                      02352000
R12      EQU   @12                                                      02353000
R13      EQU   @13                                                      02354000
DCWABASE EQU   @04                                                      02355000
CMFPLCTR EQU   @04                                                      02356000
RET      EQU   @14                                                      02357000
RFLD     EQU   @04                                                      02358000
RGO      EQU   @15                                                      02359000
RNDX     EQU   @03                                                      02360000
RP0      EQU   @00                                                      02361000
RP1      EQU   @01                                                      02362000
RSAVE    EQU   @13                                                      02363000
RWK1     EQU   @06                                                      02364000
RWK2     EQU   @07                                                      02365000
RWK3     EQU   @08                                                      02366000
RWK4     EQU   @09                                                      02367000
RZERO    EQU   @00                                                      02368000
R0       EQU   @00                                                      02369000
R14      EQU   @14                                                      02370000
R15      EQU   @15                                                      02371000
WKR2     EQU   @02                                                      02372000
WKR3     EQU   @03                                                      02373000
WKR4     EQU   @04                                                      02374000
CVTPTR   EQU   16                                                       02375000
PSA      EQU   0                                                        02376000
FLCRNPSW EQU   PSA                                                      02377000
FLCROPSW EQU   PSA+8                                                    02378000
FLCICCW2 EQU   PSA+16                                                   02379000
PSAEEPSW EQU   PSA+132                                                  02380000
PSAESPSW EQU   PSA+136                                                  02381000
FLCSVILC EQU   PSAESPSW+1                                               02382000
PSAEPPSW EQU   PSA+140                                                  02383000
FLCPIILC EQU   PSAEPPSW+1                                               02384000
FLCPICOD EQU   PSAEPPSW+2                                               02385000
PSAPICOD EQU   FLCPICOD+1                                               02386000
FLCTEA   EQU   PSAEPPSW+4                                               02387000
FLCPER   EQU   PSA+152                                                  02388000
FLCMCLA  EQU   PSA+168                                                  02389000
FLCIOEL  EQU   FLCMCLA+4                                                02390000
FLCIOA   EQU   FLCMCLA+16                                               02391000
FLCFSA   EQU   FLCMCLA+80                                               02392000
PSASUPER EQU   PSA+552                                                  02393000
PSASUP1  EQU   PSASUPER                                                 02394000
PSASUP2  EQU   PSASUPER+1                                               02395000
PSASUP3  EQU   PSASUPER+2                                               02396000
PSASUP4  EQU   PSASUPER+3                                               02397000
PSACLHT  EQU   PSA+640                                                  02398000
PSALKSA  EQU   PSA+696                                                  02399000
PSAHLHI  EQU   PSA+760                                                  02400000
PSADSSFL EQU   PSA+836                                                  02401000
PSADSSF1 EQU   PSADSSFL                                                 02402000
PSADSSF3 EQU   PSADSSFL+2                                               02403000
PSADSSF4 EQU   PSADSSFL+3                                               02404000
PSARSVT  EQU   PSA+896                                                  02405000
CTRNGVLU EQU   0                                                        02406000
VARWRKLN EQU   0                                                        02407000
ACBSAVAR EQU   0                                                        02408000
RPLSAVAR EQU   0                                                        02409000
CCRCNTRL EQU   1                                                        02410000
CCRHACI  EQU   CCRCNTRL                                                 02411000
CCRNFCI  EQU   CCRCNTRL+3                                               02412000
CMFPLSTR EQU   0                                                        02413000
CMFLDNAM EQU   CMFPLSTR+24                                              02414000
CMFLRLRP EQU   CMFPLSTR+32                                              02415000
CMFLDEVT EQU   CMFPLSTR+34                                              02416000
CMFLVOL  EQU   CMFPLSTR+38                                              02417000
CMFLVLFL EQU   CMFPLSTR+46                                              02418000
CMFLVLPR EQU   CMFLVLFL                                                 02419000
CMFLNOEX EQU   CMFPLSTR+47                                              02420000
CMFLHUBA EQU   CMFPLSTR+52                                              02421000
CMFLHABA EQU   CMFPLSTR+56                                              02422000
CMFLPHYB EQU   CMFPLSTR+60                                              02423000
CMFLNBTK EQU   CMFPLSTR+64                                              02424000
CMFLNTKA EQU   CMFPLSTR+66                                              02425000
CMFLITEX EQU   CMFPLSTR+68                                              02426000
CMFLSSDT EQU   CMFLITEX                                                 02427000
CMFLSSDS EQU   CMFPLSTR+69                                              02428000
CMFLLKLN EQU   CMFPLSTR+71                                              02429000
CMFLHKLN EQU   CMFPLSTR+73                                              02430000
CMFLEXLN EQU   CMFPLSTR+75                                              02431000
CMFLEND  EQU   CMFPLSTR+77                                              02432000
CMFXECTS EQU   0                                                        02433000
CMFXEXSS EQU   CMFXECTS                                                 02434000
CMFXEXST EQU   CMFXECTS+2                                               02435000
CMFXSTA  EQU   CMFXEXST                                                 02436000
CMFXSTCC EQU   CMFXSTA                                                  02437000
CMFXSTHH EQU   CMFXSTA+2                                                02438000
CMFXEXED EQU   CMFXECTS+6                                               02439000
CMFXEDA  EQU   CMFXEXED                                                 02440000
CMFXEDCC EQU   CMFXEDA                                                  02441000
CMFXEDHH EQU   CMFXEDA+2                                                02442000
CMFXNOTT EQU   CMFXECTS+10                                              02443000
CMFXLRBA EQU   CMFXECTS+12                                              02444000
CMFXHRBA EQU   CMFXECTS+16                                              02445000
CMASFPST EQU   0                                                        02446000
CMAFDNAM EQU   CMASFPST+24                                              02447000
CMAFTYPE EQU   CMASFPST+32                                              02448000
CMAFNAME EQU   CMASFPST+33                                              02449000
IGGCCA   EQU   0                                                        02450000
CCAPROB  EQU   IGGCCA+4                                                 02451000
CCAERRCD EQU   CCAPROB+2                                                02452000
CCAREASN EQU   CCAERRCD                                                 02453000
CCARETRN EQU   CCAERRCD+1                                               02454000
CCACD1   EQU   CCARETRN                                                 02455000
CCAFLG1  EQU   IGGCCA+14                                                02456000
CCAF1CR  EQU   CCAFLG1                                                  02457000
CCAFLG2  EQU   IGGCCA+15                                                02458000
CCAF2COB EQU   CCAFLG2                                                  02459000
CCAF2CB  EQU   CCAF2COB                                                 02460000
CCAFLG3  EQU   IGGCCA+16                                                02461000
CCAFLG4  EQU   IGGCCA+17                                                02462000
CCAFLG5  EQU   IGGCCA+18                                                02463000
CCAFLG6  EQU   IGGCCA+19                                                02464000
CCATCB   EQU   IGGCCA+20                                                02465000
CCARB    EQU   IGGCCA+24                                                02466000
CCACPL   EQU   IGGCCA+28                                                02467000
CCAACB   EQU   IGGCCA+32                                                02468000
CCAURAB  EQU   IGGCCA+40                                                02469000
CCASRCH  EQU   IGGCCA+44                                                02470000
CCASRID  EQU   CCASRCH                                                  02471000
CCARAB0  EQU   IGGCCA+88                                                02472000
CCAR0FLG EQU   CCARAB0                                                  02473000
CCAR0REC EQU   CCARAB0+4                                                02474000
CCAR0SEG EQU   CCARAB0+8                                                02475000
CCARAB1  EQU   IGGCCA+108                                               02476000
CCAR1FLG EQU   CCARAB1                                                  02477000
CCAR1REC EQU   CCARAB1+4                                                02478000
CCAR1SEG EQU   CCARAB1+8                                                02479000
CCARAB2  EQU   IGGCCA+128                                               02480000
CCAR2FLG EQU   CCARAB2                                                  02481000
CCAR2REC EQU   CCARAB2+4                                                02482000
CCAR2SEG EQU   CCARAB2+8                                                02483000
CCARAB3  EQU   IGGCCA+148                                               02484000
CCAR3FLG EQU   CCARAB3                                                  02485000
CCAR3REC EQU   CCARAB3+4                                                02486000
CCAR3SEG EQU   CCARAB3+8                                                02487000
CCARAB4  EQU   IGGCCA+168                                               02488000
CCAR4FLG EQU   CCARAB4                                                  02489000
CCAR4REC EQU   CCARAB4+4                                                02490000
CCAR4SEG EQU   CCARAB4+8                                                02491000
CCARAB5  EQU   IGGCCA+188                                               02492000
CCAR5FLG EQU   CCARAB5                                                  02493000
CCAR5REC EQU   CCARAB5+4                                                02494000
CCAR5SEG EQU   CCARAB5+8                                                02495000
CCATIQRN EQU   IGGCCA+212                                               02496000
CCARPL1  EQU   IGGCCA+220                                               02497000
CCADESA  EQU   IGGCCA+224                                               02498000
CCANDEXT EQU   CCADESA                                                  02499000
CCAIXEXT EQU   CCADESA+1                                                02500000
CCASSVOL EQU   CCADESA+2                                                02501000
CCAEXTDE EQU   CCADESA+4                                                02502000
CCAEXTSS EQU   CCAEXTDE                                                 02503000
CCAEXTAD EQU   CCAEXTDE+2                                               02504000
CCAEXTCC EQU   CCAEXTAD                                                 02505000
CCAEXTHH EQU   CCAEXTAD+2                                               02506000
CCAEXTTH EQU   CCAEXTDE+6                                               02507000
CCAASCI  EQU   IGGCCA+271                                               02508000
CCAEQDQ  EQU   IGGCCA+280                                               02509000
CCAEDOPT EQU   CCAEQDQ+2                                                02510000
CCAMLRET EQU   IGGCCA+296                                               02511000
CCAMSSPL EQU   IGGCCA+300                                               02512000
CCAMNSPL EQU   CCAMSSPL+9                                               02513000
CCACMS   EQU   IGGCCA+316                                               02514000
CCACMSWA EQU   CCACMS                                                   02515000
CCACPE5  EQU   IGGCCA+324                                               02516000
CCACPE6  EQU   IGGCCA+340                                               02517000
CCACPE61 EQU   IGGCCA+344                                               02518000
CCACPE7  EQU   IGGCCA+348                                               02519000
CCAFLPT  EQU   IGGCCA+364                                               02520000
CCADICT  EQU   IGGCCA+372                                               02521000
CCAXCPL  EQU   IGGCCA+376                                               02522000
CCAMCPL  EQU   CCAXCPL                                                  02523000
CCALREL  EQU   IGGCCA+396                                               02524000
CCASN    EQU   IGGCCA+398                                               02525000
CCARBA   EQU   IGGCCA+448                                               02526000
CCACRAVL EQU   CCARBA                                                   02527000
CCACRADT EQU   CCARBA+6                                                 02528000
CCATLNG  EQU   IGGCCA+468                                               02529000
CCAIDPT3 EQU   IGGCCA+480                                               02530000
CCAGRGC  EQU   IGGCCA+493                                               02531000
CCAGRHI  EQU   IGGCCA+494                                               02532000
CCASSEQ  EQU   CCAGRHI                                                  02533000
CCAALPTR EQU   IGGCCA+540                                               02534000
CCAFLG7  EQU   IGGCCA+552                                               02535000
CCAFLG8  EQU   IGGCCA+553                                               02536000
CCAFLG9  EQU   IGGCCA+554                                               02537000
CCASMFLG EQU   IGGCCA+562                                               02538000
CCASMFG1 EQU   CCASMFLG                                                 02539000
CCASMFUC EQU   CCASMFG1                                                 02540000
CCASMFSR EQU   CCASMFG1                                                 02541000
CCABMINP EQU   IGGCCA+684                                               02542000
CCABMFLG EQU   CCABMINP+6                                               02543000
CCABMOUT EQU   IGGCCA+692                                               02544000
CCABMOFG EQU   CCABMOUT+4                                               02545000
CCATEMPS EQU   IGGCCA+744                                               02546000
CCAMNCAT EQU   IGGCCA+784                                               02547000
CCAMNAT  EQU   CCAMNCAT                                                 02548000
MNATTOP  EQU   CCAMNAT                                                  02549000
MNATFULL EQU   MNATTOP                                                  02550000
MNATFLGS EQU   CCAMNAT+240                                              02551000
CCAMNLEN EQU   CCAMNCAT+249                                             02552000
CCAMNADR EQU   CCAMNCAT+252                                             02553000
CCAARFWA EQU   IGGCCA+1040                                              02554000
ARFGMLEN EQU   CCAARFWA                                                 02555000
CCARVFG1 EQU   IGGCCA+1056                                              02556000
CCAREGS  EQU   IGGCCA+1060                                              02557000
CCABZSAV EQU   IGGCCA+1408                                              02558000
CCACUMPL EQU   IGGCCA+1412                                              02559000
CCARALSA EQU   IGGCCA+1440                                              02560000
CCAFLG10 EQU   IGGCCA+1444                                              02561000
CCASMFP  EQU   IGGCCA+1480                                              02562000
CCAPROBX EQU   IGGCCA+1484                                              02563000
CCAERCDX EQU   CCAPROBX+2                                               02564000
CTGPL    EQU   0                                                        02565000
CTGOPTN1 EQU   CTGPL                                                    02566000
CTGOPTN2 EQU   CTGPL+1                                                  02567000
CTGEXT   EQU   CTGOPTN2                                                 02568000
CTGERASE EQU   CTGOPTN2                                                 02569000
CTGSMF   EQU   CTGERASE                                                 02570000
CTGREL   EQU   CTGSMF                                                   02571000
CTGPURG  EQU   CTGOPTN2                                                 02572000
CTGVMNT  EQU   CTGPURG                                                  02573000
CTGOPTN3 EQU   CTGPL+2                                                  02574000
CTGOPTN4 EQU   CTGPL+3                                                  02575000
CTGENT   EQU   CTGPL+4                                                  02576000
CTGFVT   EQU   CTGENT                                                   02577000
CTGCAT   EQU   CTGPL+8                                                  02578000
CTGCVOL  EQU   CTGCAT                                                   02579000
CTGWKA   EQU   CTGPL+12                                                 02580000
CTGDSORG EQU   CTGPL+16                                                 02581000
CTGNOFLD EQU   CTGPL+19                                                 02582000
CTGDDNM  EQU   CTGPL+20                                                 02583000
CTGNEWNM EQU   CTGDDNM                                                  02584000
CTGFBFLG EQU   CTGNEWNM+2                                               02585000
CTGJSCB  EQU   CTGPL+24                                                 02586000
CTGFIELD EQU   CTGPL+28                                                 02587000
CTGFL    EQU   0                                                        02588000
CTGFLDNO EQU   CTGFL                                                    02589000
CTGFLDGC EQU   CTGFL+2                                                  02590000
CTGFLDRE EQU   CTGFL+3                                                  02591000
CTGFLDWA EQU   CTGFL+4                                                  02592000
CTGFLDNM EQU   CTGFL+8                                                  02593000
CTGFLDAT EQU   CTGFL+16                                                 02594000
CTGFLNG  EQU   CTGFLDAT                                                 02595000
CTGFLPT  EQU   CTGFLDAT+4                                               02596000
USERWKA  EQU   0                                                        02597000
WKA      EQU   USERWKA+4                                                02598000
ENTNAMES EQU   WKA                                                      02599000
DICTENT  EQU   0                                                        02600000
DICTFLGS EQU   DICTENT                                                  02601000
DIC2ENT  EQU   0                                                        02602000
DIC2FLGS EQU   DIC2ENT                                                  02603000
CCARAB   EQU   0                                                        02604000
CCARABFL EQU   CCARAB                                                   02605000
CCACPE1  EQU   CCARAB+4                                                 02606000
CCACPE2  EQU   CCARAB+8                                                 02607000
CCACPE3  EQU   CCARAB+12                                                02608000
CCACPE4  EQU   CCARAB+16                                                02609000
CATGOPT  EQU   0                                                        02610000
CATGOCI  EQU   CATGOPT                                                  02611000
CATGOFLG EQU   CATGOCI                                                  02612000
CATGOGC1 EQU   CATGOPT+3                                                02613000
CATGOEXT EQU   CATGOGC1                                                 02614000
CATGODEL EQU   CATGOGC1                                                 02615000
CATGOSEQ EQU   CATGOPT+4                                                02616000
CATRCD   EQU   0                                                        02617000
RCDCINO  EQU   CATRCD+1                                                 02618000
RCDID    EQU   CATRCD+44                                                02619000
RCDSIZ   EQU   CATRCD+45                                                02620000
NREPLF   EQU   CATRCD+48                                                02621000
REPCNTRL EQU   0                                                        02622000
EXTRCDPT EQU   REPCNTRL                                                 02623000
REPCNT   EQU   REPCNTRL+5                                               02624000
REPGOPT  EQU   REPCNTRL+6                                               02625000
VARFIELD EQU   0                                                        02626000
CNTRLINF EQU   0                                                        02627000
LENFIX   EQU   CNTRLINF+1                                               02628000
CVTMAP   EQU   0                                                        02629000
CVTTCBP  EQU   CVTMAP                                                   02630000
CVTDAR   EQU   CVTMAP+72                                                02631000
CVTFLGS1 EQU   CVTDAR                                                   02632000
CVTDCB   EQU   CVTMAP+116                                               02633000
CVTIERLC EQU   CVTMAP+144                                               02634000
CVTOPTA  EQU   CVTMAP+182                                               02635000
CVTOPTB  EQU   CVTMAP+183                                               02636000
CVTGTF   EQU   CVTMAP+236                                               02637000
CVTGTFST EQU   CVTGTF                                                   02638000
CVTGTFS  EQU   CVTGTFST                                                 02639000
CVTSTATE EQU   CVTGTFST                                                 02640000
CVTTMODE EQU   CVTGTFST                                                 02641000
CVTFORM  EQU   CVTGTFST                                                 02642000
CVTAQAVT EQU   CVTMAP+240                                               02643000
CVTTCMFG EQU   CVTAQAVT                                                 02644000
CVTVOLM2 EQU   CVTMAP+244                                               02645000
CVTTATA  EQU   CVTVOLM2                                                 02646000
CVTTSKS  EQU   CVTTATA                                                  02647000
CVTVOLF2 EQU   CVTTSKS                                                  02648000
CVTTAT   EQU   CVTTATA+1                                                02649000
CVTATER  EQU   CVTMAP+248                                               02650000
CVTEXT1  EQU   CVTMAP+252                                               02651000
CVTCBSP  EQU   CVTMAP+256                                               02652000
CVTPURG  EQU   CVTMAP+260                                               02653000
CVTAMFF  EQU   CVTMAP+264                                               02654000
CVTQMSG  EQU   CVTMAP+268                                               02655000
CVTDMSR  EQU   CVTMAP+272                                               02656000
CVTERPV  EQU   CVTMAP+316                                               02657000
CVTINTLA EQU   CVTMAP+320                                               02658000
CVTAPF   EQU   CVTMAP+324                                               02659000
CVTEXT2  EQU   CVTMAP+328                                               02660000
CVTHJES  EQU   CVTMAP+332                                               02661000
CVTPGSIA EQU   CVTMAP+348                                               02662000
CVTA1F1  EQU   CVTMAP+356                                               02663000
CVTSYSK  EQU   CVTMAP+357                                               02664000
CVTVOLM1 EQU   CVTMAP+380                                               02665000
CVTVOLF1 EQU   CVTVOLM1                                                 02666000
CVTATMCT EQU   CVTMAP+388                                               02667000
CVTXTNT1 EQU   0                                                        02668000
CVTXTNT2 EQU   0                                                        02669000
CVTDSSV  EQU   CVTXTNT2                                                 02670000
CVTFLGBT EQU   CVTXTNT2+5                                               02671000
CVTQID   EQU   CVTXTNT2+24                                              02672000
CVTRV400 EQU   CVTXTNT2+52                                              02673000
CVTRV409 EQU   CVTXTNT2+53                                              02674000
CVTATCVT EQU   CVTXTNT2+64                                              02675000
CVTRV429 EQU   CVTXTNT2+84                                              02676000
CVTRV438 EQU   CVTXTNT2+85                                              02677000
CVTRV457 EQU   CVTXTNT2+112                                             02678000
CVTRV466 EQU   CVTXTNT2+113                                             02679000
CVTFIX   EQU   0                                                        02680000
CVTRELNO EQU   CVTFIX+252                                               02681000
TCBWORDS EQU   0                                                        02682000
TCBPTR   EQU   TCBWORDS+4                                               02683000
TCBFIX   EQU   0                                                        02684000
TCBFRS   EQU   TCBFIX                                                   02685000
TCB      EQU   0                                                        02686000
TCBPIE   EQU   TCB+4                                                    02687000
TCBPMASK EQU   TCBPIE                                                   02688000
TCBCMP   EQU   TCB+16                                                   02689000
TCBCMPF  EQU   TCBCMP                                                   02690000
TCBCPP   EQU   TCBCMPF                                                  02691000
TCBSTCC  EQU   TCBCMPF                                                  02692000
TCBCDBL  EQU   TCBCMPF                                                  02693000
TCBCWTO  EQU   TCBCMPF                                                  02694000
TCBCIND  EQU   TCBCMPF                                                  02695000
TCBCMSG  EQU   TCBCMPF                                                  02696000
TCBTRN   EQU   TCB+20                                                   02697000
TCBABF   EQU   TCBTRN                                                   02698000
TCBMSS   EQU   TCB+24                                                   02699000
TCBPKF   EQU   TCB+28                                                   02700000
TCBFLGS  EQU   TCB+29                                                   02701000
TCBFLGS1 EQU   TCBFLGS                                                  02702000
TCBFLGS2 EQU   TCBFLGS+1                                                02703000
TCBFLGS3 EQU   TCBFLGS+2                                                02704000
TCBFLGS4 EQU   TCBFLGS+3                                                02705000
TCBFLGS5 EQU   TCBFLGS+4                                                02706000
TCBABWF  EQU   TCBFLGS5                                                 02707000
TCBJPQ   EQU   TCB+44                                                   02708000
TCBPURGE EQU   TCBJPQ                                                   02709000
TCBGRS   EQU   TCB+48                                                   02710000
TCBFSA   EQU   TCB+112                                                  02711000
TCBTME   EQU   TCB+120                                                  02712000
TCBJSTCB EQU   TCB+124                                                  02713000
TCBTSFLG EQU   TCB+148                                                  02714000
TCBTSTSK EQU   TCBTSFLG                                                 02715000
TCBSTAB  EQU   TCB+160                                                  02716000
TCBNSTAE EQU   TCBSTAB                                                  02717000
TCBTCT   EQU   TCB+164                                                  02718000
TCBTCTGF EQU   TCBTCT                                                   02719000
TCBSCNDY EQU   TCB+172                                                  02720000
TCBNDSP  EQU   TCBSCNDY                                                 02721000
TCBNDSP1 EQU   TCBNDSP+1                                                02722000
TCBNDSP2 EQU   TCBNDSP+2                                                02723000
TCBNDSP3 EQU   TCBNDSP+3                                                02724000
TCBJSCB  EQU   TCB+180                                                  02725000
TCBRECDE EQU   TCBJSCB                                                  02726000
TCBEXT1  EQU   TCB+196                                                  02727000
TCBBITS  EQU   TCB+200                                                  02728000
TCBNDSP4 EQU   TCBBITS                                                  02729000
TCBNDSP5 EQU   TCBBITS+1                                                02730000
TCBFLGS6 EQU   TCBBITS+2                                                02731000
TCBFLGS7 EQU   TCBBITS+3                                                02732000
TCBDAR   EQU   TCB+204                                                  02733000
TCBDARC  EQU   TCBDAR                                                   02734000
TCBEXT2  EQU   TCB+208                                                  02735000
TCBFOE   EQU   TCB+244                                                  02736000
TCBESTAE EQU   TCB+264                                                  02737000
TCBESTRM EQU   TCBESTAE+1                                               02738000
TCBFBYT1 EQU   TCB+276                                                  02739000
TCBFBYT2 EQU   TCB+277                                                  02740000
TCBRV124 EQU   TCB+278                                                  02741000
TCBRV133 EQU   TCB+279                                                  02742000
TCBXTNT2 EQU   0                                                        02743000
TCBGTF   EQU   TCBXTNT2                                                 02744000
TCBTFLG  EQU   TCBGTF                                                   02745000
TCBRV146 EQU   TCBXTNT2+28                                              02746000
TCBRV155 EQU   TCBXTNT2+29                                              02747000
TCBRV164 EQU   TCBXTNT2+30                                              02748000
TCBRV173 EQU   TCBXTNT2+31                                              02749000
IFGACB   EQU   0                                                        02750000
ACBCOMN  EQU   IFGACB                                                   02751000
ACBLENG  EQU   ACBCOMN+2                                                02752000
ACBLENG2 EQU   ACBLENG                                                  02753000
ACBAMBL  EQU   ACBCOMN+4                                                02754000
ACBJWA   EQU   ACBAMBL                                                  02755000
ACBMACRF EQU   ACBCOMN+12                                               02756000
ACBMACR1 EQU   ACBMACRF                                                 02757000
ACBADR   EQU   ACBMACR1                                                 02758000
ACBCNV   EQU   ACBMACR1                                                 02759000
ACBMACR2 EQU   ACBMACRF+1                                               02760000
ACBBUFPL EQU   ACBCOMN+20                                               02761000
ACBMACR3 EQU   ACBBUFPL                                                 02762000
ACBRECFM EQU   ACBCOMN+24                                               02763000
ACBCCTYP EQU   ACBCOMN+25                                               02764000
ACBOPT   EQU   ACBCOMN+26                                               02765000
ACBDSORG EQU   ACBOPT                                                   02766000
ACBCROPS EQU   ACBDSORG                                                 02767000
ACBEXLST EQU   ACBCOMN+36                                               02768000
ACBDDNM  EQU   ACBCOMN+40                                               02769000
ACBAMETH EQU   ACBDDNM+3                                                02770000
ACBOFLGS EQU   ACBCOMN+48                                               02771000
ACBEXFG  EQU   ACBOFLGS                                                 02772000
ACBIOSFG EQU   ACBOFLGS                                                 02773000
ACBINFLG EQU   ACBCOMN+50                                               02774000
ACBUJFCB EQU   ACBCOMN+52                                               02775000
ACBBLKSZ EQU   ACBCOMN+60                                               02776000
ACBUAPTR EQU   ACBCOMN+64                                               02777000
AMCBS    EQU   0                                                        02778000
CBSCMP   EQU   AMCBS+16                                                 02779000
CBSVSRT  EQU   AMCBS+32                                                 02780000
IGGCAXWA EQU   0                                                        02781000
CAXFLGS  EQU   IGGCAXWA+8                                               02782000
CAXFLG2  EQU   IGGCAXWA+9                                               02783000
CAXFLG3  EQU   IGGCAXWA+10                                              02784000
CAXCCR   EQU   IGGCAXWA+32                                              02785000
CAXCNAM  EQU   IGGCAXWA+52                                              02786000
CAXOPLST EQU   IGGCAXWA+96                                              02787000
COPTS    EQU   CAXOPLST                                                 02788000
CTGFV    EQU   0                                                        02789000
CTGFVTYP EQU   CTGFV                                                    02790000
CTGFVPRO EQU   CTGFV+1                                                  02791000
CTGFVDRC EQU   CTGFVPRO                                                 02792000
CTGFVDCH EQU   CTGFV+4                                                  02793000
CTGFVICH EQU   CTGFV+8                                                  02794000
CTGFVVCH EQU   CTGFV+12                                                 02795000
CTGFVOWN EQU   CTGFV+28                                                 02796000
CTGFVVLT EQU   CTGFV+40                                                 02797000
CTGFVSPC EQU   CTGFV+52                                                 02798000
CTGFVAMD EQU   CTGFV+56                                                 02799000
CTGFVATR EQU   CTGFV+60                                                 02800000
CTGFVLRS EQU   CTGFV+68                                                 02801000
CTGFVLMT EQU   CTGFV+72                                                 02802000
CTGFVEXT EQU   CTGFVLMT                                                 02803000
CTGFVGAT EQU   CTGFV+76                                                 02804000
CTGWA    EQU   0                                                        02805000
CTGWAVL  EQU   CTGWA                                                    02806000
CTGVL    EQU   0                                                        02807000
CTGVLX   EQU   0                                                        02808000
CTGCV    EQU   0                                                        02809000
CTGCVDSN EQU   CTGCV+6                                                  02810000
MWA      EQU   0                                                        02811000
VLST     EQU   MWA+2                                                    02812000
CVOLIND  EQU   MWA+252                                                  02813000
CATRECRD EQU   0                                                        02814000
ASGO     EQU   1                                                        02815000
PASSGO   EQU   1                                                        02816000
PASSWORD EQU   PASSGO                                                   02817000
USERAREC EQU   PASSGO+50                                                02818000
USERLIST EQU   0                                                        02819000
LTENTRY  EQU   USERLIST+2                                               02820000
LTRETCOD EQU   LTENTRY                                                  02821000
LTVOLSER EQU   LTENTRY+2                                                02822000
SPACEPRM EQU   0                                                        02823000
SPCPRIMQ EQU   SPACEPRM                                                 02824000
SPCOPTNS EQU   SPACEPRM+6                                               02825000
CTGDSATR EQU   0                                                        02826000
CTGATR1  EQU   CTGDSATR                                                 02827000
CTGDSREC EQU   CTGATR1                                                  02828000
CTGATR2  EQU   CTGDSATR+1                                               02829000
RGATTRFL EQU   0                                                        02830000
RGATTR1  EQU   RGATTRFL                                                 02831000
RGATTSG1 EQU   RGATTRFL+1                                               02832000
OWNIDFLD EQU   0                                                        02833000
LRECL    EQU   0                                                        02834000
EXCPNAME EQU   0                                                        02835000
DEVCHARS EQU   0                                                        02836000
RTDEVUCB EQU   DEVCHARS                                                 02837000
RTBOKAB  EQU   DEVCHARS+14                                              02838000
RTDVFLGS EQU   DEVCHARS+17                                              02839000
IDAAMDSB EQU   0                                                        02840000
AMDATTR  EQU   IDAAMDSB+1                                               02841000
AMDNEST  EQU   IDAAMDSB+4                                               02842000
AMDHLRBA EQU   IDAAMDSB+28                                              02843000
AMDSSRBA EQU   IDAAMDSB+32                                              02844000
AMDATTR3 EQU   IDAAMDSB+40                                              02845000
AMDSTAT  EQU   IDAAMDSB+48                                              02846000
AMDNEXT  EQU   AMDSTAT+10                                               02847000
AMDASPA  EQU   AMDSTAT+32                                               02848000
DSPTBL   EQU   0                                                        02849000
CMSWA    EQU   0                                                        02850000
CMWFLAGS EQU   CMSWA                                                    02851000
CMCISUSE EQU   CMSWA+2                                                  02852000
CMWRKATR EQU   CMCISUSE                                                 02853000
CMWFVTPT EQU   CMSWA+12                                                 02854000
CMASCFPL EQU   CMSWA+16                                                 02855000
CMCPLFVT EQU   CMSWA+20                                                 02856000
CMNRMEXT EQU   CMSWA+24                                                 02857000
CMLDTFPL EQU   CMNRMEXT                                                 02858000
CMSSEXTS EQU   CMSWA+28                                                 02859000
CMHDTFPL EQU   CMSSEXTS                                                 02860000
CMCANVOL EQU   CMSWA+32                                                 02861000
CMHIXFPL EQU   CMCANVOL                                                 02862000
PROCESS  EQU   CMSWA+36                                                 02863000
SPACINDC EQU   CMSWA+38                                                 02864000
CMRNGCTR EQU   CMSWA+40                                                 02865000
CMVOLCTR EQU   CMSWA+42                                                 02866000
CMSDFSPC EQU   CMSWA+48                                                 02867000
CMVLLIST EQU   CMSWA+64                                                 02868000
CMVLLTLN EQU   CMVLLIST                                                 02869000
CMVLRTCD EQU   CMVLLIST+2                                               02870000
CMVLVOL  EQU   CMVLLIST+4                                               02871000
CMSPCATR EQU   CMSWA+76                                                 02872000
CMPHYBLK EQU   CMSPCATR                                                 02873000
CMSWADTY EQU   CMSPCATR+4                                               02874000
CMBLKTRK EQU   CMSPCATR+8                                               02875000
CMTRKPCA EQU   CMSPCATR+10                                              02876000
CMTRKCYL EQU   CMSPCATR+12                                              02877000
CMFPLIDX EQU   CMSWA+112                                                02878000
CMEXTLST EQU   CMSWA+120                                                02879000
CMSRCCOR EQU   CMSWA+124                                                02880000
CMDEFSWA EQU   CMSWA+128                                                02881000
CMWASTOR EQU   CMSWA+132                                                02882000
CMPOT    EQU   CMWASTOR                                                 02883000
CMDCONV  EQU   CMPOT                                                    02884000
CMIXFANO EQU   CMDCONV                                                  02885000
CMPOTX   EQU   CMWASTOR+4                                               02886000
CMPBI    EQU   CMPOTX                                                   02887000
CMIXFANS EQU   CMPBI                                                    02888000
CMWABYTB EQU   CMSWA+140                                                02889000
CMPBIX   EQU   CMWABYTB                                                 02890000
CMNEST   EQU   CMPBIX                                                   02891000
CMFANT   EQU   CMNEST                                                   02892000
CMSPCQTY EQU   CMFANT                                                   02893000
CMWGENAM EQU   CMSWA+144                                                02894000
CMWDATE  EQU   CMWGENAM+12                                              02895000
CMWTIME  EQU   CMWGENAM+17                                              02896000
DCWAREPT EQU   CMSWA+192                                                02897000
DCWFPLPT EQU   CMSWA+196                                                02898000
DCWPLSPS EQU   CMSWA+200                                                02899000
DCWPLSPL EQU   DCWPLSPS                                                 02900000
DCWPLBFS EQU   CMSWA+232                                                02901000
DCWPLBFL EQU   DCWPLBFS                                                 02902000
DCWPLEDS EQU   CMSWA+260                                                02903000
DCWPLEDL EQU   DCWPLEDS                                                 02904000
DCWPLARS EQU   CMSWA+288                                                02905000
DCWPLARL EQU   DCWPLARS                                                 02906000
DCWPLCDS EQU   CMSWA+316                                                02907000
DCWPLCDL EQU   DCWPLCDS                                                 02908000
CMUCATCI EQU   CMSWA+410                                                02909000
CMSCTREC EQU   CMSWA+416                                                02910000
CUMPLWA  EQU   0                                                        02911000
CUMPL    EQU   CUMPLWA                                                  02912000
CUMIN    EQU   CUMPL                                                    02913000
CUMOUT   EQU   CUMPL+1                                                  02914000
CUMWA    EQU   CUMPLWA+8                                                02915000
CUMFLAG  EQU   CUMWA                                                    02916000
CUMWASS2 EQU   CUMWA+48                                                 02917000
CUMWASS  EQU   CUMWASS2+2                                               02918000
CUMWTYP  EQU   CUMWASS                                                  02919000
SALPARL  EQU   0                                                        02920000
SALOPTNS EQU   SALPARL                                                  02921000
SALSOURC EQU   SALPARL+2                                                02922000
SALDSCIN EQU   SALPARL+3                                                02923000
SALPARMS EQU   SALPARL+6                                                02924000
SALCALN  EQU   SALPARMS                                                 02925000
SALUNITS EQU   SALPARMS+4                                               02926000
SALMXEXT EQU   SALPARMS+6                                               02927000
SALRLIST EQU   SALPARL+14                                               02928000
SALVLIST EQU   SALPARL+18                                               02929000
PRLIST   EQU   0                                                        02930000
PRLLN    EQU   PRLIST                                                   02931000
PRLENT   EQU   PRLIST+1                                                 02932000
PRELENTF EQU   PRLENT                                                   02933000
BUFSIZE  EQU   0                                                        02934000
CATSN    EQU   0                                                        02935000
CATTNAME EQU   0                                                        02936000
CI       EQU   0                                                        02937000
CTGVLDSP EQU   0                                                        02938000
DATEFLD  EQU   0                                                        02939000
ENTRYNAM EQU   0                                                        02940000
FIELDNM  EQU   0                                                        02941000
TNAM     EQU   0                                                        02942000
@NM00037 EQU   CTGDDNM                                                  02943000
CTGPROB  EQU   @NM00037                                                 02944000
CTGREASN EQU   CTGPROB+2                                                02945000
CVTS01   EQU   CVTPGSIA                                                 02946000
CVTLPDIA EQU   CVTS01+12                                                02947000
CVTDIRST EQU   CVTLPDIA                                                 02948000
CVTSLIDA EQU   CVTS01+24                                                02949000
CVTCTLFG EQU   CVTS01+50                                                02950000
CVTRV210 EQU   CVTS01+424                                               02951000
CVTRV219 EQU   CVTS01+425                                               02952000
CVTRV228 EQU   CVTS01+426                                               02953000
CVTRV237 EQU   CVTS01+427                                               02954000
CVTMFRTR EQU   CVTS01+452                                               02955000
CVTRV262 EQU   CVTS01+468                                               02956000
CVTRV271 EQU   CVTS01+469                                               02957000
CVTRV280 EQU   CVTS01+470                                               02958000
CVTRV289 EQU   CVTS01+471                                               02959000
CVTGSDA  EQU   CVTS01+600                                               02960000
PSARSVTE EQU   PSARSVT                                                  02961000
MCATDSTR EQU   CVTAMFF                                                  02962000
CVTAMF1  EQU   MCATDSTR                                                 02963000
CTGRBASE EQU   NREPLF+1                                                 02964000
CNAME    EQU   CTGRBASE                                                 02965000
COWNID   EQU   CTGRBASE+44                                              02966000
CATTR    EQU   CTGRBASE+58                                              02967000
CATTR1   EQU   CATTR                                                    02968000
CATTR2   EQU   CATTR+1                                                  02969000
COPEN    EQU   CTGRBASE+60                                              02970000
CBUF     EQU   CTGRBASE+61                                              02971000
CSPACPRM EQU   CTGRBASE+65                                              02972000
CPRIM    EQU   CSPACPRM                                                 02973000
CSEC     EQU   CSPACPRM+3                                               02974000
CSORT    EQU   CSPACPRM+6                                               02975000
CHIA     EQU   CTGRBASE+76                                              02976000
CLRECL   EQU   CTGRBASE+80                                              02977000
CEXT     EQU   CTGRBASE+86                                              02978000
@NM00099 EQU   CATTR1                                                   02979000
CCATTR   EQU   @NM00099                                                 02980000
@NM00100 EQU   CCATTR                                                   02981000
@NM00102 EQU   CATTR1                                                   02982000
CRGATTR  EQU   @NM00102                                                 02983000
CUPG     EQU   CRGATTR                                                  02984000
SAVFSTXT EQU   CMSCTREC+76                                              02985000
FLC      EQU   PSA                                                      02986000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02987000
@NM00103 EQU   CRGATTR                                                  02988000
CUPD     EQU   CUPG                                                     02989000
CPGSP    EQU   @NM00100                                                 02990000
@NM00101 EQU   @NM00100                                                 02991000
CDOSUINF EQU   CTGRBASE+84                                              02992000
CHIU     EQU   CTGRBASE+72                                              02993000
@NM00098 EQU   COPEN                                                    02994000
COPENDS  EQU   COPEN                                                    02995000
CNUS     EQU   CATTR2                                                   02996000
@NM00097 EQU   CATTR2                                                   02997000
CATTRSSH EQU   CATTR2                                                   02998000
CATTRISH EQU   CATTR2                                                   02999000
CTRKOV   EQU   CATTR1                                                   03000000
CTEMP    EQU   CATTR1                                                   03001000
CINHIB   EQU   CATTR1                                                   03002000
CRECOV   EQU   CATTR1                                                   03003000
CERASE   EQU   CATTR1                                                   03004000
CREUSE   EQU   CATTR1                                                   03005000
CUNIQ    EQU   CATTR1                                                   03006000
CSP      EQU   CATTR1                                                   03007000
CEXP     EQU   CTGRBASE+55                                              03008000
CCRE     EQU   CTGRBASE+52                                              03009000
@NM00087 EQU   MCATDSTR+1                                               03010000
@NM00086 EQU   CVTAMF1                                                  03011000
AMF1NONX EQU   CVTAMF1                                                  03012000
AMF1OPEN EQU   CVTAMF1                                                  03013000
PSARSAV  EQU   PSARSVTE+60                                              03014000
PSARSTK  EQU   PSARSVTE+56                                              03015000
PSAESAV3 EQU   PSARSVTE+52                                              03016000
PSAESTK3 EQU   PSARSVTE+48                                              03017000
PSAESAV2 EQU   PSARSVTE+44                                              03018000
PSAESTK2 EQU   PSARSVTE+40                                              03019000
PSAESAV1 EQU   PSARSVTE+36                                              03020000
PSAESTK1 EQU   PSARSVTE+32                                              03021000
PSAPSAV  EQU   PSARSVTE+28                                              03022000
PSAPSTK  EQU   PSARSVTE+24                                              03023000
PSAMSAV  EQU   PSARSVTE+20                                              03024000
PSAMSTK  EQU   PSARSVTE+16                                              03025000
PSASSAV  EQU   PSARSVTE+12                                              03026000
PSASSTK  EQU   PSARSVTE+8                                               03027000
PSANSTK  EQU   PSARSVTE+4                                               03028000
PSACSTK  EQU   PSARSVTE                                                 03029000
CVTRV628 EQU   CVTS01+728                                               03030000
CVTRV627 EQU   CVTS01+724                                               03031000
CVTRV626 EQU   CVTS01+720                                               03032000
CVTRV625 EQU   CVTS01+716                                               03033000
CVTRV624 EQU   CVTS01+712                                               03034000
CVTRV623 EQU   CVTS01+708                                               03035000
CVTRV622 EQU   CVTS01+704                                               03036000
CVTRV621 EQU   CVTS01+700                                               03037000
CVTRV620 EQU   CVTS01+696                                               03038000
CVTRV619 EQU   CVTS01+692                                               03039000
CVTRV618 EQU   CVTS01+688                                               03040000
CVTRV617 EQU   CVTS01+684                                               03041000
CVTRV616 EQU   CVTS01+680                                               03042000
CVTRV615 EQU   CVTS01+676                                               03043000
CVTRV614 EQU   CVTS01+672                                               03044000
CVTRV613 EQU   CVTS01+668                                               03045000
CVTRV612 EQU   CVTS01+664                                               03046000
CVTRV611 EQU   CVTS01+660                                               03047000
CVTRV610 EQU   CVTS01+656                                               03048000
CVTRV609 EQU   CVTS01+652                                               03049000
CVTRV608 EQU   CVTS01+648                                               03050000
CVTRV607 EQU   CVTS01+644                                               03051000
CVTRV606 EQU   CVTS01+640                                               03052000
CVTRV605 EQU   CVTS01+636                                               03053000
CVTRV604 EQU   CVTS01+632                                               03054000
CVTEFF02 EQU   CVTS01+628                                               03055000
CVTCBBR  EQU   CVTS01+624                                               03056000
CVTSSCR  EQU   CVTS01+620                                               03057000
CVTEVENT EQU   CVTS01+616                                               03058000
CVTCRCA  EQU   CVTS01+612                                               03059000
CVTTPIO  EQU   CVTS01+608                                               03060000
CVTADV   EQU   CVTS01+604                                               03061000
CVTGSDAB EQU   CVTGSDA                                                  03062000
CVTQV3   EQU   CVTS01+596                                               03063000
CVTQV2   EQU   CVTS01+592                                               03064000
CVTQV1   EQU   CVTS01+588                                               03065000
CVTRPT   EQU   CVTS01+584                                               03066000
CVTSSRB  EQU   CVTS01+580                                               03067000
CVTCSDRL EQU   CVTS01+576                                               03068000
CVTEXP1  EQU   CVTS01+572                                               03069000
CVTRMPMT EQU   CVTS01+568                                               03070000
CVTRMPTT EQU   CVTS01+564                                               03071000
CVTVPSA  EQU   CVTS01+560                                               03072000
CVTVSTOP EQU   CVTS01+556                                               03073000
CVTGTFR8 EQU   CVTS01+552                                               03074000
CVTQUIT  EQU   CVTS01+548                                               03075000
CVTVACR  EQU   CVTS01+544                                               03076000
CVTWTCB  EQU   CVTS01+540                                               03077000
CVTSTPRS EQU   CVTS01+536                                               03078000
CVT0PT02 EQU   CVTS01+532                                               03079000
CVTDARCM EQU   CVTS01+528                                               03080000
CVTIRECM EQU   CVTS01+524                                               03081000
CVTJRECM EQU   CVTS01+520                                               03082000
CVTVEMS0 EQU   CVTS01+516                                               03083000
CVTSPFRR EQU   CVTS01+512                                               03084000
CVTRLSTG EQU   CVTS01+508                                               03085000
CVT0TC0A EQU   CVTS01+504                                               03086000
CVTGMBR  EQU   CVTS01+500                                               03087000
CVTLFRM  EQU   CVTS01+496                                               03088000
CVTRMBR  EQU   CVTS01+492                                               03089000
CVTVIOP  EQU   CVTS01+488                                               03090000
CVTRV307 EQU   CVTS01+486                                               03091000
CVTRV306 EQU   CVTS01+484                                               03092000
CVTRV305 EQU   CVTS01+482                                               03093000
CVTRV304 EQU   CVTS01+480                                               03094000
CVTRV303 EQU   CVTS01+478                                               03095000
CVTRV302 EQU   CVTS01+476                                               03096000
CVTTRCA  EQU   CVTS01+472                                               03097000
CVTRV297 EQU   CVTRV289                                                 03098000
CVTRV296 EQU   CVTRV289                                                 03099000
CVTRV295 EQU   CVTRV289                                                 03100000
CVTRV294 EQU   CVTRV289                                                 03101000
CVTRV293 EQU   CVTRV289                                                 03102000
CVTRV292 EQU   CVTRV289                                                 03103000
CVTRV291 EQU   CVTRV289                                                 03104000
CVTRV290 EQU   CVTRV289                                                 03105000
CVTRV288 EQU   CVTRV280                                                 03106000
CVTRV287 EQU   CVTRV280                                                 03107000
CVTRV286 EQU   CVTRV280                                                 03108000
CVTRV285 EQU   CVTRV280                                                 03109000
CVTRV284 EQU   CVTRV280                                                 03110000
CVTRV283 EQU   CVTRV280                                                 03111000
CVTRV282 EQU   CVTRV280                                                 03112000
CVTRV281 EQU   CVTRV280                                                 03113000
CVTRV279 EQU   CVTRV271                                                 03114000
CVTRV278 EQU   CVTRV271                                                 03115000
CVTRV277 EQU   CVTRV271                                                 03116000
CVTRV276 EQU   CVTRV271                                                 03117000
CVTRV275 EQU   CVTRV271                                                 03118000
CVTRV274 EQU   CVTRV271                                                 03119000
CVTRV273 EQU   CVTRV271                                                 03120000
CVTRV272 EQU   CVTRV271                                                 03121000
CVTRV270 EQU   CVTRV262                                                 03122000
CVTRV269 EQU   CVTRV262                                                 03123000
CVTRV268 EQU   CVTRV262                                                 03124000
CVTRV267 EQU   CVTRV262                                                 03125000
CVTRV266 EQU   CVTRV262                                                 03126000
CVTRV265 EQU   CVTRV262                                                 03127000
CVTRV264 EQU   CVTRV262                                                 03128000
CVTRV263 EQU   CVTRV262                                                 03129000
CVTVFP   EQU   CVTS01+464                                               03130000
CVTVSI   EQU   CVTS01+460                                               03131000
CVTVPSIB EQU   CVTS01+456                                               03132000
CVTMFACT EQU   CVTMFRTR                                                 03133000
CVTMFCTL EQU   CVTS01+448                                               03134000
CVTPVBP  EQU   CVTS01+444                                               03135000
CVTPWI   EQU   CVTS01+440                                               03136000
CVTRV254 EQU   CVTS01+438                                               03137000
CVTRV253 EQU   CVTS01+436                                               03138000
CVTRV252 EQU   CVTS01+434                                               03139000
CVTRV251 EQU   CVTS01+433                                               03140000
CVTRV250 EQU   CVTS01+432                                               03141000
CVTRV249 EQU   CVTS01+431                                               03142000
CVTRV248 EQU   CVTS01+430                                               03143000
CVTRV247 EQU   CVTS01+429                                               03144000
CVTRV246 EQU   CVTS01+428                                               03145000
CVTRV245 EQU   CVTRV237                                                 03146000
CVTRV244 EQU   CVTRV237                                                 03147000
CVTRV243 EQU   CVTRV237                                                 03148000
CVTRV242 EQU   CVTRV237                                                 03149000
CVTRV241 EQU   CVTRV237                                                 03150000
CVTRV240 EQU   CVTRV237                                                 03151000
CVTRV239 EQU   CVTRV237                                                 03152000
CVTRV238 EQU   CVTRV237                                                 03153000
CVTRV236 EQU   CVTRV228                                                 03154000
CVTRV235 EQU   CVTRV228                                                 03155000
CVTRV234 EQU   CVTRV228                                                 03156000
CVTRV233 EQU   CVTRV228                                                 03157000
CVTRV232 EQU   CVTRV228                                                 03158000
CVTRV231 EQU   CVTRV228                                                 03159000
CVTRV230 EQU   CVTRV228                                                 03160000
CVTRV229 EQU   CVTRV228                                                 03161000
CVTRV227 EQU   CVTRV219                                                 03162000
CVTRV226 EQU   CVTRV219                                                 03163000
CVTRV225 EQU   CVTRV219                                                 03164000
CVTRV224 EQU   CVTRV219                                                 03165000
CVTRV223 EQU   CVTRV219                                                 03166000
CVTRV222 EQU   CVTRV219                                                 03167000
CVTRV221 EQU   CVTRV219                                                 03168000
CVTRV220 EQU   CVTRV219                                                 03169000
CVTRV218 EQU   CVTRV210                                                 03170000
CVTRV217 EQU   CVTRV210                                                 03171000
CVTRV216 EQU   CVTRV210                                                 03172000
CVTRV215 EQU   CVTRV210                                                 03173000
CVTRV214 EQU   CVTRV210                                                 03174000
CVTRV213 EQU   CVTRV210                                                 03175000
CVTRV212 EQU   CVTRV210                                                 03176000
CVTRV211 EQU   CVTRV210                                                 03177000
CVTLCCAT EQU   CVTS01+420                                               03178000
CVTPCCAT EQU   CVTS01+416                                               03179000
CVTIPCRP EQU   CVTS01+412                                               03180000
CVTIPCRI EQU   CVTS01+408                                               03181000
CVTIPCDS EQU   CVTS01+404                                               03182000
CVTAIDVT EQU   CVTS01+400                                               03183000
CVTSSAP  EQU   CVTS01+396                                               03184000
CVTEHCIR EQU   CVTS01+392                                               03185000
CVTEHDEF EQU   CVTS01+388                                               03186000
CVTDAIR  EQU   CVTS01+384                                               03187000
CVTPERFM EQU   CVTS01+380                                               03188000
CVT044R2 EQU   CVTS01+376                                               03189000
CVTFETCH EQU   CVTS01+372                                               03190000
CVTRSTWD EQU   CVTS01+368                                               03191000
CVTSPOST EQU   CVTS01+364                                               03192000
CVTIOBP  EQU   CVTS01+360                                               03193000
CVTASMVT EQU   CVTS01+356                                               03194000
CVTRECRQ EQU   CVTS01+352                                               03195000
CVTWSAC  EQU   CVTS01+348                                               03196000
CVTRV149 EQU   CVTS01+344                                               03197000
CVTWSAL  EQU   CVTS01+340                                               03198000
CVTSPSA  EQU   CVTS01+336                                               03199000
CVTGLMN  EQU   CVTS01+332                                               03200000
CVTVEAC0 EQU   CVTS01+328                                               03201000
CVT062R1 EQU   CVTS01+324                                               03202000
CVTRPOST EQU   CVTS01+320                                               03203000
CVTDQIQE EQU   CVTS01+316                                               03204000
CVTCSD   EQU   CVTS01+312                                               03205000
CVTLKRMA EQU   CVTS01+308                                               03206000
CVTRSPIE EQU   CVTS01+304                                               03207000
CVTRENQ  EQU   CVTS01+300                                               03208000
CVTLQCB  EQU   CVTS01+296                                               03209000
CVTFQCB  EQU   CVTS01+292                                               03210000
CVTQCS01 EQU   CVTS01+288                                               03211000
CVTAPFT  EQU   CVTS01+284                                               03212000
CVTPARRL EQU   CVTS01+280                                               03213000
CVTVWAIT EQU   CVTS01+276                                               03214000
CVTGSPL  EQU   CVTS01+272                                               03215000
CVTLSMQ  EQU   CVTS01+268                                               03216000
CVTGSMQ  EQU   CVTS01+264                                               03217000
CVTEXPRO EQU   CVTS01+260                                               03218000
CVTOPCTP EQU   CVTS01+256                                               03219000
CVTSIC   EQU   CVTS01+252                                               03220000
CVTTPIOS EQU   CVTS01+248                                               03221000
CVTRTMS  EQU   CVTS01+244                                               03222000
CVTSDBF  EQU   CVTS01+240                                               03223000
CVTSCBP  EQU   CVTS01+236                                               03224000
CVTSDMP  EQU   CVTS01+232                                               03225000
CVTSV60  EQU   CVTS01+228                                               03226000
CVTRTMCT EQU   CVTS01+224                                               03227000
CVTASCBL EQU   CVTS01+220                                               03228000
CVTASCBH EQU   CVTS01+216                                               03229000
CVTGDA   EQU   CVTS01+212                                               03230000
CVTASVT  EQU   CVTS01+208                                               03231000
CVTVVMDI EQU   CVTS01+204                                               03232000
CVTAQTOP EQU   CVTS01+200                                               03233000
CVTIOSCS EQU   CVTS01+196                                               03234000
CVTSDRM  EQU   CVTS01+192                                               03235000
CVTOPTE  EQU   CVTS01+188                                               03236000
CVTSTXU  EQU   CVTS01+184                                               03237000
CVTQUIS  EQU   CVTS01+180                                               03238000
CVTPARS  EQU   CVTS01+176                                               03239000
CVTS1EE  EQU   CVTS01+172                                               03240000
CVTFRAS  EQU   CVTS01+168                                               03241000
CVTQSAS  EQU   CVTS01+164                                               03242000
CVTCRAS  EQU   CVTS01+160                                               03243000
CVTCRMN  EQU   CVTS01+156                                               03244000
CVTDELCP EQU   CVTS01+152                                               03245000
CVTFRECL EQU   CVTS01+148                                               03246000
CVTGETCL EQU   CVTS01+144                                               03247000
CVTBLDCP EQU   CVTS01+140                                               03248000
CVTAUTHL EQU   CVTS01+136                                               03249000
CVTSCAN  EQU   CVTS01+132                                               03250000
CVTRV144 EQU   CVTS01+130                                               03251000
CVTMAXMP EQU   CVTS01+128                                               03252000
CVTSTCK  EQU   CVTS01+124                                               03253000
CVTRV139 EQU   CVTS01+123                                               03254000
CVTDSSAC EQU   CVTS01+122                                               03255000
CVTRV513 EQU   CVTS01+121                                               03256000
CVTIOSPL EQU   CVTS01+120                                               03257000
CVTPTGT  EQU   CVTS01+116                                               03258000
CVTCSPIE EQU   CVTS01+112                                               03259000
CVTSMFEX EQU   CVTS01+108                                               03260000
CVTOLT0A EQU   CVTS01+104                                               03261000
CVTSRBRT EQU   CVTS01+100                                               03262000
CVTPUTL  EQU   CVTS01+96                                                03263000
CVTRV519 EQU   CVTS01+92                                                03264000
CVTRV327 EQU   CVTS01+88                                                03265000
CVTRV326 EQU   CVTS01+84                                                03266000
CVTRV325 EQU   CVTS01+80                                                03267000
CVTRV324 EQU   CVTS01+76                                                03268000
CVT0VL01 EQU   CVTS01+72                                                03269000
CVTSHRVM EQU   CVTS01+68                                                03270000
CVTRV332 EQU   CVTS01+64                                                03271000
CVTTAS   EQU   CVTS01+60                                                03272000
CVTRSCN  EQU   CVTS01+56                                                03273000
CVTTRAC2 EQU   CVTS01+54                                                03274000
CVTTRACE EQU   CVTS01+52                                                03275000
CVTAPG   EQU   CVTS01+51                                                03276000
CVTSDTRC EQU   CVTCTLFG                                                 03277000
CVTGTRCE EQU   CVTCTLFG                                                 03278000
CVTNOMP  EQU   CVTCTLFG                                                 03279000
CVTRSV79 EQU   CVTCTLFG                                                 03280000
CVTDSTAT EQU   CVTCTLFG                                                 03281000
CVTRSV78 EQU   CVTCTLFG                                                 03282000
CVTRV333 EQU   CVTCTLFG                                                 03283000
CVTRV323 EQU   CVTCTLFG                                                 03284000
CVTSPVLK EQU   CVTS01+49                                                03285000
CVTRSV77 EQU   CVTS01+48                                                03286000
CVTRV331 EQU   CVTS01+44                                                03287000
CVTRV330 EQU   CVTS01+40                                                03288000
CVTRV329 EQU   CVTS01+36                                                03289000
CVTRV328 EQU   CVTS01+32                                                03290000
CVTRV322 EQU   CVTS01+28                                                03291000
CVTSLID  EQU   CVTSLIDA+1                                               03292000
CVTSYLK  EQU   CVTSLIDA                                                 03293000
CVTRV321 EQU   CVTS01+20                                                03294000
CVTRV320 EQU   CVTS01+16                                                03295000
CVTLPDIR EQU   CVTLPDIA+1                                               03296000
CVTRSV69 EQU   CVTDIRST                                                 03297000
CVTRSV68 EQU   CVTDIRST                                                 03298000
CVTRSV67 EQU   CVTDIRST                                                 03299000
CVTRSV66 EQU   CVTDIRST                                                 03300000
CVTRSV65 EQU   CVTDIRST                                                 03301000
CVTRSV64 EQU   CVTDIRST                                                 03302000
CVTRSV63 EQU   CVTDIRST                                                 03303000
CVTDICOM EQU   CVTDIRST                                                 03304000
CVTPVTP  EQU   CVTS01+8                                                 03305000
CVTLPDSR EQU   CVTS01+4                                                 03306000
CVTGETL  EQU   CVTS01                                                   03307000
CTGREAS2 EQU   CTGREASN+1                                               03308000
CTGREAS1 EQU   CTGREASN                                                 03309000
CTGMODID EQU   CTGPROB                                                  03310000
PRLPAR2  EQU   PRELENTF+1                                               03311000
PRLPAR1  EQU   PRELENTF                                                 03312000
SALAXWA  EQU   SALPARL+22                                               03313000
@NM00127 EQU   SALPARMS+7                                               03314000
SALBLKLN EQU   SALPARMS+2                                               03315000
@NM00126 EQU   SALPARL+1                                                03316000
CUMRC    EQU   CUMWA+148                                                03317000
@NM00125 EQU   CUMWA+146                                                03318000
CUMFMWA  EQU   CUMWA+58                                                 03319000
CUMWCI2  EQU   CUMWASS2+7                                               03320000
CUMWTYP2 EQU   CUMWASS2+6                                               03321000
CUMWCI   EQU   CUMWASS+1                                                03322000
CUMTYPE  EQU   CUMWTYP                                                  03323000
CUMWREL  EQU   CUMWASS2                                                 03324000
CUMFN2   EQU   CUMWA+40                                                 03325000
CUMFN1   EQU   CUMWA+32                                                 03326000
CUMDY    EQU   CUMWA+29                                                 03327000
@NM00124 EQU   CUMWA+28                                                 03328000
CUMSRID  EQU   CUMWA+25                                                 03329000
@NM00123 EQU   CUMWA+24                                                 03330000
CUMRABD  EQU   CUMWA+20                                                 03331000
CUMRAB2  EQU   CUMWA+16                                                 03332000
CUMRAB1  EQU   CUMWA+12                                                 03333000
CUMRABB  EQU   CUMWA+8                                                  03334000
CUMURAB  EQU   CUMWA+4                                                  03335000
CUMBCI   EQU   CUMWA+1                                                  03336000
@NM00122 EQU   CUMFLAG                                                  03337000
CUMEXIT  EQU   CUMFLAG                                                  03338000
CUMICI   EQU   CUMPL+5                                                  03339000
CUMDCI   EQU   CUMPL+2                                                  03340000
@NM00121 EQU   CUMOUT                                                   03341000
CUMNE    EQU   CUMOUT                                                   03342000
CUMDUP   EQU   CUMOUT                                                   03343000
@NM00120 EQU   CUMIN                                                    03344000
CUMFUNC  EQU   CUMIN                                                    03345000
CUMNRG   EQU   CUMIN                                                    03346000
CUMFDEL  EQU   CUMIN                                                    03347000
CMBYTAU  EQU   CMSWA+500                                                03348000
CMBYTTRK EQU   CMSWA+496                                                03349000
@NM00119 EQU   CMSWA+413                                                03350000
CMDEFACI EQU   CMUCATCI                                                 03351000
CMBLPTKS EQU   CMSWA+408                                                03352000
CMSDSPTB EQU   CMSWA+344                                                03353000
@NM00118 EQU   DCWPLCDS+27                                              03354000
DCWPLCDV EQU   DCWPLCDS+24                                              03355000
DCWPLCDA EQU   DCWPLCDL+16                                              03356000
DCWPLCDH EQU   DCWPLCDL                                                 03357000
DCWPLARV EQU   DCWPLARS+24                                              03358000
DCWPLARA EQU   DCWPLARL+16                                              03359000
DCWPLARH EQU   DCWPLARL                                                 03360000
@NM00117 EQU   DCWPLEDS+27                                              03361000
DCWPLEDV EQU   DCWPLEDS+24                                              03362000
DCWPLEDA EQU   DCWPLEDL+16                                              03363000
DCWPLEDH EQU   DCWPLEDL                                                 03364000
DCWPLBFV EQU   DCWPLBFS+24                                              03365000
DCWPLBFA EQU   DCWPLBFL+16                                              03366000
DCWPLBFH EQU   DCWPLBFL                                                 03367000
@NM00116 EQU   DCWPLSPS+31                                              03368000
DCWPLSPV EQU   DCWPLSPS+24                                              03369000
DCWPLSPA EQU   DCWPLSPL+16                                              03370000
DCWPLSPH EQU   DCWPLSPL                                                 03371000
@NM00115 EQU   CMSWA+190                                                03372000
DCWIX    EQU   CMSWA+188                                                03373000
CMWPAD   EQU   CMWGENAM+35                                              03374000
CMWTIME2 EQU   CMWTIME+11                                               03375000
CMWDELM2 EQU   CMWTIME+9                                                03376000
CMWTIME1 EQU   CMWTIME+2                                                03377000
CMWDELM1 EQU   CMWTIME                                                  03378000
CMWDAY   EQU   CMWDATE+2                                                03379000
CMWYEAR  EQU   CMWDATE                                                  03380000
CMWFIXID EQU   CMWGENAM                                                 03381000
CMNCILL  EQU   CMSPCQTY                                                 03382000
CMNCITL  EQU   CMIXFANS                                                 03383000
CMWT     EQU   CMIXFANO                                                 03384000
WORKPROC EQU   CMSWA+118                                                03385000
@NM00114 EQU   CMSWA+116                                                03386000
CMCNVNO  EQU   CMSWA+110                                                03387000
CMCNVLEN EQU   CMSWA+108                                                03388000
CMTOTVOL EQU   CMSWA+74                                                 03389000
CMVLRT2  EQU   CMVLRTCD+1                                               03390000
CMVLRT1  EQU   CMVLRTCD                                                 03391000
@NM00113 EQU   CMSWA+62                                                 03392000
CMSCRADT EQU   CMSWA+58                                                 03393000
CMSCRAVI EQU   CMSWA+52                                                 03394000
CMSDEFCI EQU   CMSDFSPC+1                                               03395000
CMSWAFLG EQU   CMSDFSPC                                                 03396000
CMSPCFVT EQU   CMSWA+44                                                 03397000
CMRMVVOL EQU   CMVOLCTR                                                 03398000
CMADDVOL EQU   CMRNGCTR                                                 03399000
CMDTAFPL EQU   CMHIXFPL                                                 03400000
CMTSTFPL EQU   CMHDTFPL                                                 03401000
CMRNMLST EQU   CMLDTFPL                                                 03402000
CMEXTFLS EQU   CMCPLFVT                                                 03403000
CMWACI   EQU   CMSWA+3                                                  03404000
CMAMDRNG EQU   CMWRKATR                                                 03405000
CMAMDORD EQU   CMWRKATR                                                 03406000
CMAMDRPL EQU   CMWRKATR                                                 03407000
CMAMDSDT EQU   CMWRKATR                                                 03408000
CMAMDWCK EQU   CMWRKATR                                                 03409000
CMAMDDST EQU   CMWRKATR                                                 03410000
CMCISREQ EQU   CMSWA+1                                                  03411000
CMPROC   EQU   CMWFLAGS                                                 03412000
CMPROCM  EQU   CMWFLAGS                                                 03413000
CMFGDLSC EQU   CMWFLAGS                                                 03414000
DSNPHYBS EQU   DSPTBL+30                                                03415000
DSPHYBPT EQU   DSPTBL+22                                                03416000
DSMPHYBS EQU   DSPTBL+20                                                03417000
DSDEVCHA EQU   DSPTBL                                                   03418000
AMDEXCP  EQU   AMDSTAT+44                                               03419000
AMDNCAS  EQU   AMDSTAT+40                                               03420000
AMDNCIS  EQU   AMDSTAT+36                                               03421000
AMDRETR  EQU   AMDSTAT+28                                               03422000
AMDUPR   EQU   AMDSTAT+24                                               03423000
AMDIREC  EQU   AMDSTAT+20                                               03424000
AMDDELR  EQU   AMDSTAT+16                                               03425000
AMDNLR   EQU   AMDSTAT+12                                               03426000
AMDNIL   EQU   AMDSTAT+8                                                03427000
AMDSTSP  EQU   AMDSTAT                                                  03428000
@NM00112 EQU   IDAAMDSB+41                                              03429000
@NM00111 EQU   AMDATTR3                                                 03430000
AMDLM    EQU   AMDATTR3                                                 03431000
AMDWAIT  EQU   AMDATTR3                                                 03432000
AMDBIND  EQU   AMDATTR3                                                 03433000
AMDFAULT EQU   AMDATTR3                                                 03434000
AMDUNQ   EQU   AMDATTR3                                                 03435000
AMDPARDB EQU   IDAAMDSB+36                                              03436000
AMDMAXRR EQU   AMDSSRBA                                                 03437000
AMDNSLOT EQU   AMDHLRBA                                                 03438000
AMDLRECL EQU   IDAAMDSB+24                                              03439000
AMDCINV  EQU   IDAAMDSB+20                                              03440000
AMDFSCI  EQU   IDAAMDSB+16                                              03441000
AMDFSCA  EQU   IDAAMDSB+14                                              03442000
AMDCIPCA EQU   IDAAMDSB+12                                              03443000
AMDPCTCI EQU   IDAAMDSB+11                                              03444000
AMDPCTCA EQU   IDAAMDSB+10                                              03445000
AMDKEYLN EQU   IDAAMDSB+8                                               03446000
AMDRKP   EQU   IDAAMDSB+6                                               03447000
AMDAXRKP EQU   AMDNEST                                                  03448000
AMDLEN   EQU   IDAAMDSB+2                                               03449000
AMDSPAN  EQU   AMDATTR                                                  03450000
AMDRRDS  EQU   AMDATTR                                                  03451000
AMDRANGE EQU   AMDATTR                                                  03452000
AMDORDER EQU   AMDATTR                                                  03453000
AMDREPL  EQU   AMDATTR                                                  03454000
AMDSDT   EQU   AMDATTR                                                  03455000
AMDWCK   EQU   AMDATTR                                                  03456000
AMDDST   EQU   AMDATTR                                                  03457000
AMDSBID  EQU   IDAAMDSB                                                 03458000
RTTOLFCT EQU   DEVCHARS+18                                              03459000
RTTOLFLG EQU   RTDVFLGS                                                 03460000
@NM00110 EQU   RTDVFLGS                                                 03461000
RTKABFLG EQU   RTDVFLGS                                                 03462000
@NM00109 EQU   RTDVFLGS                                                 03463000
RTBONK   EQU   DEVCHARS+16                                              03464000
RTBOKLB  EQU   RTBOKAB+1                                                03465000
RTBOKNLB EQU   RTBOKAB                                                  03466000
RTTRKSIZ EQU   DEVCHARS+12                                              03467000
RTNOTRKS EQU   DEVCHARS+10                                              03468000
RTNOCYLS EQU   DEVCHARS+8                                               03469000
RTMXDBLK EQU   DEVCHARS+4                                               03470000
RTCLSTYP EQU   RTDEVUCB+2                                               03471000
@NM00108 EQU   RTDEVUCB                                                 03472000
@NM00107 EQU   RGATTSG1                                                 03473000
RGATSUP1 EQU   RGATTSG1                                                 03474000
@NM00106 EQU   RGATTR1                                                  03475000
RGATTUPG EQU   RGATTR1                                                  03476000
CTGDSNUS EQU   CTGATR2                                                  03477000
@NM00105 EQU   CTGATR2                                                  03478000
CTGDSSSH EQU   CTGATR2                                                  03479000
CTGDSISH EQU   CTGATR2                                                  03480000
CTGTRKOV EQU   CTGATR1                                                  03481000
CTGDSTPX EQU   CTGATR1                                                  03482000
CTGDSINH EQU   CTGATR1                                                  03483000
CTGDSERA EQU   CTGATR1                                                  03484000
CTGDSREU EQU   CTGATR1                                                  03485000
CTGDSUNQ EQU   CTGATR1                                                  03486000
CTGDSSPD EQU   CTGATR1                                                  03487000
SPCROUND EQU   SPCOPTNS                                                 03488000
SPCALXRQ EQU   SPCOPTNS                                                 03489000
SPCMXIGR EQU   SPCOPTNS                                                 03490000
SPCCNTIG EQU   SPCOPTNS                                                 03491000
@NM00104 EQU   SPCOPTNS                                                 03492000
SPCRQTYP EQU   SPCOPTNS                                                 03493000
SPCSECDQ EQU   SPACEPRM+3                                               03494000
LTRETCD2 EQU   LTRETCOD+1                                               03495000
LTRETCD1 EQU   LTRETCOD                                                 03496000
LTLENGTH EQU   USERLIST                                                 03497000
USERAREV EQU   USERAREC+2                                               03498000
USERAREL EQU   USERAREC                                                 03499000
USVRMDUL EQU   PASSGO+42                                                03500000
PASSATMP EQU   PASSGO+40                                                03501000
PASSPRMT EQU   PASSGO+32                                                03502000
READPW   EQU   PASSWORD+24                                              03503000
UPDATEPW EQU   PASSWORD+16                                              03504000
CIPW     EQU   PASSWORD+8                                               03505000
MASTERPW EQU   PASSWORD                                                 03506000
ASCI     EQU   ASGO+1                                                   03507000
ASTYPE   EQU   ASGO                                                     03508000
CVLSER   EQU   MWA+259                                                  03509000
TTR2     EQU   MWA+256                                                  03510000
BIN0     EQU   CVOLIND+3                                                03511000
TTR1     EQU   CVOLIND                                                  03512000
@NM00096 EQU   MWA+242                                                  03513000
FSN      EQU   VLST+10                                                  03514000
VOLSER   EQU   VLST+4                                                   03515000
DEVTYP   EQU   VLST                                                     03516000
VOLENTCT EQU   MWA                                                      03517000
CTGCVCC  EQU   CTGCV+50                                                 03518000
CTGCVDEV EQU   CTGCVDSN                                                 03519000
CTGCVVOL EQU   CTGCV                                                    03520000
CTGVLTTR EQU   CTGVLX+12                                                03521000
@NM00095 EQU   CTGVLX                                                   03522000
CTGVLSEQ EQU   CTGVL+10                                                 03523000
CTGVLDEV EQU   CTGVL+6                                                  03524000
CTGVLVOL EQU   CTGVL                                                    03525000
CTGWAGB  EQU   CTGWA+12                                                 03526000
CTGWAGCT EQU   CTGWA+10                                                 03527000
CTGWAUCT EQU   CTGWA+8                                                  03528000
CTGWAVCT EQU   CTGWA+6                                                  03529000
CTGWALV  EQU   CTGWA+4                                                  03530000
CTGFVWKA EQU   CTGFV+88                                                 03531000
CTGFVPWD EQU   CTGFV+84                                                 03532000
CTGFVNAM EQU   CTGFV+80                                                 03533000
CTGFVUPG EQU   CTGFVGAT                                                 03534000
CTGFVBUF EQU   CTGFV+64                                                 03535000
CTGFVFSN EQU   CTGFVAMD                                                 03536000
CTGFVTTR EQU   CTGFVSPC                                                 03537000
CTGFVDVT EQU   CTGFV+48                                                 03538000
CTGFVRNG EQU   CTGFV+44                                                 03539000
CTGFVCRE EQU   CTGFV+36                                                 03540000
CTGFVEXP EQU   CTGFV+32                                                 03541000
CTGFVSTY EQU   CTGFV+24                                                 03542000
CTGFVENT EQU   CTGFV+20                                                 03543000
CTGFVIND EQU   CTGFV+16                                                 03544000
@NM00094 EQU   CTGFV+3                                                  03545000
CTGFVELM EQU   CTGFV+2                                                  03546000
@NM00093 EQU   CTGFVPRO                                                 03547000
CTGFVNDC EQU   CTGFVPRO                                                 03548000
CTGFVRVL EQU   CTGFVPRO                                                 03549000
CTGFVAVL EQU   CTGFVPRO                                                 03550000
CAXCRACB EQU   IGGCAXWA+112                                             03551000
CAXJDE   EQU   IGGCAXWA+108                                             03552000
CAXCCA   EQU   IGGCAXWA+104                                             03553000
CAXOPEWA EQU   IGGCAXWA+100                                             03554000
COPACB   EQU   CAXOPLST+1                                               03555000
@NM00092 EQU   COPTS                                                    03556000
CENLST   EQU   COPTS                                                    03557000
@NM00091 EQU   CAXCNAM+22                                               03558000
CAXRADDN EQU   CAXCNAM+14                                               03559000
CAXRATEP EQU   CAXCNAM+10                                               03560000
CAXRACTS EQU   CAXCNAM+6                                                03561000
CAXVOLID EQU   CAXCNAM                                                  03562000
CAXRPL   EQU   IGGCAXWA+48                                              03563000
CAXRPLCT EQU   IGGCAXWA+46                                              03564000
CAXASID  EQU   IGGCAXWA+44                                              03565000
CAXFDCI  EQU   CAXCCR+9                                                 03566000
CAXCDCI  EQU   CAXCCR+6                                                 03567000
CAXNFCI  EQU   CAXCCR+3                                                 03568000
CAXHACI  EQU   CAXCCR                                                   03569000
CAXUCB   EQU   IGGCAXWA+28                                              03570000
CAXACB   EQU   IGGCAXWA+24                                              03571000
CAXDRWP  EQU   IGGCAXWA+20                                              03572000
CAXSCHWA EQU   IGGCAXWA+16                                              03573000
CAXATIOT EQU   IGGCAXWA+12                                              03574000
CAXACT   EQU   IGGCAXWA+11                                              03575000
@NM00090 EQU   CAXFLG3                                                  03576000
CAXF3B6  EQU   CAXFLG3                                                  03577000
CAXF3B5  EQU   CAXFLG3                                                  03578000
@NM00089 EQU   CAXFLG3                                                  03579000
CAXF3ANE EQU   CAXFLG3                                                  03580000
CAXF3AT  EQU   CAXFLG3                                                  03581000
CAXF2VTU EQU   CAXFLG2                                                  03582000
CAXF2REC EQU   CAXFLG2                                                  03583000
CAXF2CA  EQU   CAXFLG2                                                  03584000
CAXF2CLR EQU   CAXFLG2                                                  03585000
CAXF2IOE EQU   CAXFLG2                                                  03586000
CAXF2NCR EQU   CAXFLG2                                                  03587000
CAXF2NDD EQU   CAXFLG2                                                  03588000
CAXF2DT  EQU   CAXFLG2                                                  03589000
CAXSCR   EQU   CAXFLGS                                                  03590000
CAXCMR   EQU   CAXFLGS                                                  03591000
CAXMCT   EQU   CAXFLGS                                                  03592000
CAXCMP   EQU   CAXFLGS                                                  03593000
CAXEOV   EQU   CAXFLGS                                                  03594000
CAXCLS   EQU   CAXFLGS                                                  03595000
CAXOPN   EQU   CAXFLGS                                                  03596000
CAXBLD   EQU   CAXFLGS                                                  03597000
CAXCHN   EQU   IGGCAXWA+4                                               03598000
@NM00088 EQU   IGGCAXWA+1                                               03599000
CAXID    EQU   IGGCAXWA                                                 03600000
CBSVPTR  EQU   CBSVSRT+4                                                03601000
CBSVUSE  EQU   CBSVSRT                                                  03602000
CBSCRTCB EQU   AMCBS+28                                                 03603000
CBSCRACA EQU   AMCBS+24                                                 03604000
CBSCAXCN EQU   AMCBS+20                                                 03605000
CBSMCUCB EQU   CBSCMP                                                   03606000
CBSCBP   EQU   AMCBS+12                                                 03607000
CBSACB   EQU   AMCBS+8                                                  03608000
CBSMCSTA EQU   AMCBS+4                                                  03609000
CBSSIZ   EQU   AMCBS+2                                                  03610000
CBSID    EQU   AMCBS                                                    03611000
ACBAPID  EQU   ACBCOMN+72                                               03612000
ACBCBMWA EQU   ACBCOMN+68                                               03613000
ACBLRECL EQU   ACBCOMN+62                                               03614000
ACBMSGLN EQU   ACBBLKSZ                                                 03615000
ACBBUFSP EQU   ACBCOMN+56                                               03616000
@NM00085 EQU   ACBUJFCB+1                                               03617000
ACBOPTN  EQU   ACBUJFCB                                                 03618000
ACBVVIC  EQU   ACBINFLG                                                 03619000
ACBUCRA  EQU   ACBINFLG                                                 03620000
ACBSCRA  EQU   ACBINFLG                                                 03621000
ACBCAT   EQU   ACBINFLG                                                 03622000
ACBIJRQE EQU   ACBINFLG                                                 03623000
ACBJEPS  EQU   ACBINFLG                                                 03624000
@NM00084 EQU   ACBINFLG                                                 03625000
ACBERFLG EQU   ACBCOMN+49                                               03626000
ACBBUSY  EQU   ACBIOSFG                                                 03627000
ACBLOCK  EQU   ACBEXFG                                                  03628000
@NM00083 EQU   ACBOFLGS                                                 03629000
ACBDSERR EQU   ACBOFLGS                                                 03630000
ACBOPEN  EQU   ACBOFLGS                                                 03631000
ACBEOV   EQU   ACBOFLGS                                                 03632000
@NM00082 EQU   ACBOFLGS                                                 03633000
ACBDEB   EQU   ACBDDNM+5                                                03634000
ACBERFL  EQU   ACBDDNM+4                                                03635000
ACBAM    EQU   ACBAMETH                                                 03636000
ACBINFL  EQU   ACBDDNM+2                                                03637000
ACBTIOT  EQU   ACBDDNM                                                  03638000
ACBUEL   EQU   ACBEXLST                                                 03639000
ACBPASSW EQU   ACBCOMN+32                                               03640000
ACBMSGAR EQU   ACBCOMN+28                                               03641000
@NM00081 EQU   ACBDSORG+1                                               03642000
ACBDORGA EQU   ACBDSORG+1                                               03643000
@NM00080 EQU   ACBDSORG                                                 03644000
ACBCRNRE EQU   ACBCROPS                                                 03645000
ACBCRNCK EQU   ACBCROPS                                                 03646000
ACBASA   EQU   ACBCCTYP                                                 03647000
@NM00079 EQU   ACBCCTYP                                                 03648000
ACBRECAF EQU   ACBRECFM                                                 03649000
ACBJBUF  EQU   ACBBUFPL+2                                               03650000
ACBMACR4 EQU   ACBBUFPL+1                                               03651000
@NM00078 EQU   ACBMACR3                                                 03652000
ACBNCFX  EQU   ACBMACR3                                                 03653000
ACBSIS   EQU   ACBMACR3                                                 03654000
ACBDFR   EQU   ACBMACR3                                                 03655000
ACBICI   EQU   ACBMACR3                                                 03656000
ACBGSR   EQU   ACBMACR3                                                 03657000
ACBLSR   EQU   ACBMACR3                                                 03658000
@NM00077 EQU   ACBMACR3                                                 03659000
ACBBUFNI EQU   ACBCOMN+18                                               03660000
ACBBUFND EQU   ACBCOMN+16                                               03661000
ACBSTRNO EQU   ACBCOMN+15                                               03662000
ACBBSTNO EQU   ACBCOMN+14                                               03663000
ACBAIX   EQU   ACBMACR2                                                 03664000
ACBDSN   EQU   ACBMACR2                                                 03665000
ACBRST   EQU   ACBMACR2                                                 03666000
ACBLOGON EQU   ACBMACR2                                                 03667000
ACBSKP   EQU   ACBMACR2                                                 03668000
@NM00076 EQU   ACBMACR2                                                 03669000
ACBUBF   EQU   ACBMACR1                                                 03670000
ACBOUT   EQU   ACBMACR1                                                 03671000
ACBIN    EQU   ACBMACR1                                                 03672000
ACBDIR   EQU   ACBMACR1                                                 03673000
ACBSEQ   EQU   ACBMACR1                                                 03674000
ACBBLK   EQU   ACBCNV                                                   03675000
ACBADD   EQU   ACBADR                                                   03676000
ACBKEY   EQU   ACBMACR1                                                 03677000
ACBINRTN EQU   ACBCOMN+8                                                03678000
ACBIBCT  EQU   ACBJWA                                                   03679000
ACBLEN2  EQU   ACBLENG2                                                 03680000
ACBSTYP  EQU   ACBCOMN+1                                                03681000
ACBID    EQU   ACBCOMN                                                  03682000
@NM00051 EQU   TCBXTNT2+32                                              03683000
TCBRV181 EQU   TCBRV173                                                 03684000
TCBRV180 EQU   TCBRV173                                                 03685000
TCBRV179 EQU   TCBRV173                                                 03686000
TCBRV178 EQU   TCBRV173                                                 03687000
TCBRV177 EQU   TCBRV173                                                 03688000
TCBRV176 EQU   TCBRV173                                                 03689000
TCBRV175 EQU   TCBRV173                                                 03690000
TCBRV174 EQU   TCBRV173                                                 03691000
TCBRV172 EQU   TCBRV164                                                 03692000
TCBRV171 EQU   TCBRV164                                                 03693000
TCBRV170 EQU   TCBRV164                                                 03694000
TCBRV169 EQU   TCBRV164                                                 03695000
TCBRV168 EQU   TCBRV164                                                 03696000
TCBRV167 EQU   TCBRV164                                                 03697000
TCBRV166 EQU   TCBRV164                                                 03698000
TCBRV165 EQU   TCBRV164                                                 03699000
TCBRV163 EQU   TCBRV155                                                 03700000
TCBRV162 EQU   TCBRV155                                                 03701000
TCBRV161 EQU   TCBRV155                                                 03702000
TCBRV160 EQU   TCBRV155                                                 03703000
TCBRV159 EQU   TCBRV155                                                 03704000
TCBRV158 EQU   TCBRV155                                                 03705000
TCBRV157 EQU   TCBRV155                                                 03706000
TCBRV156 EQU   TCBRV155                                                 03707000
TCBRV154 EQU   TCBRV146                                                 03708000
TCBRV153 EQU   TCBRV146                                                 03709000
TCBRV152 EQU   TCBRV146                                                 03710000
TCBRV151 EQU   TCBRV146                                                 03711000
TCBRV150 EQU   TCBRV146                                                 03712000
TCBRV149 EQU   TCBRV146                                                 03713000
TCBRV148 EQU   TCBRV146                                                 03714000
TCBRV147 EQU   TCBRV146                                                 03715000
TCBRV145 EQU   TCBXTNT2+26                                              03716000
TCBRV144 EQU   TCBXTNT2+24                                              03717000
TCBRV143 EQU   TCBXTNT2+20                                              03718000
TCBRV142 EQU   TCBXTNT2+16                                              03719000
TCBRSV49 EQU   TCBXTNT2+12                                              03720000
TCBRSV48 EQU   TCBXTNT2+8                                               03721000
TCBRCMP  EQU   TCBXTNT2+5                                               03722000
TCBRSVAB EQU   TCBXTNT2+4                                               03723000
TCBGTFA  EQU   TCBGTF+1                                                 03724000
TCBRSV47 EQU   TCBTFLG                                                  03725000
TCBRSV46 EQU   TCBTFLG                                                  03726000
TCBRSV45 EQU   TCBTFLG                                                  03727000
TCBRSV44 EQU   TCBTFLG                                                  03728000
TCBRSV43 EQU   TCBTFLG                                                  03729000
TCBDSPIT EQU   TCBTFLG                                                  03730000
TCBERRTN EQU   TCBTFLG                                                  03731000
TCBASYNC EQU   TCBTFLG                                                  03732000
@NM00050 EQU   TCB+296                                                  03733000
TCBSCBQ  EQU   TCB+292                                                  03734000
TCBSWASA EQU   TCB+288                                                  03735000
TCBDBTB  EQU   TCB+284                                                  03736000
TCBRPT   EQU   TCB+280                                                  03737000
TCBRV141 EQU   TCBRV133                                                 03738000
TCBRV140 EQU   TCBRV133                                                 03739000
TCBRV139 EQU   TCBRV133                                                 03740000
TCBRV138 EQU   TCBRV133                                                 03741000
TCBRV137 EQU   TCBRV133                                                 03742000
TCBRV136 EQU   TCBRV133                                                 03743000
TCBRV135 EQU   TCBRV133                                                 03744000
TCBRV134 EQU   TCBRV133                                                 03745000
TCBRV132 EQU   TCBRV124                                                 03746000
TCBRV131 EQU   TCBRV124                                                 03747000
TCBRV130 EQU   TCBRV124                                                 03748000
TCBRV129 EQU   TCBRV124                                                 03749000
TCBRV128 EQU   TCBRV124                                                 03750000
TCBRV127 EQU   TCBRV124                                                 03751000
TCBRV126 EQU   TCBRV124                                                 03752000
TCBRV125 EQU   TCBRV124                                                 03753000
TCBRV123 EQU   TCBFBYT2                                                 03754000
TCBRV122 EQU   TCBFBYT2                                                 03755000
TCBECBNV EQU   TCBFBYT2                                                 03756000
TCBSSSYN EQU   TCBFBYT2                                                 03757000
TCBFPRAP EQU   TCBFBYT2                                                 03758000
TCBFDW   EQU   TCBFBYT2                                                 03759000
TCBFMW   EQU   TCBFBYT2                                                 03760000
TCBCNCB  EQU   TCBFBYT2                                                 03761000
TCBLLH   EQU   TCBFBYT1                                                 03762000
TCBRV113 EQU   TCBFBYT1                                                 03763000
TCBEOT   EQU   TCBFBYT1                                                 03764000
TCBRTM2  EQU   TCBFBYT1                                                 03765000
TCBPGNLY EQU   TCBFBYT1                                                 03766000
TCBNDIOS EQU   TCBFBYT1                                                 03767000
TCBACTIV EQU   TCBFBYT1                                                 03768000
TCBEOTFM EQU   TCBFBYT1                                                 03769000
TCBAFFN  EQU   TCB+274                                                  03770000
TCBCCPVI EQU   TCB+272                                                  03771000
TCBUKYSP EQU   TCB+268                                                  03772000
TCBMODE  EQU   TCBESTAE+3                                               03773000
TCBERTYP EQU   TCBESTAE+2                                               03774000
TCBRV314 EQU   TCBESTRM                                                 03775000
TCBRV313 EQU   TCBESTRM                                                 03776000
TCBRV312 EQU   TCBESTRM                                                 03777000
TCBRV311 EQU   TCBESTRM                                                 03778000
TCBRV310 EQU   TCBESTRM                                                 03779000
TCBRV309 EQU   TCBESTRM                                                 03780000
TCBRV308 EQU   TCBESTRM                                                 03781000
TCBETERM EQU   TCBESTRM                                                 03782000
TCBSCBKY EQU   TCBESTAE                                                 03783000
TCBRTM12 EQU   TCB+260                                                  03784000
TCBTCBID EQU   TCB+256                                                  03785000
TCBRSV96 EQU   TCB+252                                                  03786000
TCBSWA   EQU   TCB+248                                                  03787000
TCBFOEA  EQU   TCBFOE+1                                                 03788000
TCBRSV42 EQU   TCBFOE                                                   03789000
TCBRV306 EQU   TCB+240                                                  03790000
TCBRSV41 EQU   TCB+239                                                  03791000
TCBTID   EQU   TCB+238                                                  03792000
TCBRSVAA EQU   TCB+237                                                  03793000
TCBABCUR EQU   TCB+236                                                  03794000
TCBTMSAV EQU   TCB+232                                                  03795000
TCBIOTIM EQU   TCB+228                                                  03796000
TCBRTWA  EQU   TCB+224                                                  03797000
TCBBACK  EQU   TCB+220                                                  03798000
TCBTIRB  EQU   TCB+216                                                  03799000
TCBAECB  EQU   TCB+212                                                  03800000
TCBEXT2A EQU   TCBEXT2+1                                                03801000
TCBRSV39 EQU   TCBEXT2                                                  03802000
TCBSTMCT EQU   TCB+207                                                  03803000
TCBSYSCT EQU   TCB+206                                                  03804000
TCBRSV37 EQU   TCB+205                                                  03805000
TCBEXSVC EQU   TCBDAR                                                   03806000
TCBRSV36 EQU   TCBDAR                                                   03807000
TCBDARWT EQU   TCBDAR                                                   03808000
TCBDARO  EQU   TCBDAR                                                   03809000
TCBDARMC EQU   TCBDARC                                                  03810000
TCBDARD  EQU   TCBDAR                                                   03811000
TCBDARS  EQU   TCBDAR                                                   03812000
TCBDARP  EQU   TCBDAR                                                   03813000
TCBGTOFM EQU   TCBFLGS7                                                 03814000
TCBADMP  EQU   TCBFLGS7                                                 03815000
TCBRSTSK EQU   TCBFLGS7                                                 03816000
TCBRSV35 EQU   TCBFLGS7                                                 03817000
TCBSTACK EQU   TCBFLGS7                                                 03818000
TCBRSV34 EQU   TCBFLGS7                                                 03819000
TCBRSV33 EQU   TCBFLGS7                                                 03820000
TCBGPECB EQU   TCBFLGS7                                                 03821000
TCBNTJS  EQU   TCBFLGS6                                                 03822000
TCBAPG   EQU   TCBFLGS6                                                 03823000
TCBMIGR  EQU   TCBFLGS6                                                 03824000
TCBRV303 EQU   TCBFLGS6                                                 03825000
TCBSPVLK EQU   TCBFLGS6                                                 03826000
TCBCPU   EQU   TCBFLGS6                                                 03827000
TCBPIE17 EQU   TCBFLGS6                                                 03828000
TCBRV    EQU   TCBFLGS6                                                 03829000
TCBRSV79 EQU   TCBNDSP5                                                 03830000
TCBRSV78 EQU   TCBNDSP5                                                 03831000
TCBRSV77 EQU   TCBNDSP5                                                 03832000
TCBRSV76 EQU   TCBNDSP5                                                 03833000
TCBRSV75 EQU   TCBNDSP5                                                 03834000
TCBRSV74 EQU   TCBNDSP5                                                 03835000
TCBRSV95 EQU   TCBNDSP5                                                 03836000
TCBRSV94 EQU   TCBNDSP5                                                 03837000
TCBRSV93 EQU   TCBNDSP4                                                 03838000
TCBRSV92 EQU   TCBNDSP4                                                 03839000
TCBRSV91 EQU   TCBNDSP4                                                 03840000
TCBRSV90 EQU   TCBNDSP4                                                 03841000
TCBRSV89 EQU   TCBNDSP4                                                 03842000
TCBRSV88 EQU   TCBNDSP4                                                 03843000
TCBRSV87 EQU   TCBNDSP4                                                 03844000
TCBRSV86 EQU   TCBNDSP4                                                 03845000
TCBEXT1A EQU   TCBEXT1+1                                                03846000
TCBRSV32 EQU   TCBEXT1                                                  03847000
TCBEXCPD EQU   TCB+192                                                  03848000
TCBIOBRC EQU   TCB+188                                                  03849000
TCBDDWTC EQU   TCB+186                                                  03850000
TCBDDEXC EQU   TCB+184                                                  03851000
TCBJSCBB EQU   TCBJSCB+1                                                03852000
@NM00049 EQU   TCBRECDE                                                 03853000
TCBREC   EQU   TCBRECDE                                                 03854000
TCBMDIDS EQU   TCB+176                                                  03855000
TCBNDINT EQU   TCBNDSP3                                                 03856000
TCBRSV27 EQU   TCBNDSP3                                                 03857000
TCBRSV26 EQU   TCBNDSP3                                                 03858000
TCBRSV25 EQU   TCBNDSP3                                                 03859000
TCBRSV24 EQU   TCBNDSP3                                                 03860000
TCBSRBND EQU   TCBNDSP3                                                 03861000
TCBRV302 EQU   TCBNDSP3                                                 03862000
TCBLJSND EQU   TCBNDSP3                                                 03863000
TCBABE   EQU   TCBNDSP2                                                 03864000
TCBDSS   EQU   TCBNDSP2                                                 03865000
TCBOWAIT EQU   TCBNDSP2                                                 03866000
TCBIWAIT EQU   TCBNDSP2                                                 03867000
TCBNDTS  EQU   TCBNDSP2                                                 03868000
TCBNDSVC EQU   TCBNDSP2                                                 03869000
TCBSTPP  EQU   TCBNDSP2                                                 03870000
TCBABD   EQU   TCBNDSP2                                                 03871000
TCBRSV22 EQU   TCBNDSP1                                                 03872000
TCBPIEND EQU   TCBNDSP1                                                 03873000
TCBTPSP  EQU   TCBNDSP1                                                 03874000
TCBDDRND EQU   TCBNDSP1                                                 03875000
TCBRSPND EQU   TCBNDSP1                                                 03876000
TCBRSTND EQU   TCBNDSP1                                                 03877000
TCBDARPN EQU   TCBNDSP1                                                 03878000
TCBDARTN EQU   TCBNDSP1                                                 03879000
TCBNDSP0 EQU   TCBNDSP                                                  03880000
TCBUSER  EQU   TCB+168                                                  03881000
TCBTCTB  EQU   TCBTCT+1                                                 03882000
TCBRSV9C EQU   TCBTCTGF                                                 03883000
TCBRSV9B EQU   TCBTCTGF                                                 03884000
TCBRSV9A EQU   TCBTCTGF                                                 03885000
TCBRSV99 EQU   TCBTCTGF                                                 03886000
TCBRSV98 EQU   TCBTCTGF                                                 03887000
TCBRSV97 EQU   TCBTCTGF                                                 03888000
TCBRSV20 EQU   TCBTCTGF                                                 03889000
TCBSMFGF EQU   TCBTCTGF                                                 03890000
TCBSTABB EQU   TCBSTAB+1                                                03891000
TCBSTCUR EQU   TCBNSTAE                                                 03892000
TCBRV301 EQU   TCBNSTAE                                                 03893000
TCBSYNCH EQU   TCBNSTAE                                                 03894000
TCBHALT  EQU   TCBNSTAE                                                 03895000
TCBPPSUP EQU   TCBNSTAE                                                 03896000
TCB33E   EQU   TCBNSTAE                                                 03897000
TCBQUIES EQU   TCBNSTAE                                                 03898000
TCBSTABE EQU   TCBNSTAE                                                 03899000
TCBAQE   EQU   TCB+156                                                  03900000
TCBPQE   EQU   TCB+152                                                  03901000
TCBTSDP  EQU   TCB+151                                                  03902000
TCBTSLP  EQU   TCB+150                                                  03903000
TCBSTPCT EQU   TCB+149                                                  03904000
TCBCPUBN EQU   TCBTSFLG                                                 03905000
TCBDYDSP EQU   TCBTSFLG                                                 03906000
TCBRSV18 EQU   TCBTSFLG                                                 03907000
TCBRSV17 EQU   TCBTSFLG                                                 03908000
TCBTIOTG EQU   TCBTSFLG                                                 03909000
TCBATT   EQU   TCBTSFLG                                                 03910000
TCBSTPPR EQU   TCBTSFLG                                                 03911000
TCBRV300 EQU   TCBTSTSK                                                 03912000
TCBECB   EQU   TCB+144                                                  03913000
TCBIQE   EQU   TCB+140                                                  03914000
TCBLTC   EQU   TCB+136                                                  03915000
TCBOTC   EQU   TCB+132                                                  03916000
TCBNTC   EQU   TCB+128                                                  03917000
TCBJSTCA EQU   TCBJSTCB+1                                               03918000
TCBRSV16 EQU   TCBJSTCB                                                 03919000
TCBTQET  EQU   TCBTME                                                   03920000
TCBTCB   EQU   TCB+116                                                  03921000
TCBFSAB  EQU   TCBFSA+1                                                 03922000
TCBQEL   EQU   TCBFSA                                                   03923000
TCBGRS15 EQU   TCBGRS+60                                                03924000
TCBGRS14 EQU   TCBGRS+56                                                03925000
TCBGRS13 EQU   TCBGRS+52                                                03926000
TCBGRS12 EQU   TCBGRS+48                                                03927000
TCBGRS11 EQU   TCBGRS+44                                                03928000
TCBGRS10 EQU   TCBGRS+40                                                03929000
TCBGRS9  EQU   TCBGRS+36                                                03930000
TCBGRS8  EQU   TCBGRS+32                                                03931000
TCBGRS7  EQU   TCBGRS+28                                                03932000
TCBGRS6  EQU   TCBGRS+24                                                03933000
TCBGRS5  EQU   TCBGRS+20                                                03934000
TCBGRS4  EQU   TCBGRS+16                                                03935000
TCBGRS3  EQU   TCBGRS+12                                                03936000
TCBGRS2  EQU   TCBGRS+8                                                 03937000
TCBGRS1  EQU   TCBGRS+4                                                 03938000
TCBGRS0  EQU   TCBGRS                                                   03939000
TCBJPQB  EQU   TCBJPQ+1                                                 03940000
TCBRSV15 EQU   TCBPURGE                                                 03941000
TCBRSV14 EQU   TCBPURGE                                                 03942000
TCBRSV13 EQU   TCBPURGE                                                 03943000
TCBRSV12 EQU   TCBPURGE                                                 03944000
TCBRSV11 EQU   TCBPURGE                                                 03945000
TCBRSV10 EQU   TCBPURGE                                                 03946000
TCBRSV09 EQU   TCBPURGE                                                 03947000
TCBJPQF  EQU   TCBPURGE                                                 03948000
TCBJLB   EQU   TCB+40                                                   03949000
TCBLLS   EQU   TCB+36                                                   03950000
TCBDSP   EQU   TCB+35                                                   03951000
TCBLMP   EQU   TCB+34                                                   03952000
TCBPNDSP EQU   TCBFLGS5                                                 03953000
TCBFCD1  EQU   TCBFLGS5                                                 03954000
TCBSTP   EQU   TCBFLGS5                                                 03955000
TCBSYS   EQU   TCBFLGS5                                                 03956000
TCBANDSP EQU   TCBFLGS5                                                 03957000
TCBPAGE  EQU   TCBFLGS5                                                 03958000
TCBUXNDF EQU   TCBABWF                                                  03959000
TCBFC    EQU   TCBFLGS5                                                 03960000
TCBONDSP EQU   TCBFLGS4                                                 03961000
TCBMPCND EQU   TCBFLGS4                                                 03962000
TCBMPCVQ EQU   TCBFLGS4                                                 03963000
TCBUXNDV EQU   TCBFLGS4                                                 03964000
TCBHNDSP EQU   TCBFLGS4                                                 03965000
TCBRQENA EQU   TCBFLGS4                                                 03966000
TCBSER   EQU   TCBFLGS4                                                 03967000
TCBNDUMP EQU   TCBFLGS4                                                 03968000
TCBDWSTA EQU   TCBFLGS3                                                 03969000
TCBRSV08 EQU   TCBFLGS3                                                 03970000
TCBRSV07 EQU   TCBFLGS3                                                 03971000
TCBRSV06 EQU   TCBFLGS3                                                 03972000
TCBABGM  EQU   TCBFLGS3                                                 03973000
TCBABTRM EQU   TCBFLGS3                                                 03974000
TCBADINP EQU   TCBFLGS3                                                 03975000
TCBFSM   EQU   TCBFLGS3                                                 03976000
TCBFTS   EQU   TCBFLGS2                                                 03977000
TCBFETXR EQU   TCBFLGS2                                                 03978000
TCBFDSOP EQU   TCBFLGS2                                                 03979000
TCBFJMC  EQU   TCBFLGS2                                                 03980000
TCBFSMC  EQU   TCBFLGS2                                                 03981000
TCBFABOP EQU   TCBFLGS2                                                 03982000
TCBFSTI  EQU   TCBFLGS2                                                 03983000
TCBFOINP EQU   TCBFLGS2                                                 03984000
TCBFX    EQU   TCBFLGS1                                                 03985000
TCBFS    EQU   TCBFLGS1                                                 03986000
TCBFT    EQU   TCBFLGS1                                                 03987000
TCBPDUMP EQU   TCBFLGS1                                                 03988000
TCBRSV04 EQU   TCBFLGS1                                                 03989000
TCBFERA  EQU   TCBFLGS1                                                 03990000
TCBFE    EQU   TCBFLGS1                                                 03991000
TCBFA    EQU   TCBFLGS1                                                 03992000
TCBZERO  EQU   TCBPKF                                                   03993000
TCBFLAG  EQU   TCBPKF                                                   03994000
TCBMSSB  EQU   TCBMSS+1                                                 03995000
TCBRSV03 EQU   TCBMSS                                                   03996000
TCBTRNB  EQU   TCBTRN+1                                                 03997000
TCBRSV02 EQU   TCBABF                                                   03998000
TCBOLTEP EQU   TCBABF                                                   03999000
TCBTCP   EQU   TCBABF                                                   04000000
TCBTCPP  EQU   TCBABF                                                   04001000
TCBRSV01 EQU   TCBABF                                                   04002000
TCBGRPH  EQU   TCBABF                                                   04003000
TCBNOCHK EQU   TCBABF                                                   04004000
TCBMOD91 EQU   TCBABF                                                   04005000
TCBCMPC  EQU   TCBCMP+1                                                 04006000
TCBRV318 EQU   TCBCMSG                                                  04007000
TCBRV317 EQU   TCBCIND                                                  04008000
TCBRV316 EQU   TCBCWTO                                                  04009000
TCBCASID EQU   TCBCDBL                                                  04010000
TCBNOCC  EQU   TCBSTCC                                                  04011000
TCBDMPO  EQU   TCBCPP                                                   04012000
TCBCSTEP EQU   TCBCMPF                                                  04013000
TCBCREQ  EQU   TCBCMPF                                                  04014000
TCBTIO   EQU   TCB+12                                                   04015000
TCBDEB   EQU   TCB+8                                                    04016000
TCBPIEA  EQU   TCBPIE+1                                                 04017000
TCBPM    EQU   TCBPMASK                                                 04018000
@NM00048 EQU   TCBPMASK                                                 04019000
TCBRBP   EQU   TCB                                                      04020000
TCBFRS6  EQU   TCBFRS+24                                                04021000
TCBFRS4  EQU   TCBFRS+16                                                04022000
TCBFRS2  EQU   TCBFRS+8                                                 04023000
TCBFRS0  EQU   TCBFRS                                                   04024000
NEXTTCB  EQU   TCBWORDS                                                 04025000
CVTLEVL  EQU   CVTRELNO+2                                               04026000
CVTNUMB  EQU   CVTRELNO                                                 04027000
CVTMDL   EQU   CVTFIX+250                                               04028000
@NM00047 EQU   CVTFIX+248                                               04029000
@NM00046 EQU   CVTFIX                                                   04030000
CVTRV482 EQU   CVTXTNT2+128                                             04031000
CVTRV481 EQU   CVTXTNT2+124                                             04032000
CVTRV480 EQU   CVTXTNT2+120                                             04033000
CVTRV479 EQU   CVTXTNT2+118                                             04034000
CVTRV478 EQU   CVTXTNT2+117                                             04035000
CVTRV477 EQU   CVTXTNT2+116                                             04036000
CVTRV476 EQU   CVTXTNT2+115                                             04037000
CVTRV475 EQU   CVTXTNT2+114                                             04038000
CVTRV474 EQU   CVTRV466                                                 04039000
CVTRV473 EQU   CVTRV466                                                 04040000
CVTRV472 EQU   CVTRV466                                                 04041000
CVTRV471 EQU   CVTRV466                                                 04042000
CVTRV470 EQU   CVTRV466                                                 04043000
CVTRV469 EQU   CVTRV466                                                 04044000
CVTRV468 EQU   CVTRV466                                                 04045000
CVTRV467 EQU   CVTRV466                                                 04046000
CVTRV465 EQU   CVTRV457                                                 04047000
CVTRV464 EQU   CVTRV457                                                 04048000
CVTRV463 EQU   CVTRV457                                                 04049000
CVTRV462 EQU   CVTRV457                                                 04050000
CVTRV461 EQU   CVTRV457                                                 04051000
CVTRV460 EQU   CVTRV457                                                 04052000
CVTRV459 EQU   CVTRV457                                                 04053000
CVTRV458 EQU   CVTRV457                                                 04054000
CVTRV456 EQU   CVTXTNT2+108                                             04055000
CVTRV455 EQU   CVTXTNT2+104                                             04056000
CVTRV454 EQU   CVTXTNT2+100                                             04057000
CVTRV453 EQU   CVTXTNT2+96                                              04058000
CVTRV452 EQU   CVTXTNT2+94                                              04059000
CVTRV451 EQU   CVTXTNT2+92                                              04060000
CVTRV450 EQU   CVTXTNT2+90                                              04061000
CVTRV449 EQU   CVTXTNT2+88                                              04062000
CVTRV448 EQU   CVTXTNT2+87                                              04063000
CVTRV447 EQU   CVTXTNT2+86                                              04064000
CVTRV446 EQU   CVTRV438                                                 04065000
CVTRV445 EQU   CVTRV438                                                 04066000
CVTRV444 EQU   CVTRV438                                                 04067000
CVTRV443 EQU   CVTRV438                                                 04068000
CVTRV442 EQU   CVTRV438                                                 04069000
CVTRV441 EQU   CVTRV438                                                 04070000
CVTRV440 EQU   CVTRV438                                                 04071000
CVTRV439 EQU   CVTRV438                                                 04072000
CVTRV437 EQU   CVTRV429                                                 04073000
CVTRV436 EQU   CVTRV429                                                 04074000
CVTRV435 EQU   CVTRV429                                                 04075000
CVTRV434 EQU   CVTRV429                                                 04076000
CVTRV433 EQU   CVTRV429                                                 04077000
CVTRV432 EQU   CVTRV429                                                 04078000
CVTRV431 EQU   CVTRV429                                                 04079000
CVTRV430 EQU   CVTRV429                                                 04080000
CVTRV428 EQU   CVTXTNT2+80                                              04081000
CVTRV427 EQU   CVTXTNT2+76                                              04082000
CVTRV426 EQU   CVTXTNT2+72                                              04083000
CVTRV425 EQU   CVTXTNT2+68                                              04084000
CVTATACT EQU   CVTATCVT                                                 04085000
CVTRV423 EQU   CVTXTNT2+62                                              04086000
CVTRV422 EQU   CVTXTNT2+60                                              04087000
CVTRV421 EQU   CVTXTNT2+58                                              04088000
CVTRV420 EQU   CVTXTNT2+56                                              04089000
CVTRV419 EQU   CVTXTNT2+55                                              04090000
CVTRV418 EQU   CVTXTNT2+54                                              04091000
CVTRV417 EQU   CVTRV409                                                 04092000
CVTRV416 EQU   CVTRV409                                                 04093000
CVTRV415 EQU   CVTRV409                                                 04094000
CVTRV414 EQU   CVTRV409                                                 04095000
CVTRV413 EQU   CVTRV409                                                 04096000
CVTRV412 EQU   CVTRV409                                                 04097000
CVTRV411 EQU   CVTRV409                                                 04098000
CVTRV410 EQU   CVTRV409                                                 04099000
CVTRV408 EQU   CVTRV400                                                 04100000
CVTRV407 EQU   CVTRV400                                                 04101000
CVTRV406 EQU   CVTRV400                                                 04102000
CVTRV405 EQU   CVTRV400                                                 04103000
CVTRV404 EQU   CVTRV400                                                 04104000
CVTRV403 EQU   CVTRV400                                                 04105000
CVTRV402 EQU   CVTRV400                                                 04106000
CVTRV401 EQU   CVTRV400                                                 04107000
CVTICB   EQU   CVTXTNT2+48                                              04108000
CVTSKTA  EQU   CVTXTNT2+44                                              04109000
CVTRSV99 EQU   CVTXTNT2+40                                              04110000
CVTRSV98 EQU   CVTXTNT2+36                                              04111000
CVTRSV97 EQU   CVTXTNT2+34                                              04112000
CVTRSV96 EQU   CVTXTNT2+32                                              04113000
CVTOLTEP EQU   CVTXTNT2+28                                              04114000
CVTQIDA  EQU   CVTQID+1                                                 04115000
CVTRSV95 EQU   CVTQID                                                   04116000
CVTRSV94 EQU   CVTXTNT2+20                                              04117000
CVTRSV93 EQU   CVTXTNT2+16                                              04118000
CVTRSV92 EQU   CVTXTNT2+12                                              04119000
CVTDEBVR EQU   CVTXTNT2+8                                               04120000
CVTRSV91 EQU   CVTXTNT2+6                                               04121000
CVTRSV9H EQU   CVTFLGBT                                                 04122000
CVTRSV9G EQU   CVTFLGBT                                                 04123000
CVTRSV9F EQU   CVTFLGBT                                                 04124000
CVTRSV9E EQU   CVTFLGBT                                                 04125000
CVTRSV9D EQU   CVTFLGBT                                                 04126000
CVTRSV9C EQU   CVTFLGBT                                                 04127000
CVTVME   EQU   CVTFLGBT                                                 04128000
CVTNPE   EQU   CVTFLGBT                                                 04129000
CVTNUCLS EQU   CVTXTNT2+4                                               04130000
CVTDSSVA EQU   CVTDSSV+1                                                04131000
CVTRSV89 EQU   CVTDSSV                                                  04132000
CVTRSV88 EQU   CVTXTNT1+8                                               04133000
CVTRSV87 EQU   CVTXTNT1+4                                               04134000
CVTFACHN EQU   CVTXTNT1                                                 04135000
CVTRV488 EQU   CVTMAP+412                                               04136000
CVTRV487 EQU   CVTMAP+408                                               04137000
CVTRV486 EQU   CVTMAP+404                                               04138000
CVTRV485 EQU   CVTMAP+400                                               04139000
CVTACTAP EQU   CVTMAP+396                                               04140000
CVTAUTH  EQU   CVTMAP+392                                               04141000
CVTATMCA EQU   CVTATMCT+1                                               04142000
CVTATMST EQU   CVTATMCT                                                 04143000
CVTRSV61 EQU   CVTMAP+384                                               04144000
CVTVOLT1 EQU   CVTVOLM1+1                                               04145000
CVTVOLI1 EQU   CVTVOLF1                                                 04146000
CVTSTOA  EQU   CVTMAP+376                                               04147000
CVTRSV58 EQU   CVTMAP+374                                               04148000
CVTRSV57 EQU   CVTMAP+372                                               04149000
CVTDDCE  EQU   CVTMAP+368                                               04150000
CVTPNWFR EQU   CVTMAP+364                                               04151000
CVTSMF   EQU   CVTMAP+360                                               04152000
CVTSULK  EQU   CVTMAP+358                                               04153000
CVTSLKO  EQU   CVTSYSK                                                  04154000
CVTSLKP  EQU   CVTSYSK                                                  04155000
CVTSLKQ  EQU   CVTSYSK                                                  04156000
CVTSLKR  EQU   CVTSYSK                                                  04157000
CVTRSV56 EQU   CVTSYSK                                                  04158000
CVTRSV55 EQU   CVTSYSK                                                  04159000
CVTRSV54 EQU   CVTSYSK                                                  04160000
CVTRSV53 EQU   CVTSYSK                                                  04161000
CVTRSV52 EQU   CVTA1F1                                                  04162000
CVTRSV51 EQU   CVTA1F1                                                  04163000
CVTRSV50 EQU   CVTA1F1                                                  04164000
CVTRSV49 EQU   CVTA1F1                                                  04165000
CVTRSV48 EQU   CVTA1F1                                                  04166000
CVTRSV47 EQU   CVTA1F1                                                  04167000
CVTSRSW  EQU   CVTA1F1                                                  04168000
CVTPFSW  EQU   CVTA1F1                                                  04169000
CVTPCVT  EQU   CVTMAP+352                                               04170000
CVTRSV46 EQU   CVTMAP+344                                               04171000
CVTRSV45 EQU   CVTMAP+340                                               04172000
CVTRSV44 EQU   CVTMAP+338                                               04173000
CVTRSV43 EQU   CVTMAP+336                                               04174000
CVTHJESA EQU   CVTHJES+1                                                04175000
CVTRSV42 EQU   CVTHJES                                                  04176000
CVTEXT2A EQU   CVTEXT2+1                                                04177000
CVTRSV41 EQU   CVTEXT2                                                  04178000
CVTAPFA  EQU   CVTAPF+1                                                 04179000
CVTRSV40 EQU   CVTAPF                                                   04180000
CVTRV518 EQU   CVTINTLA                                                 04181000
CVTRV517 EQU   CVTERPV                                                  04182000
CVTEORM  EQU   CVTMAP+312                                               04183000
CVTMCHPR EQU   CVTMAP+308                                               04184000
CVTTZ    EQU   CVTMAP+304                                               04185000
CVTJEPS  EQU   CVTMAP+300                                               04186000
CVTJESCT EQU   CVTMAP+296                                               04187000
CVTMODE  EQU   CVTMAP+292                                               04188000
CVTPTRV  EQU   CVTMAP+288                                               04189000
CVTREAL  EQU   CVTMAP+284                                               04190000
CVTRSV39 EQU   CVTMAP+280                                               04191000
CVTRSV38 EQU   CVTMAP+276                                               04192000
CVTDMSRA EQU   CVTDMSR+1                                                04193000
CVTRSV37 EQU   CVTDMSR                                                  04194000
CVTQMSGA EQU   CVTQMSG+1                                                04195000
CVTRSV36 EQU   CVTQMSG                                                  04196000
CVTPURGA EQU   CVTPURG+1                                                04197000
CVTRSV35 EQU   CVTPURG                                                  04198000
CVTATERA EQU   CVTATER+1                                                04199000
CVTSYST  EQU   CVTATER                                                  04200000
CVTVOLT2 EQU   CVTTAT                                                   04201000
CVTVOLI2 EQU   CVTVOLF2                                                 04202000
CVTAQAVB EQU   CVTAQAVT+1                                               04203000
CVTRSV34 EQU   CVTTCMFG                                                 04204000
CVTRSV33 EQU   CVTTCMFG                                                 04205000
CVTRSV32 EQU   CVTTCMFG                                                 04206000
CVTRSV31 EQU   CVTTCMFG                                                 04207000
CVTRSV30 EQU   CVTTCMFG                                                 04208000
CVTRSV29 EQU   CVTTCMFG                                                 04209000
CVTRSV28 EQU   CVTTCMFG                                                 04210000
CVTTCRDY EQU   CVTTCMFG                                                 04211000
CVTGTFA  EQU   CVTGTF+1                                                 04212000
CVTRSV27 EQU   CVTGTFST                                                 04213000
CVTRNIO  EQU   CVTGTFST                                                 04214000
CVTUSR   EQU   CVTGTFST                                                 04215000
CVTRV318 EQU   CVTFORM                                                  04216000
CVTRV317 EQU   CVTTMODE                                                 04217000
CVTRV316 EQU   CVTSTATE                                                 04218000
CVTRV315 EQU   CVTGTFS                                                  04219000
CVTGTFAV EQU   CVTGTFS                                                  04220000
CVT0SCR1 EQU   CVTMAP+232                                               04221000
CVTRV515 EQU   CVTMAP+228                                               04222000
CVTRMS   EQU   CVTMAP+224                                               04223000
CVTPATCH EQU   CVTMAP+220                                               04224000
CVTTSCE  EQU   CVTMAP+216                                               04225000
CVTLNKSC EQU   CVTMAP+214                                               04226000
CVTQABST EQU   CVTMAP+212                                               04227000
CVTMDLDS EQU   CVTMAP+208                                               04228000
CVTUSER  EQU   CVTMAP+204                                               04229000
CVTABEND EQU   CVTMAP+200                                               04230000
CVTSMCA  EQU   CVTMAP+196                                               04231000
CVTRSV18 EQU   CVTMAP+192                                               04232000
CVTQLPAQ EQU   CVTMAP+188                                               04233000
CVTQCDSR EQU   CVTMAP+184                                               04234000
CVTRSV17 EQU   CVTOPTB                                                  04235000
CVTRSV16 EQU   CVTOPTB                                                  04236000
CVTFP    EQU   CVTOPTB                                                  04237000
CVTAPTHR EQU   CVTOPTB                                                  04238000
CVTNLOG  EQU   CVTOPTB                                                  04239000
CVTTOD   EQU   CVTOPTB                                                  04240000
CVTCTIMS EQU   CVTOPTB                                                  04241000
CVTPROT  EQU   CVTOPTB                                                  04242000
CVTXPFP  EQU   CVTOPTA                                                  04243000
CVTASCII EQU   CVTOPTA                                                  04244000
CVTRSV13 EQU   CVTOPTA                                                  04245000
CVTRSV12 EQU   CVTOPTA                                                  04246000
CVTNIP   EQU   CVTOPTA                                                  04247000
CVTDDR   EQU   CVTOPTA                                                  04248000
CVTAPR   EQU   CVTOPTA                                                  04249000
CVTCCH   EQU   CVTOPTA                                                  04250000
CVTSNCTR EQU   CVTMAP+180                                               04251000
CVTQMWR  EQU   CVTMAP+176                                               04252000
CVTQOCR  EQU   CVTMAP+172                                               04253000
CVT1EF00 EQU   CVTMAP+168                                               04254000
CVTMZ00  EQU   CVTMAP+164                                               04255000
CVTHEAD  EQU   CVTMAP+160                                               04256000
CVTRSV11 EQU   CVTMAP+156                                               04257000
CVT0PT01 EQU   CVTMAP+152                                               04258000
CVTMSER  EQU   CVTMAP+148                                               04259000
CVTRV516 EQU   CVTIERLC                                                 04260000
CVTILCH  EQU   CVTMAP+140                                               04261000
CVT0DS   EQU   CVTMAP+136                                               04262000
CVTFBOSV EQU   CVTMAP+132                                               04263000
CVTNUCB  EQU   CVTMAP+128                                               04264000
CVTIXAVL EQU   CVTMAP+124                                               04265000
CVTIOQET EQU   CVTMAP+120                                               04266000
CVTDCBA  EQU   CVTMAP+117                                               04267000
CVTMVS2  EQU   CVTDCB                                                   04268000
CVT6DAT  EQU   CVTDCB                                                   04269000
CVT4MPS  EQU   CVTDCB                                                   04270000
CVTRSV09 EQU   CVTDCB                                                   04271000
CVT4MS1  EQU   CVTDCB                                                   04272000
CVT2SPS  EQU   CVTDCB                                                   04273000
CVT1SSS  EQU   CVTDCB                                                   04274000
CVTRSV08 EQU   CVTDCB                                                   04275000
CVTSTB   EQU   CVTMAP+112                                               04276000
CVTQTD00 EQU   CVTMAP+108                                               04277000
CVTQTE00 EQU   CVTMAP+104                                               04278000
CVTCUCB  EQU   CVTMAP+100                                               04279000
CVTSJQ   EQU   CVTMAP+96                                                04280000
CVTPBLDL EQU   CVTMAP+92                                                04281000
CVTTPC   EQU   CVTMAP+88                                                04282000
CVTSVDCB EQU   CVTMAP+84                                                04283000
CVTBRET  EQU   CVTMAP+82                                                04284000
CVTEXIT  EQU   CVTMAP+80                                                04285000
CVT0FN00 EQU   CVTMAP+76                                                04286000
CVTDARA  EQU   CVTDAR+1                                                 04287000
CVTRSV07 EQU   CVTFLGS1                                                 04288000
CVTRSV06 EQU   CVTFLGS1                                                 04289000
CVTRSV05 EQU   CVTFLGS1                                                 04290000
CVTRSV04 EQU   CVTFLGS1                                                 04291000
CVTRSV03 EQU   CVTFLGS1                                                 04292000
CVTRSV02 EQU   CVTFLGS1                                                 04293000
CVTRSV01 EQU   CVTFLGS1                                                 04294000
CVTDMPLK EQU   CVTFLGS1                                                 04295000
CVTXITP  EQU   CVTMAP+68                                                04296000
CVTZDTAB EQU   CVTMAP+64                                                04297000
CVTMSLT  EQU   CVTMAP+60                                                04298000
CVTDATE  EQU   CVTMAP+56                                                04299000
CVTBTERM EQU   CVTMAP+52                                                04300000
CVTSYSAD EQU   CVTMAP+48                                                04301000
CVTXTLER EQU   CVTMAP+44                                                04302000
CVTILK2  EQU   CVTMAP+40                                                04303000
CVTILK1  EQU   CVTMAP+36                                                04304000
CVTPRLTV EQU   CVTMAP+32                                                04305000
CVTPCNVT EQU   CVTMAP+28                                                04306000
CVT0VL00 EQU   CVTMAP+24                                                04307000
CVTXAPG  EQU   CVTMAP+20                                                04308000
CVTBUF   EQU   CVTMAP+16                                                04309000
CVTJOB   EQU   CVTMAP+12                                                04310000
CVTLINK  EQU   CVTMAP+8                                                 04311000
CVT0EF00 EQU   CVTMAP+4                                                 04312000
CVT      EQU   CVTMAP                                                   04313000
CNTVAR   EQU   CNTRLINF                                                 04314000
VARINFO  EQU   VARFIELD+2                                               04315000
VARLEN   EQU   VARFIELD                                                 04316000
@NM00045 EQU   EXTRCDPT+3                                               04317000
EXTGOCI  EQU   EXTRCDPT                                                 04318000
NREPCV   EQU   CATRCD+47                                                04319000
@NM00044 EQU   CATRCD+26                                                04320000
RCDDICTS EQU   CATRCD+22                                                04321000
RCDRACTS EQU   CATRCD+18                                                04322000
RCDCRADT EQU   CATRCD+14                                                04323000
RCDCRACI EQU   CATRCD+11                                                04324000
RCDCRAVL EQU   CATRCD+5                                                 04325000
RCDRELID EQU   CATRCD+4                                                 04326000
RCDKEYTY EQU   CATRCD                                                   04327000
CATGOGC  EQU   CATGOGC1                                                 04328000
CATGODSP EQU   CATGOCI+1                                                04329000
@NM00043 EQU   CATGOFLG                                                 04330000
@NM00042 EQU   CCARAB+2                                                 04331000
CCARABRI EQU   CCARAB+1                                                 04332000
CCARBUPD EQU   CCARABFL                                                 04333000
@NM00041 EQU   CCARABFL                                                 04334000
CCARBPA  EQU   CCARABFL                                                 04335000
CCARBWR  EQU   CCARABFL                                                 04336000
CCARBU2  EQU   CCARABFL                                                 04337000
CCARBU1  EQU   CCARABFL                                                 04338000
CCARBUR  EQU   CCARABFL                                                 04339000
DIC2GC   EQU   DIC2ENT+3                                                04340000
DIC2LC   EQU   DIC2ENT+2                                                04341000
DIC2ST   EQU   DIC2ENT+1                                                04342000
@NM00040 EQU   DIC2FLGS                                                 04343000
DIC2UPGD EQU   DIC2FLGS                                                 04344000
DIC2SCRA EQU   DIC2FLGS                                                 04345000
DIC2MV   EQU   DIC2FLGS                                                 04346000
DIC2FLG  EQU   DIC2FLGS                                                 04347000
DIC2COMB EQU   DIC2FLGS                                                 04348000
DIC2REP  EQU   DIC2FLGS                                                 04349000
DIC2VAR  EQU   DIC2FLGS                                                 04350000
DICTGC   EQU   DICTENT+3                                                04351000
DICTLC   EQU   DICTENT+2                                                04352000
DICTST   EQU   DICTENT+1                                                04353000
@NM00039 EQU   DICTFLGS                                                 04354000
DICTUPGD EQU   DICTFLGS                                                 04355000
DICTSCRA EQU   DICTFLGS                                                 04356000
DICTMV   EQU   DICTFLGS                                                 04357000
DICTFLG  EQU   DICTFLGS                                                 04358000
DICTCOMB EQU   DICTFLGS                                                 04359000
DICTREP  EQU   DICTFLGS                                                 04360000
DICTVAR  EQU   DICTFLGS                                                 04361000
ENTNAMEV EQU   ENTNAMES+1                                               04362000
ENTNAMET EQU   ENTNAMES                                                 04363000
WKALEN2  EQU   USERWKA+2                                                04364000
WKALEN1  EQU   USERWKA                                                  04365000
CTGFLCHN EQU   CTGFL+12                                                 04366000
CTGFLDTS EQU   CTGFLDRE                                                 04367000
@NM00038 EQU   CTGFLDRE                                                 04368000
CTGFLDCD EQU   CTGFL+1                                                  04369000
CTGPSWD  EQU   CTGJSCB                                                  04370000
@NM00036 EQU   CTGFBFLG                                                 04371000
CTGNGDSN EQU   CTGFBFLG                                                 04372000
CTGGDGB  EQU   CTGFBFLG                                                 04373000
CTGKEEP  EQU   CTGFBFLG                                                 04374000
CTGPAR   EQU   CTGFBFLG                                                 04375000
CTGFDBK  EQU   CTGNEWNM                                                 04376000
CTGTYPE  EQU   CTGPL+18                                                 04377000
@NM00035 EQU   CTGDSORG                                                 04378000
CTGOPTNS EQU   CTGDSORG                                                 04379000
@NM00034 EQU   CTGOPTN4                                                 04380000
CTGDOCAT EQU   CTGOPTN4                                                 04381000
CTGLBASE EQU   CTGOPTN4                                                 04382000
CTGAM0   EQU   CTGOPTN3                                                 04383000
CTGNUM   EQU   CTGOPTN3                                                 04384000
CTGSRH   EQU   CTGOPTN3                                                 04385000
CTGGDGL  EQU   CTGOPTN3                                                 04386000
CTGSUPLT EQU   CTGOPTN3                                                 04387000
CTGFUNC  EQU   CTGOPTN3                                                 04388000
@NM00033 EQU   CTGOPTN2                                                 04389000
CTGSCR   EQU   CTGOPTN2                                                 04390000
CTGOVRID EQU   CTGOPTN2                                                 04391000
CTGDISC  EQU   CTGOPTN2                                                 04392000
CTGGTNXT EQU   CTGOPTN2                                                 04393000
CTGRCATN EQU   CTGVMNT                                                  04394000
CTGGTALL EQU   CTGREL                                                   04395000
CTGNSVS  EQU   CTGEXT                                                   04396000
CTGGENLD EQU   CTGOPTN1                                                 04397000
CTGCNAME EQU   CTGOPTN1                                                 04398000
CTGNAME  EQU   CTGOPTN1                                                 04399000
CTGREAD  EQU   CTGOPTN1                                                 04400000
CTGUPD   EQU   CTGOPTN1                                                 04401000
CTGCI    EQU   CTGOPTN1                                                 04402000
CTGMAST  EQU   CTGOPTN1                                                 04403000
CTGBYPSS EQU   CTGOPTN1                                                 04404000
CCAEND   EQU   IGGCCA+1492                                              04405000
CCADGDGA EQU   IGGCCA+1488                                              04406000
CCARETRX EQU   CCAERCDX+1                                               04407000
CCARESNX EQU   CCAERCDX                                                 04408000
CCAMODDX EQU   CCAPROBX                                                 04409000
CCASMFCD EQU   CCASMFP+3                                                04410000
CCASMFRC EQU   CCASMFP+2                                                04411000
CCASMFMD EQU   CCASMFP                                                  04412000
CCAREWKA EQU   IGGCCA+1476                                              04413000
CCAVTS   EQU   IGGCCA+1468                                              04414000
CCARAVCA EQU   IGGCCA+1460                                              04415000
CCARANCA EQU   IGGCCA+1452                                              04416000
CCADICTS EQU   IGGCCA+1448                                              04417000
CCASUMTT EQU   IGGCCA+1445                                              04418000
@NM00032 EQU   CCAFLG10                                                 04419000
CCAPRANX EQU   CCAFLG10                                                 04420000
CCARARTC EQU   CCAFLG10                                                 04421000
CCARAFEV EQU   CCAFLG10                                                 04422000
CCACATAC EQU   CCAFLG10                                                 04423000
CCAPDMW  EQU   CCAFLG10                                                 04424000
CCAINCPL EQU   CCAFLG10                                                 04425000
@NM00031 EQU   CCARALSA+2                                               04426000
CCACRABT EQU   CCARALSA                                                 04427000
CCARAREC EQU   IGGCCA+1436                                              04428000
CCARARBA EQU   IGGCCA+1432                                              04429000
CCARARPL EQU   IGGCCA+1428                                              04430000
CCARAACB EQU   IGGCCA+1424                                              04431000
CCACRACI EQU   IGGCCA+1420                                              04432000
CCASBASE EQU   IGGCCA+1417                                              04433000
CCATNQCT EQU   IGGCCA+1416                                              04434000
CCADSPWA EQU   CCABZSAV                                                 04435000
CCAMODNM EQU   CCAREGS+4                                                04436000
@NM00030 EQU   CCAREGS                                                  04437000
@NM00029 EQU   IGGCCA+1057                                              04438000
@NM00028 EQU   CCARVFG1                                                 04439000
RVESBOR  EQU   CCARVFG1                                                 04440000
RVESBO   EQU   CCARVFG1                                                 04441000
RVCMSFG  EQU   CCARVFG1                                                 04442000
RVARFI   EQU   CCARVFG1                                                 04443000
RVCCAV   EQU   CCARVFG1                                                 04444000
ARFSBECH EQU   CCAARFWA+12                                              04445000
ARFSBSCH EQU   CCAARFWA+8                                               04446000
ARFGMADR EQU   CCAARFWA+4                                               04447000
ARFLEN   EQU   ARFGMLEN+1                                               04448000
ARFGMLP  EQU   ARFGMLEN                                                 04449000
CCAMNLL  EQU   CCAMNCAT+248                                             04450000
MNATARG2 EQU   CCAMNAT+244                                              04451000
MNATARG1 EQU   CCAMNAT+241                                              04452000
MNATSCLS EQU   MNATFLGS                                                 04453000
@NM00027 EQU   MNATFLGS                                                 04454000
MNATVAL  EQU   MNATFLGS                                                 04455000
@NM00026 EQU   CCAMNAT+1                                                04456000
@NM00025 EQU   MNATTOP                                                  04457000
CCABMRB2 EQU   IGGCCA+740                                               04458000
CCABMRB1 EQU   IGGCCA+736                                               04459000
CCABMWK4 EQU   IGGCCA+732                                               04460000
CCABMWK3 EQU   IGGCCA+728                                               04461000
CCABMWK2 EQU   IGGCCA+724                                               04462000
CCABMWK1 EQU   IGGCCA+720                                               04463000
CCABMSTR EQU   IGGCCA+718                                               04464000
CCABMBYT EQU   IGGCCA+716                                               04465000
CCABMBTL EQU   IGGCCA+714                                               04466000
CCABMBT1 EQU   IGGCCA+712                                               04467000
CCABMEND EQU   IGGCCA+708                                               04468000
CCABMPTR EQU   IGGCCA+704                                               04469000
CCABMGOP EQU   IGGCCA+700                                               04470000
CCABMPAD EQU   IGGCCA+699                                               04471000
@NM00024 EQU   IGGCCA+697                                               04472000
CCABMOST EQU   CCABMOFG                                                 04473000
CCABMOTR EQU   CCABMOUT+2                                               04474000
CCABMONN EQU   CCABMOUT                                                 04475000
@NM00023 EQU   CCABMINP+7                                               04476000
CCABMLST EQU   CCABMFLG                                                 04477000
CCABMCCK EQU   CCABMFLG                                                 04478000
CCABMSET EQU   CCABMFLG                                                 04479000
CCABMCHK EQU   CCABMFLG                                                 04480000
CCABMST  EQU   CCABMFLG                                                 04481000
CCABMMIN EQU   CCABMINP+4                                               04482000
CCABMLIM EQU   CCABMINP+2                                               04483000
CCABMTRK EQU   CCABMINP                                                 04484000
CCAR14S  EQU   IGGCCA+680                                               04485000
CCAXLATE EQU   IGGCCA+640                                               04486000
CCADEL2  EQU   IGGCCA+637                                               04487000
CCADEL1  EQU   IGGCCA+634                                               04488000
CCAVAR1  EQU   IGGCCA+614                                               04489000
CCAVAR   EQU   IGGCCA+594                                               04490000
CCADELN  EQU   IGGCCA+592                                               04491000
CCAVARPT EQU   IGGCCA+588                                               04492000
CCARBASE EQU   IGGCCA+584                                               04493000
CCARRAB  EQU   IGGCCA+580                                               04494000
CCAVARLN EQU   IGGCCA+578                                               04495000
CCACI3   EQU   IGGCCA+575                                               04496000
CCACI2   EQU   IGGCCA+572                                               04497000
CCACI1   EQU   IGGCCA+569                                               04498000
CCACHAIN EQU   IGGCCA+566                                               04499000
CCASMFLN EQU   IGGCCA+564                                               04500000
CCASMFG2 EQU   CCASMFLG+1                                               04501000
@NM00022 EQU   CCASMFG1                                                 04502000
CCASMFAL EQU   CCASMFSR                                                 04503000
CCASMFDF EQU   CCASMFUC                                                 04504000
CCASMFCT EQU   IGGCCA+560                                               04505000
CCASMFRD EQU   IGGCCA+556                                               04506000
CCANORBA EQU   IGGCCA+555                                               04507000
CCARESUM EQU   CCAFLG9                                                  04508000
CCARAICI EQU   CCAFLG9                                                  04509000
CCARAACT EQU   CCAFLG9                                                  04510000
CCAUCRA  EQU   CCAFLG9                                                  04511000
CCARACR  EQU   CCAFLG9                                                  04512000
CCARALRD EQU   CCAFLG9                                                  04513000
CCARAEOV EQU   CCAFLG9                                                  04514000
CCARABYC EQU   CCAFLG9                                                  04515000
CCAAUCAT EQU   CCAFLG8                                                  04516000
CCALEOD  EQU   CCAFLG8                                                  04517000
CCAVRIND EQU   CCAFLG8                                                  04518000
CCALPIND EQU   CCAFLG8                                                  04519000
CCASCICK EQU   CCAFLG8                                                  04520000
CCASCRA  EQU   CCAFLG8                                                  04521000
CCAVBUFI EQU   CCAFLG8                                                  04522000
CCADSRCL EQU   CCAFLG8                                                  04523000
CCACRABU EQU   CCAFLG7                                                  04524000
CCAFEOV  EQU   CCAFLG7                                                  04525000
CCAROREQ EQU   CCAFLG7                                                  04526000
CCAONCE  EQU   CCAFLG7                                                  04527000
CCASMFBR EQU   CCAFLG7                                                  04528000
CCASMFA  EQU   CCAFLG7                                                  04529000
CCASMFEX EQU   CCAFLG7                                                  04530000
CCALSP   EQU   CCAFLG7                                                  04531000
CCALCPL  EQU   IGGCCA+548                                               04532000
CCASMFPT EQU   IGGCCA+544                                               04533000
CCAILNG2 EQU   IGGCCA+536                                               04534000
CCAILNG3 EQU   IGGCCA+532                                               04535000
CCASDWAP EQU   IGGCCA+528                                               04536000
CCACWAP  EQU   IGGCCA+524                                               04537000
CCACDTCT EQU   IGGCCA+522                                               04538000
CCADTCT  EQU   IGGCCA+520                                               04539000
CCACDTA  EQU   IGGCCA+516                                               04540000
CCADTA   EQU   IGGCCA+512                                               04541000
CCASVCI1 EQU   IGGCCA+509                                               04542000
CCASVCI  EQU   IGGCCA+506                                               04543000
CCADISP  EQU   IGGCCA+504                                               04544000
CCAREPCT EQU   IGGCCA+502                                               04545000
CCADIFF  EQU   IGGCCA+500                                               04546000
CCADLEN  EQU   IGGCCA+498                                               04547000
CCAIXTPL EQU   IGGCCA+496                                               04548000
CCAGRHI1 EQU   CCASSEQ                                                  04549000
CCARCDID EQU   CCAGRGC                                                  04550000
@NM00021 EQU   IGGCCA+492                                               04551000
CCANEFV  EQU   IGGCCA+491                                               04552000
CCAGVEXT EQU   IGGCCA+488                                               04553000
CCANEVV  EQU   IGGCCA+486                                               04554000
CCAGVCT  EQU   IGGCCA+484                                               04555000
CCARABSM EQU   CCAIDPT3                                                 04556000
CCAIDPT2 EQU   IGGCCA+476                                               04557000
CCASMFIX EQU   IGGCCA+474                                               04558000
CCACNIX  EQU   IGGCCA+472                                               04559000
CCARBAL  EQU   IGGCCA+470                                               04560000
CCATLEN  EQU   CCATLNG                                                  04561000
CCARBA2  EQU   CCARBA+16                                                04562000
CCARBA1  EQU   CCARBA+12                                                04563000
CCATT    EQU   CCARBA+10                                                04564000
CCACCHH2 EQU   CCACRADT                                                 04565000
CCACCHH1 EQU   CCACRAVL+2                                               04566000
CCASS    EQU   CCACRAVL                                                 04567000
CCATEST  EQU   IGGCCA+444                                               04568000
CCATNO   EQU   IGGCCA+442                                               04569000
CCATREL  EQU   IGGCCA+410                                               04570000
CCATNUM  EQU   IGGCCA+408                                               04571000
CCATNREL EQU   IGGCCA+406                                               04572000
CCAIXREL EQU   IGGCCA+404                                               04573000
CCAIXFPL EQU   IGGCCA+402                                               04574000
@NM00020 EQU   IGGCCA+400                                               04575000
CCASN1   EQU   CCASN                                                    04576000
CCALREL1 EQU   CCALREL                                                  04577000
CCAGC    EQU   IGGCCA+395                                               04578000
CCACBASE EQU   IGGCCA+392                                               04579000
CCARABL  EQU   IGGCCA+388                                               04580000
CCARABF  EQU   IGGCCA+384                                               04581000
CCARABB  EQU   IGGCCA+380                                               04582000
CCARABPT EQU   IGGCCA+368                                               04583000
CCATFLPT EQU   CCAFLPT                                                  04584000
CCAILNG  EQU   IGGCCA+360                                               04585000
CCASL    EQU   IGGCCA+358                                               04586000
CCAGOPLN EQU   IGGCCA+356                                               04587000
CCACPE71 EQU   IGGCCA+352                                               04588000
CCAIDPT  EQU   CCACPE7                                                  04589000
CCARABSE EQU   CCACPE61                                                 04590000
CCACPE53 EQU   IGGCCA+336                                               04591000
CCACPE52 EQU   IGGCCA+332                                               04592000
CCACPE51 EQU   IGGCCA+328                                               04593000
CCALUME  EQU   IGGCCA+324                                               04594000
CCAEXCMS EQU   CCACMS+4                                                 04595000
CCARPRM  EQU   IGGCCA+312                                               04596000
@NM00019 EQU   CCAMSSPL+10                                              04597000
@NM00018 EQU   CCAMSSPL+8                                               04598000
CCAMNPTR EQU   CCAMSSPL+4                                               04599000
CCAMNLLP EQU   CCAMSSPL                                                 04600000
CCAEDUCB EQU   CCAEQDQ+12                                               04601000
CCAEDRNM EQU   CCAEQDQ+8                                                04602000
CCAEDQNM EQU   CCAEQDQ+4                                                04603000
CCAEDRCD EQU   CCAEQDQ+3                                                04604000
@NM00017 EQU   CCAEDOPT                                                 04605000
CCAEDSHR EQU   CCAEDOPT                                                 04606000
CCAEDRLN EQU   CCAEQDQ+1                                                04607000
CCAEDXFF EQU   CCAEQDQ                                                  04608000
CCAASCIX EQU   IGGCCA+270                                               04609000
CCACRRP  EQU   IGGCCA+269                                               04610000
CCAASCIK EQU   IGGCCA+268                                               04611000
CCAQLEN  EQU   IGGCCA+219                                               04612000
CCASC    EQU   IGGCCA+218                                               04613000
CCATQDB  EQU   CCATIQRN+2                                               04614000
CCATASID EQU   CCATIQRN                                                 04615000
CCARPLT  EQU   IGGCCA+211                                               04616000
CCARPLX  EQU   IGGCCA+210                                               04617000
CCARPLF  EQU   IGGCCA+209                                               04618000
CCARPLK  EQU   IGGCCA+208                                               04619000
CCACPE45 EQU   CCAR5SEG+8                                               04620000
CCACPE35 EQU   CCAR5SEG+4                                               04621000
CCACPE25 EQU   CCAR5SEG                                                 04622000
@NM00016 EQU   CCARAB5+2                                                04623000
CCAR5RPL EQU   CCARAB5+1                                                04624000
CCAR5UPD EQU   CCAR5FLG                                                 04625000
@NM00015 EQU   CCAR5FLG                                                 04626000
CCAR5PA  EQU   CCAR5FLG                                                 04627000
CCAR5WR  EQU   CCAR5FLG                                                 04628000
CCAR5U2  EQU   CCAR5FLG                                                 04629000
CCAR5U1  EQU   CCAR5FLG                                                 04630000
CCAR5UR  EQU   CCAR5FLG                                                 04631000
CCACPE44 EQU   CCAR4SEG+8                                               04632000
CCACPE34 EQU   CCAR4SEG+4                                               04633000
CCACPE24 EQU   CCAR4SEG                                                 04634000
@NM00014 EQU   CCARAB4+2                                                04635000
CCAR4RPL EQU   CCARAB4+1                                                04636000
CCAR4UPD EQU   CCAR4FLG                                                 04637000
@NM00013 EQU   CCAR4FLG                                                 04638000
CCAR4PA  EQU   CCAR4FLG                                                 04639000
CCAR4WR  EQU   CCAR4FLG                                                 04640000
CCAR4U2  EQU   CCAR4FLG                                                 04641000
CCAR4U1  EQU   CCAR4FLG                                                 04642000
CCAR4UR  EQU   CCAR4FLG                                                 04643000
CCACPE43 EQU   CCAR3SEG+8                                               04644000
CCACPE33 EQU   CCAR3SEG+4                                               04645000
CCACPE23 EQU   CCAR3SEG                                                 04646000
@NM00012 EQU   CCARAB3+2                                                04647000
CCAR3RPL EQU   CCARAB3+1                                                04648000
CCAR3UPD EQU   CCAR3FLG                                                 04649000
@NM00011 EQU   CCAR3FLG                                                 04650000
CCAR3PA  EQU   CCAR3FLG                                                 04651000
CCAR3WR  EQU   CCAR3FLG                                                 04652000
CCAR3U2  EQU   CCAR3FLG                                                 04653000
CCAR3U1  EQU   CCAR3FLG                                                 04654000
CCAR3UR  EQU   CCAR3FLG                                                 04655000
CCACPE42 EQU   CCAR2SEG+8                                               04656000
CCACPE32 EQU   CCAR2SEG+4                                               04657000
CCACPE22 EQU   CCAR2SEG                                                 04658000
@NM00010 EQU   CCARAB2+2                                                04659000
CCAR2RPL EQU   CCARAB2+1                                                04660000
CCAR2UPD EQU   CCAR2FLG                                                 04661000
@NM00009 EQU   CCAR2FLG                                                 04662000
CCAR2PA  EQU   CCAR2FLG                                                 04663000
CCAR2WR  EQU   CCAR2FLG                                                 04664000
CCAR2U2  EQU   CCAR2FLG                                                 04665000
CCAR2U1  EQU   CCAR2FLG                                                 04666000
CCAR2UR  EQU   CCAR2FLG                                                 04667000
CCACPE41 EQU   CCAR1SEG+8                                               04668000
CCACPE31 EQU   CCAR1SEG+4                                               04669000
CCACPE21 EQU   CCAR1SEG                                                 04670000
@NM00008 EQU   CCARAB1+2                                                04671000
CCAR1RPL EQU   CCARAB1+1                                                04672000
CCAR1UPD EQU   CCAR1FLG                                                 04673000
@NM00007 EQU   CCAR1FLG                                                 04674000
CCAR1PA  EQU   CCAR1FLG                                                 04675000
CCAR1WR  EQU   CCAR1FLG                                                 04676000
CCAR1U2  EQU   CCAR1FLG                                                 04677000
CCAR1U1  EQU   CCAR1FLG                                                 04678000
CCAR1UR  EQU   CCAR1FLG                                                 04679000
CCACPE40 EQU   CCAR0SEG+8                                               04680000
CCACPE30 EQU   CCAR0SEG+4                                               04681000
CCACPE20 EQU   CCAR0SEG                                                 04682000
@NM00006 EQU   CCARAB0+2                                                04683000
CCAR0RPL EQU   CCARAB0+1                                                04684000
CCAR0UPD EQU   CCAR0FLG                                                 04685000
@NM00005 EQU   CCAR0FLG                                                 04686000
CCAR0PA  EQU   CCAR0FLG                                                 04687000
CCAR0WR  EQU   CCAR0FLG                                                 04688000
CCAR0U2  EQU   CCAR0FLG                                                 04689000
CCAR0U1  EQU   CCAR0FLG                                                 04690000
CCAR0UR  EQU   CCAR0FLG                                                 04691000
@NM00004 EQU   CCASRCH+3                                                04692000
CCASRCIN EQU   CCASRID                                                  04693000
CCANPCCB EQU   IGGCCA+36                                                04694000
CCADPL   EQU   CCARB                                                    04695000
CCALBCYL EQU   CCATCB                                                   04696000
CCAMOD   EQU   CCAFLG6                                                  04697000
CCAEXT   EQU   CCAFLG6                                                  04698000
CCAREUSE EQU   CCAFLG6                                                  04699000
CCASUPFD EQU   CCAFLG6                                                  04700000
CCAINIT  EQU   CCAFLG6                                                  04701000
CCAMNOSP EQU   CCAFLG6                                                  04702000
CCADELP  EQU   CCAFLG6                                                  04703000
CCAMCODR EQU   CCAFLG6                                                  04704000
CCATEX2  EQU   CCAFLG5                                                  04705000
CCATEX1  EQU   CCAFLG5                                                  04706000
CCATEX   EQU   CCAFLG5                                                  04707000
CCATHIT  EQU   CCAFLG5                                                  04708000
CCAMODPA EQU   CCAFLG5                                                  04709000
CCAMEX1  EQU   CCAFLG5                                                  04710000
CCAMEX   EQU   CCAFLG5                                                  04711000
CCAMEX2  EQU   CCAFLG5                                                  04712000
CCATCOMP EQU   CCAFLG4                                                  04713000
CCAGVNE  EQU   CCAFLG4                                                  04714000
CCAGVEX  EQU   CCAFLG4                                                  04715000
CCAGVNBS EQU   CCAFLG4                                                  04716000
CCAGVNF  EQU   CCAFLG4                                                  04717000
CCAGVNC  EQU   CCAFLG4                                                  04718000
CCAF4BYS EQU   CCAFLG4                                                  04719000
CCAF4DRQ EQU   CCAFLG4                                                  04720000
CCAEGREC EQU   CCAFLG3                                                  04721000
CCALFT   EQU   CCAFLG3                                                  04722000
CCAELC2  EQU   CCAFLG3                                                  04723000
CCANF    EQU   CCAFLG3                                                  04724000
CCAEXGR2 EQU   CCAFLG3                                                  04725000
CCAGDSP  EQU   CCAFLG3                                                  04726000
CCAGC4   EQU   CCAFLG3                                                  04727000
CCAEXGR1 EQU   CCAFLG3                                                  04728000
CCAF2SMO EQU   CCAFLG2                                                  04729000
CCAF2CO  EQU   CCAF2COB                                                 04730000
CCAF2RHS EQU   CCAFLG2                                                  04731000
CCAF2XEQ EQU   CCAFLG2                                                  04732000
CCAF2CCT EQU   CCAFLG2                                                  04733000
CCAF2NVC EQU   CCAFLG2                                                  04734000
CCAF2SYS EQU   CCAFLG2                                                  04735000
CCAF1DK  EQU   CCAFLG1                                                  04736000
CCAF1UP  EQU   CCAFLG1                                                  04737000
CCAF1KGE EQU   CCAFLG1                                                  04738000
CCAF1KEY EQU   CCAFLG1                                                  04739000
CCAF1LRD EQU   CCAFLG1                                                  04740000
CCAF1CNS EQU   CCAFLG1                                                  04741000
CCAF1LPS EQU   CCAFLG1                                                  04742000
CCACD2   EQU   IGGCCA+13                                                04743000
@NM00003 EQU   IGGCCA+8                                                 04744000
CCACDR   EQU   CCAREASN                                                 04745000
CCAMODID EQU   CCAPROB                                                  04746000
CCASZ    EQU   IGGCCA+2                                                 04747000
CCAID    EQU   IGGCCA                                                   04748000
CMAFPL   EQU   CMASFPST                                                 04749000
@NM00002 EQU   CMFLITEX                                                 04750000
CMFLNOPF EQU   CMFLITEX                                                 04751000
CMFLHKBA EQU   CMFPLSTR+48                                              04752000
@NM00001 EQU   CMFLVLFL                                                 04753000
CMFLVLOV EQU   CMFLVLFL                                                 04754000
CMFLVLCN EQU   CMFLVLFL                                                 04755000
CMFLFLSQ EQU   CMFPLSTR+44                                              04756000
CMFPLOCR EQU   CMFPLSTR                                                 04757000
CCRFDCI  EQU   CCRCNTRL+9                                               04758000
CCRCDCI  EQU   CCRCNTRL+6                                               04759000
@NM00075 EQU   PSA+3668                                                 04760000
PSASTAK  EQU   PSA+3072                                                 04761000
@NM00074 EQU   PSA+1040                                                 04762000
PSAUSEND EQU   PSA+1040                                                 04763000
PSARV062 EQU   PSA+1036                                                 04764000
PSAATCVT EQU   PSA+1032                                                 04765000
PSAPCPSW EQU   PSA+1024                                                 04766000
PSAPIR2  EQU   PSA+1020                                                 04767000
PSARV059 EQU   PSA+1018                                                 04768000
PSASVC13 EQU   PSA+1016                                                 04769000
PSALSFCC EQU   PSA+1012                                                 04770000
PSASFACC EQU   PSA+1008                                                 04771000
PSASTOP  EQU   PSA+992                                                  04772000
PSASTART EQU   PSA+976                                                  04773000
PSARSPSW EQU   PSA+968                                                  04774000
PSASRPSW EQU   PSA+960                                                  04775000
PSARV045 EQU   PSA+892                                                  04776000
PSARV044 EQU   PSA+888                                                  04777000
PSARV043 EQU   PSA+884                                                  04778000
PSARV042 EQU   PSA+880                                                  04779000
PSARV041 EQU   PSA+876                                                  04780000
PSARV040 EQU   PSA+872                                                  04781000
PSARV025 EQU   PSA+868                                                  04782000
PSADSSED EQU   PSA+868                                                  04783000
PSADSSPR EQU   PSA+864                                                  04784000
PSADSSFW EQU   PSA+860                                                  04785000
PSADSS14 EQU   PSA+856                                                  04786000
PSADSSPP EQU   PSA+848                                                  04787000
PSADSSRP EQU   PSA+840                                                  04788000
PSADSS05 EQU   PSADSSF4                                                 04789000
PSADSS10 EQU   PSADSSF4                                                 04790000
PSADSSVE EQU   PSADSSF4                                                 04791000
PSADSSDE EQU   PSADSSF4                                                 04792000
PSADSSC0 EQU   PSADSSF4                                                 04793000
PSADSSIE EQU   PSADSSF4                                                 04794000
PSADSS12 EQU   PSADSSF4                                                 04795000
PSADSSRC EQU   PSADSSF4                                                 04796000
PSARV057 EQU   PSADSSF3                                                 04797000
PSARV056 EQU   PSADSSF3                                                 04798000
PSARV055 EQU   PSADSSF3                                                 04799000
PSADSSMC EQU   PSADSSF3                                                 04800000
PSADSSRW EQU   PSADSSF3                                                 04801000
PSADSSNM EQU   PSADSSF3                                                 04802000
PSADSSES EQU   PSADSSF3                                                 04803000
PSADSSGP EQU   PSADSSF3                                                 04804000
PSADSSF2 EQU   PSADSSFL+1                                               04805000
PSADSSPI EQU   PSADSSF1                                                 04806000
PSADSSOI EQU   PSADSSF1                                                 04807000
PSADSSSP EQU   PSADSSF1                                                 04808000
PSADSSTP EQU   PSADSSF1                                                 04809000
PSADSSDW EQU   PSADSSF1                                                 04810000
PSADSSDD EQU   PSADSSF1                                                 04811000
PSADSSDM EQU   PSADSSF1                                                 04812000
PSADSSMV EQU   PSADSSF1                                                 04813000
PSADSSTS EQU   PSA+816                                                  04814000
PSADSSWK EQU   PSA+812                                                  04815000
PSADSSR3 EQU   PSA+808                                                  04816000
PSADSSR2 EQU   PSA+804                                                  04817000
PSADSSRS EQU   PSA+800                                                  04818000
PSASTOR  EQU   PSA+796                                                  04819000
PSACPUSA EQU   PSA+794                                                  04820000
PSAVSTAP EQU   PSA+792                                                  04821000
PSAWKVAP EQU   PSA+788                                                  04822000
PSAWKRAP EQU   PSA+784                                                  04823000
PSAMCHIC EQU   PSA+783                                                  04824000
PSARV061 EQU   PSA+782                                                  04825000
PSASYMSK EQU   PSA+781                                                  04826000
PSAMCHFL EQU   PSA+780                                                  04827000
PSACR0   EQU   PSA+776                                                  04828000
PSAPSWSV EQU   PSA+768                                                  04829000
PSALITA  EQU   PSA+764                                                  04830000
PSACLHS  EQU   PSAHLHI                                                  04831000
PSALKR15 EQU   PSALKSA+60                                               04832000
PSALKR14 EQU   PSALKSA+56                                               04833000
PSALKR13 EQU   PSALKSA+52                                               04834000
PSALKR12 EQU   PSALKSA+48                                               04835000
PSALKR11 EQU   PSALKSA+44                                               04836000
PSALKR10 EQU   PSALKSA+40                                               04837000
PSALKR9  EQU   PSALKSA+36                                               04838000
PSALKR8  EQU   PSALKSA+32                                               04839000
PSALKR7  EQU   PSALKSA+28                                               04840000
PSALKR6  EQU   PSALKSA+24                                               04841000
PSALKR5  EQU   PSALKSA+20                                               04842000
PSALKR4  EQU   PSALKSA+16                                               04843000
PSALKR3  EQU   PSALKSA+12                                               04844000
PSALKR2  EQU   PSALKSA+8                                                04845000
PSALKR1  EQU   PSALKSA+4                                                04846000
PSALKR0  EQU   PSALKSA                                                  04847000
PSARV023 EQU   PSACLHT+52                                               04848000
PSALOCAL EQU   PSACLHT+48                                               04849000
PSACMSL  EQU   PSACLHT+44                                               04850000
PSAOPTL  EQU   PSACLHT+40                                               04851000
PSATPACL EQU   PSACLHT+36                                               04852000
PSATPDNL EQU   PSACLHT+32                                               04853000
PSATPNCL EQU   PSACLHT+28                                               04854000
PSAIOSLL EQU   PSACLHT+24                                               04855000
PSAIOSUL EQU   PSACLHT+20                                               04856000
PSAIOSCL EQU   PSACLHT+16                                               04857000
PSAIOSSL EQU   PSACLHT+12                                               04858000
PSASALCL EQU   PSACLHT+8                                                04859000
PSAASML  EQU   PSACLHT+4                                                04860000
PSADISPL EQU   PSACLHT                                                  04861000
PSASRSA  EQU   PSA+636                                                  04862000
PSARV050 EQU   PSA+634                                                  04863000
PSADSSGO EQU   PSA+633                                                  04864000
PSARECUR EQU   PSA+632                                                  04865000
PSAHLHIS EQU   PSA+628                                                  04866000
PSAIPCSA EQU   PSA+624                                                  04867000
@NM00073 EQU   PSA+621                                                  04868000
PSAIPCDM EQU   PSA+620                                                  04869000
PSAIPCD  EQU   PSA+616                                                  04870000
@NM00072 EQU   PSA+613                                                  04871000
PSAIPCRM EQU   PSA+612                                                  04872000
PSAIPCR  EQU   PSA+608                                                  04873000
PSAMCHEX EQU   PSA+600                                                  04874000
PSAMPSW  EQU   PSA+592                                                  04875000
PSAEXPS2 EQU   PSA+584                                                  04876000
PSAEXPS1 EQU   PSA+576                                                  04877000
PSAPIREG EQU   PSA+572                                                  04878000
PSARSREG EQU   PSA+568                                                  04879000
PSAGPREG EQU   PSA+556                                                  04880000
PSARV022 EQU   PSASUP4                                                  04881000
PSARV021 EQU   PSASUP4                                                  04882000
PSARV020 EQU   PSASUP4                                                  04883000
PSARV019 EQU   PSASUP4                                                  04884000
PSARV018 EQU   PSASUP4                                                  04885000
PSARV017 EQU   PSASUP4                                                  04886000
PSARV016 EQU   PSASUP4                                                  04887000
PSARV015 EQU   PSASUP4                                                  04888000
PSARV014 EQU   PSASUP3                                                  04889000
PSARV013 EQU   PSASUP3                                                  04890000
PSARV012 EQU   PSASUP3                                                  04891000
PSARV011 EQU   PSASUP3                                                  04892000
PSARV010 EQU   PSASUP3                                                  04893000
PSAPSREG EQU   PSASUP3                                                  04894000
PSAPI2   EQU   PSASUP3                                                  04895000
PSAIOSUP EQU   PSASUP3                                                  04896000
PSALCR   EQU   PSASUP2                                                  04897000
PSARTM   EQU   PSASUP2                                                  04898000
PSAACR   EQU   PSASUP2                                                  04899000
PSAIPCE2 EQU   PSASUP2                                                  04900000
PSAIPCES EQU   PSASUP2                                                  04901000
PSAIPCEC EQU   PSASUP2                                                  04902000
PSAGTF   EQU   PSASUP2                                                  04903000
PSAIPCRI EQU   PSASUP2                                                  04904000
PSAIPCRP EQU   PSASUP1                                                  04905000
PSAIPCDR EQU   PSASUP1                                                  04906000
PSADISP  EQU   PSASUP1                                                  04907000
PSALOCK  EQU   PSASUP1                                                  04908000
PSAPI    EQU   PSASUP1                                                  04909000
PSAEXT   EQU   PSASUP1                                                  04910000
PSASVC   EQU   PSASUP1                                                  04911000
PSAIO    EQU   PSASUP1                                                  04912000
PSAAOLD  EQU   PSA+548                                                  04913000
PSAANEW  EQU   PSA+544                                                  04914000
PSATOLD  EQU   PSA+540                                                  04915000
PSATNEW  EQU   PSA+536                                                  04916000
PSALCCAR EQU   PSA+532                                                  04917000
PSALCCAV EQU   PSA+528                                                  04918000
PSAPCCAR EQU   PSA+524                                                  04919000
PSAPCCAV EQU   PSA+520                                                  04920000
PSACPULA EQU   PSA+518                                                  04921000
PSACPUPA EQU   PSA+516                                                  04922000
PSAPSA   EQU   PSA+512                                                  04923000
FLCHDEND EQU   PSA+512                                                  04924000
FLCCRSAV EQU   FLCMCLA+280                                              04925000
FLCGRSAV EQU   FLCMCLA+216                                              04926000
FLCFPSAV EQU   FLCMCLA+184                                              04927000
FLCFLA   EQU   FLCMCLA+88                                               04928000
FLCRGNCD EQU   FLCMCLA+84                                               04929000
FLCFSAA  EQU   FLCFSA+1                                                 04930000
@NM00071 EQU   FLCFSA                                                   04931000
@NM00070 EQU   FLCMCLA+72                                               04932000
FLCMCIC  EQU   FLCMCLA+64                                               04933000
@NM00069 EQU   FLCMCLA+20                                               04934000
FLCIOAA  EQU   FLCIOA+1                                                 04935000
@NM00068 EQU   FLCIOA                                                   04936000
@NM00067 EQU   FLCMCLA+15                                               04937000
@NM00066 EQU   FLCMCLA+14                                               04938000
@NM00065 EQU   FLCMCLA+12                                               04939000
FLCLCL   EQU   FLCMCLA+8                                                04940000
FLCIOELA EQU   FLCIOEL+1                                                04941000
@NM00064 EQU   FLCIOEL                                                  04942000
FLCCHNID EQU   FLCMCLA                                                  04943000
@NM00063 EQU   PSA+160                                                  04944000
FLCMTRCD EQU   PSA+157                                                  04945000
@NM00062 EQU   PSA+156                                                  04946000
FLCPERA  EQU   FLCPER+1                                                 04947000
@NM00061 EQU   FLCPER                                                   04948000
@NM00060 EQU   PSA+151                                                  04949000
FLCPERCD EQU   PSA+150                                                  04950000
FLCMCNUM EQU   PSA+149                                                  04951000
@NM00059 EQU   PSA+148                                                  04952000
FLCTEAA  EQU   FLCTEA+1                                                 04953000
@NM00058 EQU   FLCTEA                                                   04954000
PSAPIPC  EQU   PSAPICOD                                                 04955000
PSAPIMC  EQU   PSAPICOD                                                 04956000
PSAPIPER EQU   PSAPICOD                                                 04957000
PSARV049 EQU   FLCPICOD                                                 04958000
FLCPILCB EQU   FLCPIILC                                                 04959000
@NM00057 EQU   FLCPIILC                                                 04960000
@NM00056 EQU   PSAEPPSW                                                 04961000
FLCSVCN  EQU   PSAESPSW+2                                               04962000
FLCSILCB EQU   FLCSVILC                                                 04963000
@NM00055 EQU   FLCSVILC                                                 04964000
@NM00054 EQU   PSAESPSW                                                 04965000
FLCEICOD EQU   PSAEEPSW+2                                               04966000
PSASPAD  EQU   PSAEEPSW                                                 04967000
@NM00053 EQU   PSA+128                                                  04968000
FLCINPSW EQU   PSA+120                                                  04969000
FLCMNPSW EQU   PSA+112                                                  04970000
FLCPNPSW EQU   PSA+104                                                  04971000
FLCSNPSW EQU   PSA+96                                                   04972000
FLCENPSW EQU   PSA+88                                                   04973000
FLCTRACE EQU   PSA+84                                                   04974000
FLCTIMER EQU   PSA+80                                                   04975000
FLCCVT2  EQU   PSA+76                                                   04976000
FLCCAW   EQU   PSA+72                                                   04977000
FLCCSW   EQU   PSA+64                                                   04978000
FLCIOPSW EQU   PSA+56                                                   04979000
FLCMOPSW EQU   PSA+48                                                   04980000
FLCPOPSW EQU   PSA+40                                                   04981000
FLCSOPSW EQU   PSA+32                                                   04982000
FLCEOPSW EQU   PSA+24                                                   04983000
@NM00052 EQU   FLCICCW2+4                                               04984000
FLCCVT   EQU   FLCICCW2                                                 04985000
FLCICCW1 EQU   FLCROPSW                                                 04986000
FLCIPPSW EQU   FLCRNPSW                                                 04987000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04988000
@RC00244 EQU   @RC00227                                                 04989000
@PB00013 EQU   @EL00001                                                 04990000
@RC00245 EQU   @RC00244                                                 04991000
@ENDDATA EQU   *                                                        04992000
         END   IGG0CLAS,(C'PLS1647',0602,75056)                         04993000
