         TITLE 'IGG0CLB3, SMF GET/PUT FOR ALTER                        *00001000
                        '                                               00002000
IGG0CLB3 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IGG0CLB3  75.084'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
         USING @MAINENT,@15                                             00011000
         USING @DATD-(CCATEMPS-IGGCCA),R11                              00012000
         DS 0F                                                          00013000
         DC CL8'IGGPSMF'                                                00014000
         EJECT                                                          00015000
         B     @PB00002                                            0076 00016000
IGGPSMF  DS    0H                                                  0077 00017000
         ENTRY IGGPSMF                                                  00018000
         DROP @15                                                       00019000
Z003     DS    0H                                                  0079 00020000
Z003SMF  DS    0H                                                  0080 00021000
         STM 12,14,12(13)                                               00022000
         LA 13,12(13)                                                   00023000
         BALR 12,0                                                      00024000
IGGSEGST DS 0H                                                          00025000
         USING *,12                                                     00026000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00027000
**   MODULE NAME =  IGGPSMF (IGG0CLB3)                                * 00028000
**                                                                    * 00029000
**   DESCRIPTIVE NAME =  SMF LOGICAL PUT OF ALTERED RECORDS           * 00030000
**                                                                    * 00031000
**   COPYRIGHT =  NONE                                                * 00032000
**                                                                    * 00033000
**   STATUS =  RELEASE 1, LEVEL 0                                     * 00034000
**                                                                    * 00035000
**   FUNCTION =                                                       * 00036000
**      THIS SUB-FUNCTION WORKS WITH IGGPSMFG TO SAVE PORTIONS OF THE * 00037000
**      OLD CATALOG ENTRY WHICH ARE TO BE ALTERED (FOR WRITING THE    * 00038000
**      ALTER SMF RECORD 63 BY IGGPSMFA).  IT IS CALLED TO INDICATE   * 00039000
**      THAT A USER RECORD, UPDATED BY AN I/O PUT, HAS BEEN ALTERED   * 00040000
**      AND SO THE OLD SAVED COPY IN THE SMF CHAIN SHOULD BE PRESERVED* 00041000
**                                                                    * 00042000
**   INPUT =                                                          * 00043000
**      IGGCCA INPUT:                                                 * 00044000
**         CCACD1 - NO PROCESSING UNLESS ZERO                         * 00045000
**         CCASMFA - INDICATES WHETHER THIS SMF ROUTINE SHOULD        * 00046000
**                   PROCESS.                                         * 00047000
**         CCAURAB - POINTS TO THE RAB OF THE CATALOG RECORD ALTERED. * 00048000
**                   NO PROCESSING IF VOLUME RECORD ID.               * 00049000
**         CCASMFPT - SMF RECORD CHAIN ADDRESS                        * 00050000
**                                                                    * 00051000
**   OUTPUT =                                                         * 00052000
**      IGGCCA OUTPUT:                                                * 00053000
**         CCASMFCT - INCREMENTED BY ONE, IF THE CATALOG RECORD IS    * 00054000
**                    PROCESSED.                                      * 00055000
**         SMF RECORD CHAIN ALTERED TO INDICATE PRESERVATION OF THE   * 00056000
**         OLD CATALOG RECORD, PROVIDED IT WAS A CANDIDATE FOR        * 00057000
**         PRESERVATION.                                              * 00058000
**                                                                    * 00059000
**                                                                    * 00060000
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00061000
*                                                                  0086 00062000
*   IF CCASMFA=OFF|CCACD1^=RCS|     /* IF SMF INDICATOR OFF, OR      */ 00063000
*       RCDID=VOLEXTID|RCDID=VOLRCDID/* ERROR, OR VOLUME ENTRY       */ 00064000
*     THEN                                                         0086 00065000
         TM    CCASMFA(R11),B'00100000'                            0086 00066000
         BZ    @RT00086                                            0086 00067000
         CLI   CCACD1(R11),0                                       0086 00068000
         BNE   @RT00086                                            0086 00069000
         L     @10,CCAURAB(,R11)                                   0086 00070000
         L     @10,CCACPE1(,@10)                                   0086 00071000
         CLI   RCDID(@10),C'W'                                     0086 00072000
         BE    @RT00086                                            0086 00073000
         CLI   RCDID(@10),C'V'                                     0086 00074000
         BE    @RT00086                                            0086 00075000
*     ;                             /* DONT PROCESS SMF              */ 00076000
*   ELSE                            /* PROCESS ALTERED RECORD        */ 00077000
*     DO;                           /* SMF PROCESS                   */ 00078000
*       R2=(CCAURAB-ADDR(CCARAB0))/LENGTH(CCARAB);/* GET RELATIVE RAB   00079000
*                                      SEQUENCE NO.                  */ 00080000
         LA    R2,CCARAB0(,R11)                                    0089 00081000
         LR    @00,R2                                              0089 00082000
         LCR   @00,@00                                             0089 00083000
         AL    @00,CCAURAB(,R11)                                   0089 00084000
         SRDA  @00,32                                              0089 00085000
         D     @00,@CF00137                                        0089 00086000
         LR    R2,@01                                              0089 00087000
*       R3=CCASMFPT;                /* FIRST ELT IN CHAIN            */ 00088000
         L     R3,CCASMFPT(,R11)                                   0090 00089000
*       DO WHILE(R3^=0);            /* FIND RELATED RAB ELT          */ 00090000
         B     @DE00091                                            0091 00091000
@DL00091 DS    0H                                                  0092 00092000
*         IF R2=(SMFLAG&RELBITS) THEN/* TEST IS THIS RELATED RAB   0092 00093000
*                                      ELEMENT                       */ 00094000
         LA    @10,15                                              0092 00095000
         SLR   @05,@05                                             0092 00096000
         IC    @05,SMFLAG(,R3)                                     0092 00097000
         NR    @10,@05                                             0092 00098000
         CR    R2,@10                                              0092 00099000
         BNE   @RF00092                                            0092 00100000
*           IF SMFCAND=ON&          /* SEE IF RELATED RAB HAS        */ 00101000
*               R3->RCDCINO=RCDCINO THEN/* CAND RCD FOR      @Y30SSRS   00102000
*                                      PRESERVATION                  */ 00103000
         TM    SMFCAND(R3),B'01000000'                             0093 00104000
         BNO   @RF00093                                            0093 00105000
         L     @10,CCAURAB(,R11)                                   0093 00106000
         L     @10,CCACPE1(,@10)                                   0093 00107000
         CLC   RCDCINO(3,R3),RCDCINO(@10)                          0093 00108000
         BNE   @RF00093                                            0093 00109000
*             DO;                   /* SAVE RCD                      */ 00110000
*               SMFPRES=ON;         /* INDICATE RCD PRESERVATION     */ 00111000
         OI    SMFPRES(R3),B'10000000'                             0095 00112000
*               CCASMFCT=CCASMFCT+1;/* INCR COUNT PRESERVED RCDS     */ 00113000
         LA    @10,1                                               0096 00114000
         AH    @10,CCASMFCT(,R11)                                  0096 00115000
         STH   @10,CCASMFCT(,R11)                                  0096 00116000
*             END;                  /* END SAVE RECORD               */ 00117000
*           ELSE                                                   0098 00118000
*             ;                     /* NOT CANDIDATE RCD             */ 00119000
@RF00093 DS    0H                                                  0099 00120000
*         ELSE                                                     0099 00121000
*           ;                       /* NOT RELATED RAB ELT           */ 00122000
@RF00092 DS    0H                                                  0100 00123000
*         R3=SMFCHAIN;              /* NEXT ELT OF SMG CHAIN         */ 00124000
         ICM   R3,15,SMFCHAIN(R3)                                  0100 00125000
*       END;                        /* END FIND                      */ 00126000
@DE00091 LTR   R3,R3                                               0101 00127000
         BNZ   @DL00091                                            0101 00128000
*     END;                          /* END SMF PROCESS               */ 00129000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 00130000
@RT00086 BAL   @14,EXIT                                            0103 00131000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 00132000
         DS 0F                                                          00133000
*   GEN(DC CL8'IGGPSMFG');          /* NAME OF FOLLOWING PROCEDURE   */ 00134000
         DC CL8'IGGPSMFG'                                               00135000
*   END;                            /* END OF INNER PROCEDURE        */ 00136000
@EL00002 DS    0H                                                  0106 00137000
@EF00002 DS    0H                                                  0106 00138000
@ER00002 BR    @14                                                 0106 00139000
@PB00002 DS    0H                                                  0107 00140000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 00141000
         EJECT                                                          00142000
*                                                                  0108 00143000
*/********************************************************************/ 00144000
*/*                                                                  */ 00145000
*/*        IGGPSMFG  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */ 00146000
*/*                                                                  */ 00147000
*/********************************************************************/ 00148000
*                                                                  0108 00149000
*IGGPSMFG:                                                         0108 00150000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 00151000
         B     @PB00003                                            0108 00152000
IGGPSMFG DS    0H                                                  0109 00153000
*   GEN(ENTRY IGGPSMFG );           /* IDENTIFY ENTRY-POINT SYMBOL   */ 00154000
         ENTRY IGGPSMFG                                                 00155000
*Z004:                              /* LABEL FOR PROCEDURE TRACKING  */ 00156000
*Z004SMFG:                          /* LABEL FOR PROCEDURE TRACKING  */ 00157000
*   RFY                                                            0110 00158000
*    (R5,                                                          0110 00159000
*     R6,                                                          0110 00160000
*     R7,                                                          0110 00161000
*     R8,                                                          0110 00162000
*     R9,                                                          0110 00163000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 00164000
Z004     DS    0H                                                  0110 00165000
Z004SMFG DS    0H                                                  0111 00166000
*   RFY                                                            0111 00167000
*    (R2,                                                          0111 00168000
*     R3,                                                          0111 00169000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 00170000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 00171000
         STM 12,14,12(13)                                               00172000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 00173000
         LA 13,12(13)                                                   00174000
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */ 00175000
         BALR 12,0                                                      00176000
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */ 00177000
         LA 15,*-IGGSEGST(0,0)                                          00178000
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE     0116 00179000
*                                      PROCEDURE                     */ 00180000
         SR 12,15                                                       00181000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 00182000
**   MODULE NAME =  IGGPSMFG (IGG0CLB3)                               * 00183000
**                                                                    * 00184000
**   DESCRIPTIVE NAME =  SMF LOGICAL GET FOR ALTERED RECORDS          * 00185000
**                                                                    * 00186000
**   COPYRIGHT =  NONE                                                * 00187000
**                                                                    * 00188000
**   STATUS =  RELEASE 1, LEVEL 0                                     * 00189000
**                                                                    * 00190000
**   FUNCTION =                                                       * 00191000
**      THIS SUB-FUNCTION WORKS WITH IGGPSMF TO SAVE PORTIONS OF THE  * 00192000
**      OLD CATALOG ENTRY WHICH ARE TO BE ALTERED (FOR WRITING THE    * 00193000
**      ALTER SMF RECORD 63 BY IGGPSMFA).  IT IS CALLED TO SAVE       * 00194000
**      CATALOG ENTRY RECORDS FOR POSSIBLE PRESERVATION (IF FIELDS    * 00195000
**      WITHIN THEM ARE ALTERED).  THE PROCESSING IS AS FOLLOWS:      * 00196000
**      1. CHECK WHETHER SMF PROCESSING SHOULD BE DONE FOR THIS       * 00197000
**         REQUEST.                                                   * 00198000
**      2. FORMAT THE SMF CHAIN, WHICH CONTAINS THE SAVED CATALOG     * 00199000
**         ENTRY RECORDS, IF IT HAS NOT BEEN INITIALIZED.             * 00200000
**      3. SAVE THE INPUT USER CATALOG ENTRY RECORD, GOTTEN BY AN     * 00201000
**         I/O GET, AS A CANDIDATE FOR PRESERVATION, PROVIDED IT IS   * 00202000
**         NOT ALREADY PRESERVED. CALL IGGPSMFZ TO ZERO ANY SECURITY  * 00203000
**         INFORMATION IN THE ENTRY.                                  * 00204000
**      4. CALL IGGPSMFF, IF CORE IS UNAVAILABLE, TO FREE ANY         * 00205000
**         PREVIOUSLY GOTTEN CORE.                                    * 00206000
**                                                                    * 00207000
**   INPUT =                                                          * 00208000
**      IGGCCA INPUT:                                                 * 00209000
**         CCACD1 - NO PROCESSING UNLESS ZERO                         * 00210000
**         CCASMFA - INDICATES WHETHER THIS SMF ROUTINE SHOULD PROCESS* 00211000
**         CCAURAB - POINTS TO THE RAB OF THE CATALOG RECORD TO BE    * 00212000
**                   SAVED. NO PROCESSING IF VOLUME RECORD ID.        * 00213000
**         CCARABF,CCARABL - FIRST, LAST RAB ADDRESSES WITH           * 00214000
**                   USABILITY BIT(CCARBUR) INITIALIZED.              * 00215000
**      SMF RECORD CHAIN                                              * 00216000
**      IEESMCA INPUT:                                                * 00217000
**         SMCADSA,SMCAUSER - NO PROCESSING UNLESS ON                 * 00218000
**                                                                    * 00219000
**   OUTPUT =                                                         * 00220000
**      IGGCCA OUTPUT:                                                * 00221000
**         CCACD1 - USED TO DETECT ERRORS IN THIS ROUTINE. ZERO AT    * 00222000
**                  EXIT.                                             * 00223000
**         CCASMFCD - ERROR RETURN CODE SAVED FROM CCACD1:            * 00224000
**                    RCINSSWA - MAIN CORE STORAGE UNAVAILABLE        * 00225000
**      SMF RECORD CHAIN INITIALIZED, IF PREVIOUSLY NON-EXISTENT      * 00226000
**      SMF RECORD CHAIN INITIALIZED WITH INPUT CATALOG RECORD,       * 00227000
**          IF NOT ALREADY PRESERVED.                                 * 00228000
**                                                                    * 00229000
**                                                                    * 00230000
** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00231000
*                                                                  0117 00232000
*   IF CCASMFA=OFF|CCACD1^=RCS|     /* IF SMF INDICATOR OFF, OR      */ 00233000
*       RCDID=VOLEXTID|RCDID=VOLRCDID|/* ERROR, OR VOLUME ENTRY      */ 00234000
*       CVTSMCA=0|CCASMFCD^=RCS|    /* OR PREVIOUS ERROR, OR         */ 00235000
*       SMCADSA=OFF|SMCAUSER=OFF THEN                              0117 00236000
         TM    CCASMFA(R11),B'00100000'                            0117 00237000
         BZ    @RT00117                                            0117 00238000
         CLI   CCACD1(R11),0                                       0117 00239000
         BNE   @RT00117                                            0117 00240000
         L     @10,CCAURAB(,R11)                                   0117 00241000
         L     @10,CCACPE1(,@10)                                   0117 00242000
         CLI   RCDID(@10),C'W'                                     0117 00243000
         BE    @RT00117                                            0117 00244000
         CLI   RCDID(@10),C'V'                                     0117 00245000
         BE    @RT00117                                            0117 00246000
         L     @10,CVTPTR                                          0117 00247000
         L     @10,CVTSMCA(,@10)                                   0117 00248000
         LTR   @10,@10                                             0117 00249000
         BZ    @RT00117                                            0117 00250000
         CLI   CCASMFCD(R11),0                                     0117 00251000
         BNE   @RT00117                                            0117 00252000
         TM    SMCADSA(@10),B'00010000'                            0117 00253000
         BZ    @RT00117                                            0117 00254000
         TM    SMCAUSER(@10),B'10000000'                           0117 00255000
         BZ    @RT00117                                            0117 00256000
*     ;                             /* NO SMF IN SYSTEM, DONT PROCESS   00257000
*                                      SMF                           */ 00258000
*   ELSE                            /* PROCESS SMF                   */ 00259000
*     DO;                           /* PROCESS SMF FOR ALTER/ UPDATE */ 00260000
*                                                                  0119 00261000
*       /*************************************************************/ 00262000
*       /*                                                           */ 00263000
*       /* TO SAVE RECORDS THAT MAY BE ALTERED, RELATED RECORD AREAS */ 00264000
*       /* IN AN SMF RECORD CHAIN OFF THE IGGCCA MUST BE FORMATTED   */ 00265000
*       /* FOR RABS SUPPLIED BY THE USER.                            */ 00266000
*       /*                                                           */ 00267000
*       /*************************************************************/ 00268000
*                                                                  0120 00269000
*       IF CCASMFPT=0 THEN          /* IF CHAIN NOT INITIALIZED      */ 00270000
         L     @10,CCASMFPT(,R11)                                  0120 00271000
         LTR   @10,@10                                             0120 00272000
         BNZ   @RF00120                                            0120 00273000
*         DO;                       /* FORMAT SMF CHAIN              */ 00274000
*           RFY                                                    0122 00275000
*             R1 RSTD;              /* GETMAIN REG                   */ 00276000
*           CCAMNLEN=LEN3RAB;       /* LENGTH CORE FOR SMF CHAIN     */ 00277000
         MVC   CCAMNLEN(3,R11),@CF00048+1                          0123 00278000
*           R1=ADDR(CCAMSSPL);      /* POINT TO STRG MGMT P.L.       */ 00279000
         LA    R1,CCAMSSPL(,R11)                                   0124 00280000
*           CCAMNSPL=USUBPOOL;      /* STORE SUBPOOL VALUE           */ 00281000
*                                                                  0125 00282000
         MVI   CCAMNSPL(R11),X'FC'                                 0125 00283000
*           /*********************************************************/ 00284000
*           /*                                                       */ 00285000
*           /* ALLOCATE MAIN STORAGE FROM USER SUBPOOL 252           */ 00286000
*           /*                                                       */ 00287000
*           /*********************************************************/ 00288000
*                                                                  0126 00289000
*           GEN(GETMAIN LC,MF=(E,(1)));/* GET MAIN STORAGE SPACE     */ 00290000
         GETMAIN LC,MF=(E,(1))                                          00291000
*           GEN(LR R1,R15);         /* PICK UP RETURN CODE           */ 00292000
         LR R1,R15                                                      00293000
*           IF R1^=NOGETMSE THEN    /* CHECK FOR ERROR RETURN        */ 00294000
*                                                                  0128 00295000
         LTR   R1,R1                                               0128 00296000
         BZ    @RF00128                                            0128 00297000
*             /*******************************************************/ 00298000
*             /*                                                     */ 00299000
*             /* SET CCAMODID='B3', CCAREASN=RSN2, CCARETRN=RCINSSWA */ 00300000
*             /*                                                     */ 00301000
*             /*******************************************************/ 00302000
*                                                                  0129 00303000
*             CCAPROB=IGGSEGID+(RSN2*K256)+RCINSSWA;/* INSUFFICIENT     00304000
*                                      CORE ERROR                    */ 00305000
         MVC   CCAPROB(4,R11),@CF02826                             0129 00306000
*           ELSE                    /* GETMAIN SUCCESSFUL            */ 00307000
*             DO;                                                  0130 00308000
         B     @RC00128                                            0130 00309000
@RF00128 DS    0H                                                  0131 00310000
*               DO;                                                0131 00311000
*                 IF MNATFULL=ON THEN/* TRACKING TABLE FULL          */ 00312000
*                                                                  0132 00313000
         TM    MNATFULL(R11),B'10000000'                           0132 00314000
         BNO   @RF00132                                            0132 00315000
*                   /*************************************************/ 00316000
*                   /*                                               */ 00317000
*                   /* CALL TO MODULE IGG0CLAT                       */ 00318000
*                   /*                                               */ 00319000
*                   /*************************************************/ 00320000
*                                                                  0133 00321000
*Z008ARFS:                                                         0133 00322000
*                   CALL IGGPARFS;  /* YES,CALL SPILL ROUTINE        */ 00323000
Z008ARFS L     @15,@CV00038                                        0133 00324000
         BALR  @14,@15                                             0133 00325000
*                 GEN REFS(CCAMNAT)(MVC CCAMNAT(248,11),CCAMNAT+8(11)); 00326000
@RF00132 DS    0H                                                  0134 00327000
         MVC CCAMNAT(248,11),CCAMNAT+8(11)                              00328000
*                                   /* PUSH AND TRACK                */ 00329000
*               END;                                               0135 00330000
*             END;                  /* GET MAIN STORAGE              */ 00331000
*           RFY                                                    0137 00332000
*             R1 UNRSTD;            /* FREE REG                      */ 00333000
@RC00128 DS    0H                                                  0138 00334000
*           IF CCACD1^=RCS THEN                                    0138 00335000
         CLI   CCACD1(R11),0                                       0138 00336000
         BNE   @RT00138                                            0138 00337000
*             ;                     /* ERROR CHECK                   */ 00338000
*           ELSE                    /* CORE GOTTEN SUCCESSFULLY      */ 00339000
*             DO;                   /* SET UP RELATED RAB ELTS       */ 00340000
*               CCASMFPT=CCAMNADR;  /* POINT FIRST ELT SMF CHAIN     */ 00341000
         L     @10,CCAMNADR(,R11)                                  0141 00342000
         ST    @10,CCASMFPT(,R11)                                  0141 00343000
*               R3=CCAMNADR;        /* POINT FIRST ELT SMF CHAIN     */ 00344000
         LR    R3,@10                                              0142 00345000
*               R2=CCARABF;         /* FIRST RECORD AREA ADDR        */ 00346000
         L     R2,CCARABF(,R11)                                    0143 00347000
*               DO WHILE(R3<LEN3RAB+CCASMFPT);/* INITLZ 3 RELATED RAB   00348000
*                                      ELTS                          */ 00349000
         B     @DE00144                                            0144 00350000
@DL00144 DS    0H                                                  0145 00351000
*                 SMFLAG=(R2-ADDR(CCARAB0))/LENGTH(CCARAB);/* SET  0145 00352000
*                                      RELATED RAB SEQ. NO.          */ 00353000
         LA    @10,20                                              0145 00354000
         LA    @00,CCARAB0(,R11)                                   0145 00355000
         LCR   @00,@00                                             0145 00356000
         ALR   @00,R2                                              0145 00357000
         SRDA  @00,32                                              0145 00358000
         DR    @00,@10                                             0145 00359000
         STC   @01,SMFLAG(,R3)                                     0145 00360000
*                 SMFELTSZ=0;       /* CORE SIZE INITIALLY ZERO      */ 00361000
         SLR   @05,@05                                             0146 00362000
         STCM  @05,3,SMFELTSZ(R3)                                  0146 00363000
*                 SMFCHAIN=R3+LENGTH(SMFELT);/* POINT NEXT ELEMENT   */ 00364000
         LA    @05,512                                             0147 00365000
         LR    @15,R3                                              0147 00366000
         ALR   @15,@05                                             0147 00367000
         STCM  @15,15,SMFCHAIN(R3)                                 0147 00368000
*                 R3=R3+LENGTH(SMFELT);/* ESTABLISH BASE NEXT ELT    */ 00369000
         ALR   R3,@05                                              0148 00370000
*                 RFY                                              0149 00371000
*                   CCARAB BASED(R2);/* MAP RAB                      */ 00372000
*                 R2=R2+LENGTH(CCARAB);/* NEXT RAB                   */ 00373000
         ALR   R2,@10                                              0150 00374000
*                 DO WHILE(CCARBUR=ON&/* SEARCH FOR USABLE RAB       */ 00375000
*                       R2<=CCARABL);/* WITHIN DEFINED RABS          */ 00376000
         B     @DE00151                                            0151 00377000
@DL00151 DS    0H                                                  0152 00378000
*                   R2=R2+LENGTH(CCARAB);/* NEXT RAB                 */ 00379000
         AL    R2,@CF00137                                         0152 00380000
*                 END;              /* END SEARCH                    */ 00381000
@DE00151 TM    CCARBUR(R2),B'10000000'                             0153 00382000
         BNO   @DC00151                                            0153 00383000
         C     R2,CCARABL(,R11)                                    0153 00384000
         BNH   @DL00151                                            0153 00385000
@DC00151 DS    0H                                                  0154 00386000
*               END;                /* END INITLZ                    */ 00387000
@DE00144 LA    @10,1536                                            0154 00388000
         L     @05,CCASMFPT(,R11)                                  0154 00389000
         ALR   @05,@10                                             0154 00390000
         CR    R3,@05                                              0154 00391000
         BL    @DL00144                                            0154 00392000
*               R3=R3-LENGTH(SMFELT);/* POINT LAST ELT IN SMF        */ 00393000
         SL    R3,@CF00050                                         0155 00394000
*               SMFELTSZ=LEN3RAB;   /* CORE SIZE TO BE FREED         */ 00395000
         STCM  @10,3,SMFELTSZ(R3)                                  0156 00396000
*               SMFCHAIN=0;         /* INDICATE LAST ELEMENT         */ 00397000
         SLR   @10,@10                                             0157 00398000
         STCM  @10,15,SMFCHAIN(R3)                                 0157 00399000
*               CCASMFCT=0;         /* COUNT OF PRESERVED RCDS     0158 00400000
*                                      INITIALLY ZERO                */ 00401000
         STH   @10,CCASMFCT(,R11)                                  0158 00402000
*             END;                  /* END SET UP RELATED            */ 00403000
*         END;                      /* END FORMAT SMF CHAIN          */ 00404000
*       ELSE                                                       0161 00405000
*         ;                         /* CHAIN FOR SMF INITLZD         */ 00406000
@RF00120 DS    0H                                                  0162 00407000
*       IF CCACD1^=RCS THEN                                        0162 00408000
@RC00120 CLI   CCACD1(R11),0                                       0162 00409000
         BNE   @RT00162                                            0162 00410000
*         ;                         /* ERROR CHECK                   */ 00411000
*       ELSE                        /* NO ERROR                      */ 00412000
*         DO;                       /* CONTINUE SMF                  */ 00413000
*                                                                  0164 00414000
*           /*********************************************************/ 00415000
*           /*                                                       */ 00416000
*           /* DETERMINE WHETHER THE INPUT USER RECORD IS ALREADY    */ 00417000
*           /* PRESERVED, BY SEARCHING THE SMF CHAIN                 */ 00418000
*           /*                                                       */ 00419000
*           /*********************************************************/ 00420000
*                                                                  0165 00421000
*           RFY                                                    0165 00422000
*             CCARAB BASED(CCAURAB);/* ORIGINAL MAP                  */ 00423000
*           R3=CCASMFPT;            /* FIRST ELT SMF CHAIN           */ 00424000
         L     R3,CCASMFPT(,R11)                                   0166 00425000
*           DO WHILE(R3^=0&         /* SEARCH CHAIN FOR              */ 00426000
*                 ^(R3->RCDCINO=RCDCINO&SMFPRES=ON));/* PRESERVED  0167 00427000
*                                      RECORD                        */ 00428000
         B     @DE00167                                            0167 00429000
@DL00167 DS    0H                                                  0168 00430000
*             R3=SMFCHAIN;          /* GET NEXT RELATED RAB          */ 00431000
         ICM   R3,15,SMFCHAIN(R3)                                  0168 00432000
*           END;                    /* END SEARCH                    */ 00433000
*                                                                  0169 00434000
@DE00167 LTR   R3,R3                                               0169 00435000
         BZ    @DC00167                                            0169 00436000
         L     @10,CCAURAB(,R11)                                   0169 00437000
         L     @10,CCACPE1(,@10)                                   0169 00438000
         CLC   RCDCINO(3,R3),RCDCINO(@10)                          0169 00439000
         BNE   @DL00167                                            0169 00440000
         TM    SMFPRES(R3),B'10000000'                             0169 00441000
         BNO   @DL00167                                            0169 00442000
@DC00167 DS    0H                                                  0170 00443000
*           /*********************************************************/ 00444000
*           /*                                                       */ 00445000
*           /* ESTABLISH THE RELATED RECORD AREA IN THE SMF CHAIN    */ 00446000
*           /* THAT CORRESPONDS TO THE RAB OF THE USER INPUT RECORD  */ 00447000
*           /*                                                       */ 00448000
*           /*********************************************************/ 00449000
*                                                                  0170 00450000
*           RFY                                                    0170 00451000
*             SMFELT BASED(R4);     /* CHANGE ELT BASE FOR     SEARCH*/ 00452000
*           R2=(CCAURAB-ADDR(CCARAB0))/LENGTH(CCARAB);/* GET RELATIVE   00453000
*                                      RAB SEQUENCE NO.              */ 00454000
         LA    R2,CCARAB0(,R11)                                    0171 00455000
         LR    @00,R2                                              0171 00456000
         LCR   @00,@00                                             0171 00457000
         AL    @00,CCAURAB(,R11)                                   0171 00458000
         SRDA  @00,32                                              0171 00459000
         D     @00,@CF00137                                        0171 00460000
         LR    R2,@01                                              0171 00461000
*           R4=CCASMFPT;            /* FIRST ELT SMF CHAIN           */ 00462000
         L     R4,CCASMFPT(,R11)                                   0172 00463000
*           DO WHILE(R4^=0&         /* SEARCH CHAIN FOR RELATED      */ 00464000
*                 ^(R2=(SMFLAG&RELBITS)));/* RAB                     */ 00465000
         B     @DE00173                                            0173 00466000
@DL00173 DS    0H                                                  0174 00467000
*             R4=SMFCHAIN;          /* GET NEXT ELT                  */ 00468000
         ICM   R4,15,SMFCHAIN(R4)                                  0174 00469000
*           END;                    /* END SEARCH                    */ 00470000
@DE00173 LTR   R4,R4                                               0175 00471000
         BZ    @DC00173                                            0175 00472000
         LA    @10,15                                              0175 00473000
         SLR   @05,@05                                             0175 00474000
         IC    @05,SMFLAG(,R4)                                     0175 00475000
         NR    @10,@05                                             0175 00476000
         CR    R2,@10                                              0175 00477000
         BNE   @DL00173                                            0175 00478000
@DC00173 DS    0H                                                  0176 00479000
*           IF R4=0 THEN            /* IF RELATED RAB NOT FOUND      */ 00480000
         LTR   R4,R4                                               0176 00481000
         BNZ   @RF00176                                            0176 00482000
*             CALL EXIT;            /* RETURN TO CALLER              */ 00483000
         BAL   @14,EXIT                                            0177 00484000
*           ELSE                                                   0178 00485000
*             ;                     /* FOUND RELATED RAB             */ 00486000
*                                                                  0178 00487000
@RF00176 DS    0H                                                  0179 00488000
*           /*********************************************************/ 00489000
*           /*                                                       */ 00490000
*           /* IF THE RECORD HAS ALREADY BEEN PRESERVED, THEN ANY    */ 00491000
*           /* RECORD IN THE RELATED RECORD AREA IS NO LONGER        */ 00492000
*           /* CANDIDATE FOR PRESERVATION                            */ 00493000
*           /*                                                       */ 00494000
*           /*********************************************************/ 00495000
*                                                                  0179 00496000
*           IF R3^=0 THEN           /* IF RECORD HAS ALREADY BEEN  0179 00497000
*                                      PRESERVED                     */ 00498000
         LTR   R3,R3                                               0179 00499000
         BZ    @RF00179                                            0179 00500000
*             SMFCAND=OFF;          /* INDICATE LAST RECORD SAVED,NO    00501000
*                                      LONGER CAND                   */ 00502000
         NI    SMFCAND(R4),B'10111111'                             0180 00503000
*           ELSE                    /* RECORD IS CANDIDATE FOR     0181 00504000
*                                      PRESERVATION                  */ 00505000
*             DO;                   /* SAVE RECORD FOR POSSIBLE    0181 00506000
*                                      PRESERVATION                  */ 00507000
*                                                                  0181 00508000
         B     @RC00179                                            0181 00509000
@RF00179 DS    0H                                                  0182 00510000
*               /*****************************************************/ 00511000
*               /*                                                   */ 00512000
*               /* IF THE RELATED RECORD AREA ALREADY HAS A PRESERVED*/ 00513000
*               /* RECORD FROM BEFORE, THEN PUT IT AT BOTTOM OF SMF  */ 00514000
*               /* CHAIN BEFORE SAVING INPUT USER RECORD - ISSUE     */ 00515000
*               /* GETMS TO CREATE NEW SMF CHAIN ELEMENT             */ 00516000
*               /*                                                   */ 00517000
*               /*****************************************************/ 00518000
*                                                                  0182 00519000
*               IF SMFPRES=ON THEN  /* IF RELATED RAB ALREADY      0182 00520000
*                                      CONTAINS PRESERVED RCD        */ 00521000
         TM    SMFPRES(R4),B'10000000'                             0182 00522000
         BNO   @RF00182                                            0182 00523000
*                 DO;               /* MOVE PRESERVED RCD ONTO BOTTOM   00524000
*                                      OF SMF CHAIN                  */ 00525000
*                   RFY                                            0184 00526000
*                     SMFELT BASED(R3);/* ORIGINAL BASE              */ 00527000
*                   R3=CCASMFPT;    /* FIRST ELT SMF CHAIN           */ 00528000
         L     R3,CCASMFPT(,R11)                                   0185 00529000
*                   DO WHILE(R3^=0);/* SEARCH FOR LAST ELT           */ 00530000
         B     @DE00186                                            0186 00531000
@DL00186 DS    0H                                                  0187 00532000
*                     R2=R3;        /* SAVE LAST ELT ADDR            */ 00533000
         LR    R2,R3                                               0187 00534000
*                     R3=SMFCHAIN;  /* GET NEXT ELT ADDR             */ 00535000
         ICM   R3,15,SMFCHAIN(R3)                                  0188 00536000
*                   END;            /* END SEARCH                    */ 00537000
@DE00186 LTR   R3,R3                                               0189 00538000
         BNZ   @DL00186                                            0189 00539000
*                   RFY                                            0190 00540000
*                     R1 RSTD;      /* GET MAIN REG                  */ 00541000
*                   CCAMNLEN=LENGTH(SMFELT);/* CORE LENGTH           */ 00542000
         MVC   CCAMNLEN(3,R11),@CF00050+1                          0191 00543000
*                   R1=ADDR(CCAMSSPL);/* POINT TO STRG MGMT P.L.     */ 00544000
         LA    R1,CCAMSSPL(,R11)                                   0192 00545000
*                   CCAMNSPL=USUBPOOL;/* STORE SUBPOOL VALUE         */ 00546000
*                                                                  0193 00547000
         MVI   CCAMNSPL(R11),X'FC'                                 0193 00548000
*                   /*************************************************/ 00549000
*                   /*                                               */ 00550000
*                   /* ALLOCATE MAIN STORAGE FROM USER SUBPOOL 252   */ 00551000
*                   /*                                               */ 00552000
*                   /*************************************************/ 00553000
*                                                                  0194 00554000
*                   GEN(GETMAIN LC,MF=(E,(1)));/* GET MAIN STORAGE 0194 00555000
*                                      SPACE                         */ 00556000
         GETMAIN LC,MF=(E,(1))                                          00557000
*                   GEN(LR R1,R15); /* PICK UP RETURN CODE           */ 00558000
         LR R1,R15                                                      00559000
*                   IF R1^=NOGETMSE THEN/* CHECK FOR ERROR RETURN    */ 00560000
*                                                                  0196 00561000
         LTR   R1,R1                                               0196 00562000
         BZ    @RF00196                                            0196 00563000
*                     /***********************************************/ 00564000
*                     /*                                             */ 00565000
*                     /* SET CCAMODID='B3', CCAREASN=RSN2,           */ 00566000
*                     /* CCARETRN=RCINSSWA                           */ 00567000
*                     /*                                             */ 00568000
*                     /***********************************************/ 00569000
*                                                                  0197 00570000
*                     CCAPROB=IGGSEGID+(RSN2*K256)+RCINSSWA;/*     0197 00571000
*                                      INSUFFICIENT CORE ERROR       */ 00572000
         MVC   CCAPROB(4,R11),@CF02826                             0197 00573000
*                   ELSE            /* GETMAIN SUCCESSFUL            */ 00574000
*                     DO;                                          0198 00575000
         B     @RC00196                                            0198 00576000
@RF00196 DS    0H                                                  0199 00577000
*                       DO;                                        0199 00578000
*                         IF MNATFULL=ON THEN/* TRACKING TABLE FULL  */ 00579000
*                                                                  0200 00580000
         TM    MNATFULL(R11),B'10000000'                           0200 00581000
         BNO   @RF00200                                            0200 00582000
*                           /*****************************************/ 00583000
*                           /*                                       */ 00584000
*                           /* CALL TO MODULE IGG0CLAT               */ 00585000
*                           /*                                       */ 00586000
*                           /*****************************************/ 00587000
*                                                                  0201 00588000
*Z012ARFS:                                                         0201 00589000
*                           CALL IGGPARFS;/* YES,CALL SPILL ROUTINE  */ 00590000
Z012ARFS L     @15,@CV00038                                        0201 00591000
         BALR  @14,@15                                             0201 00592000
*                         GEN REFS(CCAMNAT)                        0202 00593000
*                             (MVC CCAMNAT(248,11),CCAMNAT+8(11));/*    00594000
*                                      PUSH AND TRACK                */ 00595000
@RF00200 DS    0H                                                  0202 00596000
         MVC CCAMNAT(248,11),CCAMNAT+8(11)                              00597000
*                       END;                                       0203 00598000
*                     END;          /* GET MAIN STORAGE              */ 00599000
*                   RFY                                            0205 00600000
*                     R1 UNRSTD;    /* FREE REG                      */ 00601000
@RC00196 DS    0H                                                  0206 00602000
*                   IF CCACD1^=RCS THEN                            0206 00603000
         CLI   CCACD1(R11),0                                       0206 00604000
         BNE   @RT00206                                            0206 00605000
*                     ;             /* CHECK FOR ERROR               */ 00606000
*                   ELSE            /* NO ERROR                      */ 00607000
*                     DO;           /* CREATE NEW ELT ONTO SMF CHAIN */ 00608000
*                       RFY                                        0209 00609000
*                         SMFELT BASED(R2);/* MAP LAST ELT OF CHAIN  */ 00610000
*                       SMFCHAIN=CCAMNADR;/* POINT TO ADDED ELT      */ 00611000
         L     @10,CCAMNADR(,R11)                                  0210 00612000
         STCM  @10,15,SMFCHAIN(R2)                                 0210 00613000
*                       RFY                                        0211 00614000
*                         SMFELT BASED(CCAMNADR);/* MAP ADDED ELT    */ 00615000
*                       SMFELT(1:MXM)=SMFELT1(1:MXM);/* MOVE       0212 00616000
*                                      PRESERVED RECORD              */ 00617000
         MVC   SMFELT(256,@10),SMFELT1(R4)                         0212 00618000
*                       SMFELT(MXM+1:LENGTH(SMFELT))=/* MOVE REST OF */ 00619000
*                           SMFELT1(MXM+1:LENGTH(SMFELT));/*       0213 00620000
*                                      PRESERVED RCD                 */ 00621000
         MVC   SMFELT+256(256,@10),SMFELT1+256(R4)                 0213 00622000
*                       SMFELTSZ=LENGTH(SMFELT);/* SET CORE SIZE     */ 00623000
         MVC   SMFELTSZ(2,@10),@CH00050                            0214 00624000
*                       SMFCHAIN=0; /* LAST ELEMENT                  */ 00625000
         SLR   @05,@05                                             0215 00626000
         STCM  @05,15,SMFCHAIN(@10)                                0215 00627000
*                       SMFLAG=0;   /* ZERO FLAG                     */ 00628000
         MVI   SMFLAG(@10),X'00'                                   0216 00629000
*                       SMFPRES=ON; /* SET PRESERVED RECORD          */ 00630000
         OI    SMFPRES(@10),B'10000000'                            0217 00631000
*                     END;          /* END CREATE                    */ 00632000
*                 END;              /* END MOVE                      */ 00633000
*               ELSE                                               0220 00634000
*                 ;                 /* NOT CONTAIN PRESERVED RCD     */ 00635000
@RF00182 DS    0H                                                  0221 00636000
*               IF CCACD1^=RCS THEN                                0221 00637000
@RC00182 CLI   CCACD1(R11),0                                       0221 00638000
         BNE   @RT00221                                            0221 00639000
*                 ;                 /* CHECK ERROR                   */ 00640000
*               ELSE                /* NO ERROR                      */ 00641000
*                 DO;               /* SAVE RCD                      */ 00642000
*                   RFY                                            0224 00643000
*                     SMFELT BASED(R4);/* MAP RELATED RAB            */ 00644000
*                   RFY                                            0225 00645000
*                     SMFELT1 BASED(CCACPE1);/* MAP RECORD TO BE   0225 00646000
*                                      SAVED                         */ 00647000
*                   SMFELT(1:MXM)=SMFELT1(1:MXM);/* SAVE RECORD      */ 00648000
         L     @10,CCAURAB(,R11)                                   0226 00649000
         L     @10,CCACPE1(,@10)                                   0226 00650000
         MVC   SMFELT(256,R4),SMFELT1(@10)                         0226 00651000
*                   SMFELT(MXM+1:LENGTH(SMFRCD))=/* SAVE REST OF   0227 00652000
*                                      RECORD                        */ 00653000
*                       SMFELT1(MXM+1:LENGTH(SMFRCD));             0227 00654000
         MVC   SMFELT+256(249,R4),SMFELT1+256(@10)                 0227 00655000
*                   RFY                                            0228 00656000
*                     R1 RSTD;      /* INPUT REG FOR SMFZ            */ 00657000
*                   R1=ADDR(SMFELT);/* POINT TO RCD WITH POSSIBLE  0229 00658000
*                                      PSWD INFO                     */ 00659000
*                                                                  0229 00660000
         LR    R1,R4                                               0229 00661000
*                   /*************************************************/ 00662000
*                   /*                                               */ 00663000
*                   /* CALL TO MODULE IGG0CLBV                       */ 00664000
*                   /*                                               */ 00665000
*                   /*************************************************/ 00666000
*                                                                  0230 00667000
*Z013SMFZ:                                                         0230 00668000
*                   CALL IGGPSMFZ;  /* ZERO ANY SECURITY INFO        */ 00669000
Z013SMFZ L     @15,@CV00037                                        0230 00670000
         BALR  @14,@15                                             0230 00671000
*                   RFY                                            0231 00672000
*                     R1 UNRSTD;    /* FREE REG                      */ 00673000
*                   SMFCAND=ON;     /* INDICATE CANDIDATE            */ 00674000
*                   SMFPRES=OFF;    /* NOT PRESERVED                 */ 00675000
         OI    SMFCAND(R4),B'01000000'                             0233 00676000
         NI    SMFPRES(R4),B'01111111'                             0233 00677000
*                 END;              /* END SAVE RCD                  */ 00678000
*             END;                  /* END SAVE RECORD               */ 00679000
@RT00221 DS    0H                                                  0236 00680000
*         END;                      /* END CONTINUE SMF              */ 00681000
@RC00179 DS    0H                                                  0237 00682000
*       IF CCACD1^=RCS THEN         /* IF ERROR                      */ 00683000
@RT00162 CLI   CCACD1(R11),0                                       0237 00684000
         BE    @RF00237                                            0237 00685000
*         DO;                       /* FREE CORE                     */ 00686000
*           CCASMFP=IGGSEGID+CCACD1*K256+RCSMFER;/* SET ERR  @Y30SSRS*/ 00687000
*                                                                  0239 00688000
         SLR   @10,@10                                             0239 00689000
         IC    @10,CCACD1(,R11)                                    0239 00690000
         SLA   @10,8                                               0239 00691000
         AL    @10,@CF02829                                        0239 00692000
         ST    @10,CCASMFP(,R11)                                   0239 00693000
*           /*********************************************************/ 00694000
*           /*                                                       */ 00695000
*           /* CLEAR CCAMODID, CCAREASN, AND CCARETRN                */ 00696000
*           /*                                                       */ 00697000
*           /*********************************************************/ 00698000
*                                                                  0240 00699000
*           CCAPROB=IGNOREIT;       /* INDICATE NO ERROR     @Y30SSRS*/ 00700000
         SLR   @10,@10                                             0240 00701000
         ST    @10,CCAPROB(,R11)                                   0240 00702000
*         END;                      /* END FREE                      */ 00703000
*       ELSE                                                       0242 00704000
*         ;                         /* NO ERROR                      */ 00705000
@RF00237 DS    0H                                                  0243 00706000
*     END;                          /* END UPDATE                    */ 00707000
*   RFY                                                            0244 00708000
*     SMFELT BASED(R3);             /* ORIGINAL BASE                 */ 00709000
@RT00117 DS    0H                                                  0245 00710000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 00711000
         BAL   @14,EXIT                                            0245 00712000
*   END;                            /* END OF INNER PROCEDURE        */ 00713000
@EL00003 DS    0H                                                  0246 00714000
@EF00003 DS    0H                                                  0246 00715000
@ER00003 BR    @14                                                 0246 00716000
@PB00003 DS    0H                                                  0247 00717000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 00718000
         EJECT                                                          00719000
*                                                                  0248 00720000
*/********************************************************************/ 00721000
*/*                                                                  */ 00722000
*/*         RETURN-TO-CALLER  PROCEDURE-EXITING  SUBFUNCTION         */ 00723000
*/*                                                                  */ 00724000
*/********************************************************************/ 00725000
*                                                                  0248 00726000
*EXIT:                                                             0248 00727000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 00728000
         B     @PB00004                                            0248 00729000
EXIT     DS    0H                                                  0249 00730000
*   GEN(LM 12,14,0(13));            /* RESTORE REGISTERS OF CALLER   */ 00731000
         LM 12,14,0(13)                                                 00732000
*   GEN(MVI 12(13),255);            /* MARK END OF PDL               */ 00733000
         MVI 12(13),255                                                 00734000
*   GEN(BR 14);                     /* RETURN TO CALLER              */ 00735000
         BR 14                                                          00736000
*PATCH:                                                            0252 00737000
*   GEN(DC (12+((*+139-@MAINENT)/140))A(0));/* PATCH AREA            */ 00738000
PATCH    DC (12+((*+139-@MAINENT)/140))A(0)                             00739000
*   END;                            /* END OF EXIT PROCEDURE         */ 00740000
@EL00004 DS    0H                                                  0253 00741000
@EF00004 DS    0H                                                  0253 00742000
@ER00004 BR    @14                                                 0253 00743000
*   END                             /* END PROCEDURE                 */ 00744000
*                                                                  0254 00745000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00746000
*/*%INCLUDE SYSLIB  (IGGMCDCL)                                       */ 00747000
*/*%INCLUDE SYSLIB  (IGGMCTRC)                                       */ 00748000
*/*%INCLUDE SYSLIB  (IGGCCA  )                                       */ 00749000
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */ 00750000
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                       */ 00751000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00752000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00753000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00754000
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */ 00755000
*/*%INCLUDE SYSLIB  (AMCBS   )                                       */ 00756000
*/*%INCLUDE SYSLIB  (IGGCAXWA)                                       */ 00757000
*/*%INCLUDE SYSLIB  (IEZCTGFV)                                       */ 00758000
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                       */ 00759000
*/*%INCLUDE SYSLIB  (IEZCTGVL)                                       */ 00760000
*/*%INCLUDE SYSLIB  (IEZCTGCV)                                       */ 00761000
*/*%INCLUDE SYSLIB  (IEESMCA )                                       */ 00762000
*                                                                  0254 00763000
*       ;                                                          0254 00764000
@EL00001 DS    0H                                                  0254 00765000
@EF00001 DS    0H                                                  0254 00766000
@ER00001 BR    @14                                                 0254 00767000
@DATA    DS    0H                                                       00768000
@DATD    DSECT                                                          00769000
         DS    0F                                                       00770000
IGG0CLB3 CSECT                                                          00771000
         DS    0F                                                       00772000
@CF00137 DC    F'20'                                                    00773000
@CF00050 DC    F'512'                                                   00774000
@CH00050 EQU   @CF00050+2                                               00775000
@CF00048 DC    F'1536'                                                  00776000
@CF02829 DC    F'-1024261912'                                           00777000
@CF02826 DC    F'-1024261468'                                           00778000
@DATD    DSECT                                                          00779000
         DS    0D                                                       00780000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00781000
@ENDDATD EQU   *                                                        00782000
IGG0CLB3 CSECT                                                          00783000
         DS    0F                                                       00784000
@SIZDATD DC    AL1(0)                                                   00785000
         DC    AL3(@ENDDATD-@DATD)                                      00786000
@CV00037 DC    V(IGGPSMFZ)                                              00787000
@CV00038 DC    V(IGGPARFS)                                              00788000
@CV00036 DC    V(IGGPSMFF)                                              00789000
         DS    0D                                                       00790000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00791000
@01      EQU   01                                                       00792000
@02      EQU   02                                                       00793000
@03      EQU   03                                                       00794000
@04      EQU   04                                                       00795000
@05      EQU   05                                                       00796000
@06      EQU   06                                                       00797000
@07      EQU   07                                                       00798000
@08      EQU   08                                                       00799000
@09      EQU   09                                                       00800000
@10      EQU   10                                                       00801000
@11      EQU   11                                                       00802000
@12      EQU   12                                                       00803000
@13      EQU   13                                                       00804000
@14      EQU   14                                                       00805000
@15      EQU   15                                                       00806000
IGGSEGBR EQU   @12                                                      00807000
R4       EQU   @04                                                      00808000
R3       EQU   @03                                                      00809000
RWA      EQU   @02                                                      00810000
R1       EQU   @01                                                      00811000
R2       EQU   @02                                                      00812000
R5       EQU   @05                                                      00813000
R6       EQU   @06                                                      00814000
R7       EQU   @07                                                      00815000
R8       EQU   @08                                                      00816000
R9       EQU   @09                                                      00817000
R10      EQU   @10                                                      00818000
R11      EQU   @11                                                      00819000
R12      EQU   @12                                                      00820000
RET      EQU   @14                                                      00821000
RFLD     EQU   @04                                                      00822000
RGO      EQU   @15                                                      00823000
RNDX     EQU   @03                                                      00824000
RP0      EQU   @00                                                      00825000
RP1      EQU   @01                                                      00826000
RSAVE    EQU   @13                                                      00827000
RWK1     EQU   @06                                                      00828000
RWK2     EQU   @07                                                      00829000
RWK3     EQU   @08                                                      00830000
RWK4     EQU   @09                                                      00831000
RZERO    EQU   @00                                                      00832000
R0       EQU   @00                                                      00833000
R13      EQU   @13                                                      00834000
R14      EQU   @14                                                      00835000
R15      EQU   @15                                                      00836000
WKR2     EQU   @02                                                      00837000
WKR3     EQU   @03                                                      00838000
WKR4     EQU   @04                                                      00839000
CVTPTR   EQU   16                                                       00840000
PSA      EQU   0                                                        00841000
FLCRNPSW EQU   PSA                                                      00842000
FLCROPSW EQU   PSA+8                                                    00843000
FLCICCW2 EQU   PSA+16                                                   00844000
PSAEEPSW EQU   PSA+132                                                  00845000
PSAESPSW EQU   PSA+136                                                  00846000
FLCSVILC EQU   PSAESPSW+1                                               00847000
PSAEPPSW EQU   PSA+140                                                  00848000
FLCPIILC EQU   PSAEPPSW+1                                               00849000
FLCPICOD EQU   PSAEPPSW+2                                               00850000
PSAPICOD EQU   FLCPICOD+1                                               00851000
FLCTEA   EQU   PSAEPPSW+4                                               00852000
FLCPER   EQU   PSA+152                                                  00853000
FLCMCLA  EQU   PSA+168                                                  00854000
FLCIOEL  EQU   FLCMCLA+4                                                00855000
FLCIOA   EQU   FLCMCLA+16                                               00856000
FLCFSA   EQU   FLCMCLA+80                                               00857000
PSASUPER EQU   PSA+552                                                  00858000
PSASUP1  EQU   PSASUPER                                                 00859000
PSASUP2  EQU   PSASUPER+1                                               00860000
PSASUP3  EQU   PSASUPER+2                                               00861000
PSASUP4  EQU   PSASUPER+3                                               00862000
PSACLHT  EQU   PSA+640                                                  00863000
PSALKSA  EQU   PSA+696                                                  00864000
PSAHLHI  EQU   PSA+760                                                  00865000
PSADSSFL EQU   PSA+836                                                  00866000
PSADSSF1 EQU   PSADSSFL                                                 00867000
PSADSSF3 EQU   PSADSSFL+2                                               00868000
PSADSSF4 EQU   PSADSSFL+3                                               00869000
PSARSVT  EQU   PSA+896                                                  00870000
SMFELT1  EQU   0                                                        00871000
SMFELT   EQU   0                                                        00872000
SMFRCD   EQU   SMFELT                                                   00873000
SMFCNTRL EQU   SMFELT+505                                               00874000
SMFLAG   EQU   SMFCNTRL                                                 00875000
SMFPRES  EQU   SMFLAG                                                   00876000
SMFCAND  EQU   SMFLAG                                                   00877000
SMFELTSZ EQU   SMFCNTRL+1                                               00878000
SMFCHAIN EQU   SMFCNTRL+3                                               00879000
IGGCCA   EQU   0                                                        00880000
CCAPROB  EQU   IGGCCA+4                                                 00881000
CCAERRCD EQU   CCAPROB+2                                                00882000
CCAREASN EQU   CCAERRCD                                                 00883000
CCARETRN EQU   CCAERRCD+1                                               00884000
CCACD1   EQU   CCARETRN                                                 00885000
CCAFLG1  EQU   IGGCCA+14                                                00886000
CCAFLG2  EQU   IGGCCA+15                                                00887000
CCAF2COB EQU   CCAFLG2                                                  00888000
CCAFLG3  EQU   IGGCCA+16                                                00889000
CCAFLG4  EQU   IGGCCA+17                                                00890000
CCAFLG5  EQU   IGGCCA+18                                                00891000
CCAFLG6  EQU   IGGCCA+19                                                00892000
CCATCB   EQU   IGGCCA+20                                                00893000
CCARB    EQU   IGGCCA+24                                                00894000
CCACPL   EQU   IGGCCA+28                                                00895000
CCAACB   EQU   IGGCCA+32                                                00896000
CCAURAB  EQU   IGGCCA+40                                                00897000
CCASRCH  EQU   IGGCCA+44                                                00898000
CCASRID  EQU   CCASRCH                                                  00899000
CCARAB0  EQU   IGGCCA+88                                                00900000
CCAR0FLG EQU   CCARAB0                                                  00901000
CCAR0SEG EQU   CCARAB0+8                                                00902000
CCARAB1  EQU   IGGCCA+108                                               00903000
CCAR1FLG EQU   CCARAB1                                                  00904000
CCAR1SEG EQU   CCARAB1+8                                                00905000
CCARAB2  EQU   IGGCCA+128                                               00906000
CCAR2FLG EQU   CCARAB2                                                  00907000
CCAR2SEG EQU   CCARAB2+8                                                00908000
CCARAB3  EQU   IGGCCA+148                                               00909000
CCAR3FLG EQU   CCARAB3                                                  00910000
CCAR3SEG EQU   CCARAB3+8                                                00911000
CCARAB4  EQU   IGGCCA+168                                               00912000
CCAR4FLG EQU   CCARAB4                                                  00913000
CCAR4SEG EQU   CCARAB4+8                                                00914000
CCARAB5  EQU   IGGCCA+188                                               00915000
CCAR5FLG EQU   CCARAB5                                                  00916000
CCAR5SEG EQU   CCARAB5+8                                                00917000
CCATIQRN EQU   IGGCCA+212                                               00918000
CCADESA  EQU   IGGCCA+224                                               00919000
CCAEXTDE EQU   CCADESA+4                                                00920000
CCAEXTAD EQU   CCAEXTDE+2                                               00921000
CCAEQDQ  EQU   IGGCCA+280                                               00922000
CCAEDOPT EQU   CCAEQDQ+2                                                00923000
CCAMSSPL EQU   IGGCCA+300                                               00924000
CCAMNSPL EQU   CCAMSSPL+9                                               00925000
CCACMS   EQU   IGGCCA+316                                               00926000
CCACPE5  EQU   IGGCCA+324                                               00927000
CCACPE6  EQU   IGGCCA+340                                               00928000
CCACPE61 EQU   IGGCCA+344                                               00929000
CCACPE7  EQU   IGGCCA+348                                               00930000
CCAFLPT  EQU   IGGCCA+364                                               00931000
CCADICT  EQU   IGGCCA+372                                               00932000
CCAXCPL  EQU   IGGCCA+376                                               00933000
CCARABF  EQU   IGGCCA+384                                               00934000
CCARABL  EQU   IGGCCA+388                                               00935000
CCALREL  EQU   IGGCCA+396                                               00936000
CCASN    EQU   IGGCCA+398                                               00937000
CCARBA   EQU   IGGCCA+448                                               00938000
CCACRAVL EQU   CCARBA                                                   00939000
CCACRADT EQU   CCARBA+6                                                 00940000
CCATLNG  EQU   IGGCCA+468                                               00941000
CCAIDPT3 EQU   IGGCCA+480                                               00942000
CCAGRGC  EQU   IGGCCA+493                                               00943000
CCAGRHI  EQU   IGGCCA+494                                               00944000
CCASSEQ  EQU   CCAGRHI                                                  00945000
CCASMFPT EQU   IGGCCA+544                                               00946000
CCAFLG7  EQU   IGGCCA+552                                               00947000
CCASMFA  EQU   CCAFLG7                                                  00948000
CCAFLG8  EQU   IGGCCA+553                                               00949000
CCAFLG9  EQU   IGGCCA+554                                               00950000
CCASMFCT EQU   IGGCCA+560                                               00951000
CCASMFLG EQU   IGGCCA+562                                               00952000
CCASMFG1 EQU   CCASMFLG                                                 00953000
CCASMFUC EQU   CCASMFG1                                                 00954000
CCASMFSR EQU   CCASMFG1                                                 00955000
CCABMINP EQU   IGGCCA+684                                               00956000
CCABMFLG EQU   CCABMINP+6                                               00957000
CCABMOUT EQU   IGGCCA+692                                               00958000
CCABMOFG EQU   CCABMOUT+4                                               00959000
CCATEMPS EQU   IGGCCA+744                                               00960000
CCAMNCAT EQU   IGGCCA+784                                               00961000
CCAMNAT  EQU   CCAMNCAT                                                 00962000
MNATTOP  EQU   CCAMNAT                                                  00963000
MNATFULL EQU   MNATTOP                                                  00964000
MNATFLGS EQU   CCAMNAT+240                                              00965000
CCAMNLEN EQU   CCAMNCAT+249                                             00966000
CCAMNADR EQU   CCAMNCAT+252                                             00967000
CCAARFWA EQU   IGGCCA+1040                                              00968000
ARFGMLEN EQU   CCAARFWA                                                 00969000
CCARVFG1 EQU   IGGCCA+1056                                              00970000
CCAREGS  EQU   IGGCCA+1060                                              00971000
CCABZSAV EQU   IGGCCA+1408                                              00972000
CCARALSA EQU   IGGCCA+1440                                              00973000
CCAFLG10 EQU   IGGCCA+1444                                              00974000
CCASMFP  EQU   IGGCCA+1480                                              00975000
CCASMFCD EQU   CCASMFP+3                                                00976000
CCAPROBX EQU   IGGCCA+1484                                              00977000
CCAERCDX EQU   CCAPROBX+2                                               00978000
CTGPL    EQU   0                                                        00979000
CTGOPTN1 EQU   CTGPL                                                    00980000
CTGOPTN2 EQU   CTGPL+1                                                  00981000
CTGEXT   EQU   CTGOPTN2                                                 00982000
CTGERASE EQU   CTGOPTN2                                                 00983000
CTGSMF   EQU   CTGERASE                                                 00984000
CTGREL   EQU   CTGSMF                                                   00985000
CTGPURG  EQU   CTGOPTN2                                                 00986000
CTGVMNT  EQU   CTGPURG                                                  00987000
CTGOPTN3 EQU   CTGPL+2                                                  00988000
CTGOPTN4 EQU   CTGPL+3                                                  00989000
CTGENT   EQU   CTGPL+4                                                  00990000
CTGFVT   EQU   CTGENT                                                   00991000
CTGCAT   EQU   CTGPL+8                                                  00992000
CTGCVOL  EQU   CTGCAT                                                   00993000
CTGWKA   EQU   CTGPL+12                                                 00994000
CTGDSORG EQU   CTGPL+16                                                 00995000
CTGDDNM  EQU   CTGPL+20                                                 00996000
CTGNEWNM EQU   CTGDDNM                                                  00997000
CTGFBFLG EQU   CTGNEWNM+2                                               00998000
CTGJSCB  EQU   CTGPL+24                                                 00999000
CTGFL    EQU   0                                                        01000000
CTGFLDGC EQU   CTGFL+2                                                  01001000
CTGFLDRE EQU   CTGFL+3                                                  01002000
CTGFLDWA EQU   CTGFL+4                                                  01003000
CTGFLDNM EQU   CTGFL+8                                                  01004000
CTGFLDAT EQU   CTGFL+16                                                 01005000
USERWKA  EQU   0                                                        01006000
WKA      EQU   USERWKA+4                                                01007000
ENTNAMES EQU   WKA                                                      01008000
DICTENT  EQU   0                                                        01009000
DICTFLGS EQU   DICTENT                                                  01010000
DIC2ENT  EQU   0                                                        01011000
DIC2FLGS EQU   DIC2ENT                                                  01012000
CCARAB   EQU   0                                                        01013000
CCARABFL EQU   CCARAB                                                   01014000
CCARBUR  EQU   CCARABFL                                                 01015000
CCACPE1  EQU   CCARAB+4                                                 01016000
CCACPE2  EQU   CCARAB+8                                                 01017000
CATGOPT  EQU   0                                                        01018000
CATGOCI  EQU   CATGOPT                                                  01019000
CATGOFLG EQU   CATGOCI                                                  01020000
CATGOGC1 EQU   CATGOPT+3                                                01021000
CATGOSEQ EQU   CATGOPT+4                                                01022000
CATRCD   EQU   0                                                        01023000
RCDCINO  EQU   CATRCD+1                                                 01024000
RCDID    EQU   CATRCD+44                                                01025000
REPCNTRL EQU   0                                                        01026000
EXTRCDPT EQU   REPCNTRL                                                 01027000
VARFIELD EQU   0                                                        01028000
CNTRLINF EQU   0                                                        01029000
CVTMAP   EQU   0                                                        01030000
CVTTCBP  EQU   CVTMAP                                                   01031000
CVTDAR   EQU   CVTMAP+72                                                01032000
CVTFLGS1 EQU   CVTDAR                                                   01033000
CVTDCB   EQU   CVTMAP+116                                               01034000
CVTIERLC EQU   CVTMAP+144                                               01035000
CVTOPTA  EQU   CVTMAP+182                                               01036000
CVTOPTB  EQU   CVTMAP+183                                               01037000
CVTSMCA  EQU   CVTMAP+196                                               01038000
CVTGTF   EQU   CVTMAP+236                                               01039000
CVTGTFST EQU   CVTGTF                                                   01040000
CVTGTFS  EQU   CVTGTFST                                                 01041000
CVTSTATE EQU   CVTGTFST                                                 01042000
CVTTMODE EQU   CVTGTFST                                                 01043000
CVTFORM  EQU   CVTGTFST                                                 01044000
CVTAQAVT EQU   CVTMAP+240                                               01045000
CVTTCMFG EQU   CVTAQAVT                                                 01046000
CVTVOLM2 EQU   CVTMAP+244                                               01047000
CVTTATA  EQU   CVTVOLM2                                                 01048000
CVTTSKS  EQU   CVTTATA                                                  01049000
CVTVOLF2 EQU   CVTTSKS                                                  01050000
CVTTAT   EQU   CVTTATA+1                                                01051000
CVTATER  EQU   CVTMAP+248                                               01052000
CVTEXT1  EQU   CVTMAP+252                                               01053000
CVTCBSP  EQU   CVTMAP+256                                               01054000
CVTPURG  EQU   CVTMAP+260                                               01055000
CVTAMFF  EQU   CVTMAP+264                                               01056000
CVTQMSG  EQU   CVTMAP+268                                               01057000
CVTDMSR  EQU   CVTMAP+272                                               01058000
CVTERPV  EQU   CVTMAP+316                                               01059000
CVTINTLA EQU   CVTMAP+320                                               01060000
CVTAPF   EQU   CVTMAP+324                                               01061000
CVTEXT2  EQU   CVTMAP+328                                               01062000
CVTHJES  EQU   CVTMAP+332                                               01063000
CVTPGSIA EQU   CVTMAP+348                                               01064000
CVTA1F1  EQU   CVTMAP+356                                               01065000
CVTSYSK  EQU   CVTMAP+357                                               01066000
CVTVOLM1 EQU   CVTMAP+380                                               01067000
CVTVOLF1 EQU   CVTVOLM1                                                 01068000
CVTATMCT EQU   CVTMAP+388                                               01069000
CVTXTNT1 EQU   0                                                        01070000
CVTXTNT2 EQU   0                                                        01071000
CVTDSSV  EQU   CVTXTNT2                                                 01072000
CVTFLGBT EQU   CVTXTNT2+5                                               01073000
CVTQID   EQU   CVTXTNT2+24                                              01074000
CVTRV400 EQU   CVTXTNT2+52                                              01075000
CVTRV409 EQU   CVTXTNT2+53                                              01076000
CVTATCVT EQU   CVTXTNT2+64                                              01077000
CVTRV429 EQU   CVTXTNT2+84                                              01078000
CVTRV438 EQU   CVTXTNT2+85                                              01079000
CVTRV457 EQU   CVTXTNT2+112                                             01080000
CVTRV466 EQU   CVTXTNT2+113                                             01081000
CVTFIX   EQU   0                                                        01082000
CVTRELNO EQU   CVTFIX+252                                               01083000
TCBWORDS EQU   0                                                        01084000
TCBPTR   EQU   TCBWORDS+4                                               01085000
TCBFIX   EQU   0                                                        01086000
TCBFRS   EQU   TCBFIX                                                   01087000
TCB      EQU   0                                                        01088000
TCBPIE   EQU   TCB+4                                                    01089000
TCBPMASK EQU   TCBPIE                                                   01090000
TCBCMP   EQU   TCB+16                                                   01091000
TCBCMPF  EQU   TCBCMP                                                   01092000
TCBCPP   EQU   TCBCMPF                                                  01093000
TCBSTCC  EQU   TCBCMPF                                                  01094000
TCBCDBL  EQU   TCBCMPF                                                  01095000
TCBCWTO  EQU   TCBCMPF                                                  01096000
TCBCIND  EQU   TCBCMPF                                                  01097000
TCBCMSG  EQU   TCBCMPF                                                  01098000
TCBTRN   EQU   TCB+20                                                   01099000
TCBABF   EQU   TCBTRN                                                   01100000
TCBMSS   EQU   TCB+24                                                   01101000
TCBPKF   EQU   TCB+28                                                   01102000
TCBFLGS  EQU   TCB+29                                                   01103000
TCBFLGS1 EQU   TCBFLGS                                                  01104000
TCBFLGS2 EQU   TCBFLGS+1                                                01105000
TCBFLGS3 EQU   TCBFLGS+2                                                01106000
TCBFLGS4 EQU   TCBFLGS+3                                                01107000
TCBFLGS5 EQU   TCBFLGS+4                                                01108000
TCBABWF  EQU   TCBFLGS5                                                 01109000
TCBJPQ   EQU   TCB+44                                                   01110000
TCBPURGE EQU   TCBJPQ                                                   01111000
TCBGRS   EQU   TCB+48                                                   01112000
TCBFSA   EQU   TCB+112                                                  01113000
TCBTME   EQU   TCB+120                                                  01114000
TCBJSTCB EQU   TCB+124                                                  01115000
TCBTSFLG EQU   TCB+148                                                  01116000
TCBTSTSK EQU   TCBTSFLG                                                 01117000
TCBSTAB  EQU   TCB+160                                                  01118000
TCBNSTAE EQU   TCBSTAB                                                  01119000
TCBTCT   EQU   TCB+164                                                  01120000
TCBTCTGF EQU   TCBTCT                                                   01121000
TCBSCNDY EQU   TCB+172                                                  01122000
TCBNDSP  EQU   TCBSCNDY                                                 01123000
TCBNDSP1 EQU   TCBNDSP+1                                                01124000
TCBNDSP2 EQU   TCBNDSP+2                                                01125000
TCBNDSP3 EQU   TCBNDSP+3                                                01126000
TCBJSCB  EQU   TCB+180                                                  01127000
TCBRECDE EQU   TCBJSCB                                                  01128000
TCBEXT1  EQU   TCB+196                                                  01129000
TCBBITS  EQU   TCB+200                                                  01130000
TCBNDSP4 EQU   TCBBITS                                                  01131000
TCBNDSP5 EQU   TCBBITS+1                                                01132000
TCBFLGS6 EQU   TCBBITS+2                                                01133000
TCBFLGS7 EQU   TCBBITS+3                                                01134000
TCBDAR   EQU   TCB+204                                                  01135000
TCBDARC  EQU   TCBDAR                                                   01136000
TCBEXT2  EQU   TCB+208                                                  01137000
TCBFOE   EQU   TCB+244                                                  01138000
TCBESTAE EQU   TCB+264                                                  01139000
TCBESTRM EQU   TCBESTAE+1                                               01140000
TCBFBYT1 EQU   TCB+276                                                  01141000
TCBFBYT2 EQU   TCB+277                                                  01142000
TCBRV124 EQU   TCB+278                                                  01143000
TCBRV133 EQU   TCB+279                                                  01144000
TCBXTNT2 EQU   0                                                        01145000
TCBGTF   EQU   TCBXTNT2                                                 01146000
TCBTFLG  EQU   TCBGTF                                                   01147000
TCBRV146 EQU   TCBXTNT2+28                                              01148000
TCBRV155 EQU   TCBXTNT2+29                                              01149000
TCBRV164 EQU   TCBXTNT2+30                                              01150000
TCBRV173 EQU   TCBXTNT2+31                                              01151000
IFGACB   EQU   0                                                        01152000
ACBCOMN  EQU   IFGACB                                                   01153000
ACBLENG  EQU   ACBCOMN+2                                                01154000
ACBLENG2 EQU   ACBLENG                                                  01155000
ACBAMBL  EQU   ACBCOMN+4                                                01156000
ACBJWA   EQU   ACBAMBL                                                  01157000
ACBMACRF EQU   ACBCOMN+12                                               01158000
ACBMACR1 EQU   ACBMACRF                                                 01159000
ACBADR   EQU   ACBMACR1                                                 01160000
ACBCNV   EQU   ACBMACR1                                                 01161000
ACBMACR2 EQU   ACBMACRF+1                                               01162000
ACBBUFPL EQU   ACBCOMN+20                                               01163000
ACBMACR3 EQU   ACBBUFPL                                                 01164000
ACBRECFM EQU   ACBCOMN+24                                               01165000
ACBCCTYP EQU   ACBCOMN+25                                               01166000
ACBOPT   EQU   ACBCOMN+26                                               01167000
ACBDSORG EQU   ACBOPT                                                   01168000
ACBCROPS EQU   ACBDSORG                                                 01169000
ACBEXLST EQU   ACBCOMN+36                                               01170000
ACBDDNM  EQU   ACBCOMN+40                                               01171000
ACBAMETH EQU   ACBDDNM+3                                                01172000
ACBOFLGS EQU   ACBCOMN+48                                               01173000
ACBEXFG  EQU   ACBOFLGS                                                 01174000
ACBIOSFG EQU   ACBOFLGS                                                 01175000
ACBINFLG EQU   ACBCOMN+50                                               01176000
ACBUJFCB EQU   ACBCOMN+52                                               01177000
ACBBLKSZ EQU   ACBCOMN+60                                               01178000
ACBUAPTR EQU   ACBCOMN+64                                               01179000
AMCBS    EQU   0                                                        01180000
CBSCMP   EQU   AMCBS+16                                                 01181000
CBSVSRT  EQU   AMCBS+32                                                 01182000
IGGCAXWA EQU   0                                                        01183000
CAXFLGS  EQU   IGGCAXWA+8                                               01184000
CAXFLG2  EQU   IGGCAXWA+9                                               01185000
CAXFLG3  EQU   IGGCAXWA+10                                              01186000
CAXCCR   EQU   IGGCAXWA+32                                              01187000
CAXCNAM  EQU   IGGCAXWA+52                                              01188000
CAXOPLST EQU   IGGCAXWA+96                                              01189000
COPTS    EQU   CAXOPLST                                                 01190000
CTGFV    EQU   0                                                        01191000
CTGFVPRO EQU   CTGFV+1                                                  01192000
CTGFVSPC EQU   CTGFV+52                                                 01193000
CTGFVAMD EQU   CTGFV+56                                                 01194000
CTGFVLMT EQU   CTGFV+72                                                 01195000
CTGFVGAT EQU   CTGFV+76                                                 01196000
CTGWA    EQU   0                                                        01197000
CTGWAVL  EQU   CTGWA                                                    01198000
CTGVL    EQU   0                                                        01199000
CTGVLX   EQU   0                                                        01200000
CTGCV    EQU   0                                                        01201000
CTGCVDSN EQU   CTGCV+6                                                  01202000
MWA      EQU   0                                                        01203000
VLST     EQU   MWA+2                                                    01204000
CVOLIND  EQU   MWA+252                                                  01205000
SMCABASE EQU   0                                                        01206000
SMCAOPT  EQU   SMCABASE                                                 01207000
SMCADSA  EQU   SMCAOPT                                                  01208000
SMCAMISC EQU   SMCABASE+1                                               01209000
SMCAUSER EQU   SMCAMISC                                                 01210000
SMCABUF  EQU   SMCABASE+12                                              01211000
SMCAPSTA EQU   SMCABASE+30                                              01212000
SMCAPLBL EQU   SMCABASE+34                                              01213000
SMCASTA  EQU   SMCABASE+46                                              01214000
SMCAALBL EQU   SMCABASE+50                                              01215000
SMCAENTY EQU   SMCABASE+80                                              01216000
SMCAENDI EQU   SMCAENTY                                                 01217000
SMCAFOPT EQU   SMCABASE+82                                              01218000
SMCASWA  EQU   SMCABASE+104                                             01219000
SMCAASCB EQU   SMCABASE+120                                             01220000
CATSN    EQU   0                                                        01221000
CI       EQU   0                                                        01222000
CTGVLDSP EQU   0                                                        01223000
FIELDNM  EQU   0                                                        01224000
RCDAREA  EQU   0                                                        01225000
TNAM     EQU   0                                                        01226000
@NM00036 EQU   CTGDDNM                                                  01227000
CTGPROB  EQU   @NM00036                                                 01228000
CTGREASN EQU   CTGPROB+2                                                01229000
CVTS01   EQU   CVTPGSIA                                                 01230000
CVTLPDIA EQU   CVTS01+12                                                01231000
CVTDIRST EQU   CVTLPDIA                                                 01232000
CVTSLIDA EQU   CVTS01+24                                                01233000
CVTCTLFG EQU   CVTS01+50                                                01234000
CVTRV210 EQU   CVTS01+424                                               01235000
CVTRV219 EQU   CVTS01+425                                               01236000
CVTRV228 EQU   CVTS01+426                                               01237000
CVTRV237 EQU   CVTS01+427                                               01238000
CVTMFRTR EQU   CVTS01+452                                               01239000
CVTRV262 EQU   CVTS01+468                                               01240000
CVTRV271 EQU   CVTS01+469                                               01241000
CVTRV280 EQU   CVTS01+470                                               01242000
CVTRV289 EQU   CVTS01+471                                               01243000
CVTGSDA  EQU   CVTS01+600                                               01244000
PSARSVTE EQU   PSARSVT                                                  01245000
MCATDSTR EQU   CVTAMFF                                                  01246000
CVTAMF1  EQU   MCATDSTR                                                 01247000
FLC      EQU   PSA                                                      01248000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01249000
@NM00086 EQU   MCATDSTR+1                                               01250000
@NM00085 EQU   CVTAMF1                                                  01251000
AMF1NONX EQU   CVTAMF1                                                  01252000
AMF1OPEN EQU   CVTAMF1                                                  01253000
PSARSAV  EQU   PSARSVTE+60                                              01254000
PSARSTK  EQU   PSARSVTE+56                                              01255000
PSAESAV3 EQU   PSARSVTE+52                                              01256000
PSAESTK3 EQU   PSARSVTE+48                                              01257000
PSAESAV2 EQU   PSARSVTE+44                                              01258000
PSAESTK2 EQU   PSARSVTE+40                                              01259000
PSAESAV1 EQU   PSARSVTE+36                                              01260000
PSAESTK1 EQU   PSARSVTE+32                                              01261000
PSAPSAV  EQU   PSARSVTE+28                                              01262000
PSAPSTK  EQU   PSARSVTE+24                                              01263000
PSAMSAV  EQU   PSARSVTE+20                                              01264000
PSAMSTK  EQU   PSARSVTE+16                                              01265000
PSASSAV  EQU   PSARSVTE+12                                              01266000
PSASSTK  EQU   PSARSVTE+8                                               01267000
PSANSTK  EQU   PSARSVTE+4                                               01268000
PSACSTK  EQU   PSARSVTE                                                 01269000
CVTRV628 EQU   CVTS01+728                                               01270000
CVTRV627 EQU   CVTS01+724                                               01271000
CVTRV626 EQU   CVTS01+720                                               01272000
CVTRV625 EQU   CVTS01+716                                               01273000
CVTRV624 EQU   CVTS01+712                                               01274000
CVTRV623 EQU   CVTS01+708                                               01275000
CVTRV622 EQU   CVTS01+704                                               01276000
CVTRV621 EQU   CVTS01+700                                               01277000
CVTRV620 EQU   CVTS01+696                                               01278000
CVTRV619 EQU   CVTS01+692                                               01279000
CVTRV618 EQU   CVTS01+688                                               01280000
CVTRV617 EQU   CVTS01+684                                               01281000
CVTRV616 EQU   CVTS01+680                                               01282000
CVTRV615 EQU   CVTS01+676                                               01283000
CVTRV614 EQU   CVTS01+672                                               01284000
CVTRV613 EQU   CVTS01+668                                               01285000
CVTRV612 EQU   CVTS01+664                                               01286000
CVTRV611 EQU   CVTS01+660                                               01287000
CVTRV610 EQU   CVTS01+656                                               01288000
CVTRV609 EQU   CVTS01+652                                               01289000
CVTRV608 EQU   CVTS01+648                                               01290000
CVTRV607 EQU   CVTS01+644                                               01291000
CVTRV606 EQU   CVTS01+640                                               01292000
CVTRV605 EQU   CVTS01+636                                               01293000
CVTRV604 EQU   CVTS01+632                                               01294000
CVTEFF02 EQU   CVTS01+628                                               01295000
CVTCBBR  EQU   CVTS01+624                                               01296000
CVTSSCR  EQU   CVTS01+620                                               01297000
CVTEVENT EQU   CVTS01+616                                               01298000
CVTCRCA  EQU   CVTS01+612                                               01299000
CVTTPIO  EQU   CVTS01+608                                               01300000
CVTADV   EQU   CVTS01+604                                               01301000
CVTGSDAB EQU   CVTGSDA                                                  01302000
CVTQV3   EQU   CVTS01+596                                               01303000
CVTQV2   EQU   CVTS01+592                                               01304000
CVTQV1   EQU   CVTS01+588                                               01305000
CVTRPT   EQU   CVTS01+584                                               01306000
CVTSSRB  EQU   CVTS01+580                                               01307000
CVTCSDRL EQU   CVTS01+576                                               01308000
CVTEXP1  EQU   CVTS01+572                                               01309000
CVTRMPMT EQU   CVTS01+568                                               01310000
CVTRMPTT EQU   CVTS01+564                                               01311000
CVTVPSA  EQU   CVTS01+560                                               01312000
CVTVSTOP EQU   CVTS01+556                                               01313000
CVTGTFR8 EQU   CVTS01+552                                               01314000
CVTQUIT  EQU   CVTS01+548                                               01315000
CVTVACR  EQU   CVTS01+544                                               01316000
CVTWTCB  EQU   CVTS01+540                                               01317000
CVTSTPRS EQU   CVTS01+536                                               01318000
CVT0PT02 EQU   CVTS01+532                                               01319000
CVTDARCM EQU   CVTS01+528                                               01320000
CVTIRECM EQU   CVTS01+524                                               01321000
CVTJRECM EQU   CVTS01+520                                               01322000
CVTVEMS0 EQU   CVTS01+516                                               01323000
CVTSPFRR EQU   CVTS01+512                                               01324000
CVTRLSTG EQU   CVTS01+508                                               01325000
CVT0TC0A EQU   CVTS01+504                                               01326000
CVTGMBR  EQU   CVTS01+500                                               01327000
CVTLFRM  EQU   CVTS01+496                                               01328000
CVTRMBR  EQU   CVTS01+492                                               01329000
CVTVIOP  EQU   CVTS01+488                                               01330000
CVTRV307 EQU   CVTS01+486                                               01331000
CVTRV306 EQU   CVTS01+484                                               01332000
CVTRV305 EQU   CVTS01+482                                               01333000
CVTRV304 EQU   CVTS01+480                                               01334000
CVTRV303 EQU   CVTS01+478                                               01335000
CVTRV302 EQU   CVTS01+476                                               01336000
CVTTRCA  EQU   CVTS01+472                                               01337000
CVTRV297 EQU   CVTRV289                                                 01338000
CVTRV296 EQU   CVTRV289                                                 01339000
CVTRV295 EQU   CVTRV289                                                 01340000
CVTRV294 EQU   CVTRV289                                                 01341000
CVTRV293 EQU   CVTRV289                                                 01342000
CVTRV292 EQU   CVTRV289                                                 01343000
CVTRV291 EQU   CVTRV289                                                 01344000
CVTRV290 EQU   CVTRV289                                                 01345000
CVTRV288 EQU   CVTRV280                                                 01346000
CVTRV287 EQU   CVTRV280                                                 01347000
CVTRV286 EQU   CVTRV280                                                 01348000
CVTRV285 EQU   CVTRV280                                                 01349000
CVTRV284 EQU   CVTRV280                                                 01350000
CVTRV283 EQU   CVTRV280                                                 01351000
CVTRV282 EQU   CVTRV280                                                 01352000
CVTRV281 EQU   CVTRV280                                                 01353000
CVTRV279 EQU   CVTRV271                                                 01354000
CVTRV278 EQU   CVTRV271                                                 01355000
CVTRV277 EQU   CVTRV271                                                 01356000
CVTRV276 EQU   CVTRV271                                                 01357000
CVTRV275 EQU   CVTRV271                                                 01358000
CVTRV274 EQU   CVTRV271                                                 01359000
CVTRV273 EQU   CVTRV271                                                 01360000
CVTRV272 EQU   CVTRV271                                                 01361000
CVTRV270 EQU   CVTRV262                                                 01362000
CVTRV269 EQU   CVTRV262                                                 01363000
CVTRV268 EQU   CVTRV262                                                 01364000
CVTRV267 EQU   CVTRV262                                                 01365000
CVTRV266 EQU   CVTRV262                                                 01366000
CVTRV265 EQU   CVTRV262                                                 01367000
CVTRV264 EQU   CVTRV262                                                 01368000
CVTRV263 EQU   CVTRV262                                                 01369000
CVTVFP   EQU   CVTS01+464                                               01370000
CVTVSI   EQU   CVTS01+460                                               01371000
CVTVPSIB EQU   CVTS01+456                                               01372000
CVTMFACT EQU   CVTMFRTR                                                 01373000
CVTMFCTL EQU   CVTS01+448                                               01374000
CVTPVBP  EQU   CVTS01+444                                               01375000
CVTPWI   EQU   CVTS01+440                                               01376000
CVTRV254 EQU   CVTS01+438                                               01377000
CVTRV253 EQU   CVTS01+436                                               01378000
CVTRV252 EQU   CVTS01+434                                               01379000
CVTRV251 EQU   CVTS01+433                                               01380000
CVTRV250 EQU   CVTS01+432                                               01381000
CVTRV249 EQU   CVTS01+431                                               01382000
CVTRV248 EQU   CVTS01+430                                               01383000
CVTRV247 EQU   CVTS01+429                                               01384000
CVTRV246 EQU   CVTS01+428                                               01385000
CVTRV245 EQU   CVTRV237                                                 01386000
CVTRV244 EQU   CVTRV237                                                 01387000
CVTRV243 EQU   CVTRV237                                                 01388000
CVTRV242 EQU   CVTRV237                                                 01389000
CVTRV241 EQU   CVTRV237                                                 01390000
CVTRV240 EQU   CVTRV237                                                 01391000
CVTRV239 EQU   CVTRV237                                                 01392000
CVTRV238 EQU   CVTRV237                                                 01393000
CVTRV236 EQU   CVTRV228                                                 01394000
CVTRV235 EQU   CVTRV228                                                 01395000
CVTRV234 EQU   CVTRV228                                                 01396000
CVTRV233 EQU   CVTRV228                                                 01397000
CVTRV232 EQU   CVTRV228                                                 01398000
CVTRV231 EQU   CVTRV228                                                 01399000
CVTRV230 EQU   CVTRV228                                                 01400000
CVTRV229 EQU   CVTRV228                                                 01401000
CVTRV227 EQU   CVTRV219                                                 01402000
CVTRV226 EQU   CVTRV219                                                 01403000
CVTRV225 EQU   CVTRV219                                                 01404000
CVTRV224 EQU   CVTRV219                                                 01405000
CVTRV223 EQU   CVTRV219                                                 01406000
CVTRV222 EQU   CVTRV219                                                 01407000
CVTRV221 EQU   CVTRV219                                                 01408000
CVTRV220 EQU   CVTRV219                                                 01409000
CVTRV218 EQU   CVTRV210                                                 01410000
CVTRV217 EQU   CVTRV210                                                 01411000
CVTRV216 EQU   CVTRV210                                                 01412000
CVTRV215 EQU   CVTRV210                                                 01413000
CVTRV214 EQU   CVTRV210                                                 01414000
CVTRV213 EQU   CVTRV210                                                 01415000
CVTRV212 EQU   CVTRV210                                                 01416000
CVTRV211 EQU   CVTRV210                                                 01417000
CVTLCCAT EQU   CVTS01+420                                               01418000
CVTPCCAT EQU   CVTS01+416                                               01419000
CVTIPCRP EQU   CVTS01+412                                               01420000
CVTIPCRI EQU   CVTS01+408                                               01421000
CVTIPCDS EQU   CVTS01+404                                               01422000
CVTAIDVT EQU   CVTS01+400                                               01423000
CVTSSAP  EQU   CVTS01+396                                               01424000
CVTEHCIR EQU   CVTS01+392                                               01425000
CVTEHDEF EQU   CVTS01+388                                               01426000
CVTDAIR  EQU   CVTS01+384                                               01427000
CVTPERFM EQU   CVTS01+380                                               01428000
CVT044R2 EQU   CVTS01+376                                               01429000
CVTFETCH EQU   CVTS01+372                                               01430000
CVTRSTWD EQU   CVTS01+368                                               01431000
CVTSPOST EQU   CVTS01+364                                               01432000
CVTIOBP  EQU   CVTS01+360                                               01433000
CVTASMVT EQU   CVTS01+356                                               01434000
CVTRECRQ EQU   CVTS01+352                                               01435000
CVTWSAC  EQU   CVTS01+348                                               01436000
CVTRV149 EQU   CVTS01+344                                               01437000
CVTWSAL  EQU   CVTS01+340                                               01438000
CVTSPSA  EQU   CVTS01+336                                               01439000
CVTGLMN  EQU   CVTS01+332                                               01440000
CVTVEAC0 EQU   CVTS01+328                                               01441000
CVT062R1 EQU   CVTS01+324                                               01442000
CVTRPOST EQU   CVTS01+320                                               01443000
CVTDQIQE EQU   CVTS01+316                                               01444000
CVTCSD   EQU   CVTS01+312                                               01445000
CVTLKRMA EQU   CVTS01+308                                               01446000
CVTRSPIE EQU   CVTS01+304                                               01447000
CVTRENQ  EQU   CVTS01+300                                               01448000
CVTLQCB  EQU   CVTS01+296                                               01449000
CVTFQCB  EQU   CVTS01+292                                               01450000
CVTQCS01 EQU   CVTS01+288                                               01451000
CVTAPFT  EQU   CVTS01+284                                               01452000
CVTPARRL EQU   CVTS01+280                                               01453000
CVTVWAIT EQU   CVTS01+276                                               01454000
CVTGSPL  EQU   CVTS01+272                                               01455000
CVTLSMQ  EQU   CVTS01+268                                               01456000
CVTGSMQ  EQU   CVTS01+264                                               01457000
CVTEXPRO EQU   CVTS01+260                                               01458000
CVTOPCTP EQU   CVTS01+256                                               01459000
CVTSIC   EQU   CVTS01+252                                               01460000
CVTTPIOS EQU   CVTS01+248                                               01461000
CVTRTMS  EQU   CVTS01+244                                               01462000
CVTSDBF  EQU   CVTS01+240                                               01463000
CVTSCBP  EQU   CVTS01+236                                               01464000
CVTSDMP  EQU   CVTS01+232                                               01465000
CVTSV60  EQU   CVTS01+228                                               01466000
CVTRTMCT EQU   CVTS01+224                                               01467000
CVTASCBL EQU   CVTS01+220                                               01468000
CVTASCBH EQU   CVTS01+216                                               01469000
CVTGDA   EQU   CVTS01+212                                               01470000
CVTASVT  EQU   CVTS01+208                                               01471000
CVTVVMDI EQU   CVTS01+204                                               01472000
CVTAQTOP EQU   CVTS01+200                                               01473000
CVTIOSCS EQU   CVTS01+196                                               01474000
CVTSDRM  EQU   CVTS01+192                                               01475000
CVTOPTE  EQU   CVTS01+188                                               01476000
CVTSTXU  EQU   CVTS01+184                                               01477000
CVTQUIS  EQU   CVTS01+180                                               01478000
CVTPARS  EQU   CVTS01+176                                               01479000
CVTS1EE  EQU   CVTS01+172                                               01480000
CVTFRAS  EQU   CVTS01+168                                               01481000
CVTQSAS  EQU   CVTS01+164                                               01482000
CVTCRAS  EQU   CVTS01+160                                               01483000
CVTCRMN  EQU   CVTS01+156                                               01484000
CVTDELCP EQU   CVTS01+152                                               01485000
CVTFRECL EQU   CVTS01+148                                               01486000
CVTGETCL EQU   CVTS01+144                                               01487000
CVTBLDCP EQU   CVTS01+140                                               01488000
CVTAUTHL EQU   CVTS01+136                                               01489000
CVTSCAN  EQU   CVTS01+132                                               01490000
CVTRV144 EQU   CVTS01+130                                               01491000
CVTMAXMP EQU   CVTS01+128                                               01492000
CVTSTCK  EQU   CVTS01+124                                               01493000
CVTRV139 EQU   CVTS01+123                                               01494000
CVTDSSAC EQU   CVTS01+122                                               01495000
CVTRV513 EQU   CVTS01+121                                               01496000
CVTIOSPL EQU   CVTS01+120                                               01497000
CVTPTGT  EQU   CVTS01+116                                               01498000
CVTCSPIE EQU   CVTS01+112                                               01499000
CVTSMFEX EQU   CVTS01+108                                               01500000
CVTOLT0A EQU   CVTS01+104                                               01501000
CVTSRBRT EQU   CVTS01+100                                               01502000
CVTPUTL  EQU   CVTS01+96                                                01503000
CVTRV519 EQU   CVTS01+92                                                01504000
CVTRV327 EQU   CVTS01+88                                                01505000
CVTRV326 EQU   CVTS01+84                                                01506000
CVTRV325 EQU   CVTS01+80                                                01507000
CVTRV324 EQU   CVTS01+76                                                01508000
CVT0VL01 EQU   CVTS01+72                                                01509000
CVTSHRVM EQU   CVTS01+68                                                01510000
CVTRV332 EQU   CVTS01+64                                                01511000
CVTTAS   EQU   CVTS01+60                                                01512000
CVTRSCN  EQU   CVTS01+56                                                01513000
CVTTRAC2 EQU   CVTS01+54                                                01514000
CVTTRACE EQU   CVTS01+52                                                01515000
CVTAPG   EQU   CVTS01+51                                                01516000
CVTSDTRC EQU   CVTCTLFG                                                 01517000
CVTGTRCE EQU   CVTCTLFG                                                 01518000
CVTNOMP  EQU   CVTCTLFG                                                 01519000
CVTRSV79 EQU   CVTCTLFG                                                 01520000
CVTDSTAT EQU   CVTCTLFG                                                 01521000
CVTRSV78 EQU   CVTCTLFG                                                 01522000
CVTRV333 EQU   CVTCTLFG                                                 01523000
CVTRV323 EQU   CVTCTLFG                                                 01524000
CVTSPVLK EQU   CVTS01+49                                                01525000
CVTRSV77 EQU   CVTS01+48                                                01526000
CVTRV331 EQU   CVTS01+44                                                01527000
CVTRV330 EQU   CVTS01+40                                                01528000
CVTRV329 EQU   CVTS01+36                                                01529000
CVTRV328 EQU   CVTS01+32                                                01530000
CVTRV322 EQU   CVTS01+28                                                01531000
CVTSLID  EQU   CVTSLIDA+1                                               01532000
CVTSYLK  EQU   CVTSLIDA                                                 01533000
CVTRV321 EQU   CVTS01+20                                                01534000
CVTRV320 EQU   CVTS01+16                                                01535000
CVTLPDIR EQU   CVTLPDIA+1                                               01536000
CVTRSV69 EQU   CVTDIRST                                                 01537000
CVTRSV68 EQU   CVTDIRST                                                 01538000
CVTRSV67 EQU   CVTDIRST                                                 01539000
CVTRSV66 EQU   CVTDIRST                                                 01540000
CVTRSV65 EQU   CVTDIRST                                                 01541000
CVTRSV64 EQU   CVTDIRST                                                 01542000
CVTRSV63 EQU   CVTDIRST                                                 01543000
CVTDICOM EQU   CVTDIRST                                                 01544000
CVTPVTP  EQU   CVTS01+8                                                 01545000
CVTLPDSR EQU   CVTS01+4                                                 01546000
CVTGETL  EQU   CVTS01                                                   01547000
CTGREAS2 EQU   CTGREASN+1                                               01548000
CTGREAS1 EQU   CTGREASN                                                 01549000
CTGMODID EQU   CTGPROB                                                  01550000
SMCASTCB EQU   SMCABASE+176                                             01551000
SMCAWTCB EQU   SMCABASE+172                                             01552000
SMCAU83  EQU   SMCABASE+168                                             01553000
SMCAPGM  EQU   SMCABASE+164                                             01554000
SMCARGNM EQU   SMCABASE+160                                             01555000
SMCASPOT EQU   SMCABASE+156                                             01556000
SMCASPIN EQU   SMCABASE+152                                             01557000
SMCARGNS EQU   SMCABASE+148                                             01558000
SMCAPGRL EQU   SMCABASE+144                                             01559000
SMCAPGOT EQU   SMCABASE+140                                             01560000
SMCAPGIN EQU   SMCABASE+136                                             01561000
SMCATEXP EQU   SMCABASE+132                                             01562000
SMCARS22 EQU   SMCABASE+128                                             01563000
SMCARS21 EQU   SMCABASE+124                                             01564000
SMCATJID EQU   SMCAASCB+2                                               01565000
SMCAPOST EQU   SMCAASCB                                                 01566000
SMCADSCT EQU   SMCABASE+116                                             01567000
SMCADSTM EQU   SMCABASE+108                                             01568000
SMCASWD  EQU   SMCABASE+107                                             01569000
SMCASWC  EQU   SMCABASE+106                                             01570000
SMCASWB  EQU   SMCABASE+105                                             01571000
SMCADSSW EQU   SMCASWA                                                  01572000
SMCADSSP EQU   SMCASWA                                                  01573000
SMCAZEOD EQU   SMCASWA                                                  01574000
SMCANAVL EQU   SMCASWA                                                  01575000
SMCANADA EQU   SMCASWA                                                  01576000
SMCAOPFL EQU   SMCASWA                                                  01577000
SMCADSTR EQU   SMCASWA                                                  01578000
SMCASWAR EQU   SMCASWA                                                  01579000
SMCAXNAM EQU   SMCABASE+96                                              01580000
@NM00096 EQU   SMCABASE+92                                              01581000
SMCAXCTL EQU   SMCABASE+88                                              01582000
SMCAWRTP EQU   SMCABASE+84                                              01583000
SMCAENAL EQU   SMCABASE+83                                              01584000
SMCAFGN  EQU   SMCAFOPT                                                 01585000
SMCAFTDS EQU   SMCAFOPT                                                 01586000
SMCAFR01 EQU   SMCAFOPT                                                 01587000
SMCAFVOL EQU   SMCAFOPT                                                 01588000
SMCAFDSA EQU   SMCAFOPT                                                 01589000
SMCAFEXT EQU   SMCAFOPT                                                 01590000
SMCAFOP2 EQU   SMCAFOPT                                                 01591000
SMCAFOP1 EQU   SMCAFOPT                                                 01592000
SMCAENOP EQU   SMCAENTY+1                                               01593000
SMCADSNF EQU   SMCAENDI                                                 01594000
SMCARS20 EQU   SMCAENDI                                                 01595000
SMCARS19 EQU   SMCAENDI                                                 01596000
SMCARS18 EQU   SMCAENDI                                                 01597000
SMCARS17 EQU   SMCAENDI                                                 01598000
SMCARS16 EQU   SMCAENDI                                                 01599000
SMCARS15 EQU   SMCAENDI                                                 01600000
SMCARS14 EQU   SMCAENDI                                                 01601000
SMCAWAIT EQU   SMCABASE+72                                              01602000
SMCASGFT EQU   SMCABASE+68                                              01603000
SMCASGWR EQU   SMCABASE+64                                              01604000
SMCABECB EQU   SMCABASE+60                                              01605000
SMCAWECB EQU   SMCABASE+56                                              01606000
SMCAADCB EQU   SMCABASE+52                                              01607000
SMCAYORX EQU   SMCABASE+51                                              01608000
SMCAANL  EQU   SMCAALBL                                                 01609000
SMCAASL  EQU   SMCAALBL                                                 01610000
SMCAANSL EQU   SMCAALBL                                                 01611000
SMCARS13 EQU   SMCAALBL                                                 01612000
SMCARS12 EQU   SMCAALBL                                                 01613000
SMCARS11 EQU   SMCAALBL                                                 01614000
SMCARS10 EQU   SMCAALBL                                                 01615000
SMCARS09 EQU   SMCAALBL                                                 01616000
SMCAADAR EQU   SMCABASE+47                                              01617000
SMCAAVOL EQU   SMCASTA                                                  01618000
SMCAAUNT EQU   SMCASTA                                                  01619000
SMCARS08 EQU   SMCASTA                                                  01620000
SMCAAMOD EQU   SMCASTA                                                  01621000
SMCAAMTY EQU   SMCASTA                                                  01622000
SMCAADA  EQU   SMCASTA                                                  01623000
SMCAATAP EQU   SMCASTA                                                  01624000
SMCAANAV EQU   SMCASTA                                                  01625000
SMCAADEV EQU   SMCABASE+40                                              01626000
SMCAPDCB EQU   SMCABASE+36                                              01627000
SMCAXORY EQU   SMCABASE+35                                              01628000
SMCAPNL  EQU   SMCAPLBL                                                 01629000
SMCAPSL  EQU   SMCAPLBL                                                 01630000
SMCAPNSL EQU   SMCAPLBL                                                 01631000
SMCARS07 EQU   SMCAPLBL                                                 01632000
SMCARS06 EQU   SMCAPLBL                                                 01633000
SMCARS05 EQU   SMCAPLBL                                                 01634000
SMCARS04 EQU   SMCAPLBL                                                 01635000
SMCARS03 EQU   SMCAPLBL                                                 01636000
SMCAPDAR EQU   SMCABASE+31                                              01637000
SMCAPVOL EQU   SMCAPSTA                                                 01638000
SMCAPUNT EQU   SMCAPSTA                                                 01639000
SMCARS02 EQU   SMCAPSTA                                                 01640000
SMCAMOD  EQU   SMCAPSTA                                                 01641000
SMCAPMTY EQU   SMCAPSTA                                                 01642000
SMCAPDA  EQU   SMCAPSTA                                                 01643000
SMCAPTAP EQU   SMCAPSTA                                                 01644000
SMCAPNAV EQU   SMCAPSTA                                                 01645000
SMCAPDEV EQU   SMCABASE+24                                              01646000
SMCABUFP EQU   SMCABASE+20                                              01647000
SMCASID  EQU   SMCABASE+16                                              01648000
SMCABSIZ EQU   SMCABUF                                                  01649000
SMCAJWT  EQU   SMCABASE+8                                               01650000
SMCATIOT EQU   SMCABASE+4                                               01651000
SMCATOFF EQU   SMCABASE+2                                               01652000
SMCADUMP EQU   SMCAMISC                                                 01653000
SMCABSW  EQU   SMCAMISC                                                 01654000
SMCADBSY EQU   SMCAMISC                                                 01655000
SMCAPSDP EQU   SMCAMISC                                                 01656000
SMCAFIRT EQU   SMCAMISC                                                 01657000
SMCAOPI  EQU   SMCAMISC                                                 01658000
SMCAMAN  EQU   SMCAMISC                                                 01659000
SMCAFGND EQU   SMCAOPT                                                  01660000
SMCATDS  EQU   SMCAOPT                                                  01661000
SMCARS01 EQU   SMCAOPT                                                  01662000
SMCAVOL  EQU   SMCAOPT                                                  01663000
SMCAEXT  EQU   SMCAOPT                                                  01664000
SMCAOPT2 EQU   SMCAOPT                                                  01665000
SMCAOPT1 EQU   SMCAOPT                                                  01666000
CVLSER   EQU   MWA+259                                                  01667000
TTR2     EQU   MWA+256                                                  01668000
BIN0     EQU   CVOLIND+3                                                01669000
TTR1     EQU   CVOLIND                                                  01670000
@NM00095 EQU   MWA+242                                                  01671000
FSN      EQU   VLST+10                                                  01672000
VOLSER   EQU   VLST+4                                                   01673000
DEVTYP   EQU   VLST                                                     01674000
VOLENTCT EQU   MWA                                                      01675000
CTGCVCC  EQU   CTGCV+50                                                 01676000
CTGCVDEV EQU   CTGCVDSN                                                 01677000
CTGCVVOL EQU   CTGCV                                                    01678000
CTGVLTTR EQU   CTGVLX+12                                                01679000
@NM00094 EQU   CTGVLX                                                   01680000
CTGVLSEQ EQU   CTGVL+10                                                 01681000
CTGVLDEV EQU   CTGVL+6                                                  01682000
CTGVLVOL EQU   CTGVL                                                    01683000
CTGWAGB  EQU   CTGWA+12                                                 01684000
CTGWAGCT EQU   CTGWA+10                                                 01685000
CTGWAUCT EQU   CTGWA+8                                                  01686000
CTGWAVCT EQU   CTGWA+6                                                  01687000
CTGWALV  EQU   CTGWA+4                                                  01688000
CTGFVWKA EQU   CTGFV+88                                                 01689000
CTGFVPWD EQU   CTGFV+84                                                 01690000
CTGFVNAM EQU   CTGFV+80                                                 01691000
CTGFVUPG EQU   CTGFVGAT                                                 01692000
CTGFVEXT EQU   CTGFVLMT                                                 01693000
CTGFVLRS EQU   CTGFV+68                                                 01694000
CTGFVBUF EQU   CTGFV+64                                                 01695000
CTGFVATR EQU   CTGFV+60                                                 01696000
CTGFVFSN EQU   CTGFVAMD                                                 01697000
CTGFVTTR EQU   CTGFVSPC                                                 01698000
CTGFVDVT EQU   CTGFV+48                                                 01699000
CTGFVRNG EQU   CTGFV+44                                                 01700000
CTGFVVLT EQU   CTGFV+40                                                 01701000
CTGFVCRE EQU   CTGFV+36                                                 01702000
CTGFVEXP EQU   CTGFV+32                                                 01703000
CTGFVOWN EQU   CTGFV+28                                                 01704000
CTGFVSTY EQU   CTGFV+24                                                 01705000
CTGFVENT EQU   CTGFV+20                                                 01706000
CTGFVIND EQU   CTGFV+16                                                 01707000
CTGFVVCH EQU   CTGFV+12                                                 01708000
CTGFVICH EQU   CTGFV+8                                                  01709000
CTGFVDCH EQU   CTGFV+4                                                  01710000
@NM00093 EQU   CTGFV+3                                                  01711000
CTGFVELM EQU   CTGFV+2                                                  01712000
@NM00092 EQU   CTGFVPRO                                                 01713000
CTGFVDRC EQU   CTGFVPRO                                                 01714000
CTGFVNDC EQU   CTGFVPRO                                                 01715000
CTGFVRVL EQU   CTGFVPRO                                                 01716000
CTGFVAVL EQU   CTGFVPRO                                                 01717000
CTGFVTYP EQU   CTGFV                                                    01718000
CAXCRACB EQU   IGGCAXWA+112                                             01719000
CAXJDE   EQU   IGGCAXWA+108                                             01720000
CAXCCA   EQU   IGGCAXWA+104                                             01721000
CAXOPEWA EQU   IGGCAXWA+100                                             01722000
COPACB   EQU   CAXOPLST+1                                               01723000
@NM00091 EQU   COPTS                                                    01724000
CENLST   EQU   COPTS                                                    01725000
@NM00090 EQU   CAXCNAM+22                                               01726000
CAXRADDN EQU   CAXCNAM+14                                               01727000
CAXRATEP EQU   CAXCNAM+10                                               01728000
CAXRACTS EQU   CAXCNAM+6                                                01729000
CAXVOLID EQU   CAXCNAM                                                  01730000
CAXRPL   EQU   IGGCAXWA+48                                              01731000
CAXRPLCT EQU   IGGCAXWA+46                                              01732000
CAXASID  EQU   IGGCAXWA+44                                              01733000
CAXFDCI  EQU   CAXCCR+9                                                 01734000
CAXCDCI  EQU   CAXCCR+6                                                 01735000
CAXNFCI  EQU   CAXCCR+3                                                 01736000
CAXHACI  EQU   CAXCCR                                                   01737000
CAXUCB   EQU   IGGCAXWA+28                                              01738000
CAXACB   EQU   IGGCAXWA+24                                              01739000
CAXDRWP  EQU   IGGCAXWA+20                                              01740000
CAXSCHWA EQU   IGGCAXWA+16                                              01741000
CAXATIOT EQU   IGGCAXWA+12                                              01742000
CAXACT   EQU   IGGCAXWA+11                                              01743000
@NM00089 EQU   CAXFLG3                                                  01744000
CAXF3B6  EQU   CAXFLG3                                                  01745000
CAXF3B5  EQU   CAXFLG3                                                  01746000
@NM00088 EQU   CAXFLG3                                                  01747000
CAXF3ANE EQU   CAXFLG3                                                  01748000
CAXF3AT  EQU   CAXFLG3                                                  01749000
CAXF2VTU EQU   CAXFLG2                                                  01750000
CAXF2REC EQU   CAXFLG2                                                  01751000
CAXF2CA  EQU   CAXFLG2                                                  01752000
CAXF2CLR EQU   CAXFLG2                                                  01753000
CAXF2IOE EQU   CAXFLG2                                                  01754000
CAXF2NCR EQU   CAXFLG2                                                  01755000
CAXF2NDD EQU   CAXFLG2                                                  01756000
CAXF2DT  EQU   CAXFLG2                                                  01757000
CAXSCR   EQU   CAXFLGS                                                  01758000
CAXCMR   EQU   CAXFLGS                                                  01759000
CAXMCT   EQU   CAXFLGS                                                  01760000
CAXCMP   EQU   CAXFLGS                                                  01761000
CAXEOV   EQU   CAXFLGS                                                  01762000
CAXCLS   EQU   CAXFLGS                                                  01763000
CAXOPN   EQU   CAXFLGS                                                  01764000
CAXBLD   EQU   CAXFLGS                                                  01765000
CAXCHN   EQU   IGGCAXWA+4                                               01766000
@NM00087 EQU   IGGCAXWA+1                                               01767000
CAXID    EQU   IGGCAXWA                                                 01768000
CBSVPTR  EQU   CBSVSRT+4                                                01769000
CBSVUSE  EQU   CBSVSRT                                                  01770000
CBSCRTCB EQU   AMCBS+28                                                 01771000
CBSCRACA EQU   AMCBS+24                                                 01772000
CBSCAXCN EQU   AMCBS+20                                                 01773000
CBSMCUCB EQU   CBSCMP                                                   01774000
CBSCBP   EQU   AMCBS+12                                                 01775000
CBSACB   EQU   AMCBS+8                                                  01776000
CBSMCSTA EQU   AMCBS+4                                                  01777000
CBSSIZ   EQU   AMCBS+2                                                  01778000
CBSID    EQU   AMCBS                                                    01779000
ACBAPID  EQU   ACBCOMN+72                                               01780000
ACBCBMWA EQU   ACBCOMN+68                                               01781000
ACBLRECL EQU   ACBCOMN+62                                               01782000
ACBMSGLN EQU   ACBBLKSZ                                                 01783000
ACBBUFSP EQU   ACBCOMN+56                                               01784000
@NM00084 EQU   ACBUJFCB+1                                               01785000
ACBOPTN  EQU   ACBUJFCB                                                 01786000
ACBVVIC  EQU   ACBINFLG                                                 01787000
ACBUCRA  EQU   ACBINFLG                                                 01788000
ACBSCRA  EQU   ACBINFLG                                                 01789000
ACBCAT   EQU   ACBINFLG                                                 01790000
ACBIJRQE EQU   ACBINFLG                                                 01791000
ACBJEPS  EQU   ACBINFLG                                                 01792000
@NM00083 EQU   ACBINFLG                                                 01793000
ACBERFLG EQU   ACBCOMN+49                                               01794000
ACBBUSY  EQU   ACBIOSFG                                                 01795000
ACBLOCK  EQU   ACBEXFG                                                  01796000
@NM00082 EQU   ACBOFLGS                                                 01797000
ACBDSERR EQU   ACBOFLGS                                                 01798000
ACBOPEN  EQU   ACBOFLGS                                                 01799000
ACBEOV   EQU   ACBOFLGS                                                 01800000
@NM00081 EQU   ACBOFLGS                                                 01801000
ACBDEB   EQU   ACBDDNM+5                                                01802000
ACBERFL  EQU   ACBDDNM+4                                                01803000
ACBAM    EQU   ACBAMETH                                                 01804000
ACBINFL  EQU   ACBDDNM+2                                                01805000
ACBTIOT  EQU   ACBDDNM                                                  01806000
ACBUEL   EQU   ACBEXLST                                                 01807000
ACBPASSW EQU   ACBCOMN+32                                               01808000
ACBMSGAR EQU   ACBCOMN+28                                               01809000
@NM00080 EQU   ACBDSORG+1                                               01810000
ACBDORGA EQU   ACBDSORG+1                                               01811000
@NM00079 EQU   ACBDSORG                                                 01812000
ACBCRNRE EQU   ACBCROPS                                                 01813000
ACBCRNCK EQU   ACBCROPS                                                 01814000
ACBASA   EQU   ACBCCTYP                                                 01815000
@NM00078 EQU   ACBCCTYP                                                 01816000
ACBRECAF EQU   ACBRECFM                                                 01817000
ACBJBUF  EQU   ACBBUFPL+2                                               01818000
ACBMACR4 EQU   ACBBUFPL+1                                               01819000
@NM00077 EQU   ACBMACR3                                                 01820000
ACBNCFX  EQU   ACBMACR3                                                 01821000
ACBSIS   EQU   ACBMACR3                                                 01822000
ACBDFR   EQU   ACBMACR3                                                 01823000
ACBICI   EQU   ACBMACR3                                                 01824000
ACBGSR   EQU   ACBMACR3                                                 01825000
ACBLSR   EQU   ACBMACR3                                                 01826000
@NM00076 EQU   ACBMACR3                                                 01827000
ACBBUFNI EQU   ACBCOMN+18                                               01828000
ACBBUFND EQU   ACBCOMN+16                                               01829000
ACBSTRNO EQU   ACBCOMN+15                                               01830000
ACBBSTNO EQU   ACBCOMN+14                                               01831000
ACBAIX   EQU   ACBMACR2                                                 01832000
ACBDSN   EQU   ACBMACR2                                                 01833000
ACBRST   EQU   ACBMACR2                                                 01834000
ACBLOGON EQU   ACBMACR2                                                 01835000
ACBSKP   EQU   ACBMACR2                                                 01836000
@NM00075 EQU   ACBMACR2                                                 01837000
ACBUBF   EQU   ACBMACR1                                                 01838000
ACBOUT   EQU   ACBMACR1                                                 01839000
ACBIN    EQU   ACBMACR1                                                 01840000
ACBDIR   EQU   ACBMACR1                                                 01841000
ACBSEQ   EQU   ACBMACR1                                                 01842000
ACBBLK   EQU   ACBCNV                                                   01843000
ACBADD   EQU   ACBADR                                                   01844000
ACBKEY   EQU   ACBMACR1                                                 01845000
ACBINRTN EQU   ACBCOMN+8                                                01846000
ACBIBCT  EQU   ACBJWA                                                   01847000
ACBLEN2  EQU   ACBLENG2                                                 01848000
ACBSTYP  EQU   ACBCOMN+1                                                01849000
ACBID    EQU   ACBCOMN                                                  01850000
@NM00050 EQU   TCBXTNT2+32                                              01851000
TCBRV181 EQU   TCBRV173                                                 01852000
TCBRV180 EQU   TCBRV173                                                 01853000
TCBRV179 EQU   TCBRV173                                                 01854000
TCBRV178 EQU   TCBRV173                                                 01855000
TCBRV177 EQU   TCBRV173                                                 01856000
TCBRV176 EQU   TCBRV173                                                 01857000
TCBRV175 EQU   TCBRV173                                                 01858000
TCBRV174 EQU   TCBRV173                                                 01859000
TCBRV172 EQU   TCBRV164                                                 01860000
TCBRV171 EQU   TCBRV164                                                 01861000
TCBRV170 EQU   TCBRV164                                                 01862000
TCBRV169 EQU   TCBRV164                                                 01863000
TCBRV168 EQU   TCBRV164                                                 01864000
TCBRV167 EQU   TCBRV164                                                 01865000
TCBRV166 EQU   TCBRV164                                                 01866000
TCBRV165 EQU   TCBRV164                                                 01867000
TCBRV163 EQU   TCBRV155                                                 01868000
TCBRV162 EQU   TCBRV155                                                 01869000
TCBRV161 EQU   TCBRV155                                                 01870000
TCBRV160 EQU   TCBRV155                                                 01871000
TCBRV159 EQU   TCBRV155                                                 01872000
TCBRV158 EQU   TCBRV155                                                 01873000
TCBRV157 EQU   TCBRV155                                                 01874000
TCBRV156 EQU   TCBRV155                                                 01875000
TCBRV154 EQU   TCBRV146                                                 01876000
TCBRV153 EQU   TCBRV146                                                 01877000
TCBRV152 EQU   TCBRV146                                                 01878000
TCBRV151 EQU   TCBRV146                                                 01879000
TCBRV150 EQU   TCBRV146                                                 01880000
TCBRV149 EQU   TCBRV146                                                 01881000
TCBRV148 EQU   TCBRV146                                                 01882000
TCBRV147 EQU   TCBRV146                                                 01883000
TCBRV145 EQU   TCBXTNT2+26                                              01884000
TCBRV144 EQU   TCBXTNT2+24                                              01885000
TCBRV143 EQU   TCBXTNT2+20                                              01886000
TCBRV142 EQU   TCBXTNT2+16                                              01887000
TCBRSV49 EQU   TCBXTNT2+12                                              01888000
TCBRSV48 EQU   TCBXTNT2+8                                               01889000
TCBRCMP  EQU   TCBXTNT2+5                                               01890000
TCBRSVAB EQU   TCBXTNT2+4                                               01891000
TCBGTFA  EQU   TCBGTF+1                                                 01892000
TCBRSV47 EQU   TCBTFLG                                                  01893000
TCBRSV46 EQU   TCBTFLG                                                  01894000
TCBRSV45 EQU   TCBTFLG                                                  01895000
TCBRSV44 EQU   TCBTFLG                                                  01896000
TCBRSV43 EQU   TCBTFLG                                                  01897000
TCBDSPIT EQU   TCBTFLG                                                  01898000
TCBERRTN EQU   TCBTFLG                                                  01899000
TCBASYNC EQU   TCBTFLG                                                  01900000
@NM00049 EQU   TCB+296                                                  01901000
TCBSCBQ  EQU   TCB+292                                                  01902000
TCBSWASA EQU   TCB+288                                                  01903000
TCBDBTB  EQU   TCB+284                                                  01904000
TCBRPT   EQU   TCB+280                                                  01905000
TCBRV141 EQU   TCBRV133                                                 01906000
TCBRV140 EQU   TCBRV133                                                 01907000
TCBRV139 EQU   TCBRV133                                                 01908000
TCBRV138 EQU   TCBRV133                                                 01909000
TCBRV137 EQU   TCBRV133                                                 01910000
TCBRV136 EQU   TCBRV133                                                 01911000
TCBRV135 EQU   TCBRV133                                                 01912000
TCBRV134 EQU   TCBRV133                                                 01913000
TCBRV132 EQU   TCBRV124                                                 01914000
TCBRV131 EQU   TCBRV124                                                 01915000
TCBRV130 EQU   TCBRV124                                                 01916000
TCBRV129 EQU   TCBRV124                                                 01917000
TCBRV128 EQU   TCBRV124                                                 01918000
TCBRV127 EQU   TCBRV124                                                 01919000
TCBRV126 EQU   TCBRV124                                                 01920000
TCBRV125 EQU   TCBRV124                                                 01921000
TCBRV123 EQU   TCBFBYT2                                                 01922000
TCBRV122 EQU   TCBFBYT2                                                 01923000
TCBECBNV EQU   TCBFBYT2                                                 01924000
TCBSSSYN EQU   TCBFBYT2                                                 01925000
TCBFPRAP EQU   TCBFBYT2                                                 01926000
TCBFDW   EQU   TCBFBYT2                                                 01927000
TCBFMW   EQU   TCBFBYT2                                                 01928000
TCBCNCB  EQU   TCBFBYT2                                                 01929000
TCBLLH   EQU   TCBFBYT1                                                 01930000
TCBRV113 EQU   TCBFBYT1                                                 01931000
TCBEOT   EQU   TCBFBYT1                                                 01932000
TCBRTM2  EQU   TCBFBYT1                                                 01933000
TCBPGNLY EQU   TCBFBYT1                                                 01934000
TCBNDIOS EQU   TCBFBYT1                                                 01935000
TCBACTIV EQU   TCBFBYT1                                                 01936000
TCBEOTFM EQU   TCBFBYT1                                                 01937000
TCBAFFN  EQU   TCB+274                                                  01938000
TCBCCPVI EQU   TCB+272                                                  01939000
TCBUKYSP EQU   TCB+268                                                  01940000
TCBMODE  EQU   TCBESTAE+3                                               01941000
TCBERTYP EQU   TCBESTAE+2                                               01942000
TCBRV314 EQU   TCBESTRM                                                 01943000
TCBRV313 EQU   TCBESTRM                                                 01944000
TCBRV312 EQU   TCBESTRM                                                 01945000
TCBRV311 EQU   TCBESTRM                                                 01946000
TCBRV310 EQU   TCBESTRM                                                 01947000
TCBRV309 EQU   TCBESTRM                                                 01948000
TCBRV308 EQU   TCBESTRM                                                 01949000
TCBETERM EQU   TCBESTRM                                                 01950000
TCBSCBKY EQU   TCBESTAE                                                 01951000
TCBRTM12 EQU   TCB+260                                                  01952000
TCBTCBID EQU   TCB+256                                                  01953000
TCBRSV96 EQU   TCB+252                                                  01954000
TCBSWA   EQU   TCB+248                                                  01955000
TCBFOEA  EQU   TCBFOE+1                                                 01956000
TCBRSV42 EQU   TCBFOE                                                   01957000
TCBRV306 EQU   TCB+240                                                  01958000
TCBRSV41 EQU   TCB+239                                                  01959000
TCBTID   EQU   TCB+238                                                  01960000
TCBRSVAA EQU   TCB+237                                                  01961000
TCBABCUR EQU   TCB+236                                                  01962000
TCBTMSAV EQU   TCB+232                                                  01963000
TCBIOTIM EQU   TCB+228                                                  01964000
TCBRTWA  EQU   TCB+224                                                  01965000
TCBBACK  EQU   TCB+220                                                  01966000
TCBTIRB  EQU   TCB+216                                                  01967000
TCBAECB  EQU   TCB+212                                                  01968000
TCBEXT2A EQU   TCBEXT2+1                                                01969000
TCBRSV39 EQU   TCBEXT2                                                  01970000
TCBSTMCT EQU   TCB+207                                                  01971000
TCBSYSCT EQU   TCB+206                                                  01972000
TCBRSV37 EQU   TCB+205                                                  01973000
TCBEXSVC EQU   TCBDAR                                                   01974000
TCBRSV36 EQU   TCBDAR                                                   01975000
TCBDARWT EQU   TCBDAR                                                   01976000
TCBDARO  EQU   TCBDAR                                                   01977000
TCBDARMC EQU   TCBDARC                                                  01978000
TCBDARD  EQU   TCBDAR                                                   01979000
TCBDARS  EQU   TCBDAR                                                   01980000
TCBDARP  EQU   TCBDAR                                                   01981000
TCBGTOFM EQU   TCBFLGS7                                                 01982000
TCBADMP  EQU   TCBFLGS7                                                 01983000
TCBRSTSK EQU   TCBFLGS7                                                 01984000
TCBRSV35 EQU   TCBFLGS7                                                 01985000
TCBSTACK EQU   TCBFLGS7                                                 01986000
TCBRSV34 EQU   TCBFLGS7                                                 01987000
TCBRSV33 EQU   TCBFLGS7                                                 01988000
TCBGPECB EQU   TCBFLGS7                                                 01989000
TCBNTJS  EQU   TCBFLGS6                                                 01990000
TCBAPG   EQU   TCBFLGS6                                                 01991000
TCBMIGR  EQU   TCBFLGS6                                                 01992000
TCBRV303 EQU   TCBFLGS6                                                 01993000
TCBSPVLK EQU   TCBFLGS6                                                 01994000
TCBCPU   EQU   TCBFLGS6                                                 01995000
TCBPIE17 EQU   TCBFLGS6                                                 01996000
TCBRV    EQU   TCBFLGS6                                                 01997000
TCBRSV79 EQU   TCBNDSP5                                                 01998000
TCBRSV78 EQU   TCBNDSP5                                                 01999000
TCBRSV77 EQU   TCBNDSP5                                                 02000000
TCBRSV76 EQU   TCBNDSP5                                                 02001000
TCBRSV75 EQU   TCBNDSP5                                                 02002000
TCBRSV74 EQU   TCBNDSP5                                                 02003000
TCBRSV95 EQU   TCBNDSP5                                                 02004000
TCBRSV94 EQU   TCBNDSP5                                                 02005000
TCBRSV93 EQU   TCBNDSP4                                                 02006000
TCBRSV92 EQU   TCBNDSP4                                                 02007000
TCBRSV91 EQU   TCBNDSP4                                                 02008000
TCBRSV90 EQU   TCBNDSP4                                                 02009000
TCBRSV89 EQU   TCBNDSP4                                                 02010000
TCBRSV88 EQU   TCBNDSP4                                                 02011000
TCBRSV87 EQU   TCBNDSP4                                                 02012000
TCBRSV86 EQU   TCBNDSP4                                                 02013000
TCBEXT1A EQU   TCBEXT1+1                                                02014000
TCBRSV32 EQU   TCBEXT1                                                  02015000
TCBEXCPD EQU   TCB+192                                                  02016000
TCBIOBRC EQU   TCB+188                                                  02017000
TCBDDWTC EQU   TCB+186                                                  02018000
TCBDDEXC EQU   TCB+184                                                  02019000
TCBJSCBB EQU   TCBJSCB+1                                                02020000
@NM00048 EQU   TCBRECDE                                                 02021000
TCBREC   EQU   TCBRECDE                                                 02022000
TCBMDIDS EQU   TCB+176                                                  02023000
TCBNDINT EQU   TCBNDSP3                                                 02024000
TCBRSV27 EQU   TCBNDSP3                                                 02025000
TCBRSV26 EQU   TCBNDSP3                                                 02026000
TCBRSV25 EQU   TCBNDSP3                                                 02027000
TCBRSV24 EQU   TCBNDSP3                                                 02028000
TCBSRBND EQU   TCBNDSP3                                                 02029000
TCBRV302 EQU   TCBNDSP3                                                 02030000
TCBLJSND EQU   TCBNDSP3                                                 02031000
TCBABE   EQU   TCBNDSP2                                                 02032000
TCBDSS   EQU   TCBNDSP2                                                 02033000
TCBOWAIT EQU   TCBNDSP2                                                 02034000
TCBIWAIT EQU   TCBNDSP2                                                 02035000
TCBNDTS  EQU   TCBNDSP2                                                 02036000
TCBNDSVC EQU   TCBNDSP2                                                 02037000
TCBSTPP  EQU   TCBNDSP2                                                 02038000
TCBABD   EQU   TCBNDSP2                                                 02039000
TCBRSV22 EQU   TCBNDSP1                                                 02040000
TCBPIEND EQU   TCBNDSP1                                                 02041000
TCBTPSP  EQU   TCBNDSP1                                                 02042000
TCBDDRND EQU   TCBNDSP1                                                 02043000
TCBRSPND EQU   TCBNDSP1                                                 02044000
TCBRSTND EQU   TCBNDSP1                                                 02045000
TCBDARPN EQU   TCBNDSP1                                                 02046000
TCBDARTN EQU   TCBNDSP1                                                 02047000
TCBNDSP0 EQU   TCBNDSP                                                  02048000
TCBUSER  EQU   TCB+168                                                  02049000
TCBTCTB  EQU   TCBTCT+1                                                 02050000
TCBRSV9C EQU   TCBTCTGF                                                 02051000
TCBRSV9B EQU   TCBTCTGF                                                 02052000
TCBRSV9A EQU   TCBTCTGF                                                 02053000
TCBRSV99 EQU   TCBTCTGF                                                 02054000
TCBRSV98 EQU   TCBTCTGF                                                 02055000
TCBRSV97 EQU   TCBTCTGF                                                 02056000
TCBRSV20 EQU   TCBTCTGF                                                 02057000
TCBSMFGF EQU   TCBTCTGF                                                 02058000
TCBSTABB EQU   TCBSTAB+1                                                02059000
TCBSTCUR EQU   TCBNSTAE                                                 02060000
TCBRV301 EQU   TCBNSTAE                                                 02061000
TCBSYNCH EQU   TCBNSTAE                                                 02062000
TCBHALT  EQU   TCBNSTAE                                                 02063000
TCBPPSUP EQU   TCBNSTAE                                                 02064000
TCB33E   EQU   TCBNSTAE                                                 02065000
TCBQUIES EQU   TCBNSTAE                                                 02066000
TCBSTABE EQU   TCBNSTAE                                                 02067000
TCBAQE   EQU   TCB+156                                                  02068000
TCBPQE   EQU   TCB+152                                                  02069000
TCBTSDP  EQU   TCB+151                                                  02070000
TCBTSLP  EQU   TCB+150                                                  02071000
TCBSTPCT EQU   TCB+149                                                  02072000
TCBCPUBN EQU   TCBTSFLG                                                 02073000
TCBDYDSP EQU   TCBTSFLG                                                 02074000
TCBRSV18 EQU   TCBTSFLG                                                 02075000
TCBRSV17 EQU   TCBTSFLG                                                 02076000
TCBTIOTG EQU   TCBTSFLG                                                 02077000
TCBATT   EQU   TCBTSFLG                                                 02078000
TCBSTPPR EQU   TCBTSFLG                                                 02079000
TCBRV300 EQU   TCBTSTSK                                                 02080000
TCBECB   EQU   TCB+144                                                  02081000
TCBIQE   EQU   TCB+140                                                  02082000
TCBLTC   EQU   TCB+136                                                  02083000
TCBOTC   EQU   TCB+132                                                  02084000
TCBNTC   EQU   TCB+128                                                  02085000
TCBJSTCA EQU   TCBJSTCB+1                                               02086000
TCBRSV16 EQU   TCBJSTCB                                                 02087000
TCBTQET  EQU   TCBTME                                                   02088000
TCBTCB   EQU   TCB+116                                                  02089000
TCBFSAB  EQU   TCBFSA+1                                                 02090000
TCBQEL   EQU   TCBFSA                                                   02091000
TCBGRS15 EQU   TCBGRS+60                                                02092000
TCBGRS14 EQU   TCBGRS+56                                                02093000
TCBGRS13 EQU   TCBGRS+52                                                02094000
TCBGRS12 EQU   TCBGRS+48                                                02095000
TCBGRS11 EQU   TCBGRS+44                                                02096000
TCBGRS10 EQU   TCBGRS+40                                                02097000
TCBGRS9  EQU   TCBGRS+36                                                02098000
TCBGRS8  EQU   TCBGRS+32                                                02099000
TCBGRS7  EQU   TCBGRS+28                                                02100000
TCBGRS6  EQU   TCBGRS+24                                                02101000
TCBGRS5  EQU   TCBGRS+20                                                02102000
TCBGRS4  EQU   TCBGRS+16                                                02103000
TCBGRS3  EQU   TCBGRS+12                                                02104000
TCBGRS2  EQU   TCBGRS+8                                                 02105000
TCBGRS1  EQU   TCBGRS+4                                                 02106000
TCBGRS0  EQU   TCBGRS                                                   02107000
TCBJPQB  EQU   TCBJPQ+1                                                 02108000
TCBRSV15 EQU   TCBPURGE                                                 02109000
TCBRSV14 EQU   TCBPURGE                                                 02110000
TCBRSV13 EQU   TCBPURGE                                                 02111000
TCBRSV12 EQU   TCBPURGE                                                 02112000
TCBRSV11 EQU   TCBPURGE                                                 02113000
TCBRSV10 EQU   TCBPURGE                                                 02114000
TCBRSV09 EQU   TCBPURGE                                                 02115000
TCBJPQF  EQU   TCBPURGE                                                 02116000
TCBJLB   EQU   TCB+40                                                   02117000
TCBLLS   EQU   TCB+36                                                   02118000
TCBDSP   EQU   TCB+35                                                   02119000
TCBLMP   EQU   TCB+34                                                   02120000
TCBPNDSP EQU   TCBFLGS5                                                 02121000
TCBFCD1  EQU   TCBFLGS5                                                 02122000
TCBSTP   EQU   TCBFLGS5                                                 02123000
TCBSYS   EQU   TCBFLGS5                                                 02124000
TCBANDSP EQU   TCBFLGS5                                                 02125000
TCBPAGE  EQU   TCBFLGS5                                                 02126000
TCBUXNDF EQU   TCBABWF                                                  02127000
TCBFC    EQU   TCBFLGS5                                                 02128000
TCBONDSP EQU   TCBFLGS4                                                 02129000
TCBMPCND EQU   TCBFLGS4                                                 02130000
TCBMPCVQ EQU   TCBFLGS4                                                 02131000
TCBUXNDV EQU   TCBFLGS4                                                 02132000
TCBHNDSP EQU   TCBFLGS4                                                 02133000
TCBRQENA EQU   TCBFLGS4                                                 02134000
TCBSER   EQU   TCBFLGS4                                                 02135000
TCBNDUMP EQU   TCBFLGS4                                                 02136000
TCBDWSTA EQU   TCBFLGS3                                                 02137000
TCBRSV08 EQU   TCBFLGS3                                                 02138000
TCBRSV07 EQU   TCBFLGS3                                                 02139000
TCBRSV06 EQU   TCBFLGS3                                                 02140000
TCBABGM  EQU   TCBFLGS3                                                 02141000
TCBABTRM EQU   TCBFLGS3                                                 02142000
TCBADINP EQU   TCBFLGS3                                                 02143000
TCBFSM   EQU   TCBFLGS3                                                 02144000
TCBFTS   EQU   TCBFLGS2                                                 02145000
TCBFETXR EQU   TCBFLGS2                                                 02146000
TCBFDSOP EQU   TCBFLGS2                                                 02147000
TCBFJMC  EQU   TCBFLGS2                                                 02148000
TCBFSMC  EQU   TCBFLGS2                                                 02149000
TCBFABOP EQU   TCBFLGS2                                                 02150000
TCBFSTI  EQU   TCBFLGS2                                                 02151000
TCBFOINP EQU   TCBFLGS2                                                 02152000
TCBFX    EQU   TCBFLGS1                                                 02153000
TCBFS    EQU   TCBFLGS1                                                 02154000
TCBFT    EQU   TCBFLGS1                                                 02155000
TCBPDUMP EQU   TCBFLGS1                                                 02156000
TCBRSV04 EQU   TCBFLGS1                                                 02157000
TCBFERA  EQU   TCBFLGS1                                                 02158000
TCBFE    EQU   TCBFLGS1                                                 02159000
TCBFA    EQU   TCBFLGS1                                                 02160000
TCBZERO  EQU   TCBPKF                                                   02161000
TCBFLAG  EQU   TCBPKF                                                   02162000
TCBMSSB  EQU   TCBMSS+1                                                 02163000
TCBRSV03 EQU   TCBMSS                                                   02164000
TCBTRNB  EQU   TCBTRN+1                                                 02165000
TCBRSV02 EQU   TCBABF                                                   02166000
TCBOLTEP EQU   TCBABF                                                   02167000
TCBTCP   EQU   TCBABF                                                   02168000
TCBTCPP  EQU   TCBABF                                                   02169000
TCBRSV01 EQU   TCBABF                                                   02170000
TCBGRPH  EQU   TCBABF                                                   02171000
TCBNOCHK EQU   TCBABF                                                   02172000
TCBMOD91 EQU   TCBABF                                                   02173000
TCBCMPC  EQU   TCBCMP+1                                                 02174000
TCBRV318 EQU   TCBCMSG                                                  02175000
TCBRV317 EQU   TCBCIND                                                  02176000
TCBRV316 EQU   TCBCWTO                                                  02177000
TCBCASID EQU   TCBCDBL                                                  02178000
TCBNOCC  EQU   TCBSTCC                                                  02179000
TCBDMPO  EQU   TCBCPP                                                   02180000
TCBCSTEP EQU   TCBCMPF                                                  02181000
TCBCREQ  EQU   TCBCMPF                                                  02182000
TCBTIO   EQU   TCB+12                                                   02183000
TCBDEB   EQU   TCB+8                                                    02184000
TCBPIEA  EQU   TCBPIE+1                                                 02185000
TCBPM    EQU   TCBPMASK                                                 02186000
@NM00047 EQU   TCBPMASK                                                 02187000
TCBRBP   EQU   TCB                                                      02188000
TCBFRS6  EQU   TCBFRS+24                                                02189000
TCBFRS4  EQU   TCBFRS+16                                                02190000
TCBFRS2  EQU   TCBFRS+8                                                 02191000
TCBFRS0  EQU   TCBFRS                                                   02192000
NEXTTCB  EQU   TCBWORDS                                                 02193000
CVTLEVL  EQU   CVTRELNO+2                                               02194000
CVTNUMB  EQU   CVTRELNO                                                 02195000
CVTMDL   EQU   CVTFIX+250                                               02196000
@NM00046 EQU   CVTFIX+248                                               02197000
@NM00045 EQU   CVTFIX                                                   02198000
CVTRV482 EQU   CVTXTNT2+128                                             02199000
CVTRV481 EQU   CVTXTNT2+124                                             02200000
CVTRV480 EQU   CVTXTNT2+120                                             02201000
CVTRV479 EQU   CVTXTNT2+118                                             02202000
CVTRV478 EQU   CVTXTNT2+117                                             02203000
CVTRV477 EQU   CVTXTNT2+116                                             02204000
CVTRV476 EQU   CVTXTNT2+115                                             02205000
CVTRV475 EQU   CVTXTNT2+114                                             02206000
CVTRV474 EQU   CVTRV466                                                 02207000
CVTRV473 EQU   CVTRV466                                                 02208000
CVTRV472 EQU   CVTRV466                                                 02209000
CVTRV471 EQU   CVTRV466                                                 02210000
CVTRV470 EQU   CVTRV466                                                 02211000
CVTRV469 EQU   CVTRV466                                                 02212000
CVTRV468 EQU   CVTRV466                                                 02213000
CVTRV467 EQU   CVTRV466                                                 02214000
CVTRV465 EQU   CVTRV457                                                 02215000
CVTRV464 EQU   CVTRV457                                                 02216000
CVTRV463 EQU   CVTRV457                                                 02217000
CVTRV462 EQU   CVTRV457                                                 02218000
CVTRV461 EQU   CVTRV457                                                 02219000
CVTRV460 EQU   CVTRV457                                                 02220000
CVTRV459 EQU   CVTRV457                                                 02221000
CVTRV458 EQU   CVTRV457                                                 02222000
CVTRV456 EQU   CVTXTNT2+108                                             02223000
CVTRV455 EQU   CVTXTNT2+104                                             02224000
CVTRV454 EQU   CVTXTNT2+100                                             02225000
CVTRV453 EQU   CVTXTNT2+96                                              02226000
CVTRV452 EQU   CVTXTNT2+94                                              02227000
CVTRV451 EQU   CVTXTNT2+92                                              02228000
CVTRV450 EQU   CVTXTNT2+90                                              02229000
CVTRV449 EQU   CVTXTNT2+88                                              02230000
CVTRV448 EQU   CVTXTNT2+87                                              02231000
CVTRV447 EQU   CVTXTNT2+86                                              02232000
CVTRV446 EQU   CVTRV438                                                 02233000
CVTRV445 EQU   CVTRV438                                                 02234000
CVTRV444 EQU   CVTRV438                                                 02235000
CVTRV443 EQU   CVTRV438                                                 02236000
CVTRV442 EQU   CVTRV438                                                 02237000
CVTRV441 EQU   CVTRV438                                                 02238000
CVTRV440 EQU   CVTRV438                                                 02239000
CVTRV439 EQU   CVTRV438                                                 02240000
CVTRV437 EQU   CVTRV429                                                 02241000
CVTRV436 EQU   CVTRV429                                                 02242000
CVTRV435 EQU   CVTRV429                                                 02243000
CVTRV434 EQU   CVTRV429                                                 02244000
CVTRV433 EQU   CVTRV429                                                 02245000
CVTRV432 EQU   CVTRV429                                                 02246000
CVTRV431 EQU   CVTRV429                                                 02247000
CVTRV430 EQU   CVTRV429                                                 02248000
CVTRV428 EQU   CVTXTNT2+80                                              02249000
CVTRV427 EQU   CVTXTNT2+76                                              02250000
CVTRV426 EQU   CVTXTNT2+72                                              02251000
CVTRV425 EQU   CVTXTNT2+68                                              02252000
CVTATACT EQU   CVTATCVT                                                 02253000
CVTRV423 EQU   CVTXTNT2+62                                              02254000
CVTRV422 EQU   CVTXTNT2+60                                              02255000
CVTRV421 EQU   CVTXTNT2+58                                              02256000
CVTRV420 EQU   CVTXTNT2+56                                              02257000
CVTRV419 EQU   CVTXTNT2+55                                              02258000
CVTRV418 EQU   CVTXTNT2+54                                              02259000
CVTRV417 EQU   CVTRV409                                                 02260000
CVTRV416 EQU   CVTRV409                                                 02261000
CVTRV415 EQU   CVTRV409                                                 02262000
CVTRV414 EQU   CVTRV409                                                 02263000
CVTRV413 EQU   CVTRV409                                                 02264000
CVTRV412 EQU   CVTRV409                                                 02265000
CVTRV411 EQU   CVTRV409                                                 02266000
CVTRV410 EQU   CVTRV409                                                 02267000
CVTRV408 EQU   CVTRV400                                                 02268000
CVTRV407 EQU   CVTRV400                                                 02269000
CVTRV406 EQU   CVTRV400                                                 02270000
CVTRV405 EQU   CVTRV400                                                 02271000
CVTRV404 EQU   CVTRV400                                                 02272000
CVTRV403 EQU   CVTRV400                                                 02273000
CVTRV402 EQU   CVTRV400                                                 02274000
CVTRV401 EQU   CVTRV400                                                 02275000
CVTICB   EQU   CVTXTNT2+48                                              02276000
CVTSKTA  EQU   CVTXTNT2+44                                              02277000
CVTRSV99 EQU   CVTXTNT2+40                                              02278000
CVTRSV98 EQU   CVTXTNT2+36                                              02279000
CVTRSV97 EQU   CVTXTNT2+34                                              02280000
CVTRSV96 EQU   CVTXTNT2+32                                              02281000
CVTOLTEP EQU   CVTXTNT2+28                                              02282000
CVTQIDA  EQU   CVTQID+1                                                 02283000
CVTRSV95 EQU   CVTQID                                                   02284000
CVTRSV94 EQU   CVTXTNT2+20                                              02285000
CVTRSV93 EQU   CVTXTNT2+16                                              02286000
CVTRSV92 EQU   CVTXTNT2+12                                              02287000
CVTDEBVR EQU   CVTXTNT2+8                                               02288000
CVTRSV91 EQU   CVTXTNT2+6                                               02289000
CVTRSV9H EQU   CVTFLGBT                                                 02290000
CVTRSV9G EQU   CVTFLGBT                                                 02291000
CVTRSV9F EQU   CVTFLGBT                                                 02292000
CVTRSV9E EQU   CVTFLGBT                                                 02293000
CVTRSV9D EQU   CVTFLGBT                                                 02294000
CVTRSV9C EQU   CVTFLGBT                                                 02295000
CVTVME   EQU   CVTFLGBT                                                 02296000
CVTNPE   EQU   CVTFLGBT                                                 02297000
CVTNUCLS EQU   CVTXTNT2+4                                               02298000
CVTDSSVA EQU   CVTDSSV+1                                                02299000
CVTRSV89 EQU   CVTDSSV                                                  02300000
CVTRSV88 EQU   CVTXTNT1+8                                               02301000
CVTRSV87 EQU   CVTXTNT1+4                                               02302000
CVTFACHN EQU   CVTXTNT1                                                 02303000
CVTRV488 EQU   CVTMAP+412                                               02304000
CVTRV487 EQU   CVTMAP+408                                               02305000
CVTRV486 EQU   CVTMAP+404                                               02306000
CVTRV485 EQU   CVTMAP+400                                               02307000
CVTACTAP EQU   CVTMAP+396                                               02308000
CVTAUTH  EQU   CVTMAP+392                                               02309000
CVTATMCA EQU   CVTATMCT+1                                               02310000
CVTATMST EQU   CVTATMCT                                                 02311000
CVTRSV61 EQU   CVTMAP+384                                               02312000
CVTVOLT1 EQU   CVTVOLM1+1                                               02313000
CVTVOLI1 EQU   CVTVOLF1                                                 02314000
CVTSTOA  EQU   CVTMAP+376                                               02315000
CVTRSV58 EQU   CVTMAP+374                                               02316000
CVTRSV57 EQU   CVTMAP+372                                               02317000
CVTDDCE  EQU   CVTMAP+368                                               02318000
CVTPNWFR EQU   CVTMAP+364                                               02319000
CVTSMF   EQU   CVTMAP+360                                               02320000
CVTSULK  EQU   CVTMAP+358                                               02321000
CVTSLKO  EQU   CVTSYSK                                                  02322000
CVTSLKP  EQU   CVTSYSK                                                  02323000
CVTSLKQ  EQU   CVTSYSK                                                  02324000
CVTSLKR  EQU   CVTSYSK                                                  02325000
CVTRSV56 EQU   CVTSYSK                                                  02326000
CVTRSV55 EQU   CVTSYSK                                                  02327000
CVTRSV54 EQU   CVTSYSK                                                  02328000
CVTRSV53 EQU   CVTSYSK                                                  02329000
CVTRSV52 EQU   CVTA1F1                                                  02330000
CVTRSV51 EQU   CVTA1F1                                                  02331000
CVTRSV50 EQU   CVTA1F1                                                  02332000
CVTRSV49 EQU   CVTA1F1                                                  02333000
CVTRSV48 EQU   CVTA1F1                                                  02334000
CVTRSV47 EQU   CVTA1F1                                                  02335000
CVTSRSW  EQU   CVTA1F1                                                  02336000
CVTPFSW  EQU   CVTA1F1                                                  02337000
CVTPCVT  EQU   CVTMAP+352                                               02338000
CVTRSV46 EQU   CVTMAP+344                                               02339000
CVTRSV45 EQU   CVTMAP+340                                               02340000
CVTRSV44 EQU   CVTMAP+338                                               02341000
CVTRSV43 EQU   CVTMAP+336                                               02342000
CVTHJESA EQU   CVTHJES+1                                                02343000
CVTRSV42 EQU   CVTHJES                                                  02344000
CVTEXT2A EQU   CVTEXT2+1                                                02345000
CVTRSV41 EQU   CVTEXT2                                                  02346000
CVTAPFA  EQU   CVTAPF+1                                                 02347000
CVTRSV40 EQU   CVTAPF                                                   02348000
CVTRV518 EQU   CVTINTLA                                                 02349000
CVTRV517 EQU   CVTERPV                                                  02350000
CVTEORM  EQU   CVTMAP+312                                               02351000
CVTMCHPR EQU   CVTMAP+308                                               02352000
CVTTZ    EQU   CVTMAP+304                                               02353000
CVTJEPS  EQU   CVTMAP+300                                               02354000
CVTJESCT EQU   CVTMAP+296                                               02355000
CVTMODE  EQU   CVTMAP+292                                               02356000
CVTPTRV  EQU   CVTMAP+288                                               02357000
CVTREAL  EQU   CVTMAP+284                                               02358000
CVTRSV39 EQU   CVTMAP+280                                               02359000
CVTRSV38 EQU   CVTMAP+276                                               02360000
CVTDMSRA EQU   CVTDMSR+1                                                02361000
CVTRSV37 EQU   CVTDMSR                                                  02362000
CVTQMSGA EQU   CVTQMSG+1                                                02363000
CVTRSV36 EQU   CVTQMSG                                                  02364000
CVTPURGA EQU   CVTPURG+1                                                02365000
CVTRSV35 EQU   CVTPURG                                                  02366000
CVTATERA EQU   CVTATER+1                                                02367000
CVTSYST  EQU   CVTATER                                                  02368000
CVTVOLT2 EQU   CVTTAT                                                   02369000
CVTVOLI2 EQU   CVTVOLF2                                                 02370000
CVTAQAVB EQU   CVTAQAVT+1                                               02371000
CVTRSV34 EQU   CVTTCMFG                                                 02372000
CVTRSV33 EQU   CVTTCMFG                                                 02373000
CVTRSV32 EQU   CVTTCMFG                                                 02374000
CVTRSV31 EQU   CVTTCMFG                                                 02375000
CVTRSV30 EQU   CVTTCMFG                                                 02376000
CVTRSV29 EQU   CVTTCMFG                                                 02377000
CVTRSV28 EQU   CVTTCMFG                                                 02378000
CVTTCRDY EQU   CVTTCMFG                                                 02379000
CVTGTFA  EQU   CVTGTF+1                                                 02380000
CVTRSV27 EQU   CVTGTFST                                                 02381000
CVTRNIO  EQU   CVTGTFST                                                 02382000
CVTUSR   EQU   CVTGTFST                                                 02383000
CVTRV318 EQU   CVTFORM                                                  02384000
CVTRV317 EQU   CVTTMODE                                                 02385000
CVTRV316 EQU   CVTSTATE                                                 02386000
CVTRV315 EQU   CVTGTFS                                                  02387000
CVTGTFAV EQU   CVTGTFS                                                  02388000
CVT0SCR1 EQU   CVTMAP+232                                               02389000
CVTRV515 EQU   CVTMAP+228                                               02390000
CVTRMS   EQU   CVTMAP+224                                               02391000
CVTPATCH EQU   CVTMAP+220                                               02392000
CVTTSCE  EQU   CVTMAP+216                                               02393000
CVTLNKSC EQU   CVTMAP+214                                               02394000
CVTQABST EQU   CVTMAP+212                                               02395000
CVTMDLDS EQU   CVTMAP+208                                               02396000
CVTUSER  EQU   CVTMAP+204                                               02397000
CVTABEND EQU   CVTMAP+200                                               02398000
CVTRSV18 EQU   CVTMAP+192                                               02399000
CVTQLPAQ EQU   CVTMAP+188                                               02400000
CVTQCDSR EQU   CVTMAP+184                                               02401000
CVTRSV17 EQU   CVTOPTB                                                  02402000
CVTRSV16 EQU   CVTOPTB                                                  02403000
CVTFP    EQU   CVTOPTB                                                  02404000
CVTAPTHR EQU   CVTOPTB                                                  02405000
CVTNLOG  EQU   CVTOPTB                                                  02406000
CVTTOD   EQU   CVTOPTB                                                  02407000
CVTCTIMS EQU   CVTOPTB                                                  02408000
CVTPROT  EQU   CVTOPTB                                                  02409000
CVTXPFP  EQU   CVTOPTA                                                  02410000
CVTASCII EQU   CVTOPTA                                                  02411000
CVTRSV13 EQU   CVTOPTA                                                  02412000
CVTRSV12 EQU   CVTOPTA                                                  02413000
CVTNIP   EQU   CVTOPTA                                                  02414000
CVTDDR   EQU   CVTOPTA                                                  02415000
CVTAPR   EQU   CVTOPTA                                                  02416000
CVTCCH   EQU   CVTOPTA                                                  02417000
CVTSNCTR EQU   CVTMAP+180                                               02418000
CVTQMWR  EQU   CVTMAP+176                                               02419000
CVTQOCR  EQU   CVTMAP+172                                               02420000
CVT1EF00 EQU   CVTMAP+168                                               02421000
CVTMZ00  EQU   CVTMAP+164                                               02422000
CVTHEAD  EQU   CVTMAP+160                                               02423000
CVTRSV11 EQU   CVTMAP+156                                               02424000
CVT0PT01 EQU   CVTMAP+152                                               02425000
CVTMSER  EQU   CVTMAP+148                                               02426000
CVTRV516 EQU   CVTIERLC                                                 02427000
CVTILCH  EQU   CVTMAP+140                                               02428000
CVT0DS   EQU   CVTMAP+136                                               02429000
CVTFBOSV EQU   CVTMAP+132                                               02430000
CVTNUCB  EQU   CVTMAP+128                                               02431000
CVTIXAVL EQU   CVTMAP+124                                               02432000
CVTIOQET EQU   CVTMAP+120                                               02433000
CVTDCBA  EQU   CVTMAP+117                                               02434000
CVTMVS2  EQU   CVTDCB                                                   02435000
CVT6DAT  EQU   CVTDCB                                                   02436000
CVT4MPS  EQU   CVTDCB                                                   02437000
CVTRSV09 EQU   CVTDCB                                                   02438000
CVT4MS1  EQU   CVTDCB                                                   02439000
CVT2SPS  EQU   CVTDCB                                                   02440000
CVT1SSS  EQU   CVTDCB                                                   02441000
CVTRSV08 EQU   CVTDCB                                                   02442000
CVTSTB   EQU   CVTMAP+112                                               02443000
CVTQTD00 EQU   CVTMAP+108                                               02444000
CVTQTE00 EQU   CVTMAP+104                                               02445000
CVTCUCB  EQU   CVTMAP+100                                               02446000
CVTSJQ   EQU   CVTMAP+96                                                02447000
CVTPBLDL EQU   CVTMAP+92                                                02448000
CVTTPC   EQU   CVTMAP+88                                                02449000
CVTSVDCB EQU   CVTMAP+84                                                02450000
CVTBRET  EQU   CVTMAP+82                                                02451000
CVTEXIT  EQU   CVTMAP+80                                                02452000
CVT0FN00 EQU   CVTMAP+76                                                02453000
CVTDARA  EQU   CVTDAR+1                                                 02454000
CVTRSV07 EQU   CVTFLGS1                                                 02455000
CVTRSV06 EQU   CVTFLGS1                                                 02456000
CVTRSV05 EQU   CVTFLGS1                                                 02457000
CVTRSV04 EQU   CVTFLGS1                                                 02458000
CVTRSV03 EQU   CVTFLGS1                                                 02459000
CVTRSV02 EQU   CVTFLGS1                                                 02460000
CVTRSV01 EQU   CVTFLGS1                                                 02461000
CVTDMPLK EQU   CVTFLGS1                                                 02462000
CVTXITP  EQU   CVTMAP+68                                                02463000
CVTZDTAB EQU   CVTMAP+64                                                02464000
CVTMSLT  EQU   CVTMAP+60                                                02465000
CVTDATE  EQU   CVTMAP+56                                                02466000
CVTBTERM EQU   CVTMAP+52                                                02467000
CVTSYSAD EQU   CVTMAP+48                                                02468000
CVTXTLER EQU   CVTMAP+44                                                02469000
CVTILK2  EQU   CVTMAP+40                                                02470000
CVTILK1  EQU   CVTMAP+36                                                02471000
CVTPRLTV EQU   CVTMAP+32                                                02472000
CVTPCNVT EQU   CVTMAP+28                                                02473000
CVT0VL00 EQU   CVTMAP+24                                                02474000
CVTXAPG  EQU   CVTMAP+20                                                02475000
CVTBUF   EQU   CVTMAP+16                                                02476000
CVTJOB   EQU   CVTMAP+12                                                02477000
CVTLINK  EQU   CVTMAP+8                                                 02478000
CVT0EF00 EQU   CVTMAP+4                                                 02479000
CVT      EQU   CVTMAP                                                   02480000
LENFIX   EQU   CNTRLINF+1                                               02481000
CNTVAR   EQU   CNTRLINF                                                 02482000
VARINFO  EQU   VARFIELD+2                                               02483000
VARLEN   EQU   VARFIELD                                                 02484000
REPGOPT  EQU   REPCNTRL+6                                               02485000
REPCNT   EQU   REPCNTRL+5                                               02486000
@NM00044 EQU   EXTRCDPT+3                                               02487000
EXTGOCI  EQU   EXTRCDPT                                                 02488000
NREPLF   EQU   CATRCD+48                                                02489000
NREPCV   EQU   CATRCD+47                                                02490000
RCDSIZ   EQU   CATRCD+45                                                02491000
@NM00043 EQU   CATRCD+26                                                02492000
RCDDICTS EQU   CATRCD+22                                                02493000
RCDRACTS EQU   CATRCD+18                                                02494000
RCDCRADT EQU   CATRCD+14                                                02495000
RCDCRACI EQU   CATRCD+11                                                02496000
RCDCRAVL EQU   CATRCD+5                                                 02497000
RCDRELID EQU   CATRCD+4                                                 02498000
RCDKEYTY EQU   CATRCD                                                   02499000
CATGOGC  EQU   CATGOGC1                                                 02500000
CATGODEL EQU   CATGOGC1                                                 02501000
CATGOEXT EQU   CATGOGC1                                                 02502000
CATGODSP EQU   CATGOCI+1                                                02503000
@NM00042 EQU   CATGOFLG                                                 02504000
CCACPE4  EQU   CCARAB+16                                                02505000
CCACPE3  EQU   CCARAB+12                                                02506000
@NM00041 EQU   CCARAB+2                                                 02507000
CCARABRI EQU   CCARAB+1                                                 02508000
CCARBUPD EQU   CCARABFL                                                 02509000
@NM00040 EQU   CCARABFL                                                 02510000
CCARBPA  EQU   CCARABFL                                                 02511000
CCARBWR  EQU   CCARABFL                                                 02512000
CCARBU2  EQU   CCARABFL                                                 02513000
CCARBU1  EQU   CCARABFL                                                 02514000
DIC2GC   EQU   DIC2ENT+3                                                02515000
DIC2LC   EQU   DIC2ENT+2                                                02516000
DIC2ST   EQU   DIC2ENT+1                                                02517000
@NM00039 EQU   DIC2FLGS                                                 02518000
DIC2UPGD EQU   DIC2FLGS                                                 02519000
DIC2SCRA EQU   DIC2FLGS                                                 02520000
DIC2MV   EQU   DIC2FLGS                                                 02521000
DIC2FLG  EQU   DIC2FLGS                                                 02522000
DIC2COMB EQU   DIC2FLGS                                                 02523000
DIC2REP  EQU   DIC2FLGS                                                 02524000
DIC2VAR  EQU   DIC2FLGS                                                 02525000
DICTGC   EQU   DICTENT+3                                                02526000
DICTLC   EQU   DICTENT+2                                                02527000
DICTST   EQU   DICTENT+1                                                02528000
@NM00038 EQU   DICTFLGS                                                 02529000
DICTUPGD EQU   DICTFLGS                                                 02530000
DICTSCRA EQU   DICTFLGS                                                 02531000
DICTMV   EQU   DICTFLGS                                                 02532000
DICTFLG  EQU   DICTFLGS                                                 02533000
DICTCOMB EQU   DICTFLGS                                                 02534000
DICTREP  EQU   DICTFLGS                                                 02535000
DICTVAR  EQU   DICTFLGS                                                 02536000
ENTNAMEV EQU   ENTNAMES+1                                               02537000
ENTNAMET EQU   ENTNAMES                                                 02538000
WKALEN2  EQU   USERWKA+2                                                02539000
WKALEN1  EQU   USERWKA                                                  02540000
CTGFLPT  EQU   CTGFLDAT+4                                               02541000
CTGFLNG  EQU   CTGFLDAT                                                 02542000
CTGFLCHN EQU   CTGFL+12                                                 02543000
CTGFLDTS EQU   CTGFLDRE                                                 02544000
@NM00037 EQU   CTGFLDRE                                                 02545000
CTGFLDCD EQU   CTGFL+1                                                  02546000
CTGFLDNO EQU   CTGFL                                                    02547000
CTGFIELD EQU   CTGPL+28                                                 02548000
CTGPSWD  EQU   CTGJSCB                                                  02549000
@NM00035 EQU   CTGFBFLG                                                 02550000
CTGNGDSN EQU   CTGFBFLG                                                 02551000
CTGGDGB  EQU   CTGFBFLG                                                 02552000
CTGKEEP  EQU   CTGFBFLG                                                 02553000
CTGPAR   EQU   CTGFBFLG                                                 02554000
CTGFDBK  EQU   CTGNEWNM                                                 02555000
CTGNOFLD EQU   CTGPL+19                                                 02556000
CTGTYPE  EQU   CTGPL+18                                                 02557000
@NM00034 EQU   CTGDSORG                                                 02558000
CTGOPTNS EQU   CTGDSORG                                                 02559000
@NM00033 EQU   CTGOPTN4                                                 02560000
CTGDOCAT EQU   CTGOPTN4                                                 02561000
CTGLBASE EQU   CTGOPTN4                                                 02562000
CTGAM0   EQU   CTGOPTN3                                                 02563000
CTGNUM   EQU   CTGOPTN3                                                 02564000
CTGSRH   EQU   CTGOPTN3                                                 02565000
CTGGDGL  EQU   CTGOPTN3                                                 02566000
CTGSUPLT EQU   CTGOPTN3                                                 02567000
CTGFUNC  EQU   CTGOPTN3                                                 02568000
@NM00032 EQU   CTGOPTN2                                                 02569000
CTGSCR   EQU   CTGOPTN2                                                 02570000
CTGOVRID EQU   CTGOPTN2                                                 02571000
CTGDISC  EQU   CTGOPTN2                                                 02572000
CTGGTNXT EQU   CTGOPTN2                                                 02573000
CTGRCATN EQU   CTGVMNT                                                  02574000
CTGGTALL EQU   CTGREL                                                   02575000
CTGNSVS  EQU   CTGEXT                                                   02576000
CTGGENLD EQU   CTGOPTN1                                                 02577000
CTGCNAME EQU   CTGOPTN1                                                 02578000
CTGNAME  EQU   CTGOPTN1                                                 02579000
CTGREAD  EQU   CTGOPTN1                                                 02580000
CTGUPD   EQU   CTGOPTN1                                                 02581000
CTGCI    EQU   CTGOPTN1                                                 02582000
CTGMAST  EQU   CTGOPTN1                                                 02583000
CTGBYPSS EQU   CTGOPTN1                                                 02584000
CCAEND   EQU   IGGCCA+1492                                              02585000
CCADGDGA EQU   IGGCCA+1488                                              02586000
CCARETRX EQU   CCAERCDX+1                                               02587000
CCARESNX EQU   CCAERCDX                                                 02588000
CCAMODDX EQU   CCAPROBX                                                 02589000
CCASMFRC EQU   CCASMFP+2                                                02590000
CCASMFMD EQU   CCASMFP                                                  02591000
CCAREWKA EQU   IGGCCA+1476                                              02592000
CCAVTS   EQU   IGGCCA+1468                                              02593000
CCARAVCA EQU   IGGCCA+1460                                              02594000
CCARANCA EQU   IGGCCA+1452                                              02595000
CCADICTS EQU   IGGCCA+1448                                              02596000
CCASUMTT EQU   IGGCCA+1445                                              02597000
@NM00031 EQU   CCAFLG10                                                 02598000
CCAPRANX EQU   CCAFLG10                                                 02599000
CCARARTC EQU   CCAFLG10                                                 02600000
CCARAFEV EQU   CCAFLG10                                                 02601000
CCACATAC EQU   CCAFLG10                                                 02602000
CCAPDMW  EQU   CCAFLG10                                                 02603000
CCAINCPL EQU   CCAFLG10                                                 02604000
@NM00030 EQU   CCARALSA+2                                               02605000
CCACRABT EQU   CCARALSA                                                 02606000
CCARAREC EQU   IGGCCA+1436                                              02607000
CCARARBA EQU   IGGCCA+1432                                              02608000
CCARARPL EQU   IGGCCA+1428                                              02609000
CCARAACB EQU   IGGCCA+1424                                              02610000
CCACRACI EQU   IGGCCA+1420                                              02611000
CCASBASE EQU   IGGCCA+1417                                              02612000
CCATNQCT EQU   IGGCCA+1416                                              02613000
CCACUMPL EQU   IGGCCA+1412                                              02614000
CCADSPWA EQU   CCABZSAV                                                 02615000
CCAMODNM EQU   CCAREGS+4                                                02616000
@NM00029 EQU   CCAREGS                                                  02617000
@NM00028 EQU   IGGCCA+1057                                              02618000
@NM00027 EQU   CCARVFG1                                                 02619000
RVESBOR  EQU   CCARVFG1                                                 02620000
RVESBO   EQU   CCARVFG1                                                 02621000
RVCMSFG  EQU   CCARVFG1                                                 02622000
RVARFI   EQU   CCARVFG1                                                 02623000
RVCCAV   EQU   CCARVFG1                                                 02624000
ARFSBECH EQU   CCAARFWA+12                                              02625000
ARFSBSCH EQU   CCAARFWA+8                                               02626000
ARFGMADR EQU   CCAARFWA+4                                               02627000
ARFLEN   EQU   ARFGMLEN+1                                               02628000
ARFGMLP  EQU   ARFGMLEN                                                 02629000
CCAMNLL  EQU   CCAMNCAT+248                                             02630000
MNATARG2 EQU   CCAMNAT+244                                              02631000
MNATARG1 EQU   CCAMNAT+241                                              02632000
MNATSCLS EQU   MNATFLGS                                                 02633000
@NM00026 EQU   MNATFLGS                                                 02634000
MNATVAL  EQU   MNATFLGS                                                 02635000
@NM00025 EQU   CCAMNAT+1                                                02636000
@NM00024 EQU   MNATTOP                                                  02637000
CCABMRB2 EQU   IGGCCA+740                                               02638000
CCABMRB1 EQU   IGGCCA+736                                               02639000
CCABMWK4 EQU   IGGCCA+732                                               02640000
CCABMWK3 EQU   IGGCCA+728                                               02641000
CCABMWK2 EQU   IGGCCA+724                                               02642000
CCABMWK1 EQU   IGGCCA+720                                               02643000
CCABMSTR EQU   IGGCCA+718                                               02644000
CCABMBYT EQU   IGGCCA+716                                               02645000
CCABMBTL EQU   IGGCCA+714                                               02646000
CCABMBT1 EQU   IGGCCA+712                                               02647000
CCABMEND EQU   IGGCCA+708                                               02648000
CCABMPTR EQU   IGGCCA+704                                               02649000
CCABMGOP EQU   IGGCCA+700                                               02650000
CCABMPAD EQU   IGGCCA+699                                               02651000
@NM00023 EQU   IGGCCA+697                                               02652000
CCABMOST EQU   CCABMOFG                                                 02653000
CCABMOTR EQU   CCABMOUT+2                                               02654000
CCABMONN EQU   CCABMOUT                                                 02655000
@NM00022 EQU   CCABMINP+7                                               02656000
CCABMLST EQU   CCABMFLG                                                 02657000
CCABMCCK EQU   CCABMFLG                                                 02658000
CCABMSET EQU   CCABMFLG                                                 02659000
CCABMCHK EQU   CCABMFLG                                                 02660000
CCABMST  EQU   CCABMFLG                                                 02661000
CCABMMIN EQU   CCABMINP+4                                               02662000
CCABMLIM EQU   CCABMINP+2                                               02663000
CCABMTRK EQU   CCABMINP                                                 02664000
CCAR14S  EQU   IGGCCA+680                                               02665000
CCAXLATE EQU   IGGCCA+640                                               02666000
CCADEL2  EQU   IGGCCA+637                                               02667000
CCADEL1  EQU   IGGCCA+634                                               02668000
CCAVAR1  EQU   IGGCCA+614                                               02669000
CCAVAR   EQU   IGGCCA+594                                               02670000
CCADELN  EQU   IGGCCA+592                                               02671000
CCAVARPT EQU   IGGCCA+588                                               02672000
CCARBASE EQU   IGGCCA+584                                               02673000
CCARRAB  EQU   IGGCCA+580                                               02674000
CCAVARLN EQU   IGGCCA+578                                               02675000
CCACI3   EQU   IGGCCA+575                                               02676000
CCACI2   EQU   IGGCCA+572                                               02677000
CCACI1   EQU   IGGCCA+569                                               02678000
CCACHAIN EQU   IGGCCA+566                                               02679000
CCASMFLN EQU   IGGCCA+564                                               02680000
CCASMFG2 EQU   CCASMFLG+1                                               02681000
@NM00021 EQU   CCASMFG1                                                 02682000
CCASMFAL EQU   CCASMFSR                                                 02683000
CCASMFDF EQU   CCASMFUC                                                 02684000
CCASMFRD EQU   IGGCCA+556                                               02685000
CCANORBA EQU   IGGCCA+555                                               02686000
CCARESUM EQU   CCAFLG9                                                  02687000
CCARAICI EQU   CCAFLG9                                                  02688000
CCARAACT EQU   CCAFLG9                                                  02689000
CCAUCRA  EQU   CCAFLG9                                                  02690000
CCARACR  EQU   CCAFLG9                                                  02691000
CCARALRD EQU   CCAFLG9                                                  02692000
CCARAEOV EQU   CCAFLG9                                                  02693000
CCARABYC EQU   CCAFLG9                                                  02694000
CCAAUCAT EQU   CCAFLG8                                                  02695000
CCALEOD  EQU   CCAFLG8                                                  02696000
CCAVRIND EQU   CCAFLG8                                                  02697000
CCALPIND EQU   CCAFLG8                                                  02698000
CCASCICK EQU   CCAFLG8                                                  02699000
CCASCRA  EQU   CCAFLG8                                                  02700000
CCAVBUFI EQU   CCAFLG8                                                  02701000
CCADSRCL EQU   CCAFLG8                                                  02702000
CCACRABU EQU   CCAFLG7                                                  02703000
CCAFEOV  EQU   CCAFLG7                                                  02704000
CCAROREQ EQU   CCAFLG7                                                  02705000
CCAONCE  EQU   CCAFLG7                                                  02706000
CCASMFBR EQU   CCAFLG7                                                  02707000
CCASMFEX EQU   CCAFLG7                                                  02708000
CCALSP   EQU   CCAFLG7                                                  02709000
CCALCPL  EQU   IGGCCA+548                                               02710000
CCAALPTR EQU   IGGCCA+540                                               02711000
CCAILNG2 EQU   IGGCCA+536                                               02712000
CCAILNG3 EQU   IGGCCA+532                                               02713000
CCASDWAP EQU   IGGCCA+528                                               02714000
CCACWAP  EQU   IGGCCA+524                                               02715000
CCACDTCT EQU   IGGCCA+522                                               02716000
CCADTCT  EQU   IGGCCA+520                                               02717000
CCACDTA  EQU   IGGCCA+516                                               02718000
CCADTA   EQU   IGGCCA+512                                               02719000
CCASVCI1 EQU   IGGCCA+509                                               02720000
CCASVCI  EQU   IGGCCA+506                                               02721000
CCADISP  EQU   IGGCCA+504                                               02722000
CCAREPCT EQU   IGGCCA+502                                               02723000
CCADIFF  EQU   IGGCCA+500                                               02724000
CCADLEN  EQU   IGGCCA+498                                               02725000
CCAIXTPL EQU   IGGCCA+496                                               02726000
CCAGRHI1 EQU   CCASSEQ                                                  02727000
CCARCDID EQU   CCAGRGC                                                  02728000
@NM00020 EQU   IGGCCA+492                                               02729000
CCANEFV  EQU   IGGCCA+491                                               02730000
CCAGVEXT EQU   IGGCCA+488                                               02731000
CCANEVV  EQU   IGGCCA+486                                               02732000
CCAGVCT  EQU   IGGCCA+484                                               02733000
CCARABSM EQU   CCAIDPT3                                                 02734000
CCAIDPT2 EQU   IGGCCA+476                                               02735000
CCASMFIX EQU   IGGCCA+474                                               02736000
CCACNIX  EQU   IGGCCA+472                                               02737000
CCARBAL  EQU   IGGCCA+470                                               02738000
CCATLEN  EQU   CCATLNG                                                  02739000
CCARBA2  EQU   CCARBA+16                                                02740000
CCARBA1  EQU   CCARBA+12                                                02741000
CCATT    EQU   CCARBA+10                                                02742000
CCACCHH2 EQU   CCACRADT                                                 02743000
CCACCHH1 EQU   CCACRAVL+2                                               02744000
CCASS    EQU   CCACRAVL                                                 02745000
CCATEST  EQU   IGGCCA+444                                               02746000
CCATNO   EQU   IGGCCA+442                                               02747000
CCATREL  EQU   IGGCCA+410                                               02748000
CCATNUM  EQU   IGGCCA+408                                               02749000
CCATNREL EQU   IGGCCA+406                                               02750000
CCAIXREL EQU   IGGCCA+404                                               02751000
CCAIXFPL EQU   IGGCCA+402                                               02752000
@NM00019 EQU   IGGCCA+400                                               02753000
CCASN1   EQU   CCASN                                                    02754000
CCALREL1 EQU   CCALREL                                                  02755000
CCAGC    EQU   IGGCCA+395                                               02756000
CCACBASE EQU   IGGCCA+392                                               02757000
CCARABB  EQU   IGGCCA+380                                               02758000
CCAMCPL  EQU   CCAXCPL                                                  02759000
CCARABPT EQU   IGGCCA+368                                               02760000
CCATFLPT EQU   CCAFLPT                                                  02761000
CCAILNG  EQU   IGGCCA+360                                               02762000
CCASL    EQU   IGGCCA+358                                               02763000
CCAGOPLN EQU   IGGCCA+356                                               02764000
CCACPE71 EQU   IGGCCA+352                                               02765000
CCAIDPT  EQU   CCACPE7                                                  02766000
CCARABSE EQU   CCACPE61                                                 02767000
CCACPE53 EQU   IGGCCA+336                                               02768000
CCACPE52 EQU   IGGCCA+332                                               02769000
CCACPE51 EQU   IGGCCA+328                                               02770000
CCALUME  EQU   IGGCCA+324                                               02771000
CCAEXCMS EQU   CCACMS+4                                                 02772000
CCACMSWA EQU   CCACMS                                                   02773000
CCARPRM  EQU   IGGCCA+312                                               02774000
@NM00018 EQU   CCAMSSPL+10                                              02775000
@NM00017 EQU   CCAMSSPL+8                                               02776000
CCAMNPTR EQU   CCAMSSPL+4                                               02777000
CCAMNLLP EQU   CCAMSSPL                                                 02778000
CCAMLRET EQU   IGGCCA+296                                               02779000
CCAEDUCB EQU   CCAEQDQ+12                                               02780000
CCAEDRNM EQU   CCAEQDQ+8                                                02781000
CCAEDQNM EQU   CCAEQDQ+4                                                02782000
CCAEDRCD EQU   CCAEQDQ+3                                                02783000
@NM00016 EQU   CCAEDOPT                                                 02784000
CCAEDSHR EQU   CCAEDOPT                                                 02785000
CCAEDRLN EQU   CCAEQDQ+1                                                02786000
CCAEDXFF EQU   CCAEQDQ                                                  02787000
CCAASCI  EQU   IGGCCA+271                                               02788000
CCAASCIX EQU   IGGCCA+270                                               02789000
CCACRRP  EQU   IGGCCA+269                                               02790000
CCAASCIK EQU   IGGCCA+268                                               02791000
CCAEXTTH EQU   CCAEXTDE+6                                               02792000
CCAEXTHH EQU   CCAEXTAD+2                                               02793000
CCAEXTCC EQU   CCAEXTAD                                                 02794000
CCAEXTSS EQU   CCAEXTDE                                                 02795000
CCASSVOL EQU   CCADESA+2                                                02796000
CCAIXEXT EQU   CCADESA+1                                                02797000
CCANDEXT EQU   CCADESA                                                  02798000
CCARPL1  EQU   IGGCCA+220                                               02799000
CCAQLEN  EQU   IGGCCA+219                                               02800000
CCASC    EQU   IGGCCA+218                                               02801000
CCATQDB  EQU   CCATIQRN+2                                               02802000
CCATASID EQU   CCATIQRN                                                 02803000
CCARPLT  EQU   IGGCCA+211                                               02804000
CCARPLX  EQU   IGGCCA+210                                               02805000
CCARPLF  EQU   IGGCCA+209                                               02806000
CCARPLK  EQU   IGGCCA+208                                               02807000
CCACPE45 EQU   CCAR5SEG+8                                               02808000
CCACPE35 EQU   CCAR5SEG+4                                               02809000
CCACPE25 EQU   CCAR5SEG                                                 02810000
CCAR5REC EQU   CCARAB5+4                                                02811000
@NM00015 EQU   CCARAB5+2                                                02812000
CCAR5RPL EQU   CCARAB5+1                                                02813000
CCAR5UPD EQU   CCAR5FLG                                                 02814000
@NM00014 EQU   CCAR5FLG                                                 02815000
CCAR5PA  EQU   CCAR5FLG                                                 02816000
CCAR5WR  EQU   CCAR5FLG                                                 02817000
CCAR5U2  EQU   CCAR5FLG                                                 02818000
CCAR5U1  EQU   CCAR5FLG                                                 02819000
CCAR5UR  EQU   CCAR5FLG                                                 02820000
CCACPE44 EQU   CCAR4SEG+8                                               02821000
CCACPE34 EQU   CCAR4SEG+4                                               02822000
CCACPE24 EQU   CCAR4SEG                                                 02823000
CCAR4REC EQU   CCARAB4+4                                                02824000
@NM00013 EQU   CCARAB4+2                                                02825000
CCAR4RPL EQU   CCARAB4+1                                                02826000
CCAR4UPD EQU   CCAR4FLG                                                 02827000
@NM00012 EQU   CCAR4FLG                                                 02828000
CCAR4PA  EQU   CCAR4FLG                                                 02829000
CCAR4WR  EQU   CCAR4FLG                                                 02830000
CCAR4U2  EQU   CCAR4FLG                                                 02831000
CCAR4U1  EQU   CCAR4FLG                                                 02832000
CCAR4UR  EQU   CCAR4FLG                                                 02833000
CCACPE43 EQU   CCAR3SEG+8                                               02834000
CCACPE33 EQU   CCAR3SEG+4                                               02835000
CCACPE23 EQU   CCAR3SEG                                                 02836000
CCAR3REC EQU   CCARAB3+4                                                02837000
@NM00011 EQU   CCARAB3+2                                                02838000
CCAR3RPL EQU   CCARAB3+1                                                02839000
CCAR3UPD EQU   CCAR3FLG                                                 02840000
@NM00010 EQU   CCAR3FLG                                                 02841000
CCAR3PA  EQU   CCAR3FLG                                                 02842000
CCAR3WR  EQU   CCAR3FLG                                                 02843000
CCAR3U2  EQU   CCAR3FLG                                                 02844000
CCAR3U1  EQU   CCAR3FLG                                                 02845000
CCAR3UR  EQU   CCAR3FLG                                                 02846000
CCACPE42 EQU   CCAR2SEG+8                                               02847000
CCACPE32 EQU   CCAR2SEG+4                                               02848000
CCACPE22 EQU   CCAR2SEG                                                 02849000
CCAR2REC EQU   CCARAB2+4                                                02850000
@NM00009 EQU   CCARAB2+2                                                02851000
CCAR2RPL EQU   CCARAB2+1                                                02852000
CCAR2UPD EQU   CCAR2FLG                                                 02853000
@NM00008 EQU   CCAR2FLG                                                 02854000
CCAR2PA  EQU   CCAR2FLG                                                 02855000
CCAR2WR  EQU   CCAR2FLG                                                 02856000
CCAR2U2  EQU   CCAR2FLG                                                 02857000
CCAR2U1  EQU   CCAR2FLG                                                 02858000
CCAR2UR  EQU   CCAR2FLG                                                 02859000
CCACPE41 EQU   CCAR1SEG+8                                               02860000
CCACPE31 EQU   CCAR1SEG+4                                               02861000
CCACPE21 EQU   CCAR1SEG                                                 02862000
CCAR1REC EQU   CCARAB1+4                                                02863000
@NM00007 EQU   CCARAB1+2                                                02864000
CCAR1RPL EQU   CCARAB1+1                                                02865000
CCAR1UPD EQU   CCAR1FLG                                                 02866000
@NM00006 EQU   CCAR1FLG                                                 02867000
CCAR1PA  EQU   CCAR1FLG                                                 02868000
CCAR1WR  EQU   CCAR1FLG                                                 02869000
CCAR1U2  EQU   CCAR1FLG                                                 02870000
CCAR1U1  EQU   CCAR1FLG                                                 02871000
CCAR1UR  EQU   CCAR1FLG                                                 02872000
CCACPE40 EQU   CCAR0SEG+8                                               02873000
CCACPE30 EQU   CCAR0SEG+4                                               02874000
CCACPE20 EQU   CCAR0SEG                                                 02875000
CCAR0REC EQU   CCARAB0+4                                                02876000
@NM00005 EQU   CCARAB0+2                                                02877000
CCAR0RPL EQU   CCARAB0+1                                                02878000
CCAR0UPD EQU   CCAR0FLG                                                 02879000
@NM00004 EQU   CCAR0FLG                                                 02880000
CCAR0PA  EQU   CCAR0FLG                                                 02881000
CCAR0WR  EQU   CCAR0FLG                                                 02882000
CCAR0U2  EQU   CCAR0FLG                                                 02883000
CCAR0U1  EQU   CCAR0FLG                                                 02884000
CCAR0UR  EQU   CCAR0FLG                                                 02885000
@NM00003 EQU   CCASRCH+3                                                02886000
CCASRCIN EQU   CCASRID                                                  02887000
CCANPCCB EQU   IGGCCA+36                                                02888000
CCADPL   EQU   CCARB                                                    02889000
CCALBCYL EQU   CCATCB                                                   02890000
CCAMOD   EQU   CCAFLG6                                                  02891000
CCAEXT   EQU   CCAFLG6                                                  02892000
CCAREUSE EQU   CCAFLG6                                                  02893000
CCASUPFD EQU   CCAFLG6                                                  02894000
CCAINIT  EQU   CCAFLG6                                                  02895000
CCAMNOSP EQU   CCAFLG6                                                  02896000
CCADELP  EQU   CCAFLG6                                                  02897000
CCAMCODR EQU   CCAFLG6                                                  02898000
CCATEX2  EQU   CCAFLG5                                                  02899000
CCATEX1  EQU   CCAFLG5                                                  02900000
CCATEX   EQU   CCAFLG5                                                  02901000
CCATHIT  EQU   CCAFLG5                                                  02902000
CCAMODPA EQU   CCAFLG5                                                  02903000
CCAMEX1  EQU   CCAFLG5                                                  02904000
CCAMEX   EQU   CCAFLG5                                                  02905000
CCAMEX2  EQU   CCAFLG5                                                  02906000
CCATCOMP EQU   CCAFLG4                                                  02907000
CCAGVNE  EQU   CCAFLG4                                                  02908000
CCAGVEX  EQU   CCAFLG4                                                  02909000
CCAGVNBS EQU   CCAFLG4                                                  02910000
CCAGVNF  EQU   CCAFLG4                                                  02911000
CCAGVNC  EQU   CCAFLG4                                                  02912000
CCAF4BYS EQU   CCAFLG4                                                  02913000
CCAF4DRQ EQU   CCAFLG4                                                  02914000
CCAEGREC EQU   CCAFLG3                                                  02915000
CCALFT   EQU   CCAFLG3                                                  02916000
CCAELC2  EQU   CCAFLG3                                                  02917000
CCANF    EQU   CCAFLG3                                                  02918000
CCAEXGR2 EQU   CCAFLG3                                                  02919000
CCAGDSP  EQU   CCAFLG3                                                  02920000
CCAGC4   EQU   CCAFLG3                                                  02921000
CCAEXGR1 EQU   CCAFLG3                                                  02922000
CCAF2SMO EQU   CCAFLG2                                                  02923000
CCAF2CB  EQU   CCAF2COB                                                 02924000
CCAF2CO  EQU   CCAF2COB                                                 02925000
CCAF2RHS EQU   CCAFLG2                                                  02926000
CCAF2XEQ EQU   CCAFLG2                                                  02927000
CCAF2CCT EQU   CCAFLG2                                                  02928000
CCAF2NVC EQU   CCAFLG2                                                  02929000
CCAF2SYS EQU   CCAFLG2                                                  02930000
CCAF1DK  EQU   CCAFLG1                                                  02931000
CCAF1UP  EQU   CCAFLG1                                                  02932000
CCAF1CR  EQU   CCAFLG1                                                  02933000
CCAF1KGE EQU   CCAFLG1                                                  02934000
CCAF1KEY EQU   CCAFLG1                                                  02935000
CCAF1LRD EQU   CCAFLG1                                                  02936000
CCAF1CNS EQU   CCAFLG1                                                  02937000
CCAF1LPS EQU   CCAFLG1                                                  02938000
CCACD2   EQU   IGGCCA+13                                                02939000
@NM00002 EQU   IGGCCA+8                                                 02940000
CCACDR   EQU   CCAREASN                                                 02941000
CCAMODID EQU   CCAPROB                                                  02942000
CCASZ    EQU   IGGCCA+2                                                 02943000
CCAID    EQU   IGGCCA                                                   02944000
SMFREL   EQU   SMFLAG                                                   02945000
@NM00001 EQU   SMFLAG                                                   02946000
@NM00074 EQU   PSA+3668                                                 02947000
PSASTAK  EQU   PSA+3072                                                 02948000
@NM00073 EQU   PSA+1040                                                 02949000
PSAUSEND EQU   PSA+1040                                                 02950000
PSARV062 EQU   PSA+1036                                                 02951000
PSAATCVT EQU   PSA+1032                                                 02952000
PSAPCPSW EQU   PSA+1024                                                 02953000
PSAPIR2  EQU   PSA+1020                                                 02954000
PSARV059 EQU   PSA+1018                                                 02955000
PSASVC13 EQU   PSA+1016                                                 02956000
PSALSFCC EQU   PSA+1012                                                 02957000
PSASFACC EQU   PSA+1008                                                 02958000
PSASTOP  EQU   PSA+992                                                  02959000
PSASTART EQU   PSA+976                                                  02960000
PSARSPSW EQU   PSA+968                                                  02961000
PSASRPSW EQU   PSA+960                                                  02962000
PSARV045 EQU   PSA+892                                                  02963000
PSARV044 EQU   PSA+888                                                  02964000
PSARV043 EQU   PSA+884                                                  02965000
PSARV042 EQU   PSA+880                                                  02966000
PSARV041 EQU   PSA+876                                                  02967000
PSARV040 EQU   PSA+872                                                  02968000
PSARV025 EQU   PSA+868                                                  02969000
PSADSSED EQU   PSA+868                                                  02970000
PSADSSPR EQU   PSA+864                                                  02971000
PSADSSFW EQU   PSA+860                                                  02972000
PSADSS14 EQU   PSA+856                                                  02973000
PSADSSPP EQU   PSA+848                                                  02974000
PSADSSRP EQU   PSA+840                                                  02975000
PSADSS05 EQU   PSADSSF4                                                 02976000
PSADSS10 EQU   PSADSSF4                                                 02977000
PSADSSVE EQU   PSADSSF4                                                 02978000
PSADSSDE EQU   PSADSSF4                                                 02979000
PSADSSC0 EQU   PSADSSF4                                                 02980000
PSADSSIE EQU   PSADSSF4                                                 02981000
PSADSS12 EQU   PSADSSF4                                                 02982000
PSADSSRC EQU   PSADSSF4                                                 02983000
PSARV057 EQU   PSADSSF3                                                 02984000
PSARV056 EQU   PSADSSF3                                                 02985000
PSARV055 EQU   PSADSSF3                                                 02986000
PSADSSMC EQU   PSADSSF3                                                 02987000
PSADSSRW EQU   PSADSSF3                                                 02988000
PSADSSNM EQU   PSADSSF3                                                 02989000
PSADSSES EQU   PSADSSF3                                                 02990000
PSADSSGP EQU   PSADSSF3                                                 02991000
PSADSSF2 EQU   PSADSSFL+1                                               02992000
PSADSSPI EQU   PSADSSF1                                                 02993000
PSADSSOI EQU   PSADSSF1                                                 02994000
PSADSSSP EQU   PSADSSF1                                                 02995000
PSADSSTP EQU   PSADSSF1                                                 02996000
PSADSSDW EQU   PSADSSF1                                                 02997000
PSADSSDD EQU   PSADSSF1                                                 02998000
PSADSSDM EQU   PSADSSF1                                                 02999000
PSADSSMV EQU   PSADSSF1                                                 03000000
PSADSSTS EQU   PSA+816                                                  03001000
PSADSSWK EQU   PSA+812                                                  03002000
PSADSSR3 EQU   PSA+808                                                  03003000
PSADSSR2 EQU   PSA+804                                                  03004000
PSADSSRS EQU   PSA+800                                                  03005000
PSASTOR  EQU   PSA+796                                                  03006000
PSACPUSA EQU   PSA+794                                                  03007000
PSAVSTAP EQU   PSA+792                                                  03008000
PSAWKVAP EQU   PSA+788                                                  03009000
PSAWKRAP EQU   PSA+784                                                  03010000
PSAMCHIC EQU   PSA+783                                                  03011000
PSARV061 EQU   PSA+782                                                  03012000
PSASYMSK EQU   PSA+781                                                  03013000
PSAMCHFL EQU   PSA+780                                                  03014000
PSACR0   EQU   PSA+776                                                  03015000
PSAPSWSV EQU   PSA+768                                                  03016000
PSALITA  EQU   PSA+764                                                  03017000
PSACLHS  EQU   PSAHLHI                                                  03018000
PSALKR15 EQU   PSALKSA+60                                               03019000
PSALKR14 EQU   PSALKSA+56                                               03020000
PSALKR13 EQU   PSALKSA+52                                               03021000
PSALKR12 EQU   PSALKSA+48                                               03022000
PSALKR11 EQU   PSALKSA+44                                               03023000
PSALKR10 EQU   PSALKSA+40                                               03024000
PSALKR9  EQU   PSALKSA+36                                               03025000
PSALKR8  EQU   PSALKSA+32                                               03026000
PSALKR7  EQU   PSALKSA+28                                               03027000
PSALKR6  EQU   PSALKSA+24                                               03028000
PSALKR5  EQU   PSALKSA+20                                               03029000
PSALKR4  EQU   PSALKSA+16                                               03030000
PSALKR3  EQU   PSALKSA+12                                               03031000
PSALKR2  EQU   PSALKSA+8                                                03032000
PSALKR1  EQU   PSALKSA+4                                                03033000
PSALKR0  EQU   PSALKSA                                                  03034000
PSARV023 EQU   PSACLHT+52                                               03035000
PSALOCAL EQU   PSACLHT+48                                               03036000
PSACMSL  EQU   PSACLHT+44                                               03037000
PSAOPTL  EQU   PSACLHT+40                                               03038000
PSATPACL EQU   PSACLHT+36                                               03039000
PSATPDNL EQU   PSACLHT+32                                               03040000
PSATPNCL EQU   PSACLHT+28                                               03041000
PSAIOSLL EQU   PSACLHT+24                                               03042000
PSAIOSUL EQU   PSACLHT+20                                               03043000
PSAIOSCL EQU   PSACLHT+16                                               03044000
PSAIOSSL EQU   PSACLHT+12                                               03045000
PSASALCL EQU   PSACLHT+8                                                03046000
PSAASML  EQU   PSACLHT+4                                                03047000
PSADISPL EQU   PSACLHT                                                  03048000
PSASRSA  EQU   PSA+636                                                  03049000
PSARV050 EQU   PSA+634                                                  03050000
PSADSSGO EQU   PSA+633                                                  03051000
PSARECUR EQU   PSA+632                                                  03052000
PSAHLHIS EQU   PSA+628                                                  03053000
PSAIPCSA EQU   PSA+624                                                  03054000
@NM00072 EQU   PSA+621                                                  03055000
PSAIPCDM EQU   PSA+620                                                  03056000
PSAIPCD  EQU   PSA+616                                                  03057000
@NM00071 EQU   PSA+613                                                  03058000
PSAIPCRM EQU   PSA+612                                                  03059000
PSAIPCR  EQU   PSA+608                                                  03060000
PSAMCHEX EQU   PSA+600                                                  03061000
PSAMPSW  EQU   PSA+592                                                  03062000
PSAEXPS2 EQU   PSA+584                                                  03063000
PSAEXPS1 EQU   PSA+576                                                  03064000
PSAPIREG EQU   PSA+572                                                  03065000
PSARSREG EQU   PSA+568                                                  03066000
PSAGPREG EQU   PSA+556                                                  03067000
PSARV022 EQU   PSASUP4                                                  03068000
PSARV021 EQU   PSASUP4                                                  03069000
PSARV020 EQU   PSASUP4                                                  03070000
PSARV019 EQU   PSASUP4                                                  03071000
PSARV018 EQU   PSASUP4                                                  03072000
PSARV017 EQU   PSASUP4                                                  03073000
PSARV016 EQU   PSASUP4                                                  03074000
PSARV015 EQU   PSASUP4                                                  03075000
PSARV014 EQU   PSASUP3                                                  03076000
PSARV013 EQU   PSASUP3                                                  03077000
PSARV012 EQU   PSASUP3                                                  03078000
PSARV011 EQU   PSASUP3                                                  03079000
PSARV010 EQU   PSASUP3                                                  03080000
PSAPSREG EQU   PSASUP3                                                  03081000
PSAPI2   EQU   PSASUP3                                                  03082000
PSAIOSUP EQU   PSASUP3                                                  03083000
PSALCR   EQU   PSASUP2                                                  03084000
PSARTM   EQU   PSASUP2                                                  03085000
PSAACR   EQU   PSASUP2                                                  03086000
PSAIPCE2 EQU   PSASUP2                                                  03087000
PSAIPCES EQU   PSASUP2                                                  03088000
PSAIPCEC EQU   PSASUP2                                                  03089000
PSAGTF   EQU   PSASUP2                                                  03090000
PSAIPCRI EQU   PSASUP2                                                  03091000
PSAIPCRP EQU   PSASUP1                                                  03092000
PSAIPCDR EQU   PSASUP1                                                  03093000
PSADISP  EQU   PSASUP1                                                  03094000
PSALOCK  EQU   PSASUP1                                                  03095000
PSAPI    EQU   PSASUP1                                                  03096000
PSAEXT   EQU   PSASUP1                                                  03097000
PSASVC   EQU   PSASUP1                                                  03098000
PSAIO    EQU   PSASUP1                                                  03099000
PSAAOLD  EQU   PSA+548                                                  03100000
PSAANEW  EQU   PSA+544                                                  03101000
PSATOLD  EQU   PSA+540                                                  03102000
PSATNEW  EQU   PSA+536                                                  03103000
PSALCCAR EQU   PSA+532                                                  03104000
PSALCCAV EQU   PSA+528                                                  03105000
PSAPCCAR EQU   PSA+524                                                  03106000
PSAPCCAV EQU   PSA+520                                                  03107000
PSACPULA EQU   PSA+518                                                  03108000
PSACPUPA EQU   PSA+516                                                  03109000
PSAPSA   EQU   PSA+512                                                  03110000
FLCHDEND EQU   PSA+512                                                  03111000
FLCCRSAV EQU   FLCMCLA+280                                              03112000
FLCGRSAV EQU   FLCMCLA+216                                              03113000
FLCFPSAV EQU   FLCMCLA+184                                              03114000
FLCFLA   EQU   FLCMCLA+88                                               03115000
FLCRGNCD EQU   FLCMCLA+84                                               03116000
FLCFSAA  EQU   FLCFSA+1                                                 03117000
@NM00070 EQU   FLCFSA                                                   03118000
@NM00069 EQU   FLCMCLA+72                                               03119000
FLCMCIC  EQU   FLCMCLA+64                                               03120000
@NM00068 EQU   FLCMCLA+20                                               03121000
FLCIOAA  EQU   FLCIOA+1                                                 03122000
@NM00067 EQU   FLCIOA                                                   03123000
@NM00066 EQU   FLCMCLA+15                                               03124000
@NM00065 EQU   FLCMCLA+14                                               03125000
@NM00064 EQU   FLCMCLA+12                                               03126000
FLCLCL   EQU   FLCMCLA+8                                                03127000
FLCIOELA EQU   FLCIOEL+1                                                03128000
@NM00063 EQU   FLCIOEL                                                  03129000
FLCCHNID EQU   FLCMCLA                                                  03130000
@NM00062 EQU   PSA+160                                                  03131000
FLCMTRCD EQU   PSA+157                                                  03132000
@NM00061 EQU   PSA+156                                                  03133000
FLCPERA  EQU   FLCPER+1                                                 03134000
@NM00060 EQU   FLCPER                                                   03135000
@NM00059 EQU   PSA+151                                                  03136000
FLCPERCD EQU   PSA+150                                                  03137000
FLCMCNUM EQU   PSA+149                                                  03138000
@NM00058 EQU   PSA+148                                                  03139000
FLCTEAA  EQU   FLCTEA+1                                                 03140000
@NM00057 EQU   FLCTEA                                                   03141000
PSAPIPC  EQU   PSAPICOD                                                 03142000
PSAPIMC  EQU   PSAPICOD                                                 03143000
PSAPIPER EQU   PSAPICOD                                                 03144000
PSARV049 EQU   FLCPICOD                                                 03145000
FLCPILCB EQU   FLCPIILC                                                 03146000
@NM00056 EQU   FLCPIILC                                                 03147000
@NM00055 EQU   PSAEPPSW                                                 03148000
FLCSVCN  EQU   PSAESPSW+2                                               03149000
FLCSILCB EQU   FLCSVILC                                                 03150000
@NM00054 EQU   FLCSVILC                                                 03151000
@NM00053 EQU   PSAESPSW                                                 03152000
FLCEICOD EQU   PSAEEPSW+2                                               03153000
PSASPAD  EQU   PSAEEPSW                                                 03154000
@NM00052 EQU   PSA+128                                                  03155000
FLCINPSW EQU   PSA+120                                                  03156000
FLCMNPSW EQU   PSA+112                                                  03157000
FLCPNPSW EQU   PSA+104                                                  03158000
FLCSNPSW EQU   PSA+96                                                   03159000
FLCENPSW EQU   PSA+88                                                   03160000
FLCTRACE EQU   PSA+84                                                   03161000
FLCTIMER EQU   PSA+80                                                   03162000
FLCCVT2  EQU   PSA+76                                                   03163000
FLCCAW   EQU   PSA+72                                                   03164000
FLCCSW   EQU   PSA+64                                                   03165000
FLCIOPSW EQU   PSA+56                                                   03166000
FLCMOPSW EQU   PSA+48                                                   03167000
FLCPOPSW EQU   PSA+40                                                   03168000
FLCSOPSW EQU   PSA+32                                                   03169000
FLCEOPSW EQU   PSA+24                                                   03170000
@NM00051 EQU   FLCICCW2+4                                               03171000
FLCCVT   EQU   FLCICCW2                                                 03172000
FLCICCW1 EQU   FLCROPSW                                                 03173000
FLCIPPSW EQU   FLCRNPSW                                                 03174000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03175000
@RT00138 EQU   @RC00120                                                 03176000
@RT00206 EQU   @RC00182                                                 03177000
@PB00004 EQU   @EL00001                                                 03178000
@ENDDATA EQU   *                                                        03179000
         END   IGG0CLB3,(C'PLS0434',0602,75084)                         03180000
