         TITLE 'IGG0CLA8 - VSAM DEFINE CLEAN-UP OF STORAGE RESOURCES   *00001000
                        '                                               00002000
IGG0CLA8 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IGG0CLA8  75.012'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
         USING @MAINENT,@15                                             00011000
         USING @DATD-(CCATEMPS-IGGCCA),R11                              00012000
         DS 0F                                                          00013000
         DC CL8'IGGPDFRS'                                               00014000
         EJECT                                                          00015000
         B     @PB00002                                            0105 00016000
IGGPDFRS DS    0H                                                  0106 00017000
         ENTRY IGGPDFRS                                                 00018000
         DROP @15                                                       00019000
Z003     DS    0H                                                  0108 00020000
Z003DFRS DS    0H                                                  0109 00021000
         STM 12,14,12(13)                                               00022000
         LA 13,12(13)                                                   00023000
         BALR 12,0                                                      00024000
IGGSEGST DS 0H                                                          00025000
         USING *,12                                                     00026000
*   IF CMCANVOL^=NONE THEN          /* FREE CANDIDATE VOLUME LIST    */ 00027000
         L     @10,CCACMSWA(,R11)                                  0116 00028000
         L     @10,CMCANVOL(,@10)                                  0116 00029000
         LTR   @10,@10                                             0116 00030000
         BZ    @RF00116                                            0116 00031000
*     DO;                           /* DO CANDIDATE VOLUME PROCESSING*/ 00032000
*       CCAMNLEN=CMCANVOL->LTLENGTH;/* SIZE AND SUBPOOL              */ 00033000
         LH    @05,LTLENGTH(,@10)                                  0118 00034000
         STCM  @05,7,CCAMNLEN(R11)                                 0118 00035000
*       CCAMNADR=CMCANVOL;          /* CORE ADDRESS                  */ 00036000
         ST    @10,CCAMNADR(,R11)                                  0119 00037000
*       RFY                                                        0120 00038000
*         R1 RSTD;                                                 0120 00039000
*       R1=ADDR(CCAMSSPL);          /* POINT TO STRG MGMT P.L.       */ 00040000
         LA    R1,CCAMSSPL(,R11)                                   0121 00041000
*       CCAMNSPL=USUBPOOL;          /* STORE SUBPOOL VALUE           */ 00042000
         MVI   CCAMNSPL(R11),X'FC'                                 0122 00043000
*       DO;                                                        0123 00044000
*         IF MNATFULL=ON THEN       /* TRACKING TABLE FULL           */ 00045000
*                                                                  0124 00046000
         TM    MNATFULL(R11),B'10000000'                           0124 00047000
         BNO   @RF00124                                            0124 00048000
*           /*********************************************************/ 00049000
*           /*                                                       */ 00050000
*           /* CALL TO MODULE IGG0CLAT                               */ 00051000
*           /*                                                       */ 00052000
*           /*********************************************************/ 00053000
*                                                                  0125 00054000
*Z006ARFS:                                                         0125 00055000
*           CALL IGGPARFS;          /* YES,CALL SPILL ROUTINE        */ 00056000
Z006ARFS L     @15,@CV02974                                        0125 00057000
         BALR  @14,@15                                             0125 00058000
*         GEN REFS(CCAMNAT)(MVC CCAMNAT(248,11),CCAMNAT+8(11));/*  0126 00059000
*                                      PUSH AND TRACK                */ 00060000
@RF00124 DS    0H                                                  0126 00061000
         MVC CCAMNAT(248,11),CCAMNAT+8(11)                              00062000
*       END;                                                       0127 00063000
*                                                                  0127 00064000
*       /*************************************************************/ 00065000
*       /*                                                           */ 00066000
*       /* RELEASE MAIN STORAGE FROM USER SUBPOOL 252                */ 00067000
*       /*                                                           */ 00068000
*       /*************************************************************/ 00069000
*                                                                  0128 00070000
*       GEN(FREEMAIN L,MF=(E,(1))) ;                               0128 00071000
         FREEMAIN L,MF=(E,(1))                                          00072000
*       RFY                                                        0129 00073000
*         R1 UNRSTD;                                               0129 00074000
*       CMCANVOL=NONE;              /* CLEAR REFERENCE               */ 00075000
         L     @10,CCACMSWA(,R11)                                  0130 00076000
         SLR   @05,@05                                             0130 00077000
         ST    @05,CMCANVOL(,@10)                                  0130 00078000
*     END;                          /* END 'DO' FOR CANDIDATE VOLS   */ 00079000
*   ELSE                                                           0132 00080000
*     ;                             /* NO CANDIDATE VOLUMES LIST     */ 00081000
@RF00116 DS    0H                                                  0133 00082000
*   IF CMNRMEXT^=NONE THEN          /* CHECK FOR EXTENT LISTS        */ 00083000
         L     @10,CCACMSWA(,R11)                                  0133 00084000
         L     @10,CMNRMEXT(,@10)                                  0133 00085000
         LTR   @10,@10                                             0133 00086000
         BZ    @RF00133                                            0133 00087000
*     DO;                           /* FREE EXTENT LIST CORE         */ 00088000
*       CMEXRFRG=CMNRMEXT;          /* GET DIRECTORY BLOCK REFR      */ 00089000
         LR    CMEXRFRG,@10                                        0135 00090000
*Z007DFRE:                                                         0136 00091000
*       CALL IGGPDFRE;              /* FREE RESOURCES                */ 00092000
Z007DFRE BAL   @14,IGGPDFRE                                        0136 00093000
*       CMNRMEXT=NONE;              /* CLEAR REFERENCE               */ 00094000
         L     @10,CCACMSWA(,R11)                                  0137 00095000
         SLR   @05,@05                                             0137 00096000
         ST    @05,CMNRMEXT(,@10)                                  0137 00097000
*     END;                          /* END 'DO' FOR EXTENT LIST CORE */ 00098000
*   ELSE                                                           0139 00099000
*     ;                             /* NO EXTENT LISTS               */ 00100000
@RF00133 DS    0H                                                  0140 00101000
*   IF CCAMCPL^=NONE THEN           /* CHECK FOR INTERNAL CPL        */ 00102000
         L     @10,CCAMCPL(,R11)                                   0140 00103000
         LTR   @10,@10                                             0140 00104000
         BZ    @RF00140                                            0140 00105000
*     DO;                           /* PROCESSING FOR INTERNAL CPL   */ 00106000
*       CCAMNLEN=LENGTH(CTGPL)+(CCAMCPL->CTGNOFLD*LENGTH(CTGFIELD));    00107000
         SLR   @05,@05                                             0142 00108000
         IC    @05,CTGNOFLD(,@10)                                  0142 00109000
         SLA   @05,2                                               0142 00110000
         AH    @05,@CH00114                                        0142 00111000
         STCM  @05,7,CCAMNLEN(R11)                                 0142 00112000
*                                   /* SET CORE LENGTH               */ 00113000
*       CCAMNADR=CCAMCPL;           /* GET THE CORE ADDRESS          */ 00114000
         ST    @10,CCAMNADR(,R11)                                  0143 00115000
*       RFY                                                        0144 00116000
*         R1 RSTD;                                                 0144 00117000
*       R1=ADDR(CCAMSSPL);          /* POINT TO STRG MGMT P.L.       */ 00118000
         LA    R1,CCAMSSPL(,R11)                                   0145 00119000
*       CCAMNSPL=USUBPOOL;          /* STORE SUBPOOL VALUE           */ 00120000
         MVI   CCAMNSPL(R11),X'FC'                                 0146 00121000
*       DO;                                                        0147 00122000
*         IF MNATFULL=ON THEN       /* TRACKING TABLE FULL           */ 00123000
*                                                                  0148 00124000
         TM    MNATFULL(R11),B'10000000'                           0148 00125000
         BNO   @RF00148                                            0148 00126000
*           /*********************************************************/ 00127000
*           /*                                                       */ 00128000
*           /* CALL TO MODULE IGG0CLAT                               */ 00129000
*           /*                                                       */ 00130000
*           /*********************************************************/ 00131000
*                                                                  0149 00132000
*Z010ARFS:                                                         0149 00133000
*           CALL IGGPARFS;          /* YES,CALL SPILL ROUTINE        */ 00134000
Z010ARFS L     @15,@CV02974                                        0149 00135000
         BALR  @14,@15                                             0149 00136000
*         GEN REFS(CCAMNAT)(MVC CCAMNAT(248,11),CCAMNAT+8(11));/*  0150 00137000
*                                      PUSH AND TRACK                */ 00138000
@RF00148 DS    0H                                                  0150 00139000
         MVC CCAMNAT(248,11),CCAMNAT+8(11)                              00140000
*       END;                                                       0151 00141000
*                                                                  0151 00142000
*       /*************************************************************/ 00143000
*       /*                                                           */ 00144000
*       /* RELEASE MAIN STORAGE FROM USER SUBPOOL 252                */ 00145000
*       /*                                                           */ 00146000
*       /*************************************************************/ 00147000
*                                                                  0152 00148000
*       GEN(FREEMAIN L,MF=(E,(1))) ;                               0152 00149000
         FREEMAIN L,MF=(E,(1))                                          00150000
*       RFY                                                        0153 00151000
*         R1 UNRSTD;                                               0153 00152000
*       CCAMCPL=NONE;               /* CLEAR REFERENCE               */ 00153000
         SLR   @10,@10                                             0154 00154000
         ST    @10,CCAMCPL(,R11)                                   0154 00155000
*     END;                          /* END 'DO' FOR INTERNAL CPL     */ 00156000
*   ELSE                                                           0156 00157000
*     ;                             /* NO INTERNAL CPL EXISTS        */ 00158000
@RF00140 DS    0H                                                  0157 00159000
*   IF(CMASCFPL^=NONE&CMCISREQ=CMCISUSE)|(CMASCFPL^=NONE&CCACD1^=RCS)   00160000
*     THEN                          /* CHECK IF FREEMAIN REQUIRED    */ 00161000
         L     @10,CCACMSWA(,R11)                                  0157 00162000
         ICM   @05,15,CMASCFPL(@10)                                0157 00163000
         BZ    @GL00001                                            0157 00164000
         CLC   CMCISREQ(1,@10),CMCISUSE(@10)                       0157 00165000
         BE    @RT00157                                            0157 00166000
@GL00001 L     @10,CCACMSWA(,R11)                                  0157 00167000
         ICM   @05,15,CMASCFPL(@10)                                0157 00168000
         BZ    @RF00157                                            0157 00169000
         CLI   CCACD1(R11),0                                       0157 00170000
         BE    @RF00157                                            0157 00171000
@RT00157 DS    0H                                                  0158 00172000
*     DO;                           /* FREE THE ASSOCIATION FPL      */ 00173000
*       CCAMNLEN=LENGTH(CMASFPST);  /* GET THE CORE SIZE             */ 00174000
         MVC   CCAMNLEN(3,R11),@CF00118+1                          0159 00175000
*       CCAMNADR=CMASCFPL;          /* GET THE CORE ADDRESS          */ 00176000
         L     @10,CCACMSWA(,R11)                                  0160 00177000
         MVC   CCAMNADR(4,R11),CMASCFPL(@10)                       0160 00178000
*       RFY                                                        0161 00179000
*         R1 RSTD;                                                 0161 00180000
*       R1=ADDR(CCAMSSPL);          /* POINT TO STRG MGMT P.L.       */ 00181000
         LA    R1,CCAMSSPL(,R11)                                   0162 00182000
*       CCAMNSPL=USUBPOOL;          /* STORE SUBPOOL VALUE           */ 00183000
         MVI   CCAMNSPL(R11),X'FC'                                 0163 00184000
*       DO;                                                        0164 00185000
*         IF MNATFULL=ON THEN       /* TRACKING TABLE FULL           */ 00186000
*                                                                  0165 00187000
         TM    MNATFULL(R11),B'10000000'                           0165 00188000
         BNO   @RF00165                                            0165 00189000
*           /*********************************************************/ 00190000
*           /*                                                       */ 00191000
*           /* CALL TO MODULE IGG0CLAT                               */ 00192000
*           /*                                                       */ 00193000
*           /*********************************************************/ 00194000
*                                                                  0166 00195000
*Z013ARFS:                                                         0166 00196000
*           CALL IGGPARFS;          /* YES,CALL SPILL ROUTINE        */ 00197000
Z013ARFS L     @15,@CV02974                                        0166 00198000
         BALR  @14,@15                                             0166 00199000
*         GEN REFS(CCAMNAT)(MVC CCAMNAT(248,11),CCAMNAT+8(11));/*  0167 00200000
*                                      PUSH AND TRACK                */ 00201000
@RF00165 DS    0H                                                  0167 00202000
         MVC CCAMNAT(248,11),CCAMNAT+8(11)                              00203000
*       END;                                                       0168 00204000
*                                                                  0168 00205000
*       /*************************************************************/ 00206000
*       /*                                                           */ 00207000
*       /* RELEASE MAIN STORAGE FROM USER SUBPOOL 252                */ 00208000
*       /*                                                           */ 00209000
*       /*************************************************************/ 00210000
*                                                                  0169 00211000
*       GEN(FREEMAIN L,MF=(E,(1))) ;                               0169 00212000
         FREEMAIN L,MF=(E,(1))                                          00213000
*       RFY                                                        0170 00214000
*         R1 UNRSTD;                                               0170 00215000
*     END;                          /* END 'DO' TO FREE ASSOC FPL'S  */ 00216000
*   ELSE                                                           0172 00217000
*     ;                             /* NO ASSOCIATION FPL'S TO FREE  */ 00218000
@RF00157 DS    0H                                                  0173 00219000
*   IF(CMFPLIDX^=NONE&CMSSEXTS=NONE)|(CMSSEXTS^=NONE&CTGFVTYP=CTGTINDX) 00220000
*       |((CMFPLIDX^=NONE|CMSSEXTS^=NONE)&CCACD1^=RCS) THEN/* CHECK     00221000
*                                      CONDITIONS FOR FREEMAIN       */ 00222000
         SLR   @10,@10                                             0173 00223000
         L     @05,CCACMSWA(,R11)                                  0173 00224000
         C     @10,CMFPLIDX(,@05)                                  0173 00225000
         BE    @GL00005                                            0173 00226000
         C     @10,CMSSEXTS(,@05)                                  0173 00227000
         BE    @RT00173                                            0173 00228000
@GL00005 L     @10,CCACMSWA(,R11)                                  0173 00229000
         ICM   @05,15,CMSSEXTS(@10)                                0173 00230000
         BZ    @GL00004                                            0173 00231000
         L     @10,CMWFVTPT(,@10)                                  0173 00232000
         CLI   CTGFVTYP(@10),C'I'                                  0173 00233000
         BE    @RT00173                                            0173 00234000
@GL00004 SLR   @10,@10                                             0173 00235000
         L     @05,CCACMSWA(,R11)                                  0173 00236000
         C     @10,CMFPLIDX(,@05)                                  0173 00237000
         BNE   @GL00008                                            0173 00238000
         C     @10,CMSSEXTS(,@05)                                  0173 00239000
         BE    @RF00173                                            0173 00240000
@GL00008 CLI   CCACD1(R11),0                                       0173 00241000
         BE    @RF00173                                            0173 00242000
@RT00173 DS    0H                                                  0174 00243000
*     DO;                           /* FREE ALL FPLS                 */ 00244000
*       IF CMFPLIDX^=NONE THEN      /* FPL INDEX EXISTS              */ 00245000
         L     @10,CCACMSWA(,R11)                                  0175 00246000
         L     @10,CMFPLIDX(,@10)                                  0175 00247000
         LTR   @10,@10                                             0175 00248000
         BZ    @RF00175                                            0175 00249000
*         DO;                       /* FREE FPL DIR CORE             */ 00250000
*           CMEXRFRG=CMFPLIDX;      /* SET THE CORE ADDRESS          */ 00251000
         LR    CMEXRFRG,@10                                        0177 00252000
*Z014DFRE:                                                         0178 00253000
*           CALL IGGPDFRE;          /* FREE THE RESOURCES            */ 00254000
Z014DFRE BAL   @14,IGGPDFRE                                        0178 00255000
*         END;                                                     0179 00256000
*       ELSE                                                       0180 00257000
*         ;                         /* NO FPL INDEXES EXIST          */ 00258000
@RF00175 DS    0H                                                  0181 00259000
*       IF CMSSEXTS^=NONE&CTGFVTYP=CTGTINDX THEN/* INDEX AND SEQUENCE   00260000
*                                      SET WITH DATA                 */ 00261000
         L     @10,CCACMSWA(,R11)                                  0181 00262000
         L     @05,CMSSEXTS(,@10)                                  0181 00263000
         LTR   @05,@05                                             0181 00264000
         BZ    @RF00181                                            0181 00265000
         L     @10,CMWFVTPT(,@10)                                  0181 00266000
         CLI   CTGFVTYP(@10),C'I'                                  0181 00267000
         BNE   @RF00181                                            0181 00268000
*         DO;                                                      0182 00269000
*           CMEXRFRG=CMSSEXTS;      /* FREE SEQ SET FPLS ALSO        */ 00270000
         LR    CMEXRFRG,@05                                        0183 00271000
*Z015DFRE:                                                         0184 00272000
*           CALL IGGPDFRE;          /* FREE THE RESOURCES            */ 00273000
Z015DFRE BAL   @14,IGGPDFRE                                        0184 00274000
*         END;                                                     0185 00275000
*       ELSE                                                       0186 00276000
*         ;                         /* NOT SEQUENCE SET WITH DATA    */ 00277000
@RF00181 DS    0H                                                  0187 00278000
*     END;                          /* END 'DO' FOR ALL FPL'S        */ 00279000
*   ELSE                                                           0188 00280000
*     ;                             /* NO FPL'S TO FREE              */ 00281000
@RF00173 DS    0H                                                  0189 00282000
*   CMFPLIDX=NONE;                  /* CLEAR FPL REFERENCE           */ 00283000
         L     @10,CCACMSWA(,R11)                                  0189 00284000
         SLR   @05,@05                                             0189 00285000
         ST    @05,CMFPLIDX(,@10)                                  0189 00286000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 00287000
         BAL   @14,EXIT                                            0190 00288000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 00289000
         DS 0F                                                          00290000
*   GEN(DC CL8'IGGPDFRE');          /* NAME OF FOLLOWING PROCEDURE   */ 00291000
         DC CL8'IGGPDFRE'                                               00292000
*   END;                            /* END OF INNER PROCEDURE        */ 00293000
@EL00002 DS    0H                                                  0193 00294000
@EF00002 DS    0H                                                  0193 00295000
@ER00002 BR    @14                                                 0193 00296000
@PB00002 DS    0H                                                  0194 00297000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 00298000
         EJECT                                                          00299000
*                                                                  0195 00300000
*/********************************************************************/ 00301000
*/*                                                                  */ 00302000
*/*        IGGPDFRE  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */ 00303000
*/*                                                                  */ 00304000
*/********************************************************************/ 00305000
*                                                                  0195 00306000
*IGGPDFRE:                                                         0195 00307000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 00308000
         B     @PB00003                                            0195 00309000
IGGPDFRE DS    0H                                                  0196 00310000
*Z016:                              /* LABEL FOR PROCEDURE TRACKING  */ 00311000
*Z016DFRE:                          /* LABEL FOR PROCEDURE TRACKING  */ 00312000
*   RFY                                                            0196 00313000
*    (R5,                                                          0196 00314000
*     R6,                                                          0196 00315000
*     R7,                                                          0196 00316000
*     R8,                                                          0196 00317000
*     R9,                                                          0196 00318000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 00319000
Z016     DS    0H                                                  0196 00320000
Z016DFRE DS    0H                                                  0197 00321000
*   RFY                                                            0197 00322000
*    (R2,                                                          0197 00323000
*     R3,                                                          0197 00324000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 00325000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 00326000
         STM 12,14,12(13)                                               00327000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 00328000
         LA 13,12(13)                                                   00329000
*/********************************************************************/ 00330000
*/*  INTERNAL PROCEDURE TO FREE DIRECTORY BLOCKS AND THEIR ENTRIES   */ 00331000
*/********************************************************************/ 00332000
*                                                                  0200 00333000
*   WORKPROC='GO';                  /* INITIALIZE LOOP CNTRL VARIABLE*/ 00334000
         L     @10,CCACMSWA(,R11)                                  0200 00335000
         MVC   WORKPROC(2,@10),@CC03026                            0200 00336000
*   DO WHILE WORKPROC='GO';         /* DO FOR ALL DIRECTORIES ON   0201 00337000
*                                      CHAIN                         */ 00338000
         B     @DE00201                                            0201 00339000
@DL00201 DS    0H                                                  0202 00340000
*     DO INDXCTR2=INCR1 TO CMEXNENT;/* DO FOR ALL EXTENT ENTRIES     */ 00341000
         LA    INDXCTR2,1                                          0202 00342000
         B     @DE00202                                            0202 00343000
@DL00202 DS    0H                                                  0203 00344000
*       CCAMNLEN=CMEXETSZ(INDXCTR2);/* SET CORE LENGTH               */ 00345000
         LR    @10,INDXCTR2                                        0203 00346000
         SLA   @10,3                                               0203 00347000
         LH    @05,CMEXETSZ-8(@10,CMEXRFRG)                        0203 00348000
         STCM  @05,7,CCAMNLEN(R11)                                 0203 00349000
*       CCAMNADR=CMEXCRPT(INDXCTR2);/* GET THE CORE ADDRESS          */ 00350000
         L     @10,CMEXCRPT-8(@10,CMEXRFRG)                        0204 00351000
         ST    @10,CCAMNADR(,R11)                                  0204 00352000
*       RFY                                                        0205 00353000
*         R1 RSTD;                                                 0205 00354000
*       R1=ADDR(CCAMSSPL);          /* POINT TO STRG MGMT P.L.       */ 00355000
         LA    R1,CCAMSSPL(,R11)                                   0206 00356000
*       CCAMNSPL=USUBPOOL;          /* STORE SUBPOOL VALUE           */ 00357000
         MVI   CCAMNSPL(R11),X'FC'                                 0207 00358000
*       DO;                                                        0208 00359000
*         IF MNATFULL=ON THEN       /* TRACKING TABLE FULL           */ 00360000
*                                                                  0209 00361000
         TM    MNATFULL(R11),B'10000000'                           0209 00362000
         BNO   @RF00209                                            0209 00363000
*           /*********************************************************/ 00364000
*           /*                                                       */ 00365000
*           /* CALL TO MODULE IGG0CLAT                               */ 00366000
*           /*                                                       */ 00367000
*           /*********************************************************/ 00368000
*                                                                  0210 00369000
*Z019ARFS:                                                         0210 00370000
*           CALL IGGPARFS;          /* YES,CALL SPILL ROUTINE        */ 00371000
Z019ARFS L     @15,@CV02974                                        0210 00372000
         BALR  @14,@15                                             0210 00373000
*         GEN REFS(CCAMNAT)(MVC CCAMNAT(248,11),CCAMNAT+8(11));/*  0211 00374000
*                                      PUSH AND TRACK                */ 00375000
@RF00209 DS    0H                                                  0211 00376000
         MVC CCAMNAT(248,11),CCAMNAT+8(11)                              00377000
*       END;                                                       0212 00378000
*                                                                  0212 00379000
*       /*************************************************************/ 00380000
*       /*                                                           */ 00381000
*       /* RELEASE MAIN STORAGE FROM USER SUBPOOL 252                */ 00382000
*       /*                                                           */ 00383000
*       /*************************************************************/ 00384000
*                                                                  0213 00385000
*       GEN(FREEMAIN L,MF=(E,(1))) ;                               0213 00386000
         FREEMAIN L,MF=(E,(1))                                          00387000
*       RFY                                                        0214 00388000
*         R1 UNRSTD;                                               0214 00389000
*     END;                          /* END 'DO' FOR ALL EXTENT     0215 00390000
*                                      ENTRIES                       */ 00391000
         AH    INDXCTR2,@CH00037                                   0215 00392000
@DE00202 CH    INDXCTR2,CMEXNENT(,CMEXRFRG)                        0215 00393000
         BNH   @DL00202                                            0215 00394000
*     IF CMEXCHAN=NONE THEN         /* NO MORE DIRECTORIES ON CHAIN  */ 00395000
         ICM   @10,15,CMEXCHAN(CMEXRFRG)                           0216 00396000
         BNZ   @RF00216                                            0216 00397000
*       WORKPROC='NG';              /* SET HALT TO LOOP              */ 00398000
         L     @10,CCACMSWA(,R11)                                  0217 00399000
         MVC   WORKPROC(2,@10),@CC03029                            0217 00400000
*     ELSE                                                         0218 00401000
*       ;                           /* ANOTHER DIRECTORY EXISTS      */ 00402000
@RF00216 DS    0H                                                  0219 00403000
*     CCAMNLEN=DIRCORLN;            /* SET CORE LENGTH               */ 00404000
         MVC   CCAMNLEN(3,R11),@CF00060+1                          0219 00405000
*     CCAMNADR=CMEXRFRG;            /* SET CORE ADDRESS              */ 00406000
         ST    CMEXRFRG,CCAMNADR(,R11)                             0220 00407000
*     CMEXRFRG=CMEXCHAN;            /* SET POINTER TO NEXT ELEMENT   */ 00408000
         L     CMEXRFRG,CMEXCHAN(,CMEXRFRG)                        0221 00409000
*     RFY                                                          0222 00410000
*       R1 RSTD;                                                   0222 00411000
*     R1=ADDR(CCAMSSPL);            /* POINT TO STRG MGMT P.L.       */ 00412000
         LA    R1,CCAMSSPL(,R11)                                   0223 00413000
*     CCAMNSPL=USUBPOOL;            /* STORE SUBPOOL VALUE           */ 00414000
         MVI   CCAMNSPL(R11),X'FC'                                 0224 00415000
*     DO;                                                          0225 00416000
*       IF MNATFULL=ON THEN         /* TRACKING TABLE FULL           */ 00417000
*                                                                  0226 00418000
         TM    MNATFULL(R11),B'10000000'                           0226 00419000
         BNO   @RF00226                                            0226 00420000
*         /***********************************************************/ 00421000
*         /*                                                         */ 00422000
*         /* CALL TO MODULE IGG0CLAT                                 */ 00423000
*         /*                                                         */ 00424000
*         /***********************************************************/ 00425000
*                                                                  0227 00426000
*Z022ARFS:                                                         0227 00427000
*         CALL IGGPARFS;            /* YES,CALL SPILL ROUTINE        */ 00428000
Z022ARFS L     @15,@CV02974                                        0227 00429000
         BALR  @14,@15                                             0227 00430000
*       GEN REFS(CCAMNAT)(MVC CCAMNAT(248,11),CCAMNAT+8(11));/* PUSH    00431000
*                                      AND TRACK                     */ 00432000
@RF00226 DS    0H                                                  0228 00433000
         MVC CCAMNAT(248,11),CCAMNAT+8(11)                              00434000
*     END;                                                         0229 00435000
*                                                                  0229 00436000
*     /***************************************************************/ 00437000
*     /*                                                             */ 00438000
*     /* RELEASE MAIN STORAGE FROM USER SUBPOOL 252                  */ 00439000
*     /*                                                             */ 00440000
*     /***************************************************************/ 00441000
*                                                                  0230 00442000
*     GEN(FREEMAIN L,MF=(E,(1))) ;                                 0230 00443000
         FREEMAIN L,MF=(E,(1))                                          00444000
*     RFY                                                          0231 00445000
*       R1 UNRSTD;                                                 0231 00446000
*   END;                            /* END 'DO-WHILE' FOR ALL      0232 00447000
*                                      DIRECTORY CHAIN ELEMENTS      */ 00448000
@DE00201 L     @10,CCACMSWA(,R11)                                  0232 00449000
         CLC   WORKPROC(2,@10),@CC03026                            0232 00450000
         BE    @DL00201                                            0232 00451000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 00452000
         BAL   @14,EXIT                                            0233 00453000
*   END;                            /* END OF INNER PROCEDURE        */ 00454000
@EL00003 DS    0H                                                  0234 00455000
@EF00003 DS    0H                                                  0234 00456000
@ER00003 BR    @14                                                 0234 00457000
@PB00003 DS    0H                                                  0235 00458000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 00459000
         EJECT                                                          00460000
*                                                                  0236 00461000
*/********************************************************************/ 00462000
*/*                                                                  */ 00463000
*/*         RETURN-TO-CALLER  PROCEDURE-EXITING  SUBFUNCTION         */ 00464000
*/*                                                                  */ 00465000
*/********************************************************************/ 00466000
*                                                                  0236 00467000
*EXIT:                                                             0236 00468000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 00469000
         B     @PB00004                                            0236 00470000
EXIT     DS    0H                                                  0237 00471000
*   GEN(LM 12,14,0(13));            /* RESTORE REGISTERS OF CALLER   */ 00472000
         LM 12,14,0(13)                                                 00473000
*   GEN(MVI 12(13),255);            /* MARK END OF PDL               */ 00474000
         MVI 12(13),255                                                 00475000
*   GEN(BR 14);                     /* RETURN TO CALLER              */ 00476000
         BR 14                                                          00477000
*PATCH:                                                            0240 00478000
*   GEN(DC (12+((*+139-@MAINENT)/140))A(0));/* PATCH AREA            */ 00479000
PATCH    DC (12+((*+139-@MAINENT)/140))A(0)                             00480000
*   END;                            /* END OF EXIT PROCEDURE         */ 00481000
@EL00004 DS    0H                                                  0241 00482000
@EF00004 DS    0H                                                  0241 00483000
@ER00004 BR    @14                                                 0241 00484000
*   END                                                            0242 00485000
*                                                                  0242 00486000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00487000
*/*%INCLUDE SYSLIB  (IGGMCDCL)                                       */ 00488000
*/*%INCLUDE SYSLIB  (IGGMCTRC)                                       */ 00489000
*/*%INCLUDE SYSLIB  (IGGCCA  )                                       */ 00490000
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */ 00491000
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                       */ 00492000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00493000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00494000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00495000
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */ 00496000
*/*%INCLUDE SYSLIB  (AMCBS   )                                       */ 00497000
*/*%INCLUDE SYSLIB  (IGGCAXWA)                                       */ 00498000
*/*%INCLUDE SYSLIB  (IEZCTGFV)                                       */ 00499000
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                       */ 00500000
*/*%INCLUDE SYSLIB  (IEZCTGVL)                                       */ 00501000
*/*%INCLUDE SYSLIB  (IEZCTGCV)                                       */ 00502000
*/*%INCLUDE SYSLIB  (IGGMCMDM)                                       */ 00503000
*/*%INCLUDE SYSLIB  (IGGMCMWA)                                       */ 00504000
*                                                                  0242 00505000
*       ;                                                          0242 00506000
@EL00001 DS    0H                                                  0242 00507000
@EF00001 DS    0H                                                  0242 00508000
@ER00001 BR    @14                                                 0242 00509000
@DATA    DS    0H                                                       00510000
@CH00037 DC    H'1'                                                     00511000
@CH00114 DC    H'28'                                                    00512000
@DATD    DSECT                                                          00513000
         DS    0F                                                       00514000
IGG0CLA8 CSECT                                                          00515000
         DS    0F                                                       00516000
@CF00118 DC    F'36'                                                    00517000
@CF00060 DC    F'256'                                                   00518000
@DATD    DSECT                                                          00519000
         DS    0D                                                       00520000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00521000
@ENDDATD EQU   *                                                        00522000
IGG0CLA8 CSECT                                                          00523000
         DS    0F                                                       00524000
@SIZDATD DC    AL1(0)                                                   00525000
         DC    AL3(@ENDDATD-@DATD)                                      00526000
@CV02974 DC    V(IGGPARFS)                                              00527000
         DS    0D                                                       00528000
@CC03026 DC    C'GO'                                                    00529000
@CC03029 DC    C'NG'                                                    00530000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00531000
@01      EQU   01                                                       00532000
@02      EQU   02                                                       00533000
@03      EQU   03                                                       00534000
@04      EQU   04                                                       00535000
@05      EQU   05                                                       00536000
@06      EQU   06                                                       00537000
@07      EQU   07                                                       00538000
@08      EQU   08                                                       00539000
@09      EQU   09                                                       00540000
@10      EQU   10                                                       00541000
@11      EQU   11                                                       00542000
@12      EQU   12                                                       00543000
@13      EQU   13                                                       00544000
@14      EQU   14                                                       00545000
@15      EQU   15                                                       00546000
IGGSEGBR EQU   @12                                                      00547000
RWA      EQU   @02                                                      00548000
R1       EQU   @01                                                      00549000
R2       EQU   @02                                                      00550000
R3       EQU   @03                                                      00551000
R4       EQU   @04                                                      00552000
R5       EQU   @05                                                      00553000
R6       EQU   @06                                                      00554000
R7       EQU   @07                                                      00555000
R8       EQU   @08                                                      00556000
R9       EQU   @09                                                      00557000
R10      EQU   @10                                                      00558000
R11      EQU   @11                                                      00559000
R12      EQU   @12                                                      00560000
DCWABASE EQU   @04                                                      00561000
CMEXRFRG EQU   @02                                                      00562000
INDXCTR2 EQU   @03                                                      00563000
RET      EQU   @14                                                      00564000
RFLD     EQU   @04                                                      00565000
RGO      EQU   @15                                                      00566000
RNDX     EQU   @03                                                      00567000
RP0      EQU   @00                                                      00568000
RP1      EQU   @01                                                      00569000
RSAVE    EQU   @13                                                      00570000
RWK1     EQU   @06                                                      00571000
RWK2     EQU   @07                                                      00572000
RWK3     EQU   @08                                                      00573000
RWK4     EQU   @09                                                      00574000
RZERO    EQU   @00                                                      00575000
R0       EQU   @00                                                      00576000
R13      EQU   @13                                                      00577000
R14      EQU   @14                                                      00578000
R15      EQU   @15                                                      00579000
WKR2     EQU   @02                                                      00580000
WKR3     EQU   @03                                                      00581000
WKR4     EQU   @04                                                      00582000
CVTPTR   EQU   16                                                       00583000
PSA      EQU   0                                                        00584000
FLCRNPSW EQU   PSA                                                      00585000
FLCROPSW EQU   PSA+8                                                    00586000
FLCICCW2 EQU   PSA+16                                                   00587000
PSAEEPSW EQU   PSA+132                                                  00588000
PSAESPSW EQU   PSA+136                                                  00589000
FLCSVILC EQU   PSAESPSW+1                                               00590000
PSAEPPSW EQU   PSA+140                                                  00591000
FLCPIILC EQU   PSAEPPSW+1                                               00592000
FLCPICOD EQU   PSAEPPSW+2                                               00593000
PSAPICOD EQU   FLCPICOD+1                                               00594000
FLCTEA   EQU   PSAEPPSW+4                                               00595000
FLCPER   EQU   PSA+152                                                  00596000
FLCMCLA  EQU   PSA+168                                                  00597000
FLCIOEL  EQU   FLCMCLA+4                                                00598000
FLCIOA   EQU   FLCMCLA+16                                               00599000
FLCFSA   EQU   FLCMCLA+80                                               00600000
PSASUPER EQU   PSA+552                                                  00601000
PSASUP1  EQU   PSASUPER                                                 00602000
PSASUP2  EQU   PSASUPER+1                                               00603000
PSASUP3  EQU   PSASUPER+2                                               00604000
PSASUP4  EQU   PSASUPER+3                                               00605000
PSACLHT  EQU   PSA+640                                                  00606000
PSALKSA  EQU   PSA+696                                                  00607000
PSAHLHI  EQU   PSA+760                                                  00608000
PSADSSFL EQU   PSA+836                                                  00609000
PSADSSF1 EQU   PSADSSFL                                                 00610000
PSADSSF3 EQU   PSADSSFL+2                                               00611000
PSADSSF4 EQU   PSADSSFL+3                                               00612000
PSARSVT  EQU   PSA+896                                                  00613000
IGGCCA   EQU   0                                                        00614000
CCAPROB  EQU   IGGCCA+4                                                 00615000
CCAERRCD EQU   CCAPROB+2                                                00616000
CCAREASN EQU   CCAERRCD                                                 00617000
CCARETRN EQU   CCAERRCD+1                                               00618000
CCACD1   EQU   CCARETRN                                                 00619000
CCAFLG1  EQU   IGGCCA+14                                                00620000
CCAFLG2  EQU   IGGCCA+15                                                00621000
CCAF2COB EQU   CCAFLG2                                                  00622000
CCAFLG3  EQU   IGGCCA+16                                                00623000
CCAFLG4  EQU   IGGCCA+17                                                00624000
CCAFLG5  EQU   IGGCCA+18                                                00625000
CCAFLG6  EQU   IGGCCA+19                                                00626000
CCATCB   EQU   IGGCCA+20                                                00627000
CCARB    EQU   IGGCCA+24                                                00628000
CCACPL   EQU   IGGCCA+28                                                00629000
CCAACB   EQU   IGGCCA+32                                                00630000
CCAURAB  EQU   IGGCCA+40                                                00631000
CCASRCH  EQU   IGGCCA+44                                                00632000
CCASRID  EQU   CCASRCH                                                  00633000
CCARAB0  EQU   IGGCCA+88                                                00634000
CCAR0FLG EQU   CCARAB0                                                  00635000
CCAR0SEG EQU   CCARAB0+8                                                00636000
CCARAB1  EQU   IGGCCA+108                                               00637000
CCAR1FLG EQU   CCARAB1                                                  00638000
CCAR1SEG EQU   CCARAB1+8                                                00639000
CCARAB2  EQU   IGGCCA+128                                               00640000
CCAR2FLG EQU   CCARAB2                                                  00641000
CCAR2SEG EQU   CCARAB2+8                                                00642000
CCARAB3  EQU   IGGCCA+148                                               00643000
CCAR3FLG EQU   CCARAB3                                                  00644000
CCAR3SEG EQU   CCARAB3+8                                                00645000
CCARAB4  EQU   IGGCCA+168                                               00646000
CCAR4FLG EQU   CCARAB4                                                  00647000
CCAR4SEG EQU   CCARAB4+8                                                00648000
CCARAB5  EQU   IGGCCA+188                                               00649000
CCAR5FLG EQU   CCARAB5                                                  00650000
CCAR5SEG EQU   CCARAB5+8                                                00651000
CCADESA  EQU   IGGCCA+224                                               00652000
CCAEXTDE EQU   CCADESA+4                                                00653000
CCAEXTAD EQU   CCAEXTDE+2                                               00654000
CCAEQDQ  EQU   IGGCCA+280                                               00655000
CCAEDOPT EQU   CCAEQDQ+2                                                00656000
CCAMSSPL EQU   IGGCCA+300                                               00657000
CCAMNSPL EQU   CCAMSSPL+9                                               00658000
CCACMS   EQU   IGGCCA+316                                               00659000
CCACMSWA EQU   CCACMS                                                   00660000
CCACPE5  EQU   IGGCCA+324                                               00661000
CCACPE6  EQU   IGGCCA+340                                               00662000
CCACPE61 EQU   IGGCCA+344                                               00663000
CCACPE7  EQU   IGGCCA+348                                               00664000
CCAFLPT  EQU   IGGCCA+364                                               00665000
CCADICT  EQU   IGGCCA+372                                               00666000
CCAXCPL  EQU   IGGCCA+376                                               00667000
CCAMCPL  EQU   CCAXCPL                                                  00668000
CCALREL  EQU   IGGCCA+396                                               00669000
CCASN    EQU   IGGCCA+398                                               00670000
CCARBA   EQU   IGGCCA+448                                               00671000
CCACRAVL EQU   CCARBA                                                   00672000
CCACRADT EQU   CCARBA+6                                                 00673000
CCATLNG  EQU   IGGCCA+468                                               00674000
CCAIDPT3 EQU   IGGCCA+480                                               00675000
CCAGRGC  EQU   IGGCCA+493                                               00676000
CCAGRHI  EQU   IGGCCA+494                                               00677000
CCASSEQ  EQU   CCAGRHI                                                  00678000
CCAFLG7  EQU   IGGCCA+552                                               00679000
CCAFLG8  EQU   IGGCCA+553                                               00680000
CCAFLG9  EQU   IGGCCA+554                                               00681000
CCASMFLG EQU   IGGCCA+562                                               00682000
CCASMFG1 EQU   CCASMFLG                                                 00683000
CCASMFUC EQU   CCASMFG1                                                 00684000
CCASMFSR EQU   CCASMFG1                                                 00685000
CCABMINP EQU   IGGCCA+684                                               00686000
CCABMFLG EQU   CCABMINP+6                                               00687000
CCABMOUT EQU   IGGCCA+692                                               00688000
CCABMOFG EQU   CCABMOUT+4                                               00689000
CCATEMPS EQU   IGGCCA+744                                               00690000
CCAMNCAT EQU   IGGCCA+784                                               00691000
CCAMNAT  EQU   CCAMNCAT                                                 00692000
MNATTOP  EQU   CCAMNAT                                                  00693000
MNATFULL EQU   MNATTOP                                                  00694000
MNATFLGS EQU   CCAMNAT+240                                              00695000
CCAMNLEN EQU   CCAMNCAT+249                                             00696000
CCAMNADR EQU   CCAMNCAT+252                                             00697000
CCAARFWA EQU   IGGCCA+1040                                              00698000
ARFGMLEN EQU   CCAARFWA                                                 00699000
CCARVFG1 EQU   IGGCCA+1056                                              00700000
CCAREGS  EQU   IGGCCA+1060                                              00701000
CCABZSAV EQU   IGGCCA+1408                                              00702000
CCACUMPL EQU   IGGCCA+1412                                              00703000
CCARALSA EQU   IGGCCA+1440                                              00704000
CCAFLG10 EQU   IGGCCA+1444                                              00705000
CCASMFP  EQU   IGGCCA+1480                                              00706000
CCAPROBX EQU   IGGCCA+1484                                              00707000
CCAERCDX EQU   CCAPROBX+2                                               00708000
CTGPL    EQU   0                                                        00709000
CTGOPTN1 EQU   CTGPL                                                    00710000
CTGOPTN2 EQU   CTGPL+1                                                  00711000
CTGEXT   EQU   CTGOPTN2                                                 00712000
CTGERASE EQU   CTGOPTN2                                                 00713000
CTGSMF   EQU   CTGERASE                                                 00714000
CTGREL   EQU   CTGSMF                                                   00715000
CTGPURG  EQU   CTGOPTN2                                                 00716000
CTGVMNT  EQU   CTGPURG                                                  00717000
CTGOPTN3 EQU   CTGPL+2                                                  00718000
CTGOPTN4 EQU   CTGPL+3                                                  00719000
CTGENT   EQU   CTGPL+4                                                  00720000
CTGFVT   EQU   CTGENT                                                   00721000
CTGCAT   EQU   CTGPL+8                                                  00722000
CTGCVOL  EQU   CTGCAT                                                   00723000
CTGWKA   EQU   CTGPL+12                                                 00724000
CTGDSORG EQU   CTGPL+16                                                 00725000
CTGNOFLD EQU   CTGPL+19                                                 00726000
CTGDDNM  EQU   CTGPL+20                                                 00727000
CTGNEWNM EQU   CTGDDNM                                                  00728000
CTGFBFLG EQU   CTGNEWNM+2                                               00729000
CTGJSCB  EQU   CTGPL+24                                                 00730000
CTGFIELD EQU   CTGPL+28                                                 00731000
CTGFL    EQU   0                                                        00732000
CTGFLDGC EQU   CTGFL+2                                                  00733000
CTGFLDRE EQU   CTGFL+3                                                  00734000
CTGFLDWA EQU   CTGFL+4                                                  00735000
CTGFLDNM EQU   CTGFL+8                                                  00736000
CTGFLDAT EQU   CTGFL+16                                                 00737000
CTGFLPT  EQU   CTGFLDAT+4                                               00738000
USERWKA  EQU   0                                                        00739000
WKA      EQU   USERWKA+4                                                00740000
ENTNAMES EQU   WKA                                                      00741000
DICTENT  EQU   0                                                        00742000
DICTFLGS EQU   DICTENT                                                  00743000
DIC2ENT  EQU   0                                                        00744000
DIC2FLGS EQU   DIC2ENT                                                  00745000
CCARAB   EQU   0                                                        00746000
CCARABFL EQU   CCARAB                                                   00747000
CCACPE1  EQU   CCARAB+4                                                 00748000
CCACPE2  EQU   CCARAB+8                                                 00749000
CATGOPT  EQU   0                                                        00750000
CATGOCI  EQU   CATGOPT                                                  00751000
CATGOFLG EQU   CATGOCI                                                  00752000
CATGOGC1 EQU   CATGOPT+3                                                00753000
CATGOSEQ EQU   CATGOPT+4                                                00754000
CATRCD   EQU   0                                                        00755000
NREPLF   EQU   CATRCD+48                                                00756000
REPCNTRL EQU   0                                                        00757000
EXTRCDPT EQU   REPCNTRL                                                 00758000
VARFIELD EQU   0                                                        00759000
CNTRLINF EQU   0                                                        00760000
LENFIX   EQU   CNTRLINF+1                                               00761000
CVTMAP   EQU   0                                                        00762000
CVTTCBP  EQU   CVTMAP                                                   00763000
CVTDAR   EQU   CVTMAP+72                                                00764000
CVTFLGS1 EQU   CVTDAR                                                   00765000
CVTDCB   EQU   CVTMAP+116                                               00766000
CVTIERLC EQU   CVTMAP+144                                               00767000
CVTOPTA  EQU   CVTMAP+182                                               00768000
CVTOPTB  EQU   CVTMAP+183                                               00769000
CVTGTF   EQU   CVTMAP+236                                               00770000
CVTGTFST EQU   CVTGTF                                                   00771000
CVTGTFS  EQU   CVTGTFST                                                 00772000
CVTSTATE EQU   CVTGTFST                                                 00773000
CVTTMODE EQU   CVTGTFST                                                 00774000
CVTFORM  EQU   CVTGTFST                                                 00775000
CVTAQAVT EQU   CVTMAP+240                                               00776000
CVTTCMFG EQU   CVTAQAVT                                                 00777000
CVTVOLM2 EQU   CVTMAP+244                                               00778000
CVTTATA  EQU   CVTVOLM2                                                 00779000
CVTTSKS  EQU   CVTTATA                                                  00780000
CVTVOLF2 EQU   CVTTSKS                                                  00781000
CVTTAT   EQU   CVTTATA+1                                                00782000
CVTATER  EQU   CVTMAP+248                                               00783000
CVTEXT1  EQU   CVTMAP+252                                               00784000
CVTCBSP  EQU   CVTMAP+256                                               00785000
CVTPURG  EQU   CVTMAP+260                                               00786000
CVTAMFF  EQU   CVTMAP+264                                               00787000
CVTQMSG  EQU   CVTMAP+268                                               00788000
CVTDMSR  EQU   CVTMAP+272                                               00789000
CVTERPV  EQU   CVTMAP+316                                               00790000
CVTINTLA EQU   CVTMAP+320                                               00791000
CVTAPF   EQU   CVTMAP+324                                               00792000
CVTEXT2  EQU   CVTMAP+328                                               00793000
CVTHJES  EQU   CVTMAP+332                                               00794000
CVTPGSIA EQU   CVTMAP+348                                               00795000
CVTA1F1  EQU   CVTMAP+356                                               00796000
CVTSYSK  EQU   CVTMAP+357                                               00797000
CVTVOLM1 EQU   CVTMAP+380                                               00798000
CVTVOLF1 EQU   CVTVOLM1                                                 00799000
CVTATMCT EQU   CVTMAP+388                                               00800000
CVTXTNT1 EQU   0                                                        00801000
CVTXTNT2 EQU   0                                                        00802000
CVTDSSV  EQU   CVTXTNT2                                                 00803000
CVTFLGBT EQU   CVTXTNT2+5                                               00804000
CVTQID   EQU   CVTXTNT2+24                                              00805000
CVTRV400 EQU   CVTXTNT2+52                                              00806000
CVTRV409 EQU   CVTXTNT2+53                                              00807000
CVTATCVT EQU   CVTXTNT2+64                                              00808000
CVTRV429 EQU   CVTXTNT2+84                                              00809000
CVTRV438 EQU   CVTXTNT2+85                                              00810000
CVTRV457 EQU   CVTXTNT2+112                                             00811000
CVTRV466 EQU   CVTXTNT2+113                                             00812000
CVTFIX   EQU   0                                                        00813000
CVTRELNO EQU   CVTFIX+252                                               00814000
TCBWORDS EQU   0                                                        00815000
TCBPTR   EQU   TCBWORDS+4                                               00816000
TCBFIX   EQU   0                                                        00817000
TCBFRS   EQU   TCBFIX                                                   00818000
TCB      EQU   0                                                        00819000
TCBPIE   EQU   TCB+4                                                    00820000
TCBPMASK EQU   TCBPIE                                                   00821000
TCBCMP   EQU   TCB+16                                                   00822000
TCBCMPF  EQU   TCBCMP                                                   00823000
TCBCPP   EQU   TCBCMPF                                                  00824000
TCBSTCC  EQU   TCBCMPF                                                  00825000
TCBCDBL  EQU   TCBCMPF                                                  00826000
TCBCWTO  EQU   TCBCMPF                                                  00827000
TCBCIND  EQU   TCBCMPF                                                  00828000
TCBCMSG  EQU   TCBCMPF                                                  00829000
TCBTRN   EQU   TCB+20                                                   00830000
TCBABF   EQU   TCBTRN                                                   00831000
TCBMSS   EQU   TCB+24                                                   00832000
TCBPKF   EQU   TCB+28                                                   00833000
TCBFLGS  EQU   TCB+29                                                   00834000
TCBFLGS1 EQU   TCBFLGS                                                  00835000
TCBFLGS2 EQU   TCBFLGS+1                                                00836000
TCBFLGS3 EQU   TCBFLGS+2                                                00837000
TCBFLGS4 EQU   TCBFLGS+3                                                00838000
TCBFLGS5 EQU   TCBFLGS+4                                                00839000
TCBABWF  EQU   TCBFLGS5                                                 00840000
TCBJPQ   EQU   TCB+44                                                   00841000
TCBPURGE EQU   TCBJPQ                                                   00842000
TCBGRS   EQU   TCB+48                                                   00843000
TCBFSA   EQU   TCB+112                                                  00844000
TCBTME   EQU   TCB+120                                                  00845000
TCBJSTCB EQU   TCB+124                                                  00846000
TCBTSFLG EQU   TCB+148                                                  00847000
TCBTSTSK EQU   TCBTSFLG                                                 00848000
TCBSTAB  EQU   TCB+160                                                  00849000
TCBNSTAE EQU   TCBSTAB                                                  00850000
TCBTCT   EQU   TCB+164                                                  00851000
TCBTCTGF EQU   TCBTCT                                                   00852000
TCBSCNDY EQU   TCB+172                                                  00853000
TCBNDSP  EQU   TCBSCNDY                                                 00854000
TCBNDSP1 EQU   TCBNDSP+1                                                00855000
TCBNDSP2 EQU   TCBNDSP+2                                                00856000
TCBNDSP3 EQU   TCBNDSP+3                                                00857000
TCBJSCB  EQU   TCB+180                                                  00858000
TCBRECDE EQU   TCBJSCB                                                  00859000
TCBEXT1  EQU   TCB+196                                                  00860000
TCBBITS  EQU   TCB+200                                                  00861000
TCBNDSP4 EQU   TCBBITS                                                  00862000
TCBNDSP5 EQU   TCBBITS+1                                                00863000
TCBFLGS6 EQU   TCBBITS+2                                                00864000
TCBFLGS7 EQU   TCBBITS+3                                                00865000
TCBDAR   EQU   TCB+204                                                  00866000
TCBDARC  EQU   TCBDAR                                                   00867000
TCBEXT2  EQU   TCB+208                                                  00868000
TCBFOE   EQU   TCB+244                                                  00869000
TCBESTAE EQU   TCB+264                                                  00870000
TCBESTRM EQU   TCBESTAE+1                                               00871000
TCBFBYT1 EQU   TCB+276                                                  00872000
TCBFBYT2 EQU   TCB+277                                                  00873000
TCBRV124 EQU   TCB+278                                                  00874000
TCBRV133 EQU   TCB+279                                                  00875000
TCBXTNT2 EQU   0                                                        00876000
TCBGTF   EQU   TCBXTNT2                                                 00877000
TCBTFLG  EQU   TCBGTF                                                   00878000
TCBRV146 EQU   TCBXTNT2+28                                              00879000
TCBRV155 EQU   TCBXTNT2+29                                              00880000
TCBRV164 EQU   TCBXTNT2+30                                              00881000
TCBRV173 EQU   TCBXTNT2+31                                              00882000
IFGACB   EQU   0                                                        00883000
ACBCOMN  EQU   IFGACB                                                   00884000
ACBLENG  EQU   ACBCOMN+2                                                00885000
ACBLENG2 EQU   ACBLENG                                                  00886000
ACBAMBL  EQU   ACBCOMN+4                                                00887000
ACBJWA   EQU   ACBAMBL                                                  00888000
ACBMACRF EQU   ACBCOMN+12                                               00889000
ACBMACR1 EQU   ACBMACRF                                                 00890000
ACBADR   EQU   ACBMACR1                                                 00891000
ACBCNV   EQU   ACBMACR1                                                 00892000
ACBMACR2 EQU   ACBMACRF+1                                               00893000
ACBBUFPL EQU   ACBCOMN+20                                               00894000
ACBMACR3 EQU   ACBBUFPL                                                 00895000
ACBRECFM EQU   ACBCOMN+24                                               00896000
ACBCCTYP EQU   ACBCOMN+25                                               00897000
ACBOPT   EQU   ACBCOMN+26                                               00898000
ACBDSORG EQU   ACBOPT                                                   00899000
ACBCROPS EQU   ACBDSORG                                                 00900000
ACBEXLST EQU   ACBCOMN+36                                               00901000
ACBDDNM  EQU   ACBCOMN+40                                               00902000
ACBAMETH EQU   ACBDDNM+3                                                00903000
ACBOFLGS EQU   ACBCOMN+48                                               00904000
ACBEXFG  EQU   ACBOFLGS                                                 00905000
ACBIOSFG EQU   ACBOFLGS                                                 00906000
ACBINFLG EQU   ACBCOMN+50                                               00907000
ACBUJFCB EQU   ACBCOMN+52                                               00908000
ACBBLKSZ EQU   ACBCOMN+60                                               00909000
ACBUAPTR EQU   ACBCOMN+64                                               00910000
AMCBS    EQU   0                                                        00911000
CBSCMP   EQU   AMCBS+16                                                 00912000
CBSVSRT  EQU   AMCBS+32                                                 00913000
IGGCAXWA EQU   0                                                        00914000
CAXFLGS  EQU   IGGCAXWA+8                                               00915000
CAXFLG2  EQU   IGGCAXWA+9                                               00916000
CAXFLG3  EQU   IGGCAXWA+10                                              00917000
CAXCCR   EQU   IGGCAXWA+32                                              00918000
CAXCNAM  EQU   IGGCAXWA+52                                              00919000
CAXOPLST EQU   IGGCAXWA+96                                              00920000
COPTS    EQU   CAXOPLST                                                 00921000
CTGFV    EQU   0                                                        00922000
CTGFVTYP EQU   CTGFV                                                    00923000
CTGFVPRO EQU   CTGFV+1                                                  00924000
CTGFVSPC EQU   CTGFV+52                                                 00925000
CTGFVAMD EQU   CTGFV+56                                                 00926000
CTGFVLMT EQU   CTGFV+72                                                 00927000
CTGFVGAT EQU   CTGFV+76                                                 00928000
CTGWA    EQU   0                                                        00929000
CTGWAVL  EQU   CTGWA                                                    00930000
CTGVL    EQU   0                                                        00931000
CTGVLX   EQU   0                                                        00932000
CTGCV    EQU   0                                                        00933000
CTGCVDSN EQU   CTGCV+6                                                  00934000
MWA      EQU   0                                                        00935000
VLST     EQU   MWA+2                                                    00936000
CVOLIND  EQU   MWA+252                                                  00937000
ASGO     EQU   1                                                        00938000
PASSGO   EQU   1                                                        00939000
PASSWORD EQU   PASSGO                                                   00940000
USERAREC EQU   PASSGO+50                                                00941000
USERLIST EQU   0                                                        00942000
LTLENGTH EQU   USERLIST                                                 00943000
LTENTRY  EQU   USERLIST+2                                               00944000
LTRETCOD EQU   LTENTRY                                                  00945000
SPACEPRM EQU   0                                                        00946000
SPCOPTNS EQU   SPACEPRM+6                                               00947000
CTGDSATR EQU   0                                                        00948000
CTGATR1  EQU   CTGDSATR                                                 00949000
CTGATR2  EQU   CTGDSATR+1                                               00950000
RGATTRFL EQU   0                                                        00951000
RGATTR1  EQU   RGATTRFL                                                 00952000
RGATTSG1 EQU   RGATTRFL+1                                               00953000
DEVCHARS EQU   0                                                        00954000
RTDEVUCB EQU   DEVCHARS                                                 00955000
RTBOKAB  EQU   DEVCHARS+14                                              00956000
RTDVFLGS EQU   DEVCHARS+17                                              00957000
DSPTBL   EQU   0                                                        00958000
CMSWA    EQU   0                                                        00959000
CMWFLAGS EQU   CMSWA                                                    00960000
CMCISREQ EQU   CMSWA+1                                                  00961000
CMCISUSE EQU   CMSWA+2                                                  00962000
CMWRKATR EQU   CMCISUSE                                                 00963000
CMWFVTPT EQU   CMSWA+12                                                 00964000
CMASCFPL EQU   CMSWA+16                                                 00965000
CMCPLFVT EQU   CMSWA+20                                                 00966000
CMNRMEXT EQU   CMSWA+24                                                 00967000
CMLDTFPL EQU   CMNRMEXT                                                 00968000
CMSSEXTS EQU   CMSWA+28                                                 00969000
CMHDTFPL EQU   CMSSEXTS                                                 00970000
CMCANVOL EQU   CMSWA+32                                                 00971000
CMHIXFPL EQU   CMCANVOL                                                 00972000
CMRNGCTR EQU   CMSWA+40                                                 00973000
CMVOLCTR EQU   CMSWA+42                                                 00974000
CMSDFSPC EQU   CMSWA+48                                                 00975000
CMVLLIST EQU   CMSWA+64                                                 00976000
CMVLRTCD EQU   CMVLLIST+2                                               00977000
CMSPCATR EQU   CMSWA+76                                                 00978000
CMFPLIDX EQU   CMSWA+112                                                00979000
WORKPROC EQU   CMSWA+118                                                00980000
CMWASTOR EQU   CMSWA+132                                                00981000
CMPOT    EQU   CMWASTOR                                                 00982000
CMDCONV  EQU   CMPOT                                                    00983000
CMIXFANO EQU   CMDCONV                                                  00984000
CMPOTX   EQU   CMWASTOR+4                                               00985000
CMPBI    EQU   CMPOTX                                                   00986000
CMIXFANS EQU   CMPBI                                                    00987000
CMWABYTB EQU   CMSWA+140                                                00988000
CMPBIX   EQU   CMWABYTB                                                 00989000
CMNEST   EQU   CMPBIX                                                   00990000
CMFANT   EQU   CMNEST                                                   00991000
CMSPCQTY EQU   CMFANT                                                   00992000
CMWGENAM EQU   CMSWA+144                                                00993000
CMWDATE  EQU   CMWGENAM+12                                              00994000
CMWTIME  EQU   CMWGENAM+17                                              00995000
DCWPLSPS EQU   CMSWA+200                                                00996000
DCWPLSPL EQU   DCWPLSPS                                                 00997000
DCWPLBFS EQU   CMSWA+232                                                00998000
DCWPLBFL EQU   DCWPLBFS                                                 00999000
DCWPLEDS EQU   CMSWA+260                                                01000000
DCWPLEDL EQU   DCWPLEDS                                                 01001000
DCWPLARS EQU   CMSWA+288                                                01002000
DCWPLARL EQU   DCWPLARS                                                 01003000
DCWPLCDS EQU   CMSWA+316                                                01004000
DCWPLCDL EQU   DCWPLCDS                                                 01005000
CMUCATCI EQU   CMSWA+410                                                01006000
CUMPLWA  EQU   0                                                        01007000
CUMPL    EQU   CUMPLWA                                                  01008000
CUMIN    EQU   CUMPL                                                    01009000
CUMOUT   EQU   CUMPL+1                                                  01010000
CUMWA    EQU   CUMPLWA+8                                                01011000
CUMFLAG  EQU   CUMWA                                                    01012000
CUMWASS2 EQU   CUMWA+48                                                 01013000
CUMWASS  EQU   CUMWASS2+2                                               01014000
CUMWTYP  EQU   CUMWASS                                                  01015000
CMEXTCOR EQU   0                                                        01016000
CMEXCHAN EQU   CMEXTCOR                                                 01017000
CMEXNENT EQU   CMEXTCOR+4                                               01018000
CMEXHDRS EQU   CMEXTCOR+8                                               01019000
CMEXCRPT EQU   CMEXHDRS                                                 01020000
CMEXETSZ EQU   CMEXHDRS+6                                               01021000
CMASFPST EQU   0                                                        01022000
BUFSIZE  EQU   0                                                        01023000
CATRECRD EQU   0                                                        01024000
CATSN    EQU   0                                                        01025000
CI       EQU   0                                                        01026000
CTGVLDSP EQU   0                                                        01027000
DATEFLD  EQU   0                                                        01028000
ENTRYNAM EQU   0                                                        01029000
EXCPNAME EQU   0                                                        01030000
FIELDNM  EQU   0                                                        01031000
LRECL    EQU   0                                                        01032000
OWNIDFLD EQU   0                                                        01033000
TNAM     EQU   0                                                        01034000
@NM00037 EQU   CTGDDNM                                                  01035000
CTGPROB  EQU   @NM00037                                                 01036000
CTGREASN EQU   CTGPROB+2                                                01037000
CVTS01   EQU   CVTPGSIA                                                 01038000
CVTLPDIA EQU   CVTS01+12                                                01039000
CVTDIRST EQU   CVTLPDIA                                                 01040000
CVTSLIDA EQU   CVTS01+24                                                01041000
CVTCTLFG EQU   CVTS01+50                                                01042000
CVTRV210 EQU   CVTS01+424                                               01043000
CVTRV219 EQU   CVTS01+425                                               01044000
CVTRV228 EQU   CVTS01+426                                               01045000
CVTRV237 EQU   CVTS01+427                                               01046000
CVTMFRTR EQU   CVTS01+452                                               01047000
CVTRV262 EQU   CVTS01+468                                               01048000
CVTRV271 EQU   CVTS01+469                                               01049000
CVTRV280 EQU   CVTS01+470                                               01050000
CVTRV289 EQU   CVTS01+471                                               01051000
CVTGSDA  EQU   CVTS01+600                                               01052000
PSARSVTE EQU   PSARSVT                                                  01053000
MCATDSTR EQU   CVTAMFF                                                  01054000
CVTAMF1  EQU   MCATDSTR                                                 01055000
CTGRBASE EQU   NREPLF+1                                                 01056000
CATTR    EQU   CTGRBASE+58                                              01057000
CATTR1   EQU   CATTR                                                    01058000
CATTR2   EQU   CATTR+1                                                  01059000
COPEN    EQU   CTGRBASE+60                                              01060000
CSPACPRM EQU   CTGRBASE+65                                              01061000
@NM00099 EQU   CATTR1                                                   01062000
CCATTR   EQU   @NM00099                                                 01063000
@NM00100 EQU   CCATTR                                                   01064000
@NM00102 EQU   CATTR1                                                   01065000
CRGATTR  EQU   @NM00102                                                 01066000
CUPG     EQU   CRGATTR                                                  01067000
FLC      EQU   PSA                                                      01068000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01069000
@NM00103 EQU   CRGATTR                                                  01070000
CUPD     EQU   CUPG                                                     01071000
CPGSP    EQU   @NM00100                                                 01072000
@NM00101 EQU   @NM00100                                                 01073000
CEXT     EQU   CTGRBASE+86                                              01074000
CDOSUINF EQU   CTGRBASE+84                                              01075000
CLRECL   EQU   CTGRBASE+80                                              01076000
CHIA     EQU   CTGRBASE+76                                              01077000
CHIU     EQU   CTGRBASE+72                                              01078000
CSORT    EQU   CSPACPRM+6                                               01079000
CSEC     EQU   CSPACPRM+3                                               01080000
CPRIM    EQU   CSPACPRM                                                 01081000
CBUF     EQU   CTGRBASE+61                                              01082000
@NM00098 EQU   COPEN                                                    01083000
COPENDS  EQU   COPEN                                                    01084000
CNUS     EQU   CATTR2                                                   01085000
@NM00097 EQU   CATTR2                                                   01086000
CATTRSSH EQU   CATTR2                                                   01087000
CATTRISH EQU   CATTR2                                                   01088000
CTRKOV   EQU   CATTR1                                                   01089000
CTEMP    EQU   CATTR1                                                   01090000
CINHIB   EQU   CATTR1                                                   01091000
CRECOV   EQU   CATTR1                                                   01092000
CERASE   EQU   CATTR1                                                   01093000
CREUSE   EQU   CATTR1                                                   01094000
CUNIQ    EQU   CATTR1                                                   01095000
CSP      EQU   CATTR1                                                   01096000
CEXP     EQU   CTGRBASE+55                                              01097000
CCRE     EQU   CTGRBASE+52                                              01098000
COWNID   EQU   CTGRBASE+44                                              01099000
CNAME    EQU   CTGRBASE                                                 01100000
@NM00087 EQU   MCATDSTR+1                                               01101000
@NM00086 EQU   CVTAMF1                                                  01102000
AMF1NONX EQU   CVTAMF1                                                  01103000
AMF1OPEN EQU   CVTAMF1                                                  01104000
PSARSAV  EQU   PSARSVTE+60                                              01105000
PSARSTK  EQU   PSARSVTE+56                                              01106000
PSAESAV3 EQU   PSARSVTE+52                                              01107000
PSAESTK3 EQU   PSARSVTE+48                                              01108000
PSAESAV2 EQU   PSARSVTE+44                                              01109000
PSAESTK2 EQU   PSARSVTE+40                                              01110000
PSAESAV1 EQU   PSARSVTE+36                                              01111000
PSAESTK1 EQU   PSARSVTE+32                                              01112000
PSAPSAV  EQU   PSARSVTE+28                                              01113000
PSAPSTK  EQU   PSARSVTE+24                                              01114000
PSAMSAV  EQU   PSARSVTE+20                                              01115000
PSAMSTK  EQU   PSARSVTE+16                                              01116000
PSASSAV  EQU   PSARSVTE+12                                              01117000
PSASSTK  EQU   PSARSVTE+8                                               01118000
PSANSTK  EQU   PSARSVTE+4                                               01119000
PSACSTK  EQU   PSARSVTE                                                 01120000
CVTRV628 EQU   CVTS01+728                                               01121000
CVTRV627 EQU   CVTS01+724                                               01122000
CVTRV626 EQU   CVTS01+720                                               01123000
CVTRV625 EQU   CVTS01+716                                               01124000
CVTRV624 EQU   CVTS01+712                                               01125000
CVTRV623 EQU   CVTS01+708                                               01126000
CVTRV622 EQU   CVTS01+704                                               01127000
CVTRV621 EQU   CVTS01+700                                               01128000
CVTRV620 EQU   CVTS01+696                                               01129000
CVTRV619 EQU   CVTS01+692                                               01130000
CVTRV618 EQU   CVTS01+688                                               01131000
CVTRV617 EQU   CVTS01+684                                               01132000
CVTRV616 EQU   CVTS01+680                                               01133000
CVTRV615 EQU   CVTS01+676                                               01134000
CVTRV614 EQU   CVTS01+672                                               01135000
CVTRV613 EQU   CVTS01+668                                               01136000
CVTRV612 EQU   CVTS01+664                                               01137000
CVTRV611 EQU   CVTS01+660                                               01138000
CVTRV610 EQU   CVTS01+656                                               01139000
CVTRV609 EQU   CVTS01+652                                               01140000
CVTRV608 EQU   CVTS01+648                                               01141000
CVTRV607 EQU   CVTS01+644                                               01142000
CVTRV606 EQU   CVTS01+640                                               01143000
CVTRV605 EQU   CVTS01+636                                               01144000
CVTRV604 EQU   CVTS01+632                                               01145000
CVTEFF02 EQU   CVTS01+628                                               01146000
CVTCBBR  EQU   CVTS01+624                                               01147000
CVTSSCR  EQU   CVTS01+620                                               01148000
CVTEVENT EQU   CVTS01+616                                               01149000
CVTCRCA  EQU   CVTS01+612                                               01150000
CVTTPIO  EQU   CVTS01+608                                               01151000
CVTADV   EQU   CVTS01+604                                               01152000
CVTGSDAB EQU   CVTGSDA                                                  01153000
CVTQV3   EQU   CVTS01+596                                               01154000
CVTQV2   EQU   CVTS01+592                                               01155000
CVTQV1   EQU   CVTS01+588                                               01156000
CVTRPT   EQU   CVTS01+584                                               01157000
CVTSSRB  EQU   CVTS01+580                                               01158000
CVTCSDRL EQU   CVTS01+576                                               01159000
CVTEXP1  EQU   CVTS01+572                                               01160000
CVTRMPMT EQU   CVTS01+568                                               01161000
CVTRMPTT EQU   CVTS01+564                                               01162000
CVTVPSA  EQU   CVTS01+560                                               01163000
CVTVSTOP EQU   CVTS01+556                                               01164000
CVTGTFR8 EQU   CVTS01+552                                               01165000
CVTQUIT  EQU   CVTS01+548                                               01166000
CVTVACR  EQU   CVTS01+544                                               01167000
CVTWTCB  EQU   CVTS01+540                                               01168000
CVTSTPRS EQU   CVTS01+536                                               01169000
CVT0PT02 EQU   CVTS01+532                                               01170000
CVTDARCM EQU   CVTS01+528                                               01171000
CVTIRECM EQU   CVTS01+524                                               01172000
CVTJRECM EQU   CVTS01+520                                               01173000
CVTVEMS0 EQU   CVTS01+516                                               01174000
CVTSPFRR EQU   CVTS01+512                                               01175000
CVTRLSTG EQU   CVTS01+508                                               01176000
CVT0TC0A EQU   CVTS01+504                                               01177000
CVTGMBR  EQU   CVTS01+500                                               01178000
CVTLFRM  EQU   CVTS01+496                                               01179000
CVTRMBR  EQU   CVTS01+492                                               01180000
CVTVIOP  EQU   CVTS01+488                                               01181000
CVTRV307 EQU   CVTS01+486                                               01182000
CVTRV306 EQU   CVTS01+484                                               01183000
CVTRV305 EQU   CVTS01+482                                               01184000
CVTRV304 EQU   CVTS01+480                                               01185000
CVTRV303 EQU   CVTS01+478                                               01186000
CVTRV302 EQU   CVTS01+476                                               01187000
CVTRV301 EQU   CVTS01+475                                               01188000
CVTRV300 EQU   CVTS01+474                                               01189000
CVTRV299 EQU   CVTS01+473                                               01190000
CVTRV298 EQU   CVTS01+472                                               01191000
CVTRV297 EQU   CVTRV289                                                 01192000
CVTRV296 EQU   CVTRV289                                                 01193000
CVTRV295 EQU   CVTRV289                                                 01194000
CVTRV294 EQU   CVTRV289                                                 01195000
CVTRV293 EQU   CVTRV289                                                 01196000
CVTRV292 EQU   CVTRV289                                                 01197000
CVTRV291 EQU   CVTRV289                                                 01198000
CVTRV290 EQU   CVTRV289                                                 01199000
CVTRV288 EQU   CVTRV280                                                 01200000
CVTRV287 EQU   CVTRV280                                                 01201000
CVTRV286 EQU   CVTRV280                                                 01202000
CVTRV285 EQU   CVTRV280                                                 01203000
CVTRV284 EQU   CVTRV280                                                 01204000
CVTRV283 EQU   CVTRV280                                                 01205000
CVTRV282 EQU   CVTRV280                                                 01206000
CVTRV281 EQU   CVTRV280                                                 01207000
CVTRV279 EQU   CVTRV271                                                 01208000
CVTRV278 EQU   CVTRV271                                                 01209000
CVTRV277 EQU   CVTRV271                                                 01210000
CVTRV276 EQU   CVTRV271                                                 01211000
CVTRV275 EQU   CVTRV271                                                 01212000
CVTRV274 EQU   CVTRV271                                                 01213000
CVTRV273 EQU   CVTRV271                                                 01214000
CVTRV272 EQU   CVTRV271                                                 01215000
CVTRV270 EQU   CVTRV262                                                 01216000
CVTRV269 EQU   CVTRV262                                                 01217000
CVTRV268 EQU   CVTRV262                                                 01218000
CVTRV267 EQU   CVTRV262                                                 01219000
CVTRV266 EQU   CVTRV262                                                 01220000
CVTRV265 EQU   CVTRV262                                                 01221000
CVTRV264 EQU   CVTRV262                                                 01222000
CVTRV263 EQU   CVTRV262                                                 01223000
CVTVFP   EQU   CVTS01+464                                               01224000
CVTVSI   EQU   CVTS01+460                                               01225000
CVTVPSIB EQU   CVTS01+456                                               01226000
CVTMFACT EQU   CVTMFRTR                                                 01227000
CVTMFCTL EQU   CVTS01+448                                               01228000
CVTPVBP  EQU   CVTS01+444                                               01229000
CVTPWI   EQU   CVTS01+440                                               01230000
CVTRV254 EQU   CVTS01+438                                               01231000
CVTRV253 EQU   CVTS01+436                                               01232000
CVTRV252 EQU   CVTS01+434                                               01233000
CVTRV251 EQU   CVTS01+433                                               01234000
CVTRV250 EQU   CVTS01+432                                               01235000
CVTRV249 EQU   CVTS01+431                                               01236000
CVTRV248 EQU   CVTS01+430                                               01237000
CVTRV247 EQU   CVTS01+429                                               01238000
CVTRV246 EQU   CVTS01+428                                               01239000
CVTRV245 EQU   CVTRV237                                                 01240000
CVTRV244 EQU   CVTRV237                                                 01241000
CVTRV243 EQU   CVTRV237                                                 01242000
CVTRV242 EQU   CVTRV237                                                 01243000
CVTRV241 EQU   CVTRV237                                                 01244000
CVTRV240 EQU   CVTRV237                                                 01245000
CVTRV239 EQU   CVTRV237                                                 01246000
CVTRV238 EQU   CVTRV237                                                 01247000
CVTRV236 EQU   CVTRV228                                                 01248000
CVTRV235 EQU   CVTRV228                                                 01249000
CVTRV234 EQU   CVTRV228                                                 01250000
CVTRV233 EQU   CVTRV228                                                 01251000
CVTRV232 EQU   CVTRV228                                                 01252000
CVTRV231 EQU   CVTRV228                                                 01253000
CVTRV230 EQU   CVTRV228                                                 01254000
CVTRV229 EQU   CVTRV228                                                 01255000
CVTRV227 EQU   CVTRV219                                                 01256000
CVTRV226 EQU   CVTRV219                                                 01257000
CVTRV225 EQU   CVTRV219                                                 01258000
CVTRV224 EQU   CVTRV219                                                 01259000
CVTRV223 EQU   CVTRV219                                                 01260000
CVTRV222 EQU   CVTRV219                                                 01261000
CVTRV221 EQU   CVTRV219                                                 01262000
CVTRV220 EQU   CVTRV219                                                 01263000
CVTRV218 EQU   CVTRV210                                                 01264000
CVTRV217 EQU   CVTRV210                                                 01265000
CVTRV216 EQU   CVTRV210                                                 01266000
CVTRV215 EQU   CVTRV210                                                 01267000
CVTRV214 EQU   CVTRV210                                                 01268000
CVTRV213 EQU   CVTRV210                                                 01269000
CVTRV212 EQU   CVTRV210                                                 01270000
CVTRV211 EQU   CVTRV210                                                 01271000
CVTLCCAT EQU   CVTS01+420                                               01272000
CVTPCCAT EQU   CVTS01+416                                               01273000
CVTIPCRP EQU   CVTS01+412                                               01274000
CVTIPCRI EQU   CVTS01+408                                               01275000
CVTIPCDS EQU   CVTS01+404                                               01276000
CVTAIDVT EQU   CVTS01+400                                               01277000
CVTSSAP  EQU   CVTS01+396                                               01278000
CVTEHCIR EQU   CVTS01+392                                               01279000
CVTEHDEF EQU   CVTS01+388                                               01280000
CVTDAIR  EQU   CVTS01+384                                               01281000
CVTPERFM EQU   CVTS01+380                                               01282000
CVT044R2 EQU   CVTS01+376                                               01283000
CVTFETCH EQU   CVTS01+372                                               01284000
CVTRSTWD EQU   CVTS01+368                                               01285000
CVTSPOST EQU   CVTS01+364                                               01286000
CVTIOBP  EQU   CVTS01+360                                               01287000
CVTASMVT EQU   CVTS01+356                                               01288000
CVTRECRQ EQU   CVTS01+352                                               01289000
CVTWSAC  EQU   CVTS01+348                                               01290000
CVTRV149 EQU   CVTS01+344                                               01291000
CVTWSAL  EQU   CVTS01+340                                               01292000
CVTSPSA  EQU   CVTS01+336                                               01293000
CVTGLMN  EQU   CVTS01+332                                               01294000
CVTVEAC0 EQU   CVTS01+328                                               01295000
CVT062R1 EQU   CVTS01+324                                               01296000
CVTRPOST EQU   CVTS01+320                                               01297000
CVTDQIQE EQU   CVTS01+316                                               01298000
CVTCSD   EQU   CVTS01+312                                               01299000
CVTLKRMA EQU   CVTS01+308                                               01300000
CVTRSPIE EQU   CVTS01+304                                               01301000
CVTRENQ  EQU   CVTS01+300                                               01302000
CVTLQCB  EQU   CVTS01+296                                               01303000
CVTFQCB  EQU   CVTS01+292                                               01304000
CVTQCS01 EQU   CVTS01+288                                               01305000
CVTAPFT  EQU   CVTS01+284                                               01306000
CVTPARRL EQU   CVTS01+280                                               01307000
CVTVWAIT EQU   CVTS01+276                                               01308000
CVTGSPL  EQU   CVTS01+272                                               01309000
CVTLSMQ  EQU   CVTS01+268                                               01310000
CVTGSMQ  EQU   CVTS01+264                                               01311000
CVTEXPRO EQU   CVTS01+260                                               01312000
CVTOPCTP EQU   CVTS01+256                                               01313000
CVTSIC   EQU   CVTS01+252                                               01314000
CVTTPIOS EQU   CVTS01+248                                               01315000
CVTRTMS  EQU   CVTS01+244                                               01316000
CVTSDBF  EQU   CVTS01+240                                               01317000
CVTSCBP  EQU   CVTS01+236                                               01318000
CVTSDMP  EQU   CVTS01+232                                               01319000
CVTSV60  EQU   CVTS01+228                                               01320000
CVTRTMCT EQU   CVTS01+224                                               01321000
CVTASCBL EQU   CVTS01+220                                               01322000
CVTASCBH EQU   CVTS01+216                                               01323000
CVTGDA   EQU   CVTS01+212                                               01324000
CVTASVT  EQU   CVTS01+208                                               01325000
CVTVVMDI EQU   CVTS01+204                                               01326000
CVTAQTOP EQU   CVTS01+200                                               01327000
CVTIOSCS EQU   CVTS01+196                                               01328000
CVTSDRM  EQU   CVTS01+192                                               01329000
CVTOPTE  EQU   CVTS01+188                                               01330000
CVTSTXU  EQU   CVTS01+184                                               01331000
CVTQUIS  EQU   CVTS01+180                                               01332000
CVTPARS  EQU   CVTS01+176                                               01333000
CVTS1EE  EQU   CVTS01+172                                               01334000
CVTFRAS  EQU   CVTS01+168                                               01335000
CVTQSAS  EQU   CVTS01+164                                               01336000
CVTCRAS  EQU   CVTS01+160                                               01337000
CVTCRMN  EQU   CVTS01+156                                               01338000
CVTDELCP EQU   CVTS01+152                                               01339000
CVTFRECL EQU   CVTS01+148                                               01340000
CVTGETCL EQU   CVTS01+144                                               01341000
CVTBLDCP EQU   CVTS01+140                                               01342000
CVTAUTHL EQU   CVTS01+136                                               01343000
CVTSCAN  EQU   CVTS01+132                                               01344000
CVTRV144 EQU   CVTS01+130                                               01345000
CVTMAXMP EQU   CVTS01+128                                               01346000
CVTSTCK  EQU   CVTS01+124                                               01347000
CVTRV139 EQU   CVTS01+123                                               01348000
CVTDSSAC EQU   CVTS01+122                                               01349000
CVTRV513 EQU   CVTS01+121                                               01350000
CVTIOSPL EQU   CVTS01+120                                               01351000
CVTPTGT  EQU   CVTS01+116                                               01352000
CVTCSPIE EQU   CVTS01+112                                               01353000
CVTSMFEX EQU   CVTS01+108                                               01354000
CVTOLT0A EQU   CVTS01+104                                               01355000
CVTSRBRT EQU   CVTS01+100                                               01356000
CVTPUTL  EQU   CVTS01+96                                                01357000
CVTRV519 EQU   CVTS01+92                                                01358000
CVTRV327 EQU   CVTS01+88                                                01359000
CVTRV326 EQU   CVTS01+84                                                01360000
CVTRV325 EQU   CVTS01+80                                                01361000
CVTRV324 EQU   CVTS01+76                                                01362000
CVT0VL01 EQU   CVTS01+72                                                01363000
CVTSHRVM EQU   CVTS01+68                                                01364000
CVTRV332 EQU   CVTS01+64                                                01365000
CVTTAS   EQU   CVTS01+60                                                01366000
CVTRSCN  EQU   CVTS01+56                                                01367000
CVTTRAC2 EQU   CVTS01+54                                                01368000
CVTTRACE EQU   CVTS01+52                                                01369000
CVTAPG   EQU   CVTS01+51                                                01370000
CVTSDTRC EQU   CVTCTLFG                                                 01371000
CVTGTRCE EQU   CVTCTLFG                                                 01372000
CVTNOMP  EQU   CVTCTLFG                                                 01373000
CVTRSV79 EQU   CVTCTLFG                                                 01374000
CVTDSTAT EQU   CVTCTLFG                                                 01375000
CVTRSV78 EQU   CVTCTLFG                                                 01376000
CVTRV333 EQU   CVTCTLFG                                                 01377000
CVTRV323 EQU   CVTCTLFG                                                 01378000
CVTSPVLK EQU   CVTS01+49                                                01379000
CVTRSV77 EQU   CVTS01+48                                                01380000
CVTRV331 EQU   CVTS01+44                                                01381000
CVTRV330 EQU   CVTS01+40                                                01382000
CVTRV329 EQU   CVTS01+36                                                01383000
CVTRV328 EQU   CVTS01+32                                                01384000
CVTRV322 EQU   CVTS01+28                                                01385000
CVTSLID  EQU   CVTSLIDA+1                                               01386000
CVTSYLK  EQU   CVTSLIDA                                                 01387000
CVTRV321 EQU   CVTS01+20                                                01388000
CVTRV320 EQU   CVTS01+16                                                01389000
CVTLPDIR EQU   CVTLPDIA+1                                               01390000
CVTRSV69 EQU   CVTDIRST                                                 01391000
CVTRSV68 EQU   CVTDIRST                                                 01392000
CVTRSV67 EQU   CVTDIRST                                                 01393000
CVTRSV66 EQU   CVTDIRST                                                 01394000
CVTRSV65 EQU   CVTDIRST                                                 01395000
CVTRSV64 EQU   CVTDIRST                                                 01396000
CVTRSV63 EQU   CVTDIRST                                                 01397000
CVTDICOM EQU   CVTDIRST                                                 01398000
CVTPVTP  EQU   CVTS01+8                                                 01399000
CVTLPDSR EQU   CVTS01+4                                                 01400000
CVTGETL  EQU   CVTS01                                                   01401000
CTGREAS2 EQU   CTGREASN+1                                               01402000
CTGREAS1 EQU   CTGREASN                                                 01403000
CTGMODID EQU   CTGPROB                                                  01404000
CMAFNAME EQU   CMASFPST+33                                              01405000
CMAFTYPE EQU   CMASFPST+32                                              01406000
CMAFDNAM EQU   CMASFPST+24                                              01407000
CMAFPL   EQU   CMASFPST                                                 01408000
CMEXNUMB EQU   CMEXHDRS+5                                               01409000
@NM00124 EQU   CMEXHDRS+4                                               01410000
CMEXCRSZ EQU   CMEXTCOR+6                                               01411000
CUMRC    EQU   CUMWA+148                                                01412000
@NM00123 EQU   CUMWA+146                                                01413000
CUMFMWA  EQU   CUMWA+58                                                 01414000
CUMWCI2  EQU   CUMWASS2+7                                               01415000
CUMWTYP2 EQU   CUMWASS2+6                                               01416000
CUMWCI   EQU   CUMWASS+1                                                01417000
CUMTYPE  EQU   CUMWTYP                                                  01418000
CUMWREL  EQU   CUMWASS2                                                 01419000
CUMFN2   EQU   CUMWA+40                                                 01420000
CUMFN1   EQU   CUMWA+32                                                 01421000
CUMDY    EQU   CUMWA+29                                                 01422000
@NM00122 EQU   CUMWA+28                                                 01423000
CUMSRID  EQU   CUMWA+25                                                 01424000
@NM00121 EQU   CUMWA+24                                                 01425000
CUMRABD  EQU   CUMWA+20                                                 01426000
CUMRAB2  EQU   CUMWA+16                                                 01427000
CUMRAB1  EQU   CUMWA+12                                                 01428000
CUMRABB  EQU   CUMWA+8                                                  01429000
CUMURAB  EQU   CUMWA+4                                                  01430000
CUMBCI   EQU   CUMWA+1                                                  01431000
@NM00120 EQU   CUMFLAG                                                  01432000
CUMEXIT  EQU   CUMFLAG                                                  01433000
CUMICI   EQU   CUMPL+5                                                  01434000
CUMDCI   EQU   CUMPL+2                                                  01435000
@NM00119 EQU   CUMOUT                                                   01436000
CUMNE    EQU   CUMOUT                                                   01437000
CUMDUP   EQU   CUMOUT                                                   01438000
@NM00118 EQU   CUMIN                                                    01439000
CUMFUNC  EQU   CUMIN                                                    01440000
CUMNRG   EQU   CUMIN                                                    01441000
CUMFDEL  EQU   CUMIN                                                    01442000
CMBYTAU  EQU   CMSWA+500                                                01443000
CMBYTTRK EQU   CMSWA+496                                                01444000
CMSCTREC EQU   CMSWA+416                                                01445000
@NM00117 EQU   CMSWA+413                                                01446000
CMDEFACI EQU   CMUCATCI                                                 01447000
CMBLPTKS EQU   CMSWA+408                                                01448000
CMSDSPTB EQU   CMSWA+344                                                01449000
@NM00116 EQU   DCWPLCDS+27                                              01450000
DCWPLCDV EQU   DCWPLCDS+24                                              01451000
DCWPLCDA EQU   DCWPLCDL+16                                              01452000
DCWPLCDH EQU   DCWPLCDL                                                 01453000
DCWPLARV EQU   DCWPLARS+24                                              01454000
DCWPLARA EQU   DCWPLARL+16                                              01455000
DCWPLARH EQU   DCWPLARL                                                 01456000
@NM00115 EQU   DCWPLEDS+27                                              01457000
DCWPLEDV EQU   DCWPLEDS+24                                              01458000
DCWPLEDA EQU   DCWPLEDL+16                                              01459000
DCWPLEDH EQU   DCWPLEDL                                                 01460000
DCWPLBFV EQU   DCWPLBFS+24                                              01461000
DCWPLBFA EQU   DCWPLBFL+16                                              01462000
DCWPLBFH EQU   DCWPLBFL                                                 01463000
@NM00114 EQU   DCWPLSPS+31                                              01464000
DCWPLSPV EQU   DCWPLSPS+24                                              01465000
DCWPLSPA EQU   DCWPLSPL+16                                              01466000
DCWPLSPH EQU   DCWPLSPL                                                 01467000
DCWFPLPT EQU   CMSWA+196                                                01468000
DCWAREPT EQU   CMSWA+192                                                01469000
@NM00113 EQU   CMSWA+190                                                01470000
DCWIX    EQU   CMSWA+188                                                01471000
CMWPAD   EQU   CMWGENAM+35                                              01472000
CMWTIME2 EQU   CMWTIME+11                                               01473000
CMWDELM2 EQU   CMWTIME+9                                                01474000
CMWTIME1 EQU   CMWTIME+2                                                01475000
CMWDELM1 EQU   CMWTIME                                                  01476000
CMWDAY   EQU   CMWDATE+2                                                01477000
CMWYEAR  EQU   CMWDATE                                                  01478000
CMWFIXID EQU   CMWGENAM                                                 01479000
CMNCILL  EQU   CMSPCQTY                                                 01480000
CMNCITL  EQU   CMIXFANS                                                 01481000
CMWT     EQU   CMIXFANO                                                 01482000
CMDEFSWA EQU   CMSWA+128                                                01483000
CMSRCCOR EQU   CMSWA+124                                                01484000
CMEXTLST EQU   CMSWA+120                                                01485000
@NM00112 EQU   CMSWA+116                                                01486000
CMCNVNO  EQU   CMSWA+110                                                01487000
CMCNVLEN EQU   CMSWA+108                                                01488000
CMTRKCYL EQU   CMSPCATR+12                                              01489000
CMTRKPCA EQU   CMSPCATR+10                                              01490000
CMBLKTRK EQU   CMSPCATR+8                                               01491000
CMSWADTY EQU   CMSPCATR+4                                               01492000
CMPHYBLK EQU   CMSPCATR                                                 01493000
CMTOTVOL EQU   CMSWA+74                                                 01494000
CMVLVOL  EQU   CMVLLIST+4                                               01495000
CMVLRT2  EQU   CMVLRTCD+1                                               01496000
CMVLRT1  EQU   CMVLRTCD                                                 01497000
CMVLLTLN EQU   CMVLLIST                                                 01498000
@NM00111 EQU   CMSWA+62                                                 01499000
CMSCRADT EQU   CMSWA+58                                                 01500000
CMSCRAVI EQU   CMSWA+52                                                 01501000
CMSDEFCI EQU   CMSDFSPC+1                                               01502000
CMSWAFLG EQU   CMSDFSPC                                                 01503000
CMSPCFVT EQU   CMSWA+44                                                 01504000
CMRMVVOL EQU   CMVOLCTR                                                 01505000
CMADDVOL EQU   CMRNGCTR                                                 01506000
SPACINDC EQU   CMSWA+38                                                 01507000
PROCESS  EQU   CMSWA+36                                                 01508000
CMDTAFPL EQU   CMHIXFPL                                                 01509000
CMTSTFPL EQU   CMHDTFPL                                                 01510000
CMRNMLST EQU   CMLDTFPL                                                 01511000
CMEXTFLS EQU   CMCPLFVT                                                 01512000
CMWACI   EQU   CMSWA+3                                                  01513000
CMAMDRNG EQU   CMWRKATR                                                 01514000
CMAMDORD EQU   CMWRKATR                                                 01515000
CMAMDRPL EQU   CMWRKATR                                                 01516000
CMAMDSDT EQU   CMWRKATR                                                 01517000
CMAMDWCK EQU   CMWRKATR                                                 01518000
CMAMDDST EQU   CMWRKATR                                                 01519000
CMPROC   EQU   CMWFLAGS                                                 01520000
CMPROCM  EQU   CMWFLAGS                                                 01521000
CMFGDLSC EQU   CMWFLAGS                                                 01522000
DSNPHYBS EQU   DSPTBL+30                                                01523000
DSPHYBPT EQU   DSPTBL+22                                                01524000
DSMPHYBS EQU   DSPTBL+20                                                01525000
DSDEVCHA EQU   DSPTBL                                                   01526000
RTTOLFCT EQU   DEVCHARS+18                                              01527000
RTTOLFLG EQU   RTDVFLGS                                                 01528000
@NM00110 EQU   RTDVFLGS                                                 01529000
RTKABFLG EQU   RTDVFLGS                                                 01530000
@NM00109 EQU   RTDVFLGS                                                 01531000
RTBONK   EQU   DEVCHARS+16                                              01532000
RTBOKLB  EQU   RTBOKAB+1                                                01533000
RTBOKNLB EQU   RTBOKAB                                                  01534000
RTTRKSIZ EQU   DEVCHARS+12                                              01535000
RTNOTRKS EQU   DEVCHARS+10                                              01536000
RTNOCYLS EQU   DEVCHARS+8                                               01537000
RTMXDBLK EQU   DEVCHARS+4                                               01538000
RTCLSTYP EQU   RTDEVUCB+2                                               01539000
@NM00108 EQU   RTDEVUCB                                                 01540000
@NM00107 EQU   RGATTSG1                                                 01541000
RGATSUP1 EQU   RGATTSG1                                                 01542000
@NM00106 EQU   RGATTR1                                                  01543000
RGATTUPG EQU   RGATTR1                                                  01544000
CTGDSNUS EQU   CTGATR2                                                  01545000
@NM00105 EQU   CTGATR2                                                  01546000
CTGDSSSH EQU   CTGATR2                                                  01547000
CTGDSISH EQU   CTGATR2                                                  01548000
CTGTRKOV EQU   CTGATR1                                                  01549000
CTGDSTPX EQU   CTGATR1                                                  01550000
CTGDSINH EQU   CTGATR1                                                  01551000
CTGDSREC EQU   CTGATR1                                                  01552000
CTGDSERA EQU   CTGATR1                                                  01553000
CTGDSREU EQU   CTGATR1                                                  01554000
CTGDSUNQ EQU   CTGATR1                                                  01555000
CTGDSSPD EQU   CTGATR1                                                  01556000
SPCROUND EQU   SPCOPTNS                                                 01557000
SPCALXRQ EQU   SPCOPTNS                                                 01558000
SPCMXIGR EQU   SPCOPTNS                                                 01559000
SPCCNTIG EQU   SPCOPTNS                                                 01560000
@NM00104 EQU   SPCOPTNS                                                 01561000
SPCRQTYP EQU   SPCOPTNS                                                 01562000
SPCSECDQ EQU   SPACEPRM+3                                               01563000
SPCPRIMQ EQU   SPACEPRM                                                 01564000
LTVOLSER EQU   LTENTRY+2                                                01565000
LTRETCD2 EQU   LTRETCOD+1                                               01566000
LTRETCD1 EQU   LTRETCOD                                                 01567000
USERAREV EQU   USERAREC+2                                               01568000
USERAREL EQU   USERAREC                                                 01569000
USVRMDUL EQU   PASSGO+42                                                01570000
PASSATMP EQU   PASSGO+40                                                01571000
PASSPRMT EQU   PASSGO+32                                                01572000
READPW   EQU   PASSWORD+24                                              01573000
UPDATEPW EQU   PASSWORD+16                                              01574000
CIPW     EQU   PASSWORD+8                                               01575000
MASTERPW EQU   PASSWORD                                                 01576000
ASCI     EQU   ASGO+1                                                   01577000
ASTYPE   EQU   ASGO                                                     01578000
CVLSER   EQU   MWA+259                                                  01579000
TTR2     EQU   MWA+256                                                  01580000
BIN0     EQU   CVOLIND+3                                                01581000
TTR1     EQU   CVOLIND                                                  01582000
@NM00096 EQU   MWA+242                                                  01583000
FSN      EQU   VLST+10                                                  01584000
VOLSER   EQU   VLST+4                                                   01585000
DEVTYP   EQU   VLST                                                     01586000
VOLENTCT EQU   MWA                                                      01587000
CTGCVCC  EQU   CTGCV+50                                                 01588000
CTGCVDEV EQU   CTGCVDSN                                                 01589000
CTGCVVOL EQU   CTGCV                                                    01590000
CTGVLTTR EQU   CTGVLX+12                                                01591000
@NM00095 EQU   CTGVLX                                                   01592000
CTGVLSEQ EQU   CTGVL+10                                                 01593000
CTGVLDEV EQU   CTGVL+6                                                  01594000
CTGVLVOL EQU   CTGVL                                                    01595000
CTGWAGB  EQU   CTGWA+12                                                 01596000
CTGWAGCT EQU   CTGWA+10                                                 01597000
CTGWAUCT EQU   CTGWA+8                                                  01598000
CTGWAVCT EQU   CTGWA+6                                                  01599000
CTGWALV  EQU   CTGWA+4                                                  01600000
CTGFVWKA EQU   CTGFV+88                                                 01601000
CTGFVPWD EQU   CTGFV+84                                                 01602000
CTGFVNAM EQU   CTGFV+80                                                 01603000
CTGFVUPG EQU   CTGFVGAT                                                 01604000
CTGFVEXT EQU   CTGFVLMT                                                 01605000
CTGFVLRS EQU   CTGFV+68                                                 01606000
CTGFVBUF EQU   CTGFV+64                                                 01607000
CTGFVATR EQU   CTGFV+60                                                 01608000
CTGFVFSN EQU   CTGFVAMD                                                 01609000
CTGFVTTR EQU   CTGFVSPC                                                 01610000
CTGFVDVT EQU   CTGFV+48                                                 01611000
CTGFVRNG EQU   CTGFV+44                                                 01612000
CTGFVVLT EQU   CTGFV+40                                                 01613000
CTGFVCRE EQU   CTGFV+36                                                 01614000
CTGFVEXP EQU   CTGFV+32                                                 01615000
CTGFVOWN EQU   CTGFV+28                                                 01616000
CTGFVSTY EQU   CTGFV+24                                                 01617000
CTGFVENT EQU   CTGFV+20                                                 01618000
CTGFVIND EQU   CTGFV+16                                                 01619000
CTGFVVCH EQU   CTGFV+12                                                 01620000
CTGFVICH EQU   CTGFV+8                                                  01621000
CTGFVDCH EQU   CTGFV+4                                                  01622000
@NM00094 EQU   CTGFV+3                                                  01623000
CTGFVELM EQU   CTGFV+2                                                  01624000
@NM00093 EQU   CTGFVPRO                                                 01625000
CTGFVDRC EQU   CTGFVPRO                                                 01626000
CTGFVNDC EQU   CTGFVPRO                                                 01627000
CTGFVRVL EQU   CTGFVPRO                                                 01628000
CTGFVAVL EQU   CTGFVPRO                                                 01629000
CAXCRACB EQU   IGGCAXWA+112                                             01630000
CAXJDE   EQU   IGGCAXWA+108                                             01631000
CAXCCA   EQU   IGGCAXWA+104                                             01632000
CAXOPEWA EQU   IGGCAXWA+100                                             01633000
COPACB   EQU   CAXOPLST+1                                               01634000
@NM00092 EQU   COPTS                                                    01635000
CENLST   EQU   COPTS                                                    01636000
@NM00091 EQU   CAXCNAM+22                                               01637000
CAXRADDN EQU   CAXCNAM+14                                               01638000
CAXRATEP EQU   CAXCNAM+10                                               01639000
CAXRACTS EQU   CAXCNAM+6                                                01640000
CAXVOLID EQU   CAXCNAM                                                  01641000
CAXRPL   EQU   IGGCAXWA+48                                              01642000
CAXRPLCT EQU   IGGCAXWA+46                                              01643000
CAXASID  EQU   IGGCAXWA+44                                              01644000
CAXFDCI  EQU   CAXCCR+9                                                 01645000
CAXCDCI  EQU   CAXCCR+6                                                 01646000
CAXNFCI  EQU   CAXCCR+3                                                 01647000
CAXHACI  EQU   CAXCCR                                                   01648000
CAXUCB   EQU   IGGCAXWA+28                                              01649000
CAXACB   EQU   IGGCAXWA+24                                              01650000
CAXDRWP  EQU   IGGCAXWA+20                                              01651000
CAXSCHWA EQU   IGGCAXWA+16                                              01652000
CAXATIOT EQU   IGGCAXWA+12                                              01653000
CAXACT   EQU   IGGCAXWA+11                                              01654000
@NM00090 EQU   CAXFLG3                                                  01655000
CAXF3B6  EQU   CAXFLG3                                                  01656000
CAXF3B5  EQU   CAXFLG3                                                  01657000
@NM00089 EQU   CAXFLG3                                                  01658000
CAXF3ANE EQU   CAXFLG3                                                  01659000
CAXF3AT  EQU   CAXFLG3                                                  01660000
CAXF2VTU EQU   CAXFLG2                                                  01661000
CAXF2REC EQU   CAXFLG2                                                  01662000
CAXF2CA  EQU   CAXFLG2                                                  01663000
CAXF2CLR EQU   CAXFLG2                                                  01664000
CAXF2IOE EQU   CAXFLG2                                                  01665000
CAXF2NCR EQU   CAXFLG2                                                  01666000
CAXF2NDD EQU   CAXFLG2                                                  01667000
CAXF2DT  EQU   CAXFLG2                                                  01668000
CAXSCR   EQU   CAXFLGS                                                  01669000
CAXCMR   EQU   CAXFLGS                                                  01670000
CAXMCT   EQU   CAXFLGS                                                  01671000
CAXCMP   EQU   CAXFLGS                                                  01672000
CAXEOV   EQU   CAXFLGS                                                  01673000
CAXCLS   EQU   CAXFLGS                                                  01674000
CAXOPN   EQU   CAXFLGS                                                  01675000
CAXBLD   EQU   CAXFLGS                                                  01676000
CAXCHN   EQU   IGGCAXWA+4                                               01677000
@NM00088 EQU   IGGCAXWA+1                                               01678000
CAXID    EQU   IGGCAXWA                                                 01679000
CBSVPTR  EQU   CBSVSRT+4                                                01680000
CBSVUSE  EQU   CBSVSRT                                                  01681000
CBSCRTCB EQU   AMCBS+28                                                 01682000
CBSCRACA EQU   AMCBS+24                                                 01683000
CBSCAXCN EQU   AMCBS+20                                                 01684000
CBSMCUCB EQU   CBSCMP                                                   01685000
CBSCBP   EQU   AMCBS+12                                                 01686000
CBSACB   EQU   AMCBS+8                                                  01687000
CBSMCSTA EQU   AMCBS+4                                                  01688000
CBSSIZ   EQU   AMCBS+2                                                  01689000
CBSID    EQU   AMCBS                                                    01690000
ACBAPID  EQU   ACBCOMN+72                                               01691000
ACBCBMWA EQU   ACBCOMN+68                                               01692000
ACBLRECL EQU   ACBCOMN+62                                               01693000
ACBMSGLN EQU   ACBBLKSZ                                                 01694000
ACBBUFSP EQU   ACBCOMN+56                                               01695000
@NM00085 EQU   ACBUJFCB+1                                               01696000
ACBOPTN  EQU   ACBUJFCB                                                 01697000
ACBVVIC  EQU   ACBINFLG                                                 01698000
ACBUCRA  EQU   ACBINFLG                                                 01699000
ACBSCRA  EQU   ACBINFLG                                                 01700000
ACBCAT   EQU   ACBINFLG                                                 01701000
ACBIJRQE EQU   ACBINFLG                                                 01702000
ACBJEPS  EQU   ACBINFLG                                                 01703000
@NM00084 EQU   ACBINFLG                                                 01704000
ACBERFLG EQU   ACBCOMN+49                                               01705000
ACBBUSY  EQU   ACBIOSFG                                                 01706000
ACBLOCK  EQU   ACBEXFG                                                  01707000
@NM00083 EQU   ACBOFLGS                                                 01708000
ACBDSERR EQU   ACBOFLGS                                                 01709000
ACBOPEN  EQU   ACBOFLGS                                                 01710000
ACBEOV   EQU   ACBOFLGS                                                 01711000
@NM00082 EQU   ACBOFLGS                                                 01712000
ACBDEB   EQU   ACBDDNM+5                                                01713000
ACBERFL  EQU   ACBDDNM+4                                                01714000
ACBAM    EQU   ACBAMETH                                                 01715000
ACBINFL  EQU   ACBDDNM+2                                                01716000
ACBTIOT  EQU   ACBDDNM                                                  01717000
ACBUEL   EQU   ACBEXLST                                                 01718000
ACBPASSW EQU   ACBCOMN+32                                               01719000
ACBMSGAR EQU   ACBCOMN+28                                               01720000
@NM00081 EQU   ACBDSORG+1                                               01721000
ACBDORGA EQU   ACBDSORG+1                                               01722000
@NM00080 EQU   ACBDSORG                                                 01723000
ACBCRNRE EQU   ACBCROPS                                                 01724000
ACBCRNCK EQU   ACBCROPS                                                 01725000
ACBASA   EQU   ACBCCTYP                                                 01726000
@NM00079 EQU   ACBCCTYP                                                 01727000
ACBRECAF EQU   ACBRECFM                                                 01728000
ACBJBUF  EQU   ACBBUFPL+2                                               01729000
ACBMACR4 EQU   ACBBUFPL+1                                               01730000
@NM00078 EQU   ACBMACR3                                                 01731000
ACBNCFX  EQU   ACBMACR3                                                 01732000
ACBSIS   EQU   ACBMACR3                                                 01733000
ACBDFR   EQU   ACBMACR3                                                 01734000
ACBICI   EQU   ACBMACR3                                                 01735000
ACBGSR   EQU   ACBMACR3                                                 01736000
ACBLSR   EQU   ACBMACR3                                                 01737000
@NM00077 EQU   ACBMACR3                                                 01738000
ACBBUFNI EQU   ACBCOMN+18                                               01739000
ACBBUFND EQU   ACBCOMN+16                                               01740000
ACBSTRNO EQU   ACBCOMN+15                                               01741000
ACBBSTNO EQU   ACBCOMN+14                                               01742000
ACBAIX   EQU   ACBMACR2                                                 01743000
ACBDSN   EQU   ACBMACR2                                                 01744000
ACBRST   EQU   ACBMACR2                                                 01745000
ACBLOGON EQU   ACBMACR2                                                 01746000
ACBSKP   EQU   ACBMACR2                                                 01747000
@NM00076 EQU   ACBMACR2                                                 01748000
ACBUBF   EQU   ACBMACR1                                                 01749000
ACBOUT   EQU   ACBMACR1                                                 01750000
ACBIN    EQU   ACBMACR1                                                 01751000
ACBDIR   EQU   ACBMACR1                                                 01752000
ACBSEQ   EQU   ACBMACR1                                                 01753000
ACBBLK   EQU   ACBCNV                                                   01754000
ACBADD   EQU   ACBADR                                                   01755000
ACBKEY   EQU   ACBMACR1                                                 01756000
ACBINRTN EQU   ACBCOMN+8                                                01757000
ACBIBCT  EQU   ACBJWA                                                   01758000
ACBLEN2  EQU   ACBLENG2                                                 01759000
ACBSTYP  EQU   ACBCOMN+1                                                01760000
ACBID    EQU   ACBCOMN                                                  01761000
@NM00051 EQU   TCBXTNT2+32                                              01762000
TCBRV181 EQU   TCBRV173                                                 01763000
TCBRV180 EQU   TCBRV173                                                 01764000
TCBRV179 EQU   TCBRV173                                                 01765000
TCBRV178 EQU   TCBRV173                                                 01766000
TCBRV177 EQU   TCBRV173                                                 01767000
TCBRV176 EQU   TCBRV173                                                 01768000
TCBRV175 EQU   TCBRV173                                                 01769000
TCBRV174 EQU   TCBRV173                                                 01770000
TCBRV172 EQU   TCBRV164                                                 01771000
TCBRV171 EQU   TCBRV164                                                 01772000
TCBRV170 EQU   TCBRV164                                                 01773000
TCBRV169 EQU   TCBRV164                                                 01774000
TCBRV168 EQU   TCBRV164                                                 01775000
TCBRV167 EQU   TCBRV164                                                 01776000
TCBRV166 EQU   TCBRV164                                                 01777000
TCBRV165 EQU   TCBRV164                                                 01778000
TCBRV163 EQU   TCBRV155                                                 01779000
TCBRV162 EQU   TCBRV155                                                 01780000
TCBRV161 EQU   TCBRV155                                                 01781000
TCBRV160 EQU   TCBRV155                                                 01782000
TCBRV159 EQU   TCBRV155                                                 01783000
TCBRV158 EQU   TCBRV155                                                 01784000
TCBRV157 EQU   TCBRV155                                                 01785000
TCBRV156 EQU   TCBRV155                                                 01786000
TCBRV154 EQU   TCBRV146                                                 01787000
TCBRV153 EQU   TCBRV146                                                 01788000
TCBRV152 EQU   TCBRV146                                                 01789000
TCBRV151 EQU   TCBRV146                                                 01790000
TCBRV150 EQU   TCBRV146                                                 01791000
TCBRV149 EQU   TCBRV146                                                 01792000
TCBRV148 EQU   TCBRV146                                                 01793000
TCBRV147 EQU   TCBRV146                                                 01794000
TCBRV145 EQU   TCBXTNT2+26                                              01795000
TCBRV144 EQU   TCBXTNT2+24                                              01796000
TCBRV143 EQU   TCBXTNT2+20                                              01797000
TCBRV142 EQU   TCBXTNT2+16                                              01798000
TCBRSV49 EQU   TCBXTNT2+12                                              01799000
TCBRSV48 EQU   TCBXTNT2+8                                               01800000
TCBRCMP  EQU   TCBXTNT2+5                                               01801000
TCBRSVAB EQU   TCBXTNT2+4                                               01802000
TCBGTFA  EQU   TCBGTF+1                                                 01803000
TCBRSV47 EQU   TCBTFLG                                                  01804000
TCBRSV46 EQU   TCBTFLG                                                  01805000
TCBRSV45 EQU   TCBTFLG                                                  01806000
TCBRSV44 EQU   TCBTFLG                                                  01807000
TCBRSV43 EQU   TCBTFLG                                                  01808000
TCBDSPIT EQU   TCBTFLG                                                  01809000
TCBERRTN EQU   TCBTFLG                                                  01810000
TCBASYNC EQU   TCBTFLG                                                  01811000
@NM00050 EQU   TCB+296                                                  01812000
TCBSCBQ  EQU   TCB+292                                                  01813000
TCBSWASA EQU   TCB+288                                                  01814000
TCBDBTB  EQU   TCB+284                                                  01815000
TCBRPT   EQU   TCB+280                                                  01816000
TCBRV141 EQU   TCBRV133                                                 01817000
TCBRV140 EQU   TCBRV133                                                 01818000
TCBRV139 EQU   TCBRV133                                                 01819000
TCBRV138 EQU   TCBRV133                                                 01820000
TCBRV137 EQU   TCBRV133                                                 01821000
TCBRV136 EQU   TCBRV133                                                 01822000
TCBRV135 EQU   TCBRV133                                                 01823000
TCBRV134 EQU   TCBRV133                                                 01824000
TCBRV132 EQU   TCBRV124                                                 01825000
TCBRV131 EQU   TCBRV124                                                 01826000
TCBRV130 EQU   TCBRV124                                                 01827000
TCBRV129 EQU   TCBRV124                                                 01828000
TCBRV128 EQU   TCBRV124                                                 01829000
TCBRV127 EQU   TCBRV124                                                 01830000
TCBRV126 EQU   TCBRV124                                                 01831000
TCBRV125 EQU   TCBRV124                                                 01832000
TCBRV123 EQU   TCBFBYT2                                                 01833000
TCBRV122 EQU   TCBFBYT2                                                 01834000
TCBECBNV EQU   TCBFBYT2                                                 01835000
TCBSSSYN EQU   TCBFBYT2                                                 01836000
TCBFPRAP EQU   TCBFBYT2                                                 01837000
TCBFDW   EQU   TCBFBYT2                                                 01838000
TCBFMW   EQU   TCBFBYT2                                                 01839000
TCBCNCB  EQU   TCBFBYT2                                                 01840000
TCBLLH   EQU   TCBFBYT1                                                 01841000
TCBRV113 EQU   TCBFBYT1                                                 01842000
TCBEOT   EQU   TCBFBYT1                                                 01843000
TCBRTM2  EQU   TCBFBYT1                                                 01844000
TCBPGNLY EQU   TCBFBYT1                                                 01845000
TCBNDIOS EQU   TCBFBYT1                                                 01846000
TCBACTIV EQU   TCBFBYT1                                                 01847000
TCBEOTFM EQU   TCBFBYT1                                                 01848000
TCBAFFN  EQU   TCB+274                                                  01849000
TCBCCPVI EQU   TCB+272                                                  01850000
TCBUKYSP EQU   TCB+268                                                  01851000
TCBMODE  EQU   TCBESTAE+3                                               01852000
TCBERTYP EQU   TCBESTAE+2                                               01853000
TCBRV314 EQU   TCBESTRM                                                 01854000
TCBRV313 EQU   TCBESTRM                                                 01855000
TCBRV312 EQU   TCBESTRM                                                 01856000
TCBRV311 EQU   TCBESTRM                                                 01857000
TCBRV310 EQU   TCBESTRM                                                 01858000
TCBRV309 EQU   TCBESTRM                                                 01859000
TCBRV308 EQU   TCBESTRM                                                 01860000
TCBETERM EQU   TCBESTRM                                                 01861000
TCBSCBKY EQU   TCBESTAE                                                 01862000
TCBRTM12 EQU   TCB+260                                                  01863000
TCBTCBID EQU   TCB+256                                                  01864000
TCBRSV96 EQU   TCB+252                                                  01865000
TCBSWA   EQU   TCB+248                                                  01866000
TCBFOEA  EQU   TCBFOE+1                                                 01867000
TCBRSV42 EQU   TCBFOE                                                   01868000
TCBRV306 EQU   TCB+240                                                  01869000
TCBRSV41 EQU   TCB+239                                                  01870000
TCBTID   EQU   TCB+238                                                  01871000
TCBRSVAA EQU   TCB+237                                                  01872000
TCBABCUR EQU   TCB+236                                                  01873000
TCBTMSAV EQU   TCB+232                                                  01874000
TCBIOTIM EQU   TCB+228                                                  01875000
TCBRTWA  EQU   TCB+224                                                  01876000
TCBBACK  EQU   TCB+220                                                  01877000
TCBTIRB  EQU   TCB+216                                                  01878000
TCBAECB  EQU   TCB+212                                                  01879000
TCBEXT2A EQU   TCBEXT2+1                                                01880000
TCBRSV39 EQU   TCBEXT2                                                  01881000
TCBSTMCT EQU   TCB+207                                                  01882000
TCBSYSCT EQU   TCB+206                                                  01883000
TCBRSV37 EQU   TCB+205                                                  01884000
TCBEXSVC EQU   TCBDAR                                                   01885000
TCBRSV36 EQU   TCBDAR                                                   01886000
TCBDARWT EQU   TCBDAR                                                   01887000
TCBDARO  EQU   TCBDAR                                                   01888000
TCBDARMC EQU   TCBDARC                                                  01889000
TCBDARD  EQU   TCBDAR                                                   01890000
TCBDARS  EQU   TCBDAR                                                   01891000
TCBDARP  EQU   TCBDAR                                                   01892000
TCBGTOFM EQU   TCBFLGS7                                                 01893000
TCBADMP  EQU   TCBFLGS7                                                 01894000
TCBRSTSK EQU   TCBFLGS7                                                 01895000
TCBRSV35 EQU   TCBFLGS7                                                 01896000
TCBSTACK EQU   TCBFLGS7                                                 01897000
TCBRSV34 EQU   TCBFLGS7                                                 01898000
TCBRSV33 EQU   TCBFLGS7                                                 01899000
TCBGPECB EQU   TCBFLGS7                                                 01900000
TCBNTJS  EQU   TCBFLGS6                                                 01901000
TCBAPG   EQU   TCBFLGS6                                                 01902000
TCBMIGR  EQU   TCBFLGS6                                                 01903000
TCBRV303 EQU   TCBFLGS6                                                 01904000
TCBSPVLK EQU   TCBFLGS6                                                 01905000
TCBCPU   EQU   TCBFLGS6                                                 01906000
TCBPIE17 EQU   TCBFLGS6                                                 01907000
TCBRV    EQU   TCBFLGS6                                                 01908000
TCBRSV79 EQU   TCBNDSP5                                                 01909000
TCBRSV78 EQU   TCBNDSP5                                                 01910000
TCBRSV77 EQU   TCBNDSP5                                                 01911000
TCBRSV76 EQU   TCBNDSP5                                                 01912000
TCBRSV75 EQU   TCBNDSP5                                                 01913000
TCBRSV74 EQU   TCBNDSP5                                                 01914000
TCBRSV95 EQU   TCBNDSP5                                                 01915000
TCBRSV94 EQU   TCBNDSP5                                                 01916000
TCBRSV93 EQU   TCBNDSP4                                                 01917000
TCBRSV92 EQU   TCBNDSP4                                                 01918000
TCBRSV91 EQU   TCBNDSP4                                                 01919000
TCBRSV90 EQU   TCBNDSP4                                                 01920000
TCBRSV89 EQU   TCBNDSP4                                                 01921000
TCBRSV88 EQU   TCBNDSP4                                                 01922000
TCBRSV87 EQU   TCBNDSP4                                                 01923000
TCBRSV86 EQU   TCBNDSP4                                                 01924000
TCBEXT1A EQU   TCBEXT1+1                                                01925000
TCBRSV32 EQU   TCBEXT1                                                  01926000
TCBEXCPD EQU   TCB+192                                                  01927000
TCBIOBRC EQU   TCB+188                                                  01928000
TCBDDWTC EQU   TCB+186                                                  01929000
TCBDDEXC EQU   TCB+184                                                  01930000
TCBJSCBB EQU   TCBJSCB+1                                                01931000
@NM00049 EQU   TCBRECDE                                                 01932000
TCBREC   EQU   TCBRECDE                                                 01933000
TCBMDIDS EQU   TCB+176                                                  01934000
TCBNDINT EQU   TCBNDSP3                                                 01935000
TCBRSV27 EQU   TCBNDSP3                                                 01936000
TCBRSV26 EQU   TCBNDSP3                                                 01937000
TCBRSV25 EQU   TCBNDSP3                                                 01938000
TCBRSV24 EQU   TCBNDSP3                                                 01939000
TCBSRBND EQU   TCBNDSP3                                                 01940000
TCBRV302 EQU   TCBNDSP3                                                 01941000
TCBLJSND EQU   TCBNDSP3                                                 01942000
TCBABE   EQU   TCBNDSP2                                                 01943000
TCBDSS   EQU   TCBNDSP2                                                 01944000
TCBOWAIT EQU   TCBNDSP2                                                 01945000
TCBIWAIT EQU   TCBNDSP2                                                 01946000
TCBNDTS  EQU   TCBNDSP2                                                 01947000
TCBNDSVC EQU   TCBNDSP2                                                 01948000
TCBSTPP  EQU   TCBNDSP2                                                 01949000
TCBABD   EQU   TCBNDSP2                                                 01950000
TCBRSV22 EQU   TCBNDSP1                                                 01951000
TCBPIEND EQU   TCBNDSP1                                                 01952000
TCBTPSP  EQU   TCBNDSP1                                                 01953000
TCBDDRND EQU   TCBNDSP1                                                 01954000
TCBRSPND EQU   TCBNDSP1                                                 01955000
TCBRSTND EQU   TCBNDSP1                                                 01956000
TCBDARPN EQU   TCBNDSP1                                                 01957000
TCBDARTN EQU   TCBNDSP1                                                 01958000
TCBNDSP0 EQU   TCBNDSP                                                  01959000
TCBUSER  EQU   TCB+168                                                  01960000
TCBTCTB  EQU   TCBTCT+1                                                 01961000
TCBRSV9C EQU   TCBTCTGF                                                 01962000
TCBRSV9B EQU   TCBTCTGF                                                 01963000
TCBRSV9A EQU   TCBTCTGF                                                 01964000
TCBRSV99 EQU   TCBTCTGF                                                 01965000
TCBRSV98 EQU   TCBTCTGF                                                 01966000
TCBRSV97 EQU   TCBTCTGF                                                 01967000
TCBRSV20 EQU   TCBTCTGF                                                 01968000
TCBSMFGF EQU   TCBTCTGF                                                 01969000
TCBSTABB EQU   TCBSTAB+1                                                01970000
TCBSTCUR EQU   TCBNSTAE                                                 01971000
TCBRV301 EQU   TCBNSTAE                                                 01972000
TCBSYNCH EQU   TCBNSTAE                                                 01973000
TCBHALT  EQU   TCBNSTAE                                                 01974000
TCBPPSUP EQU   TCBNSTAE                                                 01975000
TCB33E   EQU   TCBNSTAE                                                 01976000
TCBQUIES EQU   TCBNSTAE                                                 01977000
TCBSTABE EQU   TCBNSTAE                                                 01978000
TCBAQE   EQU   TCB+156                                                  01979000
TCBPQE   EQU   TCB+152                                                  01980000
TCBTSDP  EQU   TCB+151                                                  01981000
TCBTSLP  EQU   TCB+150                                                  01982000
TCBSTPCT EQU   TCB+149                                                  01983000
TCBCPUBN EQU   TCBTSFLG                                                 01984000
TCBDYDSP EQU   TCBTSFLG                                                 01985000
TCBRSV18 EQU   TCBTSFLG                                                 01986000
TCBRSV17 EQU   TCBTSFLG                                                 01987000
TCBTIOTG EQU   TCBTSFLG                                                 01988000
TCBATT   EQU   TCBTSFLG                                                 01989000
TCBSTPPR EQU   TCBTSFLG                                                 01990000
TCBRV300 EQU   TCBTSTSK                                                 01991000
TCBECB   EQU   TCB+144                                                  01992000
TCBIQE   EQU   TCB+140                                                  01993000
TCBLTC   EQU   TCB+136                                                  01994000
TCBOTC   EQU   TCB+132                                                  01995000
TCBNTC   EQU   TCB+128                                                  01996000
TCBJSTCA EQU   TCBJSTCB+1                                               01997000
TCBRSV16 EQU   TCBJSTCB                                                 01998000
TCBTQET  EQU   TCBTME                                                   01999000
TCBTCB   EQU   TCB+116                                                  02000000
TCBFSAB  EQU   TCBFSA+1                                                 02001000
TCBQEL   EQU   TCBFSA                                                   02002000
TCBGRS15 EQU   TCBGRS+60                                                02003000
TCBGRS14 EQU   TCBGRS+56                                                02004000
TCBGRS13 EQU   TCBGRS+52                                                02005000
TCBGRS12 EQU   TCBGRS+48                                                02006000
TCBGRS11 EQU   TCBGRS+44                                                02007000
TCBGRS10 EQU   TCBGRS+40                                                02008000
TCBGRS9  EQU   TCBGRS+36                                                02009000
TCBGRS8  EQU   TCBGRS+32                                                02010000
TCBGRS7  EQU   TCBGRS+28                                                02011000
TCBGRS6  EQU   TCBGRS+24                                                02012000
TCBGRS5  EQU   TCBGRS+20                                                02013000
TCBGRS4  EQU   TCBGRS+16                                                02014000
TCBGRS3  EQU   TCBGRS+12                                                02015000
TCBGRS2  EQU   TCBGRS+8                                                 02016000
TCBGRS1  EQU   TCBGRS+4                                                 02017000
TCBGRS0  EQU   TCBGRS                                                   02018000
TCBJPQB  EQU   TCBJPQ+1                                                 02019000
TCBRSV15 EQU   TCBPURGE                                                 02020000
TCBRSV14 EQU   TCBPURGE                                                 02021000
TCBRSV13 EQU   TCBPURGE                                                 02022000
TCBRSV12 EQU   TCBPURGE                                                 02023000
TCBRSV11 EQU   TCBPURGE                                                 02024000
TCBRSV10 EQU   TCBPURGE                                                 02025000
TCBRSV09 EQU   TCBPURGE                                                 02026000
TCBJPQF  EQU   TCBPURGE                                                 02027000
TCBJLB   EQU   TCB+40                                                   02028000
TCBLLS   EQU   TCB+36                                                   02029000
TCBDSP   EQU   TCB+35                                                   02030000
TCBLMP   EQU   TCB+34                                                   02031000
TCBPNDSP EQU   TCBFLGS5                                                 02032000
TCBFCD1  EQU   TCBFLGS5                                                 02033000
TCBSTP   EQU   TCBFLGS5                                                 02034000
TCBSYS   EQU   TCBFLGS5                                                 02035000
TCBANDSP EQU   TCBFLGS5                                                 02036000
TCBPAGE  EQU   TCBFLGS5                                                 02037000
TCBUXNDF EQU   TCBABWF                                                  02038000
TCBFC    EQU   TCBFLGS5                                                 02039000
TCBONDSP EQU   TCBFLGS4                                                 02040000
TCBMPCND EQU   TCBFLGS4                                                 02041000
TCBMPCVQ EQU   TCBFLGS4                                                 02042000
TCBUXNDV EQU   TCBFLGS4                                                 02043000
TCBHNDSP EQU   TCBFLGS4                                                 02044000
TCBRQENA EQU   TCBFLGS4                                                 02045000
TCBSER   EQU   TCBFLGS4                                                 02046000
TCBNDUMP EQU   TCBFLGS4                                                 02047000
TCBDWSTA EQU   TCBFLGS3                                                 02048000
TCBRSV08 EQU   TCBFLGS3                                                 02049000
TCBRSV07 EQU   TCBFLGS3                                                 02050000
TCBRSV06 EQU   TCBFLGS3                                                 02051000
TCBABGM  EQU   TCBFLGS3                                                 02052000
TCBABTRM EQU   TCBFLGS3                                                 02053000
TCBADINP EQU   TCBFLGS3                                                 02054000
TCBFSM   EQU   TCBFLGS3                                                 02055000
TCBFTS   EQU   TCBFLGS2                                                 02056000
TCBFETXR EQU   TCBFLGS2                                                 02057000
TCBFDSOP EQU   TCBFLGS2                                                 02058000
TCBFJMC  EQU   TCBFLGS2                                                 02059000
TCBFSMC  EQU   TCBFLGS2                                                 02060000
TCBFABOP EQU   TCBFLGS2                                                 02061000
TCBFSTI  EQU   TCBFLGS2                                                 02062000
TCBFOINP EQU   TCBFLGS2                                                 02063000
TCBFX    EQU   TCBFLGS1                                                 02064000
TCBFS    EQU   TCBFLGS1                                                 02065000
TCBFT    EQU   TCBFLGS1                                                 02066000
TCBPDUMP EQU   TCBFLGS1                                                 02067000
TCBRSV04 EQU   TCBFLGS1                                                 02068000
TCBFERA  EQU   TCBFLGS1                                                 02069000
TCBFE    EQU   TCBFLGS1                                                 02070000
TCBFA    EQU   TCBFLGS1                                                 02071000
TCBZERO  EQU   TCBPKF                                                   02072000
TCBFLAG  EQU   TCBPKF                                                   02073000
TCBMSSB  EQU   TCBMSS+1                                                 02074000
TCBRSV03 EQU   TCBMSS                                                   02075000
TCBTRNB  EQU   TCBTRN+1                                                 02076000
TCBRSV02 EQU   TCBABF                                                   02077000
TCBOLTEP EQU   TCBABF                                                   02078000
TCBTCP   EQU   TCBABF                                                   02079000
TCBTCPP  EQU   TCBABF                                                   02080000
TCBRSV01 EQU   TCBABF                                                   02081000
TCBGRPH  EQU   TCBABF                                                   02082000
TCBNOCHK EQU   TCBABF                                                   02083000
TCBMOD91 EQU   TCBABF                                                   02084000
TCBCMPC  EQU   TCBCMP+1                                                 02085000
TCBRV318 EQU   TCBCMSG                                                  02086000
TCBRV317 EQU   TCBCIND                                                  02087000
TCBRV316 EQU   TCBCWTO                                                  02088000
TCBCASID EQU   TCBCDBL                                                  02089000
TCBNOCC  EQU   TCBSTCC                                                  02090000
TCBDMPO  EQU   TCBCPP                                                   02091000
TCBCSTEP EQU   TCBCMPF                                                  02092000
TCBCREQ  EQU   TCBCMPF                                                  02093000
TCBTIO   EQU   TCB+12                                                   02094000
TCBDEB   EQU   TCB+8                                                    02095000
TCBPIEA  EQU   TCBPIE+1                                                 02096000
TCBPM    EQU   TCBPMASK                                                 02097000
@NM00048 EQU   TCBPMASK                                                 02098000
TCBRBP   EQU   TCB                                                      02099000
TCBFRS6  EQU   TCBFRS+24                                                02100000
TCBFRS4  EQU   TCBFRS+16                                                02101000
TCBFRS2  EQU   TCBFRS+8                                                 02102000
TCBFRS0  EQU   TCBFRS                                                   02103000
NEXTTCB  EQU   TCBWORDS                                                 02104000
CVTLEVL  EQU   CVTRELNO+2                                               02105000
CVTNUMB  EQU   CVTRELNO                                                 02106000
CVTMDL   EQU   CVTFIX+250                                               02107000
@NM00047 EQU   CVTFIX+248                                               02108000
@NM00046 EQU   CVTFIX                                                   02109000
CVTRV482 EQU   CVTXTNT2+128                                             02110000
CVTRV481 EQU   CVTXTNT2+124                                             02111000
CVTRV480 EQU   CVTXTNT2+120                                             02112000
CVTRV479 EQU   CVTXTNT2+118                                             02113000
CVTRV478 EQU   CVTXTNT2+117                                             02114000
CVTRV477 EQU   CVTXTNT2+116                                             02115000
CVTRV476 EQU   CVTXTNT2+115                                             02116000
CVTRV475 EQU   CVTXTNT2+114                                             02117000
CVTRV474 EQU   CVTRV466                                                 02118000
CVTRV473 EQU   CVTRV466                                                 02119000
CVTRV472 EQU   CVTRV466                                                 02120000
CVTRV471 EQU   CVTRV466                                                 02121000
CVTRV470 EQU   CVTRV466                                                 02122000
CVTRV469 EQU   CVTRV466                                                 02123000
CVTRV468 EQU   CVTRV466                                                 02124000
CVTRV467 EQU   CVTRV466                                                 02125000
CVTRV465 EQU   CVTRV457                                                 02126000
CVTRV464 EQU   CVTRV457                                                 02127000
CVTRV463 EQU   CVTRV457                                                 02128000
CVTRV462 EQU   CVTRV457                                                 02129000
CVTRV461 EQU   CVTRV457                                                 02130000
CVTRV460 EQU   CVTRV457                                                 02131000
CVTRV459 EQU   CVTRV457                                                 02132000
CVTRV458 EQU   CVTRV457                                                 02133000
CVTRV456 EQU   CVTXTNT2+108                                             02134000
CVTRV455 EQU   CVTXTNT2+104                                             02135000
CVTRV454 EQU   CVTXTNT2+100                                             02136000
CVTRV453 EQU   CVTXTNT2+96                                              02137000
CVTRV452 EQU   CVTXTNT2+94                                              02138000
CVTRV451 EQU   CVTXTNT2+92                                              02139000
CVTRV450 EQU   CVTXTNT2+90                                              02140000
CVTRV449 EQU   CVTXTNT2+88                                              02141000
CVTRV448 EQU   CVTXTNT2+87                                              02142000
CVTRV447 EQU   CVTXTNT2+86                                              02143000
CVTRV446 EQU   CVTRV438                                                 02144000
CVTRV445 EQU   CVTRV438                                                 02145000
CVTRV444 EQU   CVTRV438                                                 02146000
CVTRV443 EQU   CVTRV438                                                 02147000
CVTRV442 EQU   CVTRV438                                                 02148000
CVTRV441 EQU   CVTRV438                                                 02149000
CVTRV440 EQU   CVTRV438                                                 02150000
CVTRV439 EQU   CVTRV438                                                 02151000
CVTRV437 EQU   CVTRV429                                                 02152000
CVTRV436 EQU   CVTRV429                                                 02153000
CVTRV435 EQU   CVTRV429                                                 02154000
CVTRV434 EQU   CVTRV429                                                 02155000
CVTRV433 EQU   CVTRV429                                                 02156000
CVTRV432 EQU   CVTRV429                                                 02157000
CVTRV431 EQU   CVTRV429                                                 02158000
CVTRV430 EQU   CVTRV429                                                 02159000
CVTRV428 EQU   CVTXTNT2+80                                              02160000
CVTRV427 EQU   CVTXTNT2+76                                              02161000
CVTRV426 EQU   CVTXTNT2+72                                              02162000
CVTRV425 EQU   CVTXTNT2+68                                              02163000
CVTATACT EQU   CVTATCVT                                                 02164000
CVTRV423 EQU   CVTXTNT2+62                                              02165000
CVTRV422 EQU   CVTXTNT2+60                                              02166000
CVTRV421 EQU   CVTXTNT2+58                                              02167000
CVTRV420 EQU   CVTXTNT2+56                                              02168000
CVTRV419 EQU   CVTXTNT2+55                                              02169000
CVTRV418 EQU   CVTXTNT2+54                                              02170000
CVTRV417 EQU   CVTRV409                                                 02171000
CVTRV416 EQU   CVTRV409                                                 02172000
CVTRV415 EQU   CVTRV409                                                 02173000
CVTRV414 EQU   CVTRV409                                                 02174000
CVTRV413 EQU   CVTRV409                                                 02175000
CVTRV412 EQU   CVTRV409                                                 02176000
CVTRV411 EQU   CVTRV409                                                 02177000
CVTRV410 EQU   CVTRV409                                                 02178000
CVTRV408 EQU   CVTRV400                                                 02179000
CVTRV407 EQU   CVTRV400                                                 02180000
CVTRV406 EQU   CVTRV400                                                 02181000
CVTRV405 EQU   CVTRV400                                                 02182000
CVTRV404 EQU   CVTRV400                                                 02183000
CVTRV403 EQU   CVTRV400                                                 02184000
CVTRV402 EQU   CVTRV400                                                 02185000
CVTRV401 EQU   CVTRV400                                                 02186000
CVTICB   EQU   CVTXTNT2+48                                              02187000
CVTSKTA  EQU   CVTXTNT2+44                                              02188000
CVTRSV99 EQU   CVTXTNT2+40                                              02189000
CVTRSV98 EQU   CVTXTNT2+36                                              02190000
CVTRSV97 EQU   CVTXTNT2+34                                              02191000
CVTRSV96 EQU   CVTXTNT2+32                                              02192000
CVTOLTEP EQU   CVTXTNT2+28                                              02193000
CVTQIDA  EQU   CVTQID+1                                                 02194000
CVTRSV95 EQU   CVTQID                                                   02195000
CVTRSV94 EQU   CVTXTNT2+20                                              02196000
CVTRSV93 EQU   CVTXTNT2+16                                              02197000
CVTRSV92 EQU   CVTXTNT2+12                                              02198000
CVTDEBVR EQU   CVTXTNT2+8                                               02199000
CVTRSV91 EQU   CVTXTNT2+6                                               02200000
CVTRSV9H EQU   CVTFLGBT                                                 02201000
CVTRSV9G EQU   CVTFLGBT                                                 02202000
CVTRSV9F EQU   CVTFLGBT                                                 02203000
CVTRSV9E EQU   CVTFLGBT                                                 02204000
CVTRSV9D EQU   CVTFLGBT                                                 02205000
CVTRSV9C EQU   CVTFLGBT                                                 02206000
CVTVME   EQU   CVTFLGBT                                                 02207000
CVTNPE   EQU   CVTFLGBT                                                 02208000
CVTNUCLS EQU   CVTXTNT2+4                                               02209000
CVTDSSVA EQU   CVTDSSV+1                                                02210000
CVTRSV89 EQU   CVTDSSV                                                  02211000
CVTRSV88 EQU   CVTXTNT1+8                                               02212000
CVTRSV87 EQU   CVTXTNT1+4                                               02213000
CVTFACHN EQU   CVTXTNT1                                                 02214000
CVTRV488 EQU   CVTMAP+412                                               02215000
CVTRV487 EQU   CVTMAP+408                                               02216000
CVTRV486 EQU   CVTMAP+404                                               02217000
CVTRV485 EQU   CVTMAP+400                                               02218000
CVTACTAP EQU   CVTMAP+396                                               02219000
CVTAUTH  EQU   CVTMAP+392                                               02220000
CVTATMCA EQU   CVTATMCT+1                                               02221000
CVTATMST EQU   CVTATMCT                                                 02222000
CVTRSV61 EQU   CVTMAP+384                                               02223000
CVTVOLT1 EQU   CVTVOLM1+1                                               02224000
CVTVOLI1 EQU   CVTVOLF1                                                 02225000
CVTSTOA  EQU   CVTMAP+376                                               02226000
CVTRSV58 EQU   CVTMAP+374                                               02227000
CVTRSV57 EQU   CVTMAP+372                                               02228000
CVTDDCE  EQU   CVTMAP+368                                               02229000
CVTPNWFR EQU   CVTMAP+364                                               02230000
CVTSMF   EQU   CVTMAP+360                                               02231000
CVTSULK  EQU   CVTMAP+358                                               02232000
CVTSLKO  EQU   CVTSYSK                                                  02233000
CVTSLKP  EQU   CVTSYSK                                                  02234000
CVTSLKQ  EQU   CVTSYSK                                                  02235000
CVTSLKR  EQU   CVTSYSK                                                  02236000
CVTRSV56 EQU   CVTSYSK                                                  02237000
CVTRSV55 EQU   CVTSYSK                                                  02238000
CVTRSV54 EQU   CVTSYSK                                                  02239000
CVTRSV53 EQU   CVTSYSK                                                  02240000
CVTRSV52 EQU   CVTA1F1                                                  02241000
CVTRSV51 EQU   CVTA1F1                                                  02242000
CVTRSV50 EQU   CVTA1F1                                                  02243000
CVTRSV49 EQU   CVTA1F1                                                  02244000
CVTRSV48 EQU   CVTA1F1                                                  02245000
CVTRSV47 EQU   CVTA1F1                                                  02246000
CVTSRSW  EQU   CVTA1F1                                                  02247000
CVTPFSW  EQU   CVTA1F1                                                  02248000
CVTPCVT  EQU   CVTMAP+352                                               02249000
CVTRSV46 EQU   CVTMAP+344                                               02250000
CVTRSV45 EQU   CVTMAP+340                                               02251000
CVTRSV44 EQU   CVTMAP+338                                               02252000
CVTRSV43 EQU   CVTMAP+336                                               02253000
CVTHJESA EQU   CVTHJES+1                                                02254000
CVTRSV42 EQU   CVTHJES                                                  02255000
CVTEXT2A EQU   CVTEXT2+1                                                02256000
CVTRSV41 EQU   CVTEXT2                                                  02257000
CVTAPFA  EQU   CVTAPF+1                                                 02258000
CVTRSV40 EQU   CVTAPF                                                   02259000
CVTRV518 EQU   CVTINTLA                                                 02260000
CVTRV517 EQU   CVTERPV                                                  02261000
CVTEORM  EQU   CVTMAP+312                                               02262000
CVTMCHPR EQU   CVTMAP+308                                               02263000
CVTTZ    EQU   CVTMAP+304                                               02264000
CVTJEPS  EQU   CVTMAP+300                                               02265000
CVTJESCT EQU   CVTMAP+296                                               02266000
CVTMODE  EQU   CVTMAP+292                                               02267000
CVTPTRV  EQU   CVTMAP+288                                               02268000
CVTREAL  EQU   CVTMAP+284                                               02269000
CVTRSV39 EQU   CVTMAP+280                                               02270000
CVTRSV38 EQU   CVTMAP+276                                               02271000
CVTDMSRA EQU   CVTDMSR+1                                                02272000
CVTRSV37 EQU   CVTDMSR                                                  02273000
CVTQMSGA EQU   CVTQMSG+1                                                02274000
CVTRSV36 EQU   CVTQMSG                                                  02275000
CVTPURGA EQU   CVTPURG+1                                                02276000
CVTRSV35 EQU   CVTPURG                                                  02277000
CVTATERA EQU   CVTATER+1                                                02278000
CVTSYST  EQU   CVTATER                                                  02279000
CVTVOLT2 EQU   CVTTAT                                                   02280000
CVTVOLI2 EQU   CVTVOLF2                                                 02281000
CVTAQAVB EQU   CVTAQAVT+1                                               02282000
CVTRSV34 EQU   CVTTCMFG                                                 02283000
CVTRSV33 EQU   CVTTCMFG                                                 02284000
CVTRSV32 EQU   CVTTCMFG                                                 02285000
CVTRSV31 EQU   CVTTCMFG                                                 02286000
CVTRSV30 EQU   CVTTCMFG                                                 02287000
CVTRSV29 EQU   CVTTCMFG                                                 02288000
CVTRSV28 EQU   CVTTCMFG                                                 02289000
CVTTCRDY EQU   CVTTCMFG                                                 02290000
CVTGTFA  EQU   CVTGTF+1                                                 02291000
CVTRSV27 EQU   CVTGTFST                                                 02292000
CVTRNIO  EQU   CVTGTFST                                                 02293000
CVTUSR   EQU   CVTGTFST                                                 02294000
CVTRV318 EQU   CVTFORM                                                  02295000
CVTRV317 EQU   CVTTMODE                                                 02296000
CVTRV316 EQU   CVTSTATE                                                 02297000
CVTRV315 EQU   CVTGTFS                                                  02298000
CVTGTFAV EQU   CVTGTFS                                                  02299000
CVT0SCR1 EQU   CVTMAP+232                                               02300000
CVTRV515 EQU   CVTMAP+228                                               02301000
CVTRMS   EQU   CVTMAP+224                                               02302000
CVTPATCH EQU   CVTMAP+220                                               02303000
CVTTSCE  EQU   CVTMAP+216                                               02304000
CVTLNKSC EQU   CVTMAP+214                                               02305000
CVTQABST EQU   CVTMAP+212                                               02306000
CVTMDLDS EQU   CVTMAP+208                                               02307000
CVTUSER  EQU   CVTMAP+204                                               02308000
CVTABEND EQU   CVTMAP+200                                               02309000
CVTSMCA  EQU   CVTMAP+196                                               02310000
CVTRSV18 EQU   CVTMAP+192                                               02311000
CVTQLPAQ EQU   CVTMAP+188                                               02312000
CVTQCDSR EQU   CVTMAP+184                                               02313000
CVTRSV17 EQU   CVTOPTB                                                  02314000
CVTRSV16 EQU   CVTOPTB                                                  02315000
CVTFP    EQU   CVTOPTB                                                  02316000
CVTAPTHR EQU   CVTOPTB                                                  02317000
CVTNLOG  EQU   CVTOPTB                                                  02318000
CVTTOD   EQU   CVTOPTB                                                  02319000
CVTCTIMS EQU   CVTOPTB                                                  02320000
CVTPROT  EQU   CVTOPTB                                                  02321000
CVTXPFP  EQU   CVTOPTA                                                  02322000
CVTASCII EQU   CVTOPTA                                                  02323000
CVTRSV13 EQU   CVTOPTA                                                  02324000
CVTRSV12 EQU   CVTOPTA                                                  02325000
CVTNIP   EQU   CVTOPTA                                                  02326000
CVTDDR   EQU   CVTOPTA                                                  02327000
CVTAPR   EQU   CVTOPTA                                                  02328000
CVTCCH   EQU   CVTOPTA                                                  02329000
CVTSNCTR EQU   CVTMAP+180                                               02330000
CVTQMWR  EQU   CVTMAP+176                                               02331000
CVTQOCR  EQU   CVTMAP+172                                               02332000
CVT1EF00 EQU   CVTMAP+168                                               02333000
CVTMZ00  EQU   CVTMAP+164                                               02334000
CVTHEAD  EQU   CVTMAP+160                                               02335000
CVTRSV11 EQU   CVTMAP+156                                               02336000
CVT0PT01 EQU   CVTMAP+152                                               02337000
CVTMSER  EQU   CVTMAP+148                                               02338000
CVTRV516 EQU   CVTIERLC                                                 02339000
CVTILCH  EQU   CVTMAP+140                                               02340000
CVT0DS   EQU   CVTMAP+136                                               02341000
CVTFBOSV EQU   CVTMAP+132                                               02342000
CVTNUCB  EQU   CVTMAP+128                                               02343000
CVTIXAVL EQU   CVTMAP+124                                               02344000
CVTIOQET EQU   CVTMAP+120                                               02345000
CVTDCBA  EQU   CVTMAP+117                                               02346000
CVTMVS2  EQU   CVTDCB                                                   02347000
CVT6DAT  EQU   CVTDCB                                                   02348000
CVT4MPS  EQU   CVTDCB                                                   02349000
CVTRSV09 EQU   CVTDCB                                                   02350000
CVT4MS1  EQU   CVTDCB                                                   02351000
CVT2SPS  EQU   CVTDCB                                                   02352000
CVT1SSS  EQU   CVTDCB                                                   02353000
CVTRSV08 EQU   CVTDCB                                                   02354000
CVTSTB   EQU   CVTMAP+112                                               02355000
CVTQTD00 EQU   CVTMAP+108                                               02356000
CVTQTE00 EQU   CVTMAP+104                                               02357000
CVTCUCB  EQU   CVTMAP+100                                               02358000
CVTSJQ   EQU   CVTMAP+96                                                02359000
CVTPBLDL EQU   CVTMAP+92                                                02360000
CVTTPC   EQU   CVTMAP+88                                                02361000
CVTSVDCB EQU   CVTMAP+84                                                02362000
CVTBRET  EQU   CVTMAP+82                                                02363000
CVTEXIT  EQU   CVTMAP+80                                                02364000
CVT0FN00 EQU   CVTMAP+76                                                02365000
CVTDARA  EQU   CVTDAR+1                                                 02366000
CVTRSV07 EQU   CVTFLGS1                                                 02367000
CVTRSV06 EQU   CVTFLGS1                                                 02368000
CVTRSV05 EQU   CVTFLGS1                                                 02369000
CVTRSV04 EQU   CVTFLGS1                                                 02370000
CVTRSV03 EQU   CVTFLGS1                                                 02371000
CVTRSV02 EQU   CVTFLGS1                                                 02372000
CVTRSV01 EQU   CVTFLGS1                                                 02373000
CVTDMPLK EQU   CVTFLGS1                                                 02374000
CVTXITP  EQU   CVTMAP+68                                                02375000
CVTZDTAB EQU   CVTMAP+64                                                02376000
CVTMSLT  EQU   CVTMAP+60                                                02377000
CVTDATE  EQU   CVTMAP+56                                                02378000
CVTBTERM EQU   CVTMAP+52                                                02379000
CVTSYSAD EQU   CVTMAP+48                                                02380000
CVTXTLER EQU   CVTMAP+44                                                02381000
CVTILK2  EQU   CVTMAP+40                                                02382000
CVTILK1  EQU   CVTMAP+36                                                02383000
CVTPRLTV EQU   CVTMAP+32                                                02384000
CVTPCNVT EQU   CVTMAP+28                                                02385000
CVT0VL00 EQU   CVTMAP+24                                                02386000
CVTXAPG  EQU   CVTMAP+20                                                02387000
CVTBUF   EQU   CVTMAP+16                                                02388000
CVTJOB   EQU   CVTMAP+12                                                02389000
CVTLINK  EQU   CVTMAP+8                                                 02390000
CVT0EF00 EQU   CVTMAP+4                                                 02391000
CVT      EQU   CVTMAP                                                   02392000
CNTVAR   EQU   CNTRLINF                                                 02393000
VARINFO  EQU   VARFIELD+2                                               02394000
VARLEN   EQU   VARFIELD                                                 02395000
REPGOPT  EQU   REPCNTRL+6                                               02396000
REPCNT   EQU   REPCNTRL+5                                               02397000
@NM00045 EQU   EXTRCDPT+3                                               02398000
EXTGOCI  EQU   EXTRCDPT                                                 02399000
NREPCV   EQU   CATRCD+47                                                02400000
RCDSIZ   EQU   CATRCD+45                                                02401000
RCDID    EQU   CATRCD+44                                                02402000
@NM00044 EQU   CATRCD+26                                                02403000
RCDDICTS EQU   CATRCD+22                                                02404000
RCDRACTS EQU   CATRCD+18                                                02405000
RCDCRADT EQU   CATRCD+14                                                02406000
RCDCRACI EQU   CATRCD+11                                                02407000
RCDCRAVL EQU   CATRCD+5                                                 02408000
RCDRELID EQU   CATRCD+4                                                 02409000
RCDCINO  EQU   CATRCD+1                                                 02410000
RCDKEYTY EQU   CATRCD                                                   02411000
CATGOGC  EQU   CATGOGC1                                                 02412000
CATGODEL EQU   CATGOGC1                                                 02413000
CATGOEXT EQU   CATGOGC1                                                 02414000
CATGODSP EQU   CATGOCI+1                                                02415000
@NM00043 EQU   CATGOFLG                                                 02416000
CCACPE4  EQU   CCARAB+16                                                02417000
CCACPE3  EQU   CCARAB+12                                                02418000
@NM00042 EQU   CCARAB+2                                                 02419000
CCARABRI EQU   CCARAB+1                                                 02420000
CCARBUPD EQU   CCARABFL                                                 02421000
@NM00041 EQU   CCARABFL                                                 02422000
CCARBPA  EQU   CCARABFL                                                 02423000
CCARBWR  EQU   CCARABFL                                                 02424000
CCARBU2  EQU   CCARABFL                                                 02425000
CCARBU1  EQU   CCARABFL                                                 02426000
CCARBUR  EQU   CCARABFL                                                 02427000
DIC2GC   EQU   DIC2ENT+3                                                02428000
DIC2LC   EQU   DIC2ENT+2                                                02429000
DIC2ST   EQU   DIC2ENT+1                                                02430000
@NM00040 EQU   DIC2FLGS                                                 02431000
DIC2UPGD EQU   DIC2FLGS                                                 02432000
DIC2SCRA EQU   DIC2FLGS                                                 02433000
DIC2MV   EQU   DIC2FLGS                                                 02434000
DIC2FLG  EQU   DIC2FLGS                                                 02435000
DIC2COMB EQU   DIC2FLGS                                                 02436000
DIC2REP  EQU   DIC2FLGS                                                 02437000
DIC2VAR  EQU   DIC2FLGS                                                 02438000
DICTGC   EQU   DICTENT+3                                                02439000
DICTLC   EQU   DICTENT+2                                                02440000
DICTST   EQU   DICTENT+1                                                02441000
@NM00039 EQU   DICTFLGS                                                 02442000
DICTUPGD EQU   DICTFLGS                                                 02443000
DICTSCRA EQU   DICTFLGS                                                 02444000
DICTMV   EQU   DICTFLGS                                                 02445000
DICTFLG  EQU   DICTFLGS                                                 02446000
DICTCOMB EQU   DICTFLGS                                                 02447000
DICTREP  EQU   DICTFLGS                                                 02448000
DICTVAR  EQU   DICTFLGS                                                 02449000
ENTNAMEV EQU   ENTNAMES+1                                               02450000
ENTNAMET EQU   ENTNAMES                                                 02451000
WKALEN2  EQU   USERWKA+2                                                02452000
WKALEN1  EQU   USERWKA                                                  02453000
CTGFLNG  EQU   CTGFLDAT                                                 02454000
CTGFLCHN EQU   CTGFL+12                                                 02455000
CTGFLDTS EQU   CTGFLDRE                                                 02456000
@NM00038 EQU   CTGFLDRE                                                 02457000
CTGFLDCD EQU   CTGFL+1                                                  02458000
CTGFLDNO EQU   CTGFL                                                    02459000
CTGPSWD  EQU   CTGJSCB                                                  02460000
@NM00036 EQU   CTGFBFLG                                                 02461000
CTGNGDSN EQU   CTGFBFLG                                                 02462000
CTGGDGB  EQU   CTGFBFLG                                                 02463000
CTGKEEP  EQU   CTGFBFLG                                                 02464000
CTGPAR   EQU   CTGFBFLG                                                 02465000
CTGFDBK  EQU   CTGNEWNM                                                 02466000
CTGTYPE  EQU   CTGPL+18                                                 02467000
@NM00035 EQU   CTGDSORG                                                 02468000
CTGOPTNS EQU   CTGDSORG                                                 02469000
@NM00034 EQU   CTGOPTN4                                                 02470000
CTGDOCAT EQU   CTGOPTN4                                                 02471000
CTGLBASE EQU   CTGOPTN4                                                 02472000
CTGAM0   EQU   CTGOPTN3                                                 02473000
CTGNUM   EQU   CTGOPTN3                                                 02474000
CTGSRH   EQU   CTGOPTN3                                                 02475000
CTGGDGL  EQU   CTGOPTN3                                                 02476000
CTGSUPLT EQU   CTGOPTN3                                                 02477000
CTGFUNC  EQU   CTGOPTN3                                                 02478000
@NM00033 EQU   CTGOPTN2                                                 02479000
CTGSCR   EQU   CTGOPTN2                                                 02480000
CTGOVRID EQU   CTGOPTN2                                                 02481000
CTGDISC  EQU   CTGOPTN2                                                 02482000
CTGGTNXT EQU   CTGOPTN2                                                 02483000
CTGRCATN EQU   CTGVMNT                                                  02484000
CTGGTALL EQU   CTGREL                                                   02485000
CTGNSVS  EQU   CTGEXT                                                   02486000
CTGGENLD EQU   CTGOPTN1                                                 02487000
CTGCNAME EQU   CTGOPTN1                                                 02488000
CTGNAME  EQU   CTGOPTN1                                                 02489000
CTGREAD  EQU   CTGOPTN1                                                 02490000
CTGUPD   EQU   CTGOPTN1                                                 02491000
CTGCI    EQU   CTGOPTN1                                                 02492000
CTGMAST  EQU   CTGOPTN1                                                 02493000
CTGBYPSS EQU   CTGOPTN1                                                 02494000
CCAEND   EQU   IGGCCA+1492                                              02495000
CCADGDGA EQU   IGGCCA+1488                                              02496000
CCARETRX EQU   CCAERCDX+1                                               02497000
CCARESNX EQU   CCAERCDX                                                 02498000
CCAMODDX EQU   CCAPROBX                                                 02499000
CCASMFCD EQU   CCASMFP+3                                                02500000
CCASMFRC EQU   CCASMFP+2                                                02501000
CCASMFMD EQU   CCASMFP                                                  02502000
CCAREWKA EQU   IGGCCA+1476                                              02503000
CCAVTS   EQU   IGGCCA+1468                                              02504000
CCARAVCA EQU   IGGCCA+1460                                              02505000
CCARANCA EQU   IGGCCA+1452                                              02506000
CCADICTS EQU   IGGCCA+1448                                              02507000
CCASUMTT EQU   IGGCCA+1445                                              02508000
@NM00032 EQU   CCAFLG10                                                 02509000
CCAPRANX EQU   CCAFLG10                                                 02510000
CCARARTC EQU   CCAFLG10                                                 02511000
CCARAFEV EQU   CCAFLG10                                                 02512000
CCACATAC EQU   CCAFLG10                                                 02513000
CCAPDMW  EQU   CCAFLG10                                                 02514000
CCAINCPL EQU   CCAFLG10                                                 02515000
@NM00031 EQU   CCARALSA+2                                               02516000
CCACRABT EQU   CCARALSA                                                 02517000
CCARAREC EQU   IGGCCA+1436                                              02518000
CCARARBA EQU   IGGCCA+1432                                              02519000
CCARARPL EQU   IGGCCA+1428                                              02520000
CCARAACB EQU   IGGCCA+1424                                              02521000
CCACRACI EQU   IGGCCA+1420                                              02522000
CCASBASE EQU   IGGCCA+1417                                              02523000
@NM00030 EQU   IGGCCA+1416                                              02524000
CCADSPWA EQU   CCABZSAV                                                 02525000
CCAMODNM EQU   CCAREGS+4                                                02526000
@NM00029 EQU   CCAREGS                                                  02527000
@NM00028 EQU   IGGCCA+1057                                              02528000
@NM00027 EQU   CCARVFG1                                                 02529000
RVESBOR  EQU   CCARVFG1                                                 02530000
RVESBO   EQU   CCARVFG1                                                 02531000
RVCMSFG  EQU   CCARVFG1                                                 02532000
RVARFI   EQU   CCARVFG1                                                 02533000
RVCCAV   EQU   CCARVFG1                                                 02534000
ARFSBECH EQU   CCAARFWA+12                                              02535000
ARFSBSCH EQU   CCAARFWA+8                                               02536000
ARFGMADR EQU   CCAARFWA+4                                               02537000
ARFLEN   EQU   ARFGMLEN+1                                               02538000
ARFGMLP  EQU   ARFGMLEN                                                 02539000
CCAMNLL  EQU   CCAMNCAT+248                                             02540000
MNATARG2 EQU   CCAMNAT+244                                              02541000
MNATARG1 EQU   CCAMNAT+241                                              02542000
MNATSCLS EQU   MNATFLGS                                                 02543000
@NM00026 EQU   MNATFLGS                                                 02544000
MNATVAL  EQU   MNATFLGS                                                 02545000
@NM00025 EQU   CCAMNAT+1                                                02546000
@NM00024 EQU   MNATTOP                                                  02547000
CCABMRB2 EQU   IGGCCA+740                                               02548000
CCABMRB1 EQU   IGGCCA+736                                               02549000
CCABMWK4 EQU   IGGCCA+732                                               02550000
CCABMWK3 EQU   IGGCCA+728                                               02551000
CCABMWK2 EQU   IGGCCA+724                                               02552000
CCABMWK1 EQU   IGGCCA+720                                               02553000
CCABMSTR EQU   IGGCCA+718                                               02554000
CCABMBYT EQU   IGGCCA+716                                               02555000
CCABMBTL EQU   IGGCCA+714                                               02556000
CCABMBT1 EQU   IGGCCA+712                                               02557000
CCABMEND EQU   IGGCCA+708                                               02558000
CCABMPTR EQU   IGGCCA+704                                               02559000
CCABMGOP EQU   IGGCCA+700                                               02560000
CCABMPAD EQU   IGGCCA+699                                               02561000
@NM00023 EQU   IGGCCA+697                                               02562000
CCABMOST EQU   CCABMOFG                                                 02563000
CCABMOTR EQU   CCABMOUT+2                                               02564000
CCABMONN EQU   CCABMOUT                                                 02565000
@NM00022 EQU   CCABMINP+7                                               02566000
CCABMLST EQU   CCABMFLG                                                 02567000
CCABMCCK EQU   CCABMFLG                                                 02568000
CCABMSET EQU   CCABMFLG                                                 02569000
CCABMCHK EQU   CCABMFLG                                                 02570000
CCABMST  EQU   CCABMFLG                                                 02571000
CCABMMIN EQU   CCABMINP+4                                               02572000
CCABMLIM EQU   CCABMINP+2                                               02573000
CCABMTRK EQU   CCABMINP                                                 02574000
CCAR14S  EQU   IGGCCA+680                                               02575000
CCAXLATE EQU   IGGCCA+640                                               02576000
CCADEL2  EQU   IGGCCA+637                                               02577000
CCADEL1  EQU   IGGCCA+634                                               02578000
CCAVAR1  EQU   IGGCCA+614                                               02579000
CCAVAR   EQU   IGGCCA+594                                               02580000
CCADELN  EQU   IGGCCA+592                                               02581000
CCAVARPT EQU   IGGCCA+588                                               02582000
CCARBASE EQU   IGGCCA+584                                               02583000
CCARRAB  EQU   IGGCCA+580                                               02584000
CCAVARLN EQU   IGGCCA+578                                               02585000
CCACI3   EQU   IGGCCA+575                                               02586000
CCACI2   EQU   IGGCCA+572                                               02587000
CCACI1   EQU   IGGCCA+569                                               02588000
CCACHAIN EQU   IGGCCA+566                                               02589000
CCASMFLN EQU   IGGCCA+564                                               02590000
CCASMFG2 EQU   CCASMFLG+1                                               02591000
@NM00021 EQU   CCASMFG1                                                 02592000
CCASMFAL EQU   CCASMFSR                                                 02593000
CCASMFDF EQU   CCASMFUC                                                 02594000
CCASMFCT EQU   IGGCCA+560                                               02595000
CCASMFRD EQU   IGGCCA+556                                               02596000
CCANORBA EQU   IGGCCA+555                                               02597000
CCARESUM EQU   CCAFLG9                                                  02598000
CCARAICI EQU   CCAFLG9                                                  02599000
CCARAACT EQU   CCAFLG9                                                  02600000
CCAUCRA  EQU   CCAFLG9                                                  02601000
CCARACR  EQU   CCAFLG9                                                  02602000
CCARALRD EQU   CCAFLG9                                                  02603000
CCARAEOV EQU   CCAFLG9                                                  02604000
CCARABYC EQU   CCAFLG9                                                  02605000
CCAAUCAT EQU   CCAFLG8                                                  02606000
CCALEOD  EQU   CCAFLG8                                                  02607000
CCAVRIND EQU   CCAFLG8                                                  02608000
CCALPIND EQU   CCAFLG8                                                  02609000
CCASCICK EQU   CCAFLG8                                                  02610000
CCASCRA  EQU   CCAFLG8                                                  02611000
CCAVBUFI EQU   CCAFLG8                                                  02612000
CCADSRCL EQU   CCAFLG8                                                  02613000
CCACRABU EQU   CCAFLG7                                                  02614000
CCAFEOV  EQU   CCAFLG7                                                  02615000
CCAROREQ EQU   CCAFLG7                                                  02616000
CCAONCE  EQU   CCAFLG7                                                  02617000
CCASMFBR EQU   CCAFLG7                                                  02618000
CCASMFA  EQU   CCAFLG7                                                  02619000
CCASMFEX EQU   CCAFLG7                                                  02620000
CCALSP   EQU   CCAFLG7                                                  02621000
CCALCPL  EQU   IGGCCA+548                                               02622000
CCASMFPT EQU   IGGCCA+544                                               02623000
CCAALPTR EQU   IGGCCA+540                                               02624000
CCAILNG2 EQU   IGGCCA+536                                               02625000
CCAILNG3 EQU   IGGCCA+532                                               02626000
CCASDWAP EQU   IGGCCA+528                                               02627000
CCACWAP  EQU   IGGCCA+524                                               02628000
CCACDTCT EQU   IGGCCA+522                                               02629000
CCADTCT  EQU   IGGCCA+520                                               02630000
CCACDTA  EQU   IGGCCA+516                                               02631000
CCADTA   EQU   IGGCCA+512                                               02632000
CCASVCI1 EQU   IGGCCA+509                                               02633000
CCASVCI  EQU   IGGCCA+506                                               02634000
CCADISP  EQU   IGGCCA+504                                               02635000
CCAREPCT EQU   IGGCCA+502                                               02636000
CCADIFF  EQU   IGGCCA+500                                               02637000
CCADLEN  EQU   IGGCCA+498                                               02638000
CCAIXTPL EQU   IGGCCA+496                                               02639000
CCAGRHI1 EQU   CCASSEQ                                                  02640000
CCARCDID EQU   CCAGRGC                                                  02641000
@NM00020 EQU   IGGCCA+492                                               02642000
CCANEFV  EQU   IGGCCA+491                                               02643000
CCAGVEXT EQU   IGGCCA+488                                               02644000
CCANEVV  EQU   IGGCCA+486                                               02645000
CCAGVCT  EQU   IGGCCA+484                                               02646000
CCARABSM EQU   CCAIDPT3                                                 02647000
CCAIDPT2 EQU   IGGCCA+476                                               02648000
CCASMFIX EQU   IGGCCA+474                                               02649000
CCACNIX  EQU   IGGCCA+472                                               02650000
CCARBAL  EQU   IGGCCA+470                                               02651000
CCATLEN  EQU   CCATLNG                                                  02652000
CCARBA2  EQU   CCARBA+16                                                02653000
CCARBA1  EQU   CCARBA+12                                                02654000
CCATT    EQU   CCARBA+10                                                02655000
CCACCHH2 EQU   CCACRADT                                                 02656000
CCACCHH1 EQU   CCACRAVL+2                                               02657000
CCASS    EQU   CCACRAVL                                                 02658000
CCATEST  EQU   IGGCCA+444                                               02659000
CCATNO   EQU   IGGCCA+442                                               02660000
CCATREL  EQU   IGGCCA+410                                               02661000
CCATNUM  EQU   IGGCCA+408                                               02662000
CCATNREL EQU   IGGCCA+406                                               02663000
CCAIXREL EQU   IGGCCA+404                                               02664000
CCAIXFPL EQU   IGGCCA+402                                               02665000
@NM00019 EQU   IGGCCA+400                                               02666000
CCASN1   EQU   CCASN                                                    02667000
CCALREL1 EQU   CCALREL                                                  02668000
CCAGC    EQU   IGGCCA+395                                               02669000
CCACBASE EQU   IGGCCA+392                                               02670000
CCARABL  EQU   IGGCCA+388                                               02671000
CCARABF  EQU   IGGCCA+384                                               02672000
CCARABB  EQU   IGGCCA+380                                               02673000
CCARABPT EQU   IGGCCA+368                                               02674000
CCATFLPT EQU   CCAFLPT                                                  02675000
CCAILNG  EQU   IGGCCA+360                                               02676000
CCASL    EQU   IGGCCA+358                                               02677000
CCAGOPLN EQU   IGGCCA+356                                               02678000
CCACPE71 EQU   IGGCCA+352                                               02679000
CCAIDPT  EQU   CCACPE7                                                  02680000
CCARABSE EQU   CCACPE61                                                 02681000
CCACPE53 EQU   IGGCCA+336                                               02682000
CCACPE52 EQU   IGGCCA+332                                               02683000
CCACPE51 EQU   IGGCCA+328                                               02684000
CCALUME  EQU   IGGCCA+324                                               02685000
CCAEXCMS EQU   CCACMS+4                                                 02686000
CCARPRM  EQU   IGGCCA+312                                               02687000
@NM00018 EQU   CCAMSSPL+10                                              02688000
@NM00017 EQU   CCAMSSPL+8                                               02689000
CCAMNPTR EQU   CCAMSSPL+4                                               02690000
CCAMNLLP EQU   CCAMSSPL                                                 02691000
CCAMLRET EQU   IGGCCA+296                                               02692000
CCAEDUCB EQU   CCAEQDQ+12                                               02693000
CCAEDRNM EQU   CCAEQDQ+8                                                02694000
CCAEDQNM EQU   CCAEQDQ+4                                                02695000
CCAEDRCD EQU   CCAEQDQ+3                                                02696000
@NM00016 EQU   CCAEDOPT                                                 02697000
CCAEDSHR EQU   CCAEDOPT                                                 02698000
CCAEDRLN EQU   CCAEQDQ+1                                                02699000
CCAEDXFF EQU   CCAEQDQ                                                  02700000
CCAASCI  EQU   IGGCCA+271                                               02701000
CCAASCIX EQU   IGGCCA+270                                               02702000
CCACRRP  EQU   IGGCCA+269                                               02703000
CCAASCIK EQU   IGGCCA+268                                               02704000
CCAEXTTH EQU   CCAEXTDE+6                                               02705000
CCAEXTHH EQU   CCAEXTAD+2                                               02706000
CCAEXTCC EQU   CCAEXTAD                                                 02707000
CCAEXTSS EQU   CCAEXTDE                                                 02708000
CCASSVOL EQU   CCADESA+2                                                02709000
CCAIXEXT EQU   CCADESA+1                                                02710000
CCANDEXT EQU   CCADESA                                                  02711000
CCARPL1  EQU   IGGCCA+220                                               02712000
CCAQLEN  EQU   IGGCCA+219                                               02713000
CCASC    EQU   IGGCCA+218                                               02714000
@NM00015 EQU   IGGCCA+212                                               02715000
CCARPLT  EQU   IGGCCA+211                                               02716000
CCARPLX  EQU   IGGCCA+210                                               02717000
CCARPLF  EQU   IGGCCA+209                                               02718000
CCARPLK  EQU   IGGCCA+208                                               02719000
CCACPE45 EQU   CCAR5SEG+8                                               02720000
CCACPE35 EQU   CCAR5SEG+4                                               02721000
CCACPE25 EQU   CCAR5SEG                                                 02722000
CCAR5REC EQU   CCARAB5+4                                                02723000
@NM00014 EQU   CCARAB5+2                                                02724000
CCAR5RPL EQU   CCARAB5+1                                                02725000
CCAR5UPD EQU   CCAR5FLG                                                 02726000
@NM00013 EQU   CCAR5FLG                                                 02727000
CCAR5PA  EQU   CCAR5FLG                                                 02728000
CCAR5WR  EQU   CCAR5FLG                                                 02729000
CCAR5U2  EQU   CCAR5FLG                                                 02730000
CCAR5U1  EQU   CCAR5FLG                                                 02731000
CCAR5UR  EQU   CCAR5FLG                                                 02732000
CCACPE44 EQU   CCAR4SEG+8                                               02733000
CCACPE34 EQU   CCAR4SEG+4                                               02734000
CCACPE24 EQU   CCAR4SEG                                                 02735000
CCAR4REC EQU   CCARAB4+4                                                02736000
@NM00012 EQU   CCARAB4+2                                                02737000
CCAR4RPL EQU   CCARAB4+1                                                02738000
CCAR4UPD EQU   CCAR4FLG                                                 02739000
@NM00011 EQU   CCAR4FLG                                                 02740000
CCAR4PA  EQU   CCAR4FLG                                                 02741000
CCAR4WR  EQU   CCAR4FLG                                                 02742000
CCAR4U2  EQU   CCAR4FLG                                                 02743000
CCAR4U1  EQU   CCAR4FLG                                                 02744000
CCAR4UR  EQU   CCAR4FLG                                                 02745000
CCACPE43 EQU   CCAR3SEG+8                                               02746000
CCACPE33 EQU   CCAR3SEG+4                                               02747000
CCACPE23 EQU   CCAR3SEG                                                 02748000
CCAR3REC EQU   CCARAB3+4                                                02749000
@NM00010 EQU   CCARAB3+2                                                02750000
CCAR3RPL EQU   CCARAB3+1                                                02751000
CCAR3UPD EQU   CCAR3FLG                                                 02752000
@NM00009 EQU   CCAR3FLG                                                 02753000
CCAR3PA  EQU   CCAR3FLG                                                 02754000
CCAR3WR  EQU   CCAR3FLG                                                 02755000
CCAR3U2  EQU   CCAR3FLG                                                 02756000
CCAR3U1  EQU   CCAR3FLG                                                 02757000
CCAR3UR  EQU   CCAR3FLG                                                 02758000
CCACPE42 EQU   CCAR2SEG+8                                               02759000
CCACPE32 EQU   CCAR2SEG+4                                               02760000
CCACPE22 EQU   CCAR2SEG                                                 02761000
CCAR2REC EQU   CCARAB2+4                                                02762000
@NM00008 EQU   CCARAB2+2                                                02763000
CCAR2RPL EQU   CCARAB2+1                                                02764000
CCAR2UPD EQU   CCAR2FLG                                                 02765000
@NM00007 EQU   CCAR2FLG                                                 02766000
CCAR2PA  EQU   CCAR2FLG                                                 02767000
CCAR2WR  EQU   CCAR2FLG                                                 02768000
CCAR2U2  EQU   CCAR2FLG                                                 02769000
CCAR2U1  EQU   CCAR2FLG                                                 02770000
CCAR2UR  EQU   CCAR2FLG                                                 02771000
CCACPE41 EQU   CCAR1SEG+8                                               02772000
CCACPE31 EQU   CCAR1SEG+4                                               02773000
CCACPE21 EQU   CCAR1SEG                                                 02774000
CCAR1REC EQU   CCARAB1+4                                                02775000
@NM00006 EQU   CCARAB1+2                                                02776000
CCAR1RPL EQU   CCARAB1+1                                                02777000
CCAR1UPD EQU   CCAR1FLG                                                 02778000
@NM00005 EQU   CCAR1FLG                                                 02779000
CCAR1PA  EQU   CCAR1FLG                                                 02780000
CCAR1WR  EQU   CCAR1FLG                                                 02781000
CCAR1U2  EQU   CCAR1FLG                                                 02782000
CCAR1U1  EQU   CCAR1FLG                                                 02783000
CCAR1UR  EQU   CCAR1FLG                                                 02784000
CCACPE40 EQU   CCAR0SEG+8                                               02785000
CCACPE30 EQU   CCAR0SEG+4                                               02786000
CCACPE20 EQU   CCAR0SEG                                                 02787000
CCAR0REC EQU   CCARAB0+4                                                02788000
@NM00004 EQU   CCARAB0+2                                                02789000
CCAR0RPL EQU   CCARAB0+1                                                02790000
CCAR0UPD EQU   CCAR0FLG                                                 02791000
@NM00003 EQU   CCAR0FLG                                                 02792000
CCAR0PA  EQU   CCAR0FLG                                                 02793000
CCAR0WR  EQU   CCAR0FLG                                                 02794000
CCAR0U2  EQU   CCAR0FLG                                                 02795000
CCAR0U1  EQU   CCAR0FLG                                                 02796000
CCAR0UR  EQU   CCAR0FLG                                                 02797000
@NM00002 EQU   CCASRCH+3                                                02798000
CCASRCIN EQU   CCASRID                                                  02799000
CCANPCCB EQU   IGGCCA+36                                                02800000
CCADPL   EQU   CCARB                                                    02801000
CCALBCYL EQU   CCATCB                                                   02802000
CCAMOD   EQU   CCAFLG6                                                  02803000
CCAEXT   EQU   CCAFLG6                                                  02804000
CCAREUSE EQU   CCAFLG6                                                  02805000
CCASUPFD EQU   CCAFLG6                                                  02806000
CCAINIT  EQU   CCAFLG6                                                  02807000
CCAMNOSP EQU   CCAFLG6                                                  02808000
CCADELP  EQU   CCAFLG6                                                  02809000
CCAMCODR EQU   CCAFLG6                                                  02810000
CCATEX2  EQU   CCAFLG5                                                  02811000
CCATEX1  EQU   CCAFLG5                                                  02812000
CCATEX   EQU   CCAFLG5                                                  02813000
CCATHIT  EQU   CCAFLG5                                                  02814000
CCAMODPA EQU   CCAFLG5                                                  02815000
CCAMEX1  EQU   CCAFLG5                                                  02816000
CCAMEX   EQU   CCAFLG5                                                  02817000
CCAMEX2  EQU   CCAFLG5                                                  02818000
CCATCOMP EQU   CCAFLG4                                                  02819000
CCAGVNE  EQU   CCAFLG4                                                  02820000
CCAGVEX  EQU   CCAFLG4                                                  02821000
CCAGVNBS EQU   CCAFLG4                                                  02822000
CCAGVNF  EQU   CCAFLG4                                                  02823000
CCAGVNC  EQU   CCAFLG4                                                  02824000
CCAF4BYS EQU   CCAFLG4                                                  02825000
CCAF4DRQ EQU   CCAFLG4                                                  02826000
CCAEGREC EQU   CCAFLG3                                                  02827000
CCALFT   EQU   CCAFLG3                                                  02828000
CCAELC2  EQU   CCAFLG3                                                  02829000
CCANF    EQU   CCAFLG3                                                  02830000
CCAEXGR2 EQU   CCAFLG3                                                  02831000
CCAGDSP  EQU   CCAFLG3                                                  02832000
CCAGC4   EQU   CCAFLG3                                                  02833000
CCAEXGR1 EQU   CCAFLG3                                                  02834000
CCAF2SMO EQU   CCAFLG2                                                  02835000
CCAF2CB  EQU   CCAF2COB                                                 02836000
CCAF2CO  EQU   CCAF2COB                                                 02837000
CCAF2RHS EQU   CCAFLG2                                                  02838000
CCAF2XEQ EQU   CCAFLG2                                                  02839000
CCAF2CCT EQU   CCAFLG2                                                  02840000
CCAF2NVC EQU   CCAFLG2                                                  02841000
CCAF2SYS EQU   CCAFLG2                                                  02842000
CCAF1DK  EQU   CCAFLG1                                                  02843000
CCAF1UP  EQU   CCAFLG1                                                  02844000
CCAF1CR  EQU   CCAFLG1                                                  02845000
CCAF1KGE EQU   CCAFLG1                                                  02846000
CCAF1KEY EQU   CCAFLG1                                                  02847000
CCAF1LRD EQU   CCAFLG1                                                  02848000
CCAF1CNS EQU   CCAFLG1                                                  02849000
CCAF1LPS EQU   CCAFLG1                                                  02850000
CCACD2   EQU   IGGCCA+13                                                02851000
@NM00001 EQU   IGGCCA+8                                                 02852000
CCACDR   EQU   CCAREASN                                                 02853000
CCAMODID EQU   CCAPROB                                                  02854000
CCASZ    EQU   IGGCCA+2                                                 02855000
CCAID    EQU   IGGCCA                                                   02856000
@NM00075 EQU   PSA+3412                                                 02857000
PSASTAK  EQU   PSA+3072                                                 02858000
@NM00074 EQU   PSA+1040                                                 02859000
PSAUSEND EQU   PSA+1040                                                 02860000
PSARV062 EQU   PSA+1036                                                 02861000
PSAATCVT EQU   PSA+1032                                                 02862000
PSAPCPSW EQU   PSA+1024                                                 02863000
PSARV060 EQU   PSA+1020                                                 02864000
PSARV059 EQU   PSA+1018                                                 02865000
PSASVC13 EQU   PSA+1016                                                 02866000
PSALSFCC EQU   PSA+1012                                                 02867000
PSASFACC EQU   PSA+1008                                                 02868000
PSASTOP  EQU   PSA+992                                                  02869000
PSASTART EQU   PSA+976                                                  02870000
PSARSPSW EQU   PSA+968                                                  02871000
PSASRPSW EQU   PSA+960                                                  02872000
PSARV045 EQU   PSA+892                                                  02873000
PSARV044 EQU   PSA+888                                                  02874000
PSARV043 EQU   PSA+884                                                  02875000
PSARV042 EQU   PSA+880                                                  02876000
PSARV041 EQU   PSA+876                                                  02877000
PSARV040 EQU   PSA+872                                                  02878000
PSARV025 EQU   PSA+868                                                  02879000
PSADSSED EQU   PSA+868                                                  02880000
PSADSSPR EQU   PSA+864                                                  02881000
PSADSSFW EQU   PSA+860                                                  02882000
PSADSS14 EQU   PSA+856                                                  02883000
PSADSSPP EQU   PSA+848                                                  02884000
PSADSSRP EQU   PSA+840                                                  02885000
PSADSS05 EQU   PSADSSF4                                                 02886000
PSADSS10 EQU   PSADSSF4                                                 02887000
PSADSSVE EQU   PSADSSF4                                                 02888000
PSADSSDE EQU   PSADSSF4                                                 02889000
PSADSSC0 EQU   PSADSSF4                                                 02890000
PSADSSIE EQU   PSADSSF4                                                 02891000
PSADSS12 EQU   PSADSSF4                                                 02892000
PSADSSRC EQU   PSADSSF4                                                 02893000
PSARV057 EQU   PSADSSF3                                                 02894000
PSARV056 EQU   PSADSSF3                                                 02895000
PSARV055 EQU   PSADSSF3                                                 02896000
PSADSSMC EQU   PSADSSF3                                                 02897000
PSADSSRW EQU   PSADSSF3                                                 02898000
PSADSSNM EQU   PSADSSF3                                                 02899000
PSADSSES EQU   PSADSSF3                                                 02900000
PSADSSGP EQU   PSADSSF3                                                 02901000
PSADSSF2 EQU   PSADSSFL+1                                               02902000
PSADSSPI EQU   PSADSSF1                                                 02903000
PSADSSOI EQU   PSADSSF1                                                 02904000
PSADSSSP EQU   PSADSSF1                                                 02905000
PSADSSTP EQU   PSADSSF1                                                 02906000
PSADSSDW EQU   PSADSSF1                                                 02907000
PSADSSDD EQU   PSADSSF1                                                 02908000
PSADSSDM EQU   PSADSSF1                                                 02909000
PSADSSMV EQU   PSADSSF1                                                 02910000
PSADSSTS EQU   PSA+816                                                  02911000
PSADSSWK EQU   PSA+812                                                  02912000
PSADSSR3 EQU   PSA+808                                                  02913000
PSADSSR2 EQU   PSA+804                                                  02914000
PSADSSRS EQU   PSA+800                                                  02915000
PSASTOR  EQU   PSA+796                                                  02916000
PSACPUSA EQU   PSA+794                                                  02917000
PSAVSTAP EQU   PSA+792                                                  02918000
PSAWKVAP EQU   PSA+788                                                  02919000
PSAWKRAP EQU   PSA+784                                                  02920000
PSAMCHIC EQU   PSA+783                                                  02921000
PSARV061 EQU   PSA+782                                                  02922000
PSASYMSK EQU   PSA+781                                                  02923000
PSAMCHFL EQU   PSA+780                                                  02924000
PSACR0   EQU   PSA+776                                                  02925000
PSAPSWSV EQU   PSA+768                                                  02926000
PSALITA  EQU   PSA+764                                                  02927000
PSACLHS  EQU   PSAHLHI                                                  02928000
PSALKR15 EQU   PSALKSA+60                                               02929000
PSALKR14 EQU   PSALKSA+56                                               02930000
PSALKR13 EQU   PSALKSA+52                                               02931000
PSALKR12 EQU   PSALKSA+48                                               02932000
PSALKR11 EQU   PSALKSA+44                                               02933000
PSALKR10 EQU   PSALKSA+40                                               02934000
PSALKR9  EQU   PSALKSA+36                                               02935000
PSALKR8  EQU   PSALKSA+32                                               02936000
PSALKR7  EQU   PSALKSA+28                                               02937000
PSALKR6  EQU   PSALKSA+24                                               02938000
PSALKR5  EQU   PSALKSA+20                                               02939000
PSALKR4  EQU   PSALKSA+16                                               02940000
PSALKR3  EQU   PSALKSA+12                                               02941000
PSALKR2  EQU   PSALKSA+8                                                02942000
PSALKR1  EQU   PSALKSA+4                                                02943000
PSALKR0  EQU   PSALKSA                                                  02944000
PSARV023 EQU   PSACLHT+52                                               02945000
PSALOCAL EQU   PSACLHT+48                                               02946000
PSACMSL  EQU   PSACLHT+44                                               02947000
PSAOPTL  EQU   PSACLHT+40                                               02948000
PSATPACL EQU   PSACLHT+36                                               02949000
PSATPDNL EQU   PSACLHT+32                                               02950000
PSATPNCL EQU   PSACLHT+28                                               02951000
PSAIOSLL EQU   PSACLHT+24                                               02952000
PSAIOSUL EQU   PSACLHT+20                                               02953000
PSAIOSCL EQU   PSACLHT+16                                               02954000
PSAIOSSL EQU   PSACLHT+12                                               02955000
PSASALCL EQU   PSACLHT+8                                                02956000
PSAASML  EQU   PSACLHT+4                                                02957000
PSADISPL EQU   PSACLHT                                                  02958000
PSASRSA  EQU   PSA+636                                                  02959000
PSARV050 EQU   PSA+634                                                  02960000
PSADSSGO EQU   PSA+633                                                  02961000
PSARECUR EQU   PSA+632                                                  02962000
PSAHLHIS EQU   PSA+628                                                  02963000
PSAIPCSA EQU   PSA+624                                                  02964000
@NM00073 EQU   PSA+621                                                  02965000
PSAIPCDM EQU   PSA+620                                                  02966000
PSAIPCD  EQU   PSA+616                                                  02967000
@NM00072 EQU   PSA+613                                                  02968000
PSAIPCRM EQU   PSA+612                                                  02969000
PSAIPCR  EQU   PSA+608                                                  02970000
PSAMCHEX EQU   PSA+600                                                  02971000
PSAMPSW  EQU   PSA+592                                                  02972000
PSAEXPS2 EQU   PSA+584                                                  02973000
PSAEXPS1 EQU   PSA+576                                                  02974000
PSAPIREG EQU   PSA+572                                                  02975000
PSARSREG EQU   PSA+568                                                  02976000
PSAGPREG EQU   PSA+556                                                  02977000
PSARV022 EQU   PSASUP4                                                  02978000
PSARV021 EQU   PSASUP4                                                  02979000
PSARV020 EQU   PSASUP4                                                  02980000
PSARV019 EQU   PSASUP4                                                  02981000
PSARV018 EQU   PSASUP4                                                  02982000
PSARV017 EQU   PSASUP4                                                  02983000
PSARV016 EQU   PSASUP4                                                  02984000
PSARV015 EQU   PSASUP4                                                  02985000
PSARV014 EQU   PSASUP3                                                  02986000
PSARV013 EQU   PSASUP3                                                  02987000
PSARV012 EQU   PSASUP3                                                  02988000
PSARV011 EQU   PSASUP3                                                  02989000
PSARV010 EQU   PSASUP3                                                  02990000
PSARV009 EQU   PSASUP3                                                  02991000
PSARV008 EQU   PSASUP3                                                  02992000
PSAIOSUP EQU   PSASUP3                                                  02993000
PSALCR   EQU   PSASUP2                                                  02994000
PSARTM   EQU   PSASUP2                                                  02995000
PSAACR   EQU   PSASUP2                                                  02996000
PSAIPCE2 EQU   PSASUP2                                                  02997000
PSAIPCES EQU   PSASUP2                                                  02998000
PSAIPCEC EQU   PSASUP2                                                  02999000
PSAGTF   EQU   PSASUP2                                                  03000000
PSAIPCRI EQU   PSASUP2                                                  03001000
PSAIPCRP EQU   PSASUP1                                                  03002000
PSAIPCDR EQU   PSASUP1                                                  03003000
PSADISP  EQU   PSASUP1                                                  03004000
PSALOCK  EQU   PSASUP1                                                  03005000
PSAPI    EQU   PSASUP1                                                  03006000
PSAEXT   EQU   PSASUP1                                                  03007000
PSASVC   EQU   PSASUP1                                                  03008000
PSAIO    EQU   PSASUP1                                                  03009000
PSAAOLD  EQU   PSA+548                                                  03010000
PSAANEW  EQU   PSA+544                                                  03011000
PSATOLD  EQU   PSA+540                                                  03012000
PSATNEW  EQU   PSA+536                                                  03013000
PSALCCAR EQU   PSA+532                                                  03014000
PSALCCAV EQU   PSA+528                                                  03015000
PSAPCCAR EQU   PSA+524                                                  03016000
PSAPCCAV EQU   PSA+520                                                  03017000
PSACPULA EQU   PSA+518                                                  03018000
PSACPUPA EQU   PSA+516                                                  03019000
PSAPSA   EQU   PSA+512                                                  03020000
FLCHDEND EQU   PSA+512                                                  03021000
FLCCRSAV EQU   FLCMCLA+280                                              03022000
FLCGRSAV EQU   FLCMCLA+216                                              03023000
FLCFPSAV EQU   FLCMCLA+184                                              03024000
FLCFLA   EQU   FLCMCLA+88                                               03025000
FLCRGNCD EQU   FLCMCLA+84                                               03026000
FLCFSAA  EQU   FLCFSA+1                                                 03027000
@NM00071 EQU   FLCFSA                                                   03028000
@NM00070 EQU   FLCMCLA+72                                               03029000
FLCMCIC  EQU   FLCMCLA+64                                               03030000
@NM00069 EQU   FLCMCLA+20                                               03031000
FLCIOAA  EQU   FLCIOA+1                                                 03032000
@NM00068 EQU   FLCIOA                                                   03033000
@NM00067 EQU   FLCMCLA+15                                               03034000
@NM00066 EQU   FLCMCLA+14                                               03035000
@NM00065 EQU   FLCMCLA+12                                               03036000
FLCLCL   EQU   FLCMCLA+8                                                03037000
FLCIOELA EQU   FLCIOEL+1                                                03038000
@NM00064 EQU   FLCIOEL                                                  03039000
FLCCHNID EQU   FLCMCLA                                                  03040000
@NM00063 EQU   PSA+160                                                  03041000
FLCMTRCD EQU   PSA+157                                                  03042000
@NM00062 EQU   PSA+156                                                  03043000
FLCPERA  EQU   FLCPER+1                                                 03044000
@NM00061 EQU   FLCPER                                                   03045000
@NM00060 EQU   PSA+151                                                  03046000
FLCPERCD EQU   PSA+150                                                  03047000
FLCMCNUM EQU   PSA+149                                                  03048000
@NM00059 EQU   PSA+148                                                  03049000
FLCTEAA  EQU   FLCTEA+1                                                 03050000
@NM00058 EQU   FLCTEA                                                   03051000
PSAPIPC  EQU   PSAPICOD                                                 03052000
PSAPIMC  EQU   PSAPICOD                                                 03053000
PSAPIPER EQU   PSAPICOD                                                 03054000
PSARV049 EQU   FLCPICOD                                                 03055000
FLCPILCB EQU   FLCPIILC                                                 03056000
@NM00057 EQU   FLCPIILC                                                 03057000
@NM00056 EQU   PSAEPPSW                                                 03058000
FLCSVCN  EQU   PSAESPSW+2                                               03059000
FLCSILCB EQU   FLCSVILC                                                 03060000
@NM00055 EQU   FLCSVILC                                                 03061000
@NM00054 EQU   PSAESPSW                                                 03062000
FLCEICOD EQU   PSAEEPSW+2                                               03063000
PSASPAD  EQU   PSAEEPSW                                                 03064000
@NM00053 EQU   PSA+128                                                  03065000
FLCINPSW EQU   PSA+120                                                  03066000
FLCMNPSW EQU   PSA+112                                                  03067000
FLCPNPSW EQU   PSA+104                                                  03068000
FLCSNPSW EQU   PSA+96                                                   03069000
FLCENPSW EQU   PSA+88                                                   03070000
FLCTRACE EQU   PSA+84                                                   03071000
FLCTIMER EQU   PSA+80                                                   03072000
FLCCVT2  EQU   PSA+76                                                   03073000
FLCCAW   EQU   PSA+72                                                   03074000
FLCCSW   EQU   PSA+64                                                   03075000
FLCIOPSW EQU   PSA+56                                                   03076000
FLCMOPSW EQU   PSA+48                                                   03077000
FLCPOPSW EQU   PSA+40                                                   03078000
FLCSOPSW EQU   PSA+32                                                   03079000
FLCEOPSW EQU   PSA+24                                                   03080000
@NM00052 EQU   FLCICCW2+4                                               03081000
FLCCVT   EQU   FLCICCW2                                                 03082000
FLCICCW1 EQU   FLCROPSW                                                 03083000
FLCIPPSW EQU   FLCRNPSW                                                 03084000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03085000
@PB00004 EQU   @EL00001                                                 03086000
@ENDDATA EQU   *                                                        03087000
         END   IGG0CLA8,(C'PLS0424',0602,75012)                         03088000
