         TITLE 'IGG0325I - VIO ALLOCATION                              *00001000
                        '                                               00002000
IGG0325I CSECT ,                                                   0001 00003000
@PROLOG  BALR  @12,0                                               0001 00004000
@PSTART  DS    0H                                                  0001 00005000
         USING @PSTART,@12                                         0001 00006000
JSCBDISP EQU 188                                                        00007000
JSCBAOS1 EQU  72                                                        00008000
JSCBAOS2 EQU 192                                                        00009000
K2       EQU   2                        CONSTANT OF 2            YM1110 00010000
K4       EQU   4                        CONSTANT OF 4            YM1110 00011000
K32      EQU   32                       CONSTANT OF 32                  00012000
K38      EQU   38                       CONSTANT OF 38           YM1110 00013000
SCHEDKEY EQU   1                        PROTECT KEY OF SCHEDULER        00014000
HEXZERO  EQU   X'00'                    HEX CONSTANT OF 0               00015000
         USING ALLOCWKA,RALLOCWA        ALLOCATE WORK AREA              00016000
*   /*****************************************************************/ 00017000
*   /*                                                               */ 00018000
*   /* INITIALIZATION                                                */ 00019000
*   /*                                                               */ 00020000
*   /*****************************************************************/ 00021000
*   AVJFCB = DUMYJFCB;                  /*COPY JFCB                  */ 00022000
         MVC   AVJFCB(176),DUMYJFCB(JFCBPTR)                       0097 00023000
*   AVDEVTYP = DEVICTYP;                /*COPY DEVICE TYPE FIELD     */ 00024000
         MVC   AVDEVTYP(4),DEVICTYP(R7)                            0098 00025000
*   JFCBPTR = ADDR(AVJFCB);             /*USE WORK AREA JFCB         */ 00026000
         LA    JFCBPTR,AVJFCB                                      0099 00027000
*   GEN(MODESET EXTKEY=SCHED);          /*ASSUME KEY 1 TO CONTINUE   */ 00028000
         MODESET EXTKEY=SCHED                                           00029000
*   /*****************************************************************/ 00030000
*   /*                                                               */ 00031000
*   /*  BUILD VDSCB                                                  */ 00032000
*   /*                                                               */ 00033000
*   /*****************************************************************/ 00034000
*   /*                                                               */ 00035000
*   /* GET CORE FOR VIRTUAL DSCB                                     */ 00036000
*   /*                                                               */ 00037000
*   RESPECIFY R9 RESTRICTED;                                       0101 00038000
*   RESPECIFY JSCBACTP RESTRICTED;                                 0102 00039000
*   JSCBACTP = JSCBACT;                 /*GET ADDR OF ACTIVE JSCB    */ 00040000
         L     @08,CVTPTR                                          0103 00041000
         L     @08,CVTTCBP(,@08)                                   0103 00042000
         L     @08,TCBPTR(,@08)                                    0103 00043000
         L     @08,TCBJSCB(,@08)                                   0103 00044000
         L     JSCBACTP,JSCBACT(,@08)                              0103 00045000
*   RESPECIFY IEZJSCB BASED(JSCBACTP);                             0104 00046000
*   R9 = JSCBSWSP;                      /*GET SWA SUBPOOL NUMBER     */ 00047000
         SLR   R9,R9                                               0105 00048000
         IC    R9,JSCBSWSP(,JSCBACTP)                              0105 00049000
*   RESPECIFY JSCBACTP UNRESTRICTED;                               0106 00050000
*   RESPECIFY IEZJSCB BASED(TCBJSCB);                              0107 00051000
*   RESPECIFY R1 RESTRICTED;                                       0108 00052000
*   /*GET VDSCB CORE                                                 */ 00053000
*   R1 = LENGTH(VDSCB);                                            0109 00054000
         LA    R1,205                                              0109 00055000
*   GEN REFS (R1,R9,CVT);                                          0110 00056000
         IECRES GET,LV=(R1),SP=(R9),KEY=SCHEDKEY,PREFIX=NO,            X00057000
               STM=(R2,RF,IECREGSV+12)                                  00058000
*   DEVICTYP = R1;                      /*ADDRESS OF VDSCB           */ 00059000
         ST    R1,DEVICTYP(,R7)                                    0111 00060000
*   VDSCBPTR = R1;                      /*SET UP BASE FOR VDSCB      */ 00061000
         LR    VDSCBPTR,R1                                         0112 00062000
*   DSMADTW3 = VDSCBPTR;                /*SAVE POINTER TO VDSCB      */ 00063000
         ST    VDSCBPTR,DSMADTW3                                   0113 00064000
*   GEN(OI    DSMADTB1,DSMVIO);         /*SET VIO DATA SET SWITCH    */ 00065000
         OI    DSMADTB1,DSMVIO                                          00066000
*   RESPECIFY (R1,R9) UNRESTRICTED;                                0115 00067000
*   /*                                                               */ 00068000
*   /* GO TO ROUTINE TO BUILD THE VDSCB                              */ 00069000
*   /*                                                               */ 00070000
*   CALL BLDVDSCB;                                                 0116 00071000
         BAL   @14,BLDVDSCB                                        0116 00072000
*   /*****************************************************************/ 00073000
*   /*                                                               */ 00074000
*   /* MODULE TERMINATION                                            */ 00075000
*   /*                                                               */ 00076000
*   /*****************************************************************/ 00077000
*   RFY RETCODE RSTD;                                              0117 00078000
*   RETCODE = ECNORM;                   /*RETURN CODE EQUALS ZERO    */ 00079000
         SLR   RETCODE,RETCODE                                     0118 00080000
*   RFY RETCODE UNRSTD;                                            0119 00081000
*   GEN(MODESET EXTKEY=ZERO);           /*RETURN TO KEY 0      YM3171*/ 00082000
         MODESET EXTKEY=ZERO                                            00083000
*   IF JFCBDQTY ^= 0 THEN               /*IF PDS, GO TO IGG0CLF2     */ 00084000
         ICM   @06,7,JFCBDQTY(JFCBPTR)                             0121 00085000
         BZ    @RF00121                                            0121 00086000
*     DO;                                                          0122 00087000
*       GEN(ST    VDSCBPTR,DEB+K32);    /*PUT UCB ADDRESS IN DEB     */ 00088000
         ST    VDSCBPTR,DEB+K32                                         00089000
*       RESPECIFY (R1,R2,R8) RESTRICTED;                           0124 00090000
*       R1 = JFCBDQTY;                  /*PASS DIRECTORY QUANTITY    */ 00091000
         SLR   R1,R1                                               0125 00092000
         ICM   R1,7,JFCBDQTY(JFCBPTR)                              0125 00093000
*       R2 = AVDIRBT;                   /*PASS NO. DIR BLKS PER TRACK*/ 00094000
         LH    R2,AVDIRBT                                          0126 00095000
*                                       /*PASS D/S START CCHH  YM1110*/ 00096000
*       GEN(MVC   DEB+K38(K4),VDSDSCB+DS1EXT1+K2(VDSCBPTR)); /*YM1110*/ 00097000
         MVC   DEB+K38(K4),VDSDSCB+DS1EXT1+K2(VDSCBPTR)                 00098000
*       GEN(IECRES LOAD,EXTPR=(RALLOCWA),MODNM=AVCLF2,BRANCH=DIRECT)    00099000
*         REFS(CVT);                                               0128 00100000
         IECRES LOAD,EXTPR=(RALLOCWA),MODNM=AVCLF2,BRANCH=DIRECT        00101000
*     END;                                                         0129 00102000
*   RESPECIFY (R1,R2) UNRESTRICTED;                                0130 00103000
@RF00121 DS    0H                                                  0131 00104000
*   RFY RETCODE RSTD;                                              0131 00105000
*   R8 = RETCODE;                       /*SAVE RETURN CODE IN REG 8  */ 00106000
         LR    R8,RETCODE                                          0132 00107000
*   RFY RETCODE UNRSTD;                                            0133 00108000
*FREEDSCB:                                                         0134 00109000
*   IF R8 ^= 0 THEN                     /*IF ERROR RETURN, FREE VDSCB*/ 00110000
FREEDSCB LTR   R8,R8                                               0134 00111000
         BZ    @RF00134                                            0134 00112000
*     DO;                                                          0135 00113000
*       RFY R2 RSTD;                                               0136 00114000
*       R2 = LENGTH(VDSCB);                                  /*YM3952*/ 00115000
         LA    R2,205                                              0137 00116000
*   RESPECIFY IEZJSCB BASED(TCBJSCB);                              0138 00117000
*   RESPECIFY (R9,JSCBACTP) RESTRICTED;                            0139 00118000
*   JSCBACTP = JSCBACT;                                            0140 00119000
         L     @03,CVTPTR                                          0140 00120000
         L     @03,CVTTCBP(,@03)                                   0140 00121000
         L     @03,TCBPTR(,@03)                                    0140 00122000
         L     @03,TCBJSCB(,@03)                                   0140 00123000
         L     JSCBACTP,JSCBACT(,@03)                              0140 00124000
*   RESPECIFY IEZJSCB BASED(JSCBACTP);                             0141 00125000
*   R9 = JSCBSWSP;                                                 0142 00126000
         SLR   R9,R9                                               0142 00127000
         IC    R9,JSCBSWSP(,JSCBACTP)                              0142 00128000
*   GEN REFS(CVT,RA,R2);                                     /*YM3952*/ 00129000
         IECRES FREE,A=(RA),LV=(R2),PREFIX=NO,               /*YM3952*/*00130000
               STM=(2,14,IECREGSV+12),SP=(R9),KEY=SCHEDKEY   /*YM3952*/ 00131000
*   RESPECIFY (R2,R9,JSCBACTP) UNRESTRICTED;                       0144 00132000
*     END;                                                         0145 00133000
*   GEN(IECRES FREE,A=(RALLOCWA),PREFIX=FIRST)                     0146 00134000
*     REFS(CVT,RALLOCWA);                                          0146 00135000
@RF00134 DS    0H                                                  0146 00136000
         IECRES FREE,A=(RALLOCWA),PREFIX=FIRST                          00137000
*   RESPECIFY RETCODE RESTRICTED;                                  0147 00138000
*   RETCODE = R8;                       /*PUT RETURN CODE IN REG 15  */ 00139000
         LR    RETCODE,R8                                          0148 00140000
*   GEN(MODESET EXTKEY=ZERO);           /*RETURN TO KEY 0      YM3905*/ 00141000
         MODESET EXTKEY=ZERO                                            00142000
*   GO TO CALLER;                       /*RETURN TO CALLER OF ALLOCAT*/ 00143000
         L     @14,CVTPTR                                          0150 00144000
         L     @14,CVTEXPRO(,@14)                                  0150 00145000
         BR    @14                                                 0150 00146000
*   RESPECIFY (R8,RETCODE) UNRESTRICTED;                           0151 00147000
*   GEN(EJECT);                                                    0152 00148000
         EJECT                                                          00149000
*BLDVDSCB:                                                         0153 00150000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0153 00151000
         B     @PB00002                                            0153 00152000
BLDVDSCB DS    0H                                                  0154 00153000
*   /*****************************************************************/ 00154000
*   /*                                                               */ 00155000
*   /* ROUTINE TO BUILD VDSCB                                        */ 00156000
*   /*                                                               */ 00157000
*   /*****************************************************************/ 00158000
*   RFY RET RSTD;                                                  0154 00159000
*   SAV14B = RET;                       /*SAVE REGISTER 14           */ 00160000
         ST    RET,SAV14B                                          0155 00161000
*   RFY RET UNRSTD;                                                0156 00162000
*   /*                                                               */ 00163000
*   /* CALL ROUTINE TO BUILD VDSUCB                                  */ 00164000
*   /*                                                               */ 00165000
*   CALL BLDUCB;                                                   0157 00166000
         BAL   @14,BLDUCB                                          0157 00167000
*   /*                                                               */ 00168000
*   /* CALL ROUTINE TO BUILD VDSDSCB                                 */ 00169000
*   /*                                                               */ 00170000
*   CALL BLDDSCB;                                                  0158 00171000
         BAL   @14,BLDDSCB                                         0158 00172000
*   /*                                                               */ 00173000
*   /* ROUTINE TO BUILD VDSUCBEX (UCB EXTENSION)                     */ 00174000
*   /*                                                               */ 00175000
*   IF AVULABST = 0 THEN                /*CHECK IF USER LABEL TRACK  */ 00176000
         ICM   @06,3,AVULABST                                      0159 00177000
         BNZ   @RF00159                                            0159 00178000
*     DO;                               /*WAS ALLOCATED              */ 00179000
*       VDSABSTT = AVABSTRK;            /*FIRST ALLOCATED TRACK OF DS*/ 00180000
         MVC   VDSABSTT(2,VDSCBPTR),AVABSTRK                       0161 00181000
*       VDSNMTRK = AVNODSTK;            /*NUMBER OF TRACKS ALLOCATED */ 00182000
         MVC   VDSNMTRK(2,VDSCBPTR),AVNODSTK+2                     0162 00183000
*     END;                                                         0163 00184000
*   ELSE                                /*YES, USER LABEL TRK ALLOC  */ 00185000
*     DO;                                                          0164 00186000
         B     @RC00159                                            0164 00187000
@RF00159 DS    0H                                                  0165 00188000
*       VDSABSTT = AVULABST;            /*FIRST ALLOCATE TRACK OF DS */ 00189000
         MVC   VDSABSTT(2,VDSCBPTR),AVULABST                       0165 00190000
*       VDSNMTRK = AVNODSTK + 1;        /*NUMBER OF TRACKS ALLOCATED */ 00191000
         LA    @06,1                                               0166 00192000
         AL    @06,AVNODSTK                                        0166 00193000
         STH   @06,VDSNMTRK(,VDSCBPTR)                             0166 00194000
*     END;                                                         0167 00195000
*   RFY RET RSTD;                                                  0168 00196000
@RC00159 DS    0H                                                  0169 00197000
*   RET = SAV14B;                       /*RESTORE REGISTER 14        */ 00198000
         L     RET,SAV14B                                          0169 00199000
*   RFY RET UNRSTD;                                                0170 00200000
*   END BLDVDSCB;                                                  0171 00201000
@EL00002 DS    0H                                                  0171 00202000
@EF00002 DS    0H                                                  0171 00203000
@ER00002 BR    @14                                                 0171 00204000
@PB00002 DS    0H                                                  0172 00205000
*   GEN(EJECT);                                                    0172 00206000
         EJECT                                                          00207000
*BLDDSCB:                                                          0173 00208000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0173 00209000
         B     @PB00003                                            0173 00210000
BLDDSCB  DS    0H                                                  0174 00211000
*   /*****************************************************************/ 00212000
*   /*                                                               */ 00213000
*   /* ROUTINE TO BUILD VDSDSCB                                      */ 00214000
*   /*                                                               */ 00215000
*   /*****************************************************************/ 00216000
*   RFY RET RSTD;                                                  0174 00217000
*   SAV14C = RET;                       /*SAVE REGISTER 14           */ 00218000
         ST    RET,SAV14C                                          0175 00219000
*   RFY RET UNRSTD;                                                0176 00220000
*   /*                                                               */ 00221000
*   /* CALL ROUTINE TO DETERMINE STARTING CCHH                       */ 00222000
*   /*                                                               */ 00223000
*   CALL DETSCCHH;                                                 0177 00224000
         BAL   @14,DETSCCHH                                        0177 00225000
*   /*                                                               */ 00226000
*   /* CALL ROUTINE TO INITIALIZE DS1LSTAR AND DS1TRBAL FIELDS       */ 00227000
*   /*                                                               */ 00228000
*   CALL INITLSTR;                                                 0178 00229000
         BAL   @14,INITLSTR                                        0178 00230000
*   /*                                                               */ 00231000
*   /* CALL ROUTINE TO ALLOCATE TRACKS                               */ 00232000
*   /*                                                               */ 00233000
*   CALL ALLOCTRK;                                                 0179 00234000
         BAL   @14,ALLOCTRK                                        0179 00235000
*   /*****************************************************************/ 00236000
*   /*                                                               */ 00237000
*   /* VALIDITY CHECK SPACE REQUESTED                                */ 00238000
*   /*                                                               */ 00239000
*   /*****************************************************************/ 00240000
*   IF AVLSTAR ^= 0 THEN                /*IF PDS ALLOCATED     YM8310*/ 00241000
         LA    @06,80                                              0180 00242000
         ALR   @06,VDSCBPTR                                        0180 00243000
         ICM   @15,7,AVLSTAR(@06)                                  0180 00244000
         BZ    @RF00180                                            0180 00245000
*     IF AVTRKPRI < (AVLBPTRK + 1) THEN /*IF PDS DIRECTORY DOES NOT  */ 00246000
         LA    @15,1                                               0181 00247000
         AH    @15,AVLBPTRK(,@06)                                  0181 00248000
         C     @15,AVTRKPRI                                        0181 00249000
         BNH   @RF00181                                            0181 00250000
*       DO;                             /*FIT IN PRIMARY SPACE -ERROR*/ 00251000
*         RFY R8 RSTD;                                             0183 00252000
*         R8 = ECDIRPRI;                /*DIR SPACE > PRIMARY SPACE  */ 00253000
         LA    R8,128                                              0184 00254000
*         GO TO FREEDSCB;               /*GO PERFORM ERROR PROCESSING*/ 00255000
         B     FREEDSCB                                            0185 00256000
*       END;                                                       0186 00257000
*   AVVOLTRK = AVNUMCYL * AVNUMTRK - 1; /*TOTAL NO. TRACKS ON VOLUME */ 00258000
@RF00181 DS    0H                                                  0187 00259000
@RF00180 LH    @09,AVNUMCYL                                        0187 00260000
         MH    @09,AVNUMTRK                                        0187 00261000
         BCTR  @09,0                                               0187 00262000
         STH   @09,AVVOLTRK                                        0187 00263000
*   AVAVAILT = AVVOLTRK - AVABSTRK + 1; /*NO. OF AVAILABLE TRACKS    */ 00264000
         SH    @09,AVABSTRK                                        0188 00265000
         AH    @09,@CH00068                                        0188 00266000
         STH   @09,AVAVAILT                                        0188 00267000
*   IF AVTRKPRI > AVAVAILT THEN         /*IF NO. TRKS ALLOCATED TO DS*/ 00268000
         C     @09,AVTRKPRI                                        0189 00269000
         BNL   @RF00189                                            0189 00270000
*     DO;                               /*DOESN'T FIT ON VOLUME-ERROR*/ 00271000
*       R8 = ECNOSPAC;                  /*SPACE NOT AVAILABLE        */ 00272000
         LA    R8,20                                               0191 00273000
*       GO TO FREEDSCB;                 /*GO PERFORM ERROR PROCESSING*/ 00274000
         B     FREEDSCB                                            0192 00275000
*       RFY R8 UNRSTD;                                             0193 00276000
*     END;                                                         0194 00277000
*   IF AVNODSTK > AVAVAILT THEN         /*IF TOTAL DS SPACE > TOTAL  */ 00278000
@RF00189 LH    @06,AVAVAILT                                        0195 00279000
         C     @06,AVNODSTK                                        0195 00280000
         BNL   @RF00195                                            0195 00281000
*     AVNODSTK = AVAVAILT;              /*VOL SPACE, GIVE DS TOT VOL */ 00282000
         ST    @06,AVNODSTK                                        0196 00283000
*   /*                                                               */ 00284000
*   /* CALL ROUTINE TO ALLOCATE A USER LABEL TRACK                   */ 00285000
*   /*                                                               */ 00286000
*   CALL ALLOCULT;                                                 0197 00287000
@RF00195 BAL   @14,ALLOCULT                                        0197 00288000
*   /*****************************************************************/ 00289000
*   /*                                                               */ 00290000
*   /* BUILD USER LABEL AND DATA SET EXTENTS                         */ 00291000
*   /*                                                               */ 00292000
*   /*****************************************************************/ 00293000
*   RESPECIFY EXTPTR RESTRICTED;                                   0198 00294000
*   IF AVULABST ^= 0 THEN               /*IF USER LABEL TRK ALLOCATED*/ 00295000
         LH    @08,AVULABST                                        0199 00296000
         LTR   @08,@08                                             0199 00297000
         BZ    @RF00199                                            0199 00298000
*     DO;                               /*BUILD USER LABEL EXTENT    */ 00299000
*       EXTPTR = ADDR(DS1EXT1);         /*POINT TO FIRST EXTENT      */ 00300000
         LA    EXTPTR,DS1EXT1+80(,VDSCBPTR)                        0201 00301000
*       VDS1EXTD = VDS1ULAB;            /*INDICATE USER LABELS       */ 00302000
         MVI   VDS1EXTD(EXTPTR),B'01000000'                        0202 00303000
*       VDS1EXTN = VDS1HEX0;            /*SET EXTENT NUMBER TO 0     */ 00304000
         MVI   VDS1EXTN(EXTPTR),X'00'                              0203 00305000
*       VDS1STCC = AVULABST / AVNUMTRK; /*STARTING CYLINDER NUMBER   */ 00306000
         LH    @06,AVNUMTRK                                        0204 00307000
         LR    @00,@08                                             0204 00308000
         SRDA  @00,32                                              0204 00309000
         DR    @00,@06                                             0204 00310000
         STH   @01,VDS1STCC(,EXTPTR)                               0204 00311000
*       VDS1STHH = AVULABST // AVNUMTRK; /*STARTING HEAD NUMBER      */ 00312000
         LR    @02,@08                                             0205 00313000
         SRDA  @02,32                                              0205 00314000
         DR    @02,@06                                             0205 00315000
         STH   @02,VDS1STHH(,EXTPTR)                               0205 00316000
*       VDS1ECC = VDS1STCC;             /*ENDING CYL = STARTING CYL  */ 00317000
         STH   @01,VDS1ECC(,EXTPTR)                                0206 00318000
*       VDS1EHH = VDS1STHH;             /*ENDING HEAD = STARTING HEAD*/ 00319000
         STH   @02,VDS1EHH(,EXTPTR)                                0207 00320000
*     END;                                                         0208 00321000
*   IF AVNODSTK ^= 0 THEN               /*IF TRACKS WERE ALLOCATED   */ 00322000
@RF00199 ICM   @08,15,AVNODSTK                                     0209 00323000
         BZ    @RF00209                                            0209 00324000
*     CALL BLDDSEXT;                    /*GO BUILD DATA SET EXTENT   */ 00325000
         BAL   @14,BLDDSEXT                                        0210 00326000
*   ELSE                                /*NO TRACKS WERE ALLOCATED   */ 00327000
*     DS1NOEPV = 0;                     /*SET NO. EXTENTS TO 0       */ 00328000
         B     @RC00209                                            0211 00329000
@RF00209 MVI   DS1NOEPV+80(VDSCBPTR),X'00'                         0211 00330000
*   RESPECIFY EXTPTR UNRESTRICTED;                                 0212 00331000
@RC00209 DS    0H                                                  0213 00332000
*   /*                                                               */ 00333000
*   /* CALL ROUTINE TO PERFORM MERGE PROCESSING (JFCB TO DSCB)       */ 00334000
*   /*                                                               */ 00335000
*   CALL MRGJFCB;                                                  0213 00336000
         BAL   @14,MRGJFCB                                         0213 00337000
*   RFY RET RSTD;                                                  0214 00338000
*   RET = SAV14C;                       /*RESTORE REGISTER 14        */ 00339000
         L     RET,SAV14C                                          0215 00340000
*   RFY RET UNRSTD;                                                0216 00341000
*   END BLDDSCB;                                                   0217 00342000
@EL00003 DS    0H                                                  0217 00343000
@EF00003 DS    0H                                                  0217 00344000
@ER00003 BR    @14                                                 0217 00345000
@PB00003 DS    0H                                                  0218 00346000
*   GEN(EJECT);                                                    0218 00347000
         EJECT                                                          00348000
*DETSCCHH:                                                         0219 00349000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0219 00350000
         B     @PB00004                                            0219 00351000
DETSCCHH DS    0H                                                  0220 00352000
*   /*****************************************************************/ 00353000
*   /*                                                               */ 00354000
*   /* DETERMINE THE BEGINNING CCHH FOR FIRST EXTENT                 */ 00355000
*   /*                                                               */ 00356000
*   /*****************************************************************/ 00357000
*   RFY RET RSTD;                                                  0220 00358000
*   SAV14D = RET;                       /*SAVE REGISTER 14           */ 00359000
         ST    RET,SAV14D                                          0221 00360000
*   RFY RET UNRSTD;                                                0222 00361000
*   /*                                                               */ 00362000
*   /* CHECK FOR ABSOLUTE TRACK ALLOCATION                           */ 00363000
*   /*                                                               */ 00364000
*   IF JFCBSPAC = JFCABSTR THEN                                    0223 00365000
         TM    JFCBSPAC(JFCBPTR),B'11000000'                       0223 00366000
         BNZ   @RF00223                                            0223 00367000
*     DO;                                                          0224 00368000
*      AVCYLST = JFCBABST / AVNUMTRK;   /*STARTING CYLINDER NUMBER   */ 00369000
         LH    @06,AVNUMTRK                                        0225 00370000
         LH    @15,JFCBABST(,JFCBPTR)                              0225 00371000
         LR    @00,@15                                             0225 00372000
         SRDA  @00,32                                              0225 00373000
         DR    @00,@06                                             0225 00374000
         STH   @01,AVCYLST                                         0225 00375000
*      AVHEADST = JFCBABST // AVNUMTRK; /*STARTING HEAD NUMBER       */ 00376000
         LR    @00,@15                                             0226 00377000
         SRDA  @00,32                                              0226 00378000
         DR    @00,@06                                             0226 00379000
         STH   @00,AVHEADST                                        0226 00380000
*      AVABSTRK = JFCBABST;             /*ABSOLUTE TRACK NUMBER      */ 00381000
         STH   @15,AVABSTRK                                        0227 00382000
*     END;                                                         0228 00383000
*   ELSE                                                           0229 00384000
*     /*                                                             */ 00385000
*     /* CHECK FOR TRACK ALLOCATION                                  */ 00386000
*     /*                                                             */ 00387000
*     IF JFCBSPAC = JFCTRK THEN                                    0229 00388000
         B     @RC00223                                            0229 00389000
@RF00223 TM    JFCBSPAC(JFCBPTR),B'10000000'                       0229 00390000
         BNO   @RF00229                                            0229 00391000
         TM    JFCBSPAC(JFCBPTR),B'01000000'                       0229 00392000
         BNZ   @RF00229                                            0229 00393000
*       DO;                                                        0230 00394000
*         AVCYLST = 0;                  /*STARTING CYLINDER NUMBER   */ 00395000
         SLR   @06,@06                                             0231 00396000
         STH   @06,AVCYLST                                         0231 00397000
*         AVHEADST = 1;                 /*STARTING HEAD NUMBER       */ 00398000
         LA    @06,1                                               0232 00399000
         STH   @06,AVHEADST                                        0232 00400000
*         AVABSTRK = 1;                 /*ABSOLUTE TRACK NUMBER      */ 00401000
         STH   @06,AVABSTRK                                        0233 00402000
*       END;                                                       0234 00403000
*     ELSE                                                         0235 00404000
*       /*                                                           */ 00405000
*       /* CHECK FOR CYLINDER OR AVERAGE BLOCK LENGTH                */ 00406000
*       /* WITH ROUND ALLOCATION                                     */ 00407000
*       /*                                                           */ 00408000
*       IF JFCBSPAC = JFCCYLIN |                                   0235 00409000
*          (JFCBSPAC = JFCAVBL & JFCROUND = ON) THEN               0235 00410000
         B     @RC00229                                            0235 00411000
@RF00229 TM    JFCBSPAC(JFCBPTR),B'11000000'                       0235 00412000
         BO    @RT00235                                            0235 00413000
         TM    JFCBSPAC(JFCBPTR),B'01000000'                       0235 00414000
         BNO   @RF00235                                            0235 00415000
         TM    JFCBSPAC(JFCBPTR),B'10000000'                       0235 00416000
         BNZ   @RF00235                                            0235 00417000
         TM    JFCROUND(JFCBPTR),B'00000001'                       0235 00418000
         BNO   @RF00235                                            0235 00419000
@RT00235 DS    0H                                                  0236 00420000
*         DO;                                                      0236 00421000
*           AVCYLST = 1;                /*STARTING CYLINDER NUMBER   */ 00422000
         MVC   AVCYLST(2),@CH00068                                 0237 00423000
*           AVHEADST = 0;               /*STARTING HEAD NUMBER       */ 00424000
         SLR   @06,@06                                             0238 00425000
         STH   @06,AVHEADST                                        0238 00426000
*           AVABSTRK = AVNUMTRK;        /*ABSOLUTE TRACK NUMBER      */ 00427000
         MVC   AVABSTRK(2),AVNUMTRK                                0239 00428000
*         END;                                                     0240 00429000
*       ELSE                                                       0241 00430000
*         /*                                                         */ 00431000
*         /* AVERAGE BLOCK LENGTH ALLOCATION                         */ 00432000
*         /*                                                         */ 00433000
*         DO;                                                      0241 00434000
         B     @RC00235                                            0241 00435000
@RF00235 DS    0H                                                  0242 00436000
*           AVCYLST = 0;                /*STARTING CYLINDER NUMBER   */ 00437000
         SLR   @06,@06                                             0242 00438000
         STH   @06,AVCYLST                                         0242 00439000
*           AVHEADST = 1;               /*STARTING HEAD NUMBER       */ 00440000
         LA    @06,1                                               0243 00441000
         STH   @06,AVHEADST                                        0243 00442000
*           AVABSTRK = 1;               /*ABSOLUTE TRACK NUMBER      */ 00443000
         STH   @06,AVABSTRK                                        0244 00444000
*         END;                                                     0245 00445000
*   RFY RET RSTD;                                                  0246 00446000
@RC00235 DS    0H                                                  0246 00447000
@RC00229 DS    0H                                                  0246 00448000
@RC00223 DS    0H                                                  0247 00449000
*   RET = SAV14D;                       /*RESTORE REGISTER 14        */ 00450000
         L     RET,SAV14D                                          0247 00451000
*   RFY RET UNRSTD;                                                0248 00452000
*   END DETSCCHH;                                                  0249 00453000
@EL00004 DS    0H                                                  0249 00454000
@EF00004 DS    0H                                                  0249 00455000
@ER00004 BR    @14                                                 0249 00456000
@PB00004 DS    0H                                                  0250 00457000
*   GEN(EJECT);                                                    0250 00458000
         EJECT                                                          00459000
*INITLSTR:                                                         0251 00460000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0251 00461000
         B     @PB00005                                            0251 00462000
INITLSTR DS    0H                                                  0252 00463000
*   /*****************************************************************/ 00464000
*   /*                                                               */ 00465000
*   /* INITIALIZE DS1LSTAR AND DS1TRBAL FIELDS IN THE VDSDSCB        */ 00466000
*   /*                                                               */ 00467000
*   /*****************************************************************/ 00468000
*   RFY RET RSTD;                                                  0252 00469000
*   SAV14D = RET;                       /*SAVE REGISTER 14           */ 00470000
         ST    RET,SAV14D                                          0253 00471000
*   RFY RET UNRSTD;                                                0254 00472000
*   IF JFCBDQTY ^= 0 THEN               /*CHECK FOR PARTITION DATASET*/ 00473000
         ICM   @06,7,JFCBDQTY(JFCBPTR)                             0255 00474000
         BZ    @RF00255                                            0255 00475000
*     DO;                                                          0256 00476000
*     /*                                                             */ 00477000
*     /* PROCESS FOR PARTITIONED DATA SET                            */ 00478000
*     /*                                                             */ 00479000
*       IF (JFCSUL = ON & JFCSL = ON) THEN /*CHECK FOR USER LABELS   */ 00480000
         TM    JFCSUL(JFCBPTR),B'00001010'                         0257 00481000
         BNO   @RF00257                                            0257 00482000
*         DO;                           /*YES, ERROR                 */ 00483000
*           RFY R8 RSTD;                                           0259 00484000
*           R8 = ECUSLAB;               /*INVALID USER LAB REQUEST   */ 00485000
         LA    R8,64                                               0260 00486000
*           GO TO FREEDSCB;             /*GO PERFORM ERROR PROCESSING*/ 00487000
         B     FREEDSCB                                            0261 00488000
*           RFY R8 UNRSTD;                                         0262 00489000
*         END;                                                     0263 00490000
*       /*                                                           */ 00491000
*       /* DETERMINE SIZE OF DIRECTORY AND INITIALIZE                */ 00492000
*       /* THE DS1LSTAR AND DS1TRBAL FIELDS IN VDSDSCB               */ 00493000
*       /*                                                           */ 00494000
*       AVLDBBYT = AVLRCDO + 264;       /*NO. BYTES - LAST DIR BLOCK */ 00495000
@RF00257 LA    @06,264                                             0264 00496000
         AH    @06,AVLRCDO                                         0264 00497000
         STH   @06,AVLDBBYT                                        0264 00498000
*       AVDBBYTS = (AVTOLER / 2);  /*NO. BYTES FOR NOT LAST @ZA17523 */ 00499000
         LH    @15,AVTOLER                                         0265 00500000
         LR    @00,@15                                             0265 00501000
         SRDA  @00,32                                              0265 00502000
         D     @00,@CF00111                                        0265 00503000
         STH   @01,AVDBBYTS                                        0265 00504000
*       AVDBBYTS = (AVTOLER / 64) + AVDBBYTS; /*DIR BLOCK   @ZA17523 */ 00505000
         LR    @02,@15                                             0266 00506000
         SRDA  @02,32                                              0266 00507000
         D     @02,@CF00842                                        0266 00508000
         ALR   @03,@01                                             0266 00509000
         STH   @03,AVDBBYTS                                        0266 00510000
*       AVDBBYTS = AVDBBYTS + AVIRCDO;        /*            @ZA17523 */ 00511000
         LH    @02,AVIRCDO                                         0267 00512000
         ALR   @03,@02                                             0267 00513000
         STH   @03,AVDBBYTS                                        0267 00514000
*       AVDIRBT = (AVTRKCAP - AVLDBBYT) / /*NUMBER OF DIRECTORY      */ 00515000
*                 AVDBBYTS + 1;         /*BLOCKS PER TRACK           */ 00516000
         LH    @15,AVTRKCAP(,VDSCBPTR)                             0268 00517000
         LR    @00,@06                                             0268 00518000
         LCR   @00,@00                                             0268 00519000
         ALR   @00,@15                                             0268 00520000
         SRDA  @00,32                                              0268 00521000
         DR    @00,@03                                             0268 00522000
         AH    @01,@CH00068                                        0268 00523000
         STH   @01,AVDIRBT                                         0268 00524000
*       AVFULTRK = JFCBDQTY / AVDIRBT;  /*NO. TRACKS NEEDED FOR DIR  */ 00525000
         SLR   @06,@06                                             0269 00526000
         ICM   @06,7,JFCBDQTY(JFCBPTR)                             0269 00527000
         LR    @05,@06                                             0269 00528000
         SLR   @04,@04                                             0269 00529000
         DR    @04,@01                                             0269 00530000
         ST    @05,AVFULTRK                                        0269 00531000
*       AVDIRNF = JFCBDQTY // AVDIRBT;  /*DIR BLOCKS NOT FIT ON TRKS */ 00532000
         LR    @08,@06                                             0270 00533000
         SRDA  @08,32                                              0270 00534000
         DR    @08,@01                                             0270 00535000
         STH   @08,AVDIRNF                                         0270 00536000
*       IF AVDIRNF = 0 THEN             /*IF ALL DIRECTORY BLOCKS    */ 00537000
         LTR   @08,@08                                             0271 00538000
         BNZ   @RF00271                                            0271 00539000
*         DO;                           /*FIT ON FULL TRACKS         */ 00540000
*           AVLBPTRK = AVFULTRK;        /*LAST BLK PTR TRACK NUMBER  */ 00541000
         LA    @06,80                                              0273 00542000
         ALR   @06,VDSCBPTR                                        0273 00543000
         STH   @05,AVLBPTRK(,@06)                                  0273 00544000
*           AVLBPRCD = 1;               /*LAST BLK PTR RECORD NUMBER */ 00545000
         MVI   AVLBPRCD(@06),X'01'                                 0274 00546000
*           DS1TRBAL = AVTRKCAP - (AVIRCDO - AVKEYCON); /*TRK BALANCE*/ 00547000
         SLR   @03,@03                                             0275 00548000
         IC    @03,AVKEYCON                                        0275 00549000
         SLR   @02,@03                                             0275 00550000
         SLR   @15,@02                                             0275 00551000
         STH   @15,DS1TRBAL(,@06)                                  0275 00552000
*         END;                                                     0276 00553000
*       ELSE                            /*DIRECTORY BLOCKS DO NOT    */ 00554000
*         DO;                           /*FIT ON FULL TRACKS         */ 00555000
         B     @RC00271                                            0277 00556000
@RF00271 DS    0H                                                  0278 00557000
*           AVLBPTRK = AVFULTRK;        /*LAST BLOCK PTR TRACK NO.   */ 00558000
         LA    @06,80                                              0278 00559000
         ALR   @06,VDSCBPTR                                        0278 00560000
         MVC   AVLBPTRK(2,@06),AVFULTRK+2                          0278 00561000
*           AVLBPRCD = AVDIRNF + 1;     /*LAST BLK PTR RECORD NUMBER */ 00562000
         LH    @15,AVDIRNF                                         0279 00563000
         LA    @14,1                                               0279 00564000
         ALR   @14,@15                                             0279 00565000
         STC   @14,AVLBPRCD(,@06)                                  0279 00566000
*           DS1TRBAL = AVTRKCAP - (AVDIRNF * AVDBBYTS +  /*TRACK BAL */ 00567000
*                      AVIRCDO - AVKEYCON);                        0280 00568000
         MH    @15,AVDBBYTS                                        0280 00569000
         AH    @15,AVIRCDO                                         0280 00570000
         SLR   @14,@14                                             0280 00571000
         IC    @14,AVKEYCON                                        0280 00572000
         SLR   @15,@14                                             0280 00573000
         LCR   @15,@15                                             0280 00574000
         AH    @15,AVTRKCAP(,VDSCBPTR)                             0280 00575000
         STH   @15,DS1TRBAL(,@06)                                  0280 00576000
*         END;                                                     0281 00577000
*     END;                                                         0282 00578000
*   ELSE                                /*NO, NOT A PARTITION DATASET*/ 00579000
*     DS1TRBAL = AVTRKCAP;              /*THEN, TRACK BAL = TRK CAPAC*/ 00580000
         B     @RC00255                                            0283 00581000
@RF00255 MVC   DS1TRBAL+80(2,VDSCBPTR),AVTRKCAP(VDSCBPTR)          0283 00582000
*   RFY RET RSTD;                                                  0284 00583000
@RC00255 DS    0H                                                  0285 00584000
*   RET = SAV14D;                       /*RESTORE REGISTER 14        */ 00585000
         L     RET,SAV14D                                          0285 00586000
*   RFY RET UNRSTD;                                                0286 00587000
*   END INITLSTR;                                                  0287 00588000
@EL00005 DS    0H                                                  0287 00589000
@EF00005 DS    0H                                                  0287 00590000
@ER00005 BR    @14                                                 0287 00591000
@PB00005 DS    0H                                                  0288 00592000
*   GEN(EJECT);                                                    0288 00593000
         EJECT                                                          00594000
*ALLOCTRK:                                                         0289 00595000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0289 00596000
         B     @PB00006                                            0289 00597000
ALLOCTRK DS    0H                                                  0290 00598000
*   /*****************************************************************/ 00599000
*   /*                                                               */ 00600000
*   /* DETERMINE NUMBER OF TRACKS IN DATA SET AND                    */ 00601000
*   /* NUMBER OF PRIMARY TRACKS REQUESTED                            */ 00602000
*   /*                                                               */ 00603000
*   /*****************************************************************/ 00604000
*   RFY RET RSTD;                                                  0290 00605000
*   SAV14D = RET;                       /*SAVE REGISTER 14           */ 00606000
         ST    RET,SAV14D                                          0291 00607000
*   RFY RET UNRSTD;                                                0292 00608000
*   IF JFCBSPAC = JFCABSTR THEN         /*PROCESS FOR ABSOLUTE TRACK */ 00609000
         TM    JFCBSPAC(JFCBPTR),B'11000000'                       0293 00610000
         BNZ   @RF00293                                            0293 00611000
*     DO;                                                          0294 00612000
*       AVTRKPRI = JFCBPQTY;            /*GET NO. PRIMARY TRACKS     */ 00613000
         SLR   @06,@06                                             0295 00614000
         ICM   @06,7,JFCBPQTY(JFCBPTR)                             0295 00615000
         ST    @06,AVTRKPRI                                        0295 00616000
*       AVNODSTK = JFCBPQTY;            /*GET NO. DATA SET TRACKS    */ 00617000
         ST    @06,AVNODSTK                                        0296 00618000
*       IF AVTRKPRI = 0 THEN            /*IF NO. PRIMARY TRKS = 0 AND*/ 00619000
         SLR   @15,@15                                             0297 00620000
         CR    @06,@15                                             0297 00621000
         BNE   @RF00297                                            0297 00622000
*         DO;                                                      0298 00623000
*           RFY R8 RSTD;                                           0299 00624000
*           IF AVABSTRK = 0 THEN        /*FIRST ALLOCATED TRACK = 0  */ 00625000
         CH    @15,AVABSTRK                                        0300 00626000
         BNE   @RF00300                                            0300 00627000
*             R8 = ECSPCPRM;            /*NO SPACE PARM SPECIFIED    */ 00628000
         LA    R8,76                                               0301 00629000
*           ELSE                                                   0302 00630000
*             R8 = ECPRI0;              /*PRIMARY REQUEST = 0        */ 00631000
         B     @RC00300                                            0302 00632000
@RF00300 LA    R8,108                                              0302 00633000
*           GO TO FREEDSCB;             /*GO PERFORM ERROR PROCESSING*/ 00634000
         B     FREEDSCB                                            0303 00635000
*           RFY R8 UNRSTD;                                         0304 00636000
*         END;                                                     0305 00637000
*       ELSE                            /*NO. PRIMARY TRKS ^= 0 AND  */ 00638000
*         IF AVABSTRK = 0 THEN          /*FIRST TRACK ALLOCATED = 0  */ 00639000
@RF00297 ICM   @06,3,AVABSTRK                                      0306 00640000
         BNZ   @RF00306                                            0306 00641000
*           DO;                                                    0307 00642000
*             RFY R8 RSTD;                                         0308 00643000
*             R8 = ECABTKNA;            /*ABSOLUTE TRK NOT AVAILABLE */ 00644000
         LA    R8,16                                               0309 00645000
*             GO TO FREEDSCB;           /*GO PERFORM ERROR PROCESSING*/ 00646000
         B     FREEDSCB                                            0310 00647000
*             RFY R8 UNRSTD;                                       0311 00648000
*           END;                                                   0312 00649000
*     END;                                                         0313 00650000
*   ELSE                                                           0314 00651000
*     IF JFCBSPAC = JFCCYLIN THEN       /*PROCESS FOR CYL ALLOCATION */ 00652000
         B     @RC00293                                            0314 00653000
@RF00293 TM    JFCBSPAC(JFCBPTR),B'11000000'                       0314 00654000
         BNO   @RF00314                                            0314 00655000
*       DO;                                                        0315 00656000
*         AVTRKPRI = JFCBPQTY * AVNUMTRK; /*NO. PRIMARY TRACKS       */ 00657000
         LH    @06,AVNUMTRK                                        0316 00658000
         SLR   @01,@01                                             0316 00659000
         ICM   @01,7,JFCBPQTY(JFCBPTR)                             0316 00660000
         MR    @00,@06                                             0316 00661000
         ST    @01,AVTRKPRI                                        0316 00662000
*         IF JFCMIXG = ON | JFCALX = ON THEN /*IF MXIG OR ALX SPEC   */ 00663000
         TM    JFCMIXG(JFCBPTR),B'00000110'                        0317 00664000
         BZ    @RF00317                                            0317 00665000
*           AVNODSTK = (AVNUMCYL - 1) * AVNUMTRK; /*YES, NO. DS TRKS */ 00666000
         LH    @01,AVNUMCYL                                        0318 00667000
         BCTR  @01,0                                               0318 00668000
         MR    @00,@06                                             0318 00669000
         ST    @01,AVNODSTK                                        0318 00670000
*         ELSE                                                     0319 00671000
*           AVNODSTK = (JFCBPQTY + 15 * JFCBSQTY) /*NO,NO.DS TRKS    */ 00672000
*                      * AVNUMTRK;                                 0319 00673000
         B     @RC00317                                            0319 00674000
@RF00317 SLR   @06,@06                                             0319 00675000
         ICM   @06,7,JFCBSQTY(JFCBPTR)                             0319 00676000
         MH    @06,@CH00072                                        0319 00677000
         LR    @01,@06                                             0319 00678000
         SLR   @06,@06                                             0319 00679000
         ICM   @06,7,JFCBPQTY(JFCBPTR)                             0319 00680000
         ALR   @01,@06                                             0319 00681000
         MH    @01,AVNUMTRK                                        0319 00682000
         ST    @01,AVNODSTK                                        0319 00683000
*       END;                                                       0320 00684000
*     ELSE                                                         0321 00685000
*       IF JFCBSPAC = JFCTRK THEN       /*PROCESS FOR TRK ALLOCATION */ 00686000
         B     @RC00314                                            0321 00687000
@RF00314 TM    JFCBSPAC(JFCBPTR),B'10000000'                       0321 00688000
         BNO   @RF00321                                            0321 00689000
         TM    JFCBSPAC(JFCBPTR),B'01000000'                       0321 00690000
         BNZ   @RF00321                                            0321 00691000
*         DO;                                                      0322 00692000
*           AVTRKPRI = JFCBPQTY;        /*NO. PRIMARY TRACKS         */ 00693000
         SLR   @06,@06                                             0323 00694000
         ICM   @06,7,JFCBPQTY(JFCBPTR)                             0323 00695000
         ST    @06,AVTRKPRI                                        0323 00696000
*           IF JFCMIXG = ON | JFCALX = ON THEN /*IF MXIG OR ALX SPEC */ 00697000
         TM    JFCMIXG(JFCBPTR),B'00000110'                        0324 00698000
         BZ    @RF00324                                            0324 00699000
*             AVNODSTK = AVNUMCYL * AVNUMTRK - 1; /*YES,NO. DS TRKS  */ 00700000
         LH    @06,AVNUMCYL                                        0325 00701000
         MH    @06,AVNUMTRK                                        0325 00702000
         BCTR  @06,0                                               0325 00703000
         ST    @06,AVNODSTK                                        0325 00704000
*           ELSE                                                   0326 00705000
*             AVNODSTK = JFCBPQTY + 15 * JFCBSQTY; /*NO, NO. DS TRKS */ 00706000
         B     @RC00324                                            0326 00707000
@RF00324 SLR   @06,@06                                             0326 00708000
         ICM   @06,7,JFCBSQTY(JFCBPTR)                             0326 00709000
         MH    @06,@CH00072                                        0326 00710000
         SLR   @15,@15                                             0326 00711000
         ICM   @15,7,JFCBPQTY(JFCBPTR)                             0326 00712000
         ALR   @06,@15                                             0326 00713000
         ST    @06,AVNODSTK                                        0326 00714000
*         END;                                                     0327 00715000
*       ELSE                                                       0328 00716000
*         DO;                           /*PROCESS AVG BLOCK LENGTH   */ 00717000
         B     @RC00321                                            0328 00718000
@RF00321 DS    0H                                                  0329 00719000
*           IF JFCKEYLE ^= 0 THEN       /*IF KEY LENGTH SPECIFIED    */ 00720000
         CLI   JFCKEYLE(JFCBPTR),0                                 0329 00721000
         BE    @RF00329                                            0329 00722000
*             AVABLLRB = JFCBDRLH + AVLRCDO /*YES, NO. BYTES FOR     */ 00723000
*                        + JFCKEYLE;    /*ABL LAST RECORD            */ 00724000
         SLR   @06,@06                                             0330 00725000
         ICM   @06,7,JFCBDRLH(JFCBPTR)                             0330 00726000
         AH    @06,AVLRCDO                                         0330 00727000
         SLR   @15,@15                                             0330 00728000
         IC    @15,JFCKEYLE(,JFCBPTR)                              0330 00729000
         ALR   @06,@15                                             0330 00730000
         ST    @06,AVABLLRB                                        0330 00731000
*           ELSE                                                   0331 00732000
*             AVABLLRB = JFCBDRLH + AVLRCDO /*NO, NO. BYTES FOR ABL  */ 00733000
*                        - AVKEYCON;    /*LAST RECORD                */ 00734000
         B     @RC00329                                            0331 00735000
@RF00329 SLR   @06,@06                                             0331 00736000
         ICM   @06,7,JFCBDRLH(JFCBPTR)                             0331 00737000
         AH    @06,AVLRCDO                                         0331 00738000
         SLR   @15,@15                                             0331 00739000
         IC    @15,AVKEYCON                                        0331 00740000
         SLR   @06,@15                                             0331 00741000
         ST    @06,AVABLLRB                                        0331 00742000
*           IF AVABLLRB <= AVTRKCAP THEN /*IF ABL LAST RCD <= TRK CAP*/ 00743000
@RC00329 L     @06,AVABLLRB                                        0332 00744000
         CH    @06,AVTRKCAP(,VDSCBPTR)                             0332 00745000
         BH    @RF00332                                            0332 00746000
*             DO;                       /*CALC BYTES ABL NON LAST RCD*/ 00747000
*               AVABLRB = ((JFCBDRLH * AVTOLER) / 512) + AVIRCDO; /*    00748000
*                                       NOT-LAST CALCULATION   YM7888*/ 00749000
         LH    @01,AVTOLER                                         0334 00750000
         SLR   @06,@06                                             0334 00751000
         ICM   @06,7,JFCBDRLH(JFCBPTR)                             0334 00752000
         MR    @00,@06                                             0334 00753000
         D     @00,@CF01660                                        0334 00754000
         AH    @01,AVIRCDO                                         0334 00755000
         ST    @01,AVABLRB                                         0334 00756000
*               IF JFCKEYLE = 0 THEN    /*CHECK FOR KEY SPEC         */ 00757000
         CLI   JFCKEYLE(JFCBPTR),0                                 0335 00758000
         BNE   @RF00335                                            0335 00759000
*                 AVABLRB = AVABLRB - AVKEYCON; /*NO, SUBTRACT KEYCON*/ 00760000
         SLR   @06,@06                                             0336 00761000
         IC    @06,AVKEYCON                                        0336 00762000
         SLR   @01,@06                                             0336 00763000
         ST    @01,AVABLRB                                         0336 00764000
*               ELSE                                               0337 00765000
*                 AVABLRB = AVABLRB + ((JFCKEYLE * AVTOLER) / 512); /*  00766000
*                                       RECORDS/TRACK          YM7888*/ 00767000
         B     @RC00335                                            0337 00768000
@RF00335 LH    @01,AVTOLER                                         0337 00769000
         SLR   @06,@06                                             0337 00770000
         IC    @06,JFCKEYLE(,JFCBPTR)                              0337 00771000
         MR    @00,@06                                             0337 00772000
         D     @00,@CF01660                                        0337 00773000
         AL    @01,AVABLRB                                         0337 00774000
         ST    @01,AVABLRB                                         0337 00775000
*               AVABLRTK = (AVTRKCAP - AVABLLRB) / /*CALC RCDS / TRK */ 00776000
*                          AVABLRB + 1;                            0338 00777000
@RC00335 LH    @06,AVTRKCAP(,VDSCBPTR)                             0338 00778000
         LR    @00,@06                                             0338 00779000
         SL    @00,AVABLLRB                                        0338 00780000
         SRDA  @00,32                                              0338 00781000
         D     @00,AVABLRB                                         0338 00782000
         AH    @01,@CH00068                                        0338 00783000
         ST    @01,AVABLRTK                                        0338 00784000
*               AVABLPRT = JFCBPQTY / AVABLRTK; /*CALC PRI TRKS      */ 00785000
         SLR   @15,@15                                             0339 00786000
         ICM   @15,7,JFCBPQTY(JFCBPTR)                             0339 00787000
         LR    @03,@15                                             0339 00788000
         SLR   @02,@02                                             0339 00789000
         DR    @02,@01                                             0339 00790000
         ST    @03,AVABLPRT                                        0339 00791000
*               AVBLKSNF = JFCBPQTY // AVABLRTK; /*CALC BLKS NOT FIT */ 00792000
         LR    @04,@15                                             0340 00793000
         SRDA  @04,32                                              0340 00794000
         DR    @04,@01                                             0340 00795000
         STH   @04,AVBLKSNF                                        0340 00796000
*               IF AVBLKSNF = 0 THEN    /*CHECK IF ALL BLOCKS FIT    */ 00797000
         LTR   @04,@04                                             0341 00798000
         BNZ   @RF00341                                            0341 00799000
*                 IF AVLBPTRB = AVTRKCAP THEN /*YES, CHK IF DIRECTRY */ 00800000
         CH    @06,AVLBPTRB+80(,VDSCBPTR)                          0342 00801000
         BNE   @RF00342                                            0342 00802000
*                   AVTRKPRI = AVABLPRT; /*NO, CALC NO. PRIMARY TRKS */ 00803000
         ST    @03,AVTRKPRI                                        0343 00804000
*                 ELSE                  /*YES, PRI SPACE IS ADDED TO */ 00805000
*                   AVTRKPRI = AVABLPRT + AVLBPTRK + 1; /*DIRECT SPAC*/ 00806000
         B     @RC00342                                            0344 00807000
@RF00342 LH    @06,AVLBPTRK+80(,VDSCBPTR)                          0344 00808000
         AL    @06,AVABLPRT                                        0344 00809000
         AH    @06,@CH00068                                        0344 00810000
         ST    @06,AVTRKPRI                                        0344 00811000
*               ELSE                    /*NO, ALL BLOCKS DON'T FIT   */ 00812000
*                 IF AVLBPTRB = AVTRKCAP THEN /*CHECK FOR DIRECTRY   */ 00813000
         B     @RC00341                                            0345 00814000
@RF00341 CLC   AVLBPTRB+80(2,VDSCBPTR),AVTRKCAP(VDSCBPTR)          0345 00815000
         BNE   @RF00345                                            0345 00816000
*                   AVTRKPRI = AVABLPRT + 1; /*NO,CALC PRI TRKS      */ 00817000
         LA    @06,1                                               0346 00818000
         AL    @06,AVABLPRT                                        0346 00819000
         ST    @06,AVTRKPRI                                        0346 00820000
*                 ELSE                                             0347 00821000
*                   DO;                 /*YES, CALC RESIDUAL BYTES   */ 00822000
         B     @RC00345                                            0347 00823000
@RF00345 DS    0H                                                  0348 00824000
*                     AVNLBYTS = (AVBLKSNF - 1) *  /*FOR BLKS NOT FIT*/ 00825000
*                                AVABLRB + AVABLLRB; /*TING ON FULTRK*/ 00826000
         LH    @01,AVBLKSNF                                        0348 00827000
         BCTR  @01,0                                               0348 00828000
         M     @00,AVABLRB                                         0348 00829000
         AL    @01,AVABLLRB                                        0348 00830000
         ST    @01,AVNLBYTS                                        0348 00831000
*                     IF AVNLBYTS <= AVLBPTRB THEN /*CALC NO. PRI TRK*/ 00832000
         LA    @06,80                                              0349 00833000
         ALR   @06,VDSCBPTR                                        0349 00834000
         CH    @01,AVLBPTRB(,@06)                                  0349 00835000
         BH    @RF00349                                            0349 00836000
*                       AVTRKPRI = AVABLPRT + AVLBPTRK + 1;        0350 00837000
         LH    @06,AVLBPTRK(,@06)                                  0350 00838000
         AL    @06,AVABLPRT                                        0350 00839000
         AH    @06,@CH00068                                        0350 00840000
         ST    @06,AVTRKPRI                                        0350 00841000
*                     ELSE                                         0351 00842000
*                       AVTRKPRI = AVABLPRT + AVLBPTRK + 2;        0351 00843000
         B     @RC00349                                            0351 00844000
@RF00349 LH    @06,AVLBPTRK+80(,VDSCBPTR)                          0351 00845000
         AL    @06,AVABLPRT                                        0351 00846000
         AL    @06,@CF00111                                        0351 00847000
         ST    @06,AVTRKPRI                                        0351 00848000
*                   END;                                           0352 00849000
@RC00349 DS    0H                                                  0353 00850000
*               IF JFCMIXG = ON | JFCALX = ON THEN /*IF ALX OR MIXG  */ 00851000
@RC00345 DS    0H                                                  0353 00852000
@RC00341 TM    JFCMIXG(JFCBPTR),B'00000110'                        0353 00853000
         BZ    @RF00353                                            0353 00854000
*                 IF JFCROUND = ON THEN /*SPEC, AND ROUND THEN       */ 00855000
         TM    JFCROUND(JFCBPTR),B'00000001'                       0354 00856000
         BNO   @RF00354                                            0354 00857000
*                   AVNODSTK = (AVNUMCYL - 1) * AVNUMTRK; /*NO. TRKS */ 00858000
         LH    @01,AVNUMCYL                                        0355 00859000
         BCTR  @01,0                                               0355 00860000
         MH    @01,AVNUMTRK                                        0355 00861000
         ST    @01,AVNODSTK                                        0355 00862000
*                 ELSE                  /*ROUND NOT SPECIFIED        */ 00863000
*                   AVNODSTK = AVNUMCYL * AVNUMTRK - 1; /*NO. TRACKS */ 00864000
         B     @RC00354                                            0356 00865000
@RF00354 LH    @06,AVNUMCYL                                        0356 00866000
         MH    @06,AVNUMTRK                                        0356 00867000
         BCTR  @06,0                                               0356 00868000
         ST    @06,AVNODSTK                                        0356 00869000
*               ELSE                    /*ALX OR MIXG NOT SPECIFIED  */ 00870000
*                 DO;                                              0357 00871000
         B     @RC00353                                            0357 00872000
@RF00353 DS    0H                                                  0358 00873000
*                   IF JFCROUND = ON THEN /*CHK FOR ROUND SPECIFIED  */ 00874000
         TM    JFCROUND(JFCBPTR),B'00000001'                       0358 00875000
         BNO   @RF00358                                            0358 00876000
*                     IF (AVTRKPRI // AVNUMTRK) ^= 0 THEN /*YES,ROUND*/ 00877000
         L     @06,AVTRKPRI                                        0359 00878000
         LH    @15,AVNUMTRK                                        0359 00879000
         LR    @00,@06                                             0359 00880000
         SRDA  @00,32                                              0359 00881000
         DR    @00,@15                                             0359 00882000
         LTR   @00,@00                                             0359 00883000
         BZ    @RF00359                                            0359 00884000
*                       AVTRKPRI = AVTRKPRI + (AVNUMTRK - /*UP TO NXT*/ 00885000
*                                  (AVTRKPRI // AVNUMTRK)); /*CYLIN  */ 00886000
         LR    @00,@06                                             0360 00887000
         SRDA  @00,32                                              0360 00888000
         DR    @00,@15                                             0360 00889000
         SLR   @15,@00                                             0360 00890000
         ALR   @06,@15                                             0360 00891000
         ST    @06,AVTRKPRI                                        0360 00892000
*                   IF JFCBSQTY = 0 THEN /*CHECK FOR SECONDARY SPACE */ 00893000
@RF00359 DS    0H                                                  0361 00894000
@RF00358 ICM   @06,7,JFCBSQTY(JFCBPTR)                             0361 00895000
         BNZ   @RF00361                                            0361 00896000
*                     AVNODSTK = AVTRKPRI; /*NO, TOTAL DS = PRIMARY  */ 00897000
         MVC   AVNODSTK(4),AVTRKPRI                                0362 00898000
*                   ELSE                /*YES, SECONDARY SPACE SPEC  */ 00899000
*                     DO;               /*CALC NO. TRKS ABL SECNDRY  */ 00900000
         B     @RC00361                                            0363 00901000
@RF00361 DS    0H                                                  0364 00902000
*                       AVABLSTK = JFCBSQTY / AVABLRTK;            0364 00903000
         L     @06,AVABLRTK                                        0364 00904000
         SLR   @15,@15                                             0364 00905000
         ICM   @15,7,JFCBSQTY(JFCBPTR)                             0364 00906000
         LR    @01,@15                                             0364 00907000
         SLR   @00,@00                                             0364 00908000
         DR    @00,@06                                             0364 00909000
         ST    @01,AVABLSTK                                        0364 00910000
*                       /*IF RECORDS LEFT OVER, ADD 1 TRACK TO SECON */ 00911000
*                       IF JFCBSQTY // AVABLRTK ^= 0 THEN /*DARY TRKS*/ 00912000
         LR    @02,@15                                             0365 00913000
         SRDA  @02,32                                              0365 00914000
         DR    @02,@06                                             0365 00915000
         LTR   @02,@02                                             0365 00916000
         BZ    @RF00365                                            0365 00917000
*                         AVABLSTK = AVABLSTK + 1;                 0366 00918000
         AH    @01,@CH00068                                        0366 00919000
         ST    @01,AVABLSTK                                        0366 00920000
*                       IF JFCROUND = ON THEN /*IF ROUND SPECIFIED & */ 00921000
@RF00365 TM    JFCROUND(JFCBPTR),B'00000001'                       0367 00922000
         BNO   @RF00367                                            0367 00923000
*                         /*RECORDS LEFT OVER, ROUND UP TO NEXT CYLIN*/ 00924000
*                         IF AVABLSTK // AVNUMTRK ^= 0 THEN        0368 00925000
         L     @06,AVABLSTK                                        0368 00926000
         LH    @15,AVNUMTRK                                        0368 00927000
         LR    @00,@06                                             0368 00928000
         SRDA  @00,32                                              0368 00929000
         DR    @00,@15                                             0368 00930000
         LTR   @00,@00                                             0368 00931000
         BZ    @RF00368                                            0368 00932000
*                           AVABLSTK = AVABLSTK + AVNUMTRK -       0369 00933000
*                                      (AVABLSTK // AVNUMTRK);     0369 00934000
         LR    @14,@06                                             0369 00935000
         ALR   @14,@15                                             0369 00936000
         LR    @00,@06                                             0369 00937000
         SRDA  @00,32                                              0369 00938000
         DR    @00,@15                                             0369 00939000
         SLR   @14,@00                                             0369 00940000
         ST    @14,AVABLSTK                                        0369 00941000
*                       /*DETERMINE TOTAL DATA SET SPACE             */ 00942000
*                       AVNODSTK = AVTRKPRI + 15 * AVABLSTK;       0370 00943000
@RF00368 DS    0H                                                  0370 00944000
@RF00367 L     @06,AVABLSTK                                        0370 00945000
         MH    @06,@CH00072                                        0370 00946000
         AL    @06,AVTRKPRI                                        0370 00947000
         ST    @06,AVNODSTK                                        0370 00948000
*                     END;                                         0371 00949000
*                 END;                                             0372 00950000
*             END;                                                 0373 00951000
*           ELSE                                                   0374 00952000
*             CALL BIGABL;              /*PROCESS FOR BIG AVG BLK LEN*/ 00953000
         B     @RC00332                                            0374 00954000
@RF00332 BAL   @14,BIGABL                                          0374 00955000
*         END;                                                     0375 00956000
@RC00332 DS    0H                                                  0376 00957000
*   RFY RET RSTD;                                                  0376 00958000
@RC00321 DS    0H                                                  0376 00959000
@RC00314 DS    0H                                                  0376 00960000
@RC00293 DS    0H                                                  0377 00961000
*   RET = SAV14D;                                                  0377 00962000
         L     RET,SAV14D                                          0377 00963000
*   RFY RET UNRSTD;                                                0378 00964000
*   END ALLOCTRK;                                                  0379 00965000
@EL00006 DS    0H                                                  0379 00966000
@EF00006 DS    0H                                                  0379 00967000
@ER00006 BR    @14                                                 0379 00968000
@PB00006 DS    0H                                                  0380 00969000
*   GEN(EJECT);                                                    0380 00970000
         EJECT                                                          00971000
*BIGABL:                                                           0381 00972000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0381 00973000
         B     @PB00007                                            0381 00974000
BIGABL   DS    0H                                                  0382 00975000
*   /*****************************************************************/ 00976000
*   /*                                                               */ 00977000
*   /* CALCULATE BIG AVERAGE BLOCK LENGTH                            */ 00978000
*   /*                                                               */ 00979000
*   /*****************************************************************/ 00980000
*   RFY RET RSTD;                                                  0382 00981000
*   SAV14E = RET;                                                  0383 00982000
         ST    RET,SAV14E                                          0383 00983000
*   RFY RET UNRSTD;                                                0384 00984000
*   AVABLRB = JFCBDRLH;                 /*CALC RCD LEN         YM7888*/ 00985000
         SLR   @06,@06                                             0385 00986000
         ICM   @06,7,JFCBDRLH(JFCBPTR)                             0385 00987000
         ST    @06,AVABLRB                                         0385 00988000
*   IF JFCKEYLE = 0 THEN                /*CHECK FOR KEY SPECIFIED    */ 00989000
         CLI   JFCKEYLE(JFCBPTR),0                                 0386 00990000
         BNE   @RF00386                                            0386 00991000
*     AVABLRB = AVABLRB - AVKEYCON;     /*NO, SUBTRACT KEY CONSTANT  */ 00992000
         SLR   @15,@15                                             0387 00993000
         IC    @15,AVKEYCON                                        0387 00994000
         SLR   @06,@15                                             0387 00995000
         ST    @06,AVABLRB                                         0387 00996000
*   ELSE                                                           0388 00997000
*     AVABLRB = AVABLRB + JFCKEYLE;     /*YES, ADD KEY LENGTH  YM7888*/ 00998000
         B     @RC00386                                            0388 00999000
@RF00386 SLR   @06,@06                                             0388 01000000
         IC    @06,JFCKEYLE(,JFCBPTR)                              0388 01001000
         AL    @06,AVABLRB                                         0388 01002000
         ST    @06,AVABLRB                                         0388 01003000
*   AVABLMXT = ((AVABLRB + AVLRCDO) / (AVTRKCAP - AVLRCDO)) + 2; /*MAX- 01004000
*                                       IMUM NUMBER OF TRACKS A BIGABL  01005000
*                                       RECORD WILL SPAN       YM7888*/ 01006000
@RC00386 L     @06,AVABLRB                                         0389 01007000
         LH    @15,AVLRCDO                                         0389 01008000
         LR    @14,@06                                             0389 01009000
         ALR   @14,@15                                             0389 01010000
         LH    @09,AVTRKCAP(,VDSCBPTR)                             0389 01011000
         LR    @08,@09                                             0389 01012000
         SLR   @08,@15                                             0389 01013000
         SRDA  @14,32                                              0389 01014000
         DR    @14,@08                                             0389 01015000
         AL    @15,@CF00111                                        0389 01016000
         STH   @15,AVABLMXT                                        0389 01017000
*   AVABLRB = AVABLRB + (AVABLMXT * AVLRCDO); /* NUMBER OF BYTES   0390 01018000
*                                       PER RECORD             YM7888*/ 01019000
         LH    @14,AVLRCDO                                         0390 01020000
         MR    @14,@14                                             0390 01021000
         ALR   @06,@15                                             0390 01022000
         ST    @06,AVABLRB                                         0390 01023000
*   AVABLPRI = (JFCBPQTY // AVTRKCAP) * AVABLRB; /*CALC NUMBER YM6526*/ 01024000
         SLR   @00,@00                                             0391 01025000
         ICM   @00,7,JFCBPQTY(JFCBPTR)                             0391 01026000
         SRDA  @00,32                                              0391 01027000
         DR    @00,@09                                             0391 01028000
         LR    @03,@00                                             0391 01029000
         MR    @02,@06                                             0391 01030000
         ST    @03,AVABLPRI                                        0391 01031000
*   AVABLPRT = AVABLPRI / AVTRKCAP;     /*OF PRIMARY TRACKS    YM6526*/ 01032000
         LR    @00,@03                                             0392 01033000
         SRDA  @00,32                                              0392 01034000
         DR    @00,@09                                             0392 01035000
         ST    @01,AVABLPRT                                        0392 01036000
*   IF AVABLPRI // AVTRKCAP ^= 0 THEN   /*IF BYTES LEFT, ADD 1 TRACK */ 01037000
         LR    @04,@03                                             0393 01038000
         SRDA  @04,32                                              0393 01039000
         DR    @04,@09                                             0393 01040000
         LTR   @04,@04                                             0393 01041000
         BZ    @RF00393                                            0393 01042000
*     AVABLPRT = AVABLPRT + 1;                                     0394 01043000
         AH    @01,@CH00068                                        0394 01044000
         ST    @01,AVABLPRT                                        0394 01045000
*   AVABLPRT = AVABLPRT + (JFCBPQTY / AVTRKCAP) * AVABLRB; /*  YM6526*/ 01046000
@RF00393 LH    @06,AVTRKCAP(,VDSCBPTR)                             0395 01047000
         SLR   @01,@01                                             0395 01048000
         ICM   @01,7,JFCBPQTY(JFCBPTR)                             0395 01049000
         SLR   @00,@00                                             0395 01050000
         DR    @00,@06                                             0395 01051000
         M     @00,AVABLRB                                         0395 01052000
         AL    @01,AVABLPRT                                        0395 01053000
         ST    @01,AVABLPRT                                        0395 01054000
*   IF AVLBPTRB = AVTRKCAP THEN         /*CHECK FOR DIRECTORIES      */ 01055000
         CH    @06,AVLBPTRB+80(,VDSCBPTR)                          0396 01056000
         BNE   @RF00396                                            0396 01057000
*     AVTRKPRI = AVABLPRT;              /*NO, CALC PRIMARY TRACKS    */ 01058000
         ST    @01,AVTRKPRI                                        0397 01059000
*   ELSE                                /*YES, ADD PRIMARY SPACE TO  */ 01060000
*     AVTRKPRI = AVLBPTRK + AVABLPRT + 1; /*DIRECTORY SPACE          */ 01061000
         B     @RC00396                                            0398 01062000
@RF00396 LH    @06,AVLBPTRK+80(,VDSCBPTR)                          0398 01063000
         AL    @06,AVABLPRT                                        0398 01064000
         AH    @06,@CH00068                                        0398 01065000
         ST    @06,AVTRKPRI                                        0398 01066000
*   IF JFCMIXG = ON | JFCALX = ON THEN  /*CHECK FOR MIXG OR ALX      */ 01067000
@RC00396 TM    JFCMIXG(JFCBPTR),B'00000110'                        0399 01068000
         BZ    @RF00399                                            0399 01069000
*     IF JFCROUND = ON THEN             /*YES, CHECK FOR ROUND SPEC  */ 01070000
         TM    JFCROUND(JFCBPTR),B'00000001'                       0400 01071000
         BNO   @RF00400                                            0400 01072000
*       AVNODSTK = (AVNUMCYL - 1) * AVNUMTRK;                      0401 01073000
         LH    @01,AVNUMCYL                                        0401 01074000
         BCTR  @01,0                                               0401 01075000
         MH    @01,AVNUMTRK                                        0401 01076000
         ST    @01,AVNODSTK                                        0401 01077000
*     ELSE                                                         0402 01078000
*       AVNODSTK = AVNUMCYL * AVNUMTRK - 1;                        0402 01079000
         B     @RC00400                                            0402 01080000
@RF00400 LH    @06,AVNUMCYL                                        0402 01081000
         MH    @06,AVNUMTRK                                        0402 01082000
         BCTR  @06,0                                               0402 01083000
         ST    @06,AVNODSTK                                        0402 01084000
*   ELSE                                /*ALX OR MIXG NOT SPECIFIED  */ 01085000
*     DO;                                                          0403 01086000
         B     @RC00399                                            0403 01087000
@RF00399 DS    0H                                                  0404 01088000
*       IF JFCROUND = ON THEN           /*CHECK FOR ROUND SPECIFIED  */ 01089000
         TM    JFCROUND(JFCBPTR),B'00000001'                       0404 01090000
         BNO   @RF00404                                            0404 01091000
*         IF AVTRKPRI // AVNUMTRK ^= 0 THEN /*YES,ROUND UP TO NXT CYL*/ 01092000
         L     @06,AVTRKPRI                                        0405 01093000
         LH    @15,AVNUMTRK                                        0405 01094000
         LR    @00,@06                                             0405 01095000
         SRDA  @00,32                                              0405 01096000
         DR    @00,@15                                             0405 01097000
         LTR   @00,@00                                             0405 01098000
         BZ    @RF00405                                            0405 01099000
*           AVTRKPRI = AVTRKPRI + AVNUMTRK -                       0406 01100000
*                      (AVTRKPRI // AVNUMTRK);                     0406 01101000
         LR    @14,@06                                             0406 01102000
         ALR   @14,@15                                             0406 01103000
         LR    @00,@06                                             0406 01104000
         SRDA  @00,32                                              0406 01105000
         DR    @00,@15                                             0406 01106000
         SLR   @14,@00                                             0406 01107000
         ST    @14,AVTRKPRI                                        0406 01108000
*       IF JFCBSQTY = 0 THEN            /*CHECK FOR SECONDARY REQUEST*/ 01109000
@RF00405 DS    0H                                                  0407 01110000
@RF00404 ICM   @06,7,JFCBSQTY(JFCBPTR)                             0407 01111000
         BNZ   @RF00407                                            0407 01112000
*         AVNODSTK = AVTRKPRI;          /*NO, TOTAL SPACE = PRINARY  */ 01113000
         MVC   AVNODSTK(4),AVTRKPRI                                0408 01114000
*       ELSE                            /*YES, CALC SECONDRY SPACE   */ 01115000
*         DO;                                                      0409 01116000
         B     @RC00407                                            0409 01117000
@RF00407 DS    0H                                                  0410 01118000
*           AVABLSEC = (JFCBSQTY // AVTRKCAP) * AVABLRB; /*SEC QTY   */ 01119000
         LH    @06,AVTRKCAP(,VDSCBPTR)                             0410 01120000
         SLR   @00,@00                                             0410 01121000
         ICM   @00,7,JFCBSQTY(JFCBPTR)                             0410 01122000
         SRDA  @00,32                                              0410 01123000
         DR    @00,@06                                             0410 01124000
         LR    @03,@00                                             0410 01125000
         M     @02,AVABLRB                                         0410 01126000
         ST    @03,AVABLSEC                                        0410 01127000
*           AVABLSTK = AVABLSEC / AVTRKCAP; /*CALC NO. SECONDRY TRKS */ 01128000
         LR    @00,@03                                             0411 01129000
         SRDA  @00,32                                              0411 01130000
         DR    @00,@06                                             0411 01131000
         ST    @01,AVABLSTK                                        0411 01132000
*           IF AVABLSEC // AVTRKCAP ^= 0 THEN /*IF ANY BYTES LEFT,   */ 01133000
         LR    @04,@03                                             0412 01134000
         SRDA  @04,32                                              0412 01135000
         DR    @04,@06                                             0412 01136000
         LTR   @04,@04                                             0412 01137000
         BZ    @RF00412                                            0412 01138000
*             AVABLSTK = AVABLSTK + 1;  /*ADD 1 TRACK TO SECONDARY   */ 01139000
         AH    @01,@CH00068                                        0413 01140000
         ST    @01,AVABLSTK                                        0413 01141000
*           AVABLSTK = AVABLSTK + (JFCBSQTY / AVTRKCAP) * AVABLRB; 0414 01142000
@RF00412 SLR   @01,@01                                             0414 01143000
         ICM   @01,7,JFCBSQTY(JFCBPTR)                             0414 01144000
         SLR   @00,@00                                             0414 01145000
         LH    @06,AVTRKCAP(,VDSCBPTR)                             0414 01146000
         DR    @00,@06                                             0414 01147000
         M     @00,AVABLRB                                         0414 01148000
         AL    @01,AVABLSTK                                        0414 01149000
         ST    @01,AVABLSTK                                        0414 01150000
*           IF JFCROUND = ON &          /*CHECK FOR ROUND SPECIFIED  */ 01151000
*             AVABLSTK // AVNUMTRK ^= 0 THEN /*AND NOT CYL BDY THEN  */ 01152000
         TM    JFCROUND(JFCBPTR),B'00000001'                       0415 01153000
         BNO   @RF00415                                            0415 01154000
         LH    @06,AVNUMTRK                                        0415 01155000
         LR    @02,@01                                             0415 01156000
         SRDA  @02,32                                              0415 01157000
         DR    @02,@06                                             0415 01158000
         LTR   @02,@02                                             0415 01159000
         BZ    @RF00415                                            0415 01160000
*             AVABLSTK = AVABLSTK + AVNUMTRK - /*ROUND UP TO CYL     */ 01161000
*                        (AVABLSTK // AVNUMTRK);                   0416 01162000
         LR    @00,@01                                             0416 01163000
         ALR   @00,@06                                             0416 01164000
         LR    @02,@01                                             0416 01165000
         SRDA  @02,32                                              0416 01166000
         DR    @02,@06                                             0416 01167000
         SLR   @00,@02                                             0416 01168000
         ST    @00,AVABLSTK                                        0416 01169000
*           AVNODSTK = AVTRKPRI + 15 * AVABLSTK; /*TOTAL DS TRACKS   */ 01170000
@RF00415 L     @06,AVABLSTK                                        0417 01171000
         MH    @06,@CH00072                                        0417 01172000
         AL    @06,AVTRKPRI                                        0417 01173000
         ST    @06,AVNODSTK                                        0417 01174000
*         END;                                                     0418 01175000
*     END;                                                         0419 01176000
@RC00407 DS    0H                                                  0420 01177000
*   RFY RET RSTD;                                                  0420 01178000
@RC00399 DS    0H                                                  0421 01179000
*   RET = SAV14E;                                                  0421 01180000
         L     RET,SAV14E                                          0421 01181000
*   RFY RET UNRSTD;                                                0422 01182000
*   END BIGABL;                                                    0423 01183000
@EL00007 DS    0H                                                  0423 01184000
@EF00007 DS    0H                                                  0423 01185000
@ER00007 BR    @14                                                 0423 01186000
@PB00007 DS    0H                                                  0424 01187000
*   GEN(EJECT);                                                    0424 01188000
         EJECT                                                          01189000
*ALLOCULT:                                                         0425 01190000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0425 01191000
         B     @PB00008                                            0425 01192000
ALLOCULT DS    0H                                                  0426 01193000
*   /*****************************************************************/ 01194000
*   /*                                                               */ 01195000
*   /* ALLOCATE USER LABEL TRACK                                     */ 01196000
*   /*                                                               */ 01197000
*   /*****************************************************************/ 01198000
*   RFY RET RSTD;                                                  0426 01199000
*   SAV14D = RET;                                                  0427 01200000
         ST    RET,SAV14D                                          0427 01201000
*   RFY RET UNRSTD;                                                0428 01202000
*   IF (JFCSUL = NOTON |                /*IF NO USER LABEL TRACK     */ 01203000
*       JFCSL = NOTON) THEN             /*WAS REQUESTED              */ 01204000
         TM    JFCSUL(JFCBPTR),B'00001010'                         0429 01205000
         BO    @RF00429                                            0429 01206000
*     AVULABST = 0;                     /*USER LABEL ABSOLUTE TRK = 0*/ 01207000
         SLR   @06,@06                                             0430 01208000
         STH   @06,AVULABST                                        0430 01209000
*   ELSE                                                           0431 01210000
*     IF JFCBSPAC = JFCCYLIN |          /*CHECK FOR CYLINDER ALLOC OR*/ 01211000
*        (JFCBSPAC = JFCAVBL &          /*AVERAGE BLOCK LENGTH WITH  */ 01212000
*        JFCROUND = ON) THEN            /*ROUND SPECIFIED            */ 01213000
         B     @RC00429                                            0431 01214000
@RF00429 TM    JFCBSPAC(JFCBPTR),B'11000000'                       0431 01215000
         BO    @RT00431                                            0431 01216000
         TM    JFCBSPAC(JFCBPTR),B'01000000'                       0431 01217000
         BNO   @RF00431                                            0431 01218000
         TM    JFCBSPAC(JFCBPTR),B'10000000'                       0431 01219000
         BNZ   @RF00431                                            0431 01220000
         TM    JFCROUND(JFCBPTR),B'00000001'                       0431 01221000
         BNO   @RF00431                                            0431 01222000
@RT00431 DS    0H                                                  0432 01223000
*       AVULABST = AVNUMTRK - 1;        /*YES, ALLOCATE UL TRACK     */ 01224000
         LH    @06,AVNUMTRK                                        0432 01225000
         BCTR  @06,0                                               0432 01226000
         STH   @06,AVULABST                                        0432 01227000
*     ELSE                                                         0433 01228000
*       DO;                                                        0433 01229000
         B     @RC00431                                            0433 01230000
@RF00431 DS    0H                                                  0434 01231000
*         IF JFCBSPAC = JFCABSTR THEN   /*CHECK FOR ABSOLUTE TRACK   */ 01232000
         TM    JFCBSPAC(JFCBPTR),B'11000000'                       0434 01233000
         BNZ   @RF00434                                            0434 01234000
*           DO;                         /*ALLOCATION                 */ 01235000
*             AVULABST = AVABSTRK;      /*YES, ALLOCATE FIRST TRACK  */ 01236000
         LH    @06,AVABSTRK                                        0436 01237000
         STH   @06,AVULABST                                        0436 01238000
*             AVABSTRK = AVABSTRK + 1;  /*INCR ABSOLUTE TRACK NO.    */ 01239000
         LA    @15,1                                               0437 01240000
         ALR   @06,@15                                             0437 01241000
         STH   @06,AVABSTRK                                        0437 01242000
*             AVNODSTK = AVNODSTK - 1;  /*DECR NO. DATA SET TRACKS   */ 01243000
         L     @06,AVNODSTK                                        0438 01244000
         BCTR  @06,0                                               0438 01245000
         ST    @06,AVNODSTK                                        0438 01246000
*             AVHEADST = AVHEADST + 1;  /*INCREMENT STARTING HEAD NO */ 01247000
         LH    @06,AVHEADST                                        0439 01248000
         ALR   @06,@15                                             0439 01249000
         STH   @06,AVHEADST                                        0439 01250000
*             IF AVHEADST = AVNUMTRK THEN /*IF TOO MANY TRKS FOR CYL */ 01251000
         CH    @06,AVNUMTRK                                        0440 01252000
         BNE   @RF00440                                            0440 01253000
*               DO;                                                0441 01254000
*                 AVHEADST = 0;         /*RESET STARTING HEAD TO 0   */ 01255000
         SLR   @06,@06                                             0442 01256000
         STH   @06,AVHEADST                                        0442 01257000
*                 AVCYLST = AVCYLST + 1; /*INCREMENT STARTING CYL NO.*/ 01258000
         AH    @15,AVCYLST                                         0443 01259000
         STH   @15,AVCYLST                                         0443 01260000
*               END;                                               0444 01261000
*           END;                                                   0445 01262000
*         ELSE                                                     0446 01263000
*           IF (JFCBSPAC = JFCTRK |     /*CHECK FOR TRACK ALLOC OR   */ 01264000
*             JFCBSPAC = JFCAVBL) THEN  /*AVG BLOCK LENGTH ALLOCATION*/ 01265000
         B     @RC00434                                            0446 01266000
@RF00434 TM    JFCBSPAC(JFCBPTR),B'10000000'                       0446 01267000
         BNO   @GL00006                                            0446 01268000
         TM    JFCBSPAC(JFCBPTR),B'01000000'                       0446 01269000
         BZ    @RT00446                                            0446 01270000
@GL00006 TM    JFCBSPAC(JFCBPTR),B'01000000'                       0446 01271000
         BNO   @RF00446                                            0446 01272000
         TM    JFCBSPAC(JFCBPTR),B'10000000'                       0446 01273000
         BNZ   @RF00446                                            0446 01274000
@RT00446 DS    0H                                                  0447 01275000
*             DO;                                                  0447 01276000
*               AVHEADST = AVHEADST + 1; /*INCREMENT STARTING HEAD   */ 01277000
         LA    @06,1                                               0448 01278000
         LH    @15,AVHEADST                                        0448 01279000
         ALR   @15,@06                                             0448 01280000
         STH   @15,AVHEADST                                        0448 01281000
*               IF AVNODSTK < AVAVAILT THEN /*CHECK AVAILABLE TRACK  */ 01282000
         L     @15,AVNODSTK                                        0449 01283000
         CH    @15,AVAVAILT                                        0449 01284000
         BNL   @RF00449                                            0449 01285000
*                 DO;                   /*YES, AVAILABLE TRACKS      */ 01286000
*                   AVULABST = 1;       /*ALLOCATE USER LABEL TRACK  */ 01287000
         STH   @06,AVULABST                                        0451 01288000
*                   AVABSTRK = AVABSTRK + 1; /*INCR ABSOLUTE TRK NO. */ 01289000
         AH    @06,AVABSTRK                                        0452 01290000
         STH   @06,AVABSTRK                                        0452 01291000
*                 END;                                             0453 01292000
*               ELSE                    /*NO AVAILABLE TRACKS        */ 01293000
*                 IF AVTRKPRI = AVAVAILT THEN /*IF PRIMARY SPACE =   */ 01294000
         B     @RC00449                                            0454 01295000
@RF00449 L     @06,AVTRKPRI                                        0454 01296000
         CH    @06,AVAVAILT                                        0454 01297000
         BNE   @RF00454                                            0454 01298000
*                   DO;                 /*AVAILABLE TRACKS           */ 01299000
*                     RFY R8 RSTD;                                 0456 01300000
*                     R8 = ECNOSPAC;    /*NO SPACE AVAILABLE         */ 01301000
         LA    R8,20                                               0457 01302000
*                     GO TO FREEDSCB;   /*GO FREE CORE FOR VDSCB     */ 01303000
         B     FREEDSCB                                            0458 01304000
*                     RFY R8 UNRSTD;                               0459 01305000
*                   END;                                           0460 01306000
*                 ELSE                                             0461 01307000
*                   IF AVTRKPRI < AVAVAILT THEN /*CHECK PRI SPACE <  */ 01308000
@RF00454 L     @06,AVTRKPRI                                        0461 01309000
         CH    @06,AVAVAILT                                        0461 01310000
         BNL   @RF00461                                            0461 01311000
*                     DO;               /*AVAILABLE SPACE, YES DO    */ 01312000
*                       AVULABST = 1;   /*ALLOCATE USER LABEL TRACK  */ 01313000
         LA    @06,1                                               0463 01314000
         STH   @06,AVULABST                                        0463 01315000
*                       AVABSTRK = AVABSTRK + 1; /*INCR NO. ABS TRKS */ 01316000
         AH    @06,AVABSTRK                                        0464 01317000
         STH   @06,AVABSTRK                                        0464 01318000
*                       AVNODSTK = AVNODSTK - 1; /*DECR NO. DS TRKS  */ 01319000
         L     @06,AVNODSTK                                        0465 01320000
         BCTR  @06,0                                               0465 01321000
         ST    @06,AVNODSTK                                        0465 01322000
*                     END;                                         0466 01323000
*             END;                                                 0467 01324000
@RF00461 DS    0H                                                  0467 01325000
@RC00449 DS    0H                                                  0468 01326000
*       END;                                                       0468 01327000
@RF00446 DS    0H                                                  0468 01328000
@RC00434 DS    0H                                                  0469 01329000
*   RFY RET RSTD;                                                  0469 01330000
@RC00431 DS    0H                                                  0469 01331000
@RC00429 DS    0H                                                  0470 01332000
*   RET = SAV14D;                                                  0470 01333000
         L     RET,SAV14D                                          0470 01334000
*   RFY RET UNRSTD;                                                0471 01335000
*   END ALLOCULT;                                                  0472 01336000
@EL00008 DS    0H                                                  0472 01337000
@EF00008 DS    0H                                                  0472 01338000
@ER00008 BR    @14                                                 0472 01339000
@PB00008 DS    0H                                                  0473 01340000
*   GEN(EJECT);                                                    0473 01341000
         EJECT                                                          01342000
*BLDUCB:                                                           0474 01343000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0474 01344000
         B     @PB00009                                            0474 01345000
BLDUCB   DS    0H                                                  0475 01346000
*   /*****************************************************************/ 01347000
*   /*                                                               */ 01348000
*   /* INITIALIZE NON-ZERO FIELDS IN THE VDSUCB                      */ 01349000
*   /*                                                               */ 01350000
*   /*****************************************************************/ 01351000
*   RFY RET RSTD;                                                  0475 01352000
*   SAV14C = RET;                                                  0476 01353000
         ST    RET,SAV14C                                          0476 01354000
*   RFY RET UNRSTD;                                                0477 01355000
*   UCBJBNR = '80'X;                                               0478 01356000
         MVI   UCBJBNR(VDSCBPTR),X'80'                             0478 01357000
*   UCBID = ALLBITS;                                               0479 01358000
         MVI   UCBID(VDSCBPTR),B'11111111'                         0479 01359000
*   UCBONLI = ON;                       /*SET DEVICE ONLINE BIT      */ 01360000
*   UCBRESV = ON;                       /*SET VOLUME RESERVED BIT    */ 01361000
*   UCBALOC = ON;                       /*SET DEVICE ALLOCATED BIT   */ 01362000
*   UCBDADI = ON;                       /*SET SL BIT                 */ 01363000
         OI    UCBONLI(VDSCBPTR),B'10101001'                       0483 01364000
*   UCBCHA = '3F'X;                     /*CHANNEL ADDRESS FLAGS      */ 01365000
         MVI   UCBCHA(VDSCBPTR),X'3F'                              0484 01366000
*   UCBUA = ALLBITS;                    /*UNIT ADDRESS               */ 01367000
         MVI   UCBUA(VDSCBPTR),X'FF'                               0485 01368000
*   UCBNAME = 'VIO';                    /*EBCDIC UNIT NAME           */ 01369000
         MVC   UCBNAME(3,VDSCBPTR),@CC02169                        0486 01370000
*   UCBBSVL = ON;                       /*VOLUME NOT SHARABLE        */ 01371000
*   UCBBPRV = ON;                       /*VOLUME PRIVATE             */ 01372000
         OI    UCBBSVL(VDSCBPTR),B'10010000'                       0488 01373000
*   UCBTYP = AVDEVTYP;                  /*DEVICE TYPE FIELD          */ 01374000
         MVC   UCBTYP(4,VDSCBPTR),AVDEVTYP                         0489 01375000
*   UCBRVDEV = '0'B;               /* INSURE NO VIRTUAL TYPE @ZA17523*/ 01376000
         NI    UCBRVDEV(VDSCBPTR),B'11110111'                      0490 01377000
*   UCBVOLI = JFCBVOLS;                 /*6 BYTE VOLUME SERIAL NO.   */ 01378000
         MVC   UCBVOLI(6,VDSCBPTR),JFCBVOLS(JFCBPTR)               0491 01379000
*   AVDTI = (CVTZDTAB + AVDEVTYP(4)) -> OFFSET; /*DEVIC INDX   YM5908*/ 01380000
         L     @06,CVTPTR                                          0492 01381000
         L     @06,CVTZDTAB(,@06)                                  0492 01382000
         SLR   @15,@15                                             0492 01383000
         IC    @15,AVDEVTYP+3                                      0492 01384000
         ALR   @15,@06                                             0492 01385000
         SLR   @14,@14                                             0492 01386000
         IC    @14,OFFSET(,@15)                                    0492 01387000
         STC   @14,AVDTI                                           0492 01388000
*   /*                                                               */ 01389000
*   /* MOVE DEVICE CHARACTERISTICS TABLE INTO VIO WORKAREA (12 BYTES)*/ 01390000
*   /*                                                               */ 01391000
*   AVNUMCYL = SCYL;                    /*GET NUMBER OF CYLINDERS    */ 01392000
         ALR   @06,@14                                             0493 01393000
         MVC   AVNUMCYL(2),SCYL(@06)                               0493 01394000
*   AVNUMTRK = STRK;                    /*GET NO. TRACKS PER CYLINDER*/ 01395000
         MVC   AVNUMTRK(2),STRK(@06)                               0494 01396000
*   AVTRKCAP = STRKCAP;                 /*GET TRACK CAPACITY         */ 01397000
         MVC   AVTRKCAP(2,VDSCBPTR),STRKCAP(@06)                   0495 01398000
*   IF SILEQ = ON THEN                  /*IF IRCDO = LRCDO           */ 01399000
         TM    SILEQ(@06),B'00001000'                              0496 01400000
         BNO   @RF00496                                            0496 01401000
*     DO;                               /*THEN USE HALFWORD VALUE    */ 01402000
*       AVIRCDO = SRCDO;                /*GET INNER RCD OVERHEAD     */ 01403000
         LH    @06,SRCDO(,@06)                                     0498 01404000
         STH   @06,AVIRCDO                                         0498 01405000
*       AVLRCDO = SRCDO;                /*GET LAST OR ONLY RCD OVERHD*/ 01406000
         STH   @06,AVLRCDO                                         0499 01407000
*     END;                                                         0500 01408000
*   ELSE                                /*USE ONE BYTE VALUES        */ 01409000
*     DO;                                                          0501 01410000
         B     @RC00496                                            0501 01411000
@RF00496 DS    0H                                                  0502 01412000
*       AVIBT2 = SIRCDO;                /*GET INNER RCD OVERHEAD     */ 01413000
         SLR   @06,@06                                             0502 01414000
         IC    @06,AVDTI                                           0502 01415000
         L     @01,CVTPTR                                          0502 01416000
         AL    @06,CVTZDTAB(,@01)                                  0502 01417000
         MVC   AVIBT2(1),SIRCDO(@06)                               0502 01418000
*       AVLBT2 = SLRCDO;                /*GET LAST OR ONLY RCD OVERHD*/ 01419000
         MVC   AVLBT2(1),SLRCDO(@06)                               0503 01420000
*       AVIBT1 = VDS1HEX0;              /*SET HI-ORDER BYTE TO ZERO  */ 01421000
         MVI   AVIBT1,X'00'                                        0504 01422000
*       AVLBT1 = VDS1HEX0;              /*SET HI-ORDER BYTE TO ZERO  */ 01423000
         MVI   AVLBT1,X'00'                                        0505 01424000
*     END;                                                         0506 01425000
*   AVKEYCON = SKEY;                    /*GET KEY CONSTANT           */ 01426000
@RC00496 SLR   @06,@06                                             0507 01427000
         IC    @06,AVDTI                                           0507 01428000
         L     @01,CVTPTR                                          0507 01429000
         AL    @06,CVTZDTAB(,@01)                                  0507 01430000
         MVC   AVKEYCON(1),SKEY(@06)                               0507 01431000
*   AVFLAGS = SFLAG;                    /*GET FLAG BYTE              */ 01432000
         MVC   AVFLAGS(1),SFLAG(@06)                               0508 01433000
*   IF SFTOLER = ON THEN                /*IS TOLERANCE VALID   YM3818*/ 01434000
         TM    SFTOLER(@06),B'00000001'                            0509 01435000
         BNO   @RF00509                                            0509 01436000
*     AVTOLER = STOLER;                 /*IF VALID, USE IT     YM3818*/ 01437000
         MVC   AVTOLER(2),STOLER(@06)                              0510 01438000
*   ELSE                                /*OTHERWISE, USE 512   YM3818*/ 01439000
*     AVTOLER = 512;                    /*TO NULLIFY TOLERANCE YM3818*/ 01440000
         B     @RC00509                                            0511 01441000
@RF00509 MVC   AVTOLER(2),@CH01660                                 0511 01442000
*                                       /*CALCULATIONS         YM3818*/ 01443000
*   RFY RET RSTD;                                                  0512 01444000
@RC00509 DS    0H                                                  0513 01445000
*   RET = SAV14C;                                                  0513 01446000
         L     RET,SAV14C                                          0513 01447000
*   RFY RET UNRSTD;                                                0514 01448000
*   END BLDUCB;                                                    0515 01449000
@EL00009 DS    0H                                                  0515 01450000
@EF00009 DS    0H                                                  0515 01451000
@ER00009 BR    @14                                                 0515 01452000
@PB00009 DS    0H                                                  0516 01453000
*   GEN(EJECT);                                                    0516 01454000
         EJECT                                                          01455000
*BLDDSEXT:                                                         0517 01456000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0517 01457000
         B     @PB00010                                            0517 01458000
BLDDSEXT DS    0H                                                  0518 01459000
*   /*****************************************************************/ 01460000
*   /*                                                               */ 01461000
*   /* BUILD THE DATA SET EXTENT                                     */ 01462000
*   /*                                                               */ 01463000
*   /*****************************************************************/ 01464000
*   RFY RET RSTD;                                                  0518 01465000
*   SAV14D = RET;                                                  0519 01466000
         ST    RET,SAV14D                                          0519 01467000
*   RFY RET UNRSTD;                                                0520 01468000
*   RESPECIFY EXTPTR RESTRICTED;                                   0521 01469000
*   DS1NOEPV = 1;                       /*NO. DS EXTENTS = ONE       */ 01470000
         LA    @08,80                                              0522 01471000
         ALR   @08,VDSCBPTR                                        0522 01472000
         MVI   DS1NOEPV(@08),X'01'                                 0522 01473000
*   IF AVULABST = 0 THEN                /*IF NO USER LABEL TRACK THEN*/ 01474000
         ICM   @06,3,AVULABST                                      0523 01475000
         BNZ   @RF00523                                            0523 01476000
*     DO;                               /*SET UP FOR DS1EXT1         */ 01477000
*       EXTPTR = ADDR(DS1EXT1);         /*BASE FOR VDS1EXT           */ 01478000
         LA    EXTPTR,DS1EXT1(,@08)                                0525 01479000
*       VDS1EXTN = VDSEXT1;             /*INDICATE FIRST EXTENT      */ 01480000
         MVI   VDS1EXTN(EXTPTR),X'00'                              0526 01481000
*     END;                                                         0527 01482000
*   ELSE                                /*OTHERWISE, SET UP FOR      */ 01483000
*     DO;                               /*DS1EXT2                    */ 01484000
         B     @RC00523                                            0528 01485000
@RF00523 DS    0H                                                  0529 01486000
*       EXTPTR = ADDR(DS1EXT2);         /*BASE FOR VDS1EXT           */ 01487000
         LA    EXTPTR,DS1EXT2+80(,VDSCBPTR)                        0529 01488000
*       VDS1EXTN = VDSEXT2;             /*INDICATE SECOND EXTENT     */ 01489000
         MVI   VDS1EXTN(EXTPTR),X'01'                              0530 01490000
*     END;                                                         0531 01491000
*   VDS1STCC = AVCYLST;                 /*STARTING CYLINDER NUMBER   */ 01492000
@RC00523 MVC   VDS1STCC(2,EXTPTR),AVCYLST                          0532 01493000
*   VDS1STHH = AVHEADST;                /*STARTING HEAD NUMBER       */ 01494000
         MVC   VDS1STHH(2,EXTPTR),AVHEADST                         0533 01495000
*   AVABSLTA = AVABSTRK + AVNODSTK - 1; /*CALC LAST TRACK ALLOCATED  */ 01496000
         LH    @08,AVABSTRK                                        0534 01497000
         AL    @08,AVNODSTK                                        0534 01498000
         BCTR  @08,0                                               0534 01499000
         STH   @08,AVABSLTA                                        0534 01500000
*   VDS1ECC = AVABSLTA / AVNUMTRK;      /*ENDING CYLINDER NUMBER     */ 01501000
         LH    @06,AVNUMTRK                                        0535 01502000
         LR    @00,@08                                             0535 01503000
         SRDA  @00,32                                              0535 01504000
         DR    @00,@06                                             0535 01505000
         STH   @01,VDS1ECC(,EXTPTR)                                0535 01506000
*   VDS1EHH = AVABSLTA // AVNUMTRK;     /*ENDING HEAD NUMBER         */ 01507000
         LR    @00,@08                                             0536 01508000
         SRDA  @00,32                                              0536 01509000
         DR    @00,@06                                             0536 01510000
         STH   @00,VDS1EHH(,EXTPTR)                                0536 01511000
*   IF (JFCBSPAC = JFCCYLIN) |          /*IF CYLINDER ALLOCATION OR  */ 01512000
*     (JFCBSPAC = JFCAVBL &             /*BOTH AVERAGE BLOCK LENGTH  */ 01513000
*     JFCROUND = ON) THEN               /*AND ROUND WERE SPECIFIED   */ 01514000
         TM    JFCBSPAC(JFCBPTR),B'11000000'                       0537 01515000
         BO    @RT00537                                            0537 01516000
         TM    JFCBSPAC(JFCBPTR),B'01000000'                       0537 01517000
         BNO   @RF00537                                            0537 01518000
         TM    JFCBSPAC(JFCBPTR),B'10000000'                       0537 01519000
         BNZ   @RF00537                                            0537 01520000
         TM    JFCROUND(JFCBPTR),B'00000001'                       0537 01521000
         BNO   @RF00537                                            0537 01522000
@RT00537 DS    0H                                                  0538 01523000
*     VDS1EXTD = VDSABLRC;                                         0538 01524000
         MVI   VDS1EXTD(EXTPTR),B'10000001'                        0538 01525000
*   ELSE                                                           0539 01526000
*     IF (JFCBSPAC = JFCAVBL) |         /*CHK AVERAGE BLOCK LENGTH OR*/ 01527000
*       (JFCBSPAC = JFCTRK) THEN        /*TRACK ALLOCATION           */ 01528000
         B     @RC00537                                            0539 01529000
@RF00537 TM    JFCBSPAC(JFCBPTR),B'01000000'                       0539 01530000
         BNO   @GL00009                                            0539 01531000
         TM    JFCBSPAC(JFCBPTR),B'10000000'                       0539 01532000
         BZ    @RT00539                                            0539 01533000
@GL00009 TM    JFCBSPAC(JFCBPTR),B'10000000'                       0539 01534000
         BNO   @RF00539                                            0539 01535000
         TM    JFCBSPAC(JFCBPTR),B'01000000'                       0539 01536000
         BNZ   @RF00539                                            0539 01537000
@RT00539 DS    0H                                                  0540 01538000
*       VDS1EXTD = VDSABLTK;                                       0540 01539000
         MVI   VDS1EXTD(EXTPTR),B'00000001'                        0540 01540000
*     ELSE                                                         0541 01541000
*       DO;                                                        0541 01542000
         B     @RC00539                                            0541 01543000
@RF00539 DS    0H                                                  0542 01544000
*         IF VDS1STHH = VDSSTHH0 &                                 0542 01545000
*           (VDS1EHH = AVNUMTRK - 1) THEN                          0542 01546000
         ICM   @08,3,VDS1STHH(EXTPTR)                              0542 01547000
         BNZ   @RF00542                                            0542 01548000
         LH    @08,AVNUMTRK                                        0542 01549000
         BCTR  @08,0                                               0542 01550000
         CH    @08,VDS1EHH(,EXTPTR)                                0542 01551000
         BNE   @RF00542                                            0542 01552000
*           VDS1EXTD = VDSABSHH;                                   0543 01553000
         MVI   VDS1EXTD(EXTPTR),B'10000001'                        0543 01554000
*         ELSE                                                     0544 01555000
*           VDS1EXTD = VDSABSTK;                                   0544 01556000
         B     @RC00542                                            0544 01557000
@RF00542 MVI   VDS1EXTD(EXTPTR),B'00000001'                        0544 01558000
*       END;                                                       0545 01559000
@RC00542 DS    0H                                                  0546 01560000
*   RESPECIFY EXTPTR UNRESTRICTED;                                 0546 01561000
@RC00539 DS    0H                                                  0546 01562000
@RC00537 DS    0H                                                  0547 01563000
*   RFY RET RSTD;                                                  0547 01564000
*   RET = SAV14D;                                                  0548 01565000
         L     RET,SAV14D                                          0548 01566000
*   RFY RET UNRSTD;                                                0549 01567000
*   END BLDDSEXT;                                                  0550 01568000
@EL00010 DS    0H                                                  0550 01569000
@EF00010 DS    0H                                                  0550 01570000
@ER00010 BR    @14                                                 0550 01571000
@PB00010 DS    0H                                                  0551 01572000
*   GEN(EJECT);                                                    0551 01573000
         EJECT                                                          01574000
*MRGJFCB:                                                          0552 01575000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0552 01576000
         B     @PB00011                                            0552 01577000
MRGJFCB  DS    0H                                                  0553 01578000
*   /*****************************************************************/ 01579000
*   /*                                                               */ 01580000
*   /* MERGE JFCB FIELDS TO SELECTED VDSDSCB FIELDS                  */ 01581000
*   /*                                                               */ 01582000
*   /*****************************************************************/ 01583000
*   RFY RET RSTD;                                                  0553 01584000
*   SAV14D = RET;                       /*SAVE REGISTER 14           */ 01585000
         ST    RET,SAV14D                                          0554 01586000
*   RFY RET UNRSTD;                                                0555 01587000
*   DS1DSNAM = JFCBDSNM;                /*DATA SET NAME 44 BYTES     */ 01588000
         LA    @06,80                                              0556 01589000
         ALR   @06,VDSCBPTR                                        0556 01590000
         MVC   DS1DSNAM(44,@06),JFCBDSNM(JFCBPTR)                  0556 01591000
*   DS1FMTID = 'F1'X;                   /*FORMAT 1 ID                */ 01592000
         MVI   DS1FMTID(@06),X'F1'                                 0557 01593000
*   DS1DSSN = JFCBVOLS;                 /*VOLUME SERIAL NUMBER       */ 01594000
         MVC   DS1DSSN(6,@06),JFCBVOLS(JFCBPTR)                    0558 01595000
*   DS1VOLSQ = 1;                       /*VOLUME SEQUENCE NUMBER     */ 01596000
         MVC   DS1VOLSQ(2,@06),@CH00068                            0559 01597000
*   DS1CREDT = JFCBCRDT;                /*DATA SET CREATION DATE     */ 01598000
         MVC   DS1CREDT(3,@06),JFCBCRDT(JFCBPTR)                   0560 01599000
*   DS1EXPDT = JFCBXPDT;                /*DATA SET EXPIRATION DATE   */ 01600000
         MVC   DS1EXPDT(3,@06),JFCBXPDT(JFCBPTR)                   0561 01601000
*   DS1DSORG = JFCDSORG;                /*DATA SET ORGANIZATION      */ 01602000
         MVC   DS1DSORG(2,@06),JFCDSORG(JFCBPTR)                   0562 01603000
*   IF JFCBDQTY = 0 THEN                /*CHECK FOR PARTITIONED DS   */ 01604000
         ICM   @15,7,JFCBDQTY(JFCBPTR)                             0563 01605000
         BNZ   @RF00563                                            0563 01606000
*     DS1NOBDB = 0;                     /*NO, SET TO ZERO            */ 01607000
         MVI   DS1NOBDB(@06),X'00'                                 0564 01608000
*   ELSE                                                           0565 01609000
*     DO;                                                          0565 01610000
         B     @RC00563                                            0565 01611000
@RF00563 DS    0H                                                  0566 01612000
*       DS1NOBDB = '0E'X;               /*YES, NO. BYTES LAST PDS BLK*/ 01613000
         LA    @06,80                                              0566 01614000
         ALR   @06,VDSCBPTR                                        0566 01615000
         MVI   DS1NOBDB(@06),X'0E'                                 0566 01616000
*       DS1PDS = ON;                    /*INDICATE PO IN DSORG       */ 01617000
         OI    DS1PDS(@06),B'00000010'                             0567 01618000
*     END;                                                         0568 01619000
*   DS1SYSCD = 'IBM OS/VS 370';         /*SYSTEM CODE          YM3995*/ 01620000
@RC00563 LA    @06,80                                              0569 01621000
         ALR   @06,VDSCBPTR                                        0569 01622000
         MVC   DS1SYSCD(13,@06),@CC02178                           0569 01623000
*   DS1RECFM = JFCRECFM;                /*RECORD FORMAT              */ 01624000
         MVC   DS1RECFM(1,@06),JFCRECFM(JFCBPTR)                   0570 01625000
*   DS1OPTCD = JFCOPTCD;                /*OPTION CODES               */ 01626000
         MVC   DS1OPTCD(1,@06),JFCOPTCD(JFCBPTR)                   0571 01627000
*   DS1BLKL = JFCBLKSI;                 /*BLOCKSIZE                  */ 01628000
         MVC   DS1BLKL(2,@06),JFCBLKSI(JFCBPTR)                    0572 01629000
*   DS1LRECL = JFCLRECL;                /*LOGICAL RECORD LENGTH      */ 01630000
         MVC   DS1LRECL(2,@06),JFCLRECL(JFCBPTR)                   0573 01631000
*   DS1KEYL = JFCKEYLE;                 /*KEY LENGTH                 */ 01632000
         MVC   DS1KEYL(1,@06),JFCKEYLE(JFCBPTR)                    0574 01633000
*   DS1RKP = JFCRKP;                    /*RELATIVE KEY POSITION      */ 01634000
         MVC   DS1RKP(2,@06),JFCRKP(JFCBPTR)                       0575 01635000
*   DS1SCALO(1) = JFCBCTRI;             /*SPACE PARAMETERS           */ 01636000
         MVC   DS1SCALO(1,@06),JFCBCTRI(JFCBPTR)                   0576 01637000
*   RFY RET RSTD;                                                  0577 01638000
*   RET = SAV14D;                       /*RESTORE REGISTER 14        */ 01639000
         L     RET,SAV14D                                          0578 01640000
*   RFY RET UNRSTD;                                                0579 01641000
*   END MRGJFCB;                                                   0580 01642000
@EL00011 DS    0H                                                  0580 01643000
@EF00011 DS    0H                                                  0580 01644000
@ER00011 BR    @14                                                 0580 01645000
@PB00011 DS    0H                                                  0581 01646000
*   GEN(EJECT);                                                    0581 01647000
         EJECT                                                          01648000
*   GEN DATA;                                                      0582 01649000
*   END IGG0325I                                                   0583 01650000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 01651000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 01652000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                        * 01653000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                        * 01654000
*/*%INCLUDE SYSLIB  (IEFJFCBN)                                        * 01655000
*/*%INCLUDE SYSLIB  (IDDVDSCB)                                        * 01656000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                        * 01657000
*/*%INCLUDE SYSLIB  (IECSDSL1)                                        * 01658000
*;                                                                 0583 01659000
@EL00001 L     @13,4(,@13)                                         0583 01660000
@EF00001 DS    0H                                                  0583 01661000
@ER00001 BR    @14                                                 0583 01662000
@DATA    DS    0H                                                       01663000
@CH00068 DC    H'1'                                                     01664000
@CH00072 DC    H'15'                                                    01665000
@DATD    DSECT                                                          01666000
         DS    0F                                                       01667000
@SA00001 DS    18F                                                      01668000
IGG0325I CSECT                                                          01669000
         DS    0F                                                       01670000
@CF00111 DC    F'2'                                                     01671000
@CF00842 DC    F'64'                                                    01672000
@CF01660 DC    F'512'                                                   01673000
@CH01660 EQU   @CF01660+2                                               01674000
@DATD    DSECT                                                          01675000
         DS    0D                                                       01676000
IGG0325I CSECT                                                          01677000
         DS    0F                                                       01678000
@SIZDATD DC    AL1(0)                                                   01679000
         DC    AL3(@ENDDATD-@DATD)                                      01680000
         DS    0D                                                       01681000
@CC02178 DC    C'IBM OS/VS 370'                                         01682000
@CC02169 DC    C'VIO'                                                   01683000
@DATD    DSECT                                                          01684000
IGG0325I CSECT                                                          01685000
         XCTLTABL ID=(AVCLF2,IGG0CLF2),SVC=032,BRT=YES,LENGTH=          01686000
         EJECT                                                          01687000
DSCBWKAR IECALLWA EP,ADT=YES            ALLOCATE WORK AREA              01688000
@DATD    DSECT                                                          01689000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01690000
@ENDDATD EQU   *                                                        01691000
IGG0325I CSECT                                                          01692000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01693000
@01      EQU   01                                                       01694000
@02      EQU   02                                                       01695000
@03      EQU   03                                                       01696000
@04      EQU   04                                                       01697000
@05      EQU   05                                                       01698000
@06      EQU   06                                                       01699000
@07      EQU   07                                                       01700000
@08      EQU   08                                                       01701000
@09      EQU   09                                                       01702000
@10      EQU   10                                                       01703000
@11      EQU   11                                                       01704000
@12      EQU   12                                                       01705000
@13      EQU   13                                                       01706000
@14      EQU   14                                                       01707000
@15      EQU   15                                                       01708000
R1       EQU   @01                                                      01709000
R2       EQU   @02                                                      01710000
JSCBACTP EQU   @06                                                      01711000
DEVTPTR  EQU   @07                                                      01712000
R7       EQU   @07                                                      01713000
R8       EQU   @08                                                      01714000
EXTPTR   EQU   @09                                                      01715000
R9       EQU   @09                                                      01716000
VDSCBPTR EQU   @10                                                      01717000
RA       EQU   @10                                                      01718000
JFCBPTR  EQU   @11                                                      01719000
R11      EQU   @11                                                      01720000
RBASE    EQU   @12                                                      01721000
R12      EQU   @12                                                      01722000
RALLOCWA EQU   @13                                                      01723000
R13      EQU   @13                                                      01724000
RET      EQU   @14                                                      01725000
RETCODE  EQU   @15                                                      01726000
RF       EQU   @15                                                      01727000
R0       EQU   @00                                                      01728000
R3       EQU   @03                                                      01729000
R4       EQU   @04                                                      01730000
R5       EQU   @05                                                      01731000
R6       EQU   @06                                                      01732000
CVTPTR   EQU   16                                                       01733000
CVTMAP   EQU   0                                                        01734000
CVT      EQU   CVTMAP                                                   01735000
CVTTCBP  EQU   CVTMAP                                                   01736000
CVTZDTAB EQU   CVTMAP+64                                                01737000
CVTDAR   EQU   CVTMAP+72                                                01738000
CVTFLGS1 EQU   CVTDAR                                                   01739000
CVTDCB   EQU   CVTMAP+116                                               01740000
CVTIERLC EQU   CVTMAP+144                                               01741000
CVTOPTA  EQU   CVTMAP+182                                               01742000
CVTOPTB  EQU   CVTMAP+183                                               01743000
CVTGTF   EQU   CVTMAP+236                                               01744000
CVTGTFST EQU   CVTGTF                                                   01745000
CVTGTFS  EQU   CVTGTFST                                                 01746000
CVTSTATE EQU   CVTGTFST                                                 01747000
CVTTMODE EQU   CVTGTFST                                                 01748000
CVTFORM  EQU   CVTGTFST                                                 01749000
CVTAQAVT EQU   CVTMAP+240                                               01750000
CVTTCMFG EQU   CVTAQAVT                                                 01751000
CVTVOLM2 EQU   CVTMAP+244                                               01752000
CVTTATA  EQU   CVTVOLM2                                                 01753000
CVTTSKS  EQU   CVTTATA                                                  01754000
CVTVOLF2 EQU   CVTTSKS                                                  01755000
CVTTAT   EQU   CVTTATA+1                                                01756000
CVTATER  EQU   CVTMAP+248                                               01757000
CVTEXT1  EQU   CVTMAP+252                                               01758000
CVTPURG  EQU   CVTMAP+260                                               01759000
CVTQMSG  EQU   CVTMAP+268                                               01760000
CVTDMSR  EQU   CVTMAP+272                                               01761000
CVTRSV37 EQU   CVTDMSR                                                  01762000
CVTDMSRF EQU   CVTRSV37                                                 01763000
CVTERPV  EQU   CVTMAP+316                                               01764000
CVTINTLA EQU   CVTMAP+320                                               01765000
CVTAPF   EQU   CVTMAP+324                                               01766000
CVTEXT2  EQU   CVTMAP+328                                               01767000
CVTHJES  EQU   CVTMAP+332                                               01768000
CVTPGSIA EQU   CVTMAP+348                                               01769000
CVTA1F1  EQU   CVTMAP+356                                               01770000
CVTSYSK  EQU   CVTMAP+357                                               01771000
CVTVOLM1 EQU   CVTMAP+380                                               01772000
CVTVOLF1 EQU   CVTVOLM1                                                 01773000
CVTATMCT EQU   CVTMAP+388                                               01774000
CVTXTNT1 EQU   0                                                        01775000
CVTXTNT2 EQU   0                                                        01776000
CVTDSSV  EQU   CVTXTNT2                                                 01777000
CVTFLGBT EQU   CVTXTNT2+5                                               01778000
CVTQID   EQU   CVTXTNT2+24                                              01779000
CVTRV400 EQU   CVTXTNT2+52                                              01780000
CVTRV409 EQU   CVTXTNT2+53                                              01781000
CVTATCVT EQU   CVTXTNT2+64                                              01782000
CVTRV429 EQU   CVTXTNT2+84                                              01783000
CVTRV438 EQU   CVTXTNT2+85                                              01784000
CVTRV457 EQU   CVTXTNT2+112                                             01785000
CVTRV466 EQU   CVTXTNT2+113                                             01786000
CVTFIX   EQU   0                                                        01787000
CVTRELNO EQU   CVTFIX+252                                               01788000
TCBPTRS  EQU   0                                                        01789000
TCBPTR   EQU   TCBPTRS+4                                                01790000
TCBFIX   EQU   0                                                        01791000
TCBFRS   EQU   TCBFIX                                                   01792000
TCB      EQU   0                                                        01793000
TCBPIE   EQU   TCB+4                                                    01794000
TCBPMASK EQU   TCBPIE                                                   01795000
TCBCMP   EQU   TCB+16                                                   01796000
TCBCMPF  EQU   TCBCMP                                                   01797000
TCBCPP   EQU   TCBCMPF                                                  01798000
TCBSTCC  EQU   TCBCMPF                                                  01799000
TCBCDBL  EQU   TCBCMPF                                                  01800000
TCBCWTO  EQU   TCBCMPF                                                  01801000
TCBCIND  EQU   TCBCMPF                                                  01802000
TCBCMSG  EQU   TCBCMPF                                                  01803000
TCBTRN   EQU   TCB+20                                                   01804000
TCBABF   EQU   TCBTRN                                                   01805000
TCBMSS   EQU   TCB+24                                                   01806000
TCBPKF   EQU   TCB+28                                                   01807000
TCBFLGS  EQU   TCB+29                                                   01808000
TCBFLGS1 EQU   TCBFLGS                                                  01809000
TCBFLGS2 EQU   TCBFLGS+1                                                01810000
TCBFLGS3 EQU   TCBFLGS+2                                                01811000
TCBFLGS4 EQU   TCBFLGS+3                                                01812000
TCBFLGS5 EQU   TCBFLGS+4                                                01813000
TCBABWF  EQU   TCBFLGS5                                                 01814000
TCBJPQ   EQU   TCB+44                                                   01815000
TCBPURGE EQU   TCBJPQ                                                   01816000
TCBGRS   EQU   TCB+48                                                   01817000
TCBFSA   EQU   TCB+112                                                  01818000
TCBTME   EQU   TCB+120                                                  01819000
TCBJSTCB EQU   TCB+124                                                  01820000
TCBTSFLG EQU   TCB+148                                                  01821000
TCBTSTSK EQU   TCBTSFLG                                                 01822000
TCBSTAB  EQU   TCB+160                                                  01823000
TCBNSTAE EQU   TCBSTAB                                                  01824000
TCBTCT   EQU   TCB+164                                                  01825000
TCBTCTGF EQU   TCBTCT                                                   01826000
TCBSCNDY EQU   TCB+172                                                  01827000
TCBNDSP  EQU   TCBSCNDY                                                 01828000
TCBNDSP1 EQU   TCBNDSP+1                                                01829000
TCBNDSP2 EQU   TCBNDSP+2                                                01830000
TCBNDSP3 EQU   TCBNDSP+3                                                01831000
TCBJSCB  EQU   TCB+180                                                  01832000
TCBRECDE EQU   TCBJSCB                                                  01833000
TCBEXT1  EQU   TCB+196                                                  01834000
TCBBITS  EQU   TCB+200                                                  01835000
TCBNDSP4 EQU   TCBBITS                                                  01836000
TCBNDSP5 EQU   TCBBITS+1                                                01837000
TCBFLGS6 EQU   TCBBITS+2                                                01838000
TCBFLGS7 EQU   TCBBITS+3                                                01839000
TCBDAR   EQU   TCB+204                                                  01840000
TCBDARC  EQU   TCBDAR                                                   01841000
TCBEXT2  EQU   TCB+208                                                  01842000
TCBFOE   EQU   TCB+244                                                  01843000
TCBESTAE EQU   TCB+264                                                  01844000
TCBESTRM EQU   TCBESTAE+1                                               01845000
TCBFBYT1 EQU   TCB+276                                                  01846000
TCBFBYT2 EQU   TCB+277                                                  01847000
TCBRV124 EQU   TCB+278                                                  01848000
TCBRV133 EQU   TCB+279                                                  01849000
TCBXTNT2 EQU   0                                                        01850000
TCBGTF   EQU   TCBXTNT2                                                 01851000
TCBTFLG  EQU   TCBGTF                                                   01852000
TCBRV146 EQU   TCBXTNT2+28                                              01853000
TCBRV155 EQU   TCBXTNT2+29                                              01854000
TCBRV164 EQU   TCBXTNT2+30                                              01855000
TCBRV173 EQU   TCBXTNT2+31                                              01856000
DEVICTYP EQU   0                                                        01857000
VDS1EXT  EQU   0                                                        01858000
VDS1EXTD EQU   VDS1EXT                                                  01859000
VDS1EXTN EQU   VDS1EXT+1                                                01860000
VDS1STCC EQU   VDS1EXT+2                                                01861000
VDS1STHH EQU   VDS1EXT+4                                                01862000
VDS1ECC  EQU   VDS1EXT+6                                                01863000
VDS1EHH  EQU   VDS1EXT+8                                                01864000
IEZJSCB  EQU   0                                                        01865000
JSCBSEC1 EQU   IEZJSCB+188                                              01866000
JSCHPCE  EQU   JSCBSEC1+4                                               01867000
JSCBDCB  EQU   JSCBSEC1+36                                              01868000
JSCBOPTS EQU   JSCBSEC1+48                                              01869000
JSCBSWT1 EQU   JSCBSEC1+55                                              01870000
JSCBWTP  EQU   JSCBSEC1+64                                              01871000
JSCBWTFG EQU   JSCBWTP                                                  01872000
JSCBEND1 EQU   IEZJSCB+260                                              01873000
INFMJFCB EQU   0                                                        01874000
JFCBDSNM EQU   INFMJFCB                                                 01875000
JFCBELNM EQU   INFMJFCB+44                                              01876000
JFCBTSDM EQU   INFMJFCB+52                                              01877000
JFCFCBID EQU   INFMJFCB+56                                              01878000
JFCBFRID EQU   JFCFCBID                                                 01879000
JFCBLTYP EQU   INFMJFCB+66                                              01880000
JFCSUL   EQU   JFCBLTYP                                                 01881000
JFCSL    EQU   JFCBLTYP                                                 01882000
JFCBOTTR EQU   INFMJFCB+67                                              01883000
JFCBUFOF EQU   JFCBOTTR                                                 01884000
JFCBFLSQ EQU   JFCBOTTR+1                                               01885000
JFCFUNC  EQU   JFCBFLSQ                                                 01886000
JFCBMASK EQU   INFMJFCB+72                                              01887000
JFCBFLG1 EQU   JFCBMASK+5                                               01888000
JFCOPEN  EQU   JFCBFLG1                                                 01889000
JFCBFLG2 EQU   JFCBMASK+6                                               01890000
JFCDEFER EQU   JFCBFLG2                                                 01891000
JFCBCRDT EQU   INFMJFCB+80                                              01892000
JFCBXPDT EQU   INFMJFCB+83                                              01893000
JFCBIND1 EQU   INFMJFCB+86                                              01894000
JFCBIND2 EQU   INFMJFCB+87                                              01895000
JFCAMPTR EQU   INFMJFCB+88                                              01896000
JFCBUFRQ EQU   JFCAMPTR                                                 01897000
JFCBUFNO EQU   JFCBUFRQ                                                 01898000
JFCBGNCP EQU   JFCAMPTR+1                                               01899000
JFCBHIAR EQU   JFCBGNCP                                                 01900000
JFCBFALN EQU   JFCBHIAR                                                 01901000
JFCBFTEK EQU   JFCBFALN                                                 01902000
JFCBBFTA EQU   JFCBFTEK                                                 01903000
JFCEROPT EQU   INFMJFCB+92                                              01904000
JFCTRTCH EQU   INFMJFCB+93                                              01905000
VDSCB    EQU   0                                                        01906000
VDSUCB   EQU   VDSCB                                                    01907000
VDSTRKSI EQU   VDSCB+68                                                 01908000
VDSABSTT EQU   VDSCB+72                                                 01909000
VDSNMTRK EQU   VDSCB+74                                                 01910000
VDSDSCB  EQU   VDSCB+80                                                 01911000
UCB      EQU   0                                                        01912000
UCBPTR   EQU   0                                                        01913000
UCBOB    EQU   0                                                        01914000
UCBJBNR  EQU   UCBOB                                                    01915000
UCBFL5   EQU   UCBOB+1                                                  01916000
UCBAF    EQU   UCBFL5                                                   01917000
UCBID    EQU   UCBOB+2                                                  01918000
UCBSTAT  EQU   UCBOB+3                                                  01919000
UCBONLI  EQU   UCBSTAT                                                  01920000
UCBRESV  EQU   UCBSTAT                                                  01921000
UCBALOC  EQU   UCBSTAT                                                  01922000
UCBDADI  EQU   UCBSTAT                                                  01923000
UCBCHAN  EQU   UCBOB+4                                                  01924000
UCBCHA   EQU   UCBCHAN                                                  01925000
UCBUA    EQU   UCBCHAN+1                                                01926000
UCBSFLS  EQU   UCBOB+6                                                  01927000
UCBFLA   EQU   UCBSFLS                                                  01928000
UCBFL1   EQU   UCBFLA                                                   01929000
UCBBSY   EQU   UCBFL1                                                   01930000
UCBNRY   EQU   UCBFL1                                                   01931000
UCBPST   EQU   UCBFL1                                                   01932000
UCBCUB   EQU   UCBFL1                                                   01933000
UCBFLB   EQU   UCBSFLS+1                                                01934000
UCBCHM   EQU   UCBOB+8                                                  01935000
UCBCHM1  EQU   UCBCHM                                                   01936000
UCBPTH0  EQU   UCBCHM1                                                  01937000
UCBPTH1  EQU   UCBCHM1                                                  01938000
UCBWGT   EQU   UCBOB+12                                                 01939000
UCBNAME  EQU   UCBOB+13                                                 01940000
UCBTYP   EQU   UCBOB+16                                                 01941000
UCBTBYT1 EQU   UCBTYP                                                   01942000
UCB1FEA5 EQU   UCBTBYT1                                                 01943000
UCB1FEA6 EQU   UCBTBYT1                                                 01944000
UCBTBYT2 EQU   UCBTYP+1                                                 01945000
UCB2OPT2 EQU   UCBTBYT2                                                 01946000
UCBDUDN1 EQU   UCB2OPT2                                                 01947000
UCB2OPT3 EQU   UCBTBYT2                                                 01948000
UCBDUDN2 EQU   UCB2OPT3                                                 01949000
UCB2OPT4 EQU   UCBTBYT2                                                 01950000
UCBRWTAU EQU   UCB2OPT4                                                 01951000
UCBRVDEV EQU   UCBRWTAU                                                 01952000
UCB2OPT6 EQU   UCBTBYT2                                                 01953000
UCB2OPT7 EQU   UCBTBYT2                                                 01954000
UCBTBYT3 EQU   UCBTYP+2                                                 01955000
UCBDVCLS EQU   UCBTBYT3                                                 01956000
UCBTBYT4 EQU   UCBTYP+3                                                 01957000
UCBEXTPT EQU   UCBOB+20                                                 01958000
UCBFLC   EQU   UCBEXTPT                                                 01959000
UCBDEV   EQU   UCBOB+24                                                 01960000
UCBCMEXT EQU   0                                                        01961000
UCBATI   EQU   UCBCMEXT+3                                               01962000
@NM00021 EQU   UCBATI                                                   01963000
UCBFLP1  EQU   UCBCMEXT+5                                               01964000
UCBMT    EQU   0                                                        01965000
UCBOCR   EQU   0                                                        01966000
UCB3540X EQU   0                                                        01967000
UCBDKBYT EQU   UCB3540X+6                                               01968000
UCB3800X EQU   0                                                        01969000
UCBOPTNS EQU   UCB3800X                                                 01970000
UCBACTIV EQU   UCB3800X+3                                               01971000
UCBMDRBF EQU   UCB3800X+36                                              01972000
UCBUCS   EQU   0                                                        01973000
UCBUCSOP EQU   UCBUCS+4                                                 01974000
UCBFCBOP EQU   UCBUCS+5                                                 01975000
IECSDSF1 EQU   0                                                        01976000
F1PTR    EQU   0                                                        01977000
IECSDSL1 EQU   0                                                        01978000
DS1DSNAM EQU   IECSDSL1                                                 01979000
DS1FMTID EQU   IECSDSL1+44                                              01980000
DS1DSSN  EQU   IECSDSL1+45                                              01981000
DS1VOLSQ EQU   IECSDSL1+51                                              01982000
DS1CREDT EQU   IECSDSL1+53                                              01983000
DS1EXPDT EQU   IECSDSL1+56                                              01984000
DS1NOEPV EQU   IECSDSL1+59                                              01985000
DS1NOBDB EQU   IECSDSL1+60                                              01986000
DS1SYSCD EQU   IECSDSL1+62                                              01987000
DS1DSORG EQU   IECSDSL1+82                                              01988000
DS1RECFM EQU   IECSDSL1+84                                              01989000
DS1OPTCD EQU   IECSDSL1+85                                              01990000
DS1BLKL  EQU   IECSDSL1+86                                              01991000
DS1LRECL EQU   IECSDSL1+88                                              01992000
DS1KEYL  EQU   IECSDSL1+90                                              01993000
DS1RKP   EQU   IECSDSL1+91                                              01994000
DS1SCALO EQU   IECSDSL1+94                                              01995000
DS1LSTAR EQU   IECSDSL1+98                                              01996000
DS1TRBAL EQU   IECSDSL1+101                                             01997000
DS1EXT1  EQU   IECSDSL1+105                                             01998000
DS1EXT2  EQU   IECSDSL1+115                                             01999000
OFFSET   EQU   0                                                        02000000
SYSDEVTB EQU   0                                                        02001000
SCYL     EQU   SYSDEVTB                                                 02002000
STRK     EQU   SYSDEVTB+2                                               02003000
STRKCAP  EQU   SYSDEVTB+4                                               02004000
SRCDO    EQU   SYSDEVTB+6                                               02005000
SIRCDO   EQU   SRCDO                                                    02006000
SLRCDO   EQU   SRCDO+1                                                  02007000
SKEY     EQU   SYSDEVTB+8                                               02008000
SFLAG    EQU   SYSDEVTB+9                                               02009000
SILEQ    EQU   SFLAG                                                    02010000
SFTOLER  EQU   SFLAG                                                    02011000
STOLER   EQU   SYSDEVTB+10                                              02012000
CALLER   EQU   0                                                        02013000
UCBBGN   EQU   0                                                        02014000
AVDSORG  EQU   DS1DSORG                                                 02015000
DS1PDS   EQU   AVDSORG                                                  02016000
AVLSTAR  EQU   DS1LSTAR                                                 02017000
AVLBPTRK EQU   AVLSTAR                                                  02018000
AVLBPRCD EQU   AVLSTAR+2                                                02019000
CVTS01   EQU   CVTPGSIA                                                 02020000
CVTLPDIA EQU   CVTS01+12                                                02021000
CVTDIRST EQU   CVTLPDIA                                                 02022000
CVTSLIDA EQU   CVTS01+24                                                02023000
CVTCTLFG EQU   CVTS01+50                                                02024000
CVTEXPRO EQU   CVTS01+260                                               02025000
CVTRV210 EQU   CVTS01+424                                               02026000
CVTRV219 EQU   CVTS01+425                                               02027000
CVTRV228 EQU   CVTS01+426                                               02028000
CVTRV237 EQU   CVTS01+427                                               02029000
CVTMFRTR EQU   CVTS01+452                                               02030000
CVTRV262 EQU   CVTS01+468                                               02031000
CVTRV271 EQU   CVTS01+469                                               02032000
CVTRV280 EQU   CVTS01+470                                               02033000
CVTRV289 EQU   CVTS01+471                                               02034000
CVTGSDA  EQU   CVTS01+600                                               02035000
AVAMWA   EQU   ADSCBF4                                                  02036000
AVJFCB   EQU   AVAMWA                                                   02037000
AVDEVTYP EQU   AVAMWA+176                                               02038000
AVDEVTBL EQU   AVAMWA+180                                               02039000
AVNUMCYL EQU   AVDEVTBL                                                 02040000
AVNUMTRK EQU   AVDEVTBL+2                                               02041000
AVIRCDO  EQU   AVDEVTBL+4                                               02042000
AVIBT1   EQU   AVIRCDO                                                  02043000
AVIBT2   EQU   AVIRCDO+1                                                02044000
AVLRCDO  EQU   AVDEVTBL+6                                               02045000
AVLBT1   EQU   AVLRCDO                                                  02046000
AVLBT2   EQU   AVLRCDO+1                                                02047000
AVKEYCON EQU   AVDEVTBL+8                                               02048000
AVFLAGS  EQU   AVDEVTBL+9                                               02049000
AVTOLER  EQU   AVDEVTBL+10                                              02050000
SAV14B   EQU   AVAMWA+192                                               02051000
SAV14C   EQU   AVAMWA+196                                               02052000
SAV14D   EQU   AVAMWA+200                                               02053000
SAV14E   EQU   AVAMWA+204                                               02054000
AVCYLST  EQU   AVAMWA+208                                               02055000
AVHEADST EQU   AVAMWA+210                                               02056000
AVABSTRK EQU   AVAMWA+212                                               02057000
AVLDBBYT EQU   AVAMWA+214                                               02058000
AVDBBYTS EQU   AVAMWA+216                                               02059000
AVFULTRK EQU   AVAMWA+220                                               02060000
AVDIRNF  EQU   AVAMWA+224                                               02061000
AVTRKPRI EQU   AVAMWA+228                                               02062000
AVNODSTK EQU   AVAMWA+232                                               02063000
AVABLLRB EQU   AVAMWA+236                                               02064000
AVABLRB  EQU   AVAMWA+240                                               02065000
AVABLRTK EQU   AVAMWA+244                                               02066000
AVABLPRT EQU   AVAMWA+248                                               02067000
AVBLKSNF EQU   AVAMWA+252                                               02068000
AVNLBYTS EQU   AVAMWA+256                                               02069000
AVVOLTRK EQU   AVAMWA+260                                               02070000
AVAVAILT EQU   AVAMWA+262                                               02071000
AVULABST EQU   AVAMWA+264                                               02072000
AVABSLTA EQU   AVAMWA+266                                               02073000
AVABLMXT EQU   AVAMWA+268                                               02074000
AVDTI    EQU   AVAMWA+270                                               02075000
AVTRKCAP EQU   VDSTRKSI                                                 02076000
AVDIRBT  EQU   AVLDBBYT                                                 02077000
TRKBALNC EQU   DS1TRBAL                                                 02078000
AVLBPTBA EQU   TRKBALNC                                                 02079000
AVLBPTRB EQU   AVLBPTBA                                                 02080000
AVABLSTK EQU   AVNLBYTS                                                 02081000
AVABLPRI EQU   AVABLLRB                                                 02082000
AVABLSEC EQU   AVABLRTK                                                 02083000
JSCBSEC2 EQU   JSCBEND1                                                 02084000
JSCBSEC3 EQU   JSCBEND1                                                 02085000
JSCBJCT  EQU   JSCBSEC3                                                 02086000
JSCBJCTA EQU   JSCBJCT+1                                                02087000
JSCBASID EQU   JSCBSEC3+8                                               02088000
JSCBFBYT EQU   JSCBSEC3+10                                              02089000
JSCBJNL  EQU   JSCBSEC3+28                                              02090000
JSCBJJSB EQU   JSCBJNL                                                  02091000
JSCBSUB  EQU   JSCBSEC3+40                                              02092000
JSCSCT   EQU   JSCBSEC3+68                                              02093000
JSCBSWSP EQU   JSCBSEC3+87                                              02094000
JSCBACT  EQU   JSCBSEC3+88                                              02095000
JSCRSV45 EQU   JSCBSEC3+112                                             02096000
JSCRSV46 EQU   JSCRSV45                                                 02097000
JSCRSV47 EQU   JSCRSV45+2                                               02098000
JFCKEYLE EQU   JFCTRTCH                                                 02099000
JFCCODE  EQU   JFCKEYLE                                                 02100000
JFCSTACK EQU   JFCTRTCH                                                 02101000
JFCMODE  EQU   JFCSTACK                                                 02102000
JFCSPPRT EQU   JFCTRTCH                                                 02103000
JFCBABFS EQU   JFCSPPRT+2                                               02104000
JFCLIMCT EQU   JFCBABFS                                                 02105000
JFCDSORG EQU   JFCSPPRT+5                                               02106000
JFCDSRG1 EQU   JFCDSORG                                                 02107000
JFCDSRG2 EQU   JFCDSORG+1                                               02108000
JFCRECFM EQU   JFCSPPRT+7                                               02109000
JFCRCFM  EQU   JFCRECFM                                                 02110000
JFCOPTCD EQU   JFCSPPRT+8                                               02111000
JFCWVCSP EQU   JFCOPTCD                                                 02112000
JFCWVCIS EQU   JFCWVCSP                                                 02113000
JFCWVCBD EQU   JFCWVCIS                                                 02114000
JFCALLOW EQU   JFCOPTCD                                                 02115000
JFCRSV17 EQU   JFCALLOW                                                 02116000
JFCOVER  EQU   JFCRSV17                                                 02117000
JFCPCIBT EQU   JFCOPTCD                                                 02118000
JFCMAST  EQU   JFCPCIBT                                                 02119000
JFCEXT   EQU   JFCMAST                                                  02120000
JFCBCKPT EQU   JFCOPTCD                                                 02121000
JFCIND   EQU   JFCBCKPT                                                 02122000
JFCRSV18 EQU   JFCOPTCD                                                 02123000
JFCCYL   EQU   JFCRSV18                                                 02124000
JFCACT   EQU   JFCCYL                                                   02125000
JFCREDUC EQU   JFCOPTCD                                                 02126000
JFCRSV19 EQU   JFCREDUC                                                 02127000
JFCRSV20 EQU   JFCRSV19                                                 02128000
JFCRSV21 EQU   JFCOPTCD                                                 02129000
JFCDEL   EQU   JFCRSV21                                                 02130000
JFCOPTJ  EQU   JFCOPTCD                                                 02131000
JFCREORG EQU   JFCOPTJ                                                  02132000
JFCBLKSI EQU   JFCSPPRT+9                                               02133000
JFCBUFSI EQU   JFCBLKSI                                                 02134000
JFCAMSYN EQU   JFCSPPRT+11                                              02135000
JFCLRECL EQU   JFCAMSYN                                                 02136000
JFCNCP   EQU   JFCAMSYN+2                                               02137000
JFCNTM   EQU   JFCAMSYN+3                                               02138000
JFCBFSEQ EQU   JFCNTM                                                   02139000
JFCPCI   EQU   JFCBFSEQ                                                 02140000
JFCRESRV EQU   JFCAMSYN+4                                               02141000
JFCRKP   EQU   JFCRESRV                                                 02142000
JFCUCSEG EQU   JFCRESRV                                                 02143000
JFCUCSOP EQU   JFCUCSEG+4                                               02144000
JFCOUTLI EQU   JFCUCSEG+5                                               02145000
JFCTHRSH EQU   JFCOUTLI                                                 02146000
JFCCPRI  EQU   JFCTHRSH                                                 02147000
JFCBVOLS EQU   JFCUCSEG+10                                              02148000
JFCBS001 EQU   JFCBVOLS                                                 02149000
JFCBPQTY EQU   JFCBS001+34                                              02150000
JFCBCTRI EQU   JFCBS001+37                                              02151000
JFCBSPAC EQU   JFCBCTRI                                                 02152000
JFCMIXG  EQU   JFCBCTRI                                                 02153000
JFCALX   EQU   JFCBCTRI                                                 02154000
JFCROUND EQU   JFCBCTRI                                                 02155000
JFCBSQTY EQU   JFCBS001+38                                              02156000
JFCFLGS1 EQU   JFCBS001+41                                              02157000
JFCBDQTY EQU   JFCBS001+42                                              02158000
JFCBABST EQU   JFCBS001+48                                              02159000
JFCBDRLH EQU   JFCBS001+53                                              02160000
UCBOBS01 EQU   UCBDEV                                                   02161000
UCBVOLI  EQU   UCBOBS01+4                                               02162000
UCBSTAB  EQU   UCBOBS01+10                                              02163000
UCBBSVL  EQU   UCBSTAB                                                  02164000
UCBPRSRS EQU   UCBSTAB                                                  02165000
UCBBPRV  EQU   UCBSTAB                                                  02166000
UCBDMCT  EQU   UCBOBS01+11                                              02167000
UCBFL4   EQU   UCBOBS01+13                                              02168000
UCBOBS02 EQU   UCBDEV                                                   02169000
UCBTFL1  EQU   UCBOBS02+19                                              02170000
UCBXTN   EQU   UCBOBS02+20                                              02171000
UCBVOPT  EQU   UCBXTN                                                   02172000
UCBOBS03 EQU   UCBDEV                                                   02173000
UCBXTADR EQU   UCBOBS03                                                 02174000
UCBOBS04 EQU   UCBDEV                                                   02175000
UCBBTA   EQU   UCBOBS04+12                                              02176000
UCBOBS06 EQU   UCBDEV                                                   02177000
UCBAOF   EQU   UCBOBS06                                                 02178000
UCBAOF1  EQU   UCBAOF                                                   02179000
UCBAOF2  EQU   UCBAOF+1                                                 02180000
@NM00020 EQU   UCBOBS06+3                                               02181000
UCBIRB   EQU   UCBOBS06+4                                               02182000
UCBGRAF  EQU   UCBIRB                                                   02183000
UCBLDNCA EQU   UCBOBS06+8                                               02184000
UCBRDYQ  EQU   UCBLDNCA                                                 02185000
UCBIRLN  EQU   UCBRDYQ                                                  02186000
UCBLDNCB EQU   UCBRDYQ+1                                                02187000
UCBCTLNK EQU   UCBOBS06+12                                              02188000
UCBOBS07 EQU   UCBDEV                                                   02189000
UCBOBS08 EQU   UCBDEV                                                   02190000
UCBCTCAD EQU   UCBOBS08                                                 02191000
UCBCTCF1 EQU   UCBOBS08+4                                               02192000
UCBOBS09 EQU   UCBDEV                                                   02193000
DUMYJFCB EQU   INFMJFCB                                                 02194000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02195000
UCBRV066 EQU   UCBOBS09+4                                               02196000
UCBIOSBA EQU   UCBOBS09                                                 02197000
UCBRV042 EQU   UCBOBS08+5                                               02198000
UCBRV082 EQU   UCBCTCF1                                                 02199000
UCBRV081 EQU   UCBCTCF1                                                 02200000
UCBRV080 EQU   UCBCTCF1                                                 02201000
UCBRV079 EQU   UCBCTCF1                                                 02202000
UCBRV078 EQU   UCBCTCF1                                                 02203000
UCBRV077 EQU   UCBCTCF1                                                 02204000
UCBRV076 EQU   UCBCTCF1                                                 02205000
UCBCTC80 EQU   UCBCTCF1                                                 02206000
UCBCTCAL EQU   UCBCTCAD                                                 02207000
UCBICNCB EQU   UCBOBS07+4                                               02208000
UCBRV040 EQU   UCBOBS07                                                 02209000
UCBCTLNA EQU   UCBCTLNK+1                                               02210000
UCBRLN   EQU   UCBCTLNK                                                 02211000
UCBRDYQA EQU   UCBLDNCB                                                 02212000
UCBINRLN EQU   UCBIRLN                                                  02213000
UCBIRBA  EQU   UCBIRB+1                                                 02214000
UCBRV039 EQU   UCBGRAF                                                  02215000
UCBDWNR  EQU   UCBGRAF                                                  02216000
UCBRPND  EQU   UCBGRAF                                                  02217000
UCBUPM   EQU   UCBGRAF                                                  02218000
UCBBTAM  EQU   UCBGRAF                                                  02219000
UCBDRNO  EQU   UCBGRAF                                                  02220000
UCBDRO   EQU   UCBGRAF                                                  02221000
UCBOIP   EQU   UCBGRAF                                                  02222000
UCBATRCD EQU   @NM00020                                                 02223000
UCBSKPFG EQU   @NM00020                                                 02224000
UCBRIPND EQU   @NM00020                                                 02225000
UCBRTIAC EQU   @NM00020                                                 02226000
UCBRSV79 EQU   @NM00020                                                 02227000
UCBRSV78 EQU   @NM00020                                                 02228000
UCBRSV77 EQU   @NM00020                                                 02229000
UCBOLTEP EQU   @NM00020                                                 02230000
UCBATNCT EQU   UCBOBS06+2                                               02231000
UCBRSV76 EQU   UCBAOF2                                                  02232000
UCBRSV75 EQU   UCBAOF2                                                  02233000
UCBRSV74 EQU   UCBAOF2                                                  02234000
UCBRSV73 EQU   UCBAOF2                                                  02235000
UCBRSV72 EQU   UCBAOF2                                                  02236000
UCBRSV71 EQU   UCBAOF2                                                  02237000
UCBRSV70 EQU   UCBAOF2                                                  02238000
UCBRSV69 EQU   UCBAOF2                                                  02239000
UCBRSV68 EQU   UCBAOF1                                                  02240000
UCBRSV67 EQU   UCBAOF1                                                  02241000
UCBRSV66 EQU   UCBAOF1                                                  02242000
UCBRSV65 EQU   UCBAOF1                                                  02243000
UCBRSV64 EQU   UCBAOF1                                                  02244000
UCBOFNL  EQU   UCBAOF1                                                  02245000
UCBOFSP  EQU   UCBAOF1                                                  02246000
UCBOFMCR EQU   UCBAOF1                                                  02247000
UCBBTB   EQU   UCBBTA+1                                                 02248000
UCBDI    EQU   UCBBTA                                                   02249000
UCBSNS   EQU   UCBOBS04+8                                               02250000
UCBTEB   EQU   UCBOBS04+4                                               02251000
UCBGCB   EQU   UCBOBS04+3                                               02252000
UCBOPEN  EQU   UCBOBS04+2                                               02253000
UCBSTART EQU   UCBOBS04                                                 02254000
UCBXTNB  EQU   UCBXTN+1                                                 02255000
UCBRSV22 EQU   UCBVOPT                                                  02256000
UCBRSV21 EQU   UCBVOPT                                                  02257000
UCBRSV20 EQU   UCBVOPT                                                  02258000
UCBESVE  EQU   UCBVOPT                                                  02259000
UCBERPC  EQU   UCBVOPT                                                  02260000
UCBESVC  EQU   UCBVOPT                                                  02261000
UCBEVA   EQU   UCBVOPT                                                  02262000
UCBESV   EQU   UCBVOPT                                                  02263000
UCBRV009 EQU   UCBTFL1                                                  02264000
UCBRV008 EQU   UCBTFL1                                                  02265000
UCBRV007 EQU   UCBTFL1                                                  02266000
UCBRV006 EQU   UCBTFL1                                                  02267000
UCBRV005 EQU   UCBTFL1                                                  02268000
UCBRV038 EQU   UCBTFL1                                                  02269000
UCBNSLTP EQU   UCBTFL1                                                  02270000
UCBNLTP  EQU   UCBTFL1                                                  02271000
UCBRES1B EQU   UCBOBS02+18                                              02272000
UCBFSER  EQU   UCBOBS02+12                                              02273000
@NM00019 EQU   UCBOBS02+4                                               02274000
UCBFSEQ  EQU   UCBOBS02+2                                               02275000
UCBFSCT  EQU   UCBOBS02                                                 02276000
UCBNEXP  EQU   UCBOBS01+20                                              02277000
UCBBASE  EQU   UCBOBS01+16                                              02278000
UCBRES1A EQU   UCBOBS01+15                                              02279000
UCBUSER  EQU   UCBOBS01+14                                              02280000
UCBFL47  EQU   UCBFL4                                                   02281000
UCBFL46  EQU   UCBFL4                                                   02282000
UCBFL45  EQU   UCBFL4                                                   02283000
UCBRV065 EQU   UCBFL4                                                   02284000
UCBDSS   EQU   UCBFL4                                                   02285000
UCBRESVP EQU   UCBFL4                                                   02286000
UCBWDAV  EQU   UCBFL4                                                   02287000
UCBDAVV  EQU   UCBFL4                                                   02288000
UCBSQC   EQU   UCBOBS01+12                                              02289000
UCBDATP  EQU   UCBOBS01+12                                              02290000
UCBDMC   EQU   UCBDMCT                                                  02291000
UCBMOUNT EQU   UCBDMCT                                                  02292000
UCBBNUL  EQU   UCBSTAB                                                  02293000
UCBSHAR  EQU   UCBSTAB                                                  02294000
UCBBSTR  EQU   UCBSTAB                                                  02295000
UCBBPUB  EQU   UCBSTAB                                                  02296000
UCBBALB  EQU   UCBPRSRS                                                 02297000
UCBPGFL  EQU   UCBSTAB                                                  02298000
UCBDVSHR EQU   UCBBSVL                                                  02299000
UCBVTOC  EQU   UCBOBS01                                                 02300000
JFCBEND  EQU   JFCBS001+58                                              02301000
JFCBSPTN EQU   JFCBS001+57                                              02302000
JFCBVLCT EQU   JFCBS001+56                                              02303000
JFCBSBNM EQU   JFCBS001+50                                              02304000
JFCBSPNM EQU   JFCBS001+45                                              02305000
JFCBUAFF EQU   JFCFLGS1                                                 02306000
JFCRSV45 EQU   JFCFLGS1                                                 02307000
JFCVRDS  EQU   JFCFLGS1                                                 02308000
JFCBCEOV EQU   JFCFLGS1                                                 02309000
JFCRSV42 EQU   JFCFLGS1                                                 02310000
JFCBADSP EQU   JFCFLGS1                                                 02311000
JFCTOPEN EQU   JFCFLGS1                                                 02312000
JFCBDLET EQU   JFCFLGS1                                                 02313000
JFCRQID  EQU   JFCBSQTY                                                 02314000
JFCONTIG EQU   JFCBCTRI                                                 02315000
JFCRSV29 EQU   JFCBCTRI                                                 02316000
JFCBMSGP EQU   JFCBCTRI                                                 02317000
JFCRUNIT EQU   JFCBPQTY                                                 02318000
JFCBEXAD EQU   JFCBS001+31                                              02319000
JFCBEXTL EQU   JFCBS001+30                                              02320000
JFCMSVGP EQU   JFCBS001+22                                              02321000
@NM00017 EQU   JFCBS001                                                 02322000
JFCAVOLS EQU   JFCBVOLS                                                 02323000
JFCBNVOL EQU   JFCUCSEG+9                                               02324000
JFCBNTCS EQU   JFCUCSEG+8                                               02325000
JFCSOWA  EQU   JFCOUTLI+1                                               02326000
JFCSEND  EQU   JFCCPRI                                                  02327000
JFCEQUAL EQU   JFCCPRI                                                  02328000
JFCRECV  EQU   JFCCPRI                                                  02329000
JFCRSV34 EQU   JFCCPRI                                                  02330000
JFCRSV33 EQU   JFCCPRI                                                  02331000
JFCRSV55 EQU   JFCCPRI                                                  02332000
JFCRSV54 EQU   JFCCPRI                                                  02333000
JFCRSV53 EQU   JFCCPRI                                                  02334000
JFCRSV27 EQU   JFCUCSOP                                                 02335000
JFCRSV26 EQU   JFCUCSOP                                                 02336000
JFCFCBVR EQU   JFCUCSOP                                                 02337000
JFCFCBAL EQU   JFCUCSOP                                                 02338000
JFCVER   EQU   JFCUCSOP                                                 02339000
JFCRSV25 EQU   JFCUCSOP                                                 02340000
JFCFOLD  EQU   JFCUCSOP                                                 02341000
JFCBEXTP EQU   JFCUCSOP                                                 02342000
JFCUCSID EQU   JFCUCSEG                                                 02343000
JFCINTVL EQU   JFCSPPRT+19                                              02344000
JFCDBUFN EQU   JFCRESRV+3                                               02345000
JFCCYLOF EQU   JFCRESRV+2                                               02346000
JFCPCIR2 EQU   JFCPCI                                                   02347000
JFCPCIR1 EQU   JFCPCI                                                   02348000
JFCPCIN2 EQU   JFCPCI                                                   02349000
JFCPCIN1 EQU   JFCPCI                                                   02350000
JFCPCIA2 EQU   JFCPCI                                                   02351000
JFCPCIA1 EQU   JFCPCI                                                   02352000
JFCPCIX2 EQU   JFCPCI                                                   02353000
JFCPCIX1 EQU   JFCPCI                                                   02354000
JFCBUFMX EQU   JFCNCP                                                   02355000
JFCBAXBF EQU   JFCBUFSI                                                 02356000
JFCREL   EQU   JFCREORG                                                 02357000
JFCRSV22 EQU   JFCDEL                                                   02358000
JFCSRCHD EQU   JFCRSV20                                                 02359000
JFCOPTQ  EQU   JFCACT                                                   02360000
JFCFEED  EQU   JFCIND                                                   02361000
JFCCBWU  EQU   JFCEXT                                                   02362000
JFCWUMSG EQU   JFCOVER                                                  02363000
JFCSDNAM EQU   JFCWVCBD                                                 02364000
@NM00016 EQU   JFCRECFM                                                 02365000
JFCCHAR  EQU   JFCRECFM                                                 02366000
JFCRFS   EQU   JFCRECFM                                                 02367000
JFCRFB   EQU   JFCRECFM                                                 02368000
JFCRFO   EQU   JFCRCFM                                                  02369000
JFCFMREC EQU   JFCRCFM                                                  02370000
JFCRSV16 EQU   JFCDSRG2                                                 02371000
JFCRSV15 EQU   JFCDSRG2                                                 02372000
JFCORGTR EQU   JFCDSRG2                                                 02373000
JFCORGAM EQU   JFCDSRG2                                                 02374000
JFCRSV13 EQU   JFCDSRG2                                                 02375000
JFCORGTQ EQU   JFCDSRG2                                                 02376000
JFCORGTX EQU   JFCDSRG2                                                 02377000
JFCORGGS EQU   JFCDSRG2                                                 02378000
JFCORGU  EQU   JFCDSRG1                                                 02379000
JFCORGPO EQU   JFCDSRG1                                                 02380000
JFCORGMQ EQU   JFCDSRG1                                                 02381000
JFCORGCQ EQU   JFCDSRG1                                                 02382000
JFCORGCX EQU   JFCDSRG1                                                 02383000
JFCORGDA EQU   JFCDSRG1                                                 02384000
JFCORGPS EQU   JFCDSRG1                                                 02385000
JFCORGIS EQU   JFCDSRG1                                                 02386000
JFCTRKBL EQU   JFCLIMCT+1                                               02387000
@NM00015 EQU   JFCLIMCT                                                 02388000
JFCDEN   EQU   JFCSPPRT+1                                               02389000
JFCPRTSP EQU   JFCSPPRT                                                 02390000
JFCONE   EQU   JFCMODE                                                  02391000
JFCTWO   EQU   JFCMODE                                                  02392000
JFCRSV07 EQU   JFCMODE                                                  02393000
JFCRSV06 EQU   JFCMODE                                                  02394000
JFCMODER EQU   JFCMODE                                                  02395000
JFCMODEO EQU   JFCMODE                                                  02396000
JFCEBCD  EQU   JFCMODE                                                  02397000
JFCBIN   EQU   JFCMODE                                                  02398000
JFCRSV32 EQU   JFCCODE                                                  02399000
JFCTTY   EQU   JFCCODE                                                  02400000
JFCASCII EQU   JFCCODE                                                  02401000
JFCNCR   EQU   JFCCODE                                                  02402000
JFCBUR   EQU   JFCCODE                                                  02403000
JFCFRI   EQU   JFCCODE                                                  02404000
JFCBCD   EQU   JFCCODE                                                  02405000
JFCNOCON EQU   JFCCODE                                                  02406000
JSCBEND3 EQU   JSCBSEC3+120                                             02407000
JSCRSV52 EQU   JSCBSEC3+116                                             02408000
JSCRSV51 EQU   JSCRSV47+1                                               02409000
JSCRSV50 EQU   JSCRSV47                                                 02410000
JSCRSV49 EQU   JSCRSV46+1                                               02411000
JSCRSV48 EQU   JSCRSV46                                                 02412000
JSCRSV44 EQU   JSCBSEC3+108                                             02413000
JSCRSV43 EQU   JSCBSEC3+104                                             02414000
JSCRSV42 EQU   JSCBSEC3+100                                             02415000
JSCBASWA EQU   JSCBSEC3+96                                              02416000
JSCBUFPT EQU   JSCBSEC3+92                                              02417000
JSCRSV33 EQU   JSCBSEC3+86                                              02418000
JSCDDNUM EQU   JSCBSEC3+84                                              02419000
JSCRSV53 EQU   JSCBSEC3+82                                              02420000
JSCDDNNO EQU   JSCBSEC3+80                                              02421000
JSCBVATA EQU   JSCBSEC3+76                                              02422000
JSCTMCOR EQU   JSCBSEC3+72                                              02423000
JSCSCTP  EQU   JSCSCT+1                                                 02424000
JSCRSV55 EQU   JSCSCT                                                   02425000
JSCRSV54 EQU   JSCBSEC3+64                                              02426000
JSCDSABQ EQU   JSCBSEC3+60                                              02427000
JSCBSSIB EQU   JSCBSEC3+56                                              02428000
JSCBFRBA EQU   JSCBSEC3+48                                              02429000
JSCRSV28 EQU   JSCBSEC3+46                                              02430000
JSCBSONO EQU   JSCBSEC3+44                                              02431000
JSCBSUBA EQU   JSCBSUB+1                                                02432000
JSCRSV31 EQU   JSCBSUB                                                  02433000
JSCBSMLR EQU   JSCBSEC3+36                                              02434000
JSCBJNLR EQU   JSCBSEC3+32                                              02435000
JSCBJNLA EQU   JSCBJNL+1                                                02436000
JSCBJSBT EQU   JSCBJJSB                                                 02437000
JSCBJSBX EQU   JSCBJJSB                                                 02438000
JSCBJSBA EQU   JSCBJJSB                                                 02439000
JSCBJSBI EQU   JSCBJJSB                                                 02440000
@NM00013 EQU   JSCBJJSB                                                 02441000
JSCBJNLE EQU   JSCBJJSB                                                 02442000
JSCBJNLF EQU   JSCBJJSB                                                 02443000
JSCBJNLN EQU   JSCBJJSB                                                 02444000
@NM00012 EQU   JSCBSEC3+24                                              02445000
JSCBJRBA EQU   JSCBSEC3+16                                              02446000
JSCBIECB EQU   JSCBSEC3+12                                              02447000
JSCBRV08 EQU   JSCBSEC3+11                                              02448000
JSCBRV07 EQU   JSCBFBYT                                                 02449000
JSCBRV06 EQU   JSCBFBYT                                                 02450000
JSCBRV05 EQU   JSCBFBYT                                                 02451000
JSCBRV04 EQU   JSCBFBYT                                                 02452000
JSCBRV03 EQU   JSCBFBYT                                                 02453000
JSCBRV02 EQU   JSCBFBYT                                                 02454000
JSCBADSP EQU   JSCBFBYT                                                 02455000
JSCBRV01 EQU   JSCBFBYT                                                 02456000
JSCBTJID EQU   JSCBASID                                                 02457000
JSCBPSCB EQU   JSCBSEC3+4                                               02458000
JSCJCTP  EQU   JSCBJCTA                                                 02459000
JSCRSV24 EQU   JSCBJCT                                                  02460000
JSCBEND2 EQU   JSCBSEC2                                                 02461000
AVFILR   EQU   AVFLAGS                                                  02462000
@NM00009 EQU   AVFLAGS                                                  02463000
CVTRV628 EQU   CVTS01+728                                               02464000
CVTRV627 EQU   CVTS01+724                                               02465000
CVTRV626 EQU   CVTS01+720                                               02466000
CVTRV625 EQU   CVTS01+716                                               02467000
CVTRV624 EQU   CVTS01+712                                               02468000
CVTRV623 EQU   CVTS01+708                                               02469000
CVTRV622 EQU   CVTS01+704                                               02470000
CVTRV621 EQU   CVTS01+700                                               02471000
CVTIHASU EQU   CVTS01+696                                               02472000
CVTRV619 EQU   CVTS01+692                                               02473000
CVTRV618 EQU   CVTS01+688                                               02474000
CVTRV617 EQU   CVTS01+684                                               02475000
CVTRV616 EQU   CVTS01+680                                               02476000
CVTRV615 EQU   CVTS01+676                                               02477000
CVTRV614 EQU   CVTS01+672                                               02478000
CVTRV613 EQU   CVTS01+668                                               02479000
CVTTCASP EQU   CVTS01+664                                               02480000
CVT0PT03 EQU   CVTS01+660                                               02481000
CVT0PT0E EQU   CVTS01+656                                               02482000
CVTRV609 EQU   CVTS01+652                                               02483000
CVTCGK   EQU   CVTS01+648                                               02484000
CVTRAC   EQU   CVTS01+644                                               02485000
CVTRV606 EQU   CVTS01+640                                               02486000
CVTRV605 EQU   CVTS01+636                                               02487000
CVTRV604 EQU   CVTS01+632                                               02488000
CVTEFF02 EQU   CVTS01+628                                               02489000
CVTCBBR  EQU   CVTS01+624                                               02490000
CVTSSCR  EQU   CVTS01+620                                               02491000
CVTEVENT EQU   CVTS01+616                                               02492000
CVTCRCA  EQU   CVTS01+612                                               02493000
CVTTPIO  EQU   CVTS01+608                                               02494000
CVTADV   EQU   CVTS01+604                                               02495000
CVTGSDAB EQU   CVTGSDA                                                  02496000
CVTQV3   EQU   CVTS01+596                                               02497000
CVTQV2   EQU   CVTS01+592                                               02498000
CVTQV1   EQU   CVTS01+588                                               02499000
CVTRPT   EQU   CVTS01+584                                               02500000
CVTSSRB  EQU   CVTS01+580                                               02501000
CVTCSDRL EQU   CVTS01+576                                               02502000
CVTEXP1  EQU   CVTS01+572                                               02503000
CVTRMPMT EQU   CVTS01+568                                               02504000
CVTRMPTT EQU   CVTS01+564                                               02505000
CVTVPSA  EQU   CVTS01+560                                               02506000
CVTVSTOP EQU   CVTS01+556                                               02507000
CVTGTFR8 EQU   CVTS01+552                                               02508000
CVTQUIT  EQU   CVTS01+548                                               02509000
CVTVACR  EQU   CVTS01+544                                               02510000
CVTWTCB  EQU   CVTS01+540                                               02511000
CVTSTPRS EQU   CVTS01+536                                               02512000
CVT0PT02 EQU   CVTS01+532                                               02513000
CVTDARCM EQU   CVTS01+528                                               02514000
CVTIRECM EQU   CVTS01+524                                               02515000
CVTJRECM EQU   CVTS01+520                                               02516000
CVTVEMS0 EQU   CVTS01+516                                               02517000
CVTSPFRR EQU   CVTS01+512                                               02518000
CVTRLSTG EQU   CVTS01+508                                               02519000
CVT0TC0A EQU   CVTS01+504                                               02520000
CVTGMBR  EQU   CVTS01+500                                               02521000
CVTLFRM  EQU   CVTS01+496                                               02522000
CVTRMBR  EQU   CVTS01+492                                               02523000
CVTVIOP  EQU   CVTS01+488                                               02524000
CVTRV307 EQU   CVTS01+486                                               02525000
CVTRV306 EQU   CVTS01+484                                               02526000
CVTRV305 EQU   CVTS01+482                                               02527000
CVTRV304 EQU   CVTS01+480                                               02528000
CVTRV303 EQU   CVTS01+478                                               02529000
CVTRV302 EQU   CVTS01+476                                               02530000
CVTTRCA  EQU   CVTS01+472                                               02531000
CVTRV297 EQU   CVTRV289                                                 02532000
CVTRV296 EQU   CVTRV289                                                 02533000
CVTRV295 EQU   CVTRV289                                                 02534000
CVTRV294 EQU   CVTRV289                                                 02535000
CVTRV293 EQU   CVTRV289                                                 02536000
CVTRV292 EQU   CVTRV289                                                 02537000
CVTRV291 EQU   CVTRV289                                                 02538000
CVTRV290 EQU   CVTRV289                                                 02539000
CVTRV288 EQU   CVTRV280                                                 02540000
CVTRV287 EQU   CVTRV280                                                 02541000
CVTRV286 EQU   CVTRV280                                                 02542000
CVTRV285 EQU   CVTRV280                                                 02543000
CVTRV284 EQU   CVTRV280                                                 02544000
CVTRV283 EQU   CVTRV280                                                 02545000
CVTRV282 EQU   CVTRV280                                                 02546000
CVTRV281 EQU   CVTRV280                                                 02547000
CVTRV279 EQU   CVTRV271                                                 02548000
CVTRV278 EQU   CVTRV271                                                 02549000
CVTRV277 EQU   CVTRV271                                                 02550000
CVTRV276 EQU   CVTRV271                                                 02551000
CVTRV275 EQU   CVTRV271                                                 02552000
CVTRV274 EQU   CVTRV271                                                 02553000
CVTRV273 EQU   CVTRV271                                                 02554000
CVTRV272 EQU   CVTRV271                                                 02555000
CVTRV270 EQU   CVTRV262                                                 02556000
CVTRV269 EQU   CVTRV262                                                 02557000
CVTRV268 EQU   CVTRV262                                                 02558000
CVTRV267 EQU   CVTRV262                                                 02559000
CVTRV266 EQU   CVTRV262                                                 02560000
CVTRV265 EQU   CVTRV262                                                 02561000
CVTRV264 EQU   CVTRV262                                                 02562000
CVTRV263 EQU   CVTRV262                                                 02563000
CVTVFP   EQU   CVTS01+464                                               02564000
CVTVSI   EQU   CVTS01+460                                               02565000
CVTVPSIB EQU   CVTS01+456                                               02566000
CVTMFACT EQU   CVTMFRTR                                                 02567000
CVTMFCTL EQU   CVTS01+448                                               02568000
CVTPVBP  EQU   CVTS01+444                                               02569000
CVTPWI   EQU   CVTS01+440                                               02570000
CVTRV254 EQU   CVTS01+438                                               02571000
CVTRV253 EQU   CVTS01+436                                               02572000
CVTRV252 EQU   CVTS01+434                                               02573000
CVTRV251 EQU   CVTS01+433                                               02574000
CVTRV250 EQU   CVTS01+432                                               02575000
CVTRV249 EQU   CVTS01+431                                               02576000
CVTRV248 EQU   CVTS01+430                                               02577000
CVTRV247 EQU   CVTS01+429                                               02578000
CVTRV246 EQU   CVTS01+428                                               02579000
CVTRV245 EQU   CVTRV237                                                 02580000
CVTRV244 EQU   CVTRV237                                                 02581000
CVTRV243 EQU   CVTRV237                                                 02582000
CVTRV242 EQU   CVTRV237                                                 02583000
CVTRV241 EQU   CVTRV237                                                 02584000
CVTRV240 EQU   CVTRV237                                                 02585000
CVTRV239 EQU   CVTRV237                                                 02586000
CVTRV238 EQU   CVTRV237                                                 02587000
CVTRV236 EQU   CVTRV228                                                 02588000
CVTRV235 EQU   CVTRV228                                                 02589000
CVTRV234 EQU   CVTRV228                                                 02590000
CVTRV233 EQU   CVTRV228                                                 02591000
CVTRV232 EQU   CVTRV228                                                 02592000
CVTRV231 EQU   CVTRV228                                                 02593000
CVTRV230 EQU   CVTRV228                                                 02594000
CVTRV229 EQU   CVTRV228                                                 02595000
CVTRV227 EQU   CVTRV219                                                 02596000
CVTRV226 EQU   CVTRV219                                                 02597000
CVTRV225 EQU   CVTRV219                                                 02598000
CVTRV224 EQU   CVTRV219                                                 02599000
CVTRV223 EQU   CVTRV219                                                 02600000
CVTRV222 EQU   CVTRV219                                                 02601000
CVTRV221 EQU   CVTRV219                                                 02602000
CVTRV220 EQU   CVTRV219                                                 02603000
CVTRV218 EQU   CVTRV210                                                 02604000
CVTRV217 EQU   CVTRV210                                                 02605000
CVTRV216 EQU   CVTRV210                                                 02606000
CVTRV215 EQU   CVTRV210                                                 02607000
CVTRV214 EQU   CVTRV210                                                 02608000
CVTRV213 EQU   CVTRV210                                                 02609000
CVTRV212 EQU   CVTRV210                                                 02610000
CVTRV211 EQU   CVTRV210                                                 02611000
CVTLCCAT EQU   CVTS01+420                                               02612000
CVTPCCAT EQU   CVTS01+416                                               02613000
CVTIPCRP EQU   CVTS01+412                                               02614000
CVTIPCRI EQU   CVTS01+408                                               02615000
CVTIPCDS EQU   CVTS01+404                                               02616000
CVTAIDVT EQU   CVTS01+400                                               02617000
CVTSSAP  EQU   CVTS01+396                                               02618000
CVTEHCIR EQU   CVTS01+392                                               02619000
CVTEHDEF EQU   CVTS01+388                                               02620000
CVTDAIR  EQU   CVTS01+384                                               02621000
CVTPERFM EQU   CVTS01+380                                               02622000
CVT044R2 EQU   CVTS01+376                                               02623000
CVTFETCH EQU   CVTS01+372                                               02624000
CVTRSTWD EQU   CVTS01+368                                               02625000
CVTSPOST EQU   CVTS01+364                                               02626000
CVTIOBP  EQU   CVTS01+360                                               02627000
CVTASMVT EQU   CVTS01+356                                               02628000
CVTRECRQ EQU   CVTS01+352                                               02629000
CVTWSAC  EQU   CVTS01+348                                               02630000
CVTRV149 EQU   CVTS01+344                                               02631000
CVTWSAL  EQU   CVTS01+340                                               02632000
CVTSPSA  EQU   CVTS01+336                                               02633000
CVTGLMN  EQU   CVTS01+332                                               02634000
CVTVEAC0 EQU   CVTS01+328                                               02635000
CVT062R1 EQU   CVTS01+324                                               02636000
CVTRPOST EQU   CVTS01+320                                               02637000
CVTDQIQE EQU   CVTS01+316                                               02638000
CVTCSD   EQU   CVTS01+312                                               02639000
CVTLKRMA EQU   CVTS01+308                                               02640000
CVTRSPIE EQU   CVTS01+304                                               02641000
CVTRENQ  EQU   CVTS01+300                                               02642000
CVTLQCB  EQU   CVTS01+296                                               02643000
CVTFQCB  EQU   CVTS01+292                                               02644000
CVTQCS01 EQU   CVTS01+288                                               02645000
CVTAPFT  EQU   CVTS01+284                                               02646000
CVTPARRL EQU   CVTS01+280                                               02647000
CVTVWAIT EQU   CVTS01+276                                               02648000
CVTGSPL  EQU   CVTS01+272                                               02649000
CVTLSMQ  EQU   CVTS01+268                                               02650000
CVTGSMQ  EQU   CVTS01+264                                               02651000
CVTOPCTP EQU   CVTS01+256                                               02652000
CVTSIC   EQU   CVTS01+252                                               02653000
CVTTPIOS EQU   CVTS01+248                                               02654000
CVTRTMS  EQU   CVTS01+244                                               02655000
CVTSDBF  EQU   CVTS01+240                                               02656000
CVTSCBP  EQU   CVTS01+236                                               02657000
CVTSDMP  EQU   CVTS01+232                                               02658000
CVTSV60  EQU   CVTS01+228                                               02659000
CVTRTMCT EQU   CVTS01+224                                               02660000
CVTASCBL EQU   CVTS01+220                                               02661000
CVTASCBH EQU   CVTS01+216                                               02662000
CVTGDA   EQU   CVTS01+212                                               02663000
CVTASVT  EQU   CVTS01+208                                               02664000
CVTVVMDI EQU   CVTS01+204                                               02665000
CVTAQTOP EQU   CVTS01+200                                               02666000
CVTIOSCS EQU   CVTS01+196                                               02667000
CVTSDRM  EQU   CVTS01+192                                               02668000
CVTOPTE  EQU   CVTS01+188                                               02669000
CVTSTXU  EQU   CVTS01+184                                               02670000
CVTQUIS  EQU   CVTS01+180                                               02671000
CVTPARS  EQU   CVTS01+176                                               02672000
CVTS1EE  EQU   CVTS01+172                                               02673000
CVTFRAS  EQU   CVTS01+168                                               02674000
CVTQSAS  EQU   CVTS01+164                                               02675000
CVTCRAS  EQU   CVTS01+160                                               02676000
CVTCRMN  EQU   CVTS01+156                                               02677000
CVTDELCP EQU   CVTS01+152                                               02678000
CVTFRECL EQU   CVTS01+148                                               02679000
CVTGETCL EQU   CVTS01+144                                               02680000
CVTBLDCP EQU   CVTS01+140                                               02681000
CVTAUTHL EQU   CVTS01+136                                               02682000
CVTSCAN  EQU   CVTS01+132                                               02683000
CVTRV144 EQU   CVTS01+130                                               02684000
CVTMAXMP EQU   CVTS01+128                                               02685000
CVTSTCK  EQU   CVTS01+124                                               02686000
CVTRV139 EQU   CVTS01+123                                               02687000
CVTDSSAC EQU   CVTS01+122                                               02688000
CVTRV513 EQU   CVTS01+121                                               02689000
CVTIOSPL EQU   CVTS01+120                                               02690000
CVTPTGT  EQU   CVTS01+116                                               02691000
CVTCSPIE EQU   CVTS01+112                                               02692000
CVTSMFEX EQU   CVTS01+108                                               02693000
CVTOLT0A EQU   CVTS01+104                                               02694000
CVTSRBRT EQU   CVTS01+100                                               02695000
CVTPUTL  EQU   CVTS01+96                                                02696000
CVTASCRL EQU   CVTS01+92                                                02697000
CVTASCRF EQU   CVTS01+88                                                02698000
CVTRV326 EQU   CVTS01+84                                                02699000
CVTRV325 EQU   CVTS01+80                                                02700000
CVTRV324 EQU   CVTS01+76                                                02701000
CVT0VL01 EQU   CVTS01+72                                                02702000
CVTSHRVM EQU   CVTS01+68                                                02703000
CVTRV332 EQU   CVTS01+64                                                02704000
CVTTAS   EQU   CVTS01+60                                                02705000
CVTRSCN  EQU   CVTS01+56                                                02706000
CVTTRAC2 EQU   CVTS01+54                                                02707000
CVTTRACE EQU   CVTS01+52                                                02708000
CVTAPG   EQU   CVTS01+51                                                02709000
CVTSDTRC EQU   CVTCTLFG                                                 02710000
CVTGTRCE EQU   CVTCTLFG                                                 02711000
CVTNOMP  EQU   CVTCTLFG                                                 02712000
CVTRSV79 EQU   CVTCTLFG                                                 02713000
CVTDSTAT EQU   CVTCTLFG                                                 02714000
CVTRSV78 EQU   CVTCTLFG                                                 02715000
CVTRV333 EQU   CVTCTLFG                                                 02716000
CVTRV323 EQU   CVTCTLFG                                                 02717000
CVTSPVLK EQU   CVTS01+49                                                02718000
CVTRSV77 EQU   CVTS01+48                                                02719000
CVTRV331 EQU   CVTS01+44                                                02720000
CVTRV330 EQU   CVTS01+40                                                02721000
CVTRV329 EQU   CVTS01+36                                                02722000
CVTRV328 EQU   CVTS01+32                                                02723000
CVTRV322 EQU   CVTS01+28                                                02724000
CVTSLID  EQU   CVTSLIDA+1                                               02725000
CVTSYLK  EQU   CVTSLIDA                                                 02726000
CVTRV321 EQU   CVTS01+20                                                02727000
CVTRV320 EQU   CVTS01+16                                                02728000
CVTLPDIR EQU   CVTLPDIA+1                                               02729000
CVTRSV69 EQU   CVTDIRST                                                 02730000
CVTRSV68 EQU   CVTDIRST                                                 02731000
CVTRSV67 EQU   CVTDIRST                                                 02732000
CVTRSV66 EQU   CVTDIRST                                                 02733000
CVTRSV65 EQU   CVTDIRST                                                 02734000
CVTRSV64 EQU   CVTDIRST                                                 02735000
CVTRSV63 EQU   CVTDIRST                                                 02736000
CVTDICOM EQU   CVTDIRST                                                 02737000
CVTPVTP  EQU   CVTS01+8                                                 02738000
CVTLPDSR EQU   CVTS01+4                                                 02739000
CVTGETL  EQU   CVTS01                                                   02740000
@NM00001 EQU   AVDSORG                                                  02741000
@NM00027 EQU   SFLAG                                                    02742000
@NM00026 EQU   SFLAG                                                    02743000
DS1END   EQU   IECSDSL1+140                                             02744000
DS1PTRDS EQU   IECSDSL1+135                                             02745000
DS1EXT3  EQU   IECSDSL1+125                                             02746000
@NM00025 EQU   IECSDSL1+103                                             02747000
DS1DSIND EQU   IECSDSL1+93                                              02748000
@NM00024 EQU   IECSDSL1+75                                              02749000
@NM00023 EQU   IECSDSL1+61                                              02750000
@NM00022 EQU   IECSDSF1                                                 02751000
UCBERADR EQU   UCBUCS+12                                                02752000
UCBFCBID EQU   UCBUCS+8                                                 02753000
UCBERCNT EQU   UCBUCS+7                                                 02754000
UCBRSV51 EQU   UCBUCS+6                                                 02755000
UCBRSV50 EQU   UCBFCBOP                                                 02756000
UCBRSV49 EQU   UCBFCBOP                                                 02757000
UCBRSV48 EQU   UCBFCBOP                                                 02758000
UCBRSV47 EQU   UCBFCBOP                                                 02759000
UCBRSV46 EQU   UCBFCBOP                                                 02760000
UCBRSV45 EQU   UCBFCBOP                                                 02761000
UCBRSV44 EQU   UCBFCBOP                                                 02762000
UCBFCBO1 EQU   UCBFCBOP                                                 02763000
UCBUCSPE EQU   UCBUCSOP                                                 02764000
UCBRSV43 EQU   UCBUCSOP                                                 02765000
UCBRSV42 EQU   UCBUCSOP                                                 02766000
UCBRSV41 EQU   UCBUCSOP                                                 02767000
UCBRSV40 EQU   UCBUCSOP                                                 02768000
UCBRSV39 EQU   UCBUCSOP                                                 02769000
UCBUCSO2 EQU   UCBUCSOP                                                 02770000
UCBUCSO1 EQU   UCBUCSOP                                                 02771000
UCBUCSID EQU   UCBUCS                                                   02772000
UCBMDRBA EQU   UCBMDRBF+1                                               02773000
UCBRV075 EQU   UCBMDRBF                                                 02774000
UCBRV074 EQU   UCB3800X+32                                              02775000
UCBIMAGE EQU   UCB3800X+28                                              02776000
UCBFCBNM EQU   UCB3800X+24                                              02777000
UCBCHAR4 EQU   UCB3800X+20                                              02778000
UCBCHAR3 EQU   UCB3800X+16                                              02779000
UCBCHAR2 EQU   UCB3800X+12                                              02780000
UCBCHAR1 EQU   UCB3800X+8                                               02781000
UCBCGMID EQU   UCB3800X+4                                               02782000
UCBBRSTA EQU   UCBACTIV                                                 02783000
UCBRV063 EQU   UCBACTIV                                                 02784000
UCBRV062 EQU   UCBACTIV                                                 02785000
UCBRV061 EQU   UCBACTIV                                                 02786000
UCBRV060 EQU   UCBACTIV                                                 02787000
UCBRV059 EQU   UCBACTIV                                                 02788000
UCBRV058 EQU   UCBACTIV                                                 02789000
UCBRV057 EQU   UCBACTIV                                                 02790000
UCBRV050 EQU   UCB3800X+2                                               02791000
UCBCGMNO EQU   UCB3800X+1                                               02792000
UCBRV083 EQU   UCBOPTNS                                                 02793000
UCBBRSTR EQU   UCBOPTNS                                                 02794000
UCBRV056 EQU   UCBOPTNS                                                 02795000
UCBRV055 EQU   UCBOPTNS                                                 02796000
UCBRV054 EQU   UCBOPTNS                                                 02797000
UCBRV053 EQU   UCBOPTNS                                                 02798000
UCBRV052 EQU   UCBOPTNS                                                 02799000
UCBRV051 EQU   UCBOPTNS                                                 02800000
UCBRV073 EQU   UCB3540X+7                                               02801000
UCBRV072 EQU   UCBDKBYT                                                 02802000
UCBRV071 EQU   UCBDKBYT                                                 02803000
UCBRV070 EQU   UCBDKBYT                                                 02804000
UCBRV069 EQU   UCBDKBYT                                                 02805000
UCBRV068 EQU   UCBDKBYT                                                 02806000
UCBRV067 EQU   UCBDKBYT                                                 02807000
UCBVLVER EQU   UCBDKBYT                                                 02808000
UCBDKAMX EQU   UCBDKBYT                                                 02809000
UCBVLSER EQU   UCB3540X                                                 02810000
UCBRDATA EQU   UCBOCR+4                                                 02811000
UCBFRID  EQU   UCBOCR                                                   02812000
UCBCLN   EQU   UCBMT+14                                                 02813000
UCBERG   EQU   UCBMT+12                                                 02814000
UCBMS    EQU   UCBMT+11                                                 02815000
UCBNB    EQU   UCBMT+10                                                 02816000
UCBPW    EQU   UCBMT+9                                                  02817000
UCBPR    EQU   UCBMT+8                                                  02818000
UCBSIO   EQU   UCBMT+6                                                  02819000
UCBTW    EQU   UCBMT+5                                                  02820000
UCBTR    EQU   UCBMT+4                                                  02821000
UCBTWT   EQU   UCBMT+3                                                  02822000
UCBTRT   EQU   UCBMT+2                                                  02823000
UCBCTD   EQU   UCBMT                                                    02824000
UCBWTOID EQU   UCBCMEXT+17                                              02825000
UCBRV043 EQU   UCBCMEXT+16                                              02826000
UCBASID  EQU   UCBCMEXT+14                                              02827000
UCBMFCNT EQU   UCBCMEXT+12                                              02828000
UCBPMSK  EQU   UCBCMEXT+10                                              02829000
UCBCCWOF EQU   UCBCMEXT+8                                               02830000
UCBRV041 EQU   UCBCMEXT+6                                               02831000
UCBRV036 EQU   UCBFLP1                                                  02832000
UCBRV035 EQU   UCBFLP1                                                  02833000
UCBERLOG EQU   UCBFLP1                                                  02834000
UCBRV033 EQU   UCBFLP1                                                  02835000
UCBRV032 EQU   UCBFLP1                                                  02836000
UCBRV031 EQU   UCBFLP1                                                  02837000
UCBSHRUP EQU   UCBFLP1                                                  02838000
UCBNSRCH EQU   UCBFLP1                                                  02839000
UCBSNSCT EQU   UCBCMEXT+4                                               02840000
UCBHPDV  EQU   @NM00021                                                 02841000
UCBHALI  EQU   @NM00021                                                 02842000
UCBRSV09 EQU   @NM00021                                                 02843000
UCBRSV08 EQU   @NM00021                                                 02844000
UCBRSV07 EQU   @NM00021                                                 02845000
UCBRSV06 EQU   @NM00021                                                 02846000
UCBRSV05 EQU   @NM00021                                                 02847000
UCBRSV04 EQU   @NM00021                                                 02848000
UCBDTI   EQU   UCBCMEXT+2                                               02849000
UCBSTI   EQU   UCBCMEXT+1                                               02850000
UCBETI   EQU   UCBCMEXT                                                 02851000
UCBEXTP  EQU   UCBEXTPT+1                                               02852000
UCBDDRSW EQU   UCBFLC                                                   02853000
UCBTICBT EQU   UCBFLC                                                   02854000
UCBIVRR  EQU   UCBFLC                                                   02855000
UCBIVRS  EQU   UCBFLC                                                   02856000
UCBITF   EQU   UCBFLC                                                   02857000
UCBUDE   EQU   UCBFLC                                                   02858000
UCBWAA   EQU   UCBFLC                                                   02859000
UCBATTP  EQU   UCBFLC                                                   02860000
UCBUNTYP EQU   UCBTBYT4                                                 02861000
UCBRSV11 EQU   UCBDVCLS                                                 02862000
UCBRSV10 EQU   UCBDVCLS                                                 02863000
UCB3CHAR EQU   UCBDVCLS                                                 02864000
UCB3UREC EQU   UCBDVCLS                                                 02865000
UCB3DISP EQU   UCBDVCLS                                                 02866000
UCB3DACC EQU   UCBDVCLS                                                 02867000
UCB3COMM EQU   UCBDVCLS                                                 02868000
UCB3TAPE EQU   UCBDVCLS                                                 02869000
UCBDVPWR EQU   UCB2OPT7                                                 02870000
UCBVLPWR EQU   UCB2OPT6                                                 02871000
UCB2OPT5 EQU   UCBTBYT2                                                 02872000
UCBRPS   EQU   UCBDUDN2                                                 02873000
UCBRR    EQU   UCBDUDN1                                                 02874000
UCB2OPT1 EQU   UCBTBYT2                                                 02875000
UCB2OPT0 EQU   UCBTBYT2                                                 02876000
UCB1FEA7 EQU   UCBTBYT1                                                 02877000
UCBD6250 EQU   UCB1FEA6                                                 02878000
UCBD1600 EQU   UCB1FEA5                                                 02879000
UCB1FEA4 EQU   UCBTBYT1                                                 02880000
UCB1FEA3 EQU   UCBTBYT1                                                 02881000
UCB1FEA2 EQU   UCBTBYT1                                                 02882000
UCB1FEA1 EQU   UCBTBYT1                                                 02883000
UCB1FEA0 EQU   UCBTBYT1                                                 02884000
UCBRV029 EQU   UCBWGT                                                   02885000
UCBVHRSN EQU   UCBWGT                                                   02886000
UCBVORSN EQU   UCBWGT                                                   02887000
UCBMTPXP EQU   UCBWGT                                                   02888000
UCBREW   EQU   UCBWGT                                                   02889000
UCBPUB   EQU   UCBWGT                                                   02890000
UCBOUT   EQU   UCBWGT                                                   02891000
UCBIN    EQU   UCBWGT                                                   02892000
UCBCPU   EQU   UCBOB+11                                                 02893000
UCBLCI   EQU   UCBOB+10                                                 02894000
UCBCNT   EQU   UCBOB+9                                                  02895000
UCBRV017 EQU   UCBCHM1                                                  02896000
UCBRV016 EQU   UCBCHM1                                                  02897000
UCBRV015 EQU   UCBCHM1                                                  02898000
UCBRV014 EQU   UCBCHM1                                                  02899000
UCBSPB   EQU   UCBPTH1                                                  02900000
UCBPPB   EQU   UCBPTH1                                                  02901000
UCBSPA   EQU   UCBPTH0                                                  02902000
UCBPPA   EQU   UCBPTH0                                                  02903000
UCBSIGP  EQU   UCBFLB                                                   02904000
UCBVALPH EQU   UCBFLB                                                   02905000
UCBCRHSN EQU   UCBFLB                                                   02906000
UCBCRHRV EQU   UCBFLB                                                   02907000
UCBRESVH EQU   UCBFLB                                                   02908000
UCBSPST  EQU   UCBFLB                                                   02909000
UCBASNS  EQU   UCBFLB                                                   02910000
UCBIORST EQU   UCBFLB                                                   02911000
UCBQISCE EQU   UCBFL1                                                   02912000
UCBACTV  EQU   UCBFL1                                                   02913000
UCBSAP   EQU   UCBFL1                                                   02914000
UCBNOTRC EQU   UCBCUB                                                   02915000
UCBPSNS  EQU   UCBFL1                                                   02916000
UCBUSING EQU   UCBPST                                                   02917000
UCBNOTRD EQU   UCBNRY                                                   02918000
UCBBUSYD EQU   UCBBSY                                                   02919000
UCBSYSR  EQU   UCBSTAT                                                  02920000
UCBPRES  EQU   UCBSTAT                                                  02921000
UCBUNLD  EQU   UCBSTAT                                                  02922000
UCBCHGS  EQU   UCBSTAT                                                  02923000
UCBALTPH EQU   UCBFL5                                                   02924000
UCBALTCU EQU   UCBFL5                                                   02925000
UCBNALOC EQU   UCBFL5                                                   02926000
UCBENVRD EQU   UCBFL5                                                   02927000
UCBVSDR  EQU   UCBFL5                                                   02928000
UCBSASK  EQU   UCBFL5                                                   02929000
UCBAMV   EQU   UCBAF                                                    02930000
UCBDCC   EQU   UCBFL5                                                   02931000
UCBMONT  EQU   UCBJBNR                                                  02932000
UCBRV011 EQU   UCBJBNR                                                  02933000
UCBMMSGP EQU   UCBJBNR                                                  02934000
UCBOLDSM EQU   UCBJBNR                                                  02935000
UCBRV003 EQU   UCBJBNR                                                  02936000
UCBDUC   EQU   UCBJBNR                                                  02937000
UCBJES3  EQU   UCBJBNR                                                  02938000
UCBVRDEV EQU   UCBJBNR                                                  02939000
UCBCMSEG EQU   UCBOB                                                    02940000
UCBPFXND EQU   UCB+512                                                  02941000
UCBIOQ   EQU   UCB+508                                                  02942000
UCBLOCK  EQU   UCB+504                                                  02943000
UCBPXST  EQU   UCB+504                                                  02944000
@NM00018 EQU   UCB                                                      02945000
VDSRBN   EQU   VDSCB+76                                                 02946000
VDSWINSI EQU   VDSCB+70                                                 02947000
VDSWINDW EQU   VDSCB+64                                                 02948000
VDSVBPPL EQU   VDSCB+60                                                 02949000
VDSWICB  EQU   VDSCB+56                                                 02950000
VDSDSPCT EQU   VDSCB+52                                                 02951000
VDSSEEKA EQU   VDSCB+45                                                 02952000
JFCRSV05 EQU   JFCEROPT                                                 02953000
JFCRSV04 EQU   JFCEROPT                                                 02954000
JFCRSV03 EQU   JFCEROPT                                                 02955000
JFCRSV02 EQU   JFCEROPT                                                 02956000
JFCTOPT  EQU   JFCEROPT                                                 02957000
JFCABN   EQU   JFCEROPT                                                 02958000
JFCSKP   EQU   JFCEROPT                                                 02959000
JFCACC   EQU   JFCEROPT                                                 02960000
JFCBUFL  EQU   JFCAMPTR+2                                               02961000
JFCFWORD EQU   JFCBFTEK                                                 02962000
JFCDWORD EQU   JFCBFTEK                                                 02963000
JFCHIER1 EQU   JFCBFTEK                                                 02964000
JFCDYN   EQU   JFCBFTEK                                                 02965000
JFCEXC   EQU   JFCBFTEK                                                 02966000
JFCBBFTR EQU   JFCBBFTA                                                 02967000
JFCSIM   EQU   JFCBBFTA                                                 02968000
JFCHIER  EQU   JFCBFTEK                                                 02969000
JFCBFOUT EQU   JFCBUFNO                                                 02970000
JFCBUFIN EQU   JFCBUFNO                                                 02971000
JFCTEMP  EQU   JFCBIND2                                                 02972000
JFCREQ   EQU   JFCBIND2                                                 02973000
JFCENT   EQU   JFCBIND2                                                 02974000
JFCSHARE EQU   JFCBIND2                                                 02975000
JFCSECUR EQU   JFCBIND2                                                 02976000
JFCDISP  EQU   JFCBIND2                                                 02977000
JFCPDS   EQU   JFCBIND1                                                 02978000
JFCGDG   EQU   JFCBIND1                                                 02979000
JFCADDED EQU   JFCBIND1                                                 02980000
JFCLOC   EQU   JFCBIND1                                                 02981000
JFCRLSE  EQU   JFCBIND1                                                 02982000
JFCBOPS2 EQU   JFCBMASK+7                                               02983000
JFCRCTLG EQU   JFCBFLG2                                                 02984000
JFCBBUFF EQU   JFCBFLG2                                                 02985000
JFCTRACE EQU   JFCBFLG2                                                 02986000
JFCSDRPS EQU   JFCBFLG2                                                 02987000
JFCMODNW EQU   JFCBFLG2                                                 02988000
JFCNRPS  EQU   JFCDEFER                                                 02989000
JFCOUTOP EQU   JFCBFLG2                                                 02990000
JFCINOP  EQU   JFCBFLG2                                                 02991000
JFCBPWBP EQU   JFCOPEN                                                  02992000
@NM00014 EQU   JFCOPEN                                                  02993000
JFCDUAL  EQU   JFCBFLG1                                                 02994000
JFCSLDES EQU   JFCBFLG1                                                 02995000
JFCSLCRE EQU   JFCBFLG1                                                 02996000
JFCSTAND EQU   JFCBFLG1                                                 02997000
JFCBOPS1 EQU   JFCBMASK                                                 02998000
JFCBVLSQ EQU   INFMJFCB+70                                              02999000
JFCRSV31 EQU   JFCFUNC                                                  03000000
JFCFNCBT EQU   JFCFUNC                                                  03001000
JFCFNCBX EQU   JFCFUNC                                                  03002000
JFCFNCBD EQU   JFCFUNC                                                  03003000
JFCFNCBW EQU   JFCFUNC                                                  03004000
JFCFNCBP EQU   JFCFUNC                                                  03005000
JFCFNCBR EQU   JFCFUNC                                                  03006000
JFCFNCBI EQU   JFCFUNC                                                  03007000
JFCBFOFL EQU   JFCBUFOF                                                 03008000
JFCNL    EQU   JFCBLTYP                                                 03009000
JFCNSL   EQU   JFCBLTYP                                                 03010000
JFCBLP   EQU   JFCBLTYP                                                 03011000
JFCBLTM  EQU   JFCBLTYP                                                 03012000
JFCBAL   EQU   JFCBLTYP                                                 03013000
JFCRSV38 EQU   JFCBLTYP                                                 03014000
JFCVINDX EQU   INFMJFCB+64                                              03015000
JFCNLREC EQU   INFMJFCB+62                                              03016000
JFCBADBF EQU   INFMJFCB+60                                              03017000
JFCAMSTR EQU   JFCBFRID+2                                               03018000
JFCAMCRO EQU   JFCBFRID                                                 03019000
JFCBDSCB EQU   INFMJFCB+53                                              03020000
JFCPAT   EQU   JFCBTSDM                                                 03021000
JFCNDCB  EQU   JFCBTSDM                                                 03022000
JFCNDSCB EQU   JFCBTSDM                                                 03023000
JFCNWRIT EQU   JFCBTSDM                                                 03024000
JFCTTR   EQU   JFCBTSDM                                                 03025000
JFCSDS   EQU   JFCBTSDM                                                 03026000
JFCVSL   EQU   JFCBTSDM                                                 03027000
JFCCAT   EQU   JFCBTSDM                                                 03028000
JFCIPLTX EQU   JFCBELNM                                                 03029000
JFCBQNAM EQU   JFCBDSNM                                                 03030000
JSCBCSCB EQU   JSCBSEC1+68                                              03031000
JSCBPMG  EQU   JSCBWTP+2                                                03032000
JSCBWTSP EQU   JSCBWTP+1                                                03033000
JSCRSV23 EQU   JSCBWTFG                                                 03034000
JSCRSV22 EQU   JSCBWTFG                                                 03035000
JSCRSV21 EQU   JSCBWTFG                                                 03036000
JSCRSV20 EQU   JSCBWTFG                                                 03037000
JSCRSV19 EQU   JSCBWTFG                                                 03038000
JSCRSV18 EQU   JSCBWTFG                                                 03039000
JSCBRET  EQU   JSCBWTFG                                                 03040000
JSCBIOFG EQU   JSCBWTFG                                                 03041000
@NM00011 EQU   JSCBSEC1+60                                              03042000
JSCBQMPI EQU   JSCBSEC1+56                                              03043000
JSCBPMSG EQU   JSCBSWT1                                                 03044000
JSCRSV16 EQU   JSCBSWT1                                                 03045000
JSCRSV15 EQU   JSCBSWT1                                                 03046000
JSCRSV14 EQU   JSCBSWT1                                                 03047000
JSCRSV13 EQU   JSCBSWT1                                                 03048000
JSCRSV12 EQU   JSCBSWT1                                                 03049000
JSCRSV11 EQU   JSCBSWT1                                                 03050000
JSCBPASS EQU   JSCBSWT1                                                 03051000
JSCBTTTR EQU   JSCBSEC1+52                                              03052000
JSCRSV10 EQU   JSCBSEC1+49                                              03053000
JSCBAUTH EQU   JSCBOPTS                                                 03054000
JSCSIOTS EQU   JSCBOPTS                                                 03055000
JSCRSV08 EQU   JSCBOPTS                                                 03056000
JSCRSV07 EQU   JSCBOPTS                                                 03057000
JSCRSV06 EQU   JSCBOPTS                                                 03058000
JSCBLONG EQU   JSCBOPTS                                                 03059000
JSCRSV05 EQU   JSCBOPTS                                                 03060000
JSCRSV04 EQU   JSCBOPTS                                                 03061000
JSCBSECB EQU   JSCBSEC1+44                                              03062000
JSCRSV03 EQU   JSCBSEC1+41                                              03063000
JSCBSTEP EQU   JSCBSEC1+40                                              03064000
JSCBDCBA EQU   JSCBDCB+1                                                03065000
JSCRSV02 EQU   JSCBDCB                                                  03066000
JSCBID   EQU   JSCBSEC1+32                                              03067000
JSCBDBTB EQU   JSCBSEC1+28                                              03068000
JSCBIJSC EQU   JSCBSEC1+24                                              03069000
JSCBTCBP EQU   JSCBSEC1+20                                              03070000
JSCBPCC  EQU   JSCBSEC1+16                                              03071000
JSCBTCP  EQU   JSCBSEC1+12                                              03072000
JSCBSHR  EQU   JSCBSEC1+8                                               03073000
JSCHPCEA EQU   JSCHPCE+1                                                03074000
JSCRSV32 EQU   JSCHPCE                                                  03075000
JSCRSV01 EQU   JSCBSEC1                                                 03076000
@NM00010 EQU   IEZJSCB                                                  03077000
@NM00008 EQU   TCBXTNT2+32                                              03078000
TCBRV181 EQU   TCBRV173                                                 03079000
TCBRV180 EQU   TCBRV173                                                 03080000
TCBRV179 EQU   TCBRV173                                                 03081000
TCBRV178 EQU   TCBRV173                                                 03082000
TCBRV177 EQU   TCBRV173                                                 03083000
TCBRV176 EQU   TCBRV173                                                 03084000
TCBRV175 EQU   TCBRV173                                                 03085000
TCBRV174 EQU   TCBRV173                                                 03086000
TCBRV172 EQU   TCBRV164                                                 03087000
TCBRV171 EQU   TCBRV164                                                 03088000
TCBRV170 EQU   TCBRV164                                                 03089000
TCBRV169 EQU   TCBRV164                                                 03090000
TCBRV168 EQU   TCBRV164                                                 03091000
TCBRV167 EQU   TCBRV164                                                 03092000
TCBRV166 EQU   TCBRV164                                                 03093000
TCBRV165 EQU   TCBRV164                                                 03094000
TCBRV163 EQU   TCBRV155                                                 03095000
TCBRV162 EQU   TCBRV155                                                 03096000
TCBRV161 EQU   TCBRV155                                                 03097000
TCBRV160 EQU   TCBRV155                                                 03098000
TCBRV159 EQU   TCBRV155                                                 03099000
TCBRV158 EQU   TCBRV155                                                 03100000
TCBRV157 EQU   TCBRV155                                                 03101000
TCBRV156 EQU   TCBRV155                                                 03102000
TCBRV154 EQU   TCBRV146                                                 03103000
TCBRV153 EQU   TCBRV146                                                 03104000
TCBRV152 EQU   TCBRV146                                                 03105000
TCBRV151 EQU   TCBRV146                                                 03106000
TCBRV150 EQU   TCBRV146                                                 03107000
TCBRV149 EQU   TCBRV146                                                 03108000
TCBRV148 EQU   TCBRV146                                                 03109000
TCBRV147 EQU   TCBRV146                                                 03110000
TCBRV145 EQU   TCBXTNT2+26                                              03111000
TCBRV144 EQU   TCBXTNT2+24                                              03112000
TCBRV143 EQU   TCBXTNT2+20                                              03113000
TCBRV142 EQU   TCBXTNT2+16                                              03114000
TCBRSV49 EQU   TCBXTNT2+12                                              03115000
TCBEVENT EQU   TCBXTNT2+8                                               03116000
TCBRCMP  EQU   TCBXTNT2+5                                               03117000
TCBRSVAB EQU   TCBXTNT2+4                                               03118000
TCBGTFA  EQU   TCBGTF+1                                                 03119000
TCBRSV47 EQU   TCBTFLG                                                  03120000
TCBRSV46 EQU   TCBTFLG                                                  03121000
TCBRSV45 EQU   TCBTFLG                                                  03122000
TCBRSV44 EQU   TCBTFLG                                                  03123000
TCBRSV43 EQU   TCBTFLG                                                  03124000
TCBDSPIT EQU   TCBTFLG                                                  03125000
TCBERRTN EQU   TCBTFLG                                                  03126000
TCBASYNC EQU   TCBTFLG                                                  03127000
@NM00007 EQU   TCB+296                                                  03128000
TCBSVCA2 EQU   TCB+292                                                  03129000
TCBSWASA EQU   TCB+288                                                  03130000
TCBDBTB  EQU   TCB+284                                                  03131000
TCBRPT   EQU   TCB+280                                                  03132000
TCBRV141 EQU   TCBRV133                                                 03133000
TCBRV140 EQU   TCBRV133                                                 03134000
TCBRV139 EQU   TCBRV133                                                 03135000
TCBRV138 EQU   TCBRV133                                                 03136000
TCBRV137 EQU   TCBRV133                                                 03137000
TCBRV136 EQU   TCBRV133                                                 03138000
TCBRV135 EQU   TCBRV133                                                 03139000
TCBRV134 EQU   TCBRV133                                                 03140000
TCBRV132 EQU   TCBRV124                                                 03141000
TCBRV131 EQU   TCBRV124                                                 03142000
TCBRV130 EQU   TCBRV124                                                 03143000
TCBRV129 EQU   TCBRV124                                                 03144000
TCBRV128 EQU   TCBRV124                                                 03145000
TCBRV127 EQU   TCBRV124                                                 03146000
TCBRV126 EQU   TCBRV124                                                 03147000
TCBRV125 EQU   TCBRV124                                                 03148000
TCBRV123 EQU   TCBFBYT2                                                 03149000
TCBRV122 EQU   TCBFBYT2                                                 03150000
TCBECBNV EQU   TCBFBYT2                                                 03151000
TCBSSSYN EQU   TCBFBYT2                                                 03152000
TCBFPRAP EQU   TCBFBYT2                                                 03153000
TCBFDW   EQU   TCBFBYT2                                                 03154000
TCBFMW   EQU   TCBFBYT2                                                 03155000
TCBCNCB  EQU   TCBFBYT2                                                 03156000
TCBLLH   EQU   TCBFBYT1                                                 03157000
TCBRV113 EQU   TCBFBYT1                                                 03158000
TCBEOT   EQU   TCBFBYT1                                                 03159000
TCBRTM2  EQU   TCBFBYT1                                                 03160000
TCBPGNLY EQU   TCBFBYT1                                                 03161000
TCBNDIOS EQU   TCBFBYT1                                                 03162000
TCBACTIV EQU   TCBFBYT1                                                 03163000
TCBEOTFM EQU   TCBFBYT1                                                 03164000
TCBAFFN  EQU   TCB+274                                                  03165000
TCBCCPVI EQU   TCB+272                                                  03166000
TCBUKYSP EQU   TCB+268                                                  03167000
TCBMODE  EQU   TCBESTAE+3                                               03168000
TCBERTYP EQU   TCBESTAE+2                                               03169000
TCBRV314 EQU   TCBESTRM                                                 03170000
TCBRV313 EQU   TCBESTRM                                                 03171000
TCBRV312 EQU   TCBESTRM                                                 03172000
TCBRV311 EQU   TCBESTRM                                                 03173000
TCBRV310 EQU   TCBESTRM                                                 03174000
TCBRV309 EQU   TCBESTRM                                                 03175000
TCBRV308 EQU   TCBESTRM                                                 03176000
TCBETERM EQU   TCBESTRM                                                 03177000
TCBSCBKY EQU   TCBESTAE                                                 03178000
TCBRTM12 EQU   TCB+260                                                  03179000
TCBTCBID EQU   TCB+256                                                  03180000
TCBRSV96 EQU   TCB+252                                                  03181000
TCBSWA   EQU   TCB+248                                                  03182000
TCBFOEA  EQU   TCBFOE+1                                                 03183000
TCBRSV42 EQU   TCBFOE                                                   03184000
TCBRV306 EQU   TCB+240                                                  03185000
TCBRSV41 EQU   TCB+239                                                  03186000
TCBTID   EQU   TCB+238                                                  03187000
TCBRSVAA EQU   TCB+237                                                  03188000
TCBABCUR EQU   TCB+236                                                  03189000
TCBTMSAV EQU   TCB+232                                                  03190000
TCBIOTIM EQU   TCB+228                                                  03191000
TCBRTWA  EQU   TCB+224                                                  03192000
TCBBACK  EQU   TCB+220                                                  03193000
TCBTIRB  EQU   TCB+216                                                  03194000
TCBAECB  EQU   TCB+212                                                  03195000
TCBEXT2A EQU   TCBEXT2+1                                                03196000
TCBRSV39 EQU   TCBEXT2                                                  03197000
TCBSTMCT EQU   TCB+207                                                  03198000
TCBSYSCT EQU   TCB+206                                                  03199000
TCBRSV37 EQU   TCB+205                                                  03200000
TCBEXSVC EQU   TCBDAR                                                   03201000
TCBDARMS EQU   TCBDAR                                                   03202000
TCBDARWT EQU   TCBDAR                                                   03203000
TCBDARO  EQU   TCBDAR                                                   03204000
TCBDARMC EQU   TCBDARC                                                  03205000
TCBDARD  EQU   TCBDAR                                                   03206000
TCBDARS  EQU   TCBDAR                                                   03207000
TCBDARP  EQU   TCBDAR                                                   03208000
TCBGTOFM EQU   TCBFLGS7                                                 03209000
TCBADMP  EQU   TCBFLGS7                                                 03210000
TCBRSTSK EQU   TCBFLGS7                                                 03211000
TCBSVCS  EQU   TCBFLGS7                                                 03212000
TCBSTACK EQU   TCBFLGS7                                                 03213000
TCBRSV34 EQU   TCBFLGS7                                                 03214000
TCBRSV33 EQU   TCBFLGS7                                                 03215000
TCBGPECB EQU   TCBFLGS7                                                 03216000
TCBNTJS  EQU   TCBFLGS6                                                 03217000
TCBAPG   EQU   TCBFLGS6                                                 03218000
TCBMIGR  EQU   TCBFLGS6                                                 03219000
TCBRV303 EQU   TCBFLGS6                                                 03220000
TCBSPVLK EQU   TCBFLGS6                                                 03221000
TCBCPU   EQU   TCBFLGS6                                                 03222000
TCBPIE17 EQU   TCBFLGS6                                                 03223000
TCBRV    EQU   TCBFLGS6                                                 03224000
TCBRSV79 EQU   TCBNDSP5                                                 03225000
TCBRSV78 EQU   TCBNDSP5                                                 03226000
TCBRSV77 EQU   TCBNDSP5                                                 03227000
TCBRSV76 EQU   TCBNDSP5                                                 03228000
TCBRSV75 EQU   TCBNDSP5                                                 03229000
TCBRSV74 EQU   TCBNDSP5                                                 03230000
TCBRSV95 EQU   TCBNDSP5                                                 03231000
TCBRSV94 EQU   TCBNDSP5                                                 03232000
TCBRSV93 EQU   TCBNDSP4                                                 03233000
TCBRSV92 EQU   TCBNDSP4                                                 03234000
TCBRSV91 EQU   TCBNDSP4                                                 03235000
TCBRSV90 EQU   TCBNDSP4                                                 03236000
TCBRSV89 EQU   TCBNDSP4                                                 03237000
TCBRSV88 EQU   TCBNDSP4                                                 03238000
TCBRSV87 EQU   TCBNDSP4                                                 03239000
TCBRSV86 EQU   TCBNDSP4                                                 03240000
TCBEXT1A EQU   TCBEXT1+1                                                03241000
TCBRSV32 EQU   TCBEXT1                                                  03242000
TCBEXCPD EQU   TCB+192                                                  03243000
TCBIOBRC EQU   TCB+188                                                  03244000
TCBDDWTC EQU   TCB+186                                                  03245000
TCBDDEXC EQU   TCB+184                                                  03246000
TCBJSCBB EQU   TCBJSCB+1                                                03247000
@NM00006 EQU   TCBRECDE                                                 03248000
TCBREC   EQU   TCBRECDE                                                 03249000
TCBMDIDS EQU   TCB+176                                                  03250000
TCBNDINT EQU   TCBNDSP3                                                 03251000
TCBRSV27 EQU   TCBNDSP3                                                 03252000
TCBRSV26 EQU   TCBNDSP3                                                 03253000
TCBRSV25 EQU   TCBNDSP3                                                 03254000
TCBRSV24 EQU   TCBNDSP3                                                 03255000
TCBSRBND EQU   TCBNDSP3                                                 03256000
TCBRV302 EQU   TCBNDSP3                                                 03257000
TCBLJSND EQU   TCBNDSP3                                                 03258000
TCBABE   EQU   TCBNDSP2                                                 03259000
TCBDSS   EQU   TCBNDSP2                                                 03260000
TCBOWAIT EQU   TCBNDSP2                                                 03261000
TCBIWAIT EQU   TCBNDSP2                                                 03262000
TCBNDTS  EQU   TCBNDSP2                                                 03263000
TCBNDSVC EQU   TCBNDSP2                                                 03264000
TCBSTPP  EQU   TCBNDSP2                                                 03265000
TCBABD   EQU   TCBNDSP2                                                 03266000
TCBRSV22 EQU   TCBNDSP1                                                 03267000
TCBPIEND EQU   TCBNDSP1                                                 03268000
TCBTPSP  EQU   TCBNDSP1                                                 03269000
TCBDDRND EQU   TCBNDSP1                                                 03270000
TCBRSPND EQU   TCBNDSP1                                                 03271000
TCBRSTND EQU   TCBNDSP1                                                 03272000
TCBDARPN EQU   TCBNDSP1                                                 03273000
TCBDARTN EQU   TCBNDSP1                                                 03274000
TCBNDSP0 EQU   TCBNDSP                                                  03275000
TCBUSER  EQU   TCB+168                                                  03276000
TCBTCTB  EQU   TCBTCT+1                                                 03277000
TCBRSV9C EQU   TCBTCTGF                                                 03278000
TCBRSV9B EQU   TCBTCTGF                                                 03279000
TCBRSV9A EQU   TCBTCTGF                                                 03280000
TCBRSV99 EQU   TCBTCTGF                                                 03281000
TCBRSV98 EQU   TCBTCTGF                                                 03282000
TCBRSV97 EQU   TCBTCTGF                                                 03283000
TCBRSV20 EQU   TCBTCTGF                                                 03284000
TCBSMFGF EQU   TCBTCTGF                                                 03285000
TCBSTABB EQU   TCBSTAB+1                                                03286000
TCBSTCUR EQU   TCBNSTAE                                                 03287000
TCBRV301 EQU   TCBNSTAE                                                 03288000
TCBSYNCH EQU   TCBNSTAE                                                 03289000
TCBHALT  EQU   TCBNSTAE                                                 03290000
TCBPPSUP EQU   TCBNSTAE                                                 03291000
TCB33E   EQU   TCBNSTAE                                                 03292000
TCBQUIES EQU   TCBNSTAE                                                 03293000
TCBSTABE EQU   TCBNSTAE                                                 03294000
TCBAQE   EQU   TCB+156                                                  03295000
TCBPQE   EQU   TCB+152                                                  03296000
TCBTSDP  EQU   TCB+151                                                  03297000
TCBTSLP  EQU   TCB+150                                                  03298000
TCBSTPCT EQU   TCB+149                                                  03299000
TCBCPUBN EQU   TCBTSFLG                                                 03300000
TCBDYDSP EQU   TCBTSFLG                                                 03301000
TCBRSV18 EQU   TCBTSFLG                                                 03302000
TCBRSV17 EQU   TCBTSFLG                                                 03303000
TCBTIOTG EQU   TCBTSFLG                                                 03304000
TCBATT   EQU   TCBTSFLG                                                 03305000
TCBSTPPR EQU   TCBTSFLG                                                 03306000
TCBRV300 EQU   TCBTSTSK                                                 03307000
TCBECB   EQU   TCB+144                                                  03308000
TCBIQE   EQU   TCB+140                                                  03309000
TCBLTC   EQU   TCB+136                                                  03310000
TCBOTC   EQU   TCB+132                                                  03311000
TCBNTC   EQU   TCB+128                                                  03312000
TCBJSTCA EQU   TCBJSTCB+1                                               03313000
TCBRSV16 EQU   TCBJSTCB                                                 03314000
TCBTQET  EQU   TCBTME                                                   03315000
TCBTCB   EQU   TCB+116                                                  03316000
TCBFSAB  EQU   TCBFSA+1                                                 03317000
TCBQEL   EQU   TCBFSA                                                   03318000
TCBGRS15 EQU   TCBGRS+60                                                03319000
TCBGRS14 EQU   TCBGRS+56                                                03320000
TCBGRS13 EQU   TCBGRS+52                                                03321000
TCBGRS12 EQU   TCBGRS+48                                                03322000
TCBGRS11 EQU   TCBGRS+44                                                03323000
TCBGRS10 EQU   TCBGRS+40                                                03324000
TCBGRS9  EQU   TCBGRS+36                                                03325000
TCBGRS8  EQU   TCBGRS+32                                                03326000
TCBGRS7  EQU   TCBGRS+28                                                03327000
TCBGRS6  EQU   TCBGRS+24                                                03328000
TCBGRS5  EQU   TCBGRS+20                                                03329000
TCBGRS4  EQU   TCBGRS+16                                                03330000
TCBGRS3  EQU   TCBGRS+12                                                03331000
TCBGRS2  EQU   TCBGRS+8                                                 03332000
TCBGRS1  EQU   TCBGRS+4                                                 03333000
TCBGRS0  EQU   TCBGRS                                                   03334000
TCBJPQB  EQU   TCBJPQ+1                                                 03335000
TCBRSV15 EQU   TCBPURGE                                                 03336000
TCBRSV14 EQU   TCBPURGE                                                 03337000
TCBRSV13 EQU   TCBPURGE                                                 03338000
TCBRSV12 EQU   TCBPURGE                                                 03339000
TCBRSV11 EQU   TCBPURGE                                                 03340000
TCBRSV10 EQU   TCBPURGE                                                 03341000
TCBRSV09 EQU   TCBPURGE                                                 03342000
TCBJPQF  EQU   TCBPURGE                                                 03343000
TCBJLB   EQU   TCB+40                                                   03344000
TCBLLS   EQU   TCB+36                                                   03345000
TCBDSP   EQU   TCB+35                                                   03346000
TCBLMP   EQU   TCB+34                                                   03347000
TCBPNDSP EQU   TCBFLGS5                                                 03348000
TCBFCD1  EQU   TCBFLGS5                                                 03349000
TCBSTP   EQU   TCBFLGS5                                                 03350000
TCBSYS   EQU   TCBFLGS5                                                 03351000
TCBANDSP EQU   TCBFLGS5                                                 03352000
TCBPAGE  EQU   TCBFLGS5                                                 03353000
TCBUXNDF EQU   TCBABWF                                                  03354000
TCBFC    EQU   TCBFLGS5                                                 03355000
TCBONDSP EQU   TCBFLGS4                                                 03356000
TCBMPCND EQU   TCBFLGS4                                                 03357000
TCBMPCVQ EQU   TCBFLGS4                                                 03358000
TCBUXNDV EQU   TCBFLGS4                                                 03359000
TCBHNDSP EQU   TCBFLGS4                                                 03360000
TCBRQENA EQU   TCBFLGS4                                                 03361000
TCBSER   EQU   TCBFLGS4                                                 03362000
TCBNDUMP EQU   TCBFLGS4                                                 03363000
TCBDWSTA EQU   TCBFLGS3                                                 03364000
TCBRSV08 EQU   TCBFLGS3                                                 03365000
TCBRSV07 EQU   TCBFLGS3                                                 03366000
TCBRSV06 EQU   TCBFLGS3                                                 03367000
TCBABGM  EQU   TCBFLGS3                                                 03368000
TCBABTRM EQU   TCBFLGS3                                                 03369000
TCBADINP EQU   TCBFLGS3                                                 03370000
TCBFSM   EQU   TCBFLGS3                                                 03371000
TCBFTS   EQU   TCBFLGS2                                                 03372000
TCBFETXR EQU   TCBFLGS2                                                 03373000
TCBFDSOP EQU   TCBFLGS2                                                 03374000
TCBFJMC  EQU   TCBFLGS2                                                 03375000
TCBFSMC  EQU   TCBFLGS2                                                 03376000
TCBFABOP EQU   TCBFLGS2                                                 03377000
TCBFSTI  EQU   TCBFLGS2                                                 03378000
TCBFOINP EQU   TCBFLGS2                                                 03379000
TCBFX    EQU   TCBFLGS1                                                 03380000
TCBFS    EQU   TCBFLGS1                                                 03381000
TCBFT    EQU   TCBFLGS1                                                 03382000
TCBPDUMP EQU   TCBFLGS1                                                 03383000
TCBNONPR EQU   TCBFLGS1                                                 03384000
TCBFERA  EQU   TCBFLGS1                                                 03385000
TCBFE    EQU   TCBFLGS1                                                 03386000
TCBFA    EQU   TCBFLGS1                                                 03387000
TCBZERO  EQU   TCBPKF                                                   03388000
TCBFLAG  EQU   TCBPKF                                                   03389000
TCBMSSB  EQU   TCBMSS+1                                                 03390000
TCBRSV03 EQU   TCBMSS                                                   03391000
TCBTRNB  EQU   TCBTRN+1                                                 03392000
TCBRSV02 EQU   TCBABF                                                   03393000
TCBOLTEP EQU   TCBABF                                                   03394000
TCBTCP   EQU   TCBABF                                                   03395000
TCBTCPP  EQU   TCBABF                                                   03396000
TCBRSV01 EQU   TCBABF                                                   03397000
TCBGRPH  EQU   TCBABF                                                   03398000
TCBNOCHK EQU   TCBABF                                                   03399000
TCBMOD91 EQU   TCBABF                                                   03400000
TCBCMPC  EQU   TCBCMP+1                                                 03401000
TCBRV318 EQU   TCBCMSG                                                  03402000
TCBRV317 EQU   TCBCIND                                                  03403000
TCBRV316 EQU   TCBCWTO                                                  03404000
TCBCASID EQU   TCBCDBL                                                  03405000
TCBNOCC  EQU   TCBSTCC                                                  03406000
TCBDMPO  EQU   TCBCPP                                                   03407000
TCBCSTEP EQU   TCBCMPF                                                  03408000
TCBCREQ  EQU   TCBCMPF                                                  03409000
TCBTIO   EQU   TCB+12                                                   03410000
TCBDEB   EQU   TCB+8                                                    03411000
TCBPIEA  EQU   TCBPIE+1                                                 03412000
TCBPM    EQU   TCBPMASK                                                 03413000
@NM00005 EQU   TCBPMASK                                                 03414000
TCBRBP   EQU   TCB                                                      03415000
TCBFRS6  EQU   TCBFRS+24                                                03416000
TCBFRS4  EQU   TCBFRS+16                                                03417000
TCBFRS2  EQU   TCBFRS+8                                                 03418000
TCBFRS0  EQU   TCBFRS                                                   03419000
@NM00004 EQU   TCBPTRS                                                  03420000
CVTLEVL  EQU   CVTRELNO+2                                               03421000
CVTNUMB  EQU   CVTRELNO                                                 03422000
CVTMDL   EQU   CVTFIX+250                                               03423000
@NM00003 EQU   CVTFIX+248                                               03424000
@NM00002 EQU   CVTFIX                                                   03425000
CVTRV482 EQU   CVTXTNT2+128                                             03426000
CVTRV481 EQU   CVTXTNT2+124                                             03427000
CVTRV480 EQU   CVTXTNT2+120                                             03428000
CVTRV479 EQU   CVTXTNT2+118                                             03429000
CVTRV478 EQU   CVTXTNT2+117                                             03430000
CVTRV477 EQU   CVTXTNT2+116                                             03431000
CVTRV476 EQU   CVTXTNT2+115                                             03432000
CVTRV475 EQU   CVTXTNT2+114                                             03433000
CVTRV474 EQU   CVTRV466                                                 03434000
CVTRV473 EQU   CVTRV466                                                 03435000
CVTRV472 EQU   CVTRV466                                                 03436000
CVTRV471 EQU   CVTRV466                                                 03437000
CVTRV470 EQU   CVTRV466                                                 03438000
CVTRV469 EQU   CVTRV466                                                 03439000
CVTRV468 EQU   CVTRV466                                                 03440000
CVTRV467 EQU   CVTRV466                                                 03441000
CVTRV465 EQU   CVTRV457                                                 03442000
CVTRV464 EQU   CVTRV457                                                 03443000
CVTRV463 EQU   CVTRV457                                                 03444000
CVTRV462 EQU   CVTRV457                                                 03445000
CVTRV461 EQU   CVTRV457                                                 03446000
CVTRV460 EQU   CVTRV457                                                 03447000
CVTRV459 EQU   CVTRV457                                                 03448000
CVTRV458 EQU   CVTRV457                                                 03449000
CVTRV456 EQU   CVTXTNT2+108                                             03450000
CVTRV455 EQU   CVTXTNT2+104                                             03451000
CVTRV454 EQU   CVTXTNT2+100                                             03452000
CVTRV453 EQU   CVTXTNT2+96                                              03453000
CVTRV452 EQU   CVTXTNT2+94                                              03454000
CVTRV451 EQU   CVTXTNT2+92                                              03455000
CVTRV450 EQU   CVTXTNT2+90                                              03456000
CVTRV449 EQU   CVTXTNT2+88                                              03457000
CVTRV448 EQU   CVTXTNT2+87                                              03458000
CVTRV447 EQU   CVTXTNT2+86                                              03459000
CVTRV446 EQU   CVTRV438                                                 03460000
CVTRV445 EQU   CVTRV438                                                 03461000
CVTRV444 EQU   CVTRV438                                                 03462000
CVTRV443 EQU   CVTRV438                                                 03463000
CVTRV442 EQU   CVTRV438                                                 03464000
CVTRV441 EQU   CVTRV438                                                 03465000
CVTRV440 EQU   CVTRV438                                                 03466000
CVTRV439 EQU   CVTRV438                                                 03467000
CVTRV437 EQU   CVTRV429                                                 03468000
CVTRV436 EQU   CVTRV429                                                 03469000
CVTRV435 EQU   CVTRV429                                                 03470000
CVTRV434 EQU   CVTRV429                                                 03471000
CVTRV433 EQU   CVTRV429                                                 03472000
CVTRV432 EQU   CVTRV429                                                 03473000
CVTRV431 EQU   CVTRV429                                                 03474000
CVTRV430 EQU   CVTRV429                                                 03475000
CVTRV428 EQU   CVTXTNT2+80                                              03476000
CVTRV427 EQU   CVTXTNT2+76                                              03477000
CVTRV426 EQU   CVTXTNT2+72                                              03478000
CVTRV425 EQU   CVTXTNT2+68                                              03479000
CVTATACT EQU   CVTATCVT                                                 03480000
CVTRV423 EQU   CVTXTNT2+62                                              03481000
CVTRV422 EQU   CVTXTNT2+60                                              03482000
CVTRV421 EQU   CVTXTNT2+58                                              03483000
CVTRV420 EQU   CVTXTNT2+56                                              03484000
CVTRV419 EQU   CVTXTNT2+55                                              03485000
CVTRV418 EQU   CVTXTNT2+54                                              03486000
CVTRV417 EQU   CVTRV409                                                 03487000
CVTRV416 EQU   CVTRV409                                                 03488000
CVTRV415 EQU   CVTRV409                                                 03489000
CVTRV414 EQU   CVTRV409                                                 03490000
CVTRV413 EQU   CVTRV409                                                 03491000
CVTRV412 EQU   CVTRV409                                                 03492000
CVTRV411 EQU   CVTRV409                                                 03493000
CVTRV410 EQU   CVTRV409                                                 03494000
CVTRV408 EQU   CVTRV400                                                 03495000
CVTRV407 EQU   CVTRV400                                                 03496000
CVTRV406 EQU   CVTRV400                                                 03497000
CVTRV405 EQU   CVTRV400                                                 03498000
CVTRV404 EQU   CVTRV400                                                 03499000
CVTRV403 EQU   CVTRV400                                                 03500000
CVTRV402 EQU   CVTRV400                                                 03501000
CVTRV401 EQU   CVTRV400                                                 03502000
CVTICB   EQU   CVTXTNT2+48                                              03503000
CVTSKTA  EQU   CVTXTNT2+44                                              03504000
CVTRSV99 EQU   CVTXTNT2+40                                              03505000
CVTRSV98 EQU   CVTXTNT2+36                                              03506000
CVTRSV97 EQU   CVTXTNT2+34                                              03507000
CVTRSV96 EQU   CVTXTNT2+32                                              03508000
CVTOLTEP EQU   CVTXTNT2+28                                              03509000
CVTQIDA  EQU   CVTQID+1                                                 03510000
CVTRSV95 EQU   CVTQID                                                   03511000
CVTRSV94 EQU   CVTXTNT2+20                                              03512000
CVTRSV93 EQU   CVTXTNT2+16                                              03513000
CVTRSV92 EQU   CVTXTNT2+12                                              03514000
CVTDEBVR EQU   CVTXTNT2+8                                               03515000
CVTRSV91 EQU   CVTXTNT2+6                                               03516000
CVTRSV9H EQU   CVTFLGBT                                                 03517000
CVTRSV9G EQU   CVTFLGBT                                                 03518000
CVTRSV9F EQU   CVTFLGBT                                                 03519000
CVTRSV9E EQU   CVTFLGBT                                                 03520000
CVTRSV9D EQU   CVTFLGBT                                                 03521000
CVTRSV9C EQU   CVTFLGBT                                                 03522000
CVTVME   EQU   CVTFLGBT                                                 03523000
CVTNPE   EQU   CVTFLGBT                                                 03524000
CVTNUCLS EQU   CVTXTNT2+4                                               03525000
CVTDSSVA EQU   CVTDSSV+1                                                03526000
CVTRSV89 EQU   CVTDSSV                                                  03527000
CVTRSV88 EQU   CVTXTNT1+8                                               03528000
CVTRSV87 EQU   CVTXTNT1+4                                               03529000
CVTFACHN EQU   CVTXTNT1                                                 03530000
CVTRV488 EQU   CVTMAP+412                                               03531000
CVTRV487 EQU   CVTMAP+408                                               03532000
CVTRV486 EQU   CVTMAP+404                                               03533000
CVTRV485 EQU   CVTMAP+400                                               03534000
CVTACTAP EQU   CVTMAP+396                                               03535000
CVTAUTH  EQU   CVTMAP+392                                               03536000
CVTATMCA EQU   CVTATMCT+1                                               03537000
CVTATMST EQU   CVTATMCT                                                 03538000
CVTRSV61 EQU   CVTMAP+384                                               03539000
CVTVOLT1 EQU   CVTVOLM1+1                                               03540000
CVTVOLI1 EQU   CVTVOLF1                                                 03541000
CVTSTOA  EQU   CVTMAP+376                                               03542000
CVTRSV58 EQU   CVTMAP+374                                               03543000
CVTRSV57 EQU   CVTMAP+372                                               03544000
CVTDDCE  EQU   CVTMAP+368                                               03545000
CVTPNWFR EQU   CVTMAP+364                                               03546000
CVTSMF   EQU   CVTMAP+360                                               03547000
CVTSULK  EQU   CVTMAP+358                                               03548000
CVTSLKO  EQU   CVTSYSK                                                  03549000
CVTSLKP  EQU   CVTSYSK                                                  03550000
CVTSLKQ  EQU   CVTSYSK                                                  03551000
CVTSLKR  EQU   CVTSYSK                                                  03552000
CVTRSV56 EQU   CVTSYSK                                                  03553000
CVTRSV55 EQU   CVTSYSK                                                  03554000
CVTRSV54 EQU   CVTSYSK                                                  03555000
CVTRSV53 EQU   CVTSYSK                                                  03556000
CVTRSV52 EQU   CVTA1F1                                                  03557000
CVTRSV51 EQU   CVTA1F1                                                  03558000
CVTRSV50 EQU   CVTA1F1                                                  03559000
CVTRSV49 EQU   CVTA1F1                                                  03560000
CVTRSV48 EQU   CVTA1F1                                                  03561000
CVTRSV47 EQU   CVTA1F1                                                  03562000
CVTSRSW  EQU   CVTA1F1                                                  03563000
CVTPFSW  EQU   CVTA1F1                                                  03564000
CVTPCVT  EQU   CVTMAP+352                                               03565000
CVTRSV46 EQU   CVTMAP+344                                               03566000
CVTRSV45 EQU   CVTMAP+340                                               03567000
CVTRSV44 EQU   CVTMAP+338                                               03568000
CVTRSV43 EQU   CVTMAP+336                                               03569000
CVTHJESA EQU   CVTHJES+1                                                03570000
CVTRSV42 EQU   CVTHJES                                                  03571000
CVTEXT2A EQU   CVTEXT2+1                                                03572000
CVTRSV41 EQU   CVTEXT2                                                  03573000
CVTAPFA  EQU   CVTAPF+1                                                 03574000
CVTRSV40 EQU   CVTAPF                                                   03575000
CVTRV518 EQU   CVTINTLA                                                 03576000
CVTRV517 EQU   CVTERPV                                                  03577000
CVTEORM  EQU   CVTMAP+312                                               03578000
CVTMCHPR EQU   CVTMAP+308                                               03579000
CVTTZ    EQU   CVTMAP+304                                               03580000
CVTJEPS  EQU   CVTMAP+300                                               03581000
CVTJESCT EQU   CVTMAP+296                                               03582000
CVTMODE  EQU   CVTMAP+292                                               03583000
CVTPTRV  EQU   CVTMAP+288                                               03584000
CVTREAL  EQU   CVTMAP+284                                               03585000
CVTRSV39 EQU   CVTMAP+280                                               03586000
CVTRSV38 EQU   CVTMAP+276                                               03587000
CVTDMSRA EQU   CVTDMSR+1                                                03588000
CVTRV634 EQU   CVTDMSRF                                                 03589000
CVTRV633 EQU   CVTDMSRF                                                 03590000
CVTRV632 EQU   CVTDMSRF                                                 03591000
CVTRV631 EQU   CVTDMSRF                                                 03592000
CVTRV630 EQU   CVTDMSRF                                                 03593000
CVTRV629 EQU   CVTDMSRF                                                 03594000
CVTUDUMP EQU   CVTDMSRF                                                 03595000
CVTSDUMP EQU   CVTDMSRF                                                 03596000
CVTQMSGA EQU   CVTQMSG+1                                                03597000
CVTRSV36 EQU   CVTQMSG                                                  03598000
CVTAMFF  EQU   CVTMAP+264                                               03599000
CVTPURGA EQU   CVTPURG+1                                                03600000
CVTRSV35 EQU   CVTPURG                                                  03601000
CVTCBSP  EQU   CVTMAP+256                                               03602000
CVTATERA EQU   CVTATER+1                                                03603000
CVTSYST  EQU   CVTATER                                                  03604000
CVTVOLT2 EQU   CVTTAT                                                   03605000
CVTVOLI2 EQU   CVTVOLF2                                                 03606000
CVTAQAVB EQU   CVTAQAVT+1                                               03607000
CVTRSV34 EQU   CVTTCMFG                                                 03608000
CVTRSV33 EQU   CVTTCMFG                                                 03609000
CVTRSV32 EQU   CVTTCMFG                                                 03610000
CVTRSV31 EQU   CVTTCMFG                                                 03611000
CVTRSV30 EQU   CVTTCMFG                                                 03612000
CVTRSV29 EQU   CVTTCMFG                                                 03613000
CVTRSV28 EQU   CVTTCMFG                                                 03614000
CVTTCRDY EQU   CVTTCMFG                                                 03615000
CVTGTFA  EQU   CVTGTF+1                                                 03616000
CVTRSV27 EQU   CVTGTFST                                                 03617000
CVTRNIO  EQU   CVTGTFST                                                 03618000
CVTUSR   EQU   CVTGTFST                                                 03619000
CVTRV318 EQU   CVTFORM                                                  03620000
CVTRV317 EQU   CVTTMODE                                                 03621000
CVTRV316 EQU   CVTSTATE                                                 03622000
CVTRV315 EQU   CVTGTFS                                                  03623000
CVTGTFAV EQU   CVTGTFS                                                  03624000
CVT0SCR1 EQU   CVTMAP+232                                               03625000
CVTRV515 EQU   CVTMAP+228                                               03626000
CVTRMS   EQU   CVTMAP+224                                               03627000
CVTPATCH EQU   CVTMAP+220                                               03628000
CVTTSCE  EQU   CVTMAP+216                                               03629000
CVTLNKSC EQU   CVTMAP+214                                               03630000
CVTQABST EQU   CVTMAP+212                                               03631000
CVTMDLDS EQU   CVTMAP+208                                               03632000
CVTUSER  EQU   CVTMAP+204                                               03633000
CVTABEND EQU   CVTMAP+200                                               03634000
CVTSMCA  EQU   CVTMAP+196                                               03635000
CVTRSV18 EQU   CVTMAP+192                                               03636000
CVTQLPAQ EQU   CVTMAP+188                                               03637000
CVTQCDSR EQU   CVTMAP+184                                               03638000
CVTRSV17 EQU   CVTOPTB                                                  03639000
CVTRSV16 EQU   CVTOPTB                                                  03640000
CVTFP    EQU   CVTOPTB                                                  03641000
CVTAPTHR EQU   CVTOPTB                                                  03642000
CVTNLOG  EQU   CVTOPTB                                                  03643000
CVTTOD   EQU   CVTOPTB                                                  03644000
CVTCTIMS EQU   CVTOPTB                                                  03645000
CVTPROT  EQU   CVTOPTB                                                  03646000
CVTXPFP  EQU   CVTOPTA                                                  03647000
CVTASCII EQU   CVTOPTA                                                  03648000
CVTRSV13 EQU   CVTOPTA                                                  03649000
CVTRSV12 EQU   CVTOPTA                                                  03650000
CVTNIP   EQU   CVTOPTA                                                  03651000
CVTDDR   EQU   CVTOPTA                                                  03652000
CVTAPR   EQU   CVTOPTA                                                  03653000
CVTCCH   EQU   CVTOPTA                                                  03654000
CVTSNCTR EQU   CVTMAP+180                                               03655000
CVTQMWR  EQU   CVTMAP+176                                               03656000
CVTQOCR  EQU   CVTMAP+172                                               03657000
CVT1EF00 EQU   CVTMAP+168                                               03658000
CVTMZ00  EQU   CVTMAP+164                                               03659000
CVTHEAD  EQU   CVTMAP+160                                               03660000
CVTRSV11 EQU   CVTMAP+156                                               03661000
CVT0PT01 EQU   CVTMAP+152                                               03662000
CVTMSER  EQU   CVTMAP+148                                               03663000
CVTRV516 EQU   CVTIERLC                                                 03664000
CVTILCH  EQU   CVTMAP+140                                               03665000
CVT0DS   EQU   CVTMAP+136                                               03666000
CVTFBOSV EQU   CVTMAP+132                                               03667000
CVTNUCB  EQU   CVTMAP+128                                               03668000
CVTIXAVL EQU   CVTMAP+124                                               03669000
CVTIOQET EQU   CVTMAP+120                                               03670000
CVTDCBA  EQU   CVTMAP+117                                               03671000
CVTMVS2  EQU   CVTDCB                                                   03672000
CVT6DAT  EQU   CVTDCB                                                   03673000
CVT4MPS  EQU   CVTDCB                                                   03674000
CVTRSV09 EQU   CVTDCB                                                   03675000
CVT4MS1  EQU   CVTDCB                                                   03676000
CVT2SPS  EQU   CVTDCB                                                   03677000
CVT1SSS  EQU   CVTDCB                                                   03678000
CVTRSV08 EQU   CVTDCB                                                   03679000
CVTSTB   EQU   CVTMAP+112                                               03680000
CVTQTD00 EQU   CVTMAP+108                                               03681000
CVTQTE00 EQU   CVTMAP+104                                               03682000
CVTCUCB  EQU   CVTMAP+100                                               03683000
CVTSJQ   EQU   CVTMAP+96                                                03684000
CVTPBLDL EQU   CVTMAP+92                                                03685000
CVTTPC   EQU   CVTMAP+88                                                03686000
CVTSVDCB EQU   CVTMAP+84                                                03687000
CVTBRET  EQU   CVTMAP+82                                                03688000
CVTEXIT  EQU   CVTMAP+80                                                03689000
CVT0FN00 EQU   CVTMAP+76                                                03690000
CVTDARA  EQU   CVTDAR+1                                                 03691000
CVTRSV07 EQU   CVTFLGS1                                                 03692000
CVTRSV06 EQU   CVTFLGS1                                                 03693000
CVTRSV05 EQU   CVTFLGS1                                                 03694000
CVTRSV04 EQU   CVTFLGS1                                                 03695000
CVTRSV03 EQU   CVTFLGS1                                                 03696000
CVTRSV02 EQU   CVTFLGS1                                                 03697000
CVTRSV01 EQU   CVTFLGS1                                                 03698000
CVTDMPLK EQU   CVTFLGS1                                                 03699000
CVTXITP  EQU   CVTMAP+68                                                03700000
CVTMSLT  EQU   CVTMAP+60                                                03701000
CVTDATE  EQU   CVTMAP+56                                                03702000
CVTBTERM EQU   CVTMAP+52                                                03703000
CVTSYSAD EQU   CVTMAP+48                                                03704000
CVTXTLER EQU   CVTMAP+44                                                03705000
CVTILK2  EQU   CVTMAP+40                                                03706000
CVTILK1  EQU   CVTMAP+36                                                03707000
CVTPRLTV EQU   CVTMAP+32                                                03708000
CVTPCNVT EQU   CVTMAP+28                                                03709000
CVT0VL00 EQU   CVTMAP+24                                                03710000
CVTXAPG  EQU   CVTMAP+20                                                03711000
CVTBUF   EQU   CVTMAP+16                                                03712000
CVTJOB   EQU   CVTMAP+12                                                03713000
CVTLINK  EQU   CVTMAP+8                                                 03714000
CVT0EF00 EQU   CVTMAP+4                                                 03715000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03716000
@RC00271 EQU   @RC00255                                                 03717000
@RC00300 EQU   FREEDSCB                                                 03718000
@RF00306 EQU   @RC00293                                                 03719000
@RC00317 EQU   @RC00314                                                 03720000
@RC00324 EQU   @RC00321                                                 03721000
@RC00342 EQU   @RC00341                                                 03722000
@RC00353 EQU   @RC00332                                                 03723000
@RC00361 EQU   @RC00332                                                 03724000
@RC00400 EQU   @RC00399                                                 03725000
@RF00440 EQU   @RC00434                                                 03726000
@RC00354 EQU   @RC00353                                                 03727000
@ENDDATA EQU   *                                                        03728000
         END   IGG0325I,(C'PLS0146',0701,77064)                         03729000
