         TITLE 'IGG0CLBG - CMS DELETE DRIVER                           *00001000
                        '                                               00002000
IGG0CLBG CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IGG0CLBG  78.122'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
         USING @MAINENT,@15                                             00011000
         USING @DATD-(CCATEMPS-IGGCCA),R11                              00012000
         DS 0F                                                          00013000
         DC CL8'IGGPDEL'                                                00014000
         EJECT                                                          00015000
         B     @PB00002                                            0201 00016000
IGGPDEL  DS    0H                                                  0202 00017000
         ENTRY IGGPDEL                                                  00018000
         DROP @15                                                       00019000
Z003     DS    0H                                                  0204 00020000
Z003DEL  DS    0H                                                  0205 00021000
         STM 12,14,12(13)                                               00022000
         LA 13,12(13)                                                   00023000
         BALR 12,0                                                      00024000
IGGSEGST DS 0H                                                          00025000
         USING *,12                                                     00026000
*   DELR13SA=R13;                   /* SAVE REGISTER 13      @Y30SSPJ*/ 00027000
         L     @10,CCACMSWA(,R11)                                  0212 00028000
         ST    R13,DELR13SA(,@10)                                  0212 00029000
*   IF CTGWKA=N THEN                                               0213 00030000
         L     @10,CCACPL(,R11)                                    0213 00031000
         L     @10,CTGWKA(,@10)                                    0213 00032000
         LTR   @10,@10                                             0213 00033000
         BZ    @RT00213                                            0213 00034000
*     ;                             /* WORK AREA IS DEFINED? @Y30SSPJ*/ 00035000
*   ELSE                            /* YES-USERWKA DEFINED   @Y30SSPJ*/ 00036000
*     DO;                           /*                       @Y30SSPJ*/ 00037000
*       WKALEN2=LENGTH(USERWKA);    /* SET REQUIRED LENGTH   @Y30SSPJ*/ 00038000
         L     @10,CCACPL(,R11)                                    0216 00039000
         L     @10,CTGWKA(,@10)                                    0216 00040000
         MVC   WKALEN2(2,@10),@CH00058                             0216 00041000
*       DELUSINX=INCR;              /* FIRST USERWKA ENTRY   @Y30SSPJ*/ 00042000
         L     @10,CCACMSWA(,R11)                                  0217 00043000
         MVI   DELUSINX(@10),X'01'                                 0217 00044000
*     END;                          /*                       @Y30SSPJ*/ 00045000
*   DELRTYPE=CTGTYPE;               /* SAVE REQUEST TYPE             */ 00046000
@RT00213 L     @10,CCACMSWA(,R11)                                  0219 00047000
         L     @05,CCACPL(,R11)                                    0219 00048000
         MVC   DELRTYPE(1,@10),CTGTYPE(@05)                        0219 00049000
*   IF CTGTYPE=CTGTCL|              /* IS REQUEST FOR CLUSTR         */ 00050000
*       CTGTYPE=CTGTPATH|           /* OR PATH               @Y30SSPJ*/ 00051000
*       CTGTYPE=CTGTAIX|            /* OR AIX                @Y30SSPJ*/ 00052000
*       CTGTYPE=CTGTPGSP|           /* OR PAGE SPACE           Y02020*/ 00053000
*       CTGTYPE=CTGTALIN THEN       /* OR NONVSAM                    */ 00054000
         CLI   CTGTYPE(@05),C'C'                                   0220 00055000
         BE    @RT00220                                            0220 00056000
         CLI   CTGTYPE(@05),C'R'                                   0220 00057000
         BE    @RT00220                                            0220 00058000
         CLI   CTGTYPE(@05),C'G'                                   0220 00059000
         BE    @RT00220                                            0220 00060000
         CLI   CTGTYPE(@05),C'P'                                   0220 00061000
         BE    @RT00220                                            0220 00062000
         CLI   CTGTYPE(@05),C'A'                                   0220 00063000
         BNE   @RF00220                                            0220 00064000
@RT00220 DS    0H                                                  0221 00065000
*     DO;                           /* YES-RECORD TYPE VALID @Y30SSPJ*/ 00066000
*       IF(CTGTYPE=RCDID&           /* REQUEST TYPE = RECORD TYPE AND   00067000
*                                                              Y02020*/ 00068000
*           CNAME=REQNAME           /* MATCHING ENTRY NAMES    Y02020*/ 00069000
*           &RCDCINO^=CATCCI)|      /* AND NOT A CATALOG       Y02020*/ 00070000
*           CTGTYPE=CTGTPGSP THEN   /* OR REQUEST = PAGESPACE  Y02020*/ 00071000
         L     @10,CCACPL(,R11)                                    0222 00072000
         L     @05,CCAURAB(,R11)                                   0222 00073000
         L     @05,CCACPE1(,@05)                                   0222 00074000
         CLC   CTGTYPE(1,@10),RCDID(@05)                           0222 00075000
         BNE   @GL00005                                            0222 00076000
         L     @10,CTGENT(,@10)                                    0222 00077000
         CLC   CNAME(44,@05),REQNAME(@10)                          0222 00078000
         BNE   @GL00005                                            0222 00079000
         CLC   RCDCINO(3,@05),@CF00055+1                           0222 00080000
         BNE   @RT00222                                            0222 00081000
@GL00005 L     @10,CCACPL(,R11)                                    0222 00082000
         CLI   CTGTYPE(@10),C'P'                                   0222 00083000
         BNE   @RF00222                                            0222 00084000
@RT00222 DS    0H                                                  0223 00085000
*         DO;                       /* YES-VALID REQUEST     @Y30SSPJ*/ 00086000
*           IF CTGTYPE^=CTGTALIN THEN/* REQ TYPE ALIEN?      @Y30SSPJ*/ 00087000
         L     @10,CCACPL(,R11)                                    0224 00088000
         CLI   CTGTYPE(@10),C'A'                                   0224 00089000
         BE    @RF00224                                            0224 00090000
*             DO;                   /* NO-NOT ALIEN TYPE     @Y30SSPJ*/ 00091000
*               IF CAXF2REC=ON THEN /* RECOVERY CATALOG?     @Y30SSPJ*/ 00092000
         L     @05,CCAACB(,R11)                                    0226 00093000
         L     @05,ACBUAPTR(,@05)                                  0226 00094000
         TM    CAXF2REC(@05),B'00000010'                           0226 00095000
         BNO   @RF00226                                            0226 00096000
*                 IF CTGNSVS=ON THEN/* YES-VOL CLEAN-UP?     @Y30SSPJ*/ 00097000
         TM    CTGNSVS(@10),B'10000000'                            0227 00098000
         BNO   @RF00227                                            0227 00099000
*                   DO;             /* YES-VOLUME CLEAN UP   @Y30SSPJ*/ 00100000
*                                                                  0228 00101000
*                     /***********************************************/ 00102000
*                     /*                                             */ 00103000
*                     /* SET CCAMODID='BG', CCAREASN=RSN22,          */ 00104000
*                     /* CCARETRN=RCINFUNC                           */ 00105000
*                     /*                                             */ 00106000
*                     /***********************************************/ 00107000
*                                                                  0229 00108000
*                     CCAPROB=IGGSEGID+(RSN22*K256)+RCINFUNC;/* VOL     00109000
*                                      CLEAN-UP NOT ALLOWED ON CRA 0229 00110000
*                                      CAT                   @Y30SSPJ*/ 00111000
         MVC   CCAPROB(4,R11),@CF04748                             0229 00112000
*Z005DLXT:                                                         0230 00113000
*                     CALL IGGPDLXT;/* ERROR EXIT            @Y30SSPJ*/ 00114000
Z005DLXT L     @15,@CV04531                                        0230 00115000
         BALR  @14,@15                                             0230 00116000
*                   END;            /*                       @Y30SSPJ*/ 00117000
*                 ELSE              /* NOT VOLUME CLEAN-UP   @Y30SSPJ*/ 00118000
*                   IF CTGDDNM=N THEN/* FILE SPECIFIED?      @Y30SSPJ*/ 00119000
         B     @RC00227                                            0232 00120000
@RF00227 L     @10,CCACPL(,R11)                                    0232 00121000
         L     @10,CTGDDNM(,@10)                                   0232 00122000
         LTR   @10,@10                                             0232 00123000
         BNZ   @RF00232                                            0232 00124000
*                     DO;           /* NO-FILE NOT SPECIFIED @Y30SSPJ*/ 00125000
*                                                                  0233 00126000
*                       /*********************************************/ 00127000
*                       /*                                           */ 00128000
*                       /* SET CCAMODID='BG', CCAREASN=RSN36,        */ 00129000
*                       /* CCARETRN=RCINDER                          */ 00130000
*                       /*                                           */ 00131000
*                       /*********************************************/ 00132000
*                                                                  0234 00133000
*                       CCAPROB=IGGSEGID+(RSN36*K256)+RCINDER;/*   0234 00134000
*                                      DDNAME NOT SPECIFIED FOR CRA     00135000
*                                      VOL                   @Y30SSPJ*/ 00136000
         MVC   CCAPROB(4,R11),@CF04751                             0234 00137000
*Z007DLXT:                                                         0235 00138000
*                       CALL IGGPDLXT;/* ERROR EXIT          @Y30SSPJ*/ 00139000
Z007DLXT L     @15,@CV04531                                        0235 00140000
         BALR  @14,@15                                             0235 00141000
*                     END;          /*                       @Y30SSPJ*/ 00142000
*                   ELSE            /* YES-FILE SPECIFIED    @Y30SSPJ*/ 00143000
*                                                                  0237 00144000
*                     /***********************************************/ 00145000
*                     /*                                             */ 00146000
*                     /* CALL TO MODULE IGG0CLA7                     */ 00147000
*                     /*                                             */ 00148000
*                     /***********************************************/ 00149000
*                                                                  0237 00150000
*Z008MCRA:                                                         0237 00151000
*                     CALL IGGPMCRA;/* ASSURE CRA MOUNTED    @Y30SSPJ*/ 00152000
         B     @RC00232                                            0237 00153000
@RF00232 DS    0H                                                  0237 00154000
Z008MCRA L     @15,@CV04520                                        0237 00155000
         BALR  @14,@15                                             0237 00156000
*               ELSE                                               0238 00157000
*                 ;                 /* NOT RECOVERABLE CATLG @Y30SSPJ*/ 00158000
*                                                                  0238 00159000
@RF00226 DS    0H                                                  0239 00160000
*               /*****************************************************/ 00161000
*               /*                                                   */ 00162000
*               /* IF THE DELETE REQUEST DOES NOT HAVE THE PURGE     */ 00163000
*               /* OPTION INDICATED, CHECK THE OBJECT RECORD @Y30SSPJ*/ 00164000
*               /* EXPIRATION DATE TO DETERMINE IF DELETION  @Y30SSPJ*/ 00165000
*               /* IS ALLOWABLE YET.                         @Y30SSPJ*/ 00166000
*               /*                                                   */ 00167000
*               /*****************************************************/ 00168000
*                                                                  0239 00169000
*               IF CTGPURG=ON THEN                                 0239 00170000
@RC00226 L     @10,CCACPL(,R11)                                    0239 00171000
         TM    CTGPURG(@10),B'00100000'                            0239 00172000
         BO    @RT00239                                            0239 00173000
*                 ;                 /* PURGE REQUEST?        @Y30SSPJ*/ 00174000
*               ELSE                /* NO,CHECK EXP DATE     @Y30SSPJ*/ 00175000
*                                                                  0241 00176000
*                 /***************************************************/ 00177000
*                 /*                                                 */ 00178000
*                 /* CHECK EXPIRATION DATE                   @Y30SSPJ*/ 00179000
*                 /*                                                 */ 00180000
*                 /***************************************************/ 00181000
*                                                                  0241 00182000
*                 IF CVTDATE(2:4)^<CEXP THEN                       0241 00183000
         L     @10,CCAURAB(,R11)                                   0241 00184000
         L     @10,CCACPE1(,@10)                                   0241 00185000
         L     @05,CVTPTR                                          0241 00186000
         CLC   CVTDATE+1(3,@05),CEXP(@10)                          0241 00187000
         BNL   @RT00241                                            0241 00188000
*                   ;               /* CURR DATE < EXP DATE? @Y30SSPJ*/ 00189000
*                 ELSE              /* YES-DO NOT DELETE     @Y30SSPJ*/ 00190000
*                   DO;             /*                       @Y30SSPJ*/ 00191000
*                                                                  0243 00192000
*                     /***********************************************/ 00193000
*                     /*                                             */ 00194000
*                     /* SET CCAMODID='BG', CCAREASN=RSN0,           */ 00195000
*                     /* CCARETRN=RCDATE                             */ 00196000
*                     /*                                             */ 00197000
*                     /***********************************************/ 00198000
*                                                                  0244 00199000
*                     CCAPROB=IGGSEGID+(RSN0*K256)+RCDATE;/* SET NOT    00200000
*                                      EXP RET CODE          @Y30SSPJ*/ 00201000
         MVC   CCAPROB(4,R11),@CF04752                             0244 00202000
*Z010DLXT:                                                         0245 00203000
*                     CALL IGGPDLXT;/* ERROR EXIT            @Y30SSPJ*/ 00204000
Z010DLXT L     @15,@CV04531                                        0245 00205000
         BALR  @14,@15                                             0245 00206000
*                   END;            /*                       @Y30SSPJ*/ 00207000
*                                                                  0246 00208000
*               /*****************************************************/ 00209000
*               /*                                                   */ 00210000
*               /* THE DATE CHECK PROCESS WAS SUCCESSFUL.    @Y30SSPJ*/ 00211000
*               /* EXTRACT THE ASSOCIATIONS                  @Y30SSPJ*/ 00212000
*               /*                                                   */ 00213000
*               /*****************************************************/ 00214000
*                                                                  0247 00215000
*Z011DEXA:                                                         0247 00216000
*               CALL IGGPDEXA;      /*                       @Y30SSPJ*/ 00217000
*                                                                  0247 00218000
@RT00241 DS    0H                                                  0247 00219000
@RT00239 DS    0H                                                  0247 00220000
Z011DEXA BAL   @14,IGGPDEXA                                        0247 00221000
*               /*****************************************************/ 00222000
*               /*                                                   */ 00223000
*               /* CHECK IF EXPLICIT DELETE PATH ENTRY.      @Y30SSPJ*/ 00224000
*               /*                                                   */ 00225000
*               /*****************************************************/ 00226000
*                                                                  0248 00227000
*               IF CTGTYPE=CTGTPATH THEN/* DELETE PATH?      @Y30SSPJ*/ 00228000
*                                                                  0248 00229000
         L     @10,CCACPL(,R11)                                    0248 00230000
         CLI   CTGTYPE(@10),C'R'                                   0248 00231000
         BNE   @RF00248                                            0248 00232000
*                 /***************************************************/ 00233000
*                 /*                                                 */ 00234000
*                 /* CALL TO MODULE IGG0CLB5                         */ 00235000
*                 /*                                                 */ 00236000
*                 /***************************************************/ 00237000
*                                                                  0249 00238000
*Z012DEPT:                                                         0249 00239000
*                 CALL IGGPDEPT;    /* YES-DELETE THE PATH   @Y30SSPJ*/ 00240000
Z012DEPT L     @15,@CV04529                                        0249 00241000
         BALR  @14,@15                                             0249 00242000
*               ELSE                /* NO-NOT DELETE PATH    @Y30SSPJ*/ 00243000
*                 DO;               /*                       @Y30SSPJ*/ 00244000
         B     @RC00248                                            0250 00245000
@RF00248 DS    0H                                                  0251 00246000
*                   IF RCDID^='C'|  /* NOT CLUSTER           @Z40WSSM*/ 00247000
*                       CPGSP=OFF THEN/* NOT PAGESPACE       @Z40WSSM*/ 00248000
         L     @10,CCAURAB(,R11)                                   0251 00249000
         L     @10,CCACPE1(,@10)                                   0251 00250000
         CLI   RCDID(@10),C'C'                                     0251 00251000
         BNE   @RT00251                                            0251 00252000
         TM    CPGSP(@10),B'00000001'                              0251 00253000
         BNZ   @RF00251                                            0251 00254000
@RT00251 DS    0H                                                  0252 00255000
*                     DO;           /* NOT EITHER            @Z40WSSM*/ 00256000
*Z013DOPN:                                                         0253 00257000
*                       CALL IGGPDOPN;/* DATA SET OPEN CHECK @Y30SSPJ*/ 00258000
*                                                                  0253 00259000
Z013DOPN BAL   @14,IGGPDOPN                                        0253 00260000
*                       /*********************************************/ 00261000
*                       /*                                           */ 00262000
*                       /* CHECK IF INDEX AND/OR DATA IS OPEN        */ 00263000
*                       /*                                   @Y30SSPJ*/ 00264000
*                       /*                                           */ 00265000
*                       /*********************************************/ 00266000
*                                                                  0254 00267000
*                       IF CCACD1=RCS THEN                         0254 00268000
         CLI   CCACD1(R11),0                                       0254 00269000
         BE    @RT00254                                            0254 00270000
*                         ;         /* DATA SET OPEN?        @Y30SSPJ*/ 00271000
*                       ELSE        /* YES-DATA SET OPEN     @Y30SSPJ*/ 00272000
*Z014DLXT:                                                         0256 00273000
*                         CALL IGGPDLXT;/* ERROR EXIT        @Y30SSPJ*/ 00274000
Z014DLXT L     @15,@CV04531                                        0256 00275000
         BALR  @14,@15                                             0256 00276000
*                     END;          /*                       @Z40WSSM*/ 00277000
*                   ELSE            /* PAGESPACE             @Z40WSSM*/ 00278000
*                     DO;           /*                       @Z40WSSM*/ 00279000
         B     @RC00251                                            0258 00280000
@RF00251 DS    0H                                                  0259 00281000
*                       CCASRID=DELACI(ONE);/* D OBJ CI NUM. @Z40WSSM*/ 00282000
         L     @10,CCACMSWA(,R11)                                  0259 00283000
         MVC   CCASRID(3,R11),DELACI(@10)                          0259 00284000
*                       DO;                                        0260 00285000
*                         CCAF1KEY=OFF;/* GET BY CI NO.              */ 00286000
*                         CCAF1KGE=OFF;/* NOT GET NEXT               */ 00287000
*                         CCAF1UP=ON;/* GET FOR UPD                  */ 00288000
         OI    CCAF1UP(R11),B'00000010'                            0263 00289000
         NI    CCAF1KEY(R11),B'11100111'                           0263 00290000
*                         CCAURAB=ADDR(CCARAB3);/* SET RAB PTR       */ 00291000
*                                                                  0264 00292000
         LA    @10,CCARAB3(,R11)                                   0264 00293000
         ST    @10,CCAURAB(,R11)                                   0264 00294000
*                         /*******************************************/ 00295000
*                         /*                                         */ 00296000
*                         /* CALL TO MODULE IGG0CLBI                 */ 00297000
*                         /*                                         */ 00298000
*                         /*******************************************/ 00299000
*                                                                  0265 00300000
*Z016GET:                                                          0265 00301000
*                         CALL IGGPGET;/* GET RECORD                 */ 00302000
Z016GET  L     @15,@CV04523                                        0265 00303000
         BALR  @14,@15                                             0265 00304000
*                       END;        /* D OBJECT IN RAB 3     @Z40WSSM*/ 00305000
*                       IF CCACD1^=RCS THEN/* ERROR ON GET   @Z40WSSM*/ 00306000
         CLI   CCACD1(R11),0                                       0267 00307000
         BE    @RF00267                                            0267 00308000
*Z017DLXT:                                                         0268 00309000
*                         CALL IGGPDLXT;/* CLEANUP AND EXIT  @Z40WSSM*/ 00310000
Z017DLXT L     @15,@CV04531                                        0268 00311000
         BALR  @14,@15                                             0268 00312000
*                       ELSE                                       0269 00313000
*                         ;         /* NO ERROR ON GET       @Z40WSSM*/ 00314000
*                                                                  0269 00315000
@RF00267 DS    0H                                                  0270 00316000
*                       /*********************************************/ 00317000
*                       /*                                           */ 00318000
*                       /* CALL TO MODULE IGG0CLA7                   */ 00319000
*                       /*                                           */ 00320000
*                       /*********************************************/ 00321000
*                                                                  0270 00322000
*Z018DEMV:                                                         0270 00323000
*                       CALL IGGPDEMV;/* EXTRACT MINIMUM VGO @Z40WSSM*/ 00324000
Z018DEMV L     @15,@CV04516                                        0270 00325000
         BALR  @14,@15                                             0270 00326000
*                       RFY                                        0271 00327000
*                         GVO BASED(ADDR(DELVGO));/*         @Z40WSSM*/ 00328000
*                       R14=CVTILK2;/* UCB LOOKUP TABLE      @Z40WSSM*/ 00329000
         L     @10,CVTPTR                                          0272 00330000
         L     R14,CVTILK2(,@10)                                   0272 00331000
*                       DO WHILE(LUTSLOT^=LUTEND);/* LOOP THROUGH UCB   00332000
*                                      LOOKUP TABLE          @Z40WSSM*/ 00333000
         B     @DE00273                                            0273 00334000
@DL00273 DS    0H                                                  0274 00335000
*                         R1=LUTSLOT;/* POINT TO A UCB       @Z40WSSM*/ 00336000
         LH    R1,LUTSLOT(,R14)                                    0274 00337000
         N     R1,@CF04789                                         0274 00338000
*                         IF R1^=N& /* VALID UCB ADDRESS     @Z40WSSM*/ 00339000
*                             UCB3DACC=ON&/* DIR ACCESS UCB  @Z40WSSM*/ 00340000
*                             UCBPGFL=ON&/* ACTIVE PAGESPACE @Z40WSSM*/ 00341000
*                             UCBVOLI=CMFLVOL THEN/* MIGHT BE THIS 0275 00342000
*                                      PAGESPACE             @Z40WSSM*/ 00343000
         LTR   R1,R1                                               0275 00344000
         BZ    @RF00275                                            0275 00345000
         TM    UCB3DACC(R1),B'00100000'                            0275 00346000
         BNO   @RF00275                                            0275 00347000
         TM    UCBPGFL(R1),B'01000000'                             0275 00348000
         BNO   @RF00275                                            0275 00349000
         L     @10,CCACMSWA(,R11)                                  0275 00350000
         CLC   UCBVOLI(6,R1),CMFLVOL+274(@10)                      0275 00351000
         BNE   @RF00275                                            0275 00352000
*                           DO;     /* ALL OF THE ABOVE      @Z40WSSM*/ 00353000
*                                                                  0276 00354000
*                             /***************************************/ 00355000
*                             /*                                     */ 00356000
*                             /* SET CCAMODID='BG', CCAREASN=RSN6,   */ 00357000
*                             /* CCARETRN=RCDSO                      */ 00358000
*                             /*                                     */ 00359000
*                             /***************************************/ 00360000
*                                                                  0277 00361000
*                             CCAPROB=IGGSEGID+(RSN6*K256)+RCDSO;/*     00362000
*                                      PAGESPACE VOLUME WITH ACTIVE     00363000
*                                      (OPEN) PAGESPACE      @Z40WSSM*/ 00364000
         MVC   CCAPROB(4,R11),@CF04756                             0277 00365000
*Z020DLXT:                                                         0278 00366000
*                             CALL IGGPDLXT;/* CLEANUP AND   @Z40WSSM   00367000
*                                      EXIT                  @Z40WSSM*/ 00368000
Z020DLXT L     @15,@CV04531                                        0278 00369000
         BALR  @14,@15                                             0278 00370000
*                           END;    /*                       @Z40WSSM*/ 00371000
*                         ELSE                                     0280 00372000
*                           R14=R14+LENGTH(LUTSLOT);/* GET NEXT UCB     00373000
*                                      TO CHECK              @Z40WSSM*/ 00374000
         B     @RC00275                                            0280 00375000
@RF00275 AL    R14,@CF00055                                        0280 00376000
*                       END;        /* END LOOKUP TABLE SCAN @Z40WSSM*/ 00377000
@RC00275 DS    0H                                                  0281 00378000
@DE00273 CLC   LUTSLOT(2,R14),LUTEND                               0281 00379000
         BNE   @DL00273                                            0281 00380000
*                     END;          /* END PAGESPACE         @Z40WSSM*/ 00381000
*                                                                  0282 00382000
*                   /*************************************************/ 00383000
*                   /*                                               */ 00384000
*                   /* LOOP THROUGH THE DELETE PROCESS FOR ALL       */ 00385000
*                   /* ASSOCIATED OBJECTS.                   @Y30SSPJ*/ 00386000
*                   /* CHECK FIRST FOR VARIOUS USER ERRORS SITUATIONS*/ 00387000
*                   /* CHECK IF THE OBJECTS ARE UNIQUE AND IF DD     */ 00388000
*                   /* STMNTS GIVEN                                  */ 00389000
*                   /*                                               */ 00390000
*                   /*************************************************/ 00391000
*                                                                  0283 00392000
*                   IF CTGNSVS=ON THEN                             0283 00393000
@RC00251 L     @10,CCACPL(,R11)                                    0283 00394000
         TM    CTGNSVS(@10),B'10000000'                            0283 00395000
         BO    @RT00283                                            0283 00396000
*                     ;             /* IF CAT CLEANUP,BYPASS DD CHECK   00397000
*                                                            @ZA00605*/ 00398000
*                   ELSE            /* NOT CAT CLEANUP REQUEST     0285 00399000
*                                                            @ZA00605*/ 00400000
*                     DO DELR3SAV=INCR TO DELNMOBJ;/* DO FOR ALL   0285 00401000
*                                      OBJECTS               @Y30SSPJ*/ 00402000
         LA    @10,1                                               0285 00403000
         B     @DE00285                                            0285 00404000
@DL00285 DS    0H                                                  0286 00405000
*                       CCASRID=DELACI(DELR3SAV);/* GET THE OBJECT CI   00406000
*                                      NO.                   @Y30SSPJ*/ 00407000
         L     @10,CCACMSWA(,R11)                                  0286 00408000
         SLR   @05,@05                                             0286 00409000
         IC    @05,DELR3SAV(,@10)                                  0286 00410000
         SLA   @05,2                                               0286 00411000
         ALR   @10,@05                                             0286 00412000
         MVC   CCASRID(3,R11),DELACI-4(@10)                        0286 00413000
*                       DO;                                        0287 00414000
*                         CCAF1KEY=OFF;/* GET BY CI NO.              */ 00415000
*                         CCAF1KGE=OFF;/* NOT GET NEXT               */ 00416000
*                         CCAF1UP=ON;/* GET FOR UPD                  */ 00417000
         OI    CCAF1UP(R11),B'00000010'                            0290 00418000
         NI    CCAF1KEY(R11),B'11100111'                           0290 00419000
*                         CCAURAB=ADDR(CCARAB2);/* SET RAB PTR       */ 00420000
*                                                                  0291 00421000
         LA    @10,CCARAB2(,R11)                                   0291 00422000
         ST    @10,CCAURAB(,R11)                                   0291 00423000
*                         /*******************************************/ 00424000
*                         /*                                         */ 00425000
*                         /* CALL TO MODULE IGG0CLBI                 */ 00426000
*                         /*                                         */ 00427000
*                         /*******************************************/ 00428000
*                                                                  0292 00429000
*Z022GET:                                                          0292 00430000
*                         CALL IGGPGET;/* GET RECORD                 */ 00431000
Z022GET  L     @15,@CV04523                                        0292 00432000
         BALR  @14,@15                                             0292 00433000
*                       END;        /* GET OBJECT IN RA 2    @Y30SSPJ*/ 00434000
*                                                                  0293 00435000
*                       /*********************************************/ 00436000
*                       /*                                           */ 00437000
*                       /* CHECK IF GET FAILED               @Y30SSPJ*/ 00438000
*                       /*                                           */ 00439000
*                       /*********************************************/ 00440000
*                                                                  0294 00441000
*                       IF CCACD1^=RCS THEN                        0294 00442000
         CLI   CCACD1(R11),0                                       0294 00443000
         BNE   @RT00294                                            0294 00444000
*                         ;         /* GET ERROR?            @Y30SSPJ*/ 00445000
*                       ELSE        /* NO-NO GET ERROR       @Y30SSPJ*/ 00446000
*                         DO;       /*                       @Y30SSPJ*/ 00447000
*                                                                  0296 00448000
*                           /*****************************************/ 00449000
*                           /*                                       */ 00450000
*                           /* PROCEED ONLY IF USABLE DATA RECORD    */ 00451000
*                           /*                               @Y30SSPJ*/ 00452000
*                           /*                                       */ 00453000
*                           /*****************************************/ 00454000
*                                                                  0297 00455000
*                           IF RCDID^=CTGTDATA|/* DATA ENTRY RECORD     00456000
*                                      AND                   @Y30SSPJ*/ 00457000
*                               CNUS=ON THEN                       0297 00458000
         L     @10,CCAURAB(,R11)                                   0297 00459000
         L     @10,CCACPE1(,@10)                                   0297 00460000
         CLI   RCDID(@10),C'D'                                     0297 00461000
         BNE   @RT00297                                            0297 00462000
         TM    CNUS(@10),B'00000001'                               0297 00463000
         BO    @RT00297                                            0297 00464000
*                             ;     /* DATA SET USABLE?      @Y30SSPJ*/ 00465000
*                           ELSE    /* YES-DATA TYPE RECORD  @Y30SSPJ*/ 00466000
*                                                                  0299 00467000
*                             /***************************************/ 00468000
*                             /*                                     */ 00469000
*                             /* CHECK IF ERASE PROCESSING IS        */ 00470000
*                             /* REQUIRED                    @Y30SSPJ*/ 00471000
*                             /*                                     */ 00472000
*                             /***************************************/ 00473000
*                                                                  0299 00474000
*                             IF CTGERASE=OFF&/* ERASE REQUESTED OR     00475000
*                                                            @Y30SSPJ*/ 00476000
*                                 (CTGOVRID=ON|/* NO OVERRIDE AND  0299 00477000
*                                                            @Y30SSPJ*/ 00478000
*                                 CERASE=OFF) THEN                 0299 00479000
         L     @10,CCACPL(,R11)                                    0299 00480000
         TM    CTGERASE(@10),B'01000000'                           0299 00481000
         BNZ   @RF00299                                            0299 00482000
         TM    CTGOVRID(@10),B'00000100'                           0299 00483000
         BO    @RT00299                                            0299 00484000
         L     @10,CCAURAB(,R11)                                   0299 00485000
         L     @10,CCACPE1(,@10)                                   0299 00486000
         TM    CERASE(@10),B'00010000'                             0299 00487000
         BZ    @RT00299                                            0299 00488000
*                               ;   /* REQUESTED AT DEFINE   @Y30SSPJ*/ 00489000
*                             ELSE  /* YES-ERASE REQUESTED   @Y30SSPJ*/ 00490000
*                               DO; /*                       @Y30SSPJ*/ 00491000
@RF00299 DS    0H                                                  0302 00492000
*Z023ERAS:                                                         0302 00493000
*                                 CALL IGGPERAS;/* DO ERASE        0302 00494000
*                                      PROCESSING            @Y30SSPJ*/ 00495000
Z023ERAS BAL   @14,IGGPERAS                                        0302 00496000
*                                 CCASRCIN=DELACI(DELNMOBJ+INCR);/*     00497000
*                                      BASE CI NUMBER        @Y30SSPJ*/ 00498000
         L     @10,CCACMSWA(,R11)                                  0303 00499000
         SLR   @05,@05                                             0303 00500000
         IC    @05,DELNMOBJ(,@10)                                  0303 00501000
         SLA   @05,2                                               0303 00502000
         ALR   @10,@05                                             0303 00503000
         MVC   CCASRCIN(3,R11),DELACI(@10)                         0303 00504000
*                                 DO;                              0304 00505000
*                                   CCAF1KEY=OFF;/* GET BY CI NO.    */ 00506000
*                                   CCAF1KGE=OFF;/* NOT GET NEXT     */ 00507000
*                                   CCAF1UP=ON;/* GET FOR UPD        */ 00508000
         OI    CCAF1UP(R11),B'00000010'                            0307 00509000
         NI    CCAF1KEY(R11),B'11100111'                           0307 00510000
*                                   CCAURAB=ADDR(CCARAB1);/* SET RAB    00511000
*                                      PTR                           */ 00512000
*                                                                  0308 00513000
         LA    @10,CCARAB1(,R11)                                   0308 00514000
         ST    @10,CCAURAB(,R11)                                   0308 00515000
*                                   /*********************************/ 00516000
*                                   /*                               */ 00517000
*                                   /* CALL TO MODULE IGG0CLBI       */ 00518000
*                                   /*                               */ 00519000
*                                   /*********************************/ 00520000
*                                                                  0309 00521000
*Z025GET:                                                          0309 00522000
*                                   CALL IGGPGET;/* GET RECORD       */ 00523000
Z025GET  L     @15,@CV04523                                        0309 00524000
         BALR  @14,@15                                             0309 00525000
*                                 END;/* RE-GET BASE RECORD  @Y30SSPJ*/ 00526000
*                                                                  0310 00527000
*                                 /***********************************/ 00528000
*                                 /*                                 */ 00529000
*                                 /* DETERMINE IF BASE CLUSTER/AIX   */ 00530000
*                                 /* WAS                     @Y30SSPJ*/ 00531000
*                                 /* DELETED WHILE THE ERASE PROCESS */ 00532000
*                                 /*                         @Y30SSPJ*/ 00533000
*                                 /* BEING PERFORMED         @Y30SSPJ*/ 00534000
*                                 /*                                 */ 00535000
*                                 /***********************************/ 00536000
*                                                                  0311 00537000
*                                 IF CCACD1=RCS THEN               0311 00538000
         CLI   CCACD1(R11),0                                       0311 00539000
         BE    @RT00311                                            0311 00540000
*                                   ;/* GET ERROR?           @Y30SSPJ*/ 00541000
*                                 ELSE/* YES-GET ERROR       @Y30SSPJ*/ 00542000
*Z026DLXT:                                                         0313 00543000
*                                   CALL IGGPDLXT;/* ERROR EXIT    0313 00544000
*                                                            @Y30SSPJ*/ 00545000
Z026DLXT L     @15,@CV04531                                        0313 00546000
         BALR  @14,@15                                             0313 00547000
*Z027DEXA:                                                         0314 00548000
*                                 CALL IGGPDEXA;/* RE-EXTRACT      0314 00549000
*                                      ASSOCIATION           @Y30SSPJ*/ 00550000
@RT00311 DS    0H                                                  0314 00551000
Z027DEXA BAL   @14,IGGPDEXA                                        0314 00552000
*                               END;/*                       @Y30SSPJ*/ 00553000
*                                                                  0315 00554000
*                           /*****************************************/ 00555000
*                           /*                                       */ 00556000
*                           /* CHECK IF OBJECT IS UNIQUE AND IF SO   */ 00557000
*                           /*                               @Y30SSPJ*/ 00558000
*                           /* MAKE SURE FILE WAS SPECIFIED. @Y30SSPJ*/ 00559000
*                           /*                                       */ 00560000
*                           /*****************************************/ 00561000
*                                                                  0316 00562000
*                           IF CCAR2REC->CUNIQ=OFF THEN            0316 00563000
@RT00299 DS    0H                                                  0316 00564000
@RT00297 L     @10,CCAR2REC(,R11)                                  0316 00565000
         TM    CUNIQ(@10),B'01000000'                              0316 00566000
         BZ    @RT00316                                            0316 00567000
*                             ;     /* UNIQUE DS?            @Y30SSPJ*/ 00568000
*                           ELSE    /* YES-UNIQUE DATA SET   @Y30SSPJ*/ 00569000
*Z028DDCK:                                                         0318 00570000
*                             CALL IGGPDDCK;/* CHECK DDNAME  @Y30SSPJ*/ 00571000
Z028DDCK BAL   @14,IGGPDDCK                                        0318 00572000
*                         END;      /*                       @Y30SSPJ*/ 00573000
*                                                                  0319 00574000
@RT00316 DS    0H                                                  0320 00575000
*                       /*********************************************/ 00576000
*                       /*                                           */ 00577000
*                       /* CLEAR CCAMODID, CCAREASN, AND CCARETRN    */ 00578000
*                       /*                                           */ 00579000
*                       /*********************************************/ 00580000
*                                                                  0320 00581000
*                       CCAPROB=IGNOREIT;/* RESET ERROR CODE @Y30SSPJ*/ 00582000
@RT00294 SLR   @10,@10                                             0320 00583000
         ST    @10,CCAPROB(,R11)                                   0320 00584000
*                     END;                                         0321 00585000
         L     @05,CCACMSWA(,R11)                                  0321 00586000
         LA    @10,1                                               0321 00587000
         SLR   @15,@15                                             0321 00588000
         IC    @15,DELR3SAV(,@05)                                  0321 00589000
         ALR   @10,@15                                             0321 00590000
@DE00285 L     @05,CCACMSWA(,R11)                                  0321 00591000
         STC   @10,DELR3SAV(,@05)                                  0321 00592000
         L     @05,CCACMSWA(,R11)                                  0321 00593000
         SLR   @15,@15                                             0321 00594000
         IC    @15,DELNMOBJ(,@05)                                  0321 00595000
         CR    @10,@15                                             0321 00596000
         BNH   @DL00285                                            0321 00597000
*                   CCAURAB=ADDR(CCARAB1);/* RESTORE BASE RAB      0322 00598000
*                                                            @Y30SSPJ*/ 00599000
*                                                                  0322 00600000
@RT00283 LA    @10,CCARAB1(,R11)                                   0322 00601000
         ST    @10,CCAURAB(,R11)                                   0322 00602000
*                   /*************************************************/ 00603000
*                   /*                                               */ 00604000
*                   /* IF EXPLICIT AIX DELETION CALL DELETE AIX      */ 00605000
*                   /* ROUTINE                               @Y30SSPJ*/ 00606000
*                   /*                                               */ 00607000
*                   /*************************************************/ 00608000
*                                                                  0323 00609000
*                   IF CTGTYPE=CTGTAIX THEN/* EXPLICIT DELETE AIX? 0323 00610000
*                                                            @Y30SSPJ*/ 00611000
*                                                                  0323 00612000
         L     @10,CCACPL(,R11)                                    0323 00613000
         CLI   CTGTYPE(@10),C'G'                                   0323 00614000
         BNE   @RF00323                                            0323 00615000
*                     /***********************************************/ 00616000
*                     /*                                             */ 00617000
*                     /* CALL TO MODULE IGG0CLB5                     */ 00618000
*                     /*                                             */ 00619000
*                     /***********************************************/ 00620000
*                                                                  0324 00621000
*Z030DEAX:                                                         0324 00622000
*                     CALL IGGPDEAX;/* YES-CALL DELETE AIX   @Y30SSPJ*/ 00623000
Z030DEAX L     @15,@CV04527                                        0324 00624000
         BALR  @14,@15                                             0324 00625000
*                   ELSE            /* NO-NOT DELETE AIX     @Y30SSPJ*/ 00626000
*                                                                  0325 00627000
*                     /***********************************************/ 00628000
*                     /*                                             */ 00629000
*                     /* CHECK IF THIS IS EXPLICIT DELETE CLUSTER    */ 00630000
*                     /*                                     @Y30SSPJ*/ 00631000
*                     /*                                             */ 00632000
*                     /***********************************************/ 00633000
*                                                                  0325 00634000
*                     IF CTGTYPE^=CTGTCL THEN                      0325 00635000
         B     @RC00323                                            0325 00636000
@RF00323 L     @10,CCACPL(,R11)                                    0325 00637000
         CLI   CTGTYPE(@10),C'C'                                   0325 00638000
         BNE   @RT00325                                            0325 00639000
*                       ;           /* DELETE CLUSTER?       @Y30SSPJ*/ 00640000
*                     ELSE          /* YES-CLUSTER DELETION  @Y30SSPJ*/ 00641000
*                       DO;         /*                       @Y30SSPJ*/ 00642000
*                                                                  0327 00643000
*                         /*******************************************/ 00644000
*                         /*                                         */ 00645000
*                         /* CALL TO MODULE IGG0CLB5                 */ 00646000
*                         /*                                         */ 00647000
*                         /*******************************************/ 00648000
*                                                                  0328 00649000
*Z031DIAX:                                                         0328 00650000
*                         CALL IGGPDIAX;/* CALL DELETE AIX   @Y30SSPJ*/ 00651000
Z031DIAX L     @15,@CV04526                                        0328 00652000
         BALR  @14,@15                                             0328 00653000
*                         DELGNMR=ON;/* INDICATE EXTRACT PATHS     0329 00654000
*                                                            @Y30SSPJ*/ 00655000
         L     @10,CCACMSWA(,R11)                                  0329 00656000
         OI    DELGNMR(@10),B'00001000'                            0329 00657000
*Z032DEXA:                                                         0330 00658000
*                         CALL IGGPDEXA;/* EXTRACT THE PATHS @Y30SSPJ*/ 00659000
*                                                                  0330 00660000
Z032DEXA BAL   @14,IGGPDEXA                                        0330 00661000
*                         /*******************************************/ 00662000
*                         /*                                         */ 00663000
*                         /* CALL TO MODULE IGG0CLB5                 */ 00664000
*                         /*                                         */ 00665000
*                         /*******************************************/ 00666000
*                                                                  0331 00667000
*Z033DIPT:                                                         0331 00668000
*                         CALL IGGPDIPT;/* DELETE ALL PATHS  @Y30SSPJ*/ 00669000
*                                                                  0331 00670000
Z033DIPT L     @15,@CV04528                                        0331 00671000
         BALR  @14,@15                                             0331 00672000
*                         /*******************************************/ 00673000
*                         /*                                         */ 00674000
*                         /* CALL TO MODULE IGG0CLB5                 */ 00675000
*                         /*                                         */ 00676000
*                         /*******************************************/ 00677000
*                                                                  0332 00678000
*Z034DUPG:                                                         0332 00679000
*                         CALL IGGPDUPG;/* DELETE UPGRADE ENTRY    0332 00680000
*                                                            @Y30SSPJ*/ 00681000
*                                                                  0332 00682000
Z034DUPG L     @15,@CV04532                                        0332 00683000
         BALR  @14,@15                                             0332 00684000
*                         /*******************************************/ 00685000
*                         /*                                         */ 00686000
*                         /* IF RECORD FOLLOWING THE CLUSTER IS A    */ 00687000
*                         /* CCR,                            @Y30SSPJ*/ 00688000
*                         /* TYPE=L, ASSUME THIS IS A SOURCE CATALOG */ 00689000
*                         /* TO                              @Y30SSPJ*/ 00690000
*                         /* BE DELETED.                     @Y30SSPJ*/ 00691000
*                         /*                                         */ 00692000
*                         /*******************************************/ 00693000
*                                                                  0333 00694000
*                         CCASRID=RCDCINO+INCR;/* SET CI OF NEXT   0333 00695000
*                                      RECORD                @Y30SSPJ*/ 00696000
         L     @10,CCAURAB(,R11)                                   0333 00697000
         L     @10,CCACPE1(,@10)                                   0333 00698000
         LA    @05,1                                               0333 00699000
         L     @10,RCDCINO-1(,@10)                                 0333 00700000
         LA    @10,0(,@10)                                         0333 00701000
         ALR   @05,@10                                             0333 00702000
         STCM  @05,7,CCASRID(R11)                                  0333 00703000
*                         DO;                                      0334 00704000
*                           CCAF1KEY=OFF;/* GET BY CI NO.            */ 00705000
*                           CCAF1KGE=OFF;/* NOT GET NEXT             */ 00706000
*                           CCAF1UP=ON;/* GET FOR UPD                */ 00707000
         OI    CCAF1UP(R11),B'00000010'                            0337 00708000
         NI    CCAF1KEY(R11),B'11100111'                           0337 00709000
*                           CCAURAB=ADDR(CCARAB2);/* SET RAB PTR     */ 00710000
*                                                                  0338 00711000
         LA    @10,CCARAB2(,R11)                                   0338 00712000
         ST    @10,CCAURAB(,R11)                                   0338 00713000
*                           /*****************************************/ 00714000
*                           /*                                       */ 00715000
*                           /* CALL TO MODULE IGG0CLBI               */ 00716000
*                           /*                                       */ 00717000
*                           /*****************************************/ 00718000
*                                                                  0339 00719000
*Z036GET:                                                          0339 00720000
*                           CALL IGGPGET;/* GET RECORD               */ 00721000
Z036GET  L     @15,@CV04523                                        0339 00722000
         BALR  @14,@15                                             0339 00723000
*                         END;      /* ATTEMPT TO GET CCR    @Y30SSPJ*/ 00724000
*                         IF CCACD1=RCS THEN/* GET ERROR?    @Y30SSPJ*/ 00725000
         CLI   CCACD1(R11),0                                       0341 00726000
         BNE   @RF00341                                            0341 00727000
*                           IF RCDID=CCRID THEN/* NO-CCR RECORD    0342 00728000
*                                      GOTTEN?               @Y30SSPJ*/ 00729000
         L     @10,CCAURAB(,R11)                                   0342 00730000
         L     @10,CCACPE1(,@10)                                   0342 00731000
         CLI   RCDID(@10),C'L'                                     0342 00732000
         BNE   @RF00342                                            0342 00733000
*                             DO;   /* YES-CCR RECORD GOTTEN @Y30SSPJ*/ 00734000
*                               DELCAT=ON;/* SET DELETE CATLG BIT  0344 00735000
*                                                            @Y30SSPJ*/ 00736000
         L     @10,CCACMSWA(,R11)                                  0344 00737000
         OI    DELCAT(@10),B'00010000'                             0344 00738000
*Z037DDCK:                                                         0345 00739000
*                               CALL IGGPDDCK;/* CALL DDNAME CHECK 0345 00740000
*                                      FOR DELETE COPIED CAT @ZA01487*/ 00741000
Z037DDCK BAL   @14,IGGPDDCK                                        0345 00742000
*                             END;  /*                       @Y30SSPJ*/ 00743000
*                           ELSE                                   0347 00744000
*                             ;     /* CONTINUE              @Y30SSPJ*/ 00745000
@RF00342 DS    0H                                                  0348 00746000
*                         ELSE      /* YES-GET CCR ERROR     @Y30SSPJ*/ 00747000
*                                                                  0348 00748000
*                           /*****************************************/ 00749000
*                           /*                                       */ 00750000
*                           /* CLEAR CCAMODID, CCAREASN, AND CCARETRN*/ 00751000
*                           /*                                       */ 00752000
*                           /*****************************************/ 00753000
*                                                                  0348 00754000
*                           CCAPROB=IGNOREIT;/* IGNORE GET ERROR   0348 00755000
*                                                            @Y30SSPJ*/ 00756000
         B     @RC00341                                            0348 00757000
@RF00341 SLR   @10,@10                                             0348 00758000
         ST    @10,CCAPROB(,R11)                                   0348 00759000
*                       END;        /*                       @Y30SSPJ*/ 00760000
@RC00341 DS    0H                                                  0350 00761000
*                   CCAURAB=ADDR(CCARAB1);/* RESTORE BASE RAB      0350 00762000
*                                                            @Y30SSPJ*/ 00763000
*                                                                  0350 00764000
@RT00325 DS    0H                                                  0350 00765000
@RC00323 LA    @10,CCARAB1(,R11)                                   0350 00766000
         ST    @10,CCAURAB(,R11)                                   0350 00767000
*                   /*************************************************/ 00768000
*                   /*                                               */ 00769000
*                   /* CALL TO MODULE IGG0CLB5                       */ 00770000
*                   /*                                               */ 00771000
*                   /*************************************************/ 00772000
*                                                                  0351 00773000
*Z039DCLS:                                                         0351 00774000
*                   CALL IGGPDCLS;  /* DELETE THE CLUSTER, PAGESPACE    00775000
*                                      OR AIX                @Y30SSPJ*/ 00776000
Z039DCLS L     @15,@CV04530                                        0351 00777000
         BALR  @14,@15                                             0351 00778000
*                 END;              /*                       @Y30SSPJ*/ 00779000
*             END;                                                 0353 00780000
*                                                                  0353 00781000
*           /*********************************************************/ 00782000
*           /*                                                       */ 00783000
*           /* PROCESS NON VSAM ENTRY                                */ 00784000
*           /*                                                       */ 00785000
*           /*********************************************************/ 00786000
*                                                                  0354 00787000
*           ELSE                    /* PROCESS NON VSAM              */ 00788000
*             DO;                                                  0354 00789000
*                                                                  0354 00790000
         B     @RC00224                                            0354 00791000
@RF00224 DS    0H                                                  0355 00792000
*               /*****************************************************/ 00793000
*               /*                                                   */ 00794000
*               /*                                           @Y30LSJG*/ 00795000
*               /* IF DELETE REQUEST DOES NOT HAVE THE PURGE @Y30LSJG*/ 00796000
*               /* OPTION INDICATED, CHECK THE ALIEN EXPIRATION      */ 00797000
*               /*                                           @Y30LSJG*/ 00798000
*               /* DATE TO DETERMINE IF DELETION IS ALLOWABLE YET.   */ 00799000
*               /*                                           @Y30LSJG*/ 00800000
*               /*                                           @Y30LSJG*/ 00801000
*               /*                                                   */ 00802000
*               /*****************************************************/ 00803000
*                                                                  0355 00804000
*               IF CTGPURG^=ON&     /* PURGE REQUEST ?               */ 00805000
*                   NREPLF>=LENGTH(CATRCD)+LENGTH(CNAME)+LENGTH(COWNID) 00806000
*                   +LENGTH(CCRE)+LENGTH(CEXP) THEN/* REL 2 ALIEN  0355 00807000
*                                                            @Y30LSJG*/ 00808000
         L     @10,CCACPL(,R11)                                    0355 00809000
         TM    CTGPURG(@10),B'00100000'                            0355 00810000
         BO    @RF00355                                            0355 00811000
         L     @10,CCAURAB(,R11)                                   0355 00812000
         L     @10,CCACPE1(,@10)                                   0355 00813000
         CLI   NREPLF(@10),107                                     0355 00814000
         BL    @RF00355                                            0355 00815000
*                 DO;               /* NO, CHECK EXP DATE            */ 00816000
*                   IF CVTDATE(2:4)<CEXP THEN/* CURR DATE < EXP DATE    00817000
*                                      ?                     @Y30SSPJ*/ 00818000
         L     @05,CVTPTR                                          0357 00819000
         CLC   CVTDATE+1(3,@05),CEXP(@10)                          0357 00820000
         BNL   @RF00357                                            0357 00821000
*                     DO;           /* YES, DO NOT DELETE            */ 00822000
*                                                                  0358 00823000
*                       /*********************************************/ 00824000
*                       /*                                           */ 00825000
*                       /* SET CCAMODID='BG', CCAREASN=RSN0,         */ 00826000
*                       /* CCARETRN=RCDATE                           */ 00827000
*                       /*                                           */ 00828000
*                       /*********************************************/ 00829000
*                                                                  0359 00830000
*                       CCAPROB=IGGSEGID+(RSN0*K256)+RCDATE;/* NOT 0359 00831000
*                                      EXP RET CODE          @Y30SSPJ*/ 00832000
         MVC   CCAPROB(4,R11),@CF04752                             0359 00833000
*Z041DLXT:                                                         0360 00834000
*                       CALL IGGPDLXT;/* ERROR EXIT          @Y30LSJG*/ 00835000
Z041DLXT L     @15,@CV04531                                        0360 00836000
         BALR  @14,@15                                             0360 00837000
*                     END;          /*                       @Y30LSJG*/ 00838000
*                 END;              /* END NOT PURGE         @Y30LSJG*/ 00839000
@RF00357 DS    0H                                                  0363 00840000
*               RFY                                                0363 00841000
*                 CTGPL BASED(CCACPL);                             0363 00842000
*                                                                  0363 00843000
@RF00355 DS    0H                                                  0364 00844000
*               /*****************************************************/ 00845000
*               /*                                                   */ 00846000
*               /* CHECK FOR NON-VSAM SCRATCH REQUEST        @Y30SSPJ*/ 00847000
*               /*                                                   */ 00848000
*               /*****************************************************/ 00849000
*                                                                  0364 00850000
*               IF CTGSCR=OFF THEN                                 0364 00851000
         L     @10,CCACPL(,R11)                                    0364 00852000
         TM    CTGSCR(@10),B'00000010'                             0364 00853000
         BZ    @RT00364                                            0364 00854000
*                 ;                 /* SCRATCH REQUEST?      @Y30SSPJ*/ 00855000
*               ELSE                /* YES-SCRATCH REQUESTED @Y30SSPJ*/ 00856000
*                 IF CTGDDNM^=N THEN/* FILE SPECIFIED?       @Y30SSPJ*/ 00857000
         L     @10,CCACPL(,R11)                                    0366 00858000
         L     @10,CTGDDNM(,@10)                                   0366 00859000
         LTR   @10,@10                                             0366 00860000
         BZ    @RF00366                                            0366 00861000
*                   CCASMFSR=ON;    /* YES-SET SMF SCRATCH   @Y30SSPJ*/ 00862000
         OI    CCASMFSR(R11),B'01000000'                           0367 00863000
*                 ELSE              /* NO-SCRATCH W/O DDNAME @Y30SSPJ*/ 00864000
*                                                                  0368 00865000
*                   /*************************************************/ 00866000
*                   /*                                               */ 00867000
*                   /* CHECK IF CALLED BY DEFINE NON-VSAM    @Y30SSPJ*/ 00868000
*                   /*                                               */ 00869000
*                   /*************************************************/ 00870000
*                                                                  0368 00871000
*                   IF CTGOPTNS=CTGDEFIN THEN                      0368 00872000
         B     @RC00366                                            0368 00873000
@RF00366 L     @10,CCACPL(,R11)                                    0368 00874000
         TM    CTGOPTNS(@10),B'00001000'                           0368 00875000
         BNO   @RF00368                                            0368 00876000
         TM    CTGOPTNS(@10),B'11110000'                           0368 00877000
         BZ    @RT00368                                            0368 00878000
*                     ;             /* DEFINE REQUEST?       @Y30SSPJ*/ 00879000
*                   ELSE            /* NO-NOT DEFINE REQUEST @Y30SSPJ*/ 00880000
*                     DO;           /*                       @Y30SSPJ*/ 00881000
*                                                                  0370 00882000
@RF00368 DS    0H                                                  0371 00883000
*                       /*********************************************/ 00884000
*                       /*                                           */ 00885000
*                       /* SET CCAMODID='BG', CCAREASN=RSN16,        */ 00886000
*                       /* CCARETRN=RCINDER                          */ 00887000
*                       /*                                           */ 00888000
*                       /*********************************************/ 00889000
*                                                                  0371 00890000
*                       CCAPROB=IGGSEGID+(RSN16*K256)+RCINDER;/* FILE   00891000
*                                      NOT SPECIFIED FOR SCRATCH OF     00892000
*                                      NON-VSAM              @Y30SSPJ*/ 00893000
         MVC   CCAPROB(4,R11),@CF04763                             0371 00894000
*Z043DLXT:                                                         0372 00895000
*                       CALL IGGPDLXT;/*                     @Y30SSPJ*/ 00896000
Z043DLXT L     @15,@CV04531                                        0372 00897000
         BALR  @14,@15                                             0372 00898000
*                     END;          /*                       @Y30SSPJ*/ 00899000
*               CCASMFUC=ON;        /* SET SMF UNCATALOG BIT         */ 00900000
*                                                                  0374 00901000
@RT00368 DS    0H                                                  0374 00902000
@RC00366 DS    0H                                                  0374 00903000
@RT00364 OI    CCASMFUC(R11),B'10000000'                           0374 00904000
*               /*****************************************************/ 00905000
*               /*                                                   */ 00906000
*               /* CALL TO MODULE IGG0CLBV                           */ 00907000
*               /*                                                   */ 00908000
*               /*****************************************************/ 00909000
*                                                                  0375 00910000
*Z044SMFS:                                                         0375 00911000
*               CALL IGGPSMFS;      /* CALL SMF ROUTINE              */ 00912000
*                                                                  0375 00913000
Z044SMFS L     @15,@CV04524                                        0375 00914000
         BALR  @14,@15                                             0375 00915000
*               /*****************************************************/ 00916000
*               /*                                                   */ 00917000
*               /* CLEAR CCAMODID, CCAREASN, AND CCARETRN            */ 00918000
*               /*                                                   */ 00919000
*               /*****************************************************/ 00920000
*                                                                  0376 00921000
*               CCAPROB=IGNOREIT;   /*                       @Y30SSPJ*/ 00922000
*                                                                  0376 00923000
         SLR   @10,@10                                             0376 00924000
         ST    @10,CCAPROB(,R11)                                   0376 00925000
*               /*****************************************************/ 00926000
*               /*                                                   */ 00927000
*               /* DELETE ALIAS CHAIN CALL TO MODULE IGG0CLA5        */ 00928000
*               /*                                                   */ 00929000
*               /*****************************************************/ 00930000
*                                                                  0377 00931000
*Z046DALL:                                                         0377 00932000
*               CALL IGGPDALL;      /* DELETE CHAIN IF ANY Y02020    */ 00933000
Z046DALL L     @15,@CV04515                                        0377 00934000
         BALR  @14,@15                                             0377 00935000
*               CCAURAB=ADDR(CCARAB1);/* RESET TO BASE       @Y30SSPJ*/ 00936000
*                                                                  0378 00937000
         LA    @10,CCARAB1(,R11)                                   0378 00938000
         ST    @10,CCAURAB(,R11)                                   0378 00939000
*               /*****************************************************/ 00940000
*               /*                                                   */ 00941000
*               /* CLEAR CCAMODID, CCAREASN, AND CCARETRN            */ 00942000
*               /*                                                   */ 00943000
*               /*****************************************************/ 00944000
*                                                                  0379 00945000
*               CCAPROB=IGNOREIT;                                  0379 00946000
*                                                                  0379 00947000
         SLR   @10,@10                                             0379 00948000
         ST    @10,CCAPROB(,R11)                                   0379 00949000
*               /*****************************************************/ 00950000
*               /*                                                   */ 00951000
*               /* CLEAR RETURN CODE                           Y02020*/ 00952000
*               /* EXTRACT NON-VSAM GDG BASE ASSOCIATION     @Y30SSPJ*/ 00953000
*               /*                                                   */ 00954000
*               /*****************************************************/ 00955000
*                                                                  0380 00956000
*Z048DEXA:                                                         0380 00957000
*               CALL IGGPDEXA;      /* EXTRACT ASSOCIATIONS  @Y30SSPJ*/ 00958000
Z048DEXA BAL   @14,IGGPDEXA                                        0380 00959000
*               IF ADDR(DELFPLR)->CTGFLNG(1)^=N&/* ASSOC WAS       0381 00960000
*                                      EXTRACTED             @Y30SSPJ*/ 00961000
*                   CTGOPTNS^=CTGDEFIN THEN/* AND NOT DEFINE OPER. 0381 00962000
*                                                            @Y30SSPJ*/ 00963000
         L     @10,CCACMSWA(,R11)                                  0381 00964000
         L     @10,CTGFLNG+84(,@10)                                0381 00965000
         LTR   @10,@10                                             0381 00966000
         BZ    @RF00381                                            0381 00967000
         L     @10,CCACPL(,R11)                                    0381 00968000
         TM    CTGOPTNS(@10),B'00001000'                           0381 00969000
         BNO   @RT00381                                            0381 00970000
         TM    CTGOPTNS(@10),B'11110000'                           0381 00971000
         BZ    @RF00381                                            0381 00972000
@RT00381 DS    0H                                                  0382 00973000
*                 DO;               /* YES-GDG BASE EXTRACTED      0382 00974000
*                                                            @Y30SSPJ*/ 00975000
*                                                                  0382 00976000
*                   /*************************************************/ 00977000
*                   /*                                               */ 00978000
*                   /* GET GDG BASE ENTRY                            */ 00979000
*                   /*                                               */ 00980000
*                   /*************************************************/ 00981000
*                                                                  0383 00982000
*                   CCASRID=DELACI(1);/* CI NUMBER OF GDG BASE     0383 00983000
*                                                            @Y30SSPJ*/ 00984000
         L     @10,CCACMSWA(,R11)                                  0383 00985000
         MVC   CCASRID(3,R11),DELACI(@10)                          0383 00986000
*                   DO;                                            0384 00987000
*                     CCAF1KEY=OFF; /* GET BY CI NO.                 */ 00988000
*                     CCAF1KGE=OFF; /* NOT GET NEXT                  */ 00989000
*                     CCAF1UP=ON;   /* GET FOR UPD                   */ 00990000
         OI    CCAF1UP(R11),B'00000010'                            0387 00991000
         NI    CCAF1KEY(R11),B'11100111'                           0387 00992000
*                     CCAURAB=ADDR(CCARAB2);/* SET RAB PTR           */ 00993000
*                                                                  0388 00994000
         LA    @10,CCARAB2(,R11)                                   0388 00995000
         ST    @10,CCAURAB(,R11)                                   0388 00996000
*                     /***********************************************/ 00997000
*                     /*                                             */ 00998000
*                     /* CALL TO MODULE IGG0CLBI                     */ 00999000
*                     /*                                             */ 01000000
*                     /***********************************************/ 01001000
*                                                                  0389 01002000
*Z050GET:                                                          0389 01003000
*                     CALL IGGPGET; /* GET RECORD                    */ 01004000
Z050GET  L     @15,@CV04523                                        0389 01005000
         BALR  @14,@15                                             0389 01006000
*                   END;            /* GET INTO RECORD AREA 2      0390 01007000
*                                                            @Y30SSPJ*/ 01008000
*                                                                  0390 01009000
*                   /*************************************************/ 01010000
*                   /*                                               */ 01011000
*                   /* CHECK FOR GET GDG BASE RECORD ERROR   @Y30SSPJ*/ 01012000
*                   /*                                               */ 01013000
*                   /*************************************************/ 01014000
*                                                                  0391 01015000
*                   IF CCACD1^=RCS THEN/* GET GDG BASE ERROR?      0391 01016000
*                                                            @Y30SSPJ*/ 01017000
         CLI   CCACD1(R11),0                                       0391 01018000
         BE    @RF00391                                            0391 01019000
*                     IF CCACD1=RCENT THEN/* YES-IS GDG BASE       0392 01020000
*                                      NON-EXISTANT?         @Y30SSPJ*/ 01021000
*                                                                  0392 01022000
         CLI   CCACD1(R11),8                                       0392 01023000
         BNE   @RF00392                                            0392 01024000
*                       /*********************************************/ 01025000
*                       /*                                           */ 01026000
*                       /* CLEAR CCAMODID, CCAREASN, AND CCARETRN    */ 01027000
*                       /*                                           */ 01028000
*                       /*********************************************/ 01029000
*                                                                  0393 01030000
*                       CCAPROB=IGNOREIT;/* YES-CLEAR ERROR CODE   0393 01031000
*                                                            @Y30SSPJ*/ 01032000
         SLR   @10,@10                                             0393 01033000
         ST    @10,CCAPROB(,R11)                                   0393 01034000
*                     ELSE          /* NO-GDG BASE EXISTS    @Y30SSPJ*/ 01035000
*Z052DLXT:                                                         0394 01036000
*                       CALL IGGPDLXT;/* ERROR EXIT          @Y30SSPJ*/ 01037000
         B     @RC00392                                            0394 01038000
@RF00392 DS    0H                                                  0394 01039000
Z052DLXT L     @15,@CV04531                                        0394 01040000
         BALR  @14,@15                                             0394 01041000
*                   ELSE            /* NO-NO GET ERROR       @Y30SSPJ*/ 01042000
*                                                                  0395 01043000
*                     /***********************************************/ 01044000
*                     /*                                             */ 01045000
*                     /* DELETE ASSO IN BASE POINTING TO DATA SET,   */ 01046000
*                     /* REMOVE THIS DATA SET REFERENCE AND UPDATE   */ 01047000
*                     /* GENLEVELS CALL TO MODULE IGG0CLA4           */ 01048000
*                     /*                                             */ 01049000
*                     /***********************************************/ 01050000
*                                                                  0395 01051000
*Z053ERUG:                                                         0395 01052000
*                     CALL IGGPERUG;/* DELETE BASE ASSOC. Y02020     */ 01053000
         B     @RC00391                                            0395 01054000
@RF00391 DS    0H                                                  0395 01055000
Z053ERUG L     @15,@CV04521                                        0395 01056000
         BALR  @14,@15                                             0395 01057000
*                 END;              /*                         Y02020*/ 01058000
*               ELSE                                               0397 01059000
*                 ;                 /* NO ASSOCIATIONS       @Y30SSPJ*/ 01060000
@RF00381 DS    0H                                                  0398 01061000
*               CCAURAB=ADDR(CCARAB1);/* RESTORE BASE RAB PTR      0398 01062000
*                                                            @Y30SSPJ*/ 01063000
@RC00381 LA    @10,CCARAB1(,R11)                                   0398 01064000
         ST    @10,CCAURAB(,R11)                                   0398 01065000
*               IF CTGWKA^=N THEN   /* IF WORK AREA EXISTS   @YM05149*/ 01066000
         L     @05,CCACPL(,R11)                                    0399 01067000
         L     @05,CTGWKA(,@05)                                    0399 01068000
         LTR   @05,@05                                             0399 01069000
         BZ    @RF00399                                            0399 01070000
*                 DO;               /* SET DELETED ENTRY NAME      0400 01071000
*                                                            @YM05149*/ 01072000
*                   ENTNAMET(1)=CTGTALIN;/* SET NON-VSAM TYPE      0401 01073000
*                                                            @Y30SSPJ*/ 01074000
         MVI   ENTNAMET(@05),C'A'                                  0401 01075000
*                   ENTNAMEV(1)=CNAME;/* SET ENTRY NAME      @Y30SSPJ*/ 01076000
         L     @10,CCACPE1(,@10)                                   0402 01077000
         MVC   ENTNAMEV(44,@05),CNAME(@10)                         0402 01078000
*                   WKALEN2=WKALEN2+LENGTH(ENTNAMES);/* INCREMENT  0403 01079000
*                                      REQUIRED LENGTH OF USERWKA  0403 01080000
*                                                            @Y30SSPJ*/ 01081000
         LA    @10,45                                              0403 01082000
         AH    @10,WKALEN2(,@05)                                   0403 01083000
         STH   @10,WKALEN2(,@05)                                   0403 01084000
*                 END;              /*                       @YM05149*/ 01085000
*                                                                  0404 01086000
*               /*****************************************************/ 01087000
*               /*                                                   */ 01088000
*               /* CHECK FOR NON-VSAM SCRATCH REQUEST        @Y30SSPJ*/ 01089000
*               /*                                                   */ 01090000
*               /*****************************************************/ 01091000
*                                                                  0405 01092000
*               IF CTGSCR=OFF THEN                                 0405 01093000
@RF00399 L     @10,CCACPL(,R11)                                    0405 01094000
         TM    CTGSCR(@10),B'00000010'                             0405 01095000
         BZ    @RT00405                                            0405 01096000
*                 ;                 /* NON-VSAM SCRATCH?     @Y30SSPJ*/ 01097000
*               ELSE                /* SCRATCH REQUESTED     @Y30DSSM*/ 01098000
*                 DO;                                              0407 01099000
*                   DELVRRN=N;      /* INIT RELREPNO TO ZERO @ZA01288*/ 01100000
         SLR   @10,@10                                             0408 01101000
         L     @05,CCACMSWA(,R11)                                  0408 01102000
         STH   @10,DELVRRN(,@05)                                   0408 01103000
*                   DELCODE='0'B;   /* INITIALIZE TO ZERO    @ZA01288*/ 01104000
*                   DELCODE2='0'B;  /* INITIALIZE TO ZERO    @ZA01288*/ 01105000
         NI    DELCODE(@05),B'00111111'                            0410 01106000
*                   DO DELC=N TO FF WHILE(DELCODE=OFF);/* SCRATCH  0411 01107000
*                                      DATA SETS             @Y30SSPJ*/ 01108000
*                                                                  0411 01109000
         L     @05,CCACMSWA(,R11)                                  0411 01110000
         STC   @10,DELC(,@05)                                      0411 01111000
@DL00411 L     @10,CCACMSWA(,R11)                                  0411 01112000
         TM    DELCODE(@10),B'10000000'                            0411 01113000
         BNZ   @DC00411                                            0411 01114000
*                     /***********************************************/ 01115000
*                     /*                                             */ 01116000
*                     /* CALL TO MODULE IGG0CLA7                     */ 01117000
*                     /*                                             */ 01118000
*                     /***********************************************/ 01119000
*                                                                  0412 01120000
*Z054DEMV:                                                         0412 01121000
*                     CALL IGGPDEMV;/* EXTRACT MINIMUM VGO   @Y30SSPJ*/ 01122000
Z054DEMV L     @15,@CV04516                                        0412 01123000
         BALR  @14,@15                                             0412 01124000
*                     RFY                                          0413 01125000
*                       GVO BASED(ADDR(DELVGO));/*           @Y30SSPJ*/ 01126000
*                                                                  0413 01127000
*                     /***********************************************/ 01128000
*                     /*                                             */ 01129000
*                     /* MAKE SURE EXTRACT VOLUME GROUP OCCURENCE    */ 01130000
*                     /*                                     @Y30SSPJ*/ 01131000
*                     /* WAS ERROR FREE AND THE DEVICE IS DIRECT     */ 01132000
*                     /*                                     @Y30SSPJ*/ 01133000
*                     /* ACCESS.                             @Y30SSPJ*/ 01134000
*                     /*                                             */ 01135000
*                     /***********************************************/ 01136000
*                                                                  0414 01137000
*                     IF DELCODE2=ON|/* EXTRACT ERROR OR     @Y30SSPJ*/ 01138000
*                         DELCODE=ON|/* NO MORE VGOS OR      @Y30SSPJ*/ 01139000
*                         DELDTYP^=DADEVICE THEN                   0414 01140000
         L     @10,CCACMSWA(,R11)                                  0414 01141000
         TM    DELCODE2(@10),B'11000000'                           0414 01142000
         BNZ   @RT00414                                            0414 01143000
         CLI   DELDTYP+274(@10),X'20'                              0414 01144000
         BNE   @RT00414                                            0414 01145000
*                       ;           /* NON-DASD DEVICE?      @Y30SSPJ*/ 01146000
*                     ELSE          /* NO-OK TO SCRATCH      @Y30SSPJ*/ 01147000
*                       DO;                                        0416 01148000
*                                                                  0416 01149000
*                         /*******************************************/ 01150000
*                         /*                                         */ 01151000
*                         /* CALL TO MODULE IGG0CLA7                 */ 01152000
*                         /*                                         */ 01153000
*                         /*******************************************/ 01154000
*                                                                  0417 01155000
*Z055DVMV:                                                         0417 01156000
*                         CALL IGGPDVMV;/* CHECK VOLUME MOUNTABLE  0417 01157000
*                                                            @Y30SSPJ*/ 01158000
*                                                                  0417 01159000
Z055DVMV L     @15,@CV04519                                        0417 01160000
         BALR  @14,@15                                             0417 01161000
*                         /*******************************************/ 01162000
*                         /*                                         */ 01163000
*                         /* CHECK IF VOLUME MOUNT FAILED.   @Y30SSPJ*/ 01164000
*                         /*                                         */ 01165000
*                         /*******************************************/ 01166000
*                                                                  0418 01167000
*                         IF CCACD1^=RCS THEN                      0418 01168000
         CLI   CCACD1(R11),0                                       0418 01169000
         BNE   @RT00418                                            0418 01170000
*                           ;       /* VOLUME MOUNT ERROR?   @Y30SSPJ*/ 01171000
*                         ELSE      /* NO-VOL IS MOUNTED OR MOUNTABLE   01172000
*                                                            @Y30SSPJ*/ 01173000
*                                                                  0420 01174000
*                           /*****************************************/ 01175000
*                           /*                                       */ 01176000
*                           /* CALL TO MODULE IGG0CLA7               */ 01177000
*                           /*                                       */ 01178000
*                           /*****************************************/ 01179000
*                                                                  0420 01180000
*Z056DUSC:                                                         0420 01181000
*                           CALL IGGPDUSC;/* NON-VSAM SCRATCH      0420 01182000
*                                                            @Y30SSPJ*/ 01183000
*                                                                  0420 01184000
Z056DUSC L     @15,@CV04518                                        0420 01185000
         BALR  @14,@15                                             0420 01186000
*                         /*******************************************/ 01187000
*                         /*                                         */ 01188000
*                         /* IF ANY SCRATCH ERROR OCCURS, TERMINATE  */ 01189000
*                         /*                                 @Y30SSPJ*/ 01190000
*                         /* THE DELETE PROCESS.             @Y30SSPJ*/ 01191000
*                         /*                                         */ 01192000
*                         /*******************************************/ 01193000
*                                                                  0421 01194000
*                         IF CCACD1^=RCS THEN/* SCRATCH ERROR?     0421 01195000
*                                                            @ZA31989*/ 01196000
@RT00418 CLI   CCACD1(R11),0                                       0421 01197000
         BE    @RF00421                                            0421 01198000
*                           DO;     /* YES, ERROR            @ZA31989*/ 01199000
*Z057DLXT:                                                         0423 01200000
*                             CALL IGGPDLXT;/* CALL ERROR EXIT     0423 01201000
*                                                            @ZA31989*/ 01202000
Z057DLXT L     @15,@CV04531                                        0423 01203000
         BALR  @14,@15                                             0423 01204000
*                           END;    /*                       @ZA24914*/ 01205000
*                         ELSE                                     0425 01206000
*                           ;       /* NO ERROR, CONTINUE    @ZA31989*/ 01207000
@RF00421 DS    0H                                                  0426 01208000
*                       END;                                       0426 01209000
*                   END;                                           0427 01210000
@RT00414 L     @05,CCACMSWA(,R11)                                  0427 01211000
         LA    @10,1                                               0427 01212000
         SLR   @15,@15                                             0427 01213000
         IC    @15,DELC(,@05)                                      0427 01214000
         ALR   @10,@15                                             0427 01215000
         L     @05,CCACMSWA(,R11)                                  0427 01216000
         STC   @10,DELC(,@05)                                      0427 01217000
         C     @10,@CF04547                                        0427 01218000
         BNH   @DL00411                                            0427 01219000
@DC00411 DS    0H                                                  0428 01220000
*                 END;              /* END OF SCRATCH        @ZA01288*/ 01221000
*               CMCISREQ=INCR;      /* SET PARAM TO DELETE   @Y30SSPJ*/ 01222000
@RT00405 L     @10,CCACMSWA(,R11)                                  0429 01223000
         MVI   CMCISREQ(@10),X'01'                                 0429 01224000
*               CMWACI(1)=RCDCINO;  /* NUMBER OF RECORDS     @Y30SSPJ*/ 01225000
         L     @05,CCAURAB(,R11)                                   0430 01226000
         L     @05,CCACPE1(,@05)                                   0430 01227000
         MVC   CMWACI(3,@10),RCDCINO(@05)                          0430 01228000
*               CCARABB=ADDR(CCARAB1);/* BASE RAB            @Y30SSPJ*/ 01229000
*                                                                  0431 01230000
         LA    @10,CCARAB1(,R11)                                   0431 01231000
         ST    @10,CCARABB(,R11)                                   0431 01232000
*               /*****************************************************/ 01233000
*               /*                                                   */ 01234000
*               /* CALL TO MODULE IGG0CLB8                           */ 01235000
*               /*                                                   */ 01236000
*               /*****************************************************/ 01237000
*                                                                  0432 01238000
*Z058DUND:                                                         0432 01239000
*               CALL IGGPDUND;      /* DELETE BASE RECORD    @Y30SSPJ*/ 01240000
Z058DUND L     @15,@CV04517                                        0432 01241000
         BALR  @14,@15                                             0432 01242000
*             END;                                                 0433 01243000
*         END;                                                     0434 01244000
*       ELSE                        /* ENTRY NAME DOES NOT MATCH   0435 01245000
*                                      REQUEST NAME          @Y30SSPJ*/ 01246000
*                                                                  0435 01247000
*         /***********************************************************/ 01248000
*         /*                                                         */ 01249000
*         /* SET CCAMODID='BG', CCAREASN=RSN6, CCARETRN=RCENT        */ 01250000
*         /*                                                         */ 01251000
*         /***********************************************************/ 01252000
*                                                                  0435 01253000
*         CCAPROB=IGGSEGID+(RSN6*K256)+RCENT;/* REQUEST NAME OF    0435 01254000
*                                      REQUEST TYPE NOT FOUND ERROR     01255000
*                                                            @Y30SSPJ*/ 01256000
         B     @RC00222                                            0435 01257000
@RF00222 MVC   CCAPROB(4,R11),@CF04765                             0435 01258000
*     END;                                                         0436 01259000
*   ELSE                            /* INVALID RECORD TYPE   @Y30SSPJ*/ 01260000
*                                                                  0437 01261000
*     /***************************************************************/ 01262000
*     /*                                                             */ 01263000
*     /* SET CCAMODID='BG', CCAREASN=RSN4, CCARETRN=RCINENT          */ 01264000
*     /*                                                             */ 01265000
*     /***************************************************************/ 01266000
*                                                                  0437 01267000
*     CCAPROB=IGGSEGID+(RSN4*K256)+RCINENT;/* SET NOT CLUSTER,     0437 01268000
*                                      PAGESPACE, AIX, PATH, OR    0437 01269000
*                                      NON-VSAM ERROR        @Y30SSPJ*/ 01270000
         B     @RC00220                                            0437 01271000
@RF00220 MVC   CCAPROB(4,R11),@CF04768                             0437 01272000
*Z061DLXT:                                                         0438 01273000
*   CALL IGGPDLXT;                  /* EXIT                          */ 01274000
@RC00220 DS    0H                                                  0438 01275000
Z061DLXT L     @15,@CV04531                                        0438 01276000
         BALR  @14,@15                                             0438 01277000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 01278000
         BAL   @14,EXIT                                            0439 01279000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 01280000
         DS 0F                                                          01281000
*   GEN(DC CL8'IGGPERAS');          /* NAME OF FOLLOWING PROCEDURE   */ 01282000
         DC CL8'IGGPERAS'                                               01283000
*   END;                            /* END OF INNER PROCEDURE        */ 01284000
@EL00002 DS    0H                                                  0442 01285000
@EF00002 DS    0H                                                  0442 01286000
@ER00002 BR    @14                                                 0442 01287000
@PB00002 DS    0H                                                  0443 01288000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 01289000
         EJECT                                                          01290000
*                                                                  0444 01291000
*/********************************************************************/ 01292000
*/*                                                                  */ 01293000
*/*        IGGPERAS  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */ 01294000
*/*                                                                  */ 01295000
*/********************************************************************/ 01296000
*                                                                  0444 01297000
*IGGPERAS:                                                         0444 01298000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 01299000
         B     @PB00003                                            0444 01300000
IGGPERAS DS    0H                                                  0445 01301000
*Z062:                              /* LABEL FOR PROCEDURE TRACKING  */ 01302000
*Z062ERAS:                          /* LABEL FOR PROCEDURE TRACKING  */ 01303000
*   RFY                                                            0445 01304000
*    (R5,                                                          0445 01305000
*     R6,                                                          0445 01306000
*     R7,                                                          0445 01307000
*     R8,                                                          0445 01308000
*     R9,                                                          0445 01309000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 01310000
Z062     DS    0H                                                  0445 01311000
Z062ERAS DS    0H                                                  0446 01312000
*   RFY                                                            0446 01313000
*    (R2,                                                          0446 01314000
*     R3,                                                          0446 01315000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 01316000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 01317000
         STM 12,14,12(13)                                               01318000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 01319000
*                                                                  0448 01320000
         LA 13,12(13)                                                   01321000
*   /*****************************************************************/ 01322000
*   /*                                                               */ 01323000
*   /* THIS DELETE SUBFUNCTION CHECKS WHETHER OR NOT THE ERASE       */ 01324000
*   /* ATTRIBUTE IS SET FOR THE DELETE REQUEST,EITHER EXPLICITLY     */ 01325000
*   /* THROUGH THE CPL OR IMPLICITLY AS INDICATED IN THE CATALOG     */ 01326000
*   /* ENTRY RECORD FOR THIS DATA SET. IF ERASE IS REQUIRED, THE     */ 01327000
*   /* SUBFUNCTION PERFORMS THE TASK OF OVERWRITING THE DATA SET WITH*/ 01328000
*   /* BINARY ZEROES.                                                */ 01329000
*   /*                                                               */ 01330000
*   /*****************************************************************/ 01331000
*                                                                  0449 01332000
*   DCL                                                            0449 01333000
*     REC CHAR(*) BASED(DELRCPTR);                                 0449 01334000
*                                                                  0449 01335000
*   /*****************************************************************/ 01336000
*   /*                                                               */ 01337000
*   /* CLEAR CCAMODID, CCAREASN, AND CCARETRN                        */ 01338000
*   /*                                                               */ 01339000
*   /*****************************************************************/ 01340000
*                                                                  0450 01341000
*   CCAPROB=IGNOREIT;               /*                       @Y30SSPJ*/ 01342000
*                                                                  0450 01343000
         SLR   @10,@10                                             0450 01344000
         ST    @10,CCAPROB(,R11)                                   0450 01345000
*   /*****************************************************************/ 01346000
*   /*                                                               */ 01347000
*   /* INIT ACB FOR OPEN                                             */ 01348000
*   /*                                                               */ 01349000
*   /*****************************************************************/ 01350000
*                                                                  0451 01351000
*   RFY                                                            0451 01352000
*    (R1) RSTD;                                                    0451 01353000
*   DELOPNPL=ADDR(DELACB);          /* BASE ADDR FOR ACB             */ 01354000
         L     @05,CCACMSWA(,R11)                                  0452 01355000
         L     @15,CCAR5REC(,R11)                                  0452 01356000
         ST    @15,DELOPNPL(,@05)                                  0452 01357000
*   R1=ADDR(DELOPNPL);              /* POINT TO OPEN LIST    @Y30SSPJ*/ 01358000
         LA    R1,DELOPNPL(,@05)                                   0453 01359000
*   RFY                                                            0454 01360000
*     IFGACB BASED(DELOPNPL);                                      0454 01361000
*   DELERASE=DELERASE&&DELERASE;    /* CLEAR ACB/RPL                 */ 01362000
*                                                                  0455 01363000
         XC    DELERASE(165,@15),DELERASE(@15)                     0455 01364000
*   /*****************************************************************/ 01365000
*   /*                                                               */ 01366000
*   /* CHECK IF PASSWORD WAS SUPPLIED                        @Y30SSPJ*/ 01367000
*   /*                                                               */ 01368000
*   /*****************************************************************/ 01369000
*                                                                  0456 01370000
*   IF CCACPL->CTGPSWD=N THEN                                      0456 01371000
         L     @05,CCACPL(,R11)                                    0456 01372000
         C     @10,CTGPSWD(,@05)                                   0456 01373000
         BE    @RT00456                                            0456 01374000
*     ;                             /* CHK FOR PASSWORD FLD          */ 01375000
*   ELSE                            /* YES-PASSWORD SPECIFIED      0458 01376000
*                                                            @Y30SSPJ*/ 01377000
*     DO;                                                          0458 01378000
*       ACBPASSW=ADDR(DELPASSW);    /* ADDR OF PASSWORD STRT         */ 01379000
         L     @10,CCACMSWA(,R11)                                  0459 01380000
         L     @10,DELOPNPL(,@10)                                  0459 01381000
         L     @05,CCAR5REC(,R11)                                  0459 01382000
         LA    @00,DELPASSW(,@05)                                  0459 01383000
         ST    @00,ACBPASSW(,@10)                                  0459 01384000
*       DELPASLN=LENGTH(DELPASWD);  /* PASSWORD LENGTH               */ 01385000
         MVI   DELPASLN(@05),X'08'                                 0460 01386000
*       DELPASWD=CCACPL->CTGPSWD->PASSSTRT;/* GET PASSWORD   @Y30SSPJ*/ 01387000
         L     @10,CCACPL(,R11)                                    0461 01388000
         L     @10,CTGPSWD(,@10)                                   0461 01389000
         MVC   DELPASWD(8,@05),PASSSTRT(@10)                       0461 01390000
*     END;                                                         0462 01391000
*   ACBID='A0'X;                    /* SET ACB ID                    */ 01392000
@RT00456 L     @10,CCACMSWA(,R11)                                  0463 01393000
         L     @10,DELOPNPL(,@10)                                  0463 01394000
         MVI   ACBID(@10),X'A0'                                    0463 01395000
*   ACBLENG=LENGTH(IFGACB);         /* SET ACB LENGTH                */ 01396000
         MVC   ACBLENG(2,@10),@CH00138                             0464 01397000
*   ACBSEQ=ON;                      /* SEQUENTIAL PROCESSING         */ 01398000
*   ACBIN=ON;                       /* SET FOR INPUT                 */ 01399000
*   ACBOUT=ON;                      /* AND OUTPUT                    */ 01400000
*   ACBCNV=ON;                      /* CONTROL INTERVAL PROCESSING 0468 01401000
*                                                            @Y30SSPJ*/ 01402000
         OI    ACBSEQ(@10),B'00110110'                             0468 01403000
*   ACBDORGA=ON;                    /* VSAM ORGINIZATION             */ 01404000
         OI    ACBDORGA(@10),B'00001000'                           0469 01405000
*   ACBEXFG=ON;                     /* SET EXIT FLAG                 */ 01406000
         OI    ACBEXFG(@10),B'00000010'                            0470 01407000
*   ACBSTRNO=INCR;                  /* SET NO. OF STRINGS            */ 01408000
         MVI   ACBSTRNO(@10),X'01'                                 0471 01409000
*   ACBBUFND=NODBUF;                /* SET NO. DATA BUFFERS  @Y30SSPJ*/ 01410000
         MVC   ACBBUFND(2,@10),@CH00055                            0472 01411000
*   ACBBUFNI=INCR;                  /* SET NO. INDEX BUFFERS         */ 01412000
*                                                                  0473 01413000
         MVC   ACBBUFNI(2,@10),@CH00037                            0473 01414000
*   /*****************************************************************/ 01415000
*   /*                                                               */ 01416000
*   /* CHECK IF FILE SPECIFIED                               @Y30SSPJ*/ 01417000
*   /*                                                               */ 01418000
*   /*****************************************************************/ 01419000
*                                                                  0474 01420000
*   IF CTGDDNM^=N THEN                                             0474 01421000
         L     @10,CCACPL(,R11)                                    0474 01422000
         L     @10,CTGDDNM(,@10)                                   0474 01423000
         LTR   @10,@10                                             0474 01424000
         BNZ   @RT00474                                            0474 01425000
*     ;                             /* TEST FOR DDNAME PARAM @Y30SSPJ*/ 01426000
*   ELSE                            /* NO DDNAME SPECIFIED   @Y30SSPJ*/ 01427000
*     DO;                                                          0476 01428000
*                                                                  0476 01429000
*       /*************************************************************/ 01430000
*       /*                                                           */ 01431000
*       /* SET CCAMODID='BG', CCAREASN=RSN18, CCARETRN=RCINDER       */ 01432000
*       /*                                                           */ 01433000
*       /*************************************************************/ 01434000
*                                                                  0477 01435000
*       CCAPROB=IGGSEGID+(RSN18*K256)+RCINDER;/* DDNAME NOT SPECIFIED   01436000
*                                      FOR ERASE PROCESSING  @Y30SSPJ*/ 01437000
         MVC   CCAPROB(4,R11),@CF04771                             0477 01438000
*Z065DLXT:                                                         0478 01439000
*       CALL IGGPDLXT;              /* ERROR EXIT            @Y30SSPJ*/ 01440000
Z065DLXT L     @15,@CV04531                                        0478 01441000
         BALR  @14,@15                                             0478 01442000
*     END;                                                         0479 01443000
*   ACBDDNM=CTGDDNM->FIELDNM;       /* SET DD NAME           @Y30SSPJ*/ 01444000
@RT00474 L     @10,CCACMSWA(,R11)                                  0480 01445000
         L     @05,DELOPNPL(,@10)                                  0480 01446000
         L     @15,CCACPL(,R11)                                    0480 01447000
         L     @15,CTGDDNM(,@15)                                   0480 01448000
         MVC   ACBDDNM(8,@05),FIELDNM(@15)                         0480 01449000
*   DELOPEND=ON;                    /* SET END OF LIST ON    @Y30SSPJ*/ 01450000
         OI    DELOPEND(@10),B'10000000'                           0481 01451000
*   GEN(OPEN MF=(E,(1)));           /* OPEN DATA SET         @Y30SSPJ*/ 01452000
         OPEN MF=(E,(1))                                                01453000
*   RFY                                                            0483 01454000
*     R15 RSTD;                     /*                       @Y30SSPJ*/ 01455000
*                                                                  0483 01456000
*   /*****************************************************************/ 01457000
*   /*                                                               */ 01458000
*   /* CHECK IF DATA SET WAS OPENED                          @Y30SSPJ*/ 01459000
*   /*                                                               */ 01460000
*   /*****************************************************************/ 01461000
*                                                                  0484 01462000
*   IF ACBOPEN=ON THEN                                             0484 01463000
         L     @14,CCACMSWA(,R11)                                  0484 01464000
         L     @14,DELOPNPL(,@14)                                  0484 01465000
         TM    ACBOPEN(@14),B'00010000'                            0484 01466000
         BO    @RT00484                                            0484 01467000
*     ;                             /* CHECK IF OPENED       @Y30SSPJ*/ 01468000
*   ELSE                            /* COULD NOT OPEN ACB    @Y30SSPJ*/ 01469000
*     DO;                                                          0486 01470000
*       DO;                                                        0487 01471000
*         CCAMODID='BG';            /* SET MODULE ID                 */ 01472000
         MVC   CCAMODID(2,R11),@CC04681                            0488 01473000
*         CCAREASN=R15;             /* SET REASON CODE               */ 01474000
         STC   R15,CCAREASN(,R11)                                  0489 01475000
*         CCARETRN=RCEF;            /* SET RETURN CODE               */ 01476000
         MVI   CCARETRN(R11),X'F4'                                 0490 01477000
*       END;                        /* CAN NOT OPEN ACB      @Y30SSPJ*/ 01478000
*Z067DLXT:                                                         0492 01479000
*       CALL IGGPDLXT;              /* ERROR EXIT            @Y30SSPJ*/ 01480000
Z067DLXT L     @15,@CV04531                                        0492 01481000
         BALR  @14,@15                                             0492 01482000
*     END;                                                         0493 01483000
*   RFY                                                            0494 01484000
*     R15 UNRSTD;                   /*                       @Y30SSPJ*/ 01485000
@RT00484 DS    0H                                                  0495 01486000
*   RFY                                                            0495 01487000
*     IDAAMBL BASED(ACBAMBL);       /* AMBL ADDRESSABILITY   @YM02857*/ 01488000
*   RFY                                                            0496 01489000
*     IDAAMB BASED(AMBLDTA);        /* DATA AMB              @YM02857*/ 01490000
*   IF AMBDDSN^=RCDCINO|(           /* NOT SAME CI NUMBER OR @Y30SSPJ*/ 01491000
*       (CCAACB&ADDRMASK)^=(AMBCACB&ADDRMASK)) THEN/* NOT SAME     0497 01492000
*                                      CATALOG WHICH IS OPENED     0497 01493000
*                                                            @Y30SSPJ*/ 01494000
         L     @10,CCACMSWA(,R11)                                  0497 01495000
         L     @10,DELOPNPL(,@10)                                  0497 01496000
         L     @10,ACBAMBL(,@10)                                   0497 01497000
         L     @10,AMBLDTA(,@10)                                   0497 01498000
         L     @05,CCAURAB(,R11)                                   0497 01499000
         L     @05,CCACPE1(,@05)                                   0497 01500000
         CLC   AMBDDSN(3,@10),RCDCINO(@05)                         0497 01501000
         BNE   @RT00497                                            0497 01502000
         L     @05,@CF04553                                        0497 01503000
         L     @00,CCAACB(,R11)                                    0497 01504000
         NR    @00,@05                                             0497 01505000
         N     @05,AMBCACB(,@10)                                   0497 01506000
         CR    @00,@05                                             0497 01507000
         BE    @RF00497                                            0497 01508000
@RT00497 DS    0H                                                  0498 01509000
*     DO;                           /* YES-INVALID FUNCTION  @Y30SSPJ*/ 01510000
*                                                                  0498 01511000
*       /*************************************************************/ 01512000
*       /*                                                           */ 01513000
*       /* SET CCAMODID='BG', CCAREASN=RSN10, CCARETRN=RCINFUNC      */ 01514000
*       /*                                                           */ 01515000
*       /*************************************************************/ 01516000
*                                                                  0499 01517000
*       CCAPROB=IGGSEGID+(RSN10*K256)+RCINFUNC;/* INVALID FUNCTION 0499 01518000
*                                      ERROR                 @Y30SSPJ*/ 01519000
         MVC   CCAPROB(4,R11),@CF04774                             0499 01520000
*       R1=ADDR(DELOPNPL);          /* ADDR OF PARM LIST     @Y30SSPJ*/ 01521000
         L     R1,CCACMSWA(,R11)                                   0500 01522000
         LA    R1,DELOPNPL(,R1)                                    0500 01523000
*       GEN(CLOSE MF=(E,(1)));      /* CLOSE THE DATA SET    @Y30SSPJ*/ 01524000
         CLOSE MF=(E,(1))                                               01525000
*Z069DLXT:                                                         0502 01526000
*       CALL IGGPDLXT;              /* ERROR EXIT            @Y30SSPJ*/ 01527000
Z069DLXT L     @15,@CV04531                                        0502 01528000
         BALR  @14,@15                                             0502 01529000
*     END;                          /*                       @Y30SSPJ*/ 01530000
*   ELSE                            /* NO-CI AND ACB PROPER  #Y30SSPJ*/ 01531000
*                                                                  0504 01532000
*     /***************************************************************/ 01533000
*     /*                                                             */ 01534000
*     /* CALL TO MODULE IGG0CLA3                                     */ 01535000
*     /*                                                             */ 01536000
*     /***************************************************************/ 01537000
*                                                                  0504 01538000
*Z070RPLF:                                                         0504 01539000
*     CALL IGGPRPLF;                /* RELEASE CATLG RESOURCE      0504 01540000
*                                                            @Y30SSPJ*/ 01541000
*                                                                  0504 01542000
         B     @RC00497                                            0504 01543000
@RF00497 DS    0H                                                  0504 01544000
Z070RPLF L     @15,@CV04533                                        0504 01545000
         BALR  @14,@15                                             0504 01546000
*   /*****************************************************************/ 01547000
*   /*                                                               */ 01548000
*   /* BUILD THE RPL                                                 */ 01549000
*   /*                                                               */ 01550000
*   /*****************************************************************/ 01551000
*                                                                  0505 01552000
*   R1=ADDR(DELRPL);                /* POINT TO RPL          @Y30SSPJ*/ 01553000
@RC00497 L     @10,CCAR5REC(,R11)                                  0505 01554000
         LA    R1,DELRPL(,@10)                                     0505 01555000
*   RFY                                                            0506 01556000
*     IFGRPL BASED(R1);                                            0506 01557000
*   RPLDACB=ADDR(DELACB);           /* SET ACB PTR                   */ 01558000
         ST    @10,RPLDACB(,R1)                                    0507 01559000
*   RPLDDDD=N;                      /* START WITH RBA OF 0   @Y30SSPJ*/ 01560000
         SLR   @10,@10                                             0508 01561000
         ST    @10,RPLDDDD(,R1)                                    0508 01562000
*   RFY                                                            0509 01563000
*     IDAAMDSB BASED(AMBDSB);       /*                       @Y30SSPJ*/ 01564000
*   R4=ADDR(IDAAMDSB);              /* ADDR. OF AMDSB BLOCK  @Y30SSPJ*/ 01565000
         L     @10,CCACMSWA(,R11)                                  0510 01566000
         L     @10,DELOPNPL(,@10)                                  0510 01567000
         L     @10,ACBAMBL(,@10)                                   0510 01568000
         L     @10,AMBLDTA(,@10)                                   0510 01569000
         L     R4,AMBDSB(,@10)                                     0510 01570000
*   RFY                                                            0511 01571000
*     IDAAMDSB BASED(R4);           /*                       @Y30SSPJ*/ 01572000
*   RFY                                                            0512 01573000
*     IDAPLHDR BASED(AMBPH);        /*                       @Y30SSPJ*/ 01574000
*   RFY                                                            0513 01575000
*     IDAPLH BASED(ADDR(IDAPLHDR)+LENGTH(IDAPLHDR));/*       @Y30SSPJ*/ 01576000
*   R3=ADDR(IDAPLH);                /* POINT TO PLACE HOLDER @Y30SSPJ*/ 01577000
         LA    R3,16                                               0514 01578000
         AL    R3,AMBPH(,@10)                                      0514 01579000
*   RFY                                                            0515 01580000
*     IDAPLH BASED(R3);             /*                       @Y30SSPJ*/ 01581000
*   RFY                                                            0516 01582000
*     IDAARDB BASED(PLHARDB);       /*                       @Y30SSPJ*/ 01583000
*   R2=N;                           /* DO LOOP CONTROL       @Y30SSPJ*/ 01584000
*                                                                  0517 01585000
         SLR   R2,R2                                               0517 01586000
*   /*****************************************************************/ 01587000
*   /*                                                               */ 01588000
*   /* PREFORMAT ALL THE DATA CONTROL AREA TRACKS TO         @Y30SSPJ*/ 01589000
*   /* ERASE THE USER DATA SET.                              @Y30SSPJ*/ 01590000
*   /*                                                               */ 01591000
*   /*****************************************************************/ 01592000
*                                                                  0518 01593000
*   DO WHILE(R2=N&CCACD1=N);        /* DO ALL CONTROL AREAS  @Y30SSPJ*/ 01594000
         B     @DE00518                                            0518 01595000
@DL00518 DS    0H                                                  0519 01596000
*     PLHARDB=AMDPARDB;             /* POINTER TO FIRST ARDB @Y30SSPJ*/ 01597000
*                                                                  0519 01598000
         L     @10,AMDPARDB(,R4)                                   0519 01599000
         ST    @10,PLHARDB(,R3)                                    0519 01600000
*     /***************************************************************/ 01601000
*     /*                                                             */ 01602000
*     /* SEARCH ALL ARDB'S FOR A HI USED RBA EQUAL TO        @Y30SSPJ*/ 01603000
*     /* THE RBA OF THE NEXT CONTROL AREA TO PREFORMAT.      @Y30SSPJ*/ 01604000
*     /* IF FOUND, A CONTROL AREA GAP EXISTS THAT WILL       @Y30SSPJ*/ 01605000
*     /* NOT BE PREFORMATED AND ALSO IF THE END-OF-DATA      @Y30SSPJ*/ 01606000
*     /* BIT IS ON THE PREFORMAT IS FINISHED.                @Y30SSPJ*/ 01607000
*     /*                                                             */ 01608000
*     /***************************************************************/ 01609000
*                                                                  0520 01610000
*     DO WHILE(PLHARDB^=N&CCACD1=N);/* SKIP ANY CA GAPS      @Y30SSPJ*/ 01611000
*                                                                  0520 01612000
         B     @DE00520                                            0520 01613000
@DL00520 DS    0H                                                  0521 01614000
*       /*************************************************************/ 01615000
*       /*                                                           */ 01616000
*       /* IF NEXT SEQUENTIAL RBA IS EQUAL HIGH USED,        @Y30SSPJ*/ 01617000
*       /* AN ADDRESS SPACE GAP HAS BEEN FOUND.              @Y30SSPJ*/ 01618000
*       /*                                                           */ 01619000
*       /*************************************************************/ 01620000
*                                                                  0521 01621000
*       IF RPLDDDD=ARDHRBA|         /* NEXT RBA = HI USED OR @Y30SSPJ*/ 01622000
*           (RPLDDDD>ARDHRBA&       /* NEXT RBA > HI USED    @Y30SSPJ*/ 01623000
*           DELNMOBJ=INCR) THEN     /* AND ESDS DATA SET?    @Y30SSPJ*/ 01624000
         L     @10,RPLDDDD(,R1)                                    0521 01625000
         L     @05,PLHARDB(,R3)                                    0521 01626000
         L     @05,ARDHRBA(,@05)                                   0521 01627000
         CLR   @10,@05                                             0521 01628000
         BE    @RT00521                                            0521 01629000
         CLR   @10,@05                                             0521 01630000
         BNH   @RF00521                                            0521 01631000
         L     @10,CCACMSWA(,R11)                                  0521 01632000
         CLI   DELNMOBJ(@10),1                                     0521 01633000
         BNE   @RF00521                                            0521 01634000
@RT00521 DS    0H                                                  0522 01635000
*         DO;                       /* YES-GAP FOUND         @Y30SSPJ*/ 01636000
*           RPLDDDD=ARDERBA;        /* USE HIGH ALLOCATED RBA AS NEXT   01637000
*                                      CONTROL AREA RBA      @Y30SSPJ*/ 01638000
*                                                                  0523 01639000
         L     @10,PLHARDB(,R3)                                    0523 01640000
         L     @05,ARDERBA(,@10)                                   0523 01641000
         ST    @05,RPLDDDD(,R1)                                    0523 01642000
*           /*********************************************************/ 01643000
*           /*                                                       */ 01644000
*           /* CHECK THIS ARDB FOR END-OF-DATA AND IF        @Y30SSPJ*/ 01645000
*           /* ARDEOD BIT IS ON, PERFORMAT IS FINISHED.      @Y30SSPJ*/ 01646000
*           /*                                                       */ 01647000
*           /*********************************************************/ 01648000
*                                                                  0524 01649000
*           IF ARDEOD=OFF THEN      /* EOD ARDB FOUND?       @Y30SSPJ*/ 01650000
         TM    ARDEOD(@10),B'00001000'                             0524 01651000
         BNZ   @RF00524                                            0524 01652000
*             PLHARDB=ARDNPTR;      /* NO-POINT TO NEXT ARDB @Y30SSPJ*/ 01653000
         L     @10,ARDNPTR(,@10)                                   0525 01654000
         ST    @10,PLHARDB(,R3)                                    0525 01655000
*           ELSE                    /* YES,END-OF-DATA FOUND @Y30SSPJ*/ 01656000
*             DO;                   /*                       @Y30SSPJ*/ 01657000
         B     @RC00524                                            0526 01658000
@RF00524 DS    0H                                                  0527 01659000
*               R2=INCR;            /* SET DO LOOP STOPPER   @Y30SSPJ*/ 01660000
         LA    R2,1                                                0527 01661000
*               PLHARDB=N;          /* CLEAR ARDB POINTER    @Y30SSPJ*/ 01662000
         SLR   @10,@10                                             0528 01663000
         ST    @10,PLHARDB(,R3)                                    0528 01664000
*             END;                  /*                       @Y30SSPJ*/ 01665000
*         END;                      /*                       @Y30SSPJ*/ 01666000
*       ELSE                        /* NO-GAP NOT FOUND YET  @Y30SSPJ*/ 01667000
*         PLHARDB=ARDNPTR;          /* POINT TO NEXT ARDB    @Y30SSPJ*/ 01668000
         B     @RC00521                                            0531 01669000
@RF00521 L     @10,PLHARDB(,R3)                                    0531 01670000
         L     @10,ARDNPTR(,@10)                                   0531 01671000
         ST    @10,PLHARDB(,R3)                                    0531 01672000
*     END;                          /*                       @Y30SSPJ*/ 01673000
*                                                                  0532 01674000
@RC00521 DS    0H                                                  0532 01675000
@DE00520 L     @10,PLHARDB(,R3)                                    0532 01676000
         LTR   @10,@10                                             0532 01677000
         BZ    @DC00520                                            0532 01678000
         CLI   CCACD1(R11),0                                       0532 01679000
         BE    @DL00520                                            0532 01680000
@DC00520 DS    0H                                                  0533 01681000
*     /***************************************************************/ 01682000
*     /*                                                             */ 01683000
*     /* R2 IS SET NON-ZERO WHEN END-OF-DATA IS              @Y30SSPJ*/ 01684000
*     /* FOUND.                                              @Y30SSPJ*/ 01685000
*     /*                                                             */ 01686000
*     /***************************************************************/ 01687000
*                                                                  0533 01688000
*     IF R2^=N THEN                                                0533 01689000
         LTR   R2,R2                                               0533 01690000
         BNZ   @RT00533                                            0533 01691000
*       ;                           /* FINISHED PREFORMAT?   @Y30SSPJ*/ 01692000
*     ELSE                          /* NO-CONTINUE PREFORMAT @Y30SSPJ*/ 01693000
*       DO;                         /*                       @Y30SSPJ*/ 01694000
*         RFY                                                      0536 01695000
*          (R0,                                                    0536 01696000
*           R15) RSTD;              /*                       @Y30SSPJ*/ 01697000
*         R0=RPLPFMTD;              /* PERFORMAT OPTION CODE @Y30SSPJ*/ 01698000
         LA    R0,8                                                0537 01699000
*         R15=ACBINRTN;             /* ADDR OF INTERFACE RTN @Y30SSPJ*/ 01700000
*                                                                  0538 01701000
         L     @10,CCACMSWA(,R11)                                  0538 01702000
         L     @10,DELOPNPL(,@10)                                  0538 01703000
         L     R15,ACBINRTN(,@10)                                  0538 01704000
*         /***********************************************************/ 01705000
*         /*                                                         */ 01706000
*         /* CALL RECORD MANAGEMNET PREFORMAT ROUTINE        @Y30SSPJ*/ 01707000
*         /*                                                         */ 01708000
*         /***********************************************************/ 01709000
*                                                                  0539 01710000
*         GEN(BALR  R14,R15);       /* CALL PREFORMAT RTN    @Y30SSPJ*/ 01711000
*                                                                  0539 01712000
         BALR  R14,R15                                                  01713000
*         /***********************************************************/ 01714000
*         /*                                                         */ 01715000
*         /* CHECK FOR PREFORMAT ERRORS                      @Y30SSPJ*/ 01716000
*         /*                                                         */ 01717000
*         /***********************************************************/ 01718000
*                                                                  0540 01719000
*         IF R15=N THEN                                            0540 01720000
         LTR   R15,R15                                             0540 01721000
         BZ    @RT00540                                            0540 01722000
*           ;                       /* PREFORMAT ERROR?      @Y30SSPJ*/ 01723000
*         ELSE                      /* YES-PREFORMAT ERROR   @Y30SSPJ*/ 01724000
*           IF R15=RCENT THEN       /* LOGICAL ERROR?        @Y30SSPJ*/ 01725000
         C     R15,@CF00042                                        0542 01726000
         BNE   @RF00542                                            0542 01727000
*             DO;                                                  0543 01728000
*               CCAMODID='BG';      /* SET MODULE ID                 */ 01729000
         MVC   CCAMODID(2,R11),@CC04681                            0544 01730000
*               CCAREASN=RPLERRCD;  /* SET REASON CODE               */ 01731000
         IC    @14,RPLERRCD(,R1)                                   0545 01732000
         STC   @14,CCAREASN(,R11)                                  0545 01733000
*               CCARETRN=RCEFRM;    /* SET RETURN CODE               */ 01734000
         MVI   CCARETRN(R11),X'FA'                                 0546 01735000
*             END;                  /* YES-SET ERASE LOGICAL ERROR 0547 01736000
*                                                            @Y30SSPJ*/ 01737000
*           ELSE                    /* NO-NOT LOGICAL ERROR  @Y30SSPJ*/ 01738000
*             DO;                                                  0548 01739000
         B     @RC00542                                            0548 01740000
@RF00542 DS    0H                                                  0549 01741000
*               CCAMODID='BG';      /* SET MODULE ID                 */ 01742000
         MVC   CCAMODID(2,R11),@CC04681                            0549 01743000
*               CCAREASN=RPLERRCD;  /* SET REASON CODE               */ 01744000
         IC    @14,RPLERRCD(,R1)                                   0550 01745000
         STC   @14,CCAREASN(,R11)                                  0550 01746000
*               CCARETRN=RCEFRMPH;  /* SET RETURN CODE               */ 01747000
         MVI   CCARETRN(R11),X'F2'                                 0551 01748000
*             END;                  /* SET ERASE PHYSICAL ERROR    0552 01749000
*                                                            @Y30SSPJ*/ 01750000
*         RFY                                                      0553 01751000
*          (R0,                                                    0553 01752000
*           R15) UNRSTD;            /*                       @Y30SSPJ*/ 01753000
@RC00542 DS    0H                                                  0553 01754000
@RT00540 DS    0H                                                  0554 01755000
*         RPLDDDD=RPLDDDD+(AMDCINV*AMDCIPCA);/* NEXT CONTROL AREA RBA   01756000
*                                                            @Y30SSPJ*/ 01757000
         L     @10,AMDCINV(,R4)                                    0554 01758000
         MH    @10,AMDCIPCA(,R4)                                   0554 01759000
         AL    @10,RPLDDDD(,R1)                                    0554 01760000
         ST    @10,RPLDDDD(,R1)                                    0554 01761000
*       END;                        /*                       @Y30SSPJ*/ 01762000
*   END;                            /*                       @Y30SSPJ*/ 01763000
*                                                                  0556 01764000
@RT00533 DS    0H                                                  0556 01765000
@DE00518 LTR   R2,R2                                               0556 01766000
         BNZ   @DC00518                                            0556 01767000
         CLI   CCACD1(R11),0                                       0556 01768000
         BE    @DL00518                                            0556 01769000
@DC00518 DS    0H                                                  0557 01770000
*   /*****************************************************************/ 01771000
*   /*                                                               */ 01772000
*   /* CHECK IF ANY ERRORS OCCURED AND IF SO, SAVE           @Y30SSPJ*/ 01773000
*   /* THE ERROR CODE ACROSS THE RE-SERIALIZATION            @Y30SSPJ*/ 01774000
*   /* PROCESS                                               @Y30SSPJ*/ 01775000
*   /*                                                               */ 01776000
*   /*****************************************************************/ 01777000
*                                                                  0557 01778000
*   IF CCACD1=RCS THEN                                             0557 01779000
         CLI   CCACD1(R11),0                                       0557 01780000
         BE    @RT00557                                            0557 01781000
*     ;                             /* ERASE ERROR?          @Y30SSPJ*/ 01782000
*   ELSE                            /* YES-ERASE ERROR       @Y30SSPJ*/ 01783000
*     DO;                           /*                       @Y30SSPJ*/ 01784000
*       DELERRIX=DELERRIX+INCR;     /* SET ERROR INDEX       @Y30SSPJ*/ 01785000
         L     @10,CCACMSWA(,R11)                                  0560 01786000
         LA    @05,1                                               0560 01787000
         SLR   @00,@00                                             0560 01788000
         IC    @00,DELERRIX(,@10)                                  0560 01789000
         ALR   @05,@00                                             0560 01790000
         STC   @05,DELERRIX(,@10)                                  0560 01791000
*       DELERRS(DELERRIX)=CCAPROB;  /* SAVE ERROR            @Y30SSPJ*/ 01792000
*                                                                  0561 01793000
         SLA   @05,2                                               0561 01794000
         L     @00,CCAPROB(,R11)                                   0561 01795000
         ALR   @10,@05                                             0561 01796000
         STCM  @00,15,DELERRS-4(@10)                               0561 01797000
*       /*************************************************************/ 01798000
*       /*                                                           */ 01799000
*       /* CLEAR CCAMODID, CCAREASN, AND CCARETRN                    */ 01800000
*       /*                                                           */ 01801000
*       /*************************************************************/ 01802000
*                                                                  0562 01803000
*       CCAPROB=IGNOREIT;           /* CLEAR RETURN CODE     @Y30SSPJ*/ 01804000
         SLR   @10,@10                                             0562 01805000
         ST    @10,CCAPROB(,R11)                                   0562 01806000
*     END;                          /*                       @Y30SSPJ*/ 01807000
*                                                                  0563 01808000
*   /*****************************************************************/ 01809000
*   /*                                                               */ 01810000
*   /* CALL TO MODULE IGG0CLA3                                       */ 01811000
*   /*                                                               */ 01812000
*   /*****************************************************************/ 01813000
*                                                                  0564 01814000
*Z074RPLM:                                                         0564 01815000
*   CALL IGGPRPLM;                  /* SERIALIZE CATALOG     @Y30SSPJ*/ 01816000
@RT00557 DS    0H                                                  0564 01817000
Z074RPLM L     @15,@CV04534                                        0564 01818000
         BALR  @14,@15                                             0564 01819000
*   R1=ADDR(DELOPNPL);              /* SET PARAM                     */ 01820000
         L     R1,CCACMSWA(,R11)                                   0565 01821000
         LA    R1,DELOPNPL(,R1)                                    0565 01822000
*   GEN(CLOSE MF=(E,(1)));          /* CLOSE THE DATA SET            */ 01823000
         CLOSE MF=(E,(1))                                               01824000
*   RFY                                                            0567 01825000
*    (R1) UNRSTD;                   /*                       @Y30SSPJ*/ 01826000
*                                                                  0567 01827000
*   /*****************************************************************/ 01828000
*   /*                                                               */ 01829000
*   /* RECHECK FOR ERRORS - IF EITHER THE SAVED              @Y30SSPJ*/ 01830000
*   /* CODE OR CURRRENT CODE IS NON-ZERO, TERMINATE          @Y30SSPJ*/ 01831000
*   /* THE DELETE PROCESS                                    @Y30SSPJ*/ 01832000
*   /*                                                               */ 01833000
*   /*****************************************************************/ 01834000
*                                                                  0568 01835000
*   IF DELERRIX=N&                  /* ANY 2ND LEVEL OR      @Y30SSPJ*/ 01836000
*       CCACD1=RCS THEN                                            0568 01837000
         L     @10,CCACMSWA(,R11)                                  0568 01838000
         CLI   DELERRIX(@10),0                                     0568 01839000
         BNE   @RF00568                                            0568 01840000
         CLI   CCACD1(R11),0                                       0568 01841000
         BE    @RT00568                                            0568 01842000
*     ;                             /* ANY 1ST LEVEL ERRORS? @Y30SSPJ*/ 01843000
*   ELSE                            /* YES-1ST OR 2ND LEVEL  @Y30SSPJ*/ 01844000
*Z075DLXT:                                                         0570 01845000
*     CALL IGGPDLXT;                /* YES-ERROR EXIT        @Y30SSPJ*/ 01846000
@RF00568 DS    0H                                                  0570 01847000
Z075DLXT L     @15,@CV04531                                        0570 01848000
         BALR  @14,@15                                             0570 01849000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 01850000
@RT00568 BAL   @14,EXIT                                            0571 01851000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 01852000
         DS 0F                                                          01853000
*   GEN(DC CL8'IGGPDEXA');          /* NAME OF FOLLOWING PROCEDURE   */ 01854000
         DC CL8'IGGPDEXA'                                               01855000
*   END;                            /* END OF INNER PROCEDURE        */ 01856000
@EL00003 DS    0H                                                  0574 01857000
@EF00003 DS    0H                                                  0574 01858000
@ER00003 BR    @14                                                 0574 01859000
@PB00003 DS    0H                                                  0575 01860000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 01861000
         EJECT                                                          01862000
*                                                                  0576 01863000
*/********************************************************************/ 01864000
*/*                                                                  */ 01865000
*/*        IGGPDEXA  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */ 01866000
*/*                                                                  */ 01867000
*/********************************************************************/ 01868000
*                                                                  0576 01869000
*IGGPDEXA:                                                         0576 01870000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 01871000
         B     @PB00004                                            0576 01872000
IGGPDEXA DS    0H                                                  0577 01873000
*   GEN(ENTRY IGGPDEXA );           /* IDENTIFY ENTRY-POINT SYMBOL   */ 01874000
         ENTRY IGGPDEXA                                                 01875000
*Z076:                              /* LABEL FOR PROCEDURE TRACKING  */ 01876000
*Z076DEXA:                          /* LABEL FOR PROCEDURE TRACKING  */ 01877000
*   RFY                                                            0578 01878000
*    (R5,                                                          0578 01879000
*     R6,                                                          0578 01880000
*     R7,                                                          0578 01881000
*     R8,                                                          0578 01882000
*     R9,                                                          0578 01883000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 01884000
Z076     DS    0H                                                  0578 01885000
Z076DEXA DS    0H                                                  0579 01886000
*   RFY                                                            0579 01887000
*    (R2,                                                          0579 01888000
*     R3,                                                          0579 01889000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 01890000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 01891000
         STM 12,14,12(13)                                               01892000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 01893000
         LA 13,12(13)                                                   01894000
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */ 01895000
         BALR 12,0                                                      01896000
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */ 01897000
         LA 15,*-IGGSEGST(0,0)                                          01898000
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE       */ 01899000
*                                                                  0584 01900000
         SR 12,15                                                       01901000
*   /*****************************************************************/ 01902000
*   /*                                                               */ 01903000
*   /*                                                       @Y30SSPJ*/ 01904000
*   /* EXTERNAL PROCEDURE TO EXTRACT ASSOCIATIONS FROM       @Y30SSPJ*/ 01905000
*   /* THE RECORD IN RECORD AREA POINTED TO BY CCAURAB.      @Y30SSPJ*/ 01906000
*   /*                                                               */ 01907000
*   /*****************************************************************/ 01908000
*                                                                  0585 01909000
*   DELEXTWA=DELEXTWA&&DELEXTWA;    /* CLEAR PARAM. LIST AREA        */ 01910000
         L     @10,CCACMSWA(,R11)                                  0585 01911000
         XC    DELEXTWA(128,@10),DELEXTWA(@10)                     0585 01912000
*   CCAXCPL=ADDR(DELCPL);           /* POINT TO EXTRACT CPL  @Y30SSPJ*/ 01913000
         LA    @05,DELCPL(,@10)                                    0586 01914000
         ST    @05,CCAXCPL(,R11)                                   0586 01915000
*   RFY                                                            0587 01916000
*     CTGPL BASED(CCAXCPL);         /* ADDRESSABILITY OF CPL         */ 01917000
*   CTGFIELD(1)=ADDR(DELFPLR);      /* POINT TO 1ST FPL      @Y30SSPJ*/ 01918000
         LA    @15,DELFPLR(,@10)                                   0588 01919000
         ST    @15,CTGFIELD(,@05)                                  0588 01920000
*   RFY                                                            0589 01921000
*     CTGFL BASED(CTGFIELD(1));     /* ADDRESSABILITY OF FPL         */ 01922000
*   CTGNOFLD=INCR;                  /* NO OF DATA FPLS               */ 01923000
         MVI   CTGNOFLD(@05),X'01'                                 0590 01924000
*   CTGWKA=ADDR(DELASCWA);          /* DATA RETURN WORK AREA @Y30SSPJ*/ 01925000
         LA    @14,DELASCWA(,@10)                                  0591 01926000
         ST    @14,CTGWKA(,@05)                                    0591 01927000
*   DELASCWA=DELASCWA&&DELASCWA;    /* CLEAR EXTRACT WA      @Y30SSPJ*/ 01928000
*                                                                  0592 01929000
         XC    DELASCWA(16,@10),DELASCWA(@10)                      0592 01930000
*   /*****************************************************************/ 01931000
*   /*                                                               */ 01932000
*   /* BUILD EXTRACT INTERFACE IN CCA                                */ 01933000
*   /*                                                               */ 01934000
*   /*****************************************************************/ 01935000
*                                                                  0593 01936000
*   CCAR4UR=OFF;                    /* RAB 4 REUSE OFF       @Y30SSPJ*/ 01937000
         NI    CCAR4UR(R11),B'01111111'                            0593 01938000
*   CCAR5UR=OFF;                    /* RAB 5 REUSE OFF       @Y30SSPJ*/ 01939000
         NI    CCAR5UR(R11),B'01111111'                            0594 01940000
*   CCAREUSE=ON;                    /* SET RCD AREA REUSE ON @Y30SSPJ*/ 01941000
         OI    CCAREUSE(R11),B'00000100'                           0595 01942000
*   CCAF2NVC=ON;                    /* NO FPL ADR VAL.CHK.   @Y30SSPJ*/ 01943000
*                                                                  0596 01944000
         OI    CCAF2NVC(R11),B'01000000'                           0596 01945000
*   /*****************************************************************/ 01946000
*   /*                                                               */ 01947000
*   /* CLEAR CCAMODID, CCAREASN, AND CCARETRN                        */ 01948000
*   /*                                                               */ 01949000
*   /*****************************************************************/ 01950000
*                                                                  0597 01951000
*   CCAPROB=IGNOREIT;               /* CLEAR ERROR RETURN    @Y30SSPJ*/ 01952000
         SLR   @10,@10                                             0597 01953000
         ST    @10,CCAPROB(,R11)                                   0597 01954000
*   CCARABB=ADDR(CCARAB3);          /* SET PTR TO BASE RAB   @Y30SSPJ*/ 01955000
         LA    @10,CCARAB3(,R11)                                   0598 01956000
         ST    @10,CCARABB(,R11)                                   0598 01957000
*   CCARABF=ADDR(CCARAB3);          /* SET PTR TO FIRST RAB  @Y30SSPJ*/ 01958000
         ST    @10,CCARABF(,R11)                                   0599 01959000
*   CCARABL=ADDR(CCARAB5);          /* SET PTR TO LAST RAB   @Y30SSPJ*/ 01960000
*                                                                  0600 01961000
         LA    @10,CCARAB5(,R11)                                   0600 01962000
         ST    @10,CCARABL(,R11)                                   0600 01963000
*   /*****************************************************************/ 01964000
*   /*                                                               */ 01965000
*   /* SET FPL PARAMETERS                                            */ 01966000
*   /*                                                               */ 01967000
*   /*****************************************************************/ 01968000
*                                                                  0601 01969000
*   DELNMR=NAMEDS;                  /* FLD NM FOR ASSOCATIONS      0601 01970000
*                                                            @Y30SSPJ*/ 01971000
         L     @10,CCACMSWA(,R11)                                  0601 01972000
         MVC   DELNMR(8,@10),NAMEDS                                0601 01973000
*   CTGFLDNM=ADDR(DELNMR);          /* PTR TO FIELD NAME             */ 01974000
         LA    @14,DELNMR(,@10)                                    0602 01975000
         ST    @14,CTGFLDNM(,@15)                                  0602 01976000
*   CTGFLCHN=ADDR(DELFPLT);         /* ADDR OF TEST FPL      @Y30SSPJ*/ 01977000
*                                                                  0603 01978000
         LA    @14,DELFPLT(,@10)                                   0603 01979000
         ST    @14,CTGFLCHN(,@15)                                  0603 01980000
*   /*****************************************************************/ 01981000
*   /*                                                               */ 01982000
*   /* BUILD TEST FPL                                        @Y30SSPJ*/ 01983000
*   /*                                                               */ 01984000
*   /*****************************************************************/ 01985000
*                                                                  0604 01986000
*   RFY                                                            0604 01987000
*     CTGFL BASED(ADDR(DELFPLT));   /*                       @Y30SSPJ*/ 01988000
*   CTGFLDCD=CTGFLDAL;              /* CODE FOR ALL          @Y30SSPJ*/ 01989000
         LA    @15,116                                             0605 01990000
         ALR   @15,@10                                             0605 01991000
         MVI   CTGFLDCD(@15),X'E0'                                 0605 01992000
*   CTGFLDNO=INCR;                  /* ONE FIELD             @Y30SSPJ*/ 01993000
         MVI   CTGFLDNO(@15),X'01'                                 0606 01994000
*   CTGFLDNM=ADDR(DELNMT);          /* PTR TO FIELD NAME     @Y30SSPJ*/ 01995000
         LA    @14,DELNMT(,@10)                                    0607 01996000
         ST    @14,CTGFLDNM(,@15)                                  0607 01997000
*   DELNMT=TYPE;                    /* TEST FPL FOR TYPE     @Y30SSPJ*/ 01998000
         MVC   DELNMT(8,@10),TYPE                                  0608 01999000
*   CTGFLPT(1)=ADDR(DELNMT2);       /* ADDR OF 'R'           @Y30SSPJ*/ 02000000
         LA    @14,DELNMT2(,@10)                                   0609 02001000
         ST    @14,CTGFLPT(,@15)                                   0609 02002000
*   DELNMT2(1)=CTGTPATH;            /* 'R' ONLY              @Y30SSPJ*/ 02003000
         MVI   DELNMT2(@10),C'R'                                   0610 02004000
*   CTGFLNG(1)=INCR;                /* LENGTH OF ONE BYTE    @Y30SSPJ*/ 02005000
         MVC   CTGFLNG(4,@15),@CF00037                             0611 02006000
*   DELALNG=LENGTH(DELASCWA)-LENGTH(DELASSO);/* LENGTH OF ASSOCIATION   02007000
*                                      WA MINUS 1 ENTRY      @Y30SSPJ*/ 02008000
         MVC   DELALNG(2,@10),@CH00072                             0612 02009000
*   IF RCDID=CTGTPATH THEN          /* RECORD TYPE = PATH?   @Y30SSPJ*/ 02010000
         L     @01,CCAURAB(,R11)                                   0613 02011000
         L     @01,CCACPE1(,@01)                                   0613 02012000
         CLI   RCDID(@01),C'R'                                     0613 02013000
         BNE   @RF00613                                            0613 02014000
*     DO;                           /* YES-PATH TYPE         @Y30SSPJ*/ 02015000
*       CTGWKA=ADDR(DELRASWA);      /* ADDR OF PATH ASSOC WA @Y30SSPJ*/ 02016000
         LA    @15,DELRASWA(,@10)                                  0615 02017000
         ST    @15,CTGWKA(,@05)                                    0615 02018000
*       DELRASWA=DELRASWA&&DELRASWA;/* CLEAR EXTRACT WA      @Y30SSPJ*/ 02019000
         XC    DELRASWA(24,@10),DELRASWA(@10)                      0616 02020000
*       DELRALNG=LENGTH(DELRASWA);  /* LEN OF PATH ASSOC WA  @Y30SSPJ*/ 02021000
         MVC   DELRALNG(2,@10),@CH00112                            0617 02022000
*     END;                          /*                       @Y30SSPJ*/ 02023000
*   ELSE                            /* NO-NOT PATH TYPE      @Y30SSPJ*/ 02024000
*     IF RCDID=CTGTCL THEN          /* RECORD TYPE=CLUSTER?  @Y30SSPJ*/ 02025000
*                                                                  0619 02026000
         B     @RC00613                                            0619 02027000
@RF00613 L     @10,CCAURAB(,R11)                                   0619 02028000
         L     @10,CCACPE1(,@10)                                   0619 02029000
         CLI   RCDID(@10),C'C'                                     0619 02030000
         BNE   @RF00619                                            0619 02031000
*       /*************************************************************/ 02032000
*       /*                                                           */ 02033000
*       /* CHECK IF IMPLICIT DELETE OF CLUSTER PATHS         @Y30SSPJ*/ 02034000
*       /*                                                           */ 02035000
*       /*************************************************************/ 02036000
*                                                                  0620 02037000
*       IF DELGNMR=ON THEN                                         0620 02038000
         L     @10,CCACMSWA(,R11)                                  0620 02039000
         TM    DELGNMR(@10),B'00001000'                            0620 02040000
         BO    @RT00620                                            0620 02041000
*         ;                         /* YES-EXTRACT PATH?     @Y30SSPJ*/ 02042000
*       ELSE                        /* NO-NOT EXT CLUS PATH  @Y30SSPJ*/ 02043000
*         CTGFLDCD=CTGFLDNE;        /* SET CODE FOR NE       @Y30SSPJ*/ 02044000
         L     @10,CCACMSWA(,R11)                                  0622 02045000
         MVI   CTGFLDCD+116(@10),X'60'                             0622 02046000
*     ELSE                          /* NO-NOT CLUSTER        @Y30SSPJ*/ 02047000
*                                                                  0623 02048000
*       /*************************************************************/ 02049000
*       /*                                                           */ 02050000
*       /* IF DELETE NON-VSAM, RESET EXTRACT WORK AREA       @Y30SSPJ*/ 02051000
*       /* LENGTH                                            @Y30SSPJ*/ 02052000
*       /*                                                           */ 02053000
*       /*************************************************************/ 02054000
*                                                                  0623 02055000
*       IF RCDID^=CTGTALIN THEN                                    0623 02056000
         B     @RC00619                                            0623 02057000
@RF00619 L     @10,CCAURAB(,R11)                                   0623 02058000
         L     @10,CCACPE1(,@10)                                   0623 02059000
         CLI   RCDID(@10),C'A'                                     0623 02060000
         BNE   @RT00623                                            0623 02061000
*         ;                         /* ALIEN TYPE DELETE?    @Y30SSPJ*/ 02062000
*       ELSE                        /* YES-DELETE ALIEN TYPE @Y30SSPJ*/ 02063000
*         DO;                       /*                       @Y30SSPJ*/ 02064000
*           DELALNG=DELALNG-LENGTH(DELASSO);/* ASSOCIATION WORK AREA    02065000
*                                      LENGTH                @Y30SSPJ*/ 02066000
         L     @10,CCACMSWA(,R11)                                  0626 02067000
         LH    @05,DELALNG(,@10)                                   0626 02068000
         SL    @05,@CF00058                                        0626 02069000
         STH   @05,DELALNG(,@10)                                   0626 02070000
*           CTGFLDCD=CTGFLDEQ;      /* TEST CONDITION EQUAL  @Y30SSPJ*/ 02071000
         MVI   CTGFLDCD+116(@10),X'80'                             0627 02072000
*           DELNMT2(1)=CTGTGBS;     /* GDG BASE TYPE RECORD  @Y30SSPJ*/ 02073000
         MVI   DELNMT2(@10),C'B'                                   0628 02074000
*         END;                      /*                       @Y30SSPJ*/ 02075000
*                                                                  0629 02076000
*   /*****************************************************************/ 02077000
*   /*                                                               */ 02078000
*   /* SWAP THE CALLERS IN-RAB POINTED TO BY CCAURAB         @Y30SSPJ*/ 02079000
*   /* WITH RABS. THIS ASSURES A COMMON INTERFACE WITH       @Y30SSPJ*/ 02080000
*   /* ALL CALLERS. THE CALLERS CCAURAB AND IN-RAB ARE       @Y30SSPJ*/ 02081000
*   /* TRANSPARENT TO THE CALLER.                            @Y30SSPJ*/ 02082000
*   /*                                                               */ 02083000
*   /*****************************************************************/ 02084000
*                                                                  0630 02085000
*   IF CCAURAB=ADDR(CCARAB3) THEN                                  0630 02086000
@RT00623 DS    0H                                                  0630 02087000
@RC00619 DS    0H                                                  0630 02088000
@RC00613 LA    @10,CCARAB3(,R11)                                   0630 02089000
         C     @10,CCAURAB(,R11)                                   0630 02090000
         BE    @RT00630                                            0630 02091000
*     ;                             /* NEED TO SWAP?         @Y30SSPJ*/ 02092000
*   ELSE                            /* YES-SWAP RAB3         @Y30SSPJ*/ 02093000
*     DO;                           /*                       @Y30SSPJ*/ 02094000
*       CCAURAB->CCARAB=CCAURAB->CCARAB&&CCARAB3;/* BEG SWAP @Y30SSPJ*/ 02095000
         L     @10,CCAURAB(,R11)                                   0633 02096000
         XC    CCARAB(20,@10),CCARAB3(R11)                         0633 02097000
*       CCARAB3=CCAURAB->CCARAB&&CCARAB3;/* IN-RAB SWAPPED   @Y30SSPJ*/ 02098000
         XC    CCARAB3(20,R11),CCARAB(@10)                         0634 02099000
*       CCAURAB->CCARAB=CCAURAB->CCARAB&&CCARAB3;/* SWAP DONE      0635 02100000
*                                                            @Y30SSPJ*/ 02101000
         XC    CCARAB(20,@10),CCARAB3(R11)                         0635 02102000
*     END;                          /*                       @Y30SSPJ*/ 02103000
*                                                                  0636 02104000
*   /*****************************************************************/ 02105000
*   /*                                                               */ 02106000
*   /* CALL TO MODULE IGG0CLAZ                                       */ 02107000
*   /*                                                               */ 02108000
*   /*****************************************************************/ 02109000
*                                                                  0637 02110000
*Z078EXT:                                                          0637 02111000
*   CALL IGGPEXT;                   /* EXTRACT ASSOCIATIONS  @Y30SSPJ*/ 02112000
*                                                                  0637 02113000
@RT00630 DS    0H                                                  0637 02114000
Z078EXT  L     @15,@CV04522                                        0637 02115000
         BALR  @14,@15                                             0637 02116000
*   /*****************************************************************/ 02117000
*   /*                                                               */ 02118000
*   /* RESTORE THE CALLERS IN-RAB FROM RAB3 AND RAB3         @Y30SSPJ*/ 02119000
*   /* FROM IN-RAB.                                          @Y30SSPJ*/ 02120000
*   /*                                                               */ 02121000
*   /*****************************************************************/ 02122000
*                                                                  0638 02123000
*   IF CCAURAB=ADDR(CCARAB3) THEN                                  0638 02124000
         LA    @10,CCARAB3(,R11)                                   0638 02125000
         C     @10,CCAURAB(,R11)                                   0638 02126000
         BE    @RT00638                                            0638 02127000
*     ;                             /* NEED TO SWAP?         @Y30SSPJ*/ 02128000
*   ELSE                            /* YES-SWAP RAB3         @Y30SSPJ*/ 02129000
*     DO;                           /*                       @Y30SSPJ*/ 02130000
*       CCAURAB->CCARAB=CCAURAB->CCARAB&&CCARAB3;/* BEG SWAP @Y30SSPJ*/ 02131000
         L     @10,CCAURAB(,R11)                                   0641 02132000
         XC    CCARAB(20,@10),CCARAB3(R11)                         0641 02133000
*       CCARAB3=CCAURAB->CCARAB&&CCARAB3;/* IN-RAB SWAPPED   @Y30SSPJ*/ 02134000
         XC    CCARAB3(20,R11),CCARAB(@10)                         0642 02135000
*       CCAURAB->CCARAB=CCAURAB->CCARAB&&CCARAB3;/* SWAP DONE      0643 02136000
*                                                            @Y30SSPJ*/ 02137000
         XC    CCARAB(20,@10),CCARAB3(R11)                         0643 02138000
*     END;                          /*                       @Y30SSPJ*/ 02139000
*                                                                  0644 02140000
*   /*****************************************************************/ 02141000
*   /*                                                               */ 02142000
*   /* CHECK IF TYPE IS CLUSTER OR AIX AND IF TRUE USE       @Y30SSPJ*/ 02143000
*   /* THE REQUIRED SIZE TO CALCULATE THE NUMBER OF          @Y30SSPJ*/ 02144000
*   /* OBJECTS TO DELETE.                                    @Y30SSPJ*/ 02145000
*   /*                                                               */ 02146000
*   /*****************************************************************/ 02147000
*                                                                  0645 02148000
*   IF(RCDID^=CTGTCL&               /* TYPE CLUSTER OR       @Y30SSPJ*/ 02149000
*       RCDID^=CTGTAIX) THEN                                       0645 02150000
@RT00638 L     @10,CCAURAB(,R11)                                   0645 02151000
         L     @10,CCACPE1(,@10)                                   0645 02152000
         CLI   RCDID(@10),C'C'                                     0645 02153000
         BE    @RF00645                                            0645 02154000
         CLI   RCDID(@10),C'G'                                     0645 02155000
         BNE   @RT00645                                            0645 02156000
*     ;                             /* AIX?                  @Y30SSPJ*/ 02157000
*   ELSE                            /* YES-CALC NUM ENTRIES  @Y30SSPJ*/ 02158000
*     DO;                           /*                       @Y30SSPJ*/ 02159000
@RF00645 DS    0H                                                  0648 02160000
*       R3=(DELARLNG-LENGTH(DELASSO))/LENGTH(DELASSO);/* NUMBER OF 0648 02161000
*                                      ASSOCIATIONS          @Y30SSPJ*/ 02162000
*                                                                  0648 02163000
         LA    @10,4                                               0648 02164000
         L     @05,CCACMSWA(,R11)                                  0648 02165000
         LH    @00,DELARLNG(,@05)                                  0648 02166000
         SLR   @00,@10                                             0648 02167000
         SRDA  @00,32                                              0648 02168000
         DR    @00,@10                                             0648 02169000
         LR    R3,@01                                              0648 02170000
*       /*************************************************************/ 02171000
*       /*                                                           */ 02172000
*       /* IF WORK AREA IS TOO SMALL, IGNORE THE ERROR       @Y30SSPJ*/ 02173000
*       /*                                                           */ 02174000
*       /*************************************************************/ 02175000
*                                                                  0649 02176000
*       IF CCACD1^=RCVLSZ THEN                                     0649 02177000
         CLI   CCACD1(R11),40                                      0649 02178000
         BNE   @RT00649                                            0649 02179000
*         ;                         /* ASSOC WA TOO SMALL?   @Y30SSPJ*/ 02180000
*       ELSE                        /* YES-WA TOO SMALL      @Y30SSPJ*/ 02181000
*                                                                  0651 02182000
*         /***********************************************************/ 02183000
*         /*                                                         */ 02184000
*         /* CLEAR CCAMODID, CCAREASN, AND CCARETRN                  */ 02185000
*         /*                                                         */ 02186000
*         /***********************************************************/ 02187000
*                                                                  0651 02188000
*         CCAPROB=IGNOREIT;         /* CLEAR ERROR           @Y30SSPJ*/ 02189000
         SLR   @10,@10                                             0651 02190000
         ST    @10,CCAPROB(,R11)                                   0651 02191000
*     END;                          /*                       @Y30SSPJ*/ 02192000
*                                                                  0652 02193000
@RT00649 DS    0H                                                  0653 02194000
*   /*****************************************************************/ 02195000
*   /*                                                               */ 02196000
*   /* CHECK IF EXTRACT ERROR OCCURED                        @Y30SSPJ*/ 02197000
*   /*                                                               */ 02198000
*   /*****************************************************************/ 02199000
*                                                                  0653 02200000
*   IF CCACD1=RCS THEN                                             0653 02201000
@RT00645 CLI   CCACD1(R11),0                                       0653 02202000
         BE    @RT00653                                            0653 02203000
*     ;                             /* EXTRACT ERROR         @Y30SSPJ*/ 02204000
*   ELSE                            /* YES-EXT ERROR         @Y30SSPJ*/ 02205000
*Z080DLXT:                                                         0655 02206000
*     CALL IGGPDLXT;                /* ERROR EXIT            @Y30SSPJ*/ 02207000
*                                                                  0655 02208000
Z080DLXT L     @15,@CV04531                                        0655 02209000
         BALR  @14,@15                                             0655 02210000
*   /*****************************************************************/ 02211000
*   /*                                                               */ 02212000
*   /* CHECK IF TYPE IS OTHER THAN PATH AND IF SO            @Y30SSPJ*/ 02213000
*   /* CALCULATE NUMBER OF OBJECTS                           @Y30SSPJ*/ 02214000
*   /*                                                               */ 02215000
*   /*****************************************************************/ 02216000
*                                                                  0656 02217000
*   IF RCDID=CTGTPATH THEN                                         0656 02218000
@RT00653 L     @10,CCAURAB(,R11)                                   0656 02219000
         L     @10,CCACPE1(,@10)                                   0656 02220000
         CLI   RCDID(@10),C'R'                                     0656 02221000
         BE    @RT00656                                            0656 02222000
*     ;                             /* TYPE PATH?            @Y30SSPJ*/ 02223000
*   ELSE                            /* NO-NOT PATH TYPE      @Y30SSPJ*/ 02224000
*     DO;                           /*                       @Y30SSPJ*/ 02225000
*                                                                  0658 02226000
*       /*************************************************************/ 02227000
*       /*                                                           */ 02228000
*       /* DETERMINE IF ESDS CLUSTER WITH EITHER PATHS       @Y30SSPJ*/ 02229000
*       /* OR AIXS. IF TRUE SET THE NUMBER OF OBJECTS TO     @Y30SSPJ*/ 02230000
*       /* ONE.                                              @Y30SSPJ*/ 02231000
*       /*                                                           */ 02232000
*       /*************************************************************/ 02233000
*                                                                  0659 02234000
*       IF RCDID=CTGTCL&            /* TYPE CLUSTER AND      @Y30SSPJ*/ 02235000
*           (DELATYPE(2)=CTGTAIX|   /* AIX EXTRACTED OR      @Y30SSPJ*/ 02236000
*           DELATYPE(2)=CTGTPATH) THEN/* PATH EXTRACTED?     @Y30SSPJ*/ 02237000
         L     @10,CCAURAB(,R11)                                   0659 02238000
         L     @10,CCACPE1(,@10)                                   0659 02239000
         CLI   RCDID(@10),C'C'                                     0659 02240000
         BNE   @RF00659                                            0659 02241000
         L     @10,CCACMSWA(,R11)                                  0659 02242000
         CLI   DELATYPE+4(@10),C'G'                                0659 02243000
         BE    @RT00659                                            0659 02244000
         CLI   DELATYPE+4(@10),C'R'                                0659 02245000
         BNE   @RF00659                                            0659 02246000
@RT00659 DS    0H                                                  0660 02247000
*         DELNMOBJ=INCR;            /* YES-SET NUMBER OBJECT TO 1  0660 02248000
*                                                            @Y30SSPJ*/ 02249000
         L     @10,CCACMSWA(,R11)                                  0660 02250000
         MVI   DELNMOBJ(@10),X'01'                                 0660 02251000
*       ELSE                        /* NO-NOT ESDS CLUSTER   @Y30SSPJ*/ 02252000
*         DELNMOBJ=ADDR(DELFPLR)->CTGFLNG(1)/LENGTH(DELASSO);/*    0661 02253000
*                                      NUMBER OF OBJECTS     @Y30SSPJ*/ 02254000
         B     @RC00659                                            0661 02255000
@RF00659 L     @10,CCACMSWA(,R11)                                  0661 02256000
         L     @00,CTGFLNG+84(,@10)                                0661 02257000
         SRDA  @00,32                                              0661 02258000
         D     @00,@CF00058                                        0661 02259000
         STC   @01,DELNMOBJ(,@10)                                  0661 02260000
*       DELATYPE(DELNMOBJ+INCR)=RCDID;/* SAVE RCD ID         @Y30SSPJ*/ 02261000
@RC00659 L     @10,CCACMSWA(,R11)                                  0662 02262000
         SLR   @05,@05                                             0662 02263000
         IC    @05,DELNMOBJ(,@10)                                  0662 02264000
         LR    @15,@05                                             0662 02265000
         SLA   @15,2                                               0662 02266000
         ST    @15,@TF00001                                        0662 02267000
         ALR   @15,@10                                             0662 02268000
         L     @01,CCAURAB(,R11)                                   0662 02269000
         L     @14,CCACPE1(,@01)                                   0662 02270000
         MVC   DELATYPE(1,@15),RCDID(@14)                          0662 02271000
*       DELACI(DELNMOBJ+INCR)=RCDCINO;/* SAVE RCD CI NUM     @Y30SSPJ*/ 02272000
         LR    @01,@10                                             0663 02273000
         AL    @01,@TF00001                                        0663 02274000
         MVC   DELACI(3,@01),RCDCINO(@14)                          0663 02275000
*       IF RCDID=CTGTAIX THEN       /* DELETE AIX            @Y30SSPJ*/ 02276000
         CLI   RCDID(@14),C'G'                                     0664 02277000
         BNE   @RF00664                                            0664 02278000
*         DO;                       /* YES-AIX TYPE          @Y30SSPJ*/ 02279000
*           DELNROBJ=R3-DELNMOBJ;   /* NUM OF PATHS          @Y30SSPJ*/ 02280000
         LCR   @05,@05                                             0666 02281000
         ALR   @05,R3                                              0666 02282000
         STC   @05,DELNROBJ(,@10)                                  0666 02283000
*           DELGASWA=DELASCWA;      /* MOVE TO AIX ASSOC WA  @Y30SSPJ*/ 02284000
         MVC   DELGASWA(16,@10),DELASCWA(@10)                      0667 02285000
*         END;                      /*                       @Y30SSPJ*/ 02286000
*       ELSE                        /* NO-NOT AIX TYPE       @Y30SSPJ*/ 02287000
*                                                                  0669 02288000
*         /***********************************************************/ 02289000
*         /*                                                         */ 02290000
*         /* CHECK IF TYPE IS CLUSTER                        @Y30SSPJ*/ 02291000
*         /*                                                         */ 02292000
*         /***********************************************************/ 02293000
*                                                                  0669 02294000
*         IF RCDID^=CTGTCL THEN                                    0669 02295000
         B     @RC00664                                            0669 02296000
@RF00664 L     @10,CCAURAB(,R11)                                   0669 02297000
         L     @10,CCACPE1(,@10)                                   0669 02298000
         CLI   RCDID(@10),C'C'                                     0669 02299000
         BNE   @RT00669                                            0669 02300000
*           ;                       /* TYPE CLUSTER?         @Y30SSPJ*/ 02301000
*         ELSE                      /* YES-CLUSTER TYPE      @Y30SSPJ*/ 02302000
*           DO;                     /*                       @Y30SSPJ*/ 02303000
*             DELCASWA=DELASCWA;    /* SAVE CLUSTER ASSOC WA @Y30SSPJ*/ 02304000
         L     @10,CCACMSWA(,R11)                                  0672 02305000
         MVC   DELCASWA(16,@10),DELASCWA(@10)                      0672 02306000
*             IF DELGNMR=ON THEN    /* EXTRACT CLUSTER PATHS?      0673 02307000
*                                                            @Y30SSPJ*/ 02308000
         TM    DELGNMR(@10),B'00001000'                            0673 02309000
         BNO   @RF00673                                            0673 02310000
*               DELNROBJ=R3-DELNMOBJ;/* YES-SET NUMBER OF PATHS    0674 02311000
*                                                            @Y30SSPJ*/ 02312000
         LR    @05,R3                                              0674 02313000
         SLR   @15,@15                                             0674 02314000
         IC    @15,DELNMOBJ(,@10)                                  0674 02315000
         SLR   @05,@15                                             0674 02316000
         STC   @05,DELNROBJ(,@10)                                  0674 02317000
*             ELSE                  /* NO-EXTRACT NUMBER AIXS      0675 02318000
*                                                            @Y30SSPJ*/ 02319000
*               DO;                 /*                       @Y30SSPJ*/ 02320000
         B     @RC00673                                            0675 02321000
@RF00673 DS    0H                                                  0676 02322000
*                 DELNCOBJ=DELNMOBJ;/* SAVE NUMBER OBJECTS   @Y30SSPJ*/ 02323000
         L     @10,CCACMSWA(,R11)                                  0676 02324000
         SLR   @05,@05                                             0676 02325000
         IC    @05,DELNMOBJ(,@10)                                  0676 02326000
         STC   @05,DELNCOBJ(,@10)                                  0676 02327000
*                 DELNGOBJ=R3-DELNMOBJ;/* SET NUM OF AIXS    @Y30SSPJ*/ 02328000
         LCR   @05,@05                                             0677 02329000
         ALR   @05,R3                                              0677 02330000
         STC   @05,DELNGOBJ(,@10)                                  0677 02331000
*               END;                /*                       @Y30SSPJ*/ 02332000
*           END;                    /*                       @Y30SSPJ*/ 02333000
@RC00673 DS    0H                                                  0680 02334000
*     END;                          /*                       @Y30SSPJ*/ 02335000
@RT00669 DS    0H                                                  0680 02336000
@RC00664 DS    0H                                                  0681 02337000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 02338000
@RT00656 BAL   @14,EXIT                                            0681 02339000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 02340000
         DS 0F                                                          02341000
*   GEN(DC CL8'IGGPDOPN');          /* NAME OF FOLLOWING PROCEDURE   */ 02342000
         DC CL8'IGGPDOPN'                                               02343000
*   END;                            /* END OF INNER PROCEDURE        */ 02344000
@EL00004 DS    0H                                                  0684 02345000
@EF00004 DS    0H                                                  0684 02346000
@ER00004 BR    @14                                                 0684 02347000
@PB00004 DS    0H                                                  0685 02348000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 02349000
         EJECT                                                          02350000
*                                                                  0686 02351000
*/********************************************************************/ 02352000
*/*                                                                  */ 02353000
*/*        IGGPDOPN  -  PROCEDURE  EXTERNALLY  CALLED  NESTED        */ 02354000
*/*                                                                  */ 02355000
*/********************************************************************/ 02356000
*                                                                  0686 02357000
*IGGPDOPN:                                                         0686 02358000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 02359000
         B     @PB00005                                            0686 02360000
IGGPDOPN DS    0H                                                  0687 02361000
*   GEN(ENTRY IGGPDOPN );           /* IDENTIFY ENTRY-POINT SYMBOL   */ 02362000
         ENTRY IGGPDOPN                                                 02363000
*Z081:                              /* LABEL FOR PROCEDURE TRACKING  */ 02364000
*Z081DOPN:                          /* LABEL FOR PROCEDURE TRACKING  */ 02365000
*   RFY                                                            0688 02366000
*    (R5,                                                          0688 02367000
*     R6,                                                          0688 02368000
*     R7,                                                          0688 02369000
*     R8,                                                          0688 02370000
*     R9,                                                          0688 02371000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 02372000
Z081     DS    0H                                                  0688 02373000
Z081DOPN DS    0H                                                  0689 02374000
*   RFY                                                            0689 02375000
*    (R2,                                                          0689 02376000
*     R3,                                                          0689 02377000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 02378000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 02379000
         STM 12,14,12(13)                                               02380000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 02381000
         LA 13,12(13)                                                   02382000
*   GEN(BALR 12,0);                 /* ESTABLISH ADDRESSABILITY      */ 02383000
         BALR 12,0                                                      02384000
*   GEN(LA 15,*-IGGSEGST(0,0));     /* COMPUTE MODULE BASE           */ 02385000
         LA 15,*-IGGSEGST(0,0)                                          02386000
*   GEN(SR 12,15);                  /* SET BASE TO MODULE BASE       */ 02387000
*                                                                  0694 02388000
         SR 12,15                                                       02389000
*   /*****************************************************************/ 02390000
*   /*                                                               */ 02391000
*   /*                                                       @Y30SSPJ*/ 02392000
*   /* THIS ROUTINE IS CALLED TO DETERMINE IF THE OBJECT     @Y30SSPJ*/ 02393000
*   /* TO BE DELETED IS ALREADY OPEN AND IF SO, TO PREVENT   @Y30SSPJ*/ 02394000
*   /* ITS DELETION.                                         @Y30SSPJ*/ 02395000
*   /*                                                               */ 02396000
*   /*****************************************************************/ 02397000
*                                                                  0695 02398000
*   DELENQ=DELENQ&&DELENQ;          /* CLEAR ENQ PARM LIST   @Y30SSPJ*/ 02399000
         L     @10,CCAR5REC(,R11)                                  0695 02400000
         XC    DELENQ(20,@10),DELENQ(@10)                          0695 02401000
*   R4=CCAACB->ACBUAPTR;            /* SET PTR TO CAT NAME           */ 02402000
         L     @10,CCAACB(,R11)                                    0696 02403000
         L     R4,ACBUAPTR(,@10)                                   0696 02404000
*   R3=INCR;                        /* NONZERO ENQ NEEDED            */ 02405000
         LA    R3,1                                                0697 02406000
*   IF R4->CAXMCT^=ON&              /* HAVE ACBFROM AMS      @Y30SSPJ*/ 02407000
*       R4->CAXSCR^=ON THEN         /* HAVE ACBFROM AMS      @Y30SSPJ*/ 02408000
         TM    CAXMCT(R4),B'00000101'                              0698 02409000
         BNZ   @RF00698                                            0698 02410000
*     DO;                           /* NO,SEARCH CAXWA CHAIN         */ 02411000
*       GEN REFS(CAXQN,CAXRN)(ENQ (CAXQN,CAXRN,E,4,SYSTEM));       0700 02412000
         ENQ (CAXQN,CAXRN,E,4,SYSTEM)                                   02413000
*       R3=CBSCAXCN;                /* GET CHAIN POINTER             */ 02414000
         L     @10,CVTPTR                                          0701 02415000
         L     @10,CVTCBSP(,@10)                                   0701 02416000
         L     R3,CBSCAXCN(,@10)                                   0701 02417000
*       DO WHILE(R3^=N&R3->CAXCNAM^=R4->CAXCNAM);/* SRCH CAX @ZA07561*/ 02418000
         B     @DE00702                                            0702 02419000
@DL00702 DS    0H                                                  0703 02420000
*         R3=R3->CAXCHN;            /* GET NEXT POINTER      @Y30SSPJ*/ 02421000
         L     R3,CAXCHN(,R3)                                      0703 02422000
*       END;                        /*                       @Y30SSPJ*/ 02423000
*                                                                  0704 02424000
@DE00702 LTR   R3,R3                                               0704 02425000
         BZ    @DC00702                                            0704 02426000
         CLC   CAXCNAM(44,R3),CAXCNAM(R4)                          0704 02427000
         BNE   @DL00702                                            0704 02428000
@DC00702 DS    0H                                                  0705 02429000
*       /*************************************************************/ 02430000
*       /*                                                           */ 02431000
*       /* CHECK IF ACB WAS FOUND                            @Y30SSPJ*/ 02432000
*       /*                                                           */ 02433000
*       /*************************************************************/ 02434000
*                                                                  0705 02435000
*       IF R3=N THEN                                               0705 02436000
         LTR   R3,R3                                               0705 02437000
         BZ    @RT00705                                            0705 02438000
*         ;                         /* ACB FOUND ON CHAIN?   @Y30SSPJ*/ 02439000
*       ELSE                        /* YES-ACB FOUND.        @Y30SSPJ*/ 02440000
*         RNAMECA=R3->COPACB;       /* CHAIN ACB POINTER     @Y30SSPJ*/ 02441000
         L     @10,CCAR5REC(,R11)                                  0707 02442000
         L     @05,COPACB-1(,R3)                                   0707 02443000
         LA    @05,0(,@05)                                         0707 02444000
         STCM  @05,15,RNAMECA(@10)                                 0707 02445000
*       GEN REFS(CAXQN,CAXRN)(DEQ (CAXQN,CAXRN,4,SYSTEM));         0708 02446000
@RT00705 DS    0H                                                  0708 02447000
         DEQ (CAXQN,CAXRN,4,SYSTEM)                                     02448000
*     END;                          /*                       @Y30SSPJ*/ 02449000
*   ELSE                            /* ACB GIVEN BY AMS              */ 02450000
*     RNAMECA=CCAACB;               /* SAME AS ON CHAIN              */ 02451000
         B     @RC00698                                            0710 02452000
@RF00698 L     @10,CCAR5REC(,R11)                                  0710 02453000
         MVC   RNAMECA(4,@10),CCAACB(R11)                          0710 02454000
*   RNAMECA(1)='00'X;               /* CLEAR HI-ORDER BYTE   @ZA27641*/ 02455000
*                                                                  0711 02456000
@RC00698 L     @10,CCAR5REC(,R11)                                  0711 02457000
         MVI   RNAMECA(@10),X'00'                                  0711 02458000
*   /*****************************************************************/ 02459000
*   /*                                                               */ 02460000
*   /* CHECK IF ACB WAS FOUND                                @Y30SSPJ*/ 02461000
*   /*                                                               */ 02462000
*   /*****************************************************************/ 02463000
*                                                                  0712 02464000
*   IF R3=N THEN                                                   0712 02465000
         LTR   R3,R3                                               0712 02466000
         BZ    @RT00712                                            0712 02467000
*     ;                             /* ACB FOUND?            @Y30SSPJ*/ 02468000
*   ELSE                            /* YES-ACB FOUND         @Y30SSPJ*/ 02469000
*     DO;                           /*                       @Y30SSPJ*/ 02470000
*       RNAMECI=DELACI(1);          /* SET FIRST OBJECT CI           */ 02471000
         L     @10,CCAR5REC(,R11)                                  0715 02472000
         L     @05,CCACMSWA(,R11)                                  0715 02473000
         MVC   RNAMECI(3,@10),DELACI(@05)                          0715 02474000
*       RNAMEID=CTGTINDX;           /* SET TYPE ID VALUE             */ 02475000
         MVI   RNAMEID(@10),C'I'                                   0716 02476000
*       ENQRNADR=ADDR(RNAME);       /* POINT TO MINOR NAME   @Y30SSPJ*/ 02477000
         LA    @05,RNAME(,@10)                                     0717 02478000
         ST    @05,ENQRNADR(,@10)                                  0717 02479000
*       ENQQNADR=ADDR(QNAME);       /* POINT TO MAJOR NAME   @Y30SSPJ*/ 02480000
         LA    @05,QNAME                                           0718 02481000
         ST    @05,ENQQNADR(,@10)                                  0718 02482000
*       ENQRLEN=LENGTH(RNAME);      /* SIZE OF NAME FOR ENQ          */ 02483000
         MVI   ENQRLEN(@10),X'08'                                  0719 02484000
*       ENQEND=ON;                  /* END OF PARAMETER LIST         */ 02485000
         OI    ENQEND(@10),B'10000000'                             0720 02486000
*       RFY                                                        0721 02487000
*         R1 RESTRICTED;            /*                       @Y30SSPJ*/ 02488000
*       R1=ADDR(ENQPROPR);          /* POINT TO ENQ PARMLIST @Y30SSPJ*/ 02489000
         LR    R1,@10                                              0722 02490000
*       GEN(ENQ (,,E,,SYSTEM),RET=TEST,MF=(E,(1)));/*        @Y30SSPJ*/ 02491000
         ENQ (,,E,,SYSTEM),RET=TEST,MF=(E,(1))                          02492000
*       RFY                                                        0724 02493000
*         R1 UNRESTRICTED;          /*                       @Y30SSPJ*/ 02494000
*       RFY                                                        0725 02495000
*         R15 RESTRICTED;           /*                       @Y30SSPJ*/ 02496000
*       IF R15^=N THEN              /* CHECK IF FREE         @Y30SSPJ*/ 02497000
*                                                                  0726 02498000
         LTR   R15,R15                                             0726 02499000
         BZ    @RF00726                                            0726 02500000
*         /***********************************************************/ 02501000
*         /*                                                         */ 02502000
*         /* SET CCAMODID='BG', CCAREASN=RSN4, CCARETRN=RCDSO        */ 02503000
*         /*                                                         */ 02504000
*         /***********************************************************/ 02505000
*                                                                  0727 02506000
*         CCAPROB=IGGSEGID+(RSN4*K256)+RCDSO;/* SET DATA SET OPEN  0727 02507000
*                                                            @Y30SSPJ*/ 02508000
         MVC   CCAPROB(4,R11),@CF04775                             0727 02509000
*       ELSE                        /* NOT OPEN CONTINUE     @Y30SSPJ*/ 02510000
*                                                                  0728 02511000
*         /***********************************************************/ 02512000
*         /*                                                         */ 02513000
*         /* CHECK IF THERE IS ANOTHER OBJECT TO TEST IF OPEN        */ 02514000
*         /*                                                 @Y30SSPJ*/ 02515000
*         /*                                                         */ 02516000
*         /***********************************************************/ 02517000
*                                                                  0728 02518000
*         IF DELACI(2)=N THEN                                      0728 02519000
         B     @RC00726                                            0728 02520000
@RF00726 L     @14,CCACMSWA(,R11)                                  0728 02521000
         ICM   @10,7,DELACI+4(@14)                                 0728 02522000
         BZ    @RT00728                                            0728 02523000
*           ;                       /* ANOTHER OBJ TO CHECK  @Y30SSPJ*/ 02524000
*         ELSE                      /* YES-ANOTHER TO CHECK  @Y30SSPJ*/ 02525000
*           DO;                     /*                       @Y30SSPJ*/ 02526000
*             RNAMECI=DELACI(2);    /* SET CI VALUE          @Y30SSPJ*/ 02527000
         L     @14,CCAR5REC(,R11)                                  0731 02528000
         L     @10,CCACMSWA(,R11)                                  0731 02529000
         MVC   RNAMECI(3,@14),DELACI+4(@10)                        0731 02530000
*             RNAMEID=CTGTINDX;     /* SET OBJECT TYPE               */ 02531000
         MVI   RNAMEID(@14),C'I'                                   0732 02532000
*             RFY                                                  0733 02533000
*               R1 RESTRICTED;      /*                       @Y30SSPJ*/ 02534000
*             R1=ADDR(ENQPROPR);    /* POINT TO ENQ PARMLIST @Y30SSPJ*/ 02535000
         LR    R1,@14                                              0734 02536000
*             GEN(ENQ (,,E,,SYSTEM),RET=TEST,MF=(E,(1)));/*  @Y30SSPJ*/ 02537000
         ENQ (,,E,,SYSTEM),RET=TEST,MF=(E,(1))                          02538000
*             RFY                                                  0736 02539000
*               R1 UNRESTRICTED;    /*                       @Y30SSPJ*/ 02540000
*                                                                  0736 02541000
*             /*******************************************************/ 02542000
*             /*                                                     */ 02543000
*             /* CHECK IF SECOND OBJECT IS OPEN              @Y30SSPJ*/ 02544000
*             /*                                                     */ 02545000
*             /*******************************************************/ 02546000
*                                                                  0737 02547000
*             IF R15=N THEN                                        0737 02548000
         LTR   R15,R15                                             0737 02549000
         BZ    @RT00737                                            0737 02550000
*               ;                   /* CHECK IF DATA SET OPN @Y30SSPJ*/ 02551000
*             ELSE                  /* YES-DATA SET IS OPEN  @Y30SSPJ*/ 02552000
*                                                                  0739 02553000
*               /*****************************************************/ 02554000
*               /*                                                   */ 02555000
*               /* SET CCAMODID='BG', CCAREASN=RSN4, CCARETRN=RCDSO  */ 02556000
*               /*                                                   */ 02557000
*               /*****************************************************/ 02558000
*                                                                  0739 02559000
*               CCAPROB=IGGSEGID+(RSN4*K256)+RCDSO;/* SET DATA SET 0739 02560000
*                                      OPEN ERROR            @Y30SSPJ*/ 02561000
         MVC   CCAPROB(4,R11),@CF04775                             0739 02562000
*             RFY                                                  0740 02563000
*               R15 UNRESTRICTED;   /*                       @Y30SSPJ*/ 02564000
@RT00737 DS    0H                                                  0741 02565000
*           END;                    /*                       @Y30SSPJ*/ 02566000
*     END;                          /*                       @Y30SSPJ*/ 02567000
@RT00728 DS    0H                                                  0742 02568000
@RC00726 DS    0H                                                  0743 02569000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 02570000
@RT00712 BAL   @14,EXIT                                            0743 02571000
*   GEN(DS 0F);                     /* FULLWORD BOUNDARY ALIGNMENT   */ 02572000
         DS 0F                                                          02573000
*   GEN(DC CL8'IGGPDDCK');          /* NAME OF FOLLOWING PROCEDURE   */ 02574000
         DC CL8'IGGPDDCK'                                               02575000
*   END;                            /* END OF INNER PROCEDURE        */ 02576000
@EL00005 DS    0H                                                  0746 02577000
@EF00005 DS    0H                                                  0746 02578000
@ER00005 BR    @14                                                 0746 02579000
@PB00005 DS    0H                                                  0747 02580000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 02581000
         EJECT                                                          02582000
*                                                                  0748 02583000
*/********************************************************************/ 02584000
*/*                                                                  */ 02585000
*/*        IGGPDDCK  -  PROCEDURE  INTERNALLY  CALLED  NESTED        */ 02586000
*/*                                                                  */ 02587000
*/********************************************************************/ 02588000
*                                                                  0748 02589000
*IGGPDDCK:                                                         0748 02590000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 02591000
         B     @PB00006                                            0748 02592000
IGGPDDCK DS    0H                                                  0749 02593000
*Z084:                              /* LABEL FOR PROCEDURE TRACKING  */ 02594000
*Z084DDCK:                          /* LABEL FOR PROCEDURE TRACKING  */ 02595000
*   RFY                                                            0749 02596000
*    (R5,                                                          0749 02597000
*     R6,                                                          0749 02598000
*     R7,                                                          0749 02599000
*     R8,                                                          0749 02600000
*     R9,                                                          0749 02601000
*     R10) UNRSTD;                  /* PL/S COMPILER WORK REGISTERS  */ 02602000
Z084     DS    0H                                                  0749 02603000
Z084DDCK DS    0H                                                  0750 02604000
*   RFY                                                            0750 02605000
*    (R2,                                                          0750 02606000
*     R3,                                                          0750 02607000
*     R4) RSTD;                     /* RESTRICT LOCAL WORK REGISTERS */ 02608000
*   GEN(STM 12,14,12(13));          /* SAVE REGISTERS OF CALLER      */ 02609000
         STM 12,14,12(13)                                               02610000
*   GEN(LA 13,12(13));              /* POINT TO NEXT SAVE AREA       */ 02611000
         LA 13,12(13)                                                   02612000
*/* ******************************************************************/ 02613000
*/*  THIS SUBFUNCTION CHECKS FOR A DDNAME ADDRESS SPECIFIED  @ZA01487*/ 02614000
*/*  IN THE CATALOG PARAMETER LIST. IF NO ADDRESS IF GIVEN,  @ZA01487*/ 02615000
*/*  A RETURN CODE 240 IS SET TO FORCE DYNAMIC ALLOCATION.   @ZA01487*/ 02616000
*/*  IF AN ADDRESS EXISTS, THE DDNAME IS CHECKED FOR A       @ZA01487*/ 02617000
*/*  MATCHING DDNAME IN THE TIOT.                            @ZA01487*/ 02618000
*/* ******************************************************************/ 02619000
*                                                                  0753 02620000
*   RFY                                                            0753 02621000
*     CTGPL BASED(CCACPL);          /* BASE CPL              @ZA01487*/ 02622000
*   IF CTGDDNM=N THEN               /* DD NAME PROVIDED ?    @ZA01487*/ 02623000
         L     @10,CCACPL(,R11)                                    0754 02624000
         L     @10,CTGDDNM(,@10)                                   0754 02625000
         LTR   @10,@10                                             0754 02626000
         BNZ   @RF00754                                            0754 02627000
*     DO;                           /*                       @Y30SSPJ*/ 02628000
*                                                                  0755 02629000
*       /*************************************************************/ 02630000
*       /*                                                           */ 02631000
*       /* SET CCAMODID='BG', CCAREASN=RSN14, CCARETRN=RCINDER       */ 02632000
*       /*                                                           */ 02633000
*       /*************************************************************/ 02634000
*                                                                  0756 02635000
*       CCAPROB=IGGSEGID+(RSN14*K256)+RCINDER;/* NO-DD CARD REQUIRED    02636000
*                                      ERROR                 @Y30SSPJ*/ 02637000
         MVC   CCAPROB(4,R11),@CF04778                             0756 02638000
*Z086DLXT:                                                         0757 02639000
*       CALL IGGPDLXT;              /* ERROR EXIT            @Y30SSPJ*/ 02640000
Z086DLXT L     @15,@CV04531                                        0757 02641000
         BALR  @14,@15                                             0757 02642000
*     END;                          /*                       @Y30SSPJ*/ 02643000
*   ELSE                            /* YES-DDNAME SPECIFIED  @Y30SSPJ*/ 02644000
*     DO;                           /* CHECK IF DD STATEMENT EXISTS     02645000
*                                      IN TIOT               @ZA01487*/ 02646000
         B     @RC00754                                            0759 02647000
@RF00754 DS    0H                                                  0760 02648000
*       RFY                                                        0760 02649000
*         IDAVVOLL BASED(ADDR(DELVOLL));/*                   @ZA01487*/ 02650000
*       RFY                                                        0761 02651000
*         TIOT1 BASED(VVOLLTAB);    /*                       @ZA01487*/ 02652000
*       VVOLLTAB=CCATCB->TCBTIO;    /* POINT TO TIOT         @ZA01487*/ 02653000
         L     @10,CCACMSWA(,R11)                                  0762 02654000
         L     @05,CCATCB(,R11)                                    0762 02655000
         L     @05,TCBTIO(,@05)                                    0762 02656000
         ST    @05,VVOLLTAB+454(,@10)                              0762 02657000
*       DO WHILE(TIOEDDNM^=CTGDDNM->FIELDNME&TIOELNGH^=N);/* SEARCH     02658000
*                                      TIOT FOR DDNAME       @ZA01487*/ 02659000
         B     @DE00763                                            0763 02660000
@DL00763 DS    0H                                                  0764 02661000
*         VVOLLTAB=VVOLLTAB+TIOELNGH;/* NEXT TIOT ENTRY      @ZA01487*/ 02662000
         LA    @10,454                                             0764 02663000
         AL    @10,CCACMSWA(,R11)                                  0764 02664000
         L     @05,VVOLLTAB(,@10)                                  0764 02665000
         SLR   @15,@15                                             0764 02666000
         IC    @15,TIOELNGH(,@05)                                  0764 02667000
         ALR   @15,@05                                             0764 02668000
         ST    @15,VVOLLTAB(,@10)                                  0764 02669000
*       END;                        /*                       @ZA01487*/ 02670000
*                                                                  0765 02671000
@DE00763 L     @10,CCACMSWA(,R11)                                  0765 02672000
         L     @10,VVOLLTAB+454(,@10)                              0765 02673000
         L     @05,CCACPL(,R11)                                    0765 02674000
         L     @05,CTGDDNM(,@05)                                   0765 02675000
         CLC   TIOEDDNM(8,@10),FIELDNME(@05)                       0765 02676000
         BE    @DC00763                                            0765 02677000
         CLI   TIOELNGH(@10),0                                     0765 02678000
         BNE   @DL00763                                            0765 02679000
@DC00763 DS    0H                                                  0766 02680000
*       /*************************************************************/ 02681000
*       /*                                                           */ 02682000
*       /* CHECK FILE NAME WITH DDNAME IN TIOT               @Y30SSPJ*/ 02683000
*       /*                                                           */ 02684000
*       /*************************************************************/ 02685000
*                                                                  0766 02686000
*       IF TIOEDDNM=CTGDDNM->FIELDNME THEN                         0766 02687000
         L     @10,CCACMSWA(,R11)                                  0766 02688000
         L     @10,VVOLLTAB+454(,@10)                              0766 02689000
         L     @05,CCACPL(,R11)                                    0766 02690000
         L     @05,CTGDDNM(,@05)                                   0766 02691000
         CLC   TIOEDDNM(8,@10),FIELDNME(@05)                       0766 02692000
         BE    @RT00766                                            0766 02693000
*         ;                         /* DDNAME MATCH?         @ZA01487*/ 02694000
*       ELSE                        /* NO-NO DDNAME MATCH    @ZA01487*/ 02695000
*         DO;                       /*                       @Y30SSPJ*/ 02696000
*                                                                  0768 02697000
*           /*********************************************************/ 02698000
*           /*                                                       */ 02699000
*           /* SET CCAMODID='BG', CCAREASN=RSN22, CCARETRN=RCINDER   */ 02700000
*           /*                                                       */ 02701000
*           /*********************************************************/ 02702000
*                                                                  0769 02703000
*           CCAPROB=IGGSEGID+(RSN22*K256)+RCINDER;/* DD NOT MATCHING    02704000
*                                                            @Y30SSPJ*/ 02705000
         MVC   CCAPROB(4,R11),@CF04780                             0769 02706000
*Z088DLXT:                                                         0770 02707000
*           CALL IGGPDLXT;          /* ERROR EXIT            @Y30SSPJ*/ 02708000
Z088DLXT L     @15,@CV04531                                        0770 02709000
         BALR  @14,@15                                             0770 02710000
*         END;                      /*                       @Y30SSPJ*/ 02711000
*     END;                          /*                       @ZA01487*/ 02712000
@RT00766 DS    0H                                                  0773 02713000
*   CALL EXIT;                      /* RETURN TO CALLER              */ 02714000
@RC00754 BAL   @14,EXIT                                            0773 02715000
*   END;                            /* END OF INNER PROCEDURE        */ 02716000
@EL00006 DS    0H                                                  0774 02717000
@EF00006 DS    0H                                                  0774 02718000
@ER00006 BR    @14                                                 0774 02719000
@PB00006 DS    0H                                                  0775 02720000
*   GEN(EJECT);                     /* GO TO A NEW PRINT PAGE        */ 02721000
         EJECT                                                          02722000
*                                                                  0776 02723000
*/********************************************************************/ 02724000
*/*                                                                  */ 02725000
*/*         RETURN-TO-CALLER  PROCEDURE-EXITING  SUBFUNCTION         */ 02726000
*/*                                                                  */ 02727000
*/********************************************************************/ 02728000
*                                                                  0776 02729000
*EXIT:                                                             0776 02730000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* SPECIFY PROCEDURE OPTIONS     */ 02731000
         B     @PB00007                                            0776 02732000
EXIT     DS    0H                                                  0777 02733000
*   GEN(LM 12,14,0(13));            /* RESTORE REGISTERS OF CALLER   */ 02734000
         LM 12,14,0(13)                                                 02735000
*   GEN(MVI 12(13),255);            /* MARK END OF PDL               */ 02736000
         MVI 12(13),255                                                 02737000
*   GEN(BR 14);                     /* RETURN TO CALLER              */ 02738000
         BR 14                                                          02739000
*PATCH:                                                            0780 02740000
*   GEN(DC (12+((*+139-@MAINENT)/140))A(0));/* PATCH AREA            */ 02741000
PATCH    DC (12+((*+139-@MAINENT)/140))A(0)                             02742000
*   END;                            /* END OF EXIT PROCEDURE         */ 02743000
@EL00007 DS    0H                                                  0781 02744000
@EF00007 DS    0H                                                  0781 02745000
@ER00007 BR    @14                                                 0781 02746000
*   END                             /*                       @Y30SSPJ*/ 02747000
*                                                                  0782 02748000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02749000
*/*%INCLUDE SYSLIB  (IGGMCDCL)                                       */ 02750000
*/*%INCLUDE SYSLIB  (IGGMCTRC)                                       */ 02751000
*/*%INCLUDE SYSLIB  (IGGCCA  )                                       */ 02752000
*/*%INCLUDE SYSLIB  (IEZCTGPL)                                       */ 02753000
*/*%INCLUDE SYSLIB  (IEZCTGFL)                                       */ 02754000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 02755000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 02756000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 02757000
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */ 02758000
*/*%INCLUDE SYSLIB  (AMCBS   )                                       */ 02759000
*/*%INCLUDE SYSLIB  (IGGCAXWA)                                       */ 02760000
*/*%INCLUDE SYSLIB  (IEZCTGFV)                                       */ 02761000
*/*%INCLUDE SYSLIB  (IEZCTGWA)                                       */ 02762000
*/*%INCLUDE SYSLIB  (IEZCTGVL)                                       */ 02763000
*/*%INCLUDE SYSLIB  (IEZCTGCV)                                       */ 02764000
*/*%INCLUDE SYSLIB  (ICHACHKL)                                       */ 02765000
*/*%INCLUDE SYSLIB  (ICHRDDFL)                                       */ 02766000
*/*%INCLUDE SYSLIB  (IGGMCMDM)                                       */ 02767000
*/*%INCLUDE SYSLIB  (IGGMVEDC)                                       */ 02768000
*/*%INCLUDE SYSLIB  (IGGMGVO )                                       */ 02769000
*/*%INCLUDE SYSLIB  (IDAVVOLL)                                       */ 02770000
*/*%INCLUDE SYSLIB  (IDAAMBL )                                       */ 02771000
*/*%INCLUDE SYSLIB  (IDAAMB  )                                       */ 02772000
*/*%INCLUDE SYSLIB  (IDAAMDSB)                                       */ 02773000
*/*%INCLUDE SYSLIB  (IDAARDB )                                       */ 02774000
*/*%INCLUDE SYSLIB  (IDAPLH  )                                       */ 02775000
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                       */ 02776000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 02777000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 02778000
*/*%INCLUDE SYSLIB  (IGGMCMWA)                                       */ 02779000
*                                                                  0782 02780000
*       ;                                                          0782 02781000
@EL00001 DS    0H                                                  0782 02782000
@EF00001 DS    0H                                                  0782 02783000
@ER00001 BR    @14                                                 0782 02784000
@DATA    DS    0H                                                       02785000
@CH00072 DC    H'12'                                                    02786000
@CH00112 DC    H'24'                                                    02787000
@CH00138 DC    H'76'                                                    02788000
@DATD    DSECT                                                          02789000
         DS    0F                                                       02790000
@TF00001 DS    F                                                        02791000
IGG0CLBG CSECT                                                          02792000
         DS    0F                                                       02793000
@CF00037 DC    F'1'                                                     02794000
@CH00037 EQU   @CF00037+2                                               02795000
@CF00055 DC    F'2'                                                     02796000
@CH00055 EQU   @CF00055+2                                               02797000
@CF00058 DC    F'4'                                                     02798000
@CH00058 EQU   @CF00058+2                                               02799000
@CF00042 DC    F'8'                                                     02800000
@CF04547 DC    F'255'                                                   02801000
@CF04553 DC    F'16777215'                                              02802000
@CF04752 DC    F'-1027145644'                                           02803000
@CF04768 DC    F'-1027144644'                                           02804000
@CF04775 DC    F'-1027144520'                                           02805000
@CF04765 DC    F'-1027144184'                                           02806000
@CF04756 DC    F'-1027144008'                                           02807000
@CF04774 DC    F'-1027143120'                                           02808000
@CF04778 DC    F'-1027141904'                                           02809000
@CF04763 DC    F'-1027141392'                                           02810000
@CF04771 DC    F'-1027140880'                                           02811000
@CF04748 DC    F'-1027140048'                                           02812000
@CF04780 DC    F'-1027139856'                                           02813000
@CF04751 DC    F'-1027136272'                                           02814000
@CF04789 DC    XL4'0000FFFF'                                            02815000
@DATD    DSECT                                                          02816000
         DS    0D                                                       02817000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02818000
@ENDDATD EQU   *                                                        02819000
IGG0CLBG CSECT                                                          02820000
         DS    0F                                                       02821000
@SIZDATD DC    AL1(0)                                                   02822000
         DC    AL3(@ENDDATD-@DATD)                                      02823000
@CV04515 DC    V(IGGPDALL)                                              02824000
@CV04516 DC    V(IGGPDEMV)                                              02825000
@CV04517 DC    V(IGGPDUND)                                              02826000
@CV04518 DC    V(IGGPDUSC)                                              02827000
@CV04519 DC    V(IGGPDVMV)                                              02828000
@CV04520 DC    V(IGGPMCRA)                                              02829000
@CV04521 DC    V(IGGPERUG)                                              02830000
@CV04522 DC    V(IGGPEXT)                                               02831000
@CV04523 DC    V(IGGPGET)                                               02832000
@CV04524 DC    V(IGGPSMFS)                                              02833000
@CV04526 DC    V(IGGPDIAX)                                              02834000
@CV04527 DC    V(IGGPDEAX)                                              02835000
@CV04528 DC    V(IGGPDIPT)                                              02836000
@CV04529 DC    V(IGGPDEPT)                                              02837000
@CV04530 DC    V(IGGPDCLS)                                              02838000
@CV04531 DC    V(IGGPDLXT)                                              02839000
@CV04532 DC    V(IGGPDUPG)                                              02840000
@CV04533 DC    V(IGGPRPLF)                                              02841000
@CV04534 DC    V(IGGPRPLM)                                              02842000
@CV04514 DC    V(IGGPARFS)                                              02843000
@CV04525 DC    V(IGGPVMSC)                                              02844000
         DS    0D                                                       02845000
LUTEND   DC    XL2'FFFF'                                                02846000
@CC04681 DC    C'BG'                                                    02847000
CAXQN    DC    CL8'SYSZCAXW'                                            02848000
CAXRN    DC    CL8'CAXW'                                                02849000
NAMEDS   DC    CL8'NAMEDS  '                                            02850000
TYPE     DC    CL8'TYPE    '                                            02851000
QNAME    DC    CL8'SYSVSAM '                                            02852000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02853000
@01      EQU   01                                                       02854000
@02      EQU   02                                                       02855000
@03      EQU   03                                                       02856000
@04      EQU   04                                                       02857000
@05      EQU   05                                                       02858000
@06      EQU   06                                                       02859000
@07      EQU   07                                                       02860000
@08      EQU   08                                                       02861000
@09      EQU   09                                                       02862000
@10      EQU   10                                                       02863000
@11      EQU   11                                                       02864000
@12      EQU   12                                                       02865000
@13      EQU   13                                                       02866000
@14      EQU   14                                                       02867000
@15      EQU   15                                                       02868000
IGGSEGBR EQU   @12                                                      02869000
RWA      EQU   @02                                                      02870000
R0       EQU   @00                                                      02871000
R1       EQU   @01                                                      02872000
R2       EQU   @02                                                      02873000
R3       EQU   @03                                                      02874000
R4       EQU   @04                                                      02875000
R5       EQU   @05                                                      02876000
R6       EQU   @06                                                      02877000
R7       EQU   @07                                                      02878000
R8       EQU   @08                                                      02879000
R9       EQU   @09                                                      02880000
R10      EQU   @10                                                      02881000
R11      EQU   @11                                                      02882000
R12      EQU   @12                                                      02883000
R13      EQU   @13                                                      02884000
R14      EQU   @14                                                      02885000
R15      EQU   @15                                                      02886000
TIOTPTR  EQU   @01                                                      02887000
DCWABASE EQU   @04                                                      02888000
RET      EQU   @14                                                      02889000
RFLD     EQU   @04                                                      02890000
RGO      EQU   @15                                                      02891000
RNDX     EQU   @03                                                      02892000
RP0      EQU   @00                                                      02893000
RP1      EQU   @01                                                      02894000
RSAVE    EQU   @13                                                      02895000
RWK1     EQU   @06                                                      02896000
RWK2     EQU   @07                                                      02897000
RWK3     EQU   @08                                                      02898000
RWK4     EQU   @09                                                      02899000
RZERO    EQU   @00                                                      02900000
UCBDCPTR EQU   @01                                                      02901000
WKR2     EQU   @02                                                      02902000
WKR3     EQU   @03                                                      02903000
WKR4     EQU   @04                                                      02904000
CVTPTR   EQU   16                                                       02905000
PSA      EQU   0                                                        02906000
FLCRNPSW EQU   PSA                                                      02907000
FLCROPSW EQU   PSA+8                                                    02908000
FLCICCW2 EQU   PSA+16                                                   02909000
PSAEEPSW EQU   PSA+132                                                  02910000
PSAESPSW EQU   PSA+136                                                  02911000
FLCSVILC EQU   PSAESPSW+1                                               02912000
PSAEPPSW EQU   PSA+140                                                  02913000
FLCPIILC EQU   PSAEPPSW+1                                               02914000
FLCPICOD EQU   PSAEPPSW+2                                               02915000
PSAPICOD EQU   FLCPICOD+1                                               02916000
FLCTEA   EQU   PSAEPPSW+4                                               02917000
FLCPER   EQU   PSA+152                                                  02918000
FLCMCLA  EQU   PSA+168                                                  02919000
FLCIOEL  EQU   FLCMCLA+4                                                02920000
FLCIOA   EQU   FLCMCLA+16                                               02921000
FLCFSA   EQU   FLCMCLA+80                                               02922000
PSASUPER EQU   PSA+552                                                  02923000
PSASUP1  EQU   PSASUPER                                                 02924000
PSASUP2  EQU   PSASUPER+1                                               02925000
PSASUP3  EQU   PSASUPER+2                                               02926000
PSASUP4  EQU   PSASUPER+3                                               02927000
PSACLHT  EQU   PSA+640                                                  02928000
PSALKSA  EQU   PSA+696                                                  02929000
PSAHLHI  EQU   PSA+760                                                  02930000
PSADSSFL EQU   PSA+836                                                  02931000
PSADSSF1 EQU   PSADSSFL                                                 02932000
PSADSSF3 EQU   PSADSSFL+2                                               02933000
PSADSSF4 EQU   PSADSSFL+3                                               02934000
PSARSVT  EQU   PSA+896                                                  02935000
IGGCCA   EQU   0                                                        02936000
CCAPROB  EQU   IGGCCA+4                                                 02937000
CCAMODID EQU   CCAPROB                                                  02938000
CCAERRCD EQU   CCAPROB+2                                                02939000
CCAREASN EQU   CCAERRCD                                                 02940000
CCARETRN EQU   CCAERRCD+1                                               02941000
CCACD1   EQU   CCARETRN                                                 02942000
CCAFLG1  EQU   IGGCCA+14                                                02943000
CCAF1KEY EQU   CCAFLG1                                                  02944000
CCAF1KGE EQU   CCAFLG1                                                  02945000
CCAF1UP  EQU   CCAFLG1                                                  02946000
CCAFLG2  EQU   IGGCCA+15                                                02947000
CCAF2NVC EQU   CCAFLG2                                                  02948000
CCAF2COB EQU   CCAFLG2                                                  02949000
CCAFLG3  EQU   IGGCCA+16                                                02950000
CCAFLG4  EQU   IGGCCA+17                                                02951000
CCAFLG5  EQU   IGGCCA+18                                                02952000
CCAFLG6  EQU   IGGCCA+19                                                02953000
CCAREUSE EQU   CCAFLG6                                                  02954000
CCATCB   EQU   IGGCCA+20                                                02955000
CCARB    EQU   IGGCCA+24                                                02956000
CCACPL   EQU   IGGCCA+28                                                02957000
CCAACB   EQU   IGGCCA+32                                                02958000
CCAURAB  EQU   IGGCCA+40                                                02959000
CCASRCH  EQU   IGGCCA+44                                                02960000
CCASRID  EQU   CCASRCH                                                  02961000
CCASRCIN EQU   CCASRID                                                  02962000
CCARAB0  EQU   IGGCCA+88                                                02963000
CCAR0FLG EQU   CCARAB0                                                  02964000
CCAR0SEG EQU   CCARAB0+8                                                02965000
CCARAB1  EQU   IGGCCA+108                                               02966000
CCAR1FLG EQU   CCARAB1                                                  02967000
CCAR1SEG EQU   CCARAB1+8                                                02968000
CCARAB2  EQU   IGGCCA+128                                               02969000
CCAR2FLG EQU   CCARAB2                                                  02970000
CCAR2REC EQU   CCARAB2+4                                                02971000
CCAR2SEG EQU   CCARAB2+8                                                02972000
CCARAB3  EQU   IGGCCA+148                                               02973000
CCAR3FLG EQU   CCARAB3                                                  02974000
CCAR3SEG EQU   CCARAB3+8                                                02975000
CCARAB4  EQU   IGGCCA+168                                               02976000
CCAR4FLG EQU   CCARAB4                                                  02977000
CCAR4UR  EQU   CCAR4FLG                                                 02978000
CCAR4SEG EQU   CCARAB4+8                                                02979000
CCARAB5  EQU   IGGCCA+188                                               02980000
CCAR5FLG EQU   CCARAB5                                                  02981000
CCAR5UR  EQU   CCAR5FLG                                                 02982000
CCAR5REC EQU   CCARAB5+4                                                02983000
CCAR5SEG EQU   CCARAB5+8                                                02984000
CCATIQRN EQU   IGGCCA+212                                               02985000
CCADESA  EQU   IGGCCA+224                                               02986000
CCAEXTDE EQU   CCADESA+4                                                02987000
CCAEXTAD EQU   CCAEXTDE+2                                               02988000
CCAEQDQ  EQU   IGGCCA+280                                               02989000
CCAEDOPT EQU   CCAEQDQ+2                                                02990000
CCAMSSPL EQU   IGGCCA+300                                               02991000
CCACMS   EQU   IGGCCA+316                                               02992000
CCACMSWA EQU   CCACMS                                                   02993000
CCACPE5  EQU   IGGCCA+324                                               02994000
CCACPE6  EQU   IGGCCA+340                                               02995000
CCACPE61 EQU   IGGCCA+344                                               02996000
CCACPE7  EQU   IGGCCA+348                                               02997000
CCAFLPT  EQU   IGGCCA+364                                               02998000
CCADICT  EQU   IGGCCA+372                                               02999000
CCAXCPL  EQU   IGGCCA+376                                               03000000
CCARABB  EQU   IGGCCA+380                                               03001000
CCARABF  EQU   IGGCCA+384                                               03002000
CCARABL  EQU   IGGCCA+388                                               03003000
CCALREL  EQU   IGGCCA+396                                               03004000
CCASN    EQU   IGGCCA+398                                               03005000
CCARBA   EQU   IGGCCA+448                                               03006000
CCACRAVL EQU   CCARBA                                                   03007000
CCACRADT EQU   CCARBA+6                                                 03008000
CCATLNG  EQU   IGGCCA+468                                               03009000
CCAIDPT3 EQU   IGGCCA+480                                               03010000
CCAGRGC  EQU   IGGCCA+493                                               03011000
CCAGRHI  EQU   IGGCCA+494                                               03012000
CCASSEQ  EQU   CCAGRHI                                                  03013000
CCAALPTR EQU   IGGCCA+540                                               03014000
CCAFLG7  EQU   IGGCCA+552                                               03015000
CCAFLG8  EQU   IGGCCA+553                                               03016000
CCAFLG9  EQU   IGGCCA+554                                               03017000
CCASMFLG EQU   IGGCCA+562                                               03018000
CCASMFG1 EQU   CCASMFLG                                                 03019000
CCASMFUC EQU   CCASMFG1                                                 03020000
CCASMFSR EQU   CCASMFG1                                                 03021000
CCABMINP EQU   IGGCCA+684                                               03022000
CCABMFLG EQU   CCABMINP+6                                               03023000
CCABMOUT EQU   IGGCCA+692                                               03024000
CCABMOFG EQU   CCABMOUT+4                                               03025000
CCATEMPS EQU   IGGCCA+744                                               03026000
CCAMNCAT EQU   IGGCCA+784                                               03027000
CCAMNAT  EQU   CCAMNCAT                                                 03028000
MNATTOP  EQU   CCAMNAT                                                  03029000
MNATFLGS EQU   CCAMNAT+240                                              03030000
CCAARFWA EQU   IGGCCA+1040                                              03031000
ARFGMLEN EQU   CCAARFWA                                                 03032000
CCARVFG1 EQU   IGGCCA+1056                                              03033000
CCAFLG11 EQU   IGGCCA+1059                                              03034000
CCAREGS  EQU   IGGCCA+1060                                              03035000
CCABZSAV EQU   IGGCCA+1408                                              03036000
CCACUMPL EQU   IGGCCA+1412                                              03037000
CCARALSA EQU   IGGCCA+1440                                              03038000
CCAFLG10 EQU   IGGCCA+1444                                              03039000
CCASMFP  EQU   IGGCCA+1480                                              03040000
CCAPROBX EQU   IGGCCA+1484                                              03041000
CCAERCDX EQU   CCAPROBX+2                                               03042000
CCADGDGA EQU   IGGCCA+1488                                              03043000
CCAREQDQ EQU   IGGCCA+1492                                              03044000
CCAREDOP EQU   CCAREQDQ+2                                               03045000
CTGPL    EQU   0                                                        03046000
CTGOPTN1 EQU   CTGPL                                                    03047000
CTGOPTN2 EQU   CTGPL+1                                                  03048000
CTGEXT   EQU   CTGOPTN2                                                 03049000
CTGNSVS  EQU   CTGEXT                                                   03050000
CTGERASE EQU   CTGOPTN2                                                 03051000
CTGSMF   EQU   CTGERASE                                                 03052000
CTGREL   EQU   CTGSMF                                                   03053000
CTGPURG  EQU   CTGOPTN2                                                 03054000
CTGVMNT  EQU   CTGPURG                                                  03055000
CTGRCATN EQU   CTGVMNT                                                  03056000
CTGOVRID EQU   CTGOPTN2                                                 03057000
CTGSCR   EQU   CTGOPTN2                                                 03058000
CTGOPTN3 EQU   CTGPL+2                                                  03059000
CTGOPTN4 EQU   CTGPL+3                                                  03060000
CTGENT   EQU   CTGPL+4                                                  03061000
CTGFVT   EQU   CTGENT                                                   03062000
CTGCAT   EQU   CTGPL+8                                                  03063000
CTGCVOL  EQU   CTGCAT                                                   03064000
CTGWKA   EQU   CTGPL+12                                                 03065000
CTGDSORG EQU   CTGPL+16                                                 03066000
CTGOPTNS EQU   CTGDSORG                                                 03067000
CTGTYPE  EQU   CTGPL+18                                                 03068000
CTGNOFLD EQU   CTGPL+19                                                 03069000
CTGDDNM  EQU   CTGPL+20                                                 03070000
CTGNEWNM EQU   CTGDDNM                                                  03071000
CTGFBFLG EQU   CTGNEWNM+2                                               03072000
CTGJSCB  EQU   CTGPL+24                                                 03073000
CTGPSWD  EQU   CTGJSCB                                                  03074000
CTGFIELD EQU   CTGPL+28                                                 03075000
CTGFL    EQU   0                                                        03076000
CTGFLDNO EQU   CTGFL                                                    03077000
CTGFLDCD EQU   CTGFL+1                                                  03078000
CTGFLDGC EQU   CTGFL+2                                                  03079000
CTGFLDRE EQU   CTGFL+3                                                  03080000
CTGFLDWA EQU   CTGFL+4                                                  03081000
CTGFLDNM EQU   CTGFL+8                                                  03082000
CTGFLCHN EQU   CTGFL+12                                                 03083000
CTGFLDAT EQU   CTGFL+16                                                 03084000
CTGFLNG  EQU   CTGFLDAT                                                 03085000
CTGFLPT  EQU   CTGFLDAT+4                                               03086000
USERWKA  EQU   0                                                        03087000
WKALEN2  EQU   USERWKA+2                                                03088000
WKA      EQU   USERWKA+4                                                03089000
ENTNAMES EQU   WKA                                                      03090000
ENTNAMET EQU   ENTNAMES                                                 03091000
ENTNAMEV EQU   ENTNAMES+1                                               03092000
FIELDNM  EQU   0                                                        03093000
DICTENT  EQU   0                                                        03094000
DICTFLGS EQU   DICTENT                                                  03095000
DIC2ENT  EQU   0                                                        03096000
DIC2FLGS EQU   DIC2ENT                                                  03097000
CCARAB   EQU   0                                                        03098000
CCARABFL EQU   CCARAB                                                   03099000
CCACPE1  EQU   CCARAB+4                                                 03100000
CCACPE2  EQU   CCARAB+8                                                 03101000
CATGOPT  EQU   0                                                        03102000
CATGOCI  EQU   CATGOPT                                                  03103000
CATGOFLG EQU   CATGOCI                                                  03104000
CATGOGC1 EQU   CATGOPT+3                                                03105000
CATGOSEQ EQU   CATGOPT+4                                                03106000
CATRCD   EQU   0                                                        03107000
RCDCINO  EQU   CATRCD+1                                                 03108000
RCDSECF  EQU   CATRCD+26                                                03109000
RCDID    EQU   CATRCD+44                                                03110000
NREPLF   EQU   CATRCD+48                                                03111000
REPCNTRL EQU   0                                                        03112000
EXTRCDPT EQU   REPCNTRL                                                 03113000
VARFIELD EQU   0                                                        03114000
CNTRLINF EQU   0                                                        03115000
LENFIX   EQU   CNTRLINF+1                                               03116000
CVTMAP   EQU   0                                                        03117000
CVTTCBP  EQU   CVTMAP                                                   03118000
CVTILK2  EQU   CVTMAP+40                                                03119000
CVTDATE  EQU   CVTMAP+56                                                03120000
CVTDAR   EQU   CVTMAP+72                                                03121000
CVTFLGS1 EQU   CVTDAR                                                   03122000
CVTDCB   EQU   CVTMAP+116                                               03123000
CVTIOQET EQU   CVTMAP+120                                               03124000
CVTIERLC EQU   CVTMAP+144                                               03125000
CVTHEAD  EQU   CVTMAP+160                                               03126000
CVTSV76C EQU   CVTHEAD                                                  03127000
CVTOPTA  EQU   CVTMAP+182                                               03128000
CVTOPTB  EQU   CVTMAP+183                                               03129000
CVTGTF   EQU   CVTMAP+236                                               03130000
CVTGTFST EQU   CVTGTF                                                   03131000
CVTGTFS  EQU   CVTGTFST                                                 03132000
CVTSTATE EQU   CVTGTFST                                                 03133000
CVTTMODE EQU   CVTGTFST                                                 03134000
CVTFORM  EQU   CVTGTFST                                                 03135000
CVTAQAVT EQU   CVTMAP+240                                               03136000
CVTTCMFG EQU   CVTAQAVT                                                 03137000
CVTVOLM2 EQU   CVTMAP+244                                               03138000
CVTTATA  EQU   CVTVOLM2                                                 03139000
CVTTSKS  EQU   CVTTATA                                                  03140000
CVTVOLF2 EQU   CVTTSKS                                                  03141000
CVTTAT   EQU   CVTTATA+1                                                03142000
CVTATER  EQU   CVTMAP+248                                               03143000
CVTEXT1  EQU   CVTMAP+252                                               03144000
CVTCBSP  EQU   CVTMAP+256                                               03145000
CVTPURG  EQU   CVTMAP+260                                               03146000
CVTAMFF  EQU   CVTMAP+264                                               03147000
CVTQMSG  EQU   CVTMAP+268                                               03148000
CVTDMSR  EQU   CVTMAP+272                                               03149000
CVTRSV37 EQU   CVTDMSR                                                  03150000
CVTDMSRF EQU   CVTRSV37                                                 03151000
CVTERPV  EQU   CVTMAP+316                                               03152000
CVTINTLA EQU   CVTMAP+320                                               03153000
CVTAPF   EQU   CVTMAP+324                                               03154000
CVTEXT2  EQU   CVTMAP+328                                               03155000
CVTHJES  EQU   CVTMAP+332                                               03156000
CVTPGSIA EQU   CVTMAP+348                                               03157000
CVTA1F1  EQU   CVTMAP+356                                               03158000
CVTSYSK  EQU   CVTMAP+357                                               03159000
CVTVOLM1 EQU   CVTMAP+380                                               03160000
CVTVOLF1 EQU   CVTVOLM1                                                 03161000
CVTATMCT EQU   CVTMAP+388                                               03162000
CVTXTNT1 EQU   0                                                        03163000
CVTXTNT2 EQU   0                                                        03164000
CVTDSSV  EQU   CVTXTNT2                                                 03165000
CVTFLGBT EQU   CVTXTNT2+5                                               03166000
CVTQID   EQU   CVTXTNT2+24                                              03167000
CVTRV400 EQU   CVTXTNT2+52                                              03168000
CVTRV409 EQU   CVTXTNT2+53                                              03169000
CVTATCVT EQU   CVTXTNT2+64                                              03170000
CVTRV429 EQU   CVTXTNT2+84                                              03171000
CVTRV438 EQU   CVTXTNT2+85                                              03172000
CVTRV457 EQU   CVTXTNT2+112                                             03173000
CVTRV466 EQU   CVTXTNT2+113                                             03174000
CVTFIX   EQU   0                                                        03175000
CVTRELNO EQU   CVTFIX+252                                               03176000
TCBWORDS EQU   0                                                        03177000
TCBPTR   EQU   TCBWORDS+4                                               03178000
TCBFIX   EQU   0                                                        03179000
TCBFRS   EQU   TCBFIX                                                   03180000
TCB      EQU   0                                                        03181000
TCBPIE   EQU   TCB+4                                                    03182000
TCBPMASK EQU   TCBPIE                                                   03183000
TCBTIO   EQU   TCB+12                                                   03184000
TCBCMP   EQU   TCB+16                                                   03185000
TCBCMPF  EQU   TCBCMP                                                   03186000
TCBCPP   EQU   TCBCMPF                                                  03187000
TCBSTCC  EQU   TCBCMPF                                                  03188000
TCBCDBL  EQU   TCBCMPF                                                  03189000
TCBCWTO  EQU   TCBCMPF                                                  03190000
TCBCIND  EQU   TCBCMPF                                                  03191000
TCBCMSG  EQU   TCBCMPF                                                  03192000
TCBTRN   EQU   TCB+20                                                   03193000
TCBABF   EQU   TCBTRN                                                   03194000
TCBMSS   EQU   TCB+24                                                   03195000
TCBPKF   EQU   TCB+28                                                   03196000
TCBFLGS  EQU   TCB+29                                                   03197000
TCBFLGS1 EQU   TCBFLGS                                                  03198000
TCBFLGS2 EQU   TCBFLGS+1                                                03199000
TCBFLGS3 EQU   TCBFLGS+2                                                03200000
TCBFLGS4 EQU   TCBFLGS+3                                                03201000
TCBFLGS5 EQU   TCBFLGS+4                                                03202000
TCBABWF  EQU   TCBFLGS5                                                 03203000
TCBJPQ   EQU   TCB+44                                                   03204000
TCBPURGE EQU   TCBJPQ                                                   03205000
TCBGRS   EQU   TCB+48                                                   03206000
TCBFSA   EQU   TCB+112                                                  03207000
TCBTME   EQU   TCB+120                                                  03208000
TCBJSTCB EQU   TCB+124                                                  03209000
TCBTSFLG EQU   TCB+148                                                  03210000
TCBTSTSK EQU   TCBTSFLG                                                 03211000
TCBSTAB  EQU   TCB+160                                                  03212000
TCBNSTAE EQU   TCBSTAB                                                  03213000
TCBTCT   EQU   TCB+164                                                  03214000
TCBTCTGF EQU   TCBTCT                                                   03215000
TCBSCNDY EQU   TCB+172                                                  03216000
TCBNDSP  EQU   TCBSCNDY                                                 03217000
TCBNDSP1 EQU   TCBNDSP+1                                                03218000
TCBNDSP2 EQU   TCBNDSP+2                                                03219000
TCBNDSP3 EQU   TCBNDSP+3                                                03220000
TCBJSCB  EQU   TCB+180                                                  03221000
TCBRECDE EQU   TCBJSCB                                                  03222000
TCBEXT1  EQU   TCB+196                                                  03223000
TCBBITS  EQU   TCB+200                                                  03224000
TCBNDSP4 EQU   TCBBITS                                                  03225000
TCBNDSP5 EQU   TCBBITS+1                                                03226000
TCBFLGS6 EQU   TCBBITS+2                                                03227000
TCBFLGS7 EQU   TCBBITS+3                                                03228000
TCBDAR   EQU   TCB+204                                                  03229000
TCBDARC  EQU   TCBDAR                                                   03230000
TCBEXT2  EQU   TCB+208                                                  03231000
TCBXSCT  EQU   TCB+240                                                  03232000
TCBXSCT1 EQU   TCBXSCT                                                  03233000
TCBFOE   EQU   TCB+244                                                  03234000
TCBSTAWA EQU   TCB+252                                                  03235000
TCBESTAE EQU   TCB+264                                                  03236000
TCBESTRM EQU   TCBESTAE+1                                               03237000
TCBFBYT1 EQU   TCB+276                                                  03238000
TCBFBYT2 EQU   TCB+277                                                  03239000
TCBRV124 EQU   TCB+278                                                  03240000
TCBRV133 EQU   TCB+279                                                  03241000
TCBXTNT2 EQU   0                                                        03242000
TCBGTF   EQU   TCBXTNT2                                                 03243000
TCBTFLG  EQU   TCBGTF                                                   03244000
TCBRV146 EQU   TCBXTNT2+28                                              03245000
TCBRV155 EQU   TCBXTNT2+29                                              03246000
TCBRV164 EQU   TCBXTNT2+30                                              03247000
TCBRV173 EQU   TCBXTNT2+31                                              03248000
IFGACB   EQU   0                                                        03249000
ACBCOMN  EQU   IFGACB                                                   03250000
ACBID    EQU   ACBCOMN                                                  03251000
ACBLENG  EQU   ACBCOMN+2                                                03252000
ACBLENG2 EQU   ACBLENG                                                  03253000
ACBAMBL  EQU   ACBCOMN+4                                                03254000
ACBJWA   EQU   ACBAMBL                                                  03255000
ACBINRTN EQU   ACBCOMN+8                                                03256000
ACBMACRF EQU   ACBCOMN+12                                               03257000
ACBMACR1 EQU   ACBMACRF                                                 03258000
ACBADR   EQU   ACBMACR1                                                 03259000
ACBCNV   EQU   ACBMACR1                                                 03260000
ACBSEQ   EQU   ACBMACR1                                                 03261000
ACBIN    EQU   ACBMACR1                                                 03262000
ACBOUT   EQU   ACBMACR1                                                 03263000
ACBMACR2 EQU   ACBMACRF+1                                               03264000
ACBSTRNO EQU   ACBCOMN+15                                               03265000
ACBBUFND EQU   ACBCOMN+16                                               03266000
ACBBUFNI EQU   ACBCOMN+18                                               03267000
ACBBUFPL EQU   ACBCOMN+20                                               03268000
ACBMACR3 EQU   ACBBUFPL                                                 03269000
ACBRECFM EQU   ACBCOMN+24                                               03270000
ACBCCTYP EQU   ACBCOMN+25                                               03271000
ACBOPT   EQU   ACBCOMN+26                                               03272000
ACBDSORG EQU   ACBOPT                                                   03273000
ACBCROPS EQU   ACBDSORG                                                 03274000
ACBDVIND EQU   ACBDSORG                                                 03275000
ACBDORGA EQU   ACBDSORG+1                                               03276000
ACBPASSW EQU   ACBCOMN+32                                               03277000
ACBEXLST EQU   ACBCOMN+36                                               03278000
ACBDDNM  EQU   ACBCOMN+40                                               03279000
ACBAMETH EQU   ACBDDNM+3                                                03280000
ACBOFLGS EQU   ACBCOMN+48                                               03281000
ACBOPEN  EQU   ACBOFLGS                                                 03282000
ACBEXFG  EQU   ACBOFLGS                                                 03283000
ACBIOSFG EQU   ACBOFLGS                                                 03284000
ACBINFLG EQU   ACBCOMN+50                                               03285000
ACBINFL1 EQU   ACBINFLG                                                 03286000
ACBVVIC  EQU   ACBINFL1                                                 03287000
ACBINFL2 EQU   ACBINFLG+1                                               03288000
ACBUJFCB EQU   ACBCOMN+52                                               03289000
ACBBLKSZ EQU   ACBCOMN+60                                               03290000
ACBUAPTR EQU   ACBCOMN+64                                               03291000
AMCBS    EQU   0                                                        03292000
CBSCMP   EQU   AMCBS+16                                                 03293000
CBSCAXCN EQU   AMCBS+20                                                 03294000
CBSVSRT  EQU   AMCBS+32                                                 03295000
NOBASE   EQU   0                                                        03296000
IGGCAXWA EQU   0                                                        03297000
CAXCHN   EQU   IGGCAXWA+4                                               03298000
CAXFLGS  EQU   IGGCAXWA+8                                               03299000
CAXMCT   EQU   CAXFLGS                                                  03300000
CAXSCR   EQU   CAXFLGS                                                  03301000
CAXFLG2  EQU   IGGCAXWA+9                                               03302000
CAXF2REC EQU   CAXFLG2                                                  03303000
CAXFLG3  EQU   IGGCAXWA+10                                              03304000
CAXCCR   EQU   IGGCAXWA+32                                              03305000
CAXCNAM  EQU   IGGCAXWA+52                                              03306000
CAXOPLST EQU   IGGCAXWA+96                                              03307000
COPTS    EQU   CAXOPLST                                                 03308000
COPACB   EQU   CAXOPLST+1                                               03309000
CAXCCA   EQU   IGGCAXWA+104                                             03310000
CAXECB   EQU   IGGCAXWA+120                                             03311000
CAXECBHB EQU   CAXECB                                                   03312000
CAXHRPLW EQU   IGGCAXWA+128                                             03313000
CTGFV    EQU   0                                                        03314000
CTGFVPRO EQU   CTGFV+1                                                  03315000
CTGFVSPC EQU   CTGFV+52                                                 03316000
CTGFVAMD EQU   CTGFV+56                                                 03317000
CTGFVLMT EQU   CTGFV+72                                                 03318000
CTGFVGAT EQU   CTGFV+76                                                 03319000
CTGFVPWD EQU   CTGFV+84                                                 03320000
CTGWA    EQU   0                                                        03321000
CTGWAVL  EQU   CTGWA                                                    03322000
CTGVL    EQU   0                                                        03323000
CTGVLX   EQU   0                                                        03324000
CTGCV    EQU   0                                                        03325000
CTGCVDSN EQU   CTGCV+6                                                  03326000
ACHKLIST EQU   0                                                        03327000
ACHKINSW EQU   ACHKLIST                                                 03328000
ACHKENTW EQU   ACHKLIST+4                                               03329000
ACHKFLG1 EQU   ACHKENTW                                                 03330000
ACHKENT  EQU   ACHKENTW+1                                               03331000
ACHKCLNW EQU   ACHKLIST+8                                               03332000
ACHKFLG2 EQU   ACHKCLNW                                                 03333000
ACHKVOLW EQU   ACHKLIST+12                                              03334000
ACHKFLG3 EQU   ACHKVOLW                                                 03335000
RDDFLIST EQU   0                                                        03336000
RDDFINSW EQU   RDDFLIST                                                 03337000
RDDFENTW EQU   RDDFLIST+4                                               03338000
RDDFFLGS EQU   RDDFENTW                                                 03339000
RDDFOVOL EQU   RDDFLIST+8                                               03340000
MWA      EQU   0                                                        03341000
VLST     EQU   MWA+2                                                    03342000
CVOLIND  EQU   MWA+252                                                  03343000
ASGO     EQU   1                                                        03344000
PASSGO   EQU   1                                                        03345000
PASSWORD EQU   PASSGO                                                   03346000
USERAREC EQU   PASSGO+50                                                03347000
USERLIST EQU   0                                                        03348000
LTENTRY  EQU   USERLIST+2                                               03349000
LTRETCOD EQU   LTENTRY                                                  03350000
SPACEPRM EQU   0                                                        03351000
SPCOPTNS EQU   SPACEPRM+6                                               03352000
CTGDSATR EQU   0                                                        03353000
CTGATR1  EQU   CTGDSATR                                                 03354000
CTGATR2  EQU   CTGDSATR+1                                               03355000
RGATTRFL EQU   0                                                        03356000
RGATTR1  EQU   RGATTRFL                                                 03357000
RGATTSG1 EQU   RGATTRFL+1                                               03358000
DEVCHARS EQU   0                                                        03359000
RTDEVUCB EQU   DEVCHARS                                                 03360000
RTBOKAB  EQU   DEVCHARS+14                                              03361000
RTDVFLGS EQU   DEVCHARS+17                                              03362000
CTVOLRCD EQU   1                                                        03363000
CTVDVCHR EQU   CTVOLRCD+52                                              03364000
CTVBOKAB EQU   CTVDVCHR+14                                              03365000
CTVDVFLG EQU   CTVDVCHR+17                                              03366000
CTVSPHDR EQU   0                                                        03367000
CTVSPFLG EQU   CTVSPHDR+15                                              03368000
CTVDESGP EQU   0                                                        03369000
CTVEXTST EQU   CTVDESGP+4                                               03370000
CTVSTDES EQU   CTVEXTST                                                 03371000
CTVDSGRP EQU   0                                                        03372000
CTVDSDFL EQU   CTVDSGRP+6                                               03373000
CTVDSDIR EQU   CTVDSGRP+9                                               03374000
CTVGOPT  EQU   0                                                        03375000
CTVGOCI  EQU   CTVGOPT                                                  03376000
CTVGOGCI EQU   CTVGOPT+3                                                03377000
CTVRCTRL EQU   0                                                        03378000
CTVEXRPT EQU   CTVRCTRL                                                 03379000
CTVSPMAP EQU   0                                                        03380000
CTVSMSN  EQU   CTVSPMAP                                                 03381000
CTVDSPAC EQU   0                                                        03382000
CTVDSPSN EQU   CTVDSPAC                                                 03383000
CTVDSPFG EQU   CTVDSPAC+15                                              03384000
CTVSPEXT EQU   CTVDSPAC+21                                              03385000
CTVEXTNT EQU   CTVSPEXT                                                 03386000
CTVDIR   EQU   0                                                        03387000
CTVDSDSN EQU   CTVDIR                                                   03388000
CTVDEXTN EQU   0                                                        03389000
GVO      EQU   0                                                        03390000
CMFLDEVT EQU   GVO                                                      03391000
CMFLVOL  EQU   GVO+4                                                    03392000
CMFLVLFL EQU   GVO+12                                                   03393000
CMFLITEX EQU   GVO+34                                                   03394000
CMFOVERL EQU   GVO+37                                                   03395000
CMFOVLAY EQU   0                                                        03396000
CMFXECTS EQU   0                                                        03397000
CMFXEXST EQU   CMFXECTS+2                                               03398000
CMFXSTA  EQU   CMFXEXST                                                 03399000
CMFXEXED EQU   CMFXECTS+6                                               03400000
CMFXEDA  EQU   CMFXEXED                                                 03401000
IDAVVOLL EQU   0                                                        03402000
@NM00138 EQU   IDAVVOLL                                                 03403000
VVOLLTAB EQU   IDAVVOLL+4                                               03404000
VVOLLERR EQU   IDAVVOLL+12                                              03405000
VVOLLENT EQU   IDAVVOLL+36                                              03406000
@NM00141 EQU   VVOLLENT+4                                               03407000
IDAAMBL  EQU   0                                                        03408000
AMBLEOV  EQU   IDAAMBL+12                                               03409000
AMBLEFLG EQU   AMBLEOV                                                  03410000
AMBLDDNM EQU   IDAAMBL+16                                               03411000
AMBLIDF  EQU   AMBLDDNM                                                 03412000
AMBLQ    EQU   AMBLIDF+7                                                03413000
AMBLVC   EQU   IDAAMBL+28                                               03414000
AMBLTYPE EQU   IDAAMBL+30                                               03415000
AMBLQ2   EQU   IDAAMBL+31                                               03416000
AMBLSHAR EQU   IDAAMBL+33                                               03417000
AMBLFLG1 EQU   IDAAMBL+35                                               03418000
AMBLVVIC EQU   AMBLFLG1                                                 03419000
AMBLFLG2 EQU   IDAAMBL+36                                               03420000
AMBLDTA  EQU   IDAAMBL+52                                               03421000
IDAAMB   EQU   0                                                        03422000
AMBPH    EQU   IDAAMB+12                                                03423000
AMBCACB  EQU   IDAAMB+16                                                03424000
AMBDSB   EQU   IDAAMB+20                                                03425000
AMBEOVR  EQU   IDAAMB+24                                                03426000
AMBFLG0  EQU   AMBEOVR                                                  03427000
AMBFLG1  EQU   IDAAMB+25                                                03428000
AMBDSORG EQU   IDAAMB+26                                                03429000
AMBIOBAD EQU   IDAAMB+28                                                03430000
AMBDDSN  EQU   IDAAMB+35                                                03431000
AMBINFL  EQU   IDAAMB+42                                                03432000
AMBDEBPT EQU   IDAAMB+44                                                03433000
AMBOFLGS EQU   IDAAMB+48                                                03434000
AMBFLG2  EQU   IDAAMB+49                                                03435000
AMBEOVPT EQU   IDAAMB+56                                                03436000
AMBCSWD1 EQU   IDAAMB+84                                                03437000
AMBAFLG  EQU   AMBCSWD1                                                 03438000
IDAAMDSB EQU   0                                                        03439000
AMDATTR  EQU   IDAAMDSB+1                                               03440000
AMDNEST  EQU   IDAAMDSB+4                                               03441000
AMDCIPCA EQU   IDAAMDSB+12                                              03442000
AMDCINV  EQU   IDAAMDSB+20                                              03443000
AMDHLRBA EQU   IDAAMDSB+28                                              03444000
AMDSSRBA EQU   IDAAMDSB+32                                              03445000
AMDPARDB EQU   IDAAMDSB+36                                              03446000
AMDATTR3 EQU   IDAAMDSB+40                                              03447000
AMDSTAT  EQU   IDAAMDSB+48                                              03448000
IDAARDB  EQU   0                                                        03449000
ARDTYPE  EQU   IDAARDB+1                                                03450000
ARDEOD   EQU   ARDTYPE                                                  03451000
ARDNPTR  EQU   IDAARDB+4                                                03452000
ARDHRBA  EQU   IDAARDB+12                                               03453000
ARDERBA  EQU   IDAARDB+16                                               03454000
ARDPRF   EQU   IDAARDB+28                                               03455000
IDAPLHDR EQU   0                                                        03456000
IDAPLH   EQU   0                                                        03457000
PLHFLG1  EQU   IDAPLH+2                                                 03458000
PLHFLG2  EQU   IDAPLH+3                                                 03459000
PLHEFLGS EQU   IDAPLH+4                                                 03460000
PLHFLG3  EQU   IDAPLH+6                                                 03461000
PLHAFLGS EQU   IDAPLH+7                                                 03462000
PLHCRBA  EQU   IDAPLH+28                                                03463000
PLHJORBA EQU   PLHCRBA                                                  03464000
PLHJCODE EQU   IDAPLH+40                                                03465000
PLHARDB  EQU   IDAPLH+44                                                03466000
PLHDIOB  EQU   IDAPLH+76                                                03467000
PLHRETO  EQU   IDAPLH+116                                               03468000
PLHRET1  EQU   IDAPLH+120                                               03469000
PLHEOVPT EQU   IDAPLH+180                                               03470000
PLHIXSPL EQU   IDAPLH+200                                               03471000
PLHSSRBA EQU   PLHIXSPL                                                 03472000
PLHWAX   EQU   IDAPLH+232                                               03473000
PLHKEYPT EQU   IDAPLH+248                                               03474000
PLHEND   EQU   IDAPLH+280                                               03475000
TIOT1    EQU   0                                                        03476000
IFGRPL   EQU   0                                                        03477000
RPLCOMN  EQU   IFGRPL                                                   03478000
RPLIDWD  EQU   RPLCOMN                                                  03479000
RPLLEN   EQU   RPLIDWD+3                                                03480000
RPLECB   EQU   RPLCOMN+8                                                03481000
RPLFDBWD EQU   RPLCOMN+12                                               03482000
RPLFDBK  EQU   RPLFDBWD+1                                               03483000
RPLRTNCD EQU   RPLFDBK                                                  03484000
RPLCNDCD EQU   RPLFDBK+1                                                03485000
RPLCMPON EQU   RPLCNDCD                                                 03486000
RPLFDB2  EQU   RPLCMPON                                                 03487000
RPLERRCD EQU   RPLCNDCD+1                                               03488000
RPLFDB3  EQU   RPLERRCD                                                 03489000
RPLKEYLE EQU   RPLCOMN+16                                               03490000
RPLDACB  EQU   RPLCOMN+24                                               03491000
RPLARG   EQU   RPLCOMN+36                                               03492000
RPLOPTCD EQU   RPLCOMN+40                                               03493000
RPLOPT1  EQU   RPLOPTCD                                                 03494000
RPLECBSW EQU   RPLOPT1                                                  03495000
RPLOPT2  EQU   RPLOPTCD+1                                               03496000
RPLADR   EQU   RPLOPT2                                                  03497000
RPLOPT3  EQU   RPLOPTCD+2                                               03498000
RPLOPT4  EQU   RPLOPTCD+3                                               03499000
RPLNXTRP EQU   RPLCOMN+44                                               03500000
RPLOPTC2 EQU   RPLCOMN+56                                               03501000
RPLOPT5  EQU   RPLOPTC2                                                 03502000
RPLWRTYP EQU   RPLOPT5                                                  03503000
RPLOPT6  EQU   RPLOPTC2+1                                               03504000
RPLUNTYP EQU   RPLOPT6                                                  03505000
RPLOPT7  EQU   RPLOPTC2+2                                               03506000
RPLCNOPT EQU   RPLOPT7                                                  03507000
RPLOPT8  EQU   RPLOPTC2+3                                               03508000
RPLRBAR  EQU   RPLCOMN+60                                               03509000
RPLAIXID EQU   RPLRBAR+2                                                03510000
RPLDDDD  EQU   RPLRBAR+4                                                03511000
RPLEXTDS EQU   RPLCOMN+68                                               03512000
RPLEXTD1 EQU   RPLEXTDS                                                 03513000
UCB      EQU   0                                                        03514000
UCBOB    EQU   0                                                        03515000
UCBJBNR  EQU   UCBOB                                                    03516000
UCBFL5   EQU   UCBOB+1                                                  03517000
UCBAF    EQU   UCBFL5                                                   03518000
UCBSTAT  EQU   UCBOB+3                                                  03519000
UCBCHAN  EQU   UCBOB+4                                                  03520000
UCBSFLS  EQU   UCBOB+6                                                  03521000
UCBFLA   EQU   UCBSFLS                                                  03522000
UCBFL1   EQU   UCBFLA                                                   03523000
UCBBSY   EQU   UCBFL1                                                   03524000
UCBNRY   EQU   UCBFL1                                                   03525000
UCBPST   EQU   UCBFL1                                                   03526000
UCBCUB   EQU   UCBFL1                                                   03527000
UCBFLB   EQU   UCBSFLS+1                                                03528000
UCBCHM   EQU   UCBOB+8                                                  03529000
UCBCHM1  EQU   UCBCHM                                                   03530000
UCBPTH0  EQU   UCBCHM1                                                  03531000
UCBPTH1  EQU   UCBCHM1                                                  03532000
UCBWGT   EQU   UCBOB+12                                                 03533000
UCBTYP   EQU   UCBOB+16                                                 03534000
UCBTBYT1 EQU   UCBTYP                                                   03535000
UCB1FEA5 EQU   UCBTBYT1                                                 03536000
UCB1FEA6 EQU   UCBTBYT1                                                 03537000
UCBTBYT2 EQU   UCBTYP+1                                                 03538000
UCB2OPT2 EQU   UCBTBYT2                                                 03539000
UCBDUDN1 EQU   UCB2OPT2                                                 03540000
UCB2OPT3 EQU   UCBTBYT2                                                 03541000
UCBDUDN2 EQU   UCB2OPT3                                                 03542000
UCB2OPT4 EQU   UCBTBYT2                                                 03543000
UCBRWTAU EQU   UCB2OPT4                                                 03544000
UCB2OPT6 EQU   UCBTBYT2                                                 03545000
UCB2OPT7 EQU   UCBTBYT2                                                 03546000
UCBTBYT3 EQU   UCBTYP+2                                                 03547000
UCBDVCLS EQU   UCBTBYT3                                                 03548000
UCB3DACC EQU   UCBDVCLS                                                 03549000
UCBTBYT4 EQU   UCBTYP+3                                                 03550000
UCBEXTPT EQU   UCBOB+20                                                 03551000
UCBFLC   EQU   UCBEXTPT                                                 03552000
UCBDEV   EQU   UCBOB+24                                                 03553000
UCBCMEXT EQU   0                                                        03554000
UCBATI   EQU   UCBCMEXT+3                                               03555000
@NM00181 EQU   UCBATI                                                   03556000
UCBFLP1  EQU   UCBCMEXT+5                                               03557000
UCBMT    EQU   0                                                        03558000
UCBOCR   EQU   0                                                        03559000
UCB3540X EQU   0                                                        03560000
UCBDKBYT EQU   UCB3540X+6                                               03561000
UCB3800X EQU   0                                                        03562000
UCBOPTNS EQU   UCB3800X                                                 03563000
UCBACTIV EQU   UCB3800X+3                                               03564000
UCBMDRBF EQU   UCB3800X+36                                              03565000
UCBUCS   EQU   0                                                        03566000
UCBUCSOP EQU   UCBUCS+4                                                 03567000
UCBFCBOP EQU   UCBUCS+5                                                 03568000
DSPTBL   EQU   0                                                        03569000
CMSWA    EQU   0                                                        03570000
CMWFLAGS EQU   CMSWA                                                    03571000
CMCISREQ EQU   CMSWA+1                                                  03572000
CMCISUSE EQU   CMSWA+2                                                  03573000
CMWRKATR EQU   CMCISUSE                                                 03574000
CMWACI   EQU   CMSWA+3                                                  03575000
CMCPLFVT EQU   CMSWA+20                                                 03576000
CMNRMEXT EQU   CMSWA+24                                                 03577000
CMLDTFPL EQU   CMNRMEXT                                                 03578000
CMSSEXTS EQU   CMSWA+28                                                 03579000
CMHDTFPL EQU   CMSSEXTS                                                 03580000
CMCANVOL EQU   CMSWA+32                                                 03581000
CMHIXFPL EQU   CMCANVOL                                                 03582000
CMRNGCTR EQU   CMSWA+40                                                 03583000
CMVOLCTR EQU   CMSWA+42                                                 03584000
CMSDFSPC EQU   CMSWA+48                                                 03585000
CMVLLIST EQU   CMSWA+64                                                 03586000
CMVLRTCD EQU   CMVLLIST+2                                               03587000
CMSPCATR EQU   CMSWA+76                                                 03588000
CMWASTOR EQU   CMSWA+132                                                03589000
CMPOT    EQU   CMWASTOR                                                 03590000
CMDCONV  EQU   CMPOT                                                    03591000
CMIXFANO EQU   CMDCONV                                                  03592000
CMPOTX   EQU   CMWASTOR+4                                               03593000
CMPBI    EQU   CMPOTX                                                   03594000
CMIXFANS EQU   CMPBI                                                    03595000
CMWABYTB EQU   CMSWA+140                                                03596000
CMPBIX   EQU   CMWABYTB                                                 03597000
CMNEST   EQU   CMPBIX                                                   03598000
CMFANT   EQU   CMNEST                                                   03599000
CMSPCQTY EQU   CMFANT                                                   03600000
CMWGENAM EQU   CMSWA+144                                                03601000
CMWDATE  EQU   CMWGENAM+12                                              03602000
CMWTIME  EQU   CMWGENAM+17                                              03603000
DCWPLSPS EQU   CMSWA+200                                                03604000
DCWPLSPL EQU   DCWPLSPS                                                 03605000
DCWPLBFS EQU   CMSWA+232                                                03606000
DCWPLBFL EQU   DCWPLBFS                                                 03607000
DCWPLEDS EQU   CMSWA+260                                                03608000
DCWPLEDL EQU   DCWPLEDS                                                 03609000
DCWPLARS EQU   CMSWA+288                                                03610000
DCWPLARL EQU   DCWPLARS                                                 03611000
DCWPLCDS EQU   CMSWA+316                                                03612000
DCWPLCDL EQU   DCWPLCDS                                                 03613000
CMUCATCI EQU   CMSWA+410                                                03614000
CMSRAC   EQU   CMSWA+516                                                03615000
CMSROBJA EQU   CMSRAC+32                                                03616000
CMSROBJN EQU   CMSROBJA                                                 03617000
DELWKA   EQU   0                                                        03618000
DELNMOBJ EQU   DELWKA+12                                                03619000
DELR3SAV EQU   DELWKA+13                                                03620000
DELRTYPE EQU   DELWKA+14                                                03621000
DELERRIX EQU   DELWKA+15                                                03622000
@NM00192 EQU   DELWKA+16                                                03623000
DELCODE  EQU   @NM00192                                                 03624000
DELCODE2 EQU   @NM00192                                                 03625000
DELCAT   EQU   @NM00192                                                 03626000
DELGNMR  EQU   @NM00192                                                 03627000
DELCODE5 EQU   @NM00192                                                 03628000
DELSGRRN EQU   DELWKA+17                                                03629000
DELI     EQU   DELSGRRN                                                 03630000
DELSPFLG EQU   DELI                                                     03631000
DELC     EQU   DELWKA+19                                                03632000
DELVRRN  EQU   DELWKA+20                                                03633000
DELVCRN  EQU   DELWKA+22                                                03634000
DELXTNWA EQU   DELWKA+24                                                03635000
DELXLOC  EQU   DELXTNWA                                                 03636000
DELXLEN  EQU   DELXTNWA+4                                               03637000
DELRACF  EQU   DELXLEN+3                                                03638000
DELERRSX EQU   DELWKA+32                                                03639000
DELERRS  EQU   DELERRSX                                                 03640000
DELEXTWA EQU   DELWKA+52                                                03641000
DELCPL   EQU   DELEXTWA                                                 03642000
@NM00196 EQU   DELEXTWA+28                                              03643000
DELFPLR  EQU   DELEXTWA+32                                              03644000
@NM00197 EQU   DELEXTWA+48                                              03645000
DELNMR   EQU   DELEXTWA+56                                              03646000
DELFPLT  EQU   DELEXTWA+64                                              03647000
@NM00198 EQU   DELEXTWA+80                                              03648000
DELNMT   EQU   DELEXTWA+88                                              03649000
@NM00199 EQU   DELEXTWA+112                                             03650000
DELNMT2  EQU   DELEXTWA+120                                             03651000
DELNCOBJ EQU   DELWKA+180                                               03652000
DELNGOBJ EQU   DELWKA+181                                               03653000
DELNROBJ EQU   DELWKA+182                                               03654000
DELUSINX EQU   DELWKA+183                                               03655000
DELR13SA EQU   DELWKA+184                                               03656000
DELDIV   EQU   DELWKA+188                                               03657000
DELASCWA EQU   DELDIV                                                   03658000
DELALNG  EQU   DELASCWA                                                 03659000
DELARLNG EQU   DELASCWA+2                                               03660000
DELASSO  EQU   DELASCWA+4                                               03661000
DELATYPE EQU   DELASSO                                                  03662000
DELACI   EQU   DELASSO+1                                                03663000
DELCASWA EQU   DELDIV+16                                                03664000
DELCASSO EQU   DELCASWA+4                                               03665000
DELGASWA EQU   DELDIV+32                                                03666000
DELGASSO EQU   DELGASWA+4                                               03667000
DELRASWA EQU   DELDIV+48                                                03668000
DELRALNG EQU   DELRASWA                                                 03669000
DELRASSO EQU   DELRASWA+4                                               03670000
DELXASWA EQU   DELDIV+72                                                03671000
DELXASSO EQU   DELXASWA+4                                               03672000
DELVGOWA EQU   DELDIV+80                                                03673000
DELVGO   EQU   DELVGOWA+6                                               03674000
DELSHWA  EQU   DELDIV+137                                               03675000
DELDSDWA EQU   DELDIV+226                                               03676000
DELDIRCT EQU   DELDSDWA+4                                               03677000
DELSCRWA EQU   DELWKA+424                                               03678000
DELSCRTH EQU   DELSCRWA                                                 03679000
DELSVOL  EQU   DELSCRWA+16                                              03680000
DELVOLL  EQU   DELWKA+454                                               03681000
DELTIOPT EQU   DELWKA+504                                               03682000
DELOPNPL EQU   DELWKA+508                                               03683000
DELOPOPT EQU   DELOPNPL                                                 03684000
DELOPEND EQU   DELOPOPT                                                 03685000
PASSSTRT EQU   0                                                        03686000
DELERASE EQU   0                                                        03687000
DELACB   EQU   DELERASE                                                 03688000
DELRPL   EQU   DELERASE+76                                              03689000
DELRCPTR EQU   DELERASE+152                                             03690000
DELPASSW EQU   DELERASE+156                                             03691000
DELPASLN EQU   DELPASSW                                                 03692000
DELPASWD EQU   DELPASSW+1                                               03693000
DELENQ   EQU   0                                                        03694000
ENQPROPR EQU   DELENQ                                                   03695000
ENQOPT1  EQU   ENQPROPR                                                 03696000
ENQEND   EQU   ENQOPT1                                                  03697000
ENQRLEN  EQU   ENQPROPR+1                                               03698000
ENQOPT2  EQU   ENQPROPR+2                                               03699000
ENQQNADR EQU   ENQPROPR+4                                               03700000
ENQRNADR EQU   ENQPROPR+8                                               03701000
RNAME    EQU   DELENQ+12                                                03702000
RNAMECI  EQU   RNAME                                                    03703000
RNAMECA  EQU   RNAME+3                                                  03704000
RNAMEID  EQU   RNAME+7                                                  03705000
CUMPLWA  EQU   0                                                        03706000
CUMPL    EQU   CUMPLWA                                                  03707000
CUMIN    EQU   CUMPL                                                    03708000
CUMOUT   EQU   CUMPL+1                                                  03709000
CUMWA    EQU   CUMPLWA+8                                                03710000
CUMFLAG  EQU   CUMWA                                                    03711000
CUMWASS2 EQU   CUMWA+48                                                 03712000
CUMWASS  EQU   CUMWASS2+2                                               03713000
CUMWTYP  EQU   CUMWASS                                                  03714000
FIELDNME EQU   0                                                        03715000
REQNAME  EQU   0                                                        03716000
LUTSLOT  EQU   0                                                        03717000
DELDCODE EQU   0                                                        03718000
DELDTYP  EQU   DELDCODE+2                                               03719000
BUFSIZE  EQU   0                                                        03720000
CATRECRD EQU   0                                                        03721000
CATSN    EQU   0                                                        03722000
CI       EQU   0                                                        03723000
CTGVLDSP EQU   0                                                        03724000
DATEFLD  EQU   0                                                        03725000
ENTRYNAM EQU   0                                                        03726000
EXCPNAME EQU   0                                                        03727000
LRECL    EQU   0                                                        03728000
OWNIDFLD EQU   0                                                        03729000
PLHKEY   EQU   0                                                        03730000
PLHPDL   EQU   0                                                        03731000
PLHPDLE  EQU   0                                                        03732000
PLHRRN   EQU   0                                                        03733000
REC      EQU   0                                                        03734000
SSPTR    EQU   0                                                        03735000
TNAM     EQU   0                                                        03736000
UCBBGN   EQU   0                                                        03737000
@NM00038 EQU   CTGDDNM                                                  03738000
CTGPROB  EQU   @NM00038                                                 03739000
CTGREASN EQU   CTGPROB+2                                                03740000
CVTS01   EQU   CVTPGSIA                                                 03741000
CVTLPDIA EQU   CVTS01+12                                                03742000
CVTDIRST EQU   CVTLPDIA                                                 03743000
CVTSLIDA EQU   CVTS01+24                                                03744000
CVTCTLFG EQU   CVTS01+50                                                03745000
CVTRV210 EQU   CVTS01+424                                               03746000
CVTRV219 EQU   CVTS01+425                                               03747000
CVTRV228 EQU   CVTS01+426                                               03748000
CVTRV237 EQU   CVTS01+427                                               03749000
CVTMFRTR EQU   CVTS01+452                                               03750000
CVTRV262 EQU   CVTS01+468                                               03751000
CVTRV271 EQU   CVTS01+469                                               03752000
CVTRV280 EQU   CVTS01+470                                               03753000
CVTRV289 EQU   CVTS01+471                                               03754000
CVTGSDA  EQU   CVTS01+600                                               03755000
PSARSVTE EQU   PSARSVT                                                  03756000
MCATDSTR EQU   CVTAMFF                                                  03757000
CVTAMF1  EQU   MCATDSTR                                                 03758000
CTGRBASE EQU   NREPLF+1                                                 03759000
CNAME    EQU   CTGRBASE                                                 03760000
COWNID   EQU   CTGRBASE+44                                              03761000
CCRE     EQU   CTGRBASE+52                                              03762000
CEXP     EQU   CTGRBASE+55                                              03763000
CATTR    EQU   CTGRBASE+58                                              03764000
CATTR1   EQU   CATTR                                                    03765000
CUNIQ    EQU   CATTR1                                                   03766000
CERASE   EQU   CATTR1                                                   03767000
CATTR2   EQU   CATTR+1                                                  03768000
CNUS     EQU   CATTR2                                                   03769000
COPEN    EQU   CTGRBASE+60                                              03770000
CSPACPRM EQU   CTGRBASE+65                                              03771000
@NM00116 EQU   CATTR1                                                   03772000
CCATTR   EQU   @NM00116                                                 03773000
@NM00117 EQU   CCATTR                                                   03774000
CPGSP    EQU   @NM00117                                                 03775000
@NM00119 EQU   CATTR1                                                   03776000
CRGATTR  EQU   @NM00119                                                 03777000
CUPG     EQU   CRGATTR                                                  03778000
PLHEXTEN EQU   PLHEND                                                   03779000
PLHBMWRK EQU   PLHEXTEN+5                                               03780000
TIOENTRY EQU   TIOT1+24                                                 03781000
TIOELNGH EQU   TIOENTRY                                                 03782000
TIOESTTA EQU   TIOENTRY+1                                               03783000
TIOERLOC EQU   TIOENTRY+2                                               03784000
TIOELINK EQU   TIOERLOC+1                                               03785000
TIOESYOT EQU   TIOELINK                                                 03786000
TIOEDDNM EQU   TIOENTRY+4                                               03787000
TIOESTTC EQU   TIOENTRY+15                                              03788000
TIOESTTB EQU   TIOENTRY+16                                              03789000
POOLSTAR EQU   TIOENTRY+20                                              03790000
TIOEDEVE EQU   TIOESTTB                                                 03791000
TIOSTTB  EQU   TIOEDEVE                                                 03792000
UCBOBS01 EQU   UCBDEV                                                   03793000
UCBVOLI  EQU   UCBOBS01+4                                               03794000
UCBSTAB  EQU   UCBOBS01+10                                              03795000
UCBBSVL  EQU   UCBSTAB                                                  03796000
UCBPGFL  EQU   UCBSTAB                                                  03797000
UCBPRSRS EQU   UCBSTAB                                                  03798000
UCBDMCT  EQU   UCBOBS01+11                                              03799000
UCBFL4   EQU   UCBOBS01+13                                              03800000
UCBOBS02 EQU   UCBDEV                                                   03801000
UCBTFL1  EQU   UCBOBS02+19                                              03802000
UCBXTN   EQU   UCBOBS02+20                                              03803000
UCBVOPT  EQU   UCBXTN                                                   03804000
UCBOBS03 EQU   UCBDEV                                                   03805000
UCBXTADR EQU   UCBOBS03                                                 03806000
UCBOBS04 EQU   UCBDEV                                                   03807000
UCBBTA   EQU   UCBOBS04+12                                              03808000
UCBOBS06 EQU   UCBDEV                                                   03809000
UCBAOF   EQU   UCBOBS06                                                 03810000
UCBAOF1  EQU   UCBAOF                                                   03811000
UCBAOF2  EQU   UCBAOF+1                                                 03812000
@NM00180 EQU   UCBOBS06+3                                               03813000
UCBIRB   EQU   UCBOBS06+4                                               03814000
UCBGRAF  EQU   UCBIRB                                                   03815000
UCBLDNCA EQU   UCBOBS06+8                                               03816000
UCBRDYQ  EQU   UCBLDNCA                                                 03817000
UCBIRLN  EQU   UCBRDYQ                                                  03818000
UCBLDNCB EQU   UCBRDYQ+1                                                03819000
UCBCTLNK EQU   UCBOBS06+12                                              03820000
UCBOBS07 EQU   UCBDEV                                                   03821000
UCBOBS08 EQU   UCBDEV                                                   03822000
UCBCTCAD EQU   UCBOBS08                                                 03823000
UCBCTCF1 EQU   UCBOBS08+4                                               03824000
UCBOBS09 EQU   UCBDEV                                                   03825000
ACHKPROF EQU   ACHKENT                                                  03826000
FLC      EQU   PSA                                                      03827000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03828000
UCBRV066 EQU   UCBOBS09+4                                               03829000
UCBIOSBA EQU   UCBOBS09                                                 03830000
UCBRV042 EQU   UCBOBS08+5                                               03831000
UCBRV082 EQU   UCBCTCF1                                                 03832000
UCBRV081 EQU   UCBCTCF1                                                 03833000
UCBRV080 EQU   UCBCTCF1                                                 03834000
UCBRV079 EQU   UCBCTCF1                                                 03835000
UCBRV078 EQU   UCBCTCF1                                                 03836000
UCBRV077 EQU   UCBCTCF1                                                 03837000
UCBRV076 EQU   UCBCTCF1                                                 03838000
UCBCTC80 EQU   UCBCTCF1                                                 03839000
UCBCTCAL EQU   UCBCTCAD                                                 03840000
UCBICNCB EQU   UCBOBS07+4                                               03841000
UCBRV040 EQU   UCBOBS07                                                 03842000
UCBCTLNA EQU   UCBCTLNK+1                                               03843000
UCBRLN   EQU   UCBCTLNK                                                 03844000
UCBRDYQA EQU   UCBLDNCB                                                 03845000
UCBINRLN EQU   UCBIRLN                                                  03846000
UCBIRBA  EQU   UCBIRB+1                                                 03847000
UCBRV039 EQU   UCBGRAF                                                  03848000
UCBDWNR  EQU   UCBGRAF                                                  03849000
UCBRPND  EQU   UCBGRAF                                                  03850000
UCBUPM   EQU   UCBGRAF                                                  03851000
UCBBTAM  EQU   UCBGRAF                                                  03852000
UCBDRNO  EQU   UCBGRAF                                                  03853000
UCBDRO   EQU   UCBGRAF                                                  03854000
UCBOIP   EQU   UCBGRAF                                                  03855000
UCBATRCD EQU   @NM00180                                                 03856000
UCBSKPFG EQU   @NM00180                                                 03857000
UCBRIPND EQU   @NM00180                                                 03858000
UCBRTIAC EQU   @NM00180                                                 03859000
UCBRSV79 EQU   @NM00180                                                 03860000
UCBRSV78 EQU   @NM00180                                                 03861000
UCBRSV77 EQU   @NM00180                                                 03862000
UCBOLTEP EQU   @NM00180                                                 03863000
UCBATNCT EQU   UCBOBS06+2                                               03864000
UCBRSV76 EQU   UCBAOF2                                                  03865000
UCBRSV75 EQU   UCBAOF2                                                  03866000
UCBRSV74 EQU   UCBAOF2                                                  03867000
UCBRSV73 EQU   UCBAOF2                                                  03868000
UCBRSV72 EQU   UCBAOF2                                                  03869000
UCBRSV71 EQU   UCBAOF2                                                  03870000
UCBRSV70 EQU   UCBAOF2                                                  03871000
UCBRSV69 EQU   UCBAOF2                                                  03872000
UCBRSV68 EQU   UCBAOF1                                                  03873000
UCBRSV67 EQU   UCBAOF1                                                  03874000
UCBRSV66 EQU   UCBAOF1                                                  03875000
UCBRSV65 EQU   UCBAOF1                                                  03876000
UCBRSV64 EQU   UCBAOF1                                                  03877000
UCBOFNL  EQU   UCBAOF1                                                  03878000
UCBOFSP  EQU   UCBAOF1                                                  03879000
UCBOFMCR EQU   UCBAOF1                                                  03880000
UCBBTB   EQU   UCBBTA+1                                                 03881000
UCBDI    EQU   UCBBTA                                                   03882000
UCBSNS   EQU   UCBOBS04+8                                               03883000
UCBTEB   EQU   UCBOBS04+4                                               03884000
UCBGCB   EQU   UCBOBS04+3                                               03885000
UCBOPEN  EQU   UCBOBS04+2                                               03886000
UCBSTART EQU   UCBOBS04                                                 03887000
UCBXTNB  EQU   UCBXTN+1                                                 03888000
UCBRSV22 EQU   UCBVOPT                                                  03889000
UCBRSV21 EQU   UCBVOPT                                                  03890000
UCBRSV20 EQU   UCBVOPT                                                  03891000
UCBESVE  EQU   UCBVOPT                                                  03892000
UCBERPC  EQU   UCBVOPT                                                  03893000
UCBESVC  EQU   UCBVOPT                                                  03894000
UCBEVA   EQU   UCBVOPT                                                  03895000
UCBESV   EQU   UCBVOPT                                                  03896000
UCBRV009 EQU   UCBTFL1                                                  03897000
UCBRV008 EQU   UCBTFL1                                                  03898000
UCBRV007 EQU   UCBTFL1                                                  03899000
UCBRV006 EQU   UCBTFL1                                                  03900000
UCBRV005 EQU   UCBTFL1                                                  03901000
UCBDQDSP EQU   UCBTFL1                                                  03902000
UCBNSLTP EQU   UCBTFL1                                                  03903000
UCBNLTP  EQU   UCBTFL1                                                  03904000
UCBRES1B EQU   UCBOBS02+18                                              03905000
UCBFSER  EQU   UCBOBS02+12                                              03906000
@NM00179 EQU   UCBOBS02+4                                               03907000
UCBFSEQ  EQU   UCBOBS02+2                                               03908000
UCBFSCT  EQU   UCBOBS02                                                 03909000
UCBNEXP  EQU   UCBOBS01+20                                              03910000
UCBBASE  EQU   UCBOBS01+16                                              03911000
UCBRES1A EQU   UCBOBS01+15                                              03912000
UCBUSER  EQU   UCBOBS01+14                                              03913000
UCBFL47  EQU   UCBFL4                                                   03914000
UCBFL46  EQU   UCBFL4                                                   03915000
UCBFL45  EQU   UCBFL4                                                   03916000
UCBRV065 EQU   UCBFL4                                                   03917000
UCBDSS   EQU   UCBFL4                                                   03918000
UCBRESVP EQU   UCBFL4                                                   03919000
UCBWDAV  EQU   UCBFL4                                                   03920000
UCBDAVV  EQU   UCBFL4                                                   03921000
UCBSQC   EQU   UCBOBS01+12                                              03922000
UCBDATP  EQU   UCBOBS01+12                                              03923000
UCBDMC   EQU   UCBDMCT                                                  03924000
UCBMOUNT EQU   UCBDMCT                                                  03925000
UCBBNUL  EQU   UCBSTAB                                                  03926000
UCBSHAR  EQU   UCBSTAB                                                  03927000
UCBBSTR  EQU   UCBSTAB                                                  03928000
UCBBPUB  EQU   UCBSTAB                                                  03929000
UCBBPRV  EQU   UCBSTAB                                                  03930000
UCBBALB  EQU   UCBPRSRS                                                 03931000
UCBDVSHR EQU   UCBBSVL                                                  03932000
UCBVTOC  EQU   UCBOBS01                                                 03933000
TIOUCBP  EQU   TIOEDEVE+1                                               03934000
TIOVERF  EQU   TIOSTTB                                                  03935000
TIOUNLD  EQU   TIOSTTB                                                  03936000
TIOMNTD  EQU   TIOSTTB                                                  03937000
TIOSETU  EQU   TIOSTTB                                                  03938000
TIOVLSR  EQU   TIOSTTB                                                  03939000
TIOPVIO  EQU   TIOSTTB                                                  03940000
TIOREQD  EQU   TIOSTTB                                                  03941000
TIOUSED  EQU   TIOSTTB                                                  03942000
TIOTFEND EQU   POOLSTAR+16                                              03943000
TIOPSLOT EQU   POOLSTAR+13                                              03944000
TIOPSTTB EQU   POOLSTAR+12                                              03945000
TIOPPOOL EQU   POOLSTAR+4                                               03946000
TIOPNSRT EQU   POOLSTAR+3                                               03947000
@NM00172 EQU   POOLSTAR+2                                               03948000
TIOPNSLT EQU   POOLSTAR+1                                               03949000
@NM00171 EQU   POOLSTAR                                                 03950000
TIOEFSRT EQU   TIOENTRY+17                                              03951000
TIOSVERF EQU   TIOESTTB                                                 03952000
TIOSUNLD EQU   TIOESTTB                                                 03953000
TIOSMNTD EQU   TIOESTTB                                                 03954000
TIOSSETU EQU   TIOESTTB                                                 03955000
TIOSVLSR EQU   TIOESTTB                                                 03956000
TIOSPVIO EQU   TIOESTTB                                                 03957000
TIOSREQD EQU   TIOESTTB                                                 03958000
TIOSUSED EQU   TIOESTTB                                                 03959000
TIOSBALS EQU   TIOESTTC                                                 03960000
TIOSBALP EQU   TIOESTTC                                                 03961000
TIOSVOLS EQU   TIOESTTC                                                 03962000
TIOSVOLP EQU   TIOESTTC                                                 03963000
TIOSAFFS EQU   TIOESTTC                                                 03964000
TIOSAFFP EQU   TIOESTTC                                                 03965000
TIOSDEFR EQU   TIOESTTC                                                 03966000
TIOSDKCR EQU   TIOESTTC                                                 03967000
TIOEJFCB EQU   TIOENTRY+12                                              03968000
TIOTREM  EQU   TIOELINK                                                 03969000
TIOESSDS EQU   TIOESYOT                                                 03970000
TIOESYIN EQU   TIOELINK                                                 03971000
TIOEQNAM EQU   TIOELINK                                                 03972000
TIOEDYNM EQU   TIOELINK                                                 03973000
TIOTTERM EQU   TIOELINK                                                 03974000
TIOTRV01 EQU   TIOELINK                                                 03975000
TIOSYOUT EQU   TIOELINK                                                 03976000
TIOEWTCT EQU   TIOERLOC                                                 03977000
TIOSDSP2 EQU   TIOESTTA                                                 03978000
TIOSDSP1 EQU   TIOESTTA                                                 03979000
TIOSLABL EQU   TIOESTTA                                                 03980000
TIOSDADS EQU   TIOESTTA                                                 03981000
TIOSJBLB EQU   TIOESTTA                                                 03982000
TIOSPLTS EQU   TIOESTTA                                                 03983000
TIOSPLTP EQU   TIOESTTA                                                 03984000
TIOSLTYP EQU   TIOESTTA                                                 03985000
PLHBMSV5 EQU   PLHEXTEN+24                                              03986000
PLHBMSV4 EQU   PLHEXTEN+20                                              03987000
PLHBMSV3 EQU   PLHEXTEN+16                                              03988000
PLHBMSV2 EQU   PLHEXTEN+12                                              03989000
PLHBMSV1 EQU   PLHEXTEN+8                                               03990000
PLHRDCNT EQU   PLHEXTEN+6                                               03991000
PLHBMSOV EQU   PLHBMWRK                                                 03992000
PLHBEUC  EQU   PLHBMWRK                                                 03993000
PLHBMRDF EQU   PLHBMWRK                                                 03994000
@NM00170 EQU   PLHEXTEN+4                                               03995000
PLHRESR1 EQU   PLHEXTEN                                                 03996000
@NM00120 EQU   CRGATTR                                                  03997000
CUPD     EQU   CUPG                                                     03998000
CSWAPSPC EQU   @NM00117                                                 03999000
@NM00118 EQU   @NM00117                                                 04000000
CEXT     EQU   CTGRBASE+86                                              04001000
CDOSUINF EQU   CTGRBASE+84                                              04002000
CLRECL   EQU   CTGRBASE+80                                              04003000
CHIA     EQU   CTGRBASE+76                                              04004000
CHIU     EQU   CTGRBASE+72                                              04005000
CSORT    EQU   CSPACPRM+6                                               04006000
CSEC     EQU   CSPACPRM+3                                               04007000
CPRIM    EQU   CSPACPRM                                                 04008000
CBUF     EQU   CTGRBASE+61                                              04009000
@NM00115 EQU   COPEN                                                    04010000
COPENDS  EQU   COPEN                                                    04011000
CATTISDS EQU   CATTR2                                                   04012000
@NM00114 EQU   CATTR2                                                   04013000
CATTRSSH EQU   CATTR2                                                   04014000
CATTRISH EQU   CATTR2                                                   04015000
CTRKOV   EQU   CATTR1                                                   04016000
CTEMP    EQU   CATTR1                                                   04017000
CINHIB   EQU   CATTR1                                                   04018000
CRECOV   EQU   CATTR1                                                   04019000
CREUSE   EQU   CATTR1                                                   04020000
CSP      EQU   CATTR1                                                   04021000
@NM00091 EQU   MCATDSTR+1                                               04022000
@NM00090 EQU   CVTAMF1                                                  04023000
AMF1NONX EQU   CVTAMF1                                                  04024000
AMF1OPEN EQU   CVTAMF1                                                  04025000
PSARSAV  EQU   PSARSVTE+60                                              04026000
PSARSTK  EQU   PSARSVTE+56                                              04027000
PSAESAV3 EQU   PSARSVTE+52                                              04028000
PSAESTK3 EQU   PSARSVTE+48                                              04029000
PSAESAV2 EQU   PSARSVTE+44                                              04030000
PSAESTK2 EQU   PSARSVTE+40                                              04031000
PSAESAV1 EQU   PSARSVTE+36                                              04032000
PSAESTK1 EQU   PSARSVTE+32                                              04033000
PSAPSAV  EQU   PSARSVTE+28                                              04034000
PSAPSTK  EQU   PSARSVTE+24                                              04035000
PSAMSAV  EQU   PSARSVTE+20                                              04036000
PSAMSTK  EQU   PSARSVTE+16                                              04037000
PSASSAV  EQU   PSARSVTE+12                                              04038000
PSASSTK  EQU   PSARSVTE+8                                               04039000
PSANSTK  EQU   PSARSVTE+4                                               04040000
PSACSTK  EQU   PSARSVTE                                                 04041000
CVTRV628 EQU   CVTS01+728                                               04042000
CVTRV627 EQU   CVTS01+724                                               04043000
CVTRV626 EQU   CVTS01+720                                               04044000
CVTRV625 EQU   CVTS01+716                                               04045000
CVTRV624 EQU   CVTS01+712                                               04046000
CVTRV623 EQU   CVTS01+708                                               04047000
CVTRV622 EQU   CVTS01+704                                               04048000
CVTRV621 EQU   CVTS01+700                                               04049000
CVTIHASU EQU   CVTS01+696                                               04050000
CVTSUSP  EQU   CVTS01+692                                               04051000
CVTT6SVC EQU   CVTS01+688                                               04052000
CVTCDAL  EQU   CVTS01+684                                               04053000
CVTTCTL  EQU   CVTS01+680                                               04054000
CVTRSUME EQU   CVTS01+676                                               04055000
CVTJTERM EQU   CVTS01+672                                               04056000
CVTASMRM EQU   CVTS01+668                                               04057000
CVTTCASP EQU   CVTS01+664                                               04058000
CVT0PT03 EQU   CVTS01+660                                               04059000
CVT0PT0E EQU   CVTS01+656                                               04060000
CVTRV609 EQU   CVTS01+652                                               04061000
CVTCGK   EQU   CVTS01+648                                               04062000
CVTRAC   EQU   CVTS01+644                                               04063000
CVTHSM   EQU   CVTS01+640                                               04064000
CVTRV605 EQU   CVTS01+636                                               04065000
CVTRV604 EQU   CVTS01+632                                               04066000
CVTEFF02 EQU   CVTS01+628                                               04067000
CVTCBBR  EQU   CVTS01+624                                               04068000
CVTSSCR  EQU   CVTS01+620                                               04069000
CVTEVENT EQU   CVTS01+616                                               04070000
CVTCRCA  EQU   CVTS01+612                                               04071000
CVTTPIO  EQU   CVTS01+608                                               04072000
CVTADV   EQU   CVTS01+604                                               04073000
CVTGSDAB EQU   CVTGSDA                                                  04074000
CVTQV3   EQU   CVTS01+596                                               04075000
CVTQV2   EQU   CVTS01+592                                               04076000
CVTQV1   EQU   CVTS01+588                                               04077000
CVTRPT   EQU   CVTS01+584                                               04078000
CVTSSRB  EQU   CVTS01+580                                               04079000
CVTCSDRL EQU   CVTS01+576                                               04080000
CVTEXP1  EQU   CVTS01+572                                               04081000
CVTRMPMT EQU   CVTS01+568                                               04082000
CVTRMPTT EQU   CVTS01+564                                               04083000
CVTVPSA  EQU   CVTS01+560                                               04084000
CVTVSTOP EQU   CVTS01+556                                               04085000
CVTGTFR8 EQU   CVTS01+552                                               04086000
CVTQUIT  EQU   CVTS01+548                                               04087000
CVTVACR  EQU   CVTS01+544                                               04088000
CVTWTCB  EQU   CVTS01+540                                               04089000
CVTSTPRS EQU   CVTS01+536                                               04090000
CVT0PT02 EQU   CVTS01+532                                               04091000
CVTDARCM EQU   CVTS01+528                                               04092000
CVTIRECM EQU   CVTS01+524                                               04093000
CVTJRECM EQU   CVTS01+520                                               04094000
CVTVEMS0 EQU   CVTS01+516                                               04095000
CVTSPFRR EQU   CVTS01+512                                               04096000
CVTRLSTG EQU   CVTS01+508                                               04097000
CVT0TC0A EQU   CVTS01+504                                               04098000
CVTGMBR  EQU   CVTS01+500                                               04099000
CVTLFRM  EQU   CVTS01+496                                               04100000
CVTRMBR  EQU   CVTS01+492                                               04101000
CVTVIOP  EQU   CVTS01+488                                               04102000
CVTRV307 EQU   CVTS01+486                                               04103000
CVTRV306 EQU   CVTS01+484                                               04104000
CVTRV305 EQU   CVTS01+482                                               04105000
CVTRV304 EQU   CVTS01+480                                               04106000
CVTRV303 EQU   CVTS01+478                                               04107000
CVTRV302 EQU   CVTS01+476                                               04108000
CVTTRCA  EQU   CVTS01+472                                               04109000
CVTRV297 EQU   CVTRV289                                                 04110000
CVTRV296 EQU   CVTRV289                                                 04111000
CVTRV295 EQU   CVTRV289                                                 04112000
CVTRV294 EQU   CVTRV289                                                 04113000
CVTRV293 EQU   CVTRV289                                                 04114000
CVTRV292 EQU   CVTRV289                                                 04115000
CVTRV291 EQU   CVTRV289                                                 04116000
CVTRV290 EQU   CVTRV289                                                 04117000
CVTRV288 EQU   CVTRV280                                                 04118000
CVTRV287 EQU   CVTRV280                                                 04119000
CVTRV286 EQU   CVTRV280                                                 04120000
CVTRV285 EQU   CVTRV280                                                 04121000
CVTRV284 EQU   CVTRV280                                                 04122000
CVTRV283 EQU   CVTRV280                                                 04123000
CVTRV282 EQU   CVTRV280                                                 04124000
CVTRV281 EQU   CVTRV280                                                 04125000
CVTRV279 EQU   CVTRV271                                                 04126000
CVTRV278 EQU   CVTRV271                                                 04127000
CVTRV277 EQU   CVTRV271                                                 04128000
CVTRV276 EQU   CVTRV271                                                 04129000
CVTRV275 EQU   CVTRV271                                                 04130000
CVTRV274 EQU   CVTRV271                                                 04131000
CVTRV273 EQU   CVTRV271                                                 04132000
CVTRV272 EQU   CVTRV271                                                 04133000
CVTRV270 EQU   CVTRV262                                                 04134000
CVTRV269 EQU   CVTRV262                                                 04135000
CVTRV268 EQU   CVTRV262                                                 04136000
CVTRV267 EQU   CVTRV262                                                 04137000
CVTRV266 EQU   CVTRV262                                                 04138000
CVTRV265 EQU   CVTRV262                                                 04139000
CVTRV264 EQU   CVTRV262                                                 04140000
CVTRV263 EQU   CVTRV262                                                 04141000
CVTVFP   EQU   CVTS01+464                                               04142000
CVTVSI   EQU   CVTS01+460                                               04143000
CVTVPSIB EQU   CVTS01+456                                               04144000
CVTMFACT EQU   CVTMFRTR                                                 04145000
CVTMFCTL EQU   CVTS01+448                                               04146000
CVTPVBP  EQU   CVTS01+444                                               04147000
CVTPWI   EQU   CVTS01+440                                               04148000
CVTRV254 EQU   CVTS01+438                                               04149000
CVTRV253 EQU   CVTS01+436                                               04150000
CVTRV252 EQU   CVTS01+434                                               04151000
CVTRV251 EQU   CVTS01+433                                               04152000
CVTRV250 EQU   CVTS01+432                                               04153000
CVTRV249 EQU   CVTS01+431                                               04154000
CVTRV248 EQU   CVTS01+430                                               04155000
CVTRV247 EQU   CVTS01+429                                               04156000
CVTRV246 EQU   CVTS01+428                                               04157000
CVTRV245 EQU   CVTRV237                                                 04158000
CVTRV244 EQU   CVTRV237                                                 04159000
CVTRV243 EQU   CVTRV237                                                 04160000
CVTRV242 EQU   CVTRV237                                                 04161000
CVTRV241 EQU   CVTRV237                                                 04162000
CVTRV240 EQU   CVTRV237                                                 04163000
CVTRV239 EQU   CVTRV237                                                 04164000
CVTRV238 EQU   CVTRV237                                                 04165000
CVTRV236 EQU   CVTRV228                                                 04166000
CVTRV235 EQU   CVTRV228                                                 04167000
CVTRV234 EQU   CVTRV228                                                 04168000
CVTRV233 EQU   CVTRV228                                                 04169000
CVTRV232 EQU   CVTRV228                                                 04170000
CVTRV231 EQU   CVTRV228                                                 04171000
CVTRV230 EQU   CVTRV228                                                 04172000
CVTRV229 EQU   CVTRV228                                                 04173000
CVTRV227 EQU   CVTRV219                                                 04174000
CVTRV226 EQU   CVTRV219                                                 04175000
CVTRV225 EQU   CVTRV219                                                 04176000
CVTRV224 EQU   CVTRV219                                                 04177000
CVTRV223 EQU   CVTRV219                                                 04178000
CVTRV222 EQU   CVTRV219                                                 04179000
CVTRV221 EQU   CVTRV219                                                 04180000
CVTRV220 EQU   CVTRV219                                                 04181000
CVTRV218 EQU   CVTRV210                                                 04182000
CVTRV217 EQU   CVTRV210                                                 04183000
CVTRV216 EQU   CVTRV210                                                 04184000
CVTRV215 EQU   CVTRV210                                                 04185000
CVTRV214 EQU   CVTRV210                                                 04186000
CVTRV213 EQU   CVTRV210                                                 04187000
CVTRV212 EQU   CVTRV210                                                 04188000
CVTRV211 EQU   CVTRV210                                                 04189000
CVTLCCAT EQU   CVTS01+420                                               04190000
CVTPCCAT EQU   CVTS01+416                                               04191000
CVTIPCRP EQU   CVTS01+412                                               04192000
CVTIPCRI EQU   CVTS01+408                                               04193000
CVTIPCDS EQU   CVTS01+404                                               04194000
CVTAIDVT EQU   CVTS01+400                                               04195000
CVTSSAP  EQU   CVTS01+396                                               04196000
CVTEHCIR EQU   CVTS01+392                                               04197000
CVTEHDEF EQU   CVTS01+388                                               04198000
CVTDAIR  EQU   CVTS01+384                                               04199000
CVTPERFM EQU   CVTS01+380                                               04200000
CVT044R2 EQU   CVTS01+376                                               04201000
CVTFETCH EQU   CVTS01+372                                               04202000
CVTRSTWD EQU   CVTS01+368                                               04203000
CVTSPOST EQU   CVTS01+364                                               04204000
CVTIOBP  EQU   CVTS01+360                                               04205000
CVTASMVT EQU   CVTS01+356                                               04206000
CVTRECRQ EQU   CVTS01+352                                               04207000
CVTWSAC  EQU   CVTS01+348                                               04208000
CVTRV149 EQU   CVTS01+344                                               04209000
CVTWSAL  EQU   CVTS01+340                                               04210000
CVTSPSA  EQU   CVTS01+336                                               04211000
CVTGLMN  EQU   CVTS01+332                                               04212000
CVTVEAC0 EQU   CVTS01+328                                               04213000
CVT062R1 EQU   CVTS01+324                                               04214000
CVTRPOST EQU   CVTS01+320                                               04215000
CVTDQIQE EQU   CVTS01+316                                               04216000
CVTCSD   EQU   CVTS01+312                                               04217000
CVTLKRMA EQU   CVTS01+308                                               04218000
CVTRSPIE EQU   CVTS01+304                                               04219000
CVTRENQ  EQU   CVTS01+300                                               04220000
CVTLQCB  EQU   CVTS01+296                                               04221000
CVTFQCB  EQU   CVTS01+292                                               04222000
CVTQCS01 EQU   CVTS01+288                                               04223000
CVTAPFT  EQU   CVTS01+284                                               04224000
CVTPARRL EQU   CVTS01+280                                               04225000
CVTVWAIT EQU   CVTS01+276                                               04226000
CVTGSPL  EQU   CVTS01+272                                               04227000
CVTLSMQ  EQU   CVTS01+268                                               04228000
CVTGSMQ  EQU   CVTS01+264                                               04229000
CVTEXPRO EQU   CVTS01+260                                               04230000
CVTOPCTP EQU   CVTS01+256                                               04231000
CVTSIC   EQU   CVTS01+252                                               04232000
CVTTPIOS EQU   CVTS01+248                                               04233000
CVTRTMS  EQU   CVTS01+244                                               04234000
CVTSDBF  EQU   CVTS01+240                                               04235000
CVTSCBP  EQU   CVTS01+236                                               04236000
CVTSDMP  EQU   CVTS01+232                                               04237000
CVTSV60  EQU   CVTS01+228                                               04238000
CVTRTMCT EQU   CVTS01+224                                               04239000
CVTASCBL EQU   CVTS01+220                                               04240000
CVTASCBH EQU   CVTS01+216                                               04241000
CVTGDA   EQU   CVTS01+212                                               04242000
CVTASVT  EQU   CVTS01+208                                               04243000
CVTVVMDI EQU   CVTS01+204                                               04244000
CVTAQTOP EQU   CVTS01+200                                               04245000
CVTIOSCS EQU   CVTS01+196                                               04246000
CVTSDRM  EQU   CVTS01+192                                               04247000
CVTOPTE  EQU   CVTS01+188                                               04248000
CVTSTXU  EQU   CVTS01+184                                               04249000
CVTQUIS  EQU   CVTS01+180                                               04250000
CVTPARS  EQU   CVTS01+176                                               04251000
CVTS1EE  EQU   CVTS01+172                                               04252000
CVTFRAS  EQU   CVTS01+168                                               04253000
CVTQSAS  EQU   CVTS01+164                                               04254000
CVTCRAS  EQU   CVTS01+160                                               04255000
CVTCRMN  EQU   CVTS01+156                                               04256000
CVTDELCP EQU   CVTS01+152                                               04257000
CVTFRECL EQU   CVTS01+148                                               04258000
CVTGETCL EQU   CVTS01+144                                               04259000
CVTBLDCP EQU   CVTS01+140                                               04260000
CVTAUTHL EQU   CVTS01+136                                               04261000
CVTSCAN  EQU   CVTS01+132                                               04262000
CVTRV144 EQU   CVTS01+130                                               04263000
CVTMAXMP EQU   CVTS01+128                                               04264000
CVTSTCK  EQU   CVTS01+124                                               04265000
CVTRV139 EQU   CVTS01+123                                               04266000
CVTDSSAC EQU   CVTS01+122                                               04267000
CVTRV513 EQU   CVTS01+121                                               04268000
CVTIOSPL EQU   CVTS01+120                                               04269000
CVTPTGT  EQU   CVTS01+116                                               04270000
CVTCSPIE EQU   CVTS01+112                                               04271000
CVTSMFEX EQU   CVTS01+108                                               04272000
CVTOLT0A EQU   CVTS01+104                                               04273000
CVTSRBRT EQU   CVTS01+100                                               04274000
CVTPUTL  EQU   CVTS01+96                                                04275000
CVTASCRL EQU   CVTS01+92                                                04276000
CVTASCRF EQU   CVTS01+88                                                04277000
CVTRV326 EQU   CVTS01+84                                                04278000
CVTRV325 EQU   CVTS01+80                                                04279000
CVTRV324 EQU   CVTS01+76                                                04280000
CVT0VL01 EQU   CVTS01+72                                                04281000
CVTSHRVM EQU   CVTS01+68                                                04282000
CVTRV332 EQU   CVTS01+64                                                04283000
CVTTAS   EQU   CVTS01+60                                                04284000
CVTRSCN  EQU   CVTS01+56                                                04285000
CVTTRAC2 EQU   CVTS01+54                                                04286000
CVTTRACE EQU   CVTS01+52                                                04287000
CVTAPG   EQU   CVTS01+51                                                04288000
CVTSDTRC EQU   CVTCTLFG                                                 04289000
CVTGTRCE EQU   CVTCTLFG                                                 04290000
CVTNOMP  EQU   CVTCTLFG                                                 04291000
CVTRSV79 EQU   CVTCTLFG                                                 04292000
CVTDSTAT EQU   CVTCTLFG                                                 04293000
CVTRSV78 EQU   CVTCTLFG                                                 04294000
CVTRV333 EQU   CVTCTLFG                                                 04295000
CVTRV323 EQU   CVTCTLFG                                                 04296000
CVTSPVLK EQU   CVTS01+49                                                04297000
CVTRSV77 EQU   CVTS01+48                                                04298000
CVTRV331 EQU   CVTS01+44                                                04299000
CVTRV330 EQU   CVTS01+40                                                04300000
CVTRV329 EQU   CVTS01+36                                                04301000
CVTRV328 EQU   CVTS01+32                                                04302000
CVTRV322 EQU   CVTS01+28                                                04303000
CVTSLID  EQU   CVTSLIDA+1                                               04304000
CVTSYLK  EQU   CVTSLIDA                                                 04305000
CVTRV321 EQU   CVTS01+20                                                04306000
CVTRV320 EQU   CVTS01+16                                                04307000
CVTLPDIR EQU   CVTLPDIA+1                                               04308000
CVTRSV69 EQU   CVTDIRST                                                 04309000
CVTRSV68 EQU   CVTDIRST                                                 04310000
CVTRSV67 EQU   CVTDIRST                                                 04311000
CVTRSV66 EQU   CVTDIRST                                                 04312000
CVTRSV65 EQU   CVTDIRST                                                 04313000
CVTRSV64 EQU   CVTDIRST                                                 04314000
CVTRSV63 EQU   CVTDIRST                                                 04315000
CVTDICOM EQU   CVTDIRST                                                 04316000
CVTPVTP  EQU   CVTS01+8                                                 04317000
CVTLPDSR EQU   CVTS01+4                                                 04318000
CVTGETL  EQU   CVTS01                                                   04319000
CTGREAS2 EQU   CTGREASN+1                                               04320000
CTGREAS1 EQU   CTGREASN                                                 04321000
CTGMODID EQU   CTGPROB                                                  04322000
@NM00212 EQU   DELDCODE                                                 04323000
CUMRC    EQU   CUMWA+148                                                04324000
@NM00211 EQU   CUMWA+146                                                04325000
CUMFMWA  EQU   CUMWA+58                                                 04326000
CUMWCI2  EQU   CUMWASS2+7                                               04327000
CUMWTYP2 EQU   CUMWASS2+6                                               04328000
CUMWCI   EQU   CUMWASS+1                                                04329000
CUMTYPE  EQU   CUMWTYP                                                  04330000
CUMWREL  EQU   CUMWASS2                                                 04331000
CUMFN2   EQU   CUMWA+40                                                 04332000
CUMFN1   EQU   CUMWA+32                                                 04333000
CUMDY    EQU   CUMWA+29                                                 04334000
@NM00210 EQU   CUMWA+28                                                 04335000
CUMSRID  EQU   CUMWA+25                                                 04336000
@NM00209 EQU   CUMWA+24                                                 04337000
CUMRABD  EQU   CUMWA+20                                                 04338000
CUMRAB2  EQU   CUMWA+16                                                 04339000
CUMRAB1  EQU   CUMWA+12                                                 04340000
CUMRABB  EQU   CUMWA+8                                                  04341000
CUMURAB  EQU   CUMWA+4                                                  04342000
CUMBCI   EQU   CUMWA+1                                                  04343000
@NM00208 EQU   CUMFLAG                                                  04344000
CUMEXIT  EQU   CUMFLAG                                                  04345000
CUMICI   EQU   CUMPL+5                                                  04346000
CUMDCI   EQU   CUMPL+2                                                  04347000
@NM00207 EQU   CUMOUT                                                   04348000
CUMNE    EQU   CUMOUT                                                   04349000
CUMDUP   EQU   CUMOUT                                                   04350000
@NM00206 EQU   CUMIN                                                    04351000
CUMFUNC  EQU   CUMIN                                                    04352000
CUMNRG   EQU   CUMIN                                                    04353000
CUMFDEL  EQU   CUMIN                                                    04354000
ENQRETC  EQU   ENQPROPR+3                                               04355000
@NM00205 EQU   ENQOPT2                                                  04356000
ENQSHR   EQU   ENQOPT2                                                  04357000
ENQDIR   EQU   ENQOPT1                                                  04358000
@NM00204 EQU   ENQOPT1                                                  04359000
ENQNEW   EQU   ENQOPT1                                                  04360000
F        EQU   DELWKA+514                                               04361000
@NM00203 EQU   DELWKA+512                                               04362000
DELACBPT EQU   DELOPNPL+1                                               04363000
@NM00202 EQU   DELOPOPT                                                 04364000
DELHECIN EQU   DELTIOPT+1                                               04365000
@NM00201 EQU   DELTIOPT                                                 04366000
DELPROC  EQU   DELWKA+502                                               04367000
DELSVTET EQU   DELWKA+490                                               04368000
DELSVMTL EQU   DELVOLL                                                  04369000
DELSRCD2 EQU   DELSVOL+13                                               04370000
DELSRCD1 EQU   DELSVOL+12                                               04371000
DELSVLID EQU   DELSVOL+6                                                04372000
DELSDEVT EQU   DELSVOL+2                                                04373000
DELSNVLS EQU   DELSVOL                                                  04374000
DELSVLST EQU   DELSCRTH+12                                              04375000
DELSNUSE EQU   DELSCRTH+8                                               04376000
DELSDSNM EQU   DELSCRTH+4                                               04377000
DELSCRFL EQU   DELSCRTH                                                 04378000
@NM00200 EQU   DELDSDWA+9                                               04379000
DELDRRN  EQU   DELDIRCT                                                 04380000
DELDRLNG EQU   DELDSDWA+2                                               04381000
DELDLNG  EQU   DELDSDWA                                                 04382000
DELDSGRP EQU   DELSHWA+4                                                04383000
DELSRLNG EQU   DELSHWA+2                                                04384000
DELSLNG  EQU   DELSHWA                                                  04385000
DELTVRRN EQU   DELVGOWA+4                                               04386000
DELVRLNG EQU   DELVGOWA+2                                               04387000
DELVLNG  EQU   DELVGOWA                                                 04388000
DELXCI   EQU   DELXASSO+1                                               04389000
DELXTYPE EQU   DELXASSO                                                 04390000
DELXRLNG EQU   DELXASWA+2                                               04391000
DELXALNG EQU   DELXASWA                                                 04392000
DELRCI   EQU   DELRASSO+1                                               04393000
DELRTYP  EQU   DELRASSO                                                 04394000
DELRRLNG EQU   DELRASWA+2                                               04395000
DELGCI   EQU   DELGASSO+1                                               04396000
DELGTYPE EQU   DELGASSO                                                 04397000
DELGRLNG EQU   DELGASWA+2                                               04398000
DELGALNG EQU   DELGASWA                                                 04399000
DELCCI   EQU   DELCASSO+1                                               04400000
DELCTYPE EQU   DELCASSO                                                 04401000
DELCRLNG EQU   DELCASWA+2                                               04402000
DELCALNG EQU   DELCASWA                                                 04403000
DELT2NM  EQU   DELNMT2                                                  04404000
DELT2DT  EQU   @NM00199                                                 04405000
DELFPLT2 EQU   DELEXTWA+96                                              04406000
DELT1NM  EQU   DELNMT                                                   04407000
DELT1DT  EQU   @NM00198                                                 04408000
DELFPLT1 EQU   DELFPLT                                                  04409000
DELFL1NM EQU   DELNMR                                                   04410000
DELFL1DT EQU   @NM00197                                                 04411000
DELFPLDT EQU   DELFPLR                                                  04412000
DELCPLFL EQU   @NM00196                                                 04413000
DELCPLST EQU   DELCPL                                                   04414000
DELRETCD EQU   DELERRS+3                                                04415000
DELREASN EQU   DELERRS+2                                                04416000
DELMODID EQU   DELERRS                                                  04417000
@NM00195 EQU   DELRACF                                                  04418000
DELINDI  EQU   DELRACF                                                  04419000
DELINDD  EQU   DELRACF                                                  04420000
DELINDC  EQU   DELRACF                                                  04421000
@NM00194 EQU   DELXLEN+2                                                04422000
TSTSPDUU EQU   DELXLEN                                                  04423000
DELTSFPL EQU   DELXLOC                                                  04424000
TSTCNTRN EQU   DELVCRN                                                  04425000
TSTRELSP EQU   DELVRRN                                                  04426000
DELE     EQU   DELSGRRN+1                                               04427000
@NM00193 EQU   DELSPFLG                                                 04428000
DELNONVS EQU   DELSPFLG                                                 04429000
DELSPSCR EQU   DELCODE5                                                 04430000
DELCODE4 EQU   @NM00192                                                 04431000
DELCODE3 EQU   @NM00192                                                 04432000
DELKYRNG EQU   @NM00192                                                 04433000
@NM00191 EQU   DELWKA                                                   04434000
CMSDYNAL EQU   CMSRAC+164                                               04435000
@NM00190 EQU   CMSROBJN+1                                               04436000
CMSROBJI EQU   CMSROBJN                                                 04437000
CMSWRMAC EQU   CMSRAC+16                                                04438000
CMSWARFV EQU   CMSRAC+12                                                04439000
CMSRDSVL EQU   CMSRAC+8                                                 04440000
CMSRDSNA EQU   CMSRAC+4                                                 04441000
@NM00189 EQU   CMSRAC+2                                                 04442000
CMSREACD EQU   CMSRAC+1                                                 04443000
CMSRETCD EQU   CMSRAC                                                   04444000
CMSRACBF EQU   CMSWA+504                                                04445000
CMBYTAU  EQU   CMSWA+500                                                04446000
CMBYTTRK EQU   CMSWA+496                                                04447000
CMSCTREC EQU   CMSWA+416                                                04448000
@NM00188 EQU   CMSWA+413                                                04449000
CMDEFACI EQU   CMUCATCI                                                 04450000
CMBLPTKS EQU   CMSWA+408                                                04451000
CMSDSPTB EQU   CMSWA+344                                                04452000
@NM00187 EQU   DCWPLCDS+27                                              04453000
DCWPLCDV EQU   DCWPLCDS+24                                              04454000
DCWPLCDA EQU   DCWPLCDL+16                                              04455000
DCWPLCDH EQU   DCWPLCDL                                                 04456000
DCWPLARV EQU   DCWPLARS+24                                              04457000
DCWPLARA EQU   DCWPLARL+16                                              04458000
DCWPLARH EQU   DCWPLARL                                                 04459000
@NM00186 EQU   DCWPLEDS+27                                              04460000
DCWPLEDV EQU   DCWPLEDS+24                                              04461000
DCWPLEDA EQU   DCWPLEDL+16                                              04462000
DCWPLEDH EQU   DCWPLEDL                                                 04463000
DCWPLBFV EQU   DCWPLBFS+24                                              04464000
DCWPLBFA EQU   DCWPLBFL+16                                              04465000
DCWPLBFH EQU   DCWPLBFL                                                 04466000
@NM00185 EQU   DCWPLSPS+31                                              04467000
DCWPLSPV EQU   DCWPLSPS+24                                              04468000
DCWPLSPA EQU   DCWPLSPL+16                                              04469000
DCWPLSPH EQU   DCWPLSPL                                                 04470000
DCWFPLPT EQU   CMSWA+196                                                04471000
DCWAREPT EQU   CMSWA+192                                                04472000
@NM00184 EQU   CMSWA+190                                                04473000
DCWIX    EQU   CMSWA+188                                                04474000
CMWPAD   EQU   CMWGENAM+35                                              04475000
CMWTIME2 EQU   CMWTIME+11                                               04476000
CMWDELM2 EQU   CMWTIME+9                                                04477000
CMWTIME1 EQU   CMWTIME+2                                                04478000
CMWDELM1 EQU   CMWTIME                                                  04479000
CMWDAY   EQU   CMWDATE+2                                                04480000
CMWYEAR  EQU   CMWDATE                                                  04481000
CMWFIXID EQU   CMWGENAM                                                 04482000
CMNCILL  EQU   CMSPCQTY                                                 04483000
CMNCITL  EQU   CMIXFANS                                                 04484000
CMWT     EQU   CMIXFANO                                                 04485000
CMDEFSWA EQU   CMSWA+128                                                04486000
CMSRCCOR EQU   CMSWA+124                                                04487000
CMEXTLST EQU   CMSWA+120                                                04488000
WORKPROC EQU   CMSWA+118                                                04489000
@NM00183 EQU   CMSWA+116                                                04490000
CMFPLIDX EQU   CMSWA+112                                                04491000
CMCNVNO  EQU   CMSWA+110                                                04492000
CMCNVLEN EQU   CMSWA+108                                                04493000
CMTRKCYL EQU   CMSPCATR+12                                              04494000
CMTRKPCA EQU   CMSPCATR+10                                              04495000
CMBLKTRK EQU   CMSPCATR+8                                               04496000
CMSWADTY EQU   CMSPCATR+4                                               04497000
CMPHYBLK EQU   CMSPCATR                                                 04498000
CMTOTVOL EQU   CMSWA+74                                                 04499000
CMVLVOL  EQU   CMVLLIST+4                                               04500000
CMVLRT2  EQU   CMVLRTCD+1                                               04501000
CMVLRT1  EQU   CMVLRTCD                                                 04502000
CMVLLTLN EQU   CMVLLIST                                                 04503000
@NM00182 EQU   CMSWA+62                                                 04504000
CMSCRADT EQU   CMSWA+58                                                 04505000
CMSCRAVI EQU   CMSWA+52                                                 04506000
CMSDEFCI EQU   CMSDFSPC+1                                               04507000
CMSWAFLG EQU   CMSDFSPC                                                 04508000
CMSPCFVT EQU   CMSWA+44                                                 04509000
CMRMVVOL EQU   CMVOLCTR                                                 04510000
CMADDVOL EQU   CMRNGCTR                                                 04511000
SPACINDC EQU   CMSWA+38                                                 04512000
PROCESS  EQU   CMSWA+36                                                 04513000
CMDTAFPL EQU   CMHIXFPL                                                 04514000
CMTSTFPL EQU   CMHDTFPL                                                 04515000
CMRNMLST EQU   CMLDTFPL                                                 04516000
CMEXTFLS EQU   CMCPLFVT                                                 04517000
CMASCFPL EQU   CMSWA+16                                                 04518000
CMWFVTPT EQU   CMSWA+12                                                 04519000
CMAMDRNG EQU   CMWRKATR                                                 04520000
CMAMDORD EQU   CMWRKATR                                                 04521000
CMAMDRPL EQU   CMWRKATR                                                 04522000
CMAMDSDT EQU   CMWRKATR                                                 04523000
CMAMDWCK EQU   CMWRKATR                                                 04524000
CMAMDDST EQU   CMWRKATR                                                 04525000
CMSUALOC EQU   CMWFLAGS                                                 04526000
CMSRACDL EQU   CMWFLAGS                                                 04527000
CMPROC   EQU   CMWFLAGS                                                 04528000
CMPROCM  EQU   CMWFLAGS                                                 04529000
CMFGDLSC EQU   CMWFLAGS                                                 04530000
DSNPHYBS EQU   DSPTBL+30                                                04531000
DSPHYBPT EQU   DSPTBL+22                                                04532000
DSMPHYBS EQU   DSPTBL+20                                                04533000
DSDEVCHA EQU   DSPTBL                                                   04534000
UCBERADR EQU   UCBUCS+12                                                04535000
UCBFCBID EQU   UCBUCS+8                                                 04536000
UCBERCNT EQU   UCBUCS+7                                                 04537000
UCBRSV51 EQU   UCBUCS+6                                                 04538000
UCBFCBPE EQU   UCBFCBOP                                                 04539000
UCBRSV49 EQU   UCBFCBOP                                                 04540000
UCBRSV48 EQU   UCBFCBOP                                                 04541000
UCBRSV47 EQU   UCBFCBOP                                                 04542000
UCBRSV46 EQU   UCBFCBOP                                                 04543000
UCBRSV45 EQU   UCBFCBOP                                                 04544000
UCBRSV44 EQU   UCBFCBOP                                                 04545000
UCBFCBO1 EQU   UCBFCBOP                                                 04546000
UCBUCSPE EQU   UCBUCSOP                                                 04547000
UCBRSV43 EQU   UCBUCSOP                                                 04548000
UCBRSV42 EQU   UCBUCSOP                                                 04549000
UCBRSV41 EQU   UCBUCSOP                                                 04550000
UCBRSV40 EQU   UCBUCSOP                                                 04551000
UCBRSV39 EQU   UCBUCSOP                                                 04552000
UCBUCSO2 EQU   UCBUCSOP                                                 04553000
UCBUCSO1 EQU   UCBUCSOP                                                 04554000
UCBUCSID EQU   UCBUCS                                                   04555000
UCBMDRBA EQU   UCBMDRBF+1                                               04556000
UCBRV075 EQU   UCBMDRBF                                                 04557000
UCBRV074 EQU   UCB3800X+32                                              04558000
UCBIMAGE EQU   UCB3800X+28                                              04559000
UCBFCBNM EQU   UCB3800X+24                                              04560000
UCBCHAR4 EQU   UCB3800X+20                                              04561000
UCBCHAR3 EQU   UCB3800X+16                                              04562000
UCBCHAR2 EQU   UCB3800X+12                                              04563000
UCBCHAR1 EQU   UCB3800X+8                                               04564000
UCBCGMID EQU   UCB3800X+4                                               04565000
UCBBRSTA EQU   UCBACTIV                                                 04566000
UCBRV063 EQU   UCBACTIV                                                 04567000
UCBRV062 EQU   UCBACTIV                                                 04568000
UCBRV061 EQU   UCBACTIV                                                 04569000
UCBRV060 EQU   UCBACTIV                                                 04570000
UCBRV059 EQU   UCBACTIV                                                 04571000
UCBRV058 EQU   UCBACTIV                                                 04572000
UCBRV057 EQU   UCBACTIV                                                 04573000
UCBRV050 EQU   UCB3800X+2                                               04574000
UCBCGMNO EQU   UCB3800X+1                                               04575000
UCBRV083 EQU   UCBOPTNS                                                 04576000
UCBBRSTR EQU   UCBOPTNS                                                 04577000
UCBRV056 EQU   UCBOPTNS                                                 04578000
UCBRV055 EQU   UCBOPTNS                                                 04579000
UCBRV054 EQU   UCBOPTNS                                                 04580000
UCBRV053 EQU   UCBOPTNS                                                 04581000
UCBRV052 EQU   UCBOPTNS                                                 04582000
UCBRV051 EQU   UCBOPTNS                                                 04583000
UCBRV073 EQU   UCB3540X+7                                               04584000
UCBRV072 EQU   UCBDKBYT                                                 04585000
UCBRV071 EQU   UCBDKBYT                                                 04586000
UCBRV070 EQU   UCBDKBYT                                                 04587000
UCBRV069 EQU   UCBDKBYT                                                 04588000
UCBRV068 EQU   UCBDKBYT                                                 04589000
UCBRV067 EQU   UCBDKBYT                                                 04590000
UCBVLVER EQU   UCBDKBYT                                                 04591000
UCBDKAMX EQU   UCBDKBYT                                                 04592000
UCBVLSER EQU   UCB3540X                                                 04593000
UCBRDATA EQU   UCBOCR+4                                                 04594000
UCBFRID  EQU   UCBOCR                                                   04595000
UCBCLN   EQU   UCBMT+14                                                 04596000
UCBERG   EQU   UCBMT+12                                                 04597000
UCBMS    EQU   UCBMT+11                                                 04598000
UCBNB    EQU   UCBMT+10                                                 04599000
UCBPW    EQU   UCBMT+9                                                  04600000
UCBPR    EQU   UCBMT+8                                                  04601000
UCBSIO   EQU   UCBMT+6                                                  04602000
UCBTW    EQU   UCBMT+5                                                  04603000
UCBTR    EQU   UCBMT+4                                                  04604000
UCBTWT   EQU   UCBMT+3                                                  04605000
UCBTRT   EQU   UCBMT+2                                                  04606000
UCBCTD   EQU   UCBMT                                                    04607000
UCBWTOID EQU   UCBCMEXT+17                                              04608000
UCBRV043 EQU   UCBCMEXT+16                                              04609000
UCBASID  EQU   UCBCMEXT+14                                              04610000
UCBMFCNT EQU   UCBCMEXT+12                                              04611000
UCBPMSK  EQU   UCBCMEXT+10                                              04612000
UCBCCWOF EQU   UCBCMEXT+8                                               04613000
UCBRV041 EQU   UCBCMEXT+6                                               04614000
UCBRV036 EQU   UCBFLP1                                                  04615000
UCBRV035 EQU   UCBFLP1                                                  04616000
UCBERLOG EQU   UCBFLP1                                                  04617000
UCBRV033 EQU   UCBFLP1                                                  04618000
UCBINHIO EQU   UCBFLP1                                                  04619000
UCBNSWAP EQU   UCBFLP1                                                  04620000
UCBSHRUP EQU   UCBFLP1                                                  04621000
UCBNSRCH EQU   UCBFLP1                                                  04622000
UCBSNSCT EQU   UCBCMEXT+4                                               04623000
UCBHPDV  EQU   @NM00181                                                 04624000
UCBHALI  EQU   @NM00181                                                 04625000
UCBRSV09 EQU   @NM00181                                                 04626000
UCBRSV08 EQU   @NM00181                                                 04627000
UCBRSV07 EQU   @NM00181                                                 04628000
UCBRSV06 EQU   @NM00181                                                 04629000
UCBRSV05 EQU   @NM00181                                                 04630000
UCBRSV04 EQU   @NM00181                                                 04631000
UCBDTI   EQU   UCBCMEXT+2                                               04632000
UCBSTI   EQU   UCBCMEXT+1                                               04633000
UCBETI   EQU   UCBCMEXT                                                 04634000
UCBEXTP  EQU   UCBEXTPT+1                                               04635000
UCBDDRSW EQU   UCBFLC                                                   04636000
UCBTICBT EQU   UCBFLC                                                   04637000
UCBIVRR  EQU   UCBFLC                                                   04638000
UCBIVRS  EQU   UCBFLC                                                   04639000
UCBITF   EQU   UCBFLC                                                   04640000
UCBUDE   EQU   UCBFLC                                                   04641000
UCBWAA   EQU   UCBFLC                                                   04642000
UCBATTP  EQU   UCBFLC                                                   04643000
UCBUNTYP EQU   UCBTBYT4                                                 04644000
UCBRSV11 EQU   UCBDVCLS                                                 04645000
UCBRSV10 EQU   UCBDVCLS                                                 04646000
UCB3CHAR EQU   UCBDVCLS                                                 04647000
UCB3UREC EQU   UCBDVCLS                                                 04648000
UCB3DISP EQU   UCBDVCLS                                                 04649000
UCB3COMM EQU   UCBDVCLS                                                 04650000
UCB3TAPE EQU   UCBDVCLS                                                 04651000
UCBDVPWR EQU   UCB2OPT7                                                 04652000
UCBVLPWR EQU   UCB2OPT6                                                 04653000
UCB2OPT5 EQU   UCBTBYT2                                                 04654000
UCBRVDEV EQU   UCBRWTAU                                                 04655000
UCBRPS   EQU   UCBDUDN2                                                 04656000
UCBRR    EQU   UCBDUDN1                                                 04657000
UCB2OPT1 EQU   UCBTBYT2                                                 04658000
UCB2OPT0 EQU   UCBTBYT2                                                 04659000
UCB1FEA7 EQU   UCBTBYT1                                                 04660000
UCBD6250 EQU   UCB1FEA6                                                 04661000
UCBD1600 EQU   UCB1FEA5                                                 04662000
UCB1FEA4 EQU   UCBTBYT1                                                 04663000
UCB1FEA3 EQU   UCBTBYT1                                                 04664000
UCB1FEA2 EQU   UCBTBYT1                                                 04665000
UCB1FEA1 EQU   UCBTBYT1                                                 04666000
UCB1FEA0 EQU   UCBTBYT1                                                 04667000
UCBNAME  EQU   UCBOB+13                                                 04668000
UCBRV029 EQU   UCBWGT                                                   04669000
UCBVHRSN EQU   UCBWGT                                                   04670000
UCBVORSN EQU   UCBWGT                                                   04671000
UCBMTPXP EQU   UCBWGT                                                   04672000
UCBREW   EQU   UCBWGT                                                   04673000
UCBPUB   EQU   UCBWGT                                                   04674000
UCBOUT   EQU   UCBWGT                                                   04675000
UCBIN    EQU   UCBWGT                                                   04676000
UCBCPU   EQU   UCBOB+11                                                 04677000
UCBLCI   EQU   UCBOB+10                                                 04678000
UCBCNT   EQU   UCBOB+9                                                  04679000
UCBRV017 EQU   UCBCHM1                                                  04680000
UCBRV016 EQU   UCBCHM1                                                  04681000
UCBRV015 EQU   UCBCHM1                                                  04682000
UCBRV014 EQU   UCBCHM1                                                  04683000
UCBSPB   EQU   UCBPTH1                                                  04684000
UCBPPB   EQU   UCBPTH1                                                  04685000
UCBSPA   EQU   UCBPTH0                                                  04686000
UCBPPA   EQU   UCBPTH0                                                  04687000
UCBSIGP  EQU   UCBFLB                                                   04688000
UCBVALPH EQU   UCBFLB                                                   04689000
UCBCRHSN EQU   UCBFLB                                                   04690000
UCBCRHRV EQU   UCBFLB                                                   04691000
UCBRESVH EQU   UCBFLB                                                   04692000
UCBSPST  EQU   UCBFLB                                                   04693000
UCBASNS  EQU   UCBFLB                                                   04694000
UCBIORST EQU   UCBFLB                                                   04695000
UCBQISCE EQU   UCBFL1                                                   04696000
UCBACTV  EQU   UCBFL1                                                   04697000
UCBSAP   EQU   UCBFL1                                                   04698000
UCBNOTRC EQU   UCBCUB                                                   04699000
UCBPSNS  EQU   UCBFL1                                                   04700000
UCBUSING EQU   UCBPST                                                   04701000
UCBNOTRD EQU   UCBNRY                                                   04702000
UCBBUSYD EQU   UCBBSY                                                   04703000
UCBUA    EQU   UCBCHAN+1                                                04704000
UCBCHA   EQU   UCBCHAN                                                  04705000
UCBDADI  EQU   UCBSTAT                                                  04706000
UCBSYSR  EQU   UCBSTAT                                                  04707000
UCBPRES  EQU   UCBSTAT                                                  04708000
UCBALOC  EQU   UCBSTAT                                                  04709000
UCBUNLD  EQU   UCBSTAT                                                  04710000
UCBRESV  EQU   UCBSTAT                                                  04711000
UCBCHGS  EQU   UCBSTAT                                                  04712000
UCBONLI  EQU   UCBSTAT                                                  04713000
UCBID    EQU   UCBOB+2                                                  04714000
UCBALTPH EQU   UCBFL5                                                   04715000
UCBALTCU EQU   UCBFL5                                                   04716000
UCBNALOC EQU   UCBFL5                                                   04717000
UCBENVRD EQU   UCBFL5                                                   04718000
UCBVSDR  EQU   UCBFL5                                                   04719000
UCBSASK  EQU   UCBFL5                                                   04720000
UCBAMV   EQU   UCBAF                                                    04721000
UCBDCC   EQU   UCBFL5                                                   04722000
UCBMONT  EQU   UCBJBNR                                                  04723000
UCBRV011 EQU   UCBJBNR                                                  04724000
UCBMMSGP EQU   UCBJBNR                                                  04725000
UCBOLDSM EQU   UCBJBNR                                                  04726000
UCBRV003 EQU   UCBJBNR                                                  04727000
UCBDUC   EQU   UCBJBNR                                                  04728000
UCBJES3  EQU   UCBJBNR                                                  04729000
UCBVRDEV EQU   UCBJBNR                                                  04730000
UCBCMSEG EQU   UCBOB                                                    04731000
UCBPFXND EQU   UCB+512                                                  04732000
UCBIOQ   EQU   UCB+508                                                  04733000
UCBLOCK  EQU   UCB+504                                                  04734000
UCBPXST  EQU   UCB+504                                                  04735000
@NM00178 EQU   UCB                                                      04736000
RPLERMSA EQU   RPLCOMN+72                                               04737000
RPLEMLEN EQU   RPLCOMN+70                                               04738000
RPLACTIV EQU   RPLCOMN+69                                               04739000
RPLBRANC EQU   RPLEXTD1                                                 04740000
RPLNIB   EQU   RPLEXTD1                                                 04741000
@NM00177 EQU   RPLEXTD1                                                 04742000
RPLEXIT  EQU   RPLEXTD1                                                 04743000
RPLNEXIT EQU   RPLEXTD1                                                 04744000
RPLEXSCH EQU   RPLEXTD1                                                 04745000
@NM00176 EQU   RPLRBAR+3                                                04746000
@NM00175 EQU   RPLAIXID                                                 04747000
RPLAXPKP EQU   RPLAIXID                                                 04748000
RPLAIXPC EQU   RPLRBAR                                                  04749000
RPLRSV88 EQU   RPLOPT8                                                  04750000
RPLUNCON EQU   RPLOPT8                                                  04751000
RPLACTV  EQU   RPLOPT8                                                  04752000
RPLSESS  EQU   RPLOPT8                                                  04753000
RPLPEND  EQU   RPLOPT8                                                  04754000
RPLODPRM EQU   RPLOPT8                                                  04755000
RPLODACP EQU   RPLOPT8                                                  04756000
RPLODACQ EQU   RPLOPT8                                                  04757000
RPLRSV78 EQU   RPLOPT7                                                  04758000
RPLTCRNO EQU   RPLOPT7                                                  04759000
RPLRLSOP EQU   RPLOPT7                                                  04760000
RPLTPOST EQU   RPLOPT7                                                  04761000
RPLQOPT  EQU   RPLOPT7                                                  04762000
RPLCNIMM EQU   RPLCNOPT                                                 04763000
RPLCNANY EQU   RPLCNOPT                                                 04764000
RPLCNALL EQU   RPLCNOPT                                                 04765000
RPLRSV68 EQU   RPLOPT6                                                  04766000
RPLRSV67 EQU   RPLOPT6                                                  04767000
RPLLOCK  EQU   RPLOPT6                                                  04768000
RPLNCOND EQU   RPLOPT6                                                  04769000
RPLCOND  EQU   RPLOPT6                                                  04770000
RPLEOT   EQU   RPLUNTYP                                                 04771000
RPLEOM   EQU   RPLUNTYP                                                 04772000
RPLEOB   EQU   RPLUNTYP                                                 04773000
RPLWROPT EQU   RPLOPT5                                                  04774000
RPLNODE  EQU   RPLOPT5                                                  04775000
RPLERACE EQU   RPLWRTYP                                                 04776000
RPLEAU   EQU   RPLWRTYP                                                 04777000
RPLNERAS EQU   RPLWRTYP                                                 04778000
RPLPSOPT EQU   RPLOPT5                                                  04779000
@NM00174 EQU   RPLOPT5                                                  04780000
RPLDLGIN EQU   RPLOPT5                                                  04781000
RPLBUFL  EQU   RPLCOMN+52                                               04782000
RPLRLEN  EQU   RPLCOMN+48                                               04783000
RPLCHAIN EQU   RPLNXTRP                                                 04784000
@NM00173 EQU   RPLOPT4                                                  04785000
RPLMKFRM EQU   RPLOPT4                                                  04786000
RPLENDTR EQU   RPLOPT4                                                  04787000
RPLALIGN EQU   RPLOPT3                                                  04788000
RPLFMT   EQU   RPLOPT3                                                  04789000
RPLFLD   EQU   RPLOPT3                                                  04790000
RPLVFY   EQU   RPLOPT3                                                  04791000
RPLBLK   EQU   RPLOPT3                                                  04792000
RPLSFORM EQU   RPLOPT3                                                  04793000
RPLEODS  EQU   RPLOPT3                                                  04794000
RPLNSP   EQU   RPLOPT2                                                  04795000
RPLUPD   EQU   RPLOPT2                                                  04796000
RPLWAITX EQU   RPLOPT2                                                  04797000
RPLLRD   EQU   RPLOPT2                                                  04798000
RPLBWD   EQU   RPLOPT2                                                  04799000
RPLCNV   EQU   RPLOPT2                                                  04800000
RPLADD   EQU   RPLADR                                                   04801000
RPLKEY   EQU   RPLOPT2                                                  04802000
RPLECBIN EQU   RPLECBSW                                                 04803000
RPLGEN   EQU   RPLOPT1                                                  04804000
RPLKGE   EQU   RPLOPT1                                                  04805000
RPLASY   EQU   RPLOPT1                                                  04806000
RPLSKP   EQU   RPLOPT1                                                  04807000
RPLSEQ   EQU   RPLOPT1                                                  04808000
RPLDIR   EQU   RPLOPT1                                                  04809000
RPLLOC   EQU   RPLOPT1                                                  04810000
RPLDAF   EQU   RPLARG+2                                                 04811000
RPLSAF   EQU   RPLARG                                                   04812000
RPLAREA  EQU   RPLCOMN+32                                               04813000
RPLTCBPT EQU   RPLCOMN+28                                               04814000
RPLCCHAR EQU   RPLCOMN+20                                               04815000
RPLSTRID EQU   RPLCOMN+18                                               04816000
RPLKEYL  EQU   RPLKEYLE                                                 04817000
RPLRDSOH EQU   RPLFDB3                                                  04818000
RPLRLG   EQU   RPLFDB3                                                  04819000
RPLLGFRC EQU   RPLFDB3                                                  04820000
RPLREOT  EQU   RPLFDB3                                                  04821000
RPLREOM  EQU   RPLFDB3                                                  04822000
RPLREOB  EQU   RPLFDB3                                                  04823000
RPLSV32  EQU   RPLFDB3                                                  04824000
RPLUINPT EQU   RPLFDB3                                                  04825000
RPLSTSAV EQU   RPLFDB2                                                  04826000
RPLCUERR EQU   RPLFDB2                                                  04827000
RPLDLGFL EQU   RPLFDB2                                                  04828000
RPLIOERR EQU   RPLFDB2                                                  04829000
RPLDVUNS EQU   RPLFDB2                                                  04830000
RPLATND  EQU   RPLFDB2                                                  04831000
RPLRVID  EQU   RPLFDB2                                                  04832000
RPLERLK  EQU   RPLFDB2                                                  04833000
RPLERREG EQU   RPLRTNCD                                                 04834000
RPLSTAT  EQU   RPLFDBWD                                                 04835000
RPLPOST  EQU   RPLECB                                                   04836000
RPLWAIT  EQU   RPLECB                                                   04837000
RPLPLHPT EQU   RPLCOMN+4                                                04838000
RPLLEN2  EQU   RPLLEN                                                   04839000
RPLREQ   EQU   RPLIDWD+2                                                04840000
RPLSTYP  EQU   RPLIDWD+1                                                04841000
RPLID    EQU   RPLIDWD                                                  04842000
TIOCSTEP EQU   TIOT1+8                                                  04843000
TIOCNJOB EQU   TIOT1                                                    04844000
PLHERRET EQU   IDAPLH+276                                               04845000
PLHASCB  EQU   IDAPLH+272                                               04846000
PLHECB   EQU   IDAPLH+268                                               04847000
@NM00169 EQU   IDAPLH+265                                               04848000
PLHDRMSK EQU   IDAPLH+264                                               04849000
PLHR13   EQU   IDAPLH+260                                               04850000
PLHPARM1 EQU   IDAPLH+256                                               04851000
PLHDRRSC EQU   IDAPLH+252                                               04852000
PLHSLRBA EQU   IDAPLH+244                                               04853000
PLHSRCSG EQU   IDAPLH+242                                               04854000
PLHNOSEG EQU   IDAPLH+240                                               04855000
PLHLLOR  EQU   IDAPLH+236                                               04856000
PLHXPLH  EQU   PLHWAX                                                   04857000
@NM00168 EQU   PLHIXSPL+8                                               04858000
PLHIXBFC EQU   PLHIXSPL+4                                               04859000
PLHHIREC EQU   PLHSSRBA                                                 04860000
PLHISPLP EQU   IDAPLH+196                                               04861000
PLHRBUFC EQU   IDAPLH+192                                               04862000
PLHIBUFC EQU   IDAPLH+188                                               04863000
PLHNRBA  EQU   IDAPLH+184                                               04864000
PLHDDDD  EQU   PLHEOVPT                                                 04865000
PLHAR14  EQU   IDAPLH+176                                               04866000
@NM00167 EQU   IDAPLH+172                                               04867000
@NM00166 EQU   IDAPLH+168                                               04868000
PLHASAVE EQU   IDAPLH+164                                               04869000
PLHRETOS EQU   IDAPLH+118                                               04870000
PLHCHAIN EQU   IDAPLH+112                                               04871000
PLHAMB   EQU   IDAPLH+108                                               04872000
PLHSAVE6 EQU   IDAPLH+104                                               04873000
PLHSAVE5 EQU   IDAPLH+100                                               04874000
PLHSAVE4 EQU   IDAPLH+96                                                04875000
PLHSAVE3 EQU   IDAPLH+92                                                04876000
PLHSAVE2 EQU   IDAPLH+88                                                04877000
PLHSAVE1 EQU   IDAPLH+84                                                04878000
PLHARET  EQU   IDAPLH+80                                                04879000
PLHIIOB  EQU   PLHDIOB                                                  04880000
PLHSRSID EQU   IDAPLH+74                                                04881000
PLHRDFC  EQU   IDAPLH+72                                                04882000
PLHRDFP  EQU   IDAPLH+68                                                04883000
PLHFSP   EQU   IDAPLH+64                                                04884000
PLHRECP  EQU   IDAPLH+60                                                04885000
PLHNBUFC EQU   IDAPLH+56                                                04886000
PLHDBUFC EQU   IDAPLH+52                                                04887000
PLHLRECL EQU   IDAPLH+48                                                04888000
@NM00165 EQU   IDAPLH+43                                                04889000
PLHEOVR  EQU   IDAPLH+42                                                04890000
PLHRCODE EQU   IDAPLH+41                                                04891000
PLHUCODE EQU   PLHJCODE                                                 04892000
PLHJNRBA EQU   IDAPLH+36                                                04893000
PLHJRNLL EQU   IDAPLH+32                                                04894000
PLHUPECB EQU   PLHJORBA                                                 04895000
PLHDSIDA EQU   IDAPLH+24                                                04896000
PLHCRPL  EQU   IDAPLH+20                                                04897000
PLHMRPL  EQU   IDAPLH+16                                                04898000
PLHBFRNO EQU   IDAPLH+15                                                04899000
PLHFRCNT EQU   IDAPLH+14                                                04900000
PLHRMIN  EQU   IDAPLH+13                                                04901000
PLHDSTYP EQU   IDAPLH+12                                                04902000
PLHACB   EQU   IDAPLH+8                                                 04903000
PLHRAE   EQU   PLHAFLGS                                                 04904000
PLHRABWD EQU   PLHAFLGS                                                 04905000
PLHIOSID EQU   PLHAFLGS                                                 04906000
PLHDBDC  EQU   PLHAFLGS                                                 04907000
PLHVAMB  EQU   PLHAFLGS                                                 04908000
PLHIOSRQ EQU   PLHAFLGS                                                 04909000
PLHDRLM  EQU   PLHAFLGS                                                 04910000
PLHEOVDF EQU   PLHFLG3                                                  04911000
PLHRVRS  EQU   PLHFLG3                                                  04912000
PLHBWD   EQU   PLHFLG3                                                  04913000
PLHSLVLD EQU   PLHFLG3                                                  04914000
PLHRAHD  EQU   PLHFLG3                                                  04915000
PLHSRBSG EQU   PLHFLG3                                                  04916000
@NM00164 EQU   PLHEFLGS+1                                               04917000
PLHRSTRT EQU   PLHEFLGS+1                                               04918000
PLHDSCAN EQU   PLHEFLGS                                                 04919000
PLHINVAL EQU   PLHEFLGS                                                 04920000
PLHEODX  EQU   PLHEFLGS                                                 04921000
PLHNOADV EQU   PLHEFLGS                                                 04922000
PLHSRINV EQU   PLHEFLGS                                                 04923000
PLHSKPER EQU   PLHEFLGS                                                 04924000
PLH1ST   EQU   PLHEFLGS                                                 04925000
PLHNOSPC EQU   PLHEFLGS                                                 04926000
PLHIWAIT EQU   PLHFLG2                                                  04927000
PLHSVADV EQU   PLHFLG2                                                  04928000
PLHCIINS EQU   PLHFLG2                                                  04929000
PLHKRE   EQU   PLHFLG2                                                  04930000
PLHADDTE EQU   PLHFLG2                                                  04931000
PLHKEYMD EQU   PLHFLG2                                                  04932000
PLHSQINS EQU   PLHFLG2                                                  04933000
PLHUPD   EQU   PLHFLG2                                                  04934000
PLHSR    EQU   PLHFLG1                                                  04935000
PLHDRPND EQU   PLHFLG1                                                  04936000
PLHASYRQ EQU   PLHFLG1                                                  04937000
PLHRDEXC EQU   PLHFLG1                                                  04938000
PLHSSR   EQU   PLHFLG1                                                  04939000
PLHASKBF EQU   PLHFLG1                                                  04940000
PLHENDRQ EQU   PLHFLG1                                                  04941000
PLHEOVW  EQU   PLHFLG1                                                  04942000
PLHATV   EQU   IDAPLH+1                                                 04943000
PLHAVL   EQU   IDAPLH                                                   04944000
PLHIOSDQ EQU   IDAPLHDR+12                                              04945000
PLHDRCUR EQU   IDAPLHDR+10                                              04946000
PLHDRMAX EQU   IDAPLHDR+8                                               04947000
PLHDRREQ EQU   IDAPLHDR+4                                               04948000
PLHELTH  EQU   IDAPLHDR+2                                               04949000
PLHCNT   EQU   IDAPLHDR+1                                               04950000
PLHID    EQU   IDAPLHDR                                                 04951000
ARDKEYS  EQU   IDAARDB+29                                               04952000
@NM00163 EQU   ARDPRF                                                   04953000
ARDPRFMT EQU   ARDPRF                                                   04954000
ARDPRSS  EQU   ARDPRF                                                   04955000
ARDRELNO EQU   IDAARDB+26                                               04956000
ARDVOLSR EQU   IDAARDB+20                                               04957000
ARDHKRBA EQU   IDAARDB+8                                                04958000
ARDLEN   EQU   IDAARDB+2                                                04959000
ARDUSED  EQU   ARDTYPE                                                  04960000
ARDUOVFL EQU   ARDTYPE                                                  04961000
ARDSS    EQU   ARDTYPE                                                  04962000
ARDHLI   EQU   ARDTYPE                                                  04963000
ARDKR    EQU   ARDTYPE                                                  04964000
ARDID    EQU   IDAARDB                                                  04965000
AMDEXCP  EQU   AMDSTAT+44                                               04966000
AMDNCAS  EQU   AMDSTAT+40                                               04967000
AMDNCIS  EQU   AMDSTAT+36                                               04968000
AMDASPA  EQU   AMDSTAT+32                                               04969000
AMDRETR  EQU   AMDSTAT+28                                               04970000
AMDUPR   EQU   AMDSTAT+24                                               04971000
AMDIREC  EQU   AMDSTAT+20                                               04972000
AMDDELR  EQU   AMDSTAT+16                                               04973000
AMDNLR   EQU   AMDSTAT+12                                               04974000
AMDNEXT  EQU   AMDSTAT+10                                               04975000
AMDNIL   EQU   AMDSTAT+8                                                04976000
AMDSTSP  EQU   AMDSTAT                                                  04977000
@NM00162 EQU   IDAAMDSB+41                                              04978000
@NM00161 EQU   AMDATTR3                                                 04979000
AMDLM    EQU   AMDATTR3                                                 04980000
AMDWAIT  EQU   AMDATTR3                                                 04981000
AMDBIND  EQU   AMDATTR3                                                 04982000
AMDFAULT EQU   AMDATTR3                                                 04983000
AMDUNQ   EQU   AMDATTR3                                                 04984000
AMDMAXRR EQU   AMDSSRBA                                                 04985000
AMDNSLOT EQU   AMDHLRBA                                                 04986000
AMDLRECL EQU   IDAAMDSB+24                                              04987000
AMDFSCI  EQU   IDAAMDSB+16                                              04988000
AMDFSCA  EQU   IDAAMDSB+14                                              04989000
AMDPCTCI EQU   IDAAMDSB+11                                              04990000
AMDPCTCA EQU   IDAAMDSB+10                                              04991000
AMDKEYLN EQU   IDAAMDSB+8                                               04992000
AMDRKP   EQU   IDAAMDSB+6                                               04993000
AMDAXRKP EQU   AMDNEST                                                  04994000
AMDLEN   EQU   IDAAMDSB+2                                               04995000
AMDSPAN  EQU   AMDATTR                                                  04996000
AMDRRDS  EQU   AMDATTR                                                  04997000
AMDRANGE EQU   AMDATTR                                                  04998000
AMDORDER EQU   AMDATTR                                                  04999000
AMDREPL  EQU   AMDATTR                                                  05000000
AMDSDT   EQU   AMDATTR                                                  05001000
AMDWCK   EQU   AMDATTR                                                  05002000
AMDDST   EQU   AMDATTR                                                  05003000
AMDSBID  EQU   IDAAMDSB                                                 05004000
AMBVIOT  EQU   IDAAMB+116                                               05005000
AMBSZCP  EQU   IDAAMB+114                                               05006000
AMBSZFW  EQU   IDAAMB+112                                               05007000
AMBSZWR  EQU   IDAAMB+110                                               05008000
AMBSZRD  EQU   IDAAMB+108                                               05009000
AMBEXEX  EQU   IDAAMB+100                                               05010000
AMBWSHD  EQU   IDAAMB+96                                                05011000
AMBCPA   EQU   IDAAMB+92                                                05012000
AMBBM2SH EQU   IDAAMB+88                                                05013000
AMBRDCNT EQU   AMBCSWD1+2                                               05014000
@NM00160 EQU   AMBCSWD1+1                                               05015000
@NM00159 EQU   AMBAFLG                                                  05016000
AMBCFX   EQU   AMBAFLG                                                  05017000
AMBSIS   EQU   AMBAFLG                                                  05018000
AMBDFR   EQU   AMBAFLG                                                  05019000
AMBICI   EQU   AMBAFLG                                                  05020000
AMBGSR   EQU   AMBAFLG                                                  05021000
AMBLSR   EQU   AMBAFLG                                                  05022000
@NM00158 EQU   AMBAFLG                                                  05023000
AMBUPLH  EQU   IDAAMB+80                                                05024000
AMBPAMBL EQU   IDAAMB+76                                                05025000
AMBPIXP  EQU   IDAAMB+72                                                05026000
@NM00157 EQU   IDAAMB+68                                                05027000
AMBIWA   EQU   IDAAMB+64                                                05028000
AMBWKA   EQU   IDAAMB+60                                                05029000
AMBAMBXN EQU   AMBEOVPT                                                 05030000
AMBEDB   EQU   IDAAMB+52                                                05031000
AMBRPT   EQU   IDAAMB+50                                                05032000
AMBPUG   EQU   AMBFLG2                                                  05033000
AMBBUSY  EQU   AMBOFLGS                                                 05034000
AMBEXFG  EQU   AMBOFLGS                                                 05035000
@NM00156 EQU   AMBOFLGS                                                 05036000
AMBOPEN  EQU   AMBOFLGS                                                 05037000
@NM00155 EQU   AMBOFLGS                                                 05038000
AMBDEBAD EQU   AMBDEBPT+1                                               05039000
AMBIFLGS EQU   AMBDEBPT                                                 05040000
AMBAMETH EQU   IDAAMB+43                                                05041000
AMBSDS   EQU   AMBINFL                                                  05042000
AMBUPX   EQU   AMBINFL                                                  05043000
AMBUCRA  EQU   AMBINFL                                                  05044000
AMBSCRA  EQU   AMBINFL                                                  05045000
AMBCAT   EQU   AMBINFL                                                  05046000
@NM00154 EQU   AMBINFL                                                  05047000
@NM00153 EQU   AMBINFL                                                  05048000
AMBTIOT  EQU   IDAAMB+40                                                05049000
@NM00152 EQU   IDAAMB+38                                                05050000
AMBCDSN  EQU   IDAAMB+32                                                05051000
AMBIOMB  EQU   AMBIOBAD                                                 05052000
@NM00151 EQU   AMBDSORG+1                                               05053000
AMBDORGA EQU   AMBDSORG+1                                               05054000
@NM00150 EQU   AMBDSORG                                                 05055000
AMBINBUF EQU   AMBFLG1                                                  05056000
AMBJRN   EQU   AMBFLG1                                                  05057000
AMBUBF   EQU   AMBFLG1                                                  05058000
AMBSPEED EQU   AMBFLG1                                                  05059000
AMBPCAT  EQU   AMBFLG1                                                  05060000
AMBMCAT  EQU   AMBFLG1                                                  05061000
AMBTYPE  EQU   AMBFLG1                                                  05062000
AMBCREAT EQU   AMBFLG1                                                  05063000
@NM00149 EQU   AMBFLG0                                                  05064000
AMBSWSP  EQU   AMBFLG0                                                  05065000
AMBPSDS  EQU   AMBFLG0                                                  05066000
AMBBUFC  EQU   IDAAMB+8                                                 05067000
AMBLINK  EQU   IDAAMB+4                                                 05068000
AMBLEN   EQU   IDAAMB+2                                                 05069000
AMBRSC   EQU   IDAAMB+1                                                 05070000
AMBID    EQU   IDAAMB                                                   05071000
AMBLCMB  EQU   IDAAMBL+64                                               05072000
AMBLBIB  EQU   IDAAMBL+60                                               05073000
AMBLIX   EQU   IDAAMBL+56                                               05074000
AMBLMIDS EQU   IDAAMBL+42                                               05075000
AMBLNIDS EQU   IDAAMBL+41                                               05076000
@NM00148 EQU   IDAAMBL+40                                               05077000
AMBLNUM  EQU   IDAAMBL+38                                               05078000
AMBLNST  EQU   IDAAMBL+37                                               05079000
@NM00147 EQU   AMBLFLG2                                                 05080000
AMBLSTAG EQU   AMBLFLG2                                                 05081000
@NM00146 EQU   AMBLFLG2                                                 05082000
AMBLDUMY EQU   AMBLFLG1                                                 05083000
AMBLCAT  EQU   AMBLFLG1                                                 05084000
AMBLUCRA EQU   AMBLFLG1                                                 05085000
AMBLSCRA EQU   AMBLFLG1                                                 05086000
AMBLSDS  EQU   AMBLVVIC                                                 05087000
AMBLUPD  EQU   AMBLFLG1                                                 05088000
AMBLCINV EQU   AMBLFLG1                                                 05089000
AMBLFULL EQU   AMBLFLG1                                                 05090000
AMBLLEN  EQU   IDAAMBL+34                                               05091000
@NM00145 EQU   AMBLSHAR                                                 05092000
AMBLWRIT EQU   AMBLSHAR                                                 05093000
AMBLCATO EQU   AMBLSHAR                                                 05094000
AMBLPRIM EQU   AMBLSHAR                                                 05095000
AMBLID   EQU   IDAAMBL+32                                               05096000
@NM00144 EQU   AMBLQ2                                                   05097000
AMBLCBIC EQU   AMBLQ2                                                   05098000
@NM00143 EQU   AMBLTYPE                                                 05099000
AMBLFIX  EQU   AMBLTYPE                                                 05100000
AMBLBASE EQU   AMBLTYPE                                                 05101000
AMBLAIX  EQU   AMBLTYPE                                                 05102000
AMBLUPGR EQU   AMBLTYPE                                                 05103000
AMBLPATH EQU   AMBLTYPE                                                 05104000
AMBLENO  EQU   AMBLVC+1                                                 05105000
AMBLVRT  EQU   AMBLVC                                                   05106000
AMBLXPT  EQU   IDAAMBL+24                                               05107000
AMBLDFR  EQU   AMBLQ                                                    05108000
AMBLESDS EQU   AMBLQ                                                    05109000
AMBLKSDS EQU   AMBLQ                                                    05110000
AMBLUBF  EQU   AMBLQ                                                    05111000
AMBLFSTP EQU   AMBLQ                                                    05112000
AMBLLSR  EQU   AMBLQ                                                    05113000
AMBLGSR  EQU   AMBLQ                                                    05114000
AMBLDDC  EQU   AMBLQ                                                    05115000
AMBLDCI  EQU   AMBLIDF+4                                                05116000
AMBLCACB EQU   AMBLIDF                                                  05117000
@NM00142 EQU   AMBLEOV+2                                                05118000
AMBLCOMP EQU   AMBLEOV+1                                                05119000
AMBLESET EQU   AMBLEFLG                                                 05120000
AMBLWAIT EQU   AMBLEFLG                                                 05121000
AMBLACB  EQU   IDAAMBL+8                                                05122000
AMBLSCHN EQU   IDAAMBL+4                                                05123000
AMBLPCHN EQU   IDAAMBL                                                  05124000
VVOLLVSR EQU   VVOLLENT+6                                               05125000
VVOLLVFY EQU   @NM00141                                                 05126000
VVOLLMNT EQU   @NM00141                                                 05127000
VVOLLUCB EQU   VVOLLENT                                                 05128000
VVOLLDEB EQU   IDAVVOLL+32                                              05129000
VVOLLBIB EQU   IDAVVOLL+28                                              05130000
VVOLLSFI EQU   IDAVVOLL+16                                              05131000
VVOLLCNT EQU   VVOLLERR+3                                               05132000
VVOLLSFC EQU   VVOLLERR+2                                               05133000
VVOLLFNC EQU   VVOLLERR+1                                               05134000
VVOLLPDC EQU   VVOLLERR                                                 05135000
VVOLLACB EQU   IDAVVOLL+8                                               05136000
VVOLLNBR EQU   IDAVVOLL+2                                               05137000
@NM00140 EQU   IDAVVOLL+1                                               05138000
VVOLLSWD EQU   @NM00138                                                 05139000
VVOLLCAT EQU   @NM00138                                                 05140000
VVOLLEOV EQU   @NM00138                                                 05141000
VVOLLOPE EQU   @NM00138                                                 05142000
VVOLLTIO EQU   @NM00138                                                 05143000
VVOLLID  EQU   @NM00138                                                 05144000
@NM00139 EQU   @NM00138                                                 05145000
CMFXHRBA EQU   CMFXECTS+16                                              05146000
CMFXLRBA EQU   CMFXECTS+12                                              05147000
CMFXNOTT EQU   CMFXECTS+10                                              05148000
CMFXEDHH EQU   CMFXEDA+2                                                05149000
CMFXEDCC EQU   CMFXEDA                                                  05150000
CMFXSTHH EQU   CMFXSTA+2                                                05151000
CMFXSTCC EQU   CMFXSTA                                                  05152000
CMFXEXSS EQU   CMFXECTS                                                 05153000
CMFLEND  EQU   CMFOVLAY+14                                              05154000
CMFLEXLN EQU   CMFOVLAY+12                                              05155000
CMFLHKLN EQU   CMFOVLAY+10                                              05156000
CMFLLKLN EQU   CMFOVLAY+8                                               05157000
CMFBYTAU EQU   CMFOVLAY+4                                               05158000
CMFBYTRK EQU   CMFOVLAY                                                 05159000
CMFLSSDS EQU   GVO+35                                                   05160000
@NM00137 EQU   CMFLITEX                                                 05161000
CMFLNOPF EQU   CMFLITEX                                                 05162000
CMFLSSDT EQU   CMFLITEX                                                 05163000
CMFLNTKA EQU   GVO+32                                                   05164000
CMFLNBTK EQU   GVO+30                                                   05165000
CMFLPHYB EQU   GVO+26                                                   05166000
CMFLHABA EQU   GVO+22                                                   05167000
CMFLHUBA EQU   GVO+18                                                   05168000
CMFLHKBA EQU   GVO+14                                                   05169000
CMFLNOEX EQU   GVO+13                                                   05170000
@NM00136 EQU   CMFLVLFL                                                 05171000
CMFLVLOV EQU   CMFLVLFL                                                 05172000
CMFLVLCN EQU   CMFLVLFL                                                 05173000
CMFLVLPR EQU   CMFLVLFL                                                 05174000
CMFLFLSQ EQU   GVO+10                                                   05175000
CTVDRSTT EQU   CTVDEXTN+4                                               05176000
CTVDIRTS EQU   CTVDEXTN                                                 05177000
CTVDSDCI EQU   CTVDIR+2                                                 05178000
CTVDSDLF EQU   CTVDSDSN+1                                               05179000
CTVDSDCV EQU   CTVDSDSN                                                 05180000
CTVEXTNN EQU   CTVEXTNT+2                                               05181000
CTVEXTT  EQU   CTVEXTNT                                                 05182000
CTVSQT   EQU   CTVDSPAC+18                                              05183000
CTVSPOPT EQU   CTVDSPAC+17                                              05184000
CTVNOEXT EQU   CTVDSPAC+16                                              05185000
@NM00135 EQU   CTVDSPFG                                                 05186000
CTVCATDF EQU   CTVDSPFG                                                 05187000
@NM00134 EQU   CTVDSPFG                                                 05188000
CTVAUTO  EQU   CTVDSPFG                                                 05189000
CTVUNIQ  EQU   CTVDSPFG                                                 05190000
CTVF1PTR EQU   CTVDSPAC+10                                              05191000
CTVF1TME EQU   CTVDSPAC+2                                               05192000
CTVDSPLF EQU   CTVDSPSN+1                                               05193000
CTVDSPCV EQU   CTVDSPSN                                                 05194000
CTVSMBIT EQU   CTVSPMAP+4                                               05195000
CTVSMLEN EQU   CTVSPMAP+2                                               05196000
CTVSMLF  EQU   CTVSMSN+1                                                05197000
CTVSMCV  EQU   CTVSMSN                                                  05198000
CTVEGOPT EQU   CTVRCTRL+6                                               05199000
CTVEXRCT EQU   CTVRCTRL+5                                               05200000
@NM00133 EQU   CTVEXRPT+3                                               05201000
CTVEXGCI EQU   CTVEXRPT                                                 05202000
CTVGOSEQ EQU   CTVGOPT+4                                                05203000
CTVGOGC  EQU   CTVGOGCI                                                 05204000
CTVGODEL EQU   CTVGOGCI                                                 05205000
CTVGOEXT EQU   CTVGOGCI                                                 05206000
CTVGODSP EQU   CTVGOCI+1                                                05207000
CTVGOFLG EQU   CTVGOCI                                                  05208000
CTVSPSXC EQU   CTVDSDIR+2                                               05209000
CTVSPSSN EQU   CTVDSDIR                                                 05210000
CTVDSXCT EQU   CTVDSGRP+7                                               05211000
@NM00132 EQU   CTVDSDFL                                                 05212000
CTVDSDCN EQU   CTVDSDFL                                                 05213000
CTVDSCID EQU   CTVDSGRP+3                                               05214000
CTVDSNEX EQU   CTVDSGRP+2                                               05215000
CTVDSGLF EQU   CTVDSGRP+1                                               05216000
CTVDSGCV EQU   CTVDSGRP                                                 05217000
CTVMAP   EQU   CTVDESGP+14                                              05218000
CTVMAPLN EQU   CTVDESGP+12                                              05219000
CTVDESHD EQU   CTVDESGP+10                                              05220000
CTVDESTK EQU   CTVDESGP+8                                               05221000
CTVSTHH  EQU   CTVSTDES+2                                               05222000
CTVSTCC  EQU   CTVSTDES                                                 05223000
CTVDESUU EQU   CTVDESGP+2                                               05224000
CTVDESLF EQU   CTVDESGP+1                                               05225000
CTVDESCV EQU   CTVDESGP                                                 05226000
CTVSPSQT EQU   CTVSPHDR+20                                              05227000
CTVSPSPO EQU   CTVSPHDR+19                                              05228000
CTVSPNEX EQU   CTVSPHDR+18                                              05229000
CTVSPNDS EQU   CTVSPHDR+16                                              05230000
@NM00131 EQU   CTVSPFLG                                                 05231000
CTVSPCDF EQU   CTVSPFLG                                                 05232000
CTVSPMCT EQU   CTVSPFLG                                                 05233000
CTVSPUCT EQU   CTVSPFLG                                                 05234000
CTVSPAUT EQU   CTVSPFLG                                                 05235000
CTVSPUNQ EQU   CTVSPFLG                                                 05236000
CTVF1ADR EQU   CTVSPHDR+10                                              05237000
CTVF1TIM EQU   CTVSPHDR+2                                               05238000
CTVSPHLF EQU   CTVSPHDR+1                                               05239000
CTVSPHCV EQU   CTVSPHDR                                                 05240000
@NM00130 EQU   CTVOLRCD+74                                              05241000
CTVSYEDS EQU   CTVOLRCD+73                                              05242000
CTVOLFLG EQU   CTVOLRCD+72                                              05243000
CTVTLFAC EQU   CTVDVCHR+18                                              05244000
CTVTLFLG EQU   CTVDVFLG                                                 05245000
@NM00129 EQU   CTVDVFLG                                                 05246000
CTVABFLG EQU   CTVDVFLG                                                 05247000
@NM00128 EQU   CTVDVFLG                                                 05248000
CTVBONK  EQU   CTVDVCHR+16                                              05249000
CTVBKLB  EQU   CTVBOKAB+1                                               05250000
CTVBKNLB EQU   CTVBOKAB                                                 05251000
CTVTRKSZ EQU   CTVDVCHR+12                                              05252000
CTVNOTRK EQU   CTVDVCHR+10                                              05253000
CTVNOCYL EQU   CTVDVCHR+8                                               05254000
CTVMXBLK EQU   CTVDVCHR+4                                               05255000
CTVDEVTY EQU   CTVDVCHR                                                 05256000
CTVOLTIM EQU   CTVOLRCD+44                                              05257000
CTVOLNME EQU   CTVOLRCD                                                 05258000
RTTOLFCT EQU   DEVCHARS+18                                              05259000
RTTOLFLG EQU   RTDVFLGS                                                 05260000
@NM00127 EQU   RTDVFLGS                                                 05261000
RTKABFLG EQU   RTDVFLGS                                                 05262000
@NM00126 EQU   RTDVFLGS                                                 05263000
RTBONK   EQU   DEVCHARS+16                                              05264000
RTBOKLB  EQU   RTBOKAB+1                                                05265000
RTBOKNLB EQU   RTBOKAB                                                  05266000
RTTRKSIZ EQU   DEVCHARS+12                                              05267000
RTNOTRKS EQU   DEVCHARS+10                                              05268000
RTNOCYLS EQU   DEVCHARS+8                                               05269000
RTMXDBLK EQU   DEVCHARS+4                                               05270000
RTCLSTYP EQU   RTDEVUCB+2                                               05271000
@NM00125 EQU   RTDEVUCB                                                 05272000
@NM00124 EQU   RGATTSG1                                                 05273000
RGATSUP1 EQU   RGATTSG1                                                 05274000
@NM00123 EQU   RGATTR1                                                  05275000
RGATTUPG EQU   RGATTR1                                                  05276000
CTGDSNUS EQU   CTGATR2                                                  05277000
@NM00122 EQU   CTGATR2                                                  05278000
CTGDSSSH EQU   CTGATR2                                                  05279000
CTGDSISH EQU   CTGATR2                                                  05280000
CTGTRKOV EQU   CTGATR1                                                  05281000
CTGDSTPX EQU   CTGATR1                                                  05282000
CTGDSINH EQU   CTGATR1                                                  05283000
CTGDSREC EQU   CTGATR1                                                  05284000
CTGDSERA EQU   CTGATR1                                                  05285000
CTGDSREU EQU   CTGATR1                                                  05286000
CTGDSUNQ EQU   CTGATR1                                                  05287000
CTGDSSPD EQU   CTGATR1                                                  05288000
SPCROUND EQU   SPCOPTNS                                                 05289000
SPCALXRQ EQU   SPCOPTNS                                                 05290000
SPCMXIGR EQU   SPCOPTNS                                                 05291000
SPCCNTIG EQU   SPCOPTNS                                                 05292000
@NM00121 EQU   SPCOPTNS                                                 05293000
SPCRQTYP EQU   SPCOPTNS                                                 05294000
SPCSECDQ EQU   SPACEPRM+3                                               05295000
SPCPRIMQ EQU   SPACEPRM                                                 05296000
LTVOLSER EQU   LTENTRY+2                                                05297000
LTRETCD2 EQU   LTRETCOD+1                                               05298000
LTRETCD1 EQU   LTRETCOD                                                 05299000
LTLENGTH EQU   USERLIST                                                 05300000
USERAREV EQU   USERAREC+2                                               05301000
USERAREL EQU   USERAREC                                                 05302000
USVRMDUL EQU   PASSGO+42                                                05303000
PASSATMP EQU   PASSGO+40                                                05304000
PASSPRMT EQU   PASSGO+32                                                05305000
READPW   EQU   PASSWORD+24                                              05306000
UPDATEPW EQU   PASSWORD+16                                              05307000
CIPW     EQU   PASSWORD+8                                               05308000
MASTERPW EQU   PASSWORD                                                 05309000
ASCI     EQU   ASGO+1                                                   05310000
ASTYPE   EQU   ASGO                                                     05311000
CVLSER   EQU   MWA+259                                                  05312000
TTR2     EQU   MWA+256                                                  05313000
BIN0     EQU   CVOLIND+3                                                05314000
TTR1     EQU   CVOLIND                                                  05315000
@NM00113 EQU   MWA+242                                                  05316000
FSN      EQU   VLST+10                                                  05317000
VOLSER   EQU   VLST+4                                                   05318000
DEVTYP   EQU   VLST                                                     05319000
VOLENTCT EQU   MWA                                                      05320000
RDDFVSER EQU   RDDFLIST+12                                              05321000
RDDFNNAM EQU   RDDFOVOL                                                 05322000
RDDFENT  EQU   RDDFENTW+1                                               05323000
@NM00112 EQU   RDDFFLGS                                                 05324000
RDDFDSTV EQU   RDDFFLGS                                                 05325000
@NM00111 EQU   RDDFFLGS                                                 05326000
RDDFNEWN EQU   RDDFFLGS                                                 05327000
RDDFOLDV EQU   RDDFFLGS                                                 05328000
RDDFTADV EQU   RDDFFLGS                                                 05329000
RDDFTDEL EQU   RDDFFLGS                                                 05330000
RDDFINST EQU   RDDFINSW+1                                               05331000
RDDFLENG EQU   RDDFINSW                                                 05332000
ACHKVOLS EQU   ACHKVOLW+1                                               05333000
@NM00110 EQU   ACHKFLG3                                                 05334000
ACHKVOL  EQU   ACHKFLG3                                                 05335000
@NM00109 EQU   ACHKFLG3                                                 05336000
ACHKPRF  EQU   ACHKFLG3                                                 05337000
@NM00108 EQU   ACHKFLG3                                                 05338000
ACHKCLN  EQU   ACHKCLNW+1                                               05339000
@NM00107 EQU   ACHKFLG2                                                 05340000
ACHKTRD  EQU   ACHKFLG2                                                 05341000
ACHKTUPD EQU   ACHKFLG2                                                 05342000
ACHKTCTL EQU   ACHKFLG2                                                 05343000
@NM00106 EQU   ACHKFLG2                                                 05344000
ACHKTALT EQU   ACHKFLG2                                                 05345000
ACHKCSA  EQU   ACHKFLG1                                                 05346000
ACHKLOGN EQU   ACHKFLG1                                                 05347000
ACHKLOGF EQU   ACHKFLG1                                                 05348000
@NM00105 EQU   ACHKFLG1                                                 05349000
ACHKDSTV EQU   ACHKFLG1                                                 05350000
@NM00104 EQU   ACHKFLG1                                                 05351000
@NM00103 EQU   ACHKFLG1                                                 05352000
@NM00102 EQU   ACHKFLG1                                                 05353000
ACHKINST EQU   ACHKINSW+1                                               05354000
ACHKLENG EQU   ACHKINSW                                                 05355000
CTGCVCC  EQU   CTGCV+50                                                 05356000
CTGCVDEV EQU   CTGCVDSN                                                 05357000
CTGCVVOL EQU   CTGCV                                                    05358000
CTGVLTTR EQU   CTGVLX+12                                                05359000
@NM00101 EQU   CTGVLX                                                   05360000
CTGVLSEQ EQU   CTGVL+10                                                 05361000
CTGVLDEV EQU   CTGVL+6                                                  05362000
CTGVLVOL EQU   CTGVL                                                    05363000
CTGWAGB  EQU   CTGWA+12                                                 05364000
CTGWAGCT EQU   CTGWA+10                                                 05365000
CTGWAUCT EQU   CTGWA+8                                                  05366000
CTGWAVCT EQU   CTGWA+6                                                  05367000
CTGWALV  EQU   CTGWA+4                                                  05368000
CTGFVWKA EQU   CTGFV+88                                                 05369000
CTGFVCPP EQU   CTGFVPWD                                                 05370000
CTGFVNAM EQU   CTGFV+80                                                 05371000
CTGFVUPG EQU   CTGFVGAT                                                 05372000
CTGFVEXT EQU   CTGFVLMT                                                 05373000
CTGFVLRS EQU   CTGFV+68                                                 05374000
CTGFVBUF EQU   CTGFV+64                                                 05375000
CTGFVATR EQU   CTGFV+60                                                 05376000
CTGFVFSN EQU   CTGFVAMD                                                 05377000
CTGFVTTR EQU   CTGFVSPC                                                 05378000
CTGFVDVT EQU   CTGFV+48                                                 05379000
CTGFVRNG EQU   CTGFV+44                                                 05380000
CTGFVVLT EQU   CTGFV+40                                                 05381000
CTGFVCRE EQU   CTGFV+36                                                 05382000
CTGFVEXP EQU   CTGFV+32                                                 05383000
CTGFVOWN EQU   CTGFV+28                                                 05384000
CTGFVSTY EQU   CTGFV+24                                                 05385000
CTGFVENT EQU   CTGFV+20                                                 05386000
CTGFVIND EQU   CTGFV+16                                                 05387000
CTGFVVCH EQU   CTGFV+12                                                 05388000
CTGFVICH EQU   CTGFV+8                                                  05389000
CTGFVDCH EQU   CTGFV+4                                                  05390000
@NM00100 EQU   CTGFV+3                                                  05391000
CTGFVELM EQU   CTGFV+2                                                  05392000
@NM00099 EQU   CTGFVPRO                                                 05393000
CTGFVROF EQU   CTGFVPRO                                                 05394000
CTGFVRON EQU   CTGFVPRO                                                 05395000
CTGFVDRC EQU   CTGFVPRO                                                 05396000
CTGFVNDC EQU   CTGFVPRO                                                 05397000
CTGFVRVL EQU   CTGFVPRO                                                 05398000
CTGFVAVL EQU   CTGFVPRO                                                 05399000
CTGFVTYP EQU   CTGFV                                                    05400000
CAXWNQID EQU   CAXHRPLW+2                                               05401000
CAXHRPLC EQU   CAXHRPLW                                                 05402000
CAXASCBP EQU   IGGCAXWA+124                                             05403000
@NM00098 EQU   CAXECB+1                                                 05404000
@NM00097 EQU   CAXECBHB                                                 05405000
CAXECBPB EQU   CAXECBHB                                                 05406000
CAXECBWB EQU   CAXECBHB                                                 05407000
CAXRACP  EQU   IGGCAXWA+116                                             05408000
CAXCRACB EQU   IGGCAXWA+112                                             05409000
CAXJDE   EQU   IGGCAXWA+108                                             05410000
CAXPLOCK EQU   CAXCCA                                                   05411000
CAXOPEWA EQU   IGGCAXWA+100                                             05412000
@NM00096 EQU   COPTS                                                    05413000
CENLST   EQU   COPTS                                                    05414000
@NM00095 EQU   CAXCNAM+22                                               05415000
CAXRADDN EQU   CAXCNAM+14                                               05416000
CAXRATEP EQU   CAXCNAM+10                                               05417000
CAXRACTS EQU   CAXCNAM+6                                                05418000
CAXVOLID EQU   CAXCNAM                                                  05419000
CAXRPL   EQU   IGGCAXWA+48                                              05420000
CAXRPLCT EQU   IGGCAXWA+46                                              05421000
CAXASID  EQU   IGGCAXWA+44                                              05422000
CAXFDCI  EQU   CAXCCR+9                                                 05423000
CAXCDCI  EQU   CAXCCR+6                                                 05424000
CAXNFCI  EQU   CAXCCR+3                                                 05425000
CAXHACI  EQU   CAXCCR                                                   05426000
CAXUCB   EQU   IGGCAXWA+28                                              05427000
CAXACB   EQU   IGGCAXWA+24                                              05428000
CAXDRWP  EQU   IGGCAXWA+20                                              05429000
CAXSCHWA EQU   IGGCAXWA+16                                              05430000
CAXATIOT EQU   IGGCAXWA+12                                              05431000
CAXACT   EQU   IGGCAXWA+11                                              05432000
@NM00094 EQU   CAXFLG3                                                  05433000
CAXF3B6  EQU   CAXFLG3                                                  05434000
CAXF3B5  EQU   CAXFLG3                                                  05435000
CAXRAC   EQU   CAXFLG3                                                  05436000
@NM00093 EQU   CAXFLG3                                                  05437000
CAXF3ANE EQU   CAXFLG3                                                  05438000
CAXF3AT  EQU   CAXFLG3                                                  05439000
CAXF2VTU EQU   CAXFLG2                                                  05440000
CAXF2CA  EQU   CAXFLG2                                                  05441000
CAXF2CLR EQU   CAXFLG2                                                  05442000
CAXF2IOE EQU   CAXFLG2                                                  05443000
CAXF2NCR EQU   CAXFLG2                                                  05444000
CAXF2NDD EQU   CAXFLG2                                                  05445000
CAXF2DT  EQU   CAXFLG2                                                  05446000
CAXCMR   EQU   CAXFLGS                                                  05447000
CAXCMP   EQU   CAXFLGS                                                  05448000
CAXEOV   EQU   CAXFLGS                                                  05449000
CAXCLS   EQU   CAXFLGS                                                  05450000
CAXOPN   EQU   CAXFLGS                                                  05451000
CAXBLD   EQU   CAXFLGS                                                  05452000
@NM00092 EQU   IGGCAXWA+1                                               05453000
CAXID    EQU   IGGCAXWA                                                 05454000
CBSVPTR  EQU   CBSVSRT+4                                                05455000
CBSVUSE  EQU   CBSVSRT                                                  05456000
CBSCRTCB EQU   AMCBS+28                                                 05457000
CBSCRACA EQU   AMCBS+24                                                 05458000
CBSMCUCB EQU   CBSCMP                                                   05459000
CBSCBP   EQU   AMCBS+12                                                 05460000
CBSACB   EQU   AMCBS+8                                                  05461000
CBSMCSTA EQU   AMCBS+4                                                  05462000
CBSSIZ   EQU   AMCBS+2                                                  05463000
CBSID    EQU   AMCBS                                                    05464000
ACBAPID  EQU   ACBCOMN+72                                               05465000
ACBCBMWA EQU   ACBCOMN+68                                               05466000
ACBLRECL EQU   ACBCOMN+62                                               05467000
ACBMSGLN EQU   ACBBLKSZ                                                 05468000
ACBBUFSP EQU   ACBCOMN+56                                               05469000
@NM00089 EQU   ACBUJFCB+1                                               05470000
ACBOPTN  EQU   ACBUJFCB                                                 05471000
@NM00088 EQU   ACBINFL2                                                 05472000
ACBCBIC  EQU   ACBINFL2                                                 05473000
@NM00087 EQU   ACBINFL2                                                 05474000
ACBBYPSS EQU   ACBINFL1                                                 05475000
ACBSDS   EQU   ACBVVIC                                                  05476000
ACBUCRA  EQU   ACBINFL1                                                 05477000
ACBSCRA  EQU   ACBINFL1                                                 05478000
ACBCAT   EQU   ACBINFL1                                                 05479000
ACBIJRQE EQU   ACBINFL1                                                 05480000
ACBJEPS  EQU   ACBINFL1                                                 05481000
@NM00086 EQU   ACBINFL1                                                 05482000
ACBERFLG EQU   ACBCOMN+49                                               05483000
ACBBUSY  EQU   ACBIOSFG                                                 05484000
ACBLOCK  EQU   ACBEXFG                                                  05485000
@NM00085 EQU   ACBOFLGS                                                 05486000
ACBDSERR EQU   ACBOFLGS                                                 05487000
ACBEOV   EQU   ACBOFLGS                                                 05488000
@NM00084 EQU   ACBOFLGS                                                 05489000
ACBDEB   EQU   ACBDDNM+5                                                05490000
ACBERFL  EQU   ACBDDNM+4                                                05491000
ACBAM    EQU   ACBAMETH                                                 05492000
ACBINFL  EQU   ACBDDNM+2                                                05493000
ACBTIOT  EQU   ACBDDNM                                                  05494000
ACBUEL   EQU   ACBEXLST                                                 05495000
ACBMSGAR EQU   ACBCOMN+28                                               05496000
@NM00083 EQU   ACBDSORG+1                                               05497000
@NM00082 EQU   ACBDSORG                                                 05498000
ACBOPTJ  EQU   ACBDVIND                                                 05499000
ACBCRNRE EQU   ACBCROPS                                                 05500000
ACBCRNCK EQU   ACBCROPS                                                 05501000
ACBASA   EQU   ACBCCTYP                                                 05502000
@NM00081 EQU   ACBCCTYP                                                 05503000
ACBTRCID EQU   ACBCCTYP                                                 05504000
@NM00080 EQU   ACBRECFM                                                 05505000
ACBRECAF EQU   ACBRECFM                                                 05506000
ACBJBUF  EQU   ACBBUFPL+2                                               05507000
ACBMACR4 EQU   ACBBUFPL+1                                               05508000
@NM00079 EQU   ACBMACR3                                                 05509000
ACBNCFX  EQU   ACBMACR3                                                 05510000
ACBSIS   EQU   ACBMACR3                                                 05511000
ACBDFR   EQU   ACBMACR3                                                 05512000
ACBICI   EQU   ACBMACR3                                                 05513000
ACBGSR   EQU   ACBMACR3                                                 05514000
ACBLSR   EQU   ACBMACR3                                                 05515000
@NM00078 EQU   ACBMACR3                                                 05516000
ACBBSTNO EQU   ACBCOMN+14                                               05517000
ACBAIX   EQU   ACBMACR2                                                 05518000
ACBDSN   EQU   ACBMACR2                                                 05519000
ACBRST   EQU   ACBMACR2                                                 05520000
ACBLOGON EQU   ACBMACR2                                                 05521000
ACBSKP   EQU   ACBMACR2                                                 05522000
@NM00077 EQU   ACBMACR2                                                 05523000
ACBUBF   EQU   ACBMACR1                                                 05524000
ACBDIR   EQU   ACBMACR1                                                 05525000
ACBBLK   EQU   ACBCNV                                                   05526000
ACBADD   EQU   ACBADR                                                   05527000
ACBKEY   EQU   ACBMACR1                                                 05528000
ACBIBCT  EQU   ACBJWA                                                   05529000
ACBLEN2  EQU   ACBLENG2                                                 05530000
ACBSTYP  EQU   ACBCOMN+1                                                05531000
@NM00052 EQU   TCBXTNT2+32                                              05532000
TCBRV181 EQU   TCBRV173                                                 05533000
TCBRV180 EQU   TCBRV173                                                 05534000
TCBRV179 EQU   TCBRV173                                                 05535000
TCBRV178 EQU   TCBRV173                                                 05536000
TCBRV177 EQU   TCBRV173                                                 05537000
TCBRV176 EQU   TCBRV173                                                 05538000
TCBRV175 EQU   TCBRV173                                                 05539000
TCBRV174 EQU   TCBRV173                                                 05540000
TCBRV172 EQU   TCBRV164                                                 05541000
TCBRV171 EQU   TCBRV164                                                 05542000
TCBRV170 EQU   TCBRV164                                                 05543000
TCBRV169 EQU   TCBRV164                                                 05544000
TCBRV168 EQU   TCBRV164                                                 05545000
TCBRV167 EQU   TCBRV164                                                 05546000
TCBRV166 EQU   TCBRV164                                                 05547000
TCBRV165 EQU   TCBRV164                                                 05548000
TCBRV163 EQU   TCBRV155                                                 05549000
TCBRV162 EQU   TCBRV155                                                 05550000
TCBRV161 EQU   TCBRV155                                                 05551000
TCBRV160 EQU   TCBRV155                                                 05552000
TCBRV159 EQU   TCBRV155                                                 05553000
TCBRV158 EQU   TCBRV155                                                 05554000
TCBRV157 EQU   TCBRV155                                                 05555000
TCBRV156 EQU   TCBRV155                                                 05556000
TCBRV154 EQU   TCBRV146                                                 05557000
TCBRV153 EQU   TCBRV146                                                 05558000
TCBRV152 EQU   TCBRV146                                                 05559000
TCBRV151 EQU   TCBRV146                                                 05560000
TCBRV150 EQU   TCBRV146                                                 05561000
TCBRV149 EQU   TCBRV146                                                 05562000
TCBRV148 EQU   TCBRV146                                                 05563000
TCBRV147 EQU   TCBRV146                                                 05564000
TCBRV145 EQU   TCBXTNT2+26                                              05565000
TCBRV144 EQU   TCBXTNT2+24                                              05566000
TCBCAUF  EQU   TCBXTNT2+20                                              05567000
TCBRV142 EQU   TCBXTNT2+16                                              05568000
TCBRSV49 EQU   TCBXTNT2+12                                              05569000
TCBEVENT EQU   TCBXTNT2+8                                               05570000
TCBRCMP  EQU   TCBXTNT2+5                                               05571000
TCBRSVAB EQU   TCBXTNT2+4                                               05572000
TCBGTFA  EQU   TCBGTF+1                                                 05573000
TCBRSV47 EQU   TCBTFLG                                                  05574000
TCBRSV46 EQU   TCBTFLG                                                  05575000
TCBRSV45 EQU   TCBTFLG                                                  05576000
TCBRSV44 EQU   TCBTFLG                                                  05577000
TCBRSV43 EQU   TCBTFLG                                                  05578000
TCBDSPIT EQU   TCBTFLG                                                  05579000
TCBERRTN EQU   TCBTFLG                                                  05580000
TCBASYNC EQU   TCBTFLG                                                  05581000
@NM00051 EQU   TCB+296                                                  05582000
TCBSVCA2 EQU   TCB+292                                                  05583000
TCBSWASA EQU   TCB+288                                                  05584000
TCBDBTB  EQU   TCB+284                                                  05585000
TCBRPT   EQU   TCB+280                                                  05586000
TCBRV141 EQU   TCBRV133                                                 05587000
TCBRV140 EQU   TCBRV133                                                 05588000
TCBRV139 EQU   TCBRV133                                                 05589000
TCBRV138 EQU   TCBRV133                                                 05590000
TCBRV137 EQU   TCBRV133                                                 05591000
TCBRV136 EQU   TCBRV133                                                 05592000
TCBRV135 EQU   TCBRV133                                                 05593000
TCBRV134 EQU   TCBRV133                                                 05594000
TCBRV132 EQU   TCBRV124                                                 05595000
TCBRV131 EQU   TCBRV124                                                 05596000
TCBRV130 EQU   TCBRV124                                                 05597000
TCBRV129 EQU   TCBRV124                                                 05598000
TCBRV128 EQU   TCBRV124                                                 05599000
TCBRV127 EQU   TCBRV124                                                 05600000
TCBRV126 EQU   TCBRV124                                                 05601000
TCBRV125 EQU   TCBRV124                                                 05602000
TCBRV123 EQU   TCBFBYT2                                                 05603000
TCBRV122 EQU   TCBFBYT2                                                 05604000
TCBECBNV EQU   TCBFBYT2                                                 05605000
TCBSSSYN EQU   TCBFBYT2                                                 05606000
TCBFPRAP EQU   TCBFBYT2                                                 05607000
TCBFDW   EQU   TCBFBYT2                                                 05608000
TCBFMW   EQU   TCBFBYT2                                                 05609000
TCBCNCB  EQU   TCBFBYT2                                                 05610000
TCBLLH   EQU   TCBFBYT1                                                 05611000
TCBRV113 EQU   TCBFBYT1                                                 05612000
TCBEOT   EQU   TCBFBYT1                                                 05613000
TCBRTM2  EQU   TCBFBYT1                                                 05614000
TCBPGNLY EQU   TCBFBYT1                                                 05615000
TCBNDIOS EQU   TCBFBYT1                                                 05616000
TCBRV327 EQU   TCBFBYT1                                                 05617000
TCBEOTFM EQU   TCBFBYT1                                                 05618000
TCBAFFN  EQU   TCB+274                                                  05619000
TCBRV326 EQU   TCB+272                                                  05620000
TCBUKYSP EQU   TCB+268                                                  05621000
TCBMODE  EQU   TCBESTAE+3                                               05622000
TCBERTYP EQU   TCBESTAE+2                                               05623000
TCBRV314 EQU   TCBESTRM                                                 05624000
TCBRV313 EQU   TCBESTRM                                                 05625000
TCBRV312 EQU   TCBESTRM                                                 05626000
TCBRV311 EQU   TCBESTRM                                                 05627000
TCBRV310 EQU   TCBESTRM                                                 05628000
TCBRV309 EQU   TCBESTRM                                                 05629000
TCBRV308 EQU   TCBESTRM                                                 05630000
TCBETERM EQU   TCBESTRM                                                 05631000
TCBSCBKY EQU   TCBESTAE                                                 05632000
TCBRTM12 EQU   TCB+260                                                  05633000
TCBTCBID EQU   TCB+256                                                  05634000
TCBSTAFX EQU   TCBSTAWA                                                 05635000
TCBSWA   EQU   TCB+248                                                  05636000
TCBFOEA  EQU   TCBFOE+1                                                 05637000
TCBRSV42 EQU   TCBFOE                                                   05638000
TCBCCPVI EQU   TCBXSCT+2                                                05639000
TCBRV325 EQU   TCBXSCT+1                                                05640000
TCBRV324 EQU   TCBXSCT1                                                 05641000
TCBRV323 EQU   TCBXSCT1                                                 05642000
TCBRV322 EQU   TCBXSCT1                                                 05643000
TCBRV321 EQU   TCBXSCT1                                                 05644000
TCBRV320 EQU   TCBXSCT1                                                 05645000
TCBRV319 EQU   TCBXSCT1                                                 05646000
TCBS3A   EQU   TCBXSCT1                                                 05647000
TCBACTIV EQU   TCBXSCT1                                                 05648000
TCBRSV41 EQU   TCB+239                                                  05649000
TCBTID   EQU   TCB+238                                                  05650000
TCBRSVAA EQU   TCB+237                                                  05651000
TCBABCUR EQU   TCB+236                                                  05652000
TCBTMSAV EQU   TCB+232                                                  05653000
TCBIOTIM EQU   TCB+228                                                  05654000
TCBRTWA  EQU   TCB+224                                                  05655000
TCBBACK  EQU   TCB+220                                                  05656000
TCBTIRB  EQU   TCB+216                                                  05657000
TCBAECB  EQU   TCB+212                                                  05658000
TCBEXT2A EQU   TCBEXT2+1                                                05659000
TCBRSV39 EQU   TCBEXT2                                                  05660000
TCBSTMCT EQU   TCB+207                                                  05661000
TCBSYSCT EQU   TCB+206                                                  05662000
TCBRSV37 EQU   TCB+205                                                  05663000
TCBEXSVC EQU   TCBDAR                                                   05664000
TCBDARMS EQU   TCBDAR                                                   05665000
TCBDARWT EQU   TCBDAR                                                   05666000
TCBDARO  EQU   TCBDAR                                                   05667000
TCBDARMC EQU   TCBDARC                                                  05668000
TCBDARD  EQU   TCBDAR                                                   05669000
TCBDARS  EQU   TCBDAR                                                   05670000
TCBDARP  EQU   TCBDAR                                                   05671000
TCBGTOFM EQU   TCBFLGS7                                                 05672000
TCBADMP  EQU   TCBFLGS7                                                 05673000
TCBRSTSK EQU   TCBFLGS7                                                 05674000
TCBSVCS  EQU   TCBFLGS7                                                 05675000
TCBSTACK EQU   TCBFLGS7                                                 05676000
TCBRSV34 EQU   TCBFLGS7                                                 05677000
TCBRSV33 EQU   TCBFLGS7                                                 05678000
TCBGPECB EQU   TCBFLGS7                                                 05679000
TCBNTJS  EQU   TCBFLGS6                                                 05680000
TCBAPG   EQU   TCBFLGS6                                                 05681000
TCBMIGR  EQU   TCBFLGS6                                                 05682000
TCBRV303 EQU   TCBFLGS6                                                 05683000
TCBSPVLK EQU   TCBFLGS6                                                 05684000
TCBCPU   EQU   TCBFLGS6                                                 05685000
TCBPIE17 EQU   TCBFLGS6                                                 05686000
TCBRV    EQU   TCBFLGS6                                                 05687000
TCBRSV79 EQU   TCBNDSP5                                                 05688000
TCBRSV78 EQU   TCBNDSP5                                                 05689000
TCBRSV77 EQU   TCBNDSP5                                                 05690000
TCBRSV76 EQU   TCBNDSP5                                                 05691000
TCBRSV75 EQU   TCBNDSP5                                                 05692000
TCBRSV74 EQU   TCBNDSP5                                                 05693000
TCBRSV95 EQU   TCBNDSP5                                                 05694000
TCBRSV94 EQU   TCBNDSP5                                                 05695000
TCBRSV93 EQU   TCBNDSP4                                                 05696000
TCBRSV92 EQU   TCBNDSP4                                                 05697000
TCBRSV91 EQU   TCBNDSP4                                                 05698000
TCBRSV90 EQU   TCBNDSP4                                                 05699000
TCBRSV89 EQU   TCBNDSP4                                                 05700000
TCBRSV88 EQU   TCBNDSP4                                                 05701000
TCBRSV87 EQU   TCBNDSP4                                                 05702000
TCBRSV86 EQU   TCBNDSP4                                                 05703000
TCBEXT1A EQU   TCBEXT1+1                                                05704000
TCBRSV32 EQU   TCBEXT1                                                  05705000
TCBEXCPD EQU   TCB+192                                                  05706000
TCBIOBRC EQU   TCB+188                                                  05707000
TCBDDWTC EQU   TCB+186                                                  05708000
TCBDDEXC EQU   TCB+184                                                  05709000
TCBJSCBB EQU   TCBJSCB+1                                                05710000
@NM00050 EQU   TCBRECDE                                                 05711000
TCBREC   EQU   TCBRECDE                                                 05712000
TCBMDIDS EQU   TCB+176                                                  05713000
TCBNDINT EQU   TCBNDSP3                                                 05714000
TCBRSV27 EQU   TCBNDSP3                                                 05715000
TCBRSV26 EQU   TCBNDSP3                                                 05716000
TCBRSV25 EQU   TCBNDSP3                                                 05717000
TCBRSV24 EQU   TCBNDSP3                                                 05718000
TCBSRBND EQU   TCBNDSP3                                                 05719000
TCBRV302 EQU   TCBNDSP3                                                 05720000
TCBLJSND EQU   TCBNDSP3                                                 05721000
TCBABE   EQU   TCBNDSP2                                                 05722000
TCBDSS   EQU   TCBNDSP2                                                 05723000
TCBOWAIT EQU   TCBNDSP2                                                 05724000
TCBIWAIT EQU   TCBNDSP2                                                 05725000
TCBNDTS  EQU   TCBNDSP2                                                 05726000
TCBNDSVC EQU   TCBNDSP2                                                 05727000
TCBSTPP  EQU   TCBNDSP2                                                 05728000
TCBABD   EQU   TCBNDSP2                                                 05729000
TCBRSV22 EQU   TCBNDSP1                                                 05730000
TCBPIEND EQU   TCBNDSP1                                                 05731000
TCBTPSP  EQU   TCBNDSP1                                                 05732000
TCBDDRND EQU   TCBNDSP1                                                 05733000
TCBRSPND EQU   TCBNDSP1                                                 05734000
TCBRSTND EQU   TCBNDSP1                                                 05735000
TCBDARPN EQU   TCBNDSP1                                                 05736000
TCBDARTN EQU   TCBNDSP1                                                 05737000
TCBNDSP0 EQU   TCBNDSP                                                  05738000
TCBUSER  EQU   TCB+168                                                  05739000
TCBTCTB  EQU   TCBTCT+1                                                 05740000
TCBRSV9C EQU   TCBTCTGF                                                 05741000
TCBRSV9B EQU   TCBTCTGF                                                 05742000
TCBRSV9A EQU   TCBTCTGF                                                 05743000
TCBRSV99 EQU   TCBTCTGF                                                 05744000
TCBRSV98 EQU   TCBTCTGF                                                 05745000
TCBRSV97 EQU   TCBTCTGF                                                 05746000
TCBRSV20 EQU   TCBTCTGF                                                 05747000
TCBSMFGF EQU   TCBTCTGF                                                 05748000
TCBSTABB EQU   TCBSTAB+1                                                05749000
TCBSTCUR EQU   TCBNSTAE                                                 05750000
TCBRV301 EQU   TCBNSTAE                                                 05751000
TCBSYNCH EQU   TCBNSTAE                                                 05752000
TCBHALT  EQU   TCBNSTAE                                                 05753000
TCBPPSUP EQU   TCBNSTAE                                                 05754000
TCB33E   EQU   TCBNSTAE                                                 05755000
TCBQUIES EQU   TCBNSTAE                                                 05756000
TCBSTABE EQU   TCBNSTAE                                                 05757000
TCBAQE   EQU   TCB+156                                                  05758000
TCBPQE   EQU   TCB+152                                                  05759000
TCBTSDP  EQU   TCB+151                                                  05760000
TCBTSLP  EQU   TCB+150                                                  05761000
TCBSTPCT EQU   TCB+149                                                  05762000
TCBCPUBN EQU   TCBTSFLG                                                 05763000
TCBDYDSP EQU   TCBTSFLG                                                 05764000
TCBRSV18 EQU   TCBTSFLG                                                 05765000
TCBRSV17 EQU   TCBTSFLG                                                 05766000
TCBTIOTG EQU   TCBTSFLG                                                 05767000
TCBATT   EQU   TCBTSFLG                                                 05768000
TCBSTPPR EQU   TCBTSFLG                                                 05769000
TCBRV300 EQU   TCBTSTSK                                                 05770000
TCBECB   EQU   TCB+144                                                  05771000
TCBIQE   EQU   TCB+140                                                  05772000
TCBLTC   EQU   TCB+136                                                  05773000
TCBOTC   EQU   TCB+132                                                  05774000
TCBNTC   EQU   TCB+128                                                  05775000
TCBJSTCA EQU   TCBJSTCB+1                                               05776000
TCBRSV16 EQU   TCBJSTCB                                                 05777000
TCBTQET  EQU   TCBTME                                                   05778000
TCBTCB   EQU   TCB+116                                                  05779000
TCBFSAB  EQU   TCBFSA+1                                                 05780000
TCBQEL   EQU   TCBFSA                                                   05781000
TCBGRS15 EQU   TCBGRS+60                                                05782000
TCBGRS14 EQU   TCBGRS+56                                                05783000
TCBGRS13 EQU   TCBGRS+52                                                05784000
TCBGRS12 EQU   TCBGRS+48                                                05785000
TCBGRS11 EQU   TCBGRS+44                                                05786000
TCBGRS10 EQU   TCBGRS+40                                                05787000
TCBGRS9  EQU   TCBGRS+36                                                05788000
TCBGRS8  EQU   TCBGRS+32                                                05789000
TCBGRS7  EQU   TCBGRS+28                                                05790000
TCBGRS6  EQU   TCBGRS+24                                                05791000
TCBGRS5  EQU   TCBGRS+20                                                05792000
TCBGRS4  EQU   TCBGRS+16                                                05793000
TCBGRS3  EQU   TCBGRS+12                                                05794000
TCBGRS2  EQU   TCBGRS+8                                                 05795000
TCBGRS1  EQU   TCBGRS+4                                                 05796000
TCBGRS0  EQU   TCBGRS                                                   05797000
TCBJPQB  EQU   TCBJPQ+1                                                 05798000
TCBRSV15 EQU   TCBPURGE                                                 05799000
TCBRSV14 EQU   TCBPURGE                                                 05800000
TCBRSV13 EQU   TCBPURGE                                                 05801000
TCBRSV12 EQU   TCBPURGE                                                 05802000
TCBRSV11 EQU   TCBPURGE                                                 05803000
TCBRSV10 EQU   TCBPURGE                                                 05804000
TCBRSV09 EQU   TCBPURGE                                                 05805000
TCBJPQF  EQU   TCBPURGE                                                 05806000
TCBJLB   EQU   TCB+40                                                   05807000
TCBLLS   EQU   TCB+36                                                   05808000
TCBDSP   EQU   TCB+35                                                   05809000
TCBLMP   EQU   TCB+34                                                   05810000
TCBPNDSP EQU   TCBFLGS5                                                 05811000
TCBFCD1  EQU   TCBFLGS5                                                 05812000
TCBSTP   EQU   TCBFLGS5                                                 05813000
TCBSYS   EQU   TCBFLGS5                                                 05814000
TCBANDSP EQU   TCBFLGS5                                                 05815000
TCBPAGE  EQU   TCBFLGS5                                                 05816000
TCBUXNDF EQU   TCBABWF                                                  05817000
TCBFC    EQU   TCBFLGS5                                                 05818000
TCBONDSP EQU   TCBFLGS4                                                 05819000
TCBMPCND EQU   TCBFLGS4                                                 05820000
TCBMPCVQ EQU   TCBFLGS4                                                 05821000
TCBUXNDV EQU   TCBFLGS4                                                 05822000
TCBHNDSP EQU   TCBFLGS4                                                 05823000
TCBRQENA EQU   TCBFLGS4                                                 05824000
TCBSER   EQU   TCBFLGS4                                                 05825000
TCBNDUMP EQU   TCBFLGS4                                                 05826000
TCBDWSTA EQU   TCBFLGS3                                                 05827000
TCBRSV08 EQU   TCBFLGS3                                                 05828000
TCBRSV07 EQU   TCBFLGS3                                                 05829000
TCBRSV06 EQU   TCBFLGS3                                                 05830000
TCBABGM  EQU   TCBFLGS3                                                 05831000
TCBABTRM EQU   TCBFLGS3                                                 05832000
TCBADINP EQU   TCBFLGS3                                                 05833000
TCBFSM   EQU   TCBFLGS3                                                 05834000
TCBFTS   EQU   TCBFLGS2                                                 05835000
TCBFETXR EQU   TCBFLGS2                                                 05836000
TCBFDSOP EQU   TCBFLGS2                                                 05837000
TCBFJMC  EQU   TCBFLGS2                                                 05838000
TCBFSMC  EQU   TCBFLGS2                                                 05839000
TCBFABOP EQU   TCBFLGS2                                                 05840000
TCBFSTI  EQU   TCBFLGS2                                                 05841000
TCBFOINP EQU   TCBFLGS2                                                 05842000
TCBFX    EQU   TCBFLGS1                                                 05843000
TCBFS    EQU   TCBFLGS1                                                 05844000
TCBFT    EQU   TCBFLGS1                                                 05845000
TCBPDUMP EQU   TCBFLGS1                                                 05846000
TCBNONPR EQU   TCBFLGS1                                                 05847000
TCBFERA  EQU   TCBFLGS1                                                 05848000
TCBFE    EQU   TCBFLGS1                                                 05849000
TCBFA    EQU   TCBFLGS1                                                 05850000
TCBZERO  EQU   TCBPKF                                                   05851000
TCBFLAG  EQU   TCBPKF                                                   05852000
TCBMSSB  EQU   TCBMSS+1                                                 05853000
TCBRSV03 EQU   TCBMSS                                                   05854000
TCBTRNB  EQU   TCBTRN+1                                                 05855000
TCBRSV02 EQU   TCBABF                                                   05856000
TCBOLTEP EQU   TCBABF                                                   05857000
TCBTCP   EQU   TCBABF                                                   05858000
TCBTCPP  EQU   TCBABF                                                   05859000
TCBRSV01 EQU   TCBABF                                                   05860000
TCBGRPH  EQU   TCBABF                                                   05861000
TCBNOCHK EQU   TCBABF                                                   05862000
TCBMOD91 EQU   TCBABF                                                   05863000
TCBCMPC  EQU   TCBCMP+1                                                 05864000
TCBRV318 EQU   TCBCMSG                                                  05865000
TCBRV317 EQU   TCBCIND                                                  05866000
TCBRV316 EQU   TCBCWTO                                                  05867000
TCBCASID EQU   TCBCDBL                                                  05868000
TCBNOCC  EQU   TCBSTCC                                                  05869000
TCBDMPO  EQU   TCBCPP                                                   05870000
TCBCSTEP EQU   TCBCMPF                                                  05871000
TCBCREQ  EQU   TCBCMPF                                                  05872000
TCBDEB   EQU   TCB+8                                                    05873000
TCBPIEA  EQU   TCBPIE+1                                                 05874000
TCBPM    EQU   TCBPMASK                                                 05875000
@NM00049 EQU   TCBPMASK                                                 05876000
TCBRBP   EQU   TCB                                                      05877000
TCBFRS6  EQU   TCBFRS+24                                                05878000
TCBFRS4  EQU   TCBFRS+16                                                05879000
TCBFRS2  EQU   TCBFRS+8                                                 05880000
TCBFRS0  EQU   TCBFRS                                                   05881000
NEXTTCB  EQU   TCBWORDS                                                 05882000
CVTLEVL  EQU   CVTRELNO+2                                               05883000
CVTNUMB  EQU   CVTRELNO                                                 05884000
CVTMDL   EQU   CVTFIX+250                                               05885000
@NM00048 EQU   CVTFIX+248                                               05886000
@NM00047 EQU   CVTFIX                                                   05887000
CVTRV482 EQU   CVTXTNT2+128                                             05888000
CVTRV481 EQU   CVTXTNT2+124                                             05889000
CVTRV480 EQU   CVTXTNT2+120                                             05890000
CVTRV479 EQU   CVTXTNT2+118                                             05891000
CVTRV478 EQU   CVTXTNT2+117                                             05892000
CVTRV477 EQU   CVTXTNT2+116                                             05893000
CVTRV476 EQU   CVTXTNT2+115                                             05894000
CVTRV475 EQU   CVTXTNT2+114                                             05895000
CVTRV474 EQU   CVTRV466                                                 05896000
CVTRV473 EQU   CVTRV466                                                 05897000
CVTRV472 EQU   CVTRV466                                                 05898000
CVTRV471 EQU   CVTRV466                                                 05899000
CVTRV470 EQU   CVTRV466                                                 05900000
CVTRV469 EQU   CVTRV466                                                 05901000
CVTRV468 EQU   CVTRV466                                                 05902000
CVTRV467 EQU   CVTRV466                                                 05903000
CVTRV465 EQU   CVTRV457                                                 05904000
CVTRV464 EQU   CVTRV457                                                 05905000
CVTRV463 EQU   CVTRV457                                                 05906000
CVTRV462 EQU   CVTRV457                                                 05907000
CVTRV461 EQU   CVTRV457                                                 05908000
CVTRV460 EQU   CVTRV457                                                 05909000
CVTRV459 EQU   CVTRV457                                                 05910000
CVTRV458 EQU   CVTRV457                                                 05911000
CVTRV456 EQU   CVTXTNT2+108                                             05912000
CVTRV455 EQU   CVTXTNT2+104                                             05913000
CVTRV454 EQU   CVTXTNT2+100                                             05914000
CVTRV453 EQU   CVTXTNT2+96                                              05915000
CVTRV452 EQU   CVTXTNT2+94                                              05916000
CVTRV451 EQU   CVTXTNT2+92                                              05917000
CVTRV450 EQU   CVTXTNT2+90                                              05918000
CVTRV449 EQU   CVTXTNT2+88                                              05919000
CVTRV448 EQU   CVTXTNT2+87                                              05920000
CVTRV447 EQU   CVTXTNT2+86                                              05921000
CVTRV446 EQU   CVTRV438                                                 05922000
CVTRV445 EQU   CVTRV438                                                 05923000
CVTRV444 EQU   CVTRV438                                                 05924000
CVTRV443 EQU   CVTRV438                                                 05925000
CVTRV442 EQU   CVTRV438                                                 05926000
CVTRV441 EQU   CVTRV438                                                 05927000
CVTRV440 EQU   CVTRV438                                                 05928000
CVTRV439 EQU   CVTRV438                                                 05929000
CVTRV437 EQU   CVTRV429                                                 05930000
CVTRV436 EQU   CVTRV429                                                 05931000
CVTRV435 EQU   CVTRV429                                                 05932000
CVTRV434 EQU   CVTRV429                                                 05933000
CVTRV433 EQU   CVTRV429                                                 05934000
CVTRV432 EQU   CVTRV429                                                 05935000
CVTRV431 EQU   CVTRV429                                                 05936000
CVTRV430 EQU   CVTRV429                                                 05937000
CVTRV428 EQU   CVTXTNT2+80                                              05938000
CVTRV427 EQU   CVTXTNT2+76                                              05939000
CVTRV426 EQU   CVTXTNT2+72                                              05940000
CVTRV425 EQU   CVTXTNT2+68                                              05941000
CVTATACT EQU   CVTATCVT                                                 05942000
CVTRV423 EQU   CVTXTNT2+62                                              05943000
CVTRV422 EQU   CVTXTNT2+60                                              05944000
CVTRV421 EQU   CVTXTNT2+58                                              05945000
CVTRV420 EQU   CVTXTNT2+56                                              05946000
CVTRV419 EQU   CVTXTNT2+55                                              05947000
CVTRV418 EQU   CVTXTNT2+54                                              05948000
CVTRV417 EQU   CVTRV409                                                 05949000
CVTRV416 EQU   CVTRV409                                                 05950000
CVTRV415 EQU   CVTRV409                                                 05951000
CVTRV414 EQU   CVTRV409                                                 05952000
CVTRV413 EQU   CVTRV409                                                 05953000
CVTRV412 EQU   CVTRV409                                                 05954000
CVTRV411 EQU   CVTRV409                                                 05955000
CVTRV410 EQU   CVTRV409                                                 05956000
CVTRV408 EQU   CVTRV400                                                 05957000
CVTRV407 EQU   CVTRV400                                                 05958000
CVTRV406 EQU   CVTRV400                                                 05959000
CVTRV405 EQU   CVTRV400                                                 05960000
CVTRV404 EQU   CVTRV400                                                 05961000
CVTRV403 EQU   CVTRV400                                                 05962000
CVTRV402 EQU   CVTRV400                                                 05963000
CVTRV401 EQU   CVTRV400                                                 05964000
CVTICB   EQU   CVTXTNT2+48                                              05965000
CVTSKTA  EQU   CVTXTNT2+44                                              05966000
CVTCCVT  EQU   CVTXTNT2+40                                              05967000
CVTRSV98 EQU   CVTXTNT2+36                                              05968000
CVTRSV97 EQU   CVTXTNT2+34                                              05969000
CVTRSV96 EQU   CVTXTNT2+32                                              05970000
CVTOLTEP EQU   CVTXTNT2+28                                              05971000
CVTQIDA  EQU   CVTQID+1                                                 05972000
CVTRSV95 EQU   CVTQID                                                   05973000
CVTRSV94 EQU   CVTXTNT2+20                                              05974000
CVTRSV93 EQU   CVTXTNT2+16                                              05975000
CVTRSV92 EQU   CVTXTNT2+12                                              05976000
CVTDEBVR EQU   CVTXTNT2+8                                               05977000
CVTRSV91 EQU   CVTXTNT2+6                                               05978000
CVTRSV9H EQU   CVTFLGBT                                                 05979000
CVTRSV9G EQU   CVTFLGBT                                                 05980000
CVTRSV9F EQU   CVTFLGBT                                                 05981000
CVTRSV9E EQU   CVTFLGBT                                                 05982000
CVTRSV9D EQU   CVTFLGBT                                                 05983000
CVTRSV9C EQU   CVTFLGBT                                                 05984000
CVTVME   EQU   CVTFLGBT                                                 05985000
CVTNPE   EQU   CVTFLGBT                                                 05986000
CVTNUCLS EQU   CVTXTNT2+4                                               05987000
CVTDSSVA EQU   CVTDSSV+1                                                05988000
CVTRSV89 EQU   CVTDSSV                                                  05989000
CVTRSV88 EQU   CVTXTNT1+8                                               05990000
CVTRSV87 EQU   CVTXTNT1+4                                               05991000
CVTFACHN EQU   CVTXTNT1                                                 05992000
CVTRV488 EQU   CVTMAP+412                                               05993000
CVTRV487 EQU   CVTMAP+408                                               05994000
CVTRV486 EQU   CVTMAP+404                                               05995000
CVTRV485 EQU   CVTMAP+400                                               05996000
CVTACTAP EQU   CVTMAP+396                                               05997000
CVTAUTH  EQU   CVTMAP+392                                               05998000
CVTATMCA EQU   CVTATMCT+1                                               05999000
CVTATMST EQU   CVTATMCT                                                 06000000
CVTRSV61 EQU   CVTMAP+384                                               06001000
CVTVOLT1 EQU   CVTVOLM1+1                                               06002000
CVTVOLI1 EQU   CVTVOLF1                                                 06003000
CVTSTOA  EQU   CVTMAP+376                                               06004000
CVTRSV58 EQU   CVTMAP+374                                               06005000
CVTRSV57 EQU   CVTMAP+372                                               06006000
CVTDDCE  EQU   CVTMAP+368                                               06007000
CVTPNWFR EQU   CVTMAP+364                                               06008000
CVTSMF   EQU   CVTMAP+360                                               06009000
CVTSULK  EQU   CVTMAP+358                                               06010000
CVTSLKO  EQU   CVTSYSK                                                  06011000
CVTSLKP  EQU   CVTSYSK                                                  06012000
CVTSLKQ  EQU   CVTSYSK                                                  06013000
CVTSLKR  EQU   CVTSYSK                                                  06014000
CVTRSV56 EQU   CVTSYSK                                                  06015000
CVTRSV55 EQU   CVTSYSK                                                  06016000
CVTRSV54 EQU   CVTSYSK                                                  06017000
CVTRSV53 EQU   CVTSYSK                                                  06018000
CVTRSV52 EQU   CVTA1F1                                                  06019000
CVTRSV51 EQU   CVTA1F1                                                  06020000
CVTRSV50 EQU   CVTA1F1                                                  06021000
CVTRSV49 EQU   CVTA1F1                                                  06022000
CVTRSV48 EQU   CVTA1F1                                                  06023000
CVTRSV47 EQU   CVTA1F1                                                  06024000
CVTSRSW  EQU   CVTA1F1                                                  06025000
CVTPFSW  EQU   CVTA1F1                                                  06026000
CVTPCVT  EQU   CVTMAP+352                                               06027000
CVTRSV46 EQU   CVTMAP+344                                               06028000
CVTRSV45 EQU   CVTMAP+340                                               06029000
CVTRSV44 EQU   CVTMAP+338                                               06030000
CVTRSV43 EQU   CVTMAP+336                                               06031000
CVTHJESA EQU   CVTHJES+1                                                06032000
CVTRSV42 EQU   CVTHJES                                                  06033000
CVTEXT2A EQU   CVTEXT2+1                                                06034000
CVTRSV41 EQU   CVTEXT2                                                  06035000
CVTAPFA  EQU   CVTAPF+1                                                 06036000
CVTRSV40 EQU   CVTAPF                                                   06037000
CVTRV518 EQU   CVTINTLA                                                 06038000
CVTRV517 EQU   CVTERPV                                                  06039000
CVTEORM  EQU   CVTMAP+312                                               06040000
CVTMCHPR EQU   CVTMAP+308                                               06041000
CVTTZ    EQU   CVTMAP+304                                               06042000
CVTJEPS  EQU   CVTMAP+300                                               06043000
CVTJESCT EQU   CVTMAP+296                                               06044000
CVTMODE  EQU   CVTMAP+292                                               06045000
CVTPTRV  EQU   CVTMAP+288                                               06046000
CVTREAL  EQU   CVTMAP+284                                               06047000
CVTRSV39 EQU   CVTMAP+280                                               06048000
CVTRSV38 EQU   CVTMAP+276                                               06049000
CVTDMSRA EQU   CVTDMSR+1                                                06050000
CVTRV634 EQU   CVTDMSRF                                                 06051000
CVTRV633 EQU   CVTDMSRF                                                 06052000
CVTRV632 EQU   CVTDMSRF                                                 06053000
CVTRV631 EQU   CVTDMSRF                                                 06054000
CVTRV630 EQU   CVTDMSRF                                                 06055000
CVTRV629 EQU   CVTDMSRF                                                 06056000
CVTUDUMP EQU   CVTDMSRF                                                 06057000
CVTSDUMP EQU   CVTDMSRF                                                 06058000
CVTQMSGA EQU   CVTQMSG+1                                                06059000
CVTRSV36 EQU   CVTQMSG                                                  06060000
CVTPURGA EQU   CVTPURG+1                                                06061000
CVTRSV35 EQU   CVTPURG                                                  06062000
CVTATERA EQU   CVTATER+1                                                06063000
CVTSYST  EQU   CVTATER                                                  06064000
CVTVOLT2 EQU   CVTTAT                                                   06065000
CVTVOLI2 EQU   CVTVOLF2                                                 06066000
CVTAQAVB EQU   CVTAQAVT+1                                               06067000
CVTRSV34 EQU   CVTTCMFG                                                 06068000
CVTRSV33 EQU   CVTTCMFG                                                 06069000
CVTRSV32 EQU   CVTTCMFG                                                 06070000
CVTRSV31 EQU   CVTTCMFG                                                 06071000
CVTRSV30 EQU   CVTTCMFG                                                 06072000
CVTRSV29 EQU   CVTTCMFG                                                 06073000
CVTLDEV  EQU   CVTTCMFG                                                 06074000
CVTTCRDY EQU   CVTTCMFG                                                 06075000
CVTGTFA  EQU   CVTGTF+1                                                 06076000
CVTRSV27 EQU   CVTGTFST                                                 06077000
CVTRNIO  EQU   CVTGTFST                                                 06078000
CVTUSR   EQU   CVTGTFST                                                 06079000
CVTRV318 EQU   CVTFORM                                                  06080000
CVTRV317 EQU   CVTTMODE                                                 06081000
CVTRV316 EQU   CVTSTATE                                                 06082000
CVTRV315 EQU   CVTGTFS                                                  06083000
CVTGTFAV EQU   CVTGTFS                                                  06084000
CVT0SCR1 EQU   CVTMAP+232                                               06085000
CVTRV515 EQU   CVTMAP+228                                               06086000
CVTRMS   EQU   CVTMAP+224                                               06087000
CVTPATCH EQU   CVTMAP+220                                               06088000
CVTTSCE  EQU   CVTMAP+216                                               06089000
CVTLNKSC EQU   CVTMAP+214                                               06090000
CVTQABST EQU   CVTMAP+212                                               06091000
CVTMDLDS EQU   CVTMAP+208                                               06092000
CVTUSER  EQU   CVTMAP+204                                               06093000
CVTABEND EQU   CVTMAP+200                                               06094000
CVTSMCA  EQU   CVTMAP+196                                               06095000
CVTRSV18 EQU   CVTMAP+192                                               06096000
CVTQLPAQ EQU   CVTMAP+188                                               06097000
CVTQCDSR EQU   CVTMAP+184                                               06098000
CVTRSV17 EQU   CVTOPTB                                                  06099000
CVTRSV16 EQU   CVTOPTB                                                  06100000
CVTFP    EQU   CVTOPTB                                                  06101000
CVTAPTHR EQU   CVTOPTB                                                  06102000
CVTNLOG  EQU   CVTOPTB                                                  06103000
CVTTOD   EQU   CVTOPTB                                                  06104000
CVTCTIMS EQU   CVTOPTB                                                  06105000
CVTPROT  EQU   CVTOPTB                                                  06106000
CVTXPFP  EQU   CVTOPTA                                                  06107000
CVTASCII EQU   CVTOPTA                                                  06108000
CVTRSV13 EQU   CVTOPTA                                                  06109000
CVTRSV12 EQU   CVTOPTA                                                  06110000
CVTNIP   EQU   CVTOPTA                                                  06111000
CVTDDR   EQU   CVTOPTA                                                  06112000
CVTAPR   EQU   CVTOPTA                                                  06113000
CVTCCH   EQU   CVTOPTA                                                  06114000
CVTSNCTR EQU   CVTMAP+180                                               06115000
CVTQMWR  EQU   CVTMAP+176                                               06116000
CVTQOCR  EQU   CVTMAP+172                                               06117000
CVT1EF00 EQU   CVTMAP+168                                               06118000
CVTMZ00  EQU   CVTMAP+164                                               06119000
CVTSV76Q EQU   CVTSV76C                                                 06120000
CVTRSV11 EQU   CVTMAP+156                                               06121000
CVT0PT01 EQU   CVTMAP+152                                               06122000
CVTMSER  EQU   CVTMAP+148                                               06123000
CVTRV516 EQU   CVTIERLC                                                 06124000
CVTILCH  EQU   CVTMAP+140                                               06125000
CVT0DS   EQU   CVTMAP+136                                               06126000
CVTFBOSV EQU   CVTMAP+132                                               06127000
CVTNUCB  EQU   CVTMAP+128                                               06128000
CVTIXAVL EQU   CVTMAP+124                                               06129000
CVTSV76M EQU   CVTIOQET                                                 06130000
CVTDCBA  EQU   CVTMAP+117                                               06131000
CVTMVS2  EQU   CVTDCB                                                   06132000
CVT6DAT  EQU   CVTDCB                                                   06133000
CVT4MPS  EQU   CVTDCB                                                   06134000
CVTRSV09 EQU   CVTDCB                                                   06135000
CVT4MS1  EQU   CVTDCB                                                   06136000
CVT2SPS  EQU   CVTDCB                                                   06137000
CVT1SSS  EQU   CVTDCB                                                   06138000
CVTRSV08 EQU   CVTDCB                                                   06139000
CVTSTB   EQU   CVTMAP+112                                               06140000
CVTQTD00 EQU   CVTMAP+108                                               06141000
CVTQTE00 EQU   CVTMAP+104                                               06142000
CVTCUCB  EQU   CVTMAP+100                                               06143000
CVTSJQ   EQU   CVTMAP+96                                                06144000
CVTPBLDL EQU   CVTMAP+92                                                06145000
CVTTPC   EQU   CVTMAP+88                                                06146000
CVTSVDCB EQU   CVTMAP+84                                                06147000
CVTBRET  EQU   CVTMAP+82                                                06148000
CVTEXIT  EQU   CVTMAP+80                                                06149000
CVT0FN00 EQU   CVTMAP+76                                                06150000
CVTDARA  EQU   CVTDAR+1                                                 06151000
CVTRSV07 EQU   CVTFLGS1                                                 06152000
CVTRSV06 EQU   CVTFLGS1                                                 06153000
CVTRSV05 EQU   CVTFLGS1                                                 06154000
CVTRSV04 EQU   CVTFLGS1                                                 06155000
CVTRSV03 EQU   CVTFLGS1                                                 06156000
CVTRSV02 EQU   CVTFLGS1                                                 06157000
CVTRSV01 EQU   CVTFLGS1                                                 06158000
CVTDMPLK EQU   CVTFLGS1                                                 06159000
CVTXITP  EQU   CVTMAP+68                                                06160000
CVTZDTAB EQU   CVTMAP+64                                                06161000
CVTMSLT  EQU   CVTMAP+60                                                06162000
CVTBTERM EQU   CVTMAP+52                                                06163000
CVTSYSAD EQU   CVTMAP+48                                                06164000
CVTXTLER EQU   CVTMAP+44                                                06165000
CVTILK1  EQU   CVTMAP+36                                                06166000
CVTPRLTV EQU   CVTMAP+32                                                06167000
CVTPCNVT EQU   CVTMAP+28                                                06168000
CVT0VL00 EQU   CVTMAP+24                                                06169000
CVTXAPG  EQU   CVTMAP+20                                                06170000
CVTBUF   EQU   CVTMAP+16                                                06171000
CVTJOB   EQU   CVTMAP+12                                                06172000
CVTLINK  EQU   CVTMAP+8                                                 06173000
CVT0EF00 EQU   CVTMAP+4                                                 06174000
CVT      EQU   CVTMAP                                                   06175000
CNTVAR   EQU   CNTRLINF                                                 06176000
VARINFO  EQU   VARFIELD+2                                               06177000
VARLEN   EQU   VARFIELD                                                 06178000
REPGOPT  EQU   REPCNTRL+6                                               06179000
REPCNT   EQU   REPCNTRL+5                                               06180000
@NM00046 EQU   EXTRCDPT+3                                               06181000
EXTGOCI  EQU   EXTRCDPT                                                 06182000
NREPCV   EQU   CATRCD+47                                                06183000
RCDSIZ   EQU   CATRCD+45                                                06184000
@NM00045 EQU   CATRCD+27                                                06185000
RCDEXSEC EQU   RCDSECF                                                  06186000
RCDDICTS EQU   CATRCD+22                                                06187000
RCDRACTS EQU   CATRCD+18                                                06188000
RCDCRADT EQU   CATRCD+14                                                06189000
RCDCRACI EQU   CATRCD+11                                                06190000
RCDCRAVL EQU   CATRCD+5                                                 06191000
RCDRELID EQU   CATRCD+4                                                 06192000
RCDKEYTY EQU   CATRCD                                                   06193000
CATGOGC  EQU   CATGOGC1                                                 06194000
CATGODEL EQU   CATGOGC1                                                 06195000
CATGOEXT EQU   CATGOGC1                                                 06196000
CATGODSP EQU   CATGOCI+1                                                06197000
@NM00044 EQU   CATGOFLG                                                 06198000
CCACPE4  EQU   CCARAB+16                                                06199000
CCACPE3  EQU   CCARAB+12                                                06200000
@NM00043 EQU   CCARAB+2                                                 06201000
CCARABRI EQU   CCARAB+1                                                 06202000
CCARBUPD EQU   CCARABFL                                                 06203000
@NM00042 EQU   CCARABFL                                                 06204000
CCARBPA  EQU   CCARABFL                                                 06205000
CCARBWR  EQU   CCARABFL                                                 06206000
CCARBU2  EQU   CCARABFL                                                 06207000
CCARBU1  EQU   CCARABFL                                                 06208000
CCARBUR  EQU   CCARABFL                                                 06209000
DIC2GC   EQU   DIC2ENT+3                                                06210000
DIC2LC   EQU   DIC2ENT+2                                                06211000
DIC2ST   EQU   DIC2ENT+1                                                06212000
@NM00041 EQU   DIC2FLGS                                                 06213000
DIC2UPGD EQU   DIC2FLGS                                                 06214000
DIC2SCRA EQU   DIC2FLGS                                                 06215000
DIC2MV   EQU   DIC2FLGS                                                 06216000
DIC2FLG  EQU   DIC2FLGS                                                 06217000
DIC2COMB EQU   DIC2FLGS                                                 06218000
DIC2REP  EQU   DIC2FLGS                                                 06219000
DIC2VAR  EQU   DIC2FLGS                                                 06220000
DICTGC   EQU   DICTENT+3                                                06221000
DICTLC   EQU   DICTENT+2                                                06222000
DICTST   EQU   DICTENT+1                                                06223000
@NM00040 EQU   DICTFLGS                                                 06224000
DICTUPGD EQU   DICTFLGS                                                 06225000
DICTSCRA EQU   DICTFLGS                                                 06226000
DICTMV   EQU   DICTFLGS                                                 06227000
DICTFLG  EQU   DICTFLGS                                                 06228000
DICTCOMB EQU   DICTFLGS                                                 06229000
DICTREP  EQU   DICTFLGS                                                 06230000
DICTVAR  EQU   DICTFLGS                                                 06231000
WKALEN1  EQU   USERWKA                                                  06232000
CTGFLDTS EQU   CTGFLDRE                                                 06233000
@NM00039 EQU   CTGFLDRE                                                 06234000
@NM00037 EQU   CTGFBFLG                                                 06235000
CTGNGDSN EQU   CTGFBFLG                                                 06236000
CTGGDGB  EQU   CTGFBFLG                                                 06237000
CTGKEEP  EQU   CTGFBFLG                                                 06238000
CTGPAR   EQU   CTGFBFLG                                                 06239000
CTGFDBK  EQU   CTGNEWNM                                                 06240000
@NM00036 EQU   CTGDSORG                                                 06241000
@NM00035 EQU   CTGOPTN4                                                 06242000
CTGTIOT  EQU   CTGOPTN4                                                 06243000
CTGBYPMT EQU   CTGOPTN4                                                 06244000
CTGCOIN  EQU   CTGOPTN4                                                 06245000
CTGNPROF EQU   CTGOPTN4                                                 06246000
CTGDOCAT EQU   CTGOPTN4                                                 06247000
CTGLBASE EQU   CTGOPTN4                                                 06248000
CTGAM0   EQU   CTGOPTN3                                                 06249000
CTGNUM   EQU   CTGOPTN3                                                 06250000
CTGSRH   EQU   CTGOPTN3                                                 06251000
CTGGDGL  EQU   CTGOPTN3                                                 06252000
CTGSUPLT EQU   CTGOPTN3                                                 06253000
CTGFUNC  EQU   CTGOPTN3                                                 06254000
@NM00034 EQU   CTGOPTN2                                                 06255000
CTGDISC  EQU   CTGOPTN2                                                 06256000
CTGGTNXT EQU   CTGOPTN2                                                 06257000
CTGSWAP  EQU   CTGRCATN                                                 06258000
CTGGTALL EQU   CTGREL                                                   06259000
CTGGENLD EQU   CTGOPTN1                                                 06260000
CTGCNAME EQU   CTGOPTN1                                                 06261000
CTGNAME  EQU   CTGOPTN1                                                 06262000
CTGREAD  EQU   CTGOPTN1                                                 06263000
CTGUPD   EQU   CTGOPTN1                                                 06264000
CTGCI    EQU   CTGOPTN1                                                 06265000
CTGMAST  EQU   CTGOPTN1                                                 06266000
CTGBYPSS EQU   CTGOPTN1                                                 06267000
CCAEND   EQU   IGGCCA+1508                                              06268000
@NM00033 EQU   IGGCCA+1504                                              06269000
CCARMINN EQU   CCAREQDQ+8                                               06270000
CCARMAJN EQU   CCAREQDQ+4                                               06271000
CCAREDRC EQU   CCAREQDQ+3                                               06272000
@NM00032 EQU   CCAREDOP                                                 06273000
CCAREDSH EQU   CCAREDOP                                                 06274000
CCAREDLN EQU   CCAREQDQ+1                                               06275000
CCAREDFF EQU   CCAREQDQ                                                 06276000
CCASAVMN EQU   CCADGDGA                                                 06277000
CCARETRX EQU   CCAERCDX+1                                               06278000
CCARESNX EQU   CCAERCDX                                                 06279000
CCAMODDX EQU   CCAPROBX                                                 06280000
CCASMFCD EQU   CCASMFP+3                                                06281000
CCASMFRC EQU   CCASMFP+2                                                06282000
CCASMFMD EQU   CCASMFP                                                  06283000
CCAREWKA EQU   IGGCCA+1476                                              06284000
CCAVTS   EQU   IGGCCA+1468                                              06285000
CCARAVCA EQU   IGGCCA+1460                                              06286000
CCARANCA EQU   IGGCCA+1452                                              06287000
CCADICTS EQU   IGGCCA+1448                                              06288000
CCASUMTT EQU   IGGCCA+1445                                              06289000
@NM00031 EQU   CCAFLG10                                                 06290000
CCADEFUN EQU   CCAFLG10                                                 06291000
CCAPRANX EQU   CCAFLG10                                                 06292000
CCARARTC EQU   CCAFLG10                                                 06293000
CCARAFEV EQU   CCAFLG10                                                 06294000
CCACATAC EQU   CCAFLG10                                                 06295000
CCAPDMW  EQU   CCAFLG10                                                 06296000
CCAINCPL EQU   CCAFLG10                                                 06297000
@NM00030 EQU   CCARALSA+2                                               06298000
CCACRABT EQU   CCARALSA                                                 06299000
CCARAREC EQU   IGGCCA+1436                                              06300000
CCARARBA EQU   IGGCCA+1432                                              06301000
CCARARPL EQU   IGGCCA+1428                                              06302000
CCARAACB EQU   IGGCCA+1424                                              06303000
CCACRACI EQU   IGGCCA+1420                                              06304000
CCASBASE EQU   IGGCCA+1417                                              06305000
CCATNQCT EQU   IGGCCA+1416                                              06306000
CCADSPWA EQU   CCABZSAV                                                 06307000
CCAMODNM EQU   CCAREGS+4                                                06308000
@NM00029 EQU   CCAREGS                                                  06309000
@NM00028 EQU   CCAFLG11                                                 06310000
CCAF11B6 EQU   CCAFLG11                                                 06311000
CCAF11B5 EQU   CCAFLG11                                                 06312000
@NM00027 EQU   CCAFLG11                                                 06313000
@NM00026 EQU   IGGCCA+1057                                              06314000
@NM00025 EQU   CCARVFG1                                                 06315000
RVWG     EQU   CCARVFG1                                                 06316000
RVRPLMFG EQU   CCARVFG1                                                 06317000
RVESBOR  EQU   CCARVFG1                                                 06318000
RVESBO   EQU   CCARVFG1                                                 06319000
RVCMSFG  EQU   CCARVFG1                                                 06320000
RVARFI   EQU   CCARVFG1                                                 06321000
RVCCAV   EQU   CCARVFG1                                                 06322000
ARFSBECH EQU   CCAARFWA+12                                              06323000
ARFSBSCH EQU   CCAARFWA+8                                               06324000
ARFGMADR EQU   CCAARFWA+4                                               06325000
ARFLEN   EQU   ARFGMLEN+1                                               06326000
ARFGMLP  EQU   ARFGMLEN                                                 06327000
CCAMNADR EQU   CCAMNCAT+252                                             06328000
CCAMNLEN EQU   CCAMNCAT+249                                             06329000
CCAMNLL  EQU   CCAMNCAT+248                                             06330000
MNATARG2 EQU   CCAMNAT+244                                              06331000
MNATARG1 EQU   CCAMNAT+241                                              06332000
MNATSCLS EQU   MNATFLGS                                                 06333000
@NM00024 EQU   MNATFLGS                                                 06334000
MNATVAL  EQU   MNATFLGS                                                 06335000
@NM00023 EQU   CCAMNAT+1                                                06336000
@NM00022 EQU   MNATTOP                                                  06337000
MNATFULL EQU   MNATTOP                                                  06338000
CCABMRB2 EQU   IGGCCA+740                                               06339000
CCABMRB1 EQU   IGGCCA+736                                               06340000
CCABMWK4 EQU   IGGCCA+732                                               06341000
CCABMWK3 EQU   IGGCCA+728                                               06342000
CCABMWK2 EQU   IGGCCA+724                                               06343000
CCABMWK1 EQU   IGGCCA+720                                               06344000
CCABMSTR EQU   IGGCCA+718                                               06345000
CCABMBYT EQU   IGGCCA+716                                               06346000
CCABMBTL EQU   IGGCCA+714                                               06347000
CCABMBT1 EQU   IGGCCA+712                                               06348000
CCABMEND EQU   IGGCCA+708                                               06349000
CCABMPTR EQU   IGGCCA+704                                               06350000
CCABMGOP EQU   IGGCCA+700                                               06351000
CCABMPAD EQU   IGGCCA+699                                               06352000
@NM00021 EQU   IGGCCA+697                                               06353000
CCABMOST EQU   CCABMOFG                                                 06354000
CCABMOTR EQU   CCABMOUT+2                                               06355000
CCABMONN EQU   CCABMOUT                                                 06356000
@NM00020 EQU   CCABMINP+7                                               06357000
CCABMLST EQU   CCABMFLG                                                 06358000
CCABMCCK EQU   CCABMFLG                                                 06359000
CCABMSET EQU   CCABMFLG                                                 06360000
CCABMCHK EQU   CCABMFLG                                                 06361000
CCABMST  EQU   CCABMFLG                                                 06362000
CCABMMIN EQU   CCABMINP+4                                               06363000
CCABMLIM EQU   CCABMINP+2                                               06364000
CCABMTRK EQU   CCABMINP                                                 06365000
CCAR14S  EQU   IGGCCA+680                                               06366000
CCAXLATE EQU   IGGCCA+640                                               06367000
CCADEL2  EQU   IGGCCA+637                                               06368000
CCADEL1  EQU   IGGCCA+634                                               06369000
CCAVAR1  EQU   IGGCCA+614                                               06370000
CCAVAR   EQU   IGGCCA+594                                               06371000
CCADELN  EQU   IGGCCA+592                                               06372000
CCAVARPT EQU   IGGCCA+588                                               06373000
CCARBASE EQU   IGGCCA+584                                               06374000
CCARRAB  EQU   IGGCCA+580                                               06375000
CCAVARLN EQU   IGGCCA+578                                               06376000
CCACI3   EQU   IGGCCA+575                                               06377000
CCACI2   EQU   IGGCCA+572                                               06378000
CCACI1   EQU   IGGCCA+569                                               06379000
CCACHAIN EQU   IGGCCA+566                                               06380000
CCASMFLN EQU   IGGCCA+564                                               06381000
CCASMFG2 EQU   CCASMFLG+1                                               06382000
@NM00019 EQU   CCASMFG1                                                 06383000
CCASMFAL EQU   CCASMFSR                                                 06384000
CCASMFDF EQU   CCASMFUC                                                 06385000
CCASMFCT EQU   IGGCCA+560                                               06386000
CCASMFRD EQU   IGGCCA+556                                               06387000
CCANORBA EQU   IGGCCA+555                                               06388000
CCARESUM EQU   CCAFLG9                                                  06389000
CCARAICI EQU   CCAFLG9                                                  06390000
CCARAACT EQU   CCAFLG9                                                  06391000
CCAUCRA  EQU   CCAFLG9                                                  06392000
CCARACR  EQU   CCAFLG9                                                  06393000
CCARALRD EQU   CCAFLG9                                                  06394000
CCARAEOV EQU   CCAFLG9                                                  06395000
CCARABYC EQU   CCAFLG9                                                  06396000
CCAAUCAT EQU   CCAFLG8                                                  06397000
CCALEOD  EQU   CCAFLG8                                                  06398000
CCAVRIND EQU   CCAFLG8                                                  06399000
CCALPIND EQU   CCAFLG8                                                  06400000
CCASCICK EQU   CCAFLG8                                                  06401000
CCASCRA  EQU   CCAFLG8                                                  06402000
CCAVBUFI EQU   CCAFLG8                                                  06403000
CCADSRCL EQU   CCAFLG8                                                  06404000
CCACRABU EQU   CCAFLG7                                                  06405000
CCAFEOV  EQU   CCAFLG7                                                  06406000
CCAROREQ EQU   CCAFLG7                                                  06407000
CCAONCE  EQU   CCAFLG7                                                  06408000
CCASMFBR EQU   CCAFLG7                                                  06409000
CCASMFA  EQU   CCAFLG7                                                  06410000
CCASMFEX EQU   CCAFLG7                                                  06411000
CCALSP   EQU   CCAFLG7                                                  06412000
CCALCPL  EQU   IGGCCA+548                                               06413000
CCASMFPT EQU   IGGCCA+544                                               06414000
CCAILNG2 EQU   IGGCCA+536                                               06415000
CCAILNG3 EQU   IGGCCA+532                                               06416000
CCASDWAP EQU   IGGCCA+528                                               06417000
CCACWAP  EQU   IGGCCA+524                                               06418000
CCACDTCT EQU   IGGCCA+522                                               06419000
CCADTCT  EQU   IGGCCA+520                                               06420000
CCACDTA  EQU   IGGCCA+516                                               06421000
CCADTA   EQU   IGGCCA+512                                               06422000
CCASVCI1 EQU   IGGCCA+509                                               06423000
CCASVCI  EQU   IGGCCA+506                                               06424000
CCADISP  EQU   IGGCCA+504                                               06425000
CCAREPCT EQU   IGGCCA+502                                               06426000
CCADIFF  EQU   IGGCCA+500                                               06427000
CCADLEN  EQU   IGGCCA+498                                               06428000
CCAIXTPL EQU   IGGCCA+496                                               06429000
CCAGRHI1 EQU   CCASSEQ                                                  06430000
CCARCDID EQU   CCAGRGC                                                  06431000
CCASAVID EQU   IGGCCA+492                                               06432000
CCANEFV  EQU   IGGCCA+491                                               06433000
CCAGVEXT EQU   IGGCCA+488                                               06434000
CCANEVV  EQU   IGGCCA+486                                               06435000
CCAGVCT  EQU   IGGCCA+484                                               06436000
CCARABSM EQU   CCAIDPT3                                                 06437000
CCAIDPT2 EQU   IGGCCA+476                                               06438000
CCASMFIX EQU   IGGCCA+474                                               06439000
CCACNIX  EQU   IGGCCA+472                                               06440000
CCARBAL  EQU   IGGCCA+470                                               06441000
CCATLEN  EQU   CCATLNG                                                  06442000
CCARBA2  EQU   CCARBA+16                                                06443000
CCARBA1  EQU   CCARBA+12                                                06444000
CCATT    EQU   CCARBA+10                                                06445000
CCACCHH2 EQU   CCACRADT                                                 06446000
CCACCHH1 EQU   CCACRAVL+2                                               06447000
CCASS    EQU   CCACRAVL                                                 06448000
CCATEST  EQU   IGGCCA+444                                               06449000
CCATNO   EQU   IGGCCA+442                                               06450000
CCATREL  EQU   IGGCCA+410                                               06451000
CCATNUM  EQU   IGGCCA+408                                               06452000
CCATNREL EQU   IGGCCA+406                                               06453000
CCAIXREL EQU   IGGCCA+404                                               06454000
CCAIXFPL EQU   IGGCCA+402                                               06455000
@NM00018 EQU   IGGCCA+400                                               06456000
CCASN1   EQU   CCASN                                                    06457000
CCALREL1 EQU   CCALREL                                                  06458000
CCAGC    EQU   IGGCCA+395                                               06459000
CCACBASE EQU   IGGCCA+392                                               06460000
CCAMCPL  EQU   CCAXCPL                                                  06461000
CCARABPT EQU   IGGCCA+368                                               06462000
CCATFLPT EQU   CCAFLPT                                                  06463000
CCAILNG  EQU   IGGCCA+360                                               06464000
CCASL    EQU   IGGCCA+358                                               06465000
CCAGOPLN EQU   IGGCCA+356                                               06466000
CCACPE71 EQU   IGGCCA+352                                               06467000
CCAIDPT  EQU   CCACPE7                                                  06468000
CCARABSE EQU   CCACPE61                                                 06469000
CCACPE53 EQU   IGGCCA+336                                               06470000
CCACPE52 EQU   IGGCCA+332                                               06471000
CCACPE51 EQU   IGGCCA+328                                               06472000
CCALUME  EQU   IGGCCA+324                                               06473000
CCAEXCMS EQU   CCACMS+4                                                 06474000
CCARPRM  EQU   IGGCCA+312                                               06475000
@NM00017 EQU   CCAMSSPL+10                                              06476000
CCAMNSPL EQU   CCAMSSPL+9                                               06477000
@NM00016 EQU   CCAMSSPL+8                                               06478000
CCAMNPTR EQU   CCAMSSPL+4                                               06479000
CCAMNLLP EQU   CCAMSSPL                                                 06480000
CCAMLRET EQU   IGGCCA+296                                               06481000
CCAEDUCB EQU   CCAEQDQ+12                                               06482000
CCAEDRNM EQU   CCAEQDQ+8                                                06483000
CCAEDQNM EQU   CCAEQDQ+4                                                06484000
CCAEDRCD EQU   CCAEQDQ+3                                                06485000
@NM00015 EQU   CCAEDOPT                                                 06486000
CCAEDSHR EQU   CCAEDOPT                                                 06487000
CCAEDRLN EQU   CCAEQDQ+1                                                06488000
CCAEDXFF EQU   CCAEQDQ                                                  06489000
CCAASCI  EQU   IGGCCA+271                                               06490000
CCAASCIX EQU   IGGCCA+270                                               06491000
CCACRRP  EQU   IGGCCA+269                                               06492000
CCAASCIK EQU   IGGCCA+268                                               06493000
CCAEXTTH EQU   CCAEXTDE+6                                               06494000
CCAEXTHH EQU   CCAEXTAD+2                                               06495000
CCAEXTCC EQU   CCAEXTAD                                                 06496000
CCAEXTSS EQU   CCAEXTDE                                                 06497000
CCASSVOL EQU   CCADESA+2                                                06498000
CCAIXEXT EQU   CCADESA+1                                                06499000
CCANDEXT EQU   CCADESA                                                  06500000
CCARPL1  EQU   IGGCCA+220                                               06501000
CCAQLEN  EQU   IGGCCA+219                                               06502000
CCASC    EQU   IGGCCA+218                                               06503000
CCATQDB  EQU   CCATIQRN+2                                               06504000
CCATASID EQU   CCATIQRN                                                 06505000
CCARPLT  EQU   IGGCCA+211                                               06506000
CCARPLX  EQU   IGGCCA+210                                               06507000
CCARPLF  EQU   IGGCCA+209                                               06508000
CCARPLK  EQU   IGGCCA+208                                               06509000
CCACPE45 EQU   CCAR5SEG+8                                               06510000
CCACPE35 EQU   CCAR5SEG+4                                               06511000
CCACPE25 EQU   CCAR5SEG                                                 06512000
@NM00014 EQU   CCARAB5+2                                                06513000
CCAR5RPL EQU   CCARAB5+1                                                06514000
CCAR5UPD EQU   CCAR5FLG                                                 06515000
@NM00013 EQU   CCAR5FLG                                                 06516000
CCAR5PA  EQU   CCAR5FLG                                                 06517000
CCAR5WR  EQU   CCAR5FLG                                                 06518000
CCAR5U2  EQU   CCAR5FLG                                                 06519000
CCAR5U1  EQU   CCAR5FLG                                                 06520000
CCACPE44 EQU   CCAR4SEG+8                                               06521000
CCACPE34 EQU   CCAR4SEG+4                                               06522000
CCACPE24 EQU   CCAR4SEG                                                 06523000
CCAR4REC EQU   CCARAB4+4                                                06524000
@NM00012 EQU   CCARAB4+2                                                06525000
CCAR4RPL EQU   CCARAB4+1                                                06526000
CCAR4UPD EQU   CCAR4FLG                                                 06527000
@NM00011 EQU   CCAR4FLG                                                 06528000
CCAR4PA  EQU   CCAR4FLG                                                 06529000
CCAR4WR  EQU   CCAR4FLG                                                 06530000
CCAR4U2  EQU   CCAR4FLG                                                 06531000
CCAR4U1  EQU   CCAR4FLG                                                 06532000
CCACPE43 EQU   CCAR3SEG+8                                               06533000
CCACPE33 EQU   CCAR3SEG+4                                               06534000
CCACPE23 EQU   CCAR3SEG                                                 06535000
CCAR3REC EQU   CCARAB3+4                                                06536000
@NM00010 EQU   CCARAB3+2                                                06537000
CCAR3RPL EQU   CCARAB3+1                                                06538000
CCAR3UPD EQU   CCAR3FLG                                                 06539000
@NM00009 EQU   CCAR3FLG                                                 06540000
CCAR3PA  EQU   CCAR3FLG                                                 06541000
CCAR3WR  EQU   CCAR3FLG                                                 06542000
CCAR3U2  EQU   CCAR3FLG                                                 06543000
CCAR3U1  EQU   CCAR3FLG                                                 06544000
CCAR3UR  EQU   CCAR3FLG                                                 06545000
CCACPE42 EQU   CCAR2SEG+8                                               06546000
CCACPE32 EQU   CCAR2SEG+4                                               06547000
CCACPE22 EQU   CCAR2SEG                                                 06548000
@NM00008 EQU   CCARAB2+2                                                06549000
CCAR2RPL EQU   CCARAB2+1                                                06550000
CCAR2UPD EQU   CCAR2FLG                                                 06551000
@NM00007 EQU   CCAR2FLG                                                 06552000
CCAR2PA  EQU   CCAR2FLG                                                 06553000
CCAR2WR  EQU   CCAR2FLG                                                 06554000
CCAR2U2  EQU   CCAR2FLG                                                 06555000
CCAR2U1  EQU   CCAR2FLG                                                 06556000
CCAR2UR  EQU   CCAR2FLG                                                 06557000
CCACPE41 EQU   CCAR1SEG+8                                               06558000
CCACPE31 EQU   CCAR1SEG+4                                               06559000
CCACPE21 EQU   CCAR1SEG                                                 06560000
CCAR1REC EQU   CCARAB1+4                                                06561000
@NM00006 EQU   CCARAB1+2                                                06562000
CCAR1RPL EQU   CCARAB1+1                                                06563000
CCAR1UPD EQU   CCAR1FLG                                                 06564000
@NM00005 EQU   CCAR1FLG                                                 06565000
CCAR1PA  EQU   CCAR1FLG                                                 06566000
CCAR1WR  EQU   CCAR1FLG                                                 06567000
CCAR1U2  EQU   CCAR1FLG                                                 06568000
CCAR1U1  EQU   CCAR1FLG                                                 06569000
CCAR1UR  EQU   CCAR1FLG                                                 06570000
CCACPE40 EQU   CCAR0SEG+8                                               06571000
CCACPE30 EQU   CCAR0SEG+4                                               06572000
CCACPE20 EQU   CCAR0SEG                                                 06573000
CCAR0REC EQU   CCARAB0+4                                                06574000
@NM00004 EQU   CCARAB0+2                                                06575000
CCAR0RPL EQU   CCARAB0+1                                                06576000
CCAR0UPD EQU   CCAR0FLG                                                 06577000
@NM00003 EQU   CCAR0FLG                                                 06578000
CCAR0PA  EQU   CCAR0FLG                                                 06579000
CCAR0WR  EQU   CCAR0FLG                                                 06580000
CCAR0U2  EQU   CCAR0FLG                                                 06581000
CCAR0U1  EQU   CCAR0FLG                                                 06582000
CCAR0UR  EQU   CCAR0FLG                                                 06583000
@NM00002 EQU   CCASRCH+3                                                06584000
CCANPCCB EQU   IGGCCA+36                                                06585000
CCADPL   EQU   CCARB                                                    06586000
CCALBCYL EQU   CCATCB                                                   06587000
CCAMOD   EQU   CCAFLG6                                                  06588000
CCAEXT   EQU   CCAFLG6                                                  06589000
CCASUPFD EQU   CCAFLG6                                                  06590000
CCAINIT  EQU   CCAFLG6                                                  06591000
CCAMNOSP EQU   CCAFLG6                                                  06592000
CCADELP  EQU   CCAFLG6                                                  06593000
CCAMCODR EQU   CCAFLG6                                                  06594000
CCATEX2  EQU   CCAFLG5                                                  06595000
CCATEX1  EQU   CCAFLG5                                                  06596000
CCATEX   EQU   CCAFLG5                                                  06597000
CCATHIT  EQU   CCAFLG5                                                  06598000
CCAMODPA EQU   CCAFLG5                                                  06599000
CCAMEX1  EQU   CCAFLG5                                                  06600000
CCAMEX   EQU   CCAFLG5                                                  06601000
CCAMEX2  EQU   CCAFLG5                                                  06602000
CCATCOMP EQU   CCAFLG4                                                  06603000
CCAGVNE  EQU   CCAFLG4                                                  06604000
CCAGVEX  EQU   CCAFLG4                                                  06605000
CCAGVNBS EQU   CCAFLG4                                                  06606000
CCAGVNF  EQU   CCAFLG4                                                  06607000
CCAGVNC  EQU   CCAFLG4                                                  06608000
CCAF4BYS EQU   CCAFLG4                                                  06609000
CCAF4DRQ EQU   CCAFLG4                                                  06610000
CCAEGREC EQU   CCAFLG3                                                  06611000
CCALFT   EQU   CCAFLG3                                                  06612000
CCAELC2  EQU   CCAFLG3                                                  06613000
CCANF    EQU   CCAFLG3                                                  06614000
CCAEXGR2 EQU   CCAFLG3                                                  06615000
CCAGDSP  EQU   CCAFLG3                                                  06616000
CCAGC4   EQU   CCAFLG3                                                  06617000
CCAEXGR1 EQU   CCAFLG3                                                  06618000
CCAF2SMO EQU   CCAFLG2                                                  06619000
CCAF2CB  EQU   CCAF2COB                                                 06620000
CCAF2CO  EQU   CCAF2COB                                                 06621000
CCAF2RHS EQU   CCAFLG2                                                  06622000
CCAF2XEQ EQU   CCAFLG2                                                  06623000
CCAF2CCT EQU   CCAFLG2                                                  06624000
CCAF2SYS EQU   CCAFLG2                                                  06625000
CCAF1DK  EQU   CCAFLG1                                                  06626000
CCAF1CR  EQU   CCAFLG1                                                  06627000
CCAF1LRD EQU   CCAFLG1                                                  06628000
CCAF1CNS EQU   CCAFLG1                                                  06629000
CCAF1LPS EQU   CCAFLG1                                                  06630000
CCACD2   EQU   IGGCCA+13                                                06631000
@NM00001 EQU   IGGCCA+8                                                 06632000
CCACDR   EQU   CCAREASN                                                 06633000
CCASZ    EQU   IGGCCA+2                                                 06634000
CCAID    EQU   IGGCCA                                                   06635000
@NM00076 EQU   PSA+3668                                                 06636000
PSASTAK  EQU   PSA+3072                                                 06637000
@NM00075 EQU   PSA+1048                                                 06638000
PSAUSEND EQU   PSA+1048                                                 06639000
PSARV062 EQU   PSA+1044                                                 06640000
PSACDAL  EQU   PSA+1040                                                 06641000
PSAWTCOD EQU   PSA+1036                                                 06642000
PSAATCVT EQU   PSA+1032                                                 06643000
PSAPCPSW EQU   PSA+1024                                                 06644000
PSAPIR2  EQU   PSA+1020                                                 06645000
PSARV059 EQU   PSA+1018                                                 06646000
PSASVC13 EQU   PSA+1016                                                 06647000
PSALSFCC EQU   PSA+1012                                                 06648000
PSASFACC EQU   PSA+1008                                                 06649000
PSASTOP  EQU   PSA+992                                                  06650000
PSASTART EQU   PSA+976                                                  06651000
PSARSPSW EQU   PSA+968                                                  06652000
PSASRPSW EQU   PSA+960                                                  06653000
PSARV045 EQU   PSA+892                                                  06654000
PSARV044 EQU   PSA+888                                                  06655000
PSARV043 EQU   PSA+884                                                  06656000
PSARV042 EQU   PSA+880                                                  06657000
PSARV041 EQU   PSA+876                                                  06658000
PSARV040 EQU   PSA+872                                                  06659000
PSARV025 EQU   PSA+868                                                  06660000
PSADSSED EQU   PSA+868                                                  06661000
PSADSSPR EQU   PSA+864                                                  06662000
PSADSSFW EQU   PSA+860                                                  06663000
PSADSS14 EQU   PSA+856                                                  06664000
PSADSSPP EQU   PSA+848                                                  06665000
PSADSSRP EQU   PSA+840                                                  06666000
PSADSS05 EQU   PSADSSF4                                                 06667000
PSADSS10 EQU   PSADSSF4                                                 06668000
PSADSSVE EQU   PSADSSF4                                                 06669000
PSADSSDE EQU   PSADSSF4                                                 06670000
PSADSSC0 EQU   PSADSSF4                                                 06671000
PSADSSIE EQU   PSADSSF4                                                 06672000
PSADSS12 EQU   PSADSSF4                                                 06673000
PSADSSRC EQU   PSADSSF4                                                 06674000
PSARV057 EQU   PSADSSF3                                                 06675000
PSARV056 EQU   PSADSSF3                                                 06676000
PSARV055 EQU   PSADSSF3                                                 06677000
PSADSSMC EQU   PSADSSF3                                                 06678000
PSADSSRW EQU   PSADSSF3                                                 06679000
PSADSSNM EQU   PSADSSF3                                                 06680000
PSADSSES EQU   PSADSSF3                                                 06681000
PSADSSGP EQU   PSADSSF3                                                 06682000
PSADSSF2 EQU   PSADSSFL+1                                               06683000
PSADSSPI EQU   PSADSSF1                                                 06684000
PSADSSOI EQU   PSADSSF1                                                 06685000
PSADSSSP EQU   PSADSSF1                                                 06686000
PSADSSTP EQU   PSADSSF1                                                 06687000
PSADSSDW EQU   PSADSSF1                                                 06688000
PSADSSDD EQU   PSADSSF1                                                 06689000
PSADSSDM EQU   PSADSSF1                                                 06690000
PSADSSMV EQU   PSADSSF1                                                 06691000
PSADSSTS EQU   PSA+816                                                  06692000
PSADSSWK EQU   PSA+812                                                  06693000
PSADSSR3 EQU   PSA+808                                                  06694000
PSADSSR2 EQU   PSA+804                                                  06695000
PSADSSRS EQU   PSA+800                                                  06696000
PSASTOR  EQU   PSA+796                                                  06697000
PSACPUSA EQU   PSA+794                                                  06698000
PSAVSTAP EQU   PSA+792                                                  06699000
PSAWKVAP EQU   PSA+788                                                  06700000
PSAWKRAP EQU   PSA+784                                                  06701000
PSAMCHIC EQU   PSA+783                                                  06702000
PSARV061 EQU   PSA+782                                                  06703000
PSASYMSK EQU   PSA+781                                                  06704000
PSAMCHFL EQU   PSA+780                                                  06705000
PSACR0   EQU   PSA+776                                                  06706000
PSAPSWSV EQU   PSA+768                                                  06707000
PSALITA  EQU   PSA+764                                                  06708000
PSACLHS  EQU   PSAHLHI                                                  06709000
PSALKR15 EQU   PSALKSA+60                                               06710000
PSALKR14 EQU   PSALKSA+56                                               06711000
PSALKR13 EQU   PSALKSA+52                                               06712000
PSALKR12 EQU   PSALKSA+48                                               06713000
PSALKR11 EQU   PSALKSA+44                                               06714000
PSALKR10 EQU   PSALKSA+40                                               06715000
PSALKR9  EQU   PSALKSA+36                                               06716000
PSALKR8  EQU   PSALKSA+32                                               06717000
PSALKR7  EQU   PSALKSA+28                                               06718000
PSALKR6  EQU   PSALKSA+24                                               06719000
PSALKR5  EQU   PSALKSA+20                                               06720000
PSALKR4  EQU   PSALKSA+16                                               06721000
PSALKR3  EQU   PSALKSA+12                                               06722000
PSALKR2  EQU   PSALKSA+8                                                06723000
PSALKR1  EQU   PSALKSA+4                                                06724000
PSALKR0  EQU   PSALKSA                                                  06725000
PSARV023 EQU   PSACLHT+52                                               06726000
PSALOCAL EQU   PSACLHT+48                                               06727000
PSACMSL  EQU   PSACLHT+44                                               06728000
PSAOPTL  EQU   PSACLHT+40                                               06729000
PSATPACL EQU   PSACLHT+36                                               06730000
PSATPDNL EQU   PSACLHT+32                                               06731000
PSATPNCL EQU   PSACLHT+28                                               06732000
PSAIOSLL EQU   PSACLHT+24                                               06733000
PSAIOSUL EQU   PSACLHT+20                                               06734000
PSAIOSCL EQU   PSACLHT+16                                               06735000
PSAIOSSL EQU   PSACLHT+12                                               06736000
PSASALCL EQU   PSACLHT+8                                                06737000
PSAASML  EQU   PSACLHT+4                                                06738000
PSADISPL EQU   PSACLHT                                                  06739000
PSASRSA  EQU   PSA+636                                                  06740000
PSARV050 EQU   PSA+634                                                  06741000
PSADSSGO EQU   PSA+633                                                  06742000
PSARECUR EQU   PSA+632                                                  06743000
PSAHLHIS EQU   PSA+628                                                  06744000
PSAIPCSA EQU   PSA+624                                                  06745000
@NM00074 EQU   PSA+621                                                  06746000
PSAIPCDM EQU   PSA+620                                                  06747000
PSAIPCD  EQU   PSA+616                                                  06748000
@NM00073 EQU   PSA+613                                                  06749000
PSAIPCRM EQU   PSA+612                                                  06750000
PSAIPCR  EQU   PSA+608                                                  06751000
PSAMCHEX EQU   PSA+600                                                  06752000
PSAMPSW  EQU   PSA+592                                                  06753000
PSAEXPS2 EQU   PSA+584                                                  06754000
PSAEXPS1 EQU   PSA+576                                                  06755000
PSAPIREG EQU   PSA+572                                                  06756000
PSARSREG EQU   PSA+568                                                  06757000
PSAGPREG EQU   PSA+556                                                  06758000
PSARV022 EQU   PSASUP4                                                  06759000
PSARV021 EQU   PSASUP4                                                  06760000
PSARV020 EQU   PSASUP4                                                  06761000
PSARV019 EQU   PSASUP4                                                  06762000
PSARV018 EQU   PSASUP4                                                  06763000
PSARV017 EQU   PSASUP4                                                  06764000
PSARV016 EQU   PSASUP4                                                  06765000
PSARV015 EQU   PSASUP4                                                  06766000
PSARV014 EQU   PSASUP3                                                  06767000
PSARV013 EQU   PSASUP3                                                  06768000
PSARV012 EQU   PSASUP3                                                  06769000
PSAESTA  EQU   PSASUP3                                                  06770000
PSASPR   EQU   PSASUP3                                                  06771000
PSAPSREG EQU   PSASUP3                                                  06772000
PSAPI2   EQU   PSASUP3                                                  06773000
PSAIOSUP EQU   PSASUP3                                                  06774000
PSALCR   EQU   PSASUP2                                                  06775000
PSARTM   EQU   PSASUP2                                                  06776000
PSAACR   EQU   PSASUP2                                                  06777000
PSAIPCE2 EQU   PSASUP2                                                  06778000
PSAIPCES EQU   PSASUP2                                                  06779000
PSAIPCEC EQU   PSASUP2                                                  06780000
PSAGTF   EQU   PSASUP2                                                  06781000
PSAIPCRI EQU   PSASUP2                                                  06782000
PSATYPE6 EQU   PSASUP1                                                  06783000
PSATCTL  EQU   PSASUP1                                                  06784000
PSADISP  EQU   PSASUP1                                                  06785000
PSALOCK  EQU   PSASUP1                                                  06786000
PSAPI    EQU   PSASUP1                                                  06787000
PSAEXT   EQU   PSASUP1                                                  06788000
PSASVC   EQU   PSASUP1                                                  06789000
PSAIO    EQU   PSASUP1                                                  06790000
PSAAOLD  EQU   PSA+548                                                  06791000
PSAANEW  EQU   PSA+544                                                  06792000
PSATOLD  EQU   PSA+540                                                  06793000
PSATNEW  EQU   PSA+536                                                  06794000
PSALCCAR EQU   PSA+532                                                  06795000
PSALCCAV EQU   PSA+528                                                  06796000
PSAPCCAR EQU   PSA+524                                                  06797000
PSAPCCAV EQU   PSA+520                                                  06798000
PSACPULA EQU   PSA+518                                                  06799000
PSACPUPA EQU   PSA+516                                                  06800000
PSAPSA   EQU   PSA+512                                                  06801000
FLCHDEND EQU   PSA+512                                                  06802000
FLCCRSAV EQU   FLCMCLA+280                                              06803000
FLCGRSAV EQU   FLCMCLA+216                                              06804000
FLCFPSAV EQU   FLCMCLA+184                                              06805000
FLCFLA   EQU   FLCMCLA+88                                               06806000
FLCRGNCD EQU   FLCMCLA+84                                               06807000
FLCFSAA  EQU   FLCFSA+1                                                 06808000
@NM00072 EQU   FLCFSA                                                   06809000
@NM00071 EQU   FLCMCLA+72                                               06810000
FLCMCIC  EQU   FLCMCLA+64                                               06811000
@NM00070 EQU   FLCMCLA+20                                               06812000
FLCIOAA  EQU   FLCIOA+1                                                 06813000
@NM00069 EQU   FLCIOA                                                   06814000
@NM00068 EQU   FLCMCLA+15                                               06815000
@NM00067 EQU   FLCMCLA+14                                               06816000
@NM00066 EQU   FLCMCLA+12                                               06817000
FLCLCL   EQU   FLCMCLA+8                                                06818000
FLCIOELA EQU   FLCIOEL+1                                                06819000
@NM00065 EQU   FLCIOEL                                                  06820000
FLCCHNID EQU   FLCMCLA                                                  06821000
@NM00064 EQU   PSA+160                                                  06822000
FLCMTRCD EQU   PSA+157                                                  06823000
@NM00063 EQU   PSA+156                                                  06824000
FLCPERA  EQU   FLCPER+1                                                 06825000
@NM00062 EQU   FLCPER                                                   06826000
@NM00061 EQU   PSA+151                                                  06827000
FLCPERCD EQU   PSA+150                                                  06828000
FLCMCNUM EQU   PSA+149                                                  06829000
@NM00060 EQU   PSA+148                                                  06830000
FLCTEAA  EQU   FLCTEA+1                                                 06831000
@NM00059 EQU   FLCTEA                                                   06832000
PSAPIPC  EQU   PSAPICOD                                                 06833000
PSAPIMC  EQU   PSAPICOD                                                 06834000
PSAPIPER EQU   PSAPICOD                                                 06835000
PSARV049 EQU   FLCPICOD                                                 06836000
FLCPILCB EQU   FLCPIILC                                                 06837000
@NM00058 EQU   FLCPIILC                                                 06838000
@NM00057 EQU   PSAEPPSW                                                 06839000
FLCSVCN  EQU   PSAESPSW+2                                               06840000
FLCSILCB EQU   FLCSVILC                                                 06841000
@NM00056 EQU   FLCSVILC                                                 06842000
@NM00055 EQU   PSAESPSW                                                 06843000
FLCEICOD EQU   PSAEEPSW+2                                               06844000
PSASPAD  EQU   PSAEEPSW                                                 06845000
@NM00054 EQU   PSA+128                                                  06846000
FLCINPSW EQU   PSA+120                                                  06847000
FLCMNPSW EQU   PSA+112                                                  06848000
FLCPNPSW EQU   PSA+104                                                  06849000
FLCSNPSW EQU   PSA+96                                                   06850000
FLCENPSW EQU   PSA+88                                                   06851000
FLCTRACE EQU   PSA+84                                                   06852000
FLCTIMER EQU   PSA+80                                                   06853000
FLCCVT2  EQU   PSA+76                                                   06854000
FLCCAW   EQU   PSA+72                                                   06855000
FLCCSW   EQU   PSA+64                                                   06856000
FLCIOPSW EQU   PSA+56                                                   06857000
FLCMOPSW EQU   PSA+48                                                   06858000
FLCPOPSW EQU   PSA+40                                                   06859000
FLCSOPSW EQU   PSA+32                                                   06860000
FLCEOPSW EQU   PSA+24                                                   06861000
@NM00053 EQU   FLCICCW2+4                                               06862000
FLCCVT   EQU   FLCICCW2                                                 06863000
FLCICCW1 EQU   FLCROPSW                                                 06864000
FLCIPPSW EQU   FLCRNPSW                                                 06865000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      06866000
@RC00232 EQU   @RC00226                                                 06867000
@RC00227 EQU   @RC00226                                                 06868000
@RT00254 EQU   @RC00251                                                 06869000
@RC00391 EQU   @RC00381                                                 06870000
@RC00222 EQU   @RC00220                                                 06871000
@RC00524 EQU   @RC00521                                                 06872000
@RT00620 EQU   @RC00619                                                 06873000
@PB00007 EQU   @EL00001                                                 06874000
@RC00392 EQU   @RC00391                                                 06875000
@RC00224 EQU   @RC00222                                                 06876000
@RC00248 EQU   @RC00224                                                 06877000
@ENDDATA EQU   *                                                        06878000
         END   IGG0CLBG,(C'PLS0834',0701,78122)                         06879000
