         TITLE 'IEDRSPIN, FID1 RESPONSE HANDLER INBOUND                *00001000
                        '                                               00002000
IEDRSPIN CSECT ,                                                   0001 00003000
@PROLOG  DS    0H                                                  0002 00004000
         DC    A(0)                START OF QCB                         00005000
         DC    A(0)                                                     00006000
         DC    X'06'               START OF STCB                        00007000
         DC    AL3(*-1)                                                 00008000
         USING *,RBASE                                                  00009000
         LR    RBASE,R15           ESTABLISH ADDRESSABILTY              00010000
IEDRSPIN IEDHJN START,HJN                                               00011000
*                                                                  0455 00012000
*/********************************************************************/ 00013000
*/*                                                                  */ 00014000
*/*     M A I N     R O U T I N E                                    */ 00015000
*/*                                                                  */ 00016000
*/********************************************************************/ 00017000
*                                                                  0455 00018000
*   RPRF=RPARM;                     /* PIU BUFFER ADDRESS            */ 00019000
         LR    RPRF,RPARM                                          0455 00020000
*   PIUPTR=ADDR(PRFPIUO)+PRFPIUO;   /* ADDRESS OF PIU DATA(TH-RH-RU) */ 00021000
         LA    @10,PRFPIUO(,IEDQPPTR)                              0456 00022000
         SLR   @09,@09                                             0456 00023000
         IC    @09,PRFPIUO(,IEDQPPTR)                              0456 00024000
         ALR   @10,@09                                             0456 00025000
         ST    @10,PIUPTR                                          0456 00026000
*/*                                                                  */ 00027000
*                                                                  0457 00028000
*   IF TRHRUCAT=TRHFMD THEN         /* FM DATA                       */ 00029000
         TM    TRHRUCAT+10(@10),B'01100000'                        0457 00030000
         BNZ   @RF00457                                            0457 00031000
*     CMDBYTE=0;                    /* YES-SET COMMAND BYTE TO 0     */ 00032000
         MVI   CMDBYTE,X'00'                                       0458 00033000
*   ELSE                            /* DATA FLOW CONTROL             */ 00034000
*     DO;                                                          0459 00035000
         B     @RC00457                                            0459 00036000
@RF00457 DS    0H                                                  0460 00037000
*       IF TRHSDI=ON THEN           /* SENSE INCLUDED                */ 00038000
         L     @10,PIUPTR                                          0460 00039000
         TM    TRHSDI+10(@10),B'00000100'                          0460 00040000
         BNO   @RF00460                                            0460 00041000
*         CMDBYTE=RU(5);            /* YES, COMMAND IS PAST SENSE  0461 00042000
*                                      DATA                          */ 00043000
         MVC   CMDBYTE(1),RU+17(@10)                               0461 00044000
*       ELSE                        /* NO SENSE INCLUDED             */ 00045000
*         CMDBYTE=RU(1);            /* COMMAND BYTE IS FIRST BYTE    */ 00046000
         B     @RC00460                                            0462 00047000
@RF00460 L     @10,PIUPTR                                          0462 00048000
         MVC   CMDBYTE(1),RU+13(@10)                               0462 00049000
*     END;                                                         0463 00050000
*                                                                  0463 00051000
@RC00460 DS    0H                                                  0464 00052000
*/*                                                                  */ 00053000
*                                                                  0464 00054000
*   IF TTHEFI=ON THEN               /* EXPEDITED FLOW                */ 00055000
@RC00457 L     @10,PIUPTR                                          0464 00056000
         TM    TTHEFI(@10),B'00000001'                             0464 00057000
         BNO   @RF00464                                            0464 00058000
*     CALL EXPRSP;                  /* YES, PROCESS EXPEDITED FLOW   */ 00059000
         BAL   @14,EXPRSP                                          0465 00060000
*   ELSE                            /* NORMAL FLOW                   */ 00061000
*     DO;                                                          0466 00062000
         B     @RC00464                                            0466 00063000
@RF00464 DS    0H                                                  0467 00064000
*       RPARM=TTHOAF;               /* OAF TNT OFFSET                */ 00065000
         L     @10,PIUPTR                                          0467 00066000
         SLR   RPARM,RPARM                                         0467 00067000
         ICM   RPARM,3,TTHOAF(@10)                                 0467 00068000
*       CALL IEDQTNT;               /* GET OAF TERMINAL ENTRY ADDRESS*/ 00069000
         L     @15,AVTRNMPT(,IEDQAPTR)                             0468 00070000
         BALR  @14,@15                                             0468 00071000
*       RTRM=RPARM-LENGTH(IEDNTRM); /* TTE ADDRESSABILITY            */ 00072000
         LR    RTRM,RPARM                                          0469 00073000
         SL    RTRM,@CF01941                                       0469 00074000
*       RQCB=TRMDESTQ;              /* QCB ADDRESSABILITY            */ 00075000
         SLR   RQCB,RQCB                                           0470 00076000
         ICM   RQCB,7,TRMDESTQ(RTRM)                               0470 00077000
*/*                                                                  */ 00078000
*                                                                  0471 00079000
*       IF QCBPLCBN=ON THEN         /* PLCB ASSIGNED                 */ 00080000
         LR    @10,IEDQQPTR                                        0471 00081000
         SL    @10,@CF00044                                        0471 00082000
         TM    QCBPLCBN(@10),B'10000000'                           0471 00083000
         BNO   @RF00471                                            0471 00084000
*         DO;                       /* YES                           */ 00085000
*           RLCB=QCBPLCBA;          /* PLCB ADDRESSABILITY           */ 00086000
         L     RLCB,QCBPLCBA-1(,@10)                               0473 00087000
         LA    RLCB,0(,RLCB)                                       0473 00088000
*           SIBPTR=TRMSIBPT;        /* SIB ADDRESSABILITY            */ 00089000
         SLR   @10,@10                                             0474 00090000
         ICM   @10,7,TRMSIBPT(RTRM)                                0474 00091000
         ST    @10,SIBPTR                                          0474 00092000
*/*                                                                  */ 00093000
*                                                                  0475 00094000
*           VALRSPSW=ON;            /* INIT 'VALID RESPONSE' SWITCH  */ 00095000
*           XFORMSW=OFF;            /* NO TRANSFORMATION     @OY19613*/ 00096000
         OI    VALRSPSW,B'10000000'                                0476 00097000
         NI    XFORMSW,B'10111111'                                 0476 00098000
*/*                                                                  */ 00099000
*                                                                  0477 00100000
*           IF TRHRUCAT=TRHFMD THEN /* FM DATA                       */ 00101000
         L     @10,PIUPTR                                          0477 00102000
         TM    TRHRUCAT+10(@10),B'01100000'                        0477 00103000
         BNZ   @RF00477                                            0477 00104000
*             CALL FMDRSP;          /* YES, PROCESS FM DATA RESPONSE */ 00105000
         BAL   @14,FMDRSP                                          0478 00106000
*           ELSE                    /* DATA FLOW CONTROL             */ 00107000
*             CALL DFCRSP;          /* PROCESS DATA FLOW CONTROL RSP */ 00108000
         B     @RC00477                                            0479 00109000
@RF00477 BAL   @14,DFCRSP                                          0479 00110000
*/*                                                                  */ 00111000
*                                                                  0480 00112000
*           IF VALRSPSW=ON THEN     /* VALID RESPONSE                */ 00113000
@RC00477 TM    VALRSPSW,B'10000000'                                0480 00114000
         BNO   @RF00480                                            0480 00115000
*             DO;                   /* YES                           */ 00116000
*               IF SIBFMODE=SIBHDXFF&/* HALF DUPLEX MODE &   @YM06990*/ 00117000
*                   TRHSDI=ON THEN  /* EXCEPTION RESPONSE    @YM06990*/ 00118000
         L     @10,SIBPTR                                          0482 00119000
         TM    SIBFMODE(@10),B'10000000'                           0482 00120000
         BNO   @RF00482                                            0482 00121000
         TM    SIBFMODE(@10),B'01000000'                           0482 00122000
         BNZ   @RF00482                                            0482 00123000
         L     @09,PIUPTR                                          0482 00124000
         TM    TRHSDI+10(@09),B'00000100'                          0482 00125000
         BNO   @RF00482                                            0482 00126000
*                 IF SIBRECOV=ON THEN/* TCAM LU NOT RESPONSIBLE    0483 00127000
*                                                            @YM06990*/ 00128000
         TM    SIBRECOV(@10),B'00100000'                           0483 00129000
         BNO   @RF00483                                            0483 00130000
*                   SIBCD=OFF;      /* INDICATE RECEIVE STATE      0484 00131000
*                                                            @YM06990*/ 00132000
         NI    SIBCD(@10),B'01111111'                              0484 00133000
*                 ELSE              /* TCAM LU RESPONSIBLE FOR     0485 00134000
*                                      RECOVERY              @YM06990*/ 00135000
*                   SIBCD=ON;       /* INDICATE SEND STATE   @YM06990*/ 00136000
         B     @RC00483                                            0485 00137000
@RF00483 L     @10,SIBPTR                                          0485 00138000
         OI    SIBCD(@10),B'10000000'                              0485 00139000
*/*                                                                  */ 00140000
*                                                                  0486 00141000
*               IF SAVTBSM^=0&      /* BRACKET MANAGER LOADED AND... */ 00142000
*                   SIBBRACK=ON THEN/* RUNNING BRACKETS THIS SESSION */ 00143000
@RC00483 DS    0H                                                  0486 00144000
@RF00482 L     @10,AVTSAVTP(,IEDQAPTR)                             0486 00145000
         L     @10,SAVTBSM(,@10)                                   0486 00146000
         LTR   @10,@10                                             0486 00147000
         BZ    @RF00486                                            0486 00148000
         L     @10,SIBPTR                                          0486 00149000
         TM    SIBBRACK(@10),B'00000100'                           0486 00150000
         BNO   @RF00486                                            0486 00151000
*                 DO;                                              0487 00152000
*                   PLBM=''B;       /* INIT PARM LIST TO ZEROS       */ 00153000
         XC    PLBM(16),PLBM                                       0488 00154000
*                   IF XFORMSW=ON THEN/* IF PIU CONVERTED TO BUFFER     00155000
*                                                            @OY19613*/ 00156000
         TM    XFORMSW,B'01000000'                                 0489 00157000
         BNO   @RF00489                                            0489 00158000
*                     PLBMRH=PRF1RH;/* MOVE RH TO PARM LIST  @OX19978*/ 00159000
         LA    @10,PLBM                                            0490 00160000
         LR    @09,IEDQPPTR                                        0490 00161000
         AL    @09,@CF02271                                        0490 00162000
         MVC   PLBMRH(3,@10),PRF1RH(@09)                           0490 00163000
*                   ELSE            /*                       @OY19613*/ 00164000
*                     PLBMRH=IEDRH; /* MOVE RH               @OY19613*/ 00165000
         B     @RC00489                                            0491 00166000
@RF00489 LA    @10,PLBM                                            0491 00167000
         L     @09,PIUPTR                                          0491 00168000
         MVC   PLBMRH(3,@10),IEDRH+10(@09)                         0491 00169000
*                   PLBMSNC=RU(1:2);/* 1ST 2 BYTES OF RU(IF SENSE IS    00170000
*                                      INCLUDED THIS WILL BE 1ST 2 0492 00171000
*                                      BYTES OF SENSE)               */ 00172000
@RC00489 LA    @10,PLBM                                            0492 00173000
         L     @09,PIUPTR                                          0492 00174000
         MVC   PLBMSNC(2,@10),RU+13(@09)                           0492 00175000
*                   PLBMCMD=CMDBYTE;/* COMMAND CODE(0 FOR FM DATA)   */ 00176000
         MVC   PLBMCMD(1,@10),CMDBYTE                              0493 00177000
*                   PLBMSIB=SIBPTR; /* SIB ADDRESS                   */ 00178000
         L     @09,SIBPTR                                          0494 00179000
         ST    @09,PLBMSIB(,@10)                                   0494 00180000
*                   PLBMLCB=RLCB;   /* LCB ADDRESS                   */ 00181000
         ST    RLCB,PLBMLCB(,@10)                                  0495 00182000
*                   RPARM=ADDR(PLBM);/* ADDRESS OF PARM LIST         */ 00183000
         LR    RPARM,@10                                           0496 00184000
*                   CALL IEDBSM;    /* DO BRACKET MANAGEMENT         */ 00185000
         L     @10,AVTSAVTP(,IEDQAPTR)                             0497 00186000
         L     @15,SAVTBSM(,@10)                                   0497 00187000
         BALR  @14,@15                                             0497 00188000
*                 END;                                             0498 00189000
*             END;                                                 0499 00190000
*           ELSE                    /* INVALID RESPONSE              */ 00191000
*             DO;                                                  0500 00192000
         B     @RC00480                                            0500 00193000
@RF00480 DS    0H                                                  0501 00194000
*               RPARM=RPRF;         /* ADDRESS OF PIU BUFFER         */ 00195000
         LR    RPARM,RPRF                                          0501 00196000
*               CALL DISCARD;       /* DISCARD INVALID RESPONSE      */ 00197000
         BAL   @14,DISCARD                                         0502 00198000
*             END;                                                 0503 00199000
*         END;                                                     0504 00200000
*       ELSE                        /* NO PLCB ASSIGNED              */ 00201000
*         DO;                                                      0505 00202000
         B     @RC00471                                            0505 00203000
@RF00471 DS    0H                                                  0506 00204000
*           RPARM=RPRF;             /* ADDRESS OF PIU BUFFER         */ 00205000
         LR    RPARM,RPRF                                          0506 00206000
*           CALL DISCARD;           /* DISCARD RSP PIU               */ 00207000
         BAL   @14,DISCARD                                         0507 00208000
*         END;                                                     0508 00209000
*     END;                                                         0509 00210000
*                                                                  0509 00211000
@RC00471 DS    0H                                                  0510 00212000
*/*                                                                  */ 00213000
*                                                                  0510 00214000
*   CALL DSPDISP;                   /* EXIT TO DISPATCHER            */ 00215000
@RC00464 LA    @15,DSPDISP(,RDISP)                                 0510 00216000
         BALR  @14,@15                                             0510 00217000
*/********************************************************************/ 00218000
*/*  E N D   O F   M A I N   R O U T I N E                           */ 00219000
*/********************************************************************/ 00220000
*                                                                  0511 00221000
*                                                                  0511 00222000
*/********************************************************************/ 00223000
*/*                                                                  */ 00224000
*/* THIS ROUTINE BUILDS A '0 LENGTH E3' ERROR BUFFER.                */ 00225000
*/*    INPUT: RPARM CONTAINS THE ADDRESS OF THE PIU BUFFER IN WHICH  */ 00226000
*/*           THE ERROR BUFFER IS TO BE BUILT.                       */ 00227000
*/*                                                                  */ 00228000
*/********************************************************************/ 00229000
*                                                                  0511 00230000
*   RFY                                                            0511 00231000
*     IEDQPRF BASED(BUFPTR);                                       0511 00232000
*BLDERBUF:                                                         0512 00233000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0512 00234000
@EL00001 DS    0H                                                  0512 00235000
@EF00001 DS    0H                                                  0512 00236000
@ER00001 BR    @14                                                 0512 00237000
BLDERBUF DS    0H                                                  0513 00238000
*   R14SV01=R14;                    /* SAVE RETURN ADDRESS           */ 00239000
         ST    R14,R14SV01                                         0513 00240000
*/*                                                                  */ 00241000
*                                                                  0514 00242000
*   BUFPTR=RPARM;                   /* SET BUFFER ADDRESSABILITY     */ 00243000
         LR    BUFPTR,RPARM                                        0514 00244000
*/*                                                                  */ 00245000
*                                                                  0515 00246000
*   CALL XFORM;                     /* TRANSFORM PIU BUFFER TO 'TCAM'   00247000
*                                      BUFFER FORMAT                 */ 00248000
         BAL   @14,XFORM                                           0515 00249000
*   PRF1RULN=PRFSIZE-(AVTHDRSZ+PRFISIZE);/* SET UP RU LENGTH         */ 00250000
         LR    @09,BUFPTR                                          0516 00251000
         SL    @09,@CF00044                                        0516 00252000
         LA    @05,30                                              0516 00253000
         SLR   @02,@02                                             0516 00254000
         IC    @02,PRFISIZE(,BUFPTR)                               0516 00255000
         ALR   @05,@02                                             0516 00256000
         LCR   @05,@05                                             0516 00257000
         AH    @05,PRFSIZE(,BUFPTR)                                0516 00258000
         STH   @05,PRF1RULN(,@09)                                  0516 00259000
*   PRF1FORM=PRF1SQLI;              /* INDICATE LENGTH AND SEQ # ARE    00260000
*                                      PRESENT                       */ 00261000
         OI    PRF1FORM(@09),B'00110000'                           0517 00262000
*   PRFSIZE=0;                      /* MARK AS '0 LENGTH' BUFFER     */ 00263000
         SLR   @09,@09                                             0518 00264000
         STH   @09,PRFSIZE(,BUFPTR)                                0518 00265000
*/*                                                                  */ 00266000
*                                                                  0519 00267000
*   IF QCBTSSES=ON THEN                                            0519 00268000
         TM    QCBTSSES(IEDQQPTR),B'10000000'                      0519 00269000
         BNO   @RF00519                                            0519 00270000
*     PRFTSMSG=ON;                  /* IF THIS IS TIME SHARING, SET     00271000
*                                      TSO INDICATOR                 */ 00272000
         OI    PRFTSMSG(BUFPTR),B'00010000'                        0520 00273000
*   PRFQCBA=LCBMHA;                 /* SET MH FROM LCB       @YM06085*/ 00274000
@RF00519 MVC   PRFQCBA(3,BUFPTR),LCBMHA(IEDQLPTR)                  0521 00275000
*/*                                                                  */ 00276000
*                                                                  0522 00277000
*   PRFPRI=PRIERBFR;                /* ERROR POST PRIORITY           */ 00278000
         MVI   PRFPRI(BUFPTR),X'E3'                                0522 00279000
*   LCBERROR=ON;                    /* STOP THE DISK                 */ 00280000
         OI    LCBERROR(IEDQLPTR),B'00000100'                      0523 00281000
*   LCBABRTN=ON;                    /* SET ABORT FLAG                */ 00282000
         OI    LCBABRTN(IEDQLPTR),B'00000001'                      0524 00283000
*   LCBRCQCB=AVTMSGS->BDQCB;        /* IEDQBD'S QCB ADDRESS          */ 00284000
         L     @10,AVTMSGS-1(,IEDQAPTR)                            0525 00285000
         L     @10,BDQCB(,@10)                                     0525 00286000
         ST    @10,LCBRCQCB(,IEDQLPTR)                             0525 00287000
*/*                                                                  */ 00288000
*                                                                  0526 00289000
*   R14=R14SV01;                    /* RESTORE RETURN ADDRESS        */ 00290000
         L     R14,R14SV01                                         0526 00291000
*   RETURN;                         /* RETURN TO CALLER              */ 00292000
@EL00002 DS    0H                                                  0527 00293000
@EF00002 DS    0H                                                  0527 00294000
@ER00002 BR    @14                                                 0527 00295000
*   END BLDERBUF;                                                  0528 00296000
*   RFY                                                            0529 00297000
*     IEDQPRF BASED(IEDQPPTR);                                     0529 00298000
*                                                                  0530 00299000
*/********************************************************************/ 00300000
*/*                                                                  */ 00301000
*/* THIS ROUTINE HANDLES ALL RESPONSES TO DATA FLOW CONTROL COMMANDS */ 00302000
*/*                                                                  */ 00303000
*/********************************************************************/ 00304000
*                                                                  0530 00305000
*DFCRSP:                                                           0530 00306000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0530 00307000
DFCRSP   DS    0H                                                  0531 00308000
*   R14SV02=R14;                    /* SAVE RETURN ADDRESS           */ 00309000
         ST    R14,R14SV02                                         0531 00310000
*/*                                                                  */ 00311000
*                                                                  0532 00312000
*   IF LCBCHN=LCBWCAN THEN          /* 'WAITING FOR CANCEL RESPONSE'    00313000
*                                      STATE                         */ 00314000
         TM    LCBCHN(IEDQLPTR),B'01010000'                        0532 00315000
         BNO   @RF00532                                            0532 00316000
         TM    LCBCHN(IEDQLPTR),B'10100000'                        0532 00317000
         BNZ   @RF00532                                            0532 00318000
*     DO;                           /* YES                           */ 00319000
*       IF CMDBYTE=CD1CANCL THEN    /* CANCEL PIU                    */ 00320000
         CLI   CMDBYTE,X'83'                                       0534 00321000
         BNE   @RF00534                                            0534 00322000
*         DO;                       /* YES                           */ 00323000
*           LCBCHN=LCBBETC;         /* GO TO 'BETWEEN CHAIN-WAITING     00324000
*                                      FOR NO RESPONSE' STATE        */ 00325000
         NI    LCBCHN(IEDQLPTR),B'00001111'                        0536 00326000
*           RPARM=LCBRSPSV;         /* ADDRESS OF SAVED RESPONSE PIU */ 00327000
         L     RPARM,LCBRSPSV(,IEDQLPTR)                           0537 00328000
*           CALL BLDERBUF;          /* CONVERT SAVED RESPONSE TO   0538 00329000
*                                      ERROR BUFFER                  */ 00330000
         BAL   @14,BLDERBUF                                        0538 00331000
*           RPARM=LCBRSPSV;         /* ADDRESS OF ERROR BUFFER JUST     00332000
*                                      BUILT                         */ 00333000
         L     RPARM,LCBRSPSV(,IEDQLPTR)                           0539 00334000
*           CALL DSPPOSTR;          /* POST ERROR BUFFER TO MH       */ 00335000
         LA    @15,DSPPOSTR(,RDISP)                                0540 00336000
         BALR  @14,@15                                             0540 00337000
*           LCBRSPSV=0;             /* ZERO SAVED RESPONSE ADDRESS   */ 00338000
         SLR   @10,@10                                             0541 00339000
         ST    @10,LCBRSPSV(,IEDQLPTR)                             0541 00340000
*           RPARM=RPRF;             /* ADDRESS OF CANCEL PIU BUFFER  */ 00341000
         LR    RPARM,RPRF                                          0542 00342000
*           CALL DISCARD;           /* DISCARD CANCEL                */ 00343000
         BAL   @14,DISCARD                                         0543 00344000
*         END;                                                     0544 00345000
*       ELSE                        /* NOT CANCEL COMMAND            */ 00346000
*         VALRSPSW=OFF;             /* MARK RESPONSE AS INVALID      */ 00347000
         B     @RC00534                                            0545 00348000
@RF00534 NI    VALRSPSW,B'01111111'                                0545 00349000
*     END;                                                         0546 00350000
*   ELSE                            /* NOT WAITING FOR CANCEL      0547 00351000
*                                      RESPONSE                      */ 00352000
*     DO;                                                          0547 00353000
         B     @RC00532                                            0547 00354000
@RF00532 DS    0H                                                  0548 00355000
*       IF LCBCHN=LCBWBID&          /* 'WAITING FOR BID RESPONSE'  0548 00356000
*                                      STATE                         */ 00357000
*           CMDBYTE=CD1BID THEN     /* BID COMMAND RESPONSE          */ 00358000
         TM    LCBCHN(IEDQLPTR),B'01100000'                        0548 00359000
         BNO   @RF00548                                            0548 00360000
         TM    LCBCHN(IEDQLPTR),B'10010000'                        0548 00361000
         BNZ   @RF00548                                            0548 00362000
         CLI   CMDBYTE,X'C8'                                       0548 00363000
         BNE   @RF00548                                            0548 00364000
*         DO;                                                      0549 00365000
*           LCBCHN=LCBBETC;         /* GO TO 'BETWEEN CHAIN-WAITING     00366000
*                                      FOR NO RESPONSE' STATE        */ 00367000
         NI    LCBCHN(IEDQLPTR),B'00001111'                        0550 00368000
*           IF TRHSDI=ON THEN       /* SENSE INCLUDED                */ 00369000
         L     @10,PIUPTR                                          0551 00370000
         TM    TRHSDI+10(@10),B'00000100'                          0551 00371000
         BNO   @RF00551                                            0551 00372000
*             DO;                   /* YES                           */ 00373000
*               CALL SETERSNS;      /* SET ERROR WORD INFORMATION    */ 00374000
         BAL   @14,SETERSNS                                        0553 00375000
*               SCBSLCTN=ON;        /* SET SELECTION ERROR           */ 00376000
         L     @10,IEDQSPTR-1(,IEDQLPTR)                           0554 00377000
         OI    SCBSLCTN(@10),B'10000000'                           0554 00378000
*             END;                                                 0555 00379000
*                                                                  0555 00380000
*/*                                                                  */ 00381000
*                                                                  0556 00382000
*           RPARM=RPRF;             /* BID RESPONSE ADDRESS          */ 00383000
@RF00551 LR    RPARM,RPRF                                          0556 00384000
*           CALL XFORM;             /* TRANSFORM TO 'TCAM BUFFER'  0557 00385000
*                                      FORMAT                        */ 00386000
         BAL   @14,XFORM                                           0557 00387000
*           PRFQCBA=SAVTDNIR;       /* IEDNGD'S QCB ADDRESS          */ 00388000
         L     @10,AVTSAVTP(,IEDQAPTR)                             0558 00389000
         MVC   PRFQCBA(3,IEDQPPTR),SAVTDNIR+1(@10)                 0558 00390000
*           PRFPRI=PRIRESUM;        /* POST PRIORITY                 */ 00391000
         MVI   PRFPRI(IEDQPPTR),X'E5'                              0559 00392000
*           RPARM=RPRF;             /* BID RESPONSE BUFFER           */ 00393000
         LR    RPARM,RPRF                                          0560 00394000
*           CALL DSPPOSTR;          /* POST BID RESPONSE TO IEDNGD 0561 00395000
*                                      (OUTPUT DATA HANDLER)         */ 00396000
         LA    @15,DSPPOSTR(,RDISP)                                0561 00397000
         BALR  @14,@15                                             0561 00398000
*         END;                                                     0562 00399000
*       ELSE                                                       0563 00400000
*         VALRSPSW=OFF;             /* MARK RESPONSE AS INVALID      */ 00401000
         B     @RC00548                                            0563 00402000
@RF00548 NI    VALRSPSW,B'01111111'                                0563 00403000
*     END;                                                         0564 00404000
*                                                                  0564 00405000
@RC00548 DS    0H                                                  0565 00406000
*/*                                                                  */ 00407000
*                                                                  0565 00408000
*   R14=R14SV02;                    /* RESTORE RETURN ADDRESS        */ 00409000
@RC00532 L     R14,R14SV02                                         0565 00410000
*   RETURN;                         /* RETURN TO CALLER              */ 00411000
@EL00003 DS    0H                                                  0566 00412000
@EF00003 DS    0H                                                  0566 00413000
@ER00003 BR    @14                                                 0566 00414000
*   END DFCRSP;                                                    0567 00415000
*                                                                  0568 00416000
*/********************************************************************/ 00417000
*/*                                                                  */ 00418000
*/* THIS ROUTINE DISCARDS ALL THE UNITS IN A PIU BUFFER.  IT POSTS   */ 00419000
*/* THEM TO BUF  RETURN(IEDQGB).                                     */ 00420000
*/*       INPUT= REG1 POINTS TO PIU BUFFER TO BE DISCARDED           */ 00421000
*/*                                                                  */ 00422000
*/********************************************************************/ 00423000
*                                                                  0568 00424000
*DISCARD:                                                          0568 00425000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0568 00426000
DISCARD  DS    0H                                                  0569 00427000
*   R14SV07=R14;                    /* SAVE RETURN REG               */ 00428000
         ST    R14,R14SV07                                         0569 00429000
*/*                                                                  */ 00430000
*                                                                  0570 00431000
*   RPARM->PRFNBUNT=0;              /* SET NUMBER OF UNITS = 0 (THIS    00432000
*                                      MEANS IEDQGB WILL CALCULATE 0570 00433000
*                                      THE NUMBER OF UNITS TO BE   0570 00434000
*                                      FREED)                        */ 00435000
         MVI   PRFNBUNT(RPARM),X'00'                               0570 00436000
*   RPARM->PRFQCBA=ADDR(AVTBFRTB);  /* ADDR OF BUFFER RETURN QCB     */ 00437000
         LA    @10,AVTBFRTB(,IEDQAPTR)                             0571 00438000
         STCM  @10,7,PRFQCBA(RPARM)                                0571 00439000
*   RPARM->PRFPRI=PRIBFRTB;         /* POST PRIORITY                 */ 00440000
         MVI   PRFPRI(RPARM),X'E0'                                 0572 00441000
*   CALL DSPPOSTR;                  /* FREE UNITS                    */ 00442000
         LA    @15,DSPPOSTR(,RDISP)                                0573 00443000
         BALR  @14,@15                                             0573 00444000
*/*                                                                  */ 00445000
*                                                                  0574 00446000
*   R14=R14SV07;                    /* RESTORE RETURN REG            */ 00447000
         L     R14,R14SV07                                         0574 00448000
*   RETURN;                         /* RETURN TO CALLER              */ 00449000
@EL00004 DS    0H                                                  0575 00450000
@EF00004 DS    0H                                                  0575 00451000
@ER00004 BR    @14                                                 0575 00452000
*   END DISCARD;                                                   0576 00453000
*                                                                  0577 00454000
*/********************************************************************/ 00455000
*/*                                                                  */ 00456000
*/* THIS ROUTINE HANDLES ALL EXPEDITED FLOW RESPONSES.               */ 00457000
*/*                                                                  */ 00458000
*/********************************************************************/ 00459000
*                                                                  0577 00460000
*EXPRSP:                                                           0577 00461000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0577 00462000
EXPRSP   DS    0H                                                  0578 00463000
*   R14SV03=R14;                    /* SAVE RETURN ADDRESS           */ 00464000
         ST    R14,R14SV03                                         0578 00465000
*/*                                                                  */ 00466000
*                                                                  0579 00467000
*   RPARM=RPRF;                     /* ADDRESS OF RESPONSE PIU BUFFER*/ 00468000
         LR    RPARM,RPRF                                          0579 00469000
*   CALL DISCARD;                   /* DISCARD THIS RESPONSE         */ 00470000
         BAL   @14,DISCARD                                         0580 00471000
*/*                                                                  */ 00472000
*                                                                  0581 00473000
*   IF QCBTSSES=ON THEN             /* TSO SESSION?          @OY19950*/ 00474000
         TM    QCBTSSES(IEDQQPTR),B'10000000'                      0581 00475000
         BNO   @RF00581                                            0581 00476000
*     DO;                           /*                       @OY19950*/ 00477000
*       RPARM=RLCB;                 /* PLCB ADDRESS          @OY19950*/ 00478000
         LR    RPARM,RLCB                                          0583 00479000
*       LCBPRI=PRILNFRE;            /* PLCB POST PRIORITY    @OY19950*/ 00480000
         MVI   LCBPRI(IEDQLPTR),X'E0'                              0584 00481000
*       LCBQCBA=RLCB;               /* POST PLCB TO ITSELF   @OY19950*/ 00482000
         STCM  RLCB,7,LCBQCBA(IEDQLPTR)                            0585 00483000
*       CALL DSPPOSTR;              /*                       @OY19950*/ 00484000
         LA    @15,DSPPOSTR(,RDISP)                                0586 00485000
         BALR  @14,@15                                             0586 00486000
*     END;                          /*                       @OY19950*/ 00487000
*   R14=R14SV03;                    /* RESTORE RETURN ADDRESS        */ 00488000
@RF00581 L     R14,R14SV03                                         0588 00489000
*   RETURN;                         /* RETURN TO CALLER              */ 00490000
@EL00005 DS    0H                                                  0589 00491000
@EF00005 DS    0H                                                  0589 00492000
@ER00005 BR    @14                                                 0589 00493000
*   END EXPRSP;                                                    0590 00494000
*                                                                  0591 00495000
*/********************************************************************/ 00496000
*/*                                                                  */ 00497000
*/* THIS ROUTINE HANDLES ALL RESPONSES TO FM DATA.                   */ 00498000
*/*                                                                  */ 00499000
*/********************************************************************/ 00500000
*                                                                  0591 00501000
*FMDRSP:                                                           0591 00502000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0591 00503000
FMDRSP   DS    0H                                                  0592 00504000
*   R14SV04=R14;                    /* SAVE RETURN ADDRESS           */ 00505000
         ST    R14,R14SV04                                         0592 00506000
*/*                                                                  */ 00507000
*                                                                  0593 00508000
*   IF LCBRECVN=ON THEN             /* LCB MARKED RECEIVING          */ 00509000
         TM    LCBRECVN(IEDQLPTR),B'00000010'                      0593 00510000
         BNO   @RF00593                                            0593 00511000
*     DO;                           /* YES                           */ 00512000
*       IF LCBCHN=LCBWMG THEN       /* 'WAITING FOR MSGGEN RESPONSE'    00513000
*                                      STATE (A MSGGEN WAS SENT OUT     00514000
*                                      OF INMSG)                     */ 00515000
         TM    LCBCHN(IEDQLPTR),B'00110000'                        0595 00516000
         BNO   @RF00595                                            0595 00517000
         TM    LCBCHN(IEDQLPTR),B'11000000'                        0595 00518000
         BNZ   @RF00595                                            0595 00519000
*         CALL MSGGNRSP;            /* PROCESS MSGGEN RESPONSE       */ 00520000
         BAL   @14,MSGGNRSP                                        0596 00521000
*       ELSE                        /* NOT WAITING FOR MSGGEN      0597 00522000
*                                      RESPONSE                      */ 00523000
*         DO;                                                      0597 00524000
         B     @RC00595                                            0597 00525000
@RF00595 DS    0H                                                  0598 00526000
*           IF LCBCHN=LCBWSMI THEN  /* 'WAITING FOR START MI       0598 00527000
*                                      RESPONSE' STATE (TSO ONLY)    */ 00528000
         TM    LCBCHN(IEDQLPTR),B'10000000'                        0598 00529000
         BNO   @RF00598                                            0598 00530000
         TM    LCBCHN(IEDQLPTR),B'01110000'                        0598 00531000
         BNZ   @RF00598                                            0598 00532000
*             DO;                   /* YES                           */ 00533000
*               LCBCHN=LCBBETC;     /* GO TO 'BETWEEN CHAIN-WAITING     00534000
*                                      FOR NO RESPONSE' STATE        */ 00535000
         NI    LCBCHN(IEDQLPTR),B'00001111'                        0600 00536000
*               RPARM=RPRF;         /* ADDR OF PIU BFR       @YM07714*/ 00537000
         LR    RPARM,RPRF                                          0601 00538000
*               CALL DISCARD;       /* FREE PIU BFR          @YM07714*/ 00539000
         BAL   @14,DISCARD                                         0602 00540000
*               LCBRCLLN=ON;        /* INDICATE BFRS FREED   @YM07714*/ 00541000
         OI    LCBRCLLN(IEDQLPTR),B'10000000'                      0603 00542000
*               RPARM=RLCB;         /* LCB ADDRESS                   */ 00543000
         LR    RPARM,RLCB                                          0604 00544000
*               LCBPRI=PRILCB;      /* LCB POST PRIORITY             */ 00545000
         MVI   LCBPRI(IEDQLPTR),X'E7'                              0605 00546000
*               LCBQCBA=AVTMSGS->BDQCB;/* IEDQBD'S QCB               */ 00547000
         L     @10,AVTMSGS-1(,IEDQAPTR)                            0606 00548000
         MVC   LCBQCBA(3,IEDQLPTR),BDQCB+1(@10)                    0606 00549000
*               CALL DSPPOSTR;      /* POST LCB TO IEDQBD            */ 00550000
         LA    @15,DSPPOSTR(,RDISP)                                0607 00551000
         BALR  @14,@15                                             0607 00552000
*             END;                                                 0608 00553000
*           ELSE                                                   0609 00554000
*             DO;                                                  0609 00555000
         B     @RC00598                                            0609 00556000
@RF00598 DS    0H                                                  0610 00557000
*               IF LCBCHN=LCBWERAS THEN/* 'WAITING FOR SCREEN ERASURE   00558000
*                                      RESPONSE' STATE (TSO ONLY)    */ 00559000
         TM    LCBCHN(IEDQLPTR),B'01110000'                        0610 00560000
         BNO   @RF00610                                            0610 00561000
         TM    LCBCHN(IEDQLPTR),B'10000000'                        0610 00562000
         BNZ   @RF00610                                            0610 00563000
*                 DO;               /* YES                           */ 00564000
*                   LCBCHN=LCBBETC; /* GO TO 'BETWEEN CHAIN-WAITING     00565000
*                                      FOR NO RESPONSE' STATE        */ 00566000
         NI    LCBCHN(IEDQLPTR),B'00001111'                        0612 00567000
*                   RPARM=RPRF;     /* RESPONSE PIU ADDRESS          */ 00568000
         LR    RPARM,RPRF                                          0613 00569000
*                   CALL DISCARD;   /* DISCARD RESPONSE              */ 00570000
         BAL   @14,DISCARD                                         0614 00571000
*                   LCBERBPY=PRILNEND;/* ERB POST PRIORITY           */ 00572000
         MVI   LCBERBPY(IEDQLPTR),X'E4'                            0615 00573000
*                   LCBERBQB=AVTTSOPT->TSIMSGEN;/* IEDAYM'S QCB      */ 00574000
         L     @10,AVTTSOPT(,IEDQAPTR)                             0616 00575000
         MVC   LCBERBQB(3,IEDQLPTR),TSIMSGEN+1(@10)                0616 00576000
*                   RPARM=ADDR(LCBERB);/* ERB ADDRESS                */ 00577000
         LA    RPARM,LCBERB(,IEDQLPTR)                             0617 00578000
*                   CALL DSPPOSTR;  /* POST ERB TO IEDAYM            */ 00579000
         LA    @15,DSPPOSTR(,RDISP)                                0618 00580000
         BALR  @14,@15                                             0618 00581000
*                 END;                                             0619 00582000
*               ELSE                                               0620 00583000
*                 VALRSPSW=OFF;     /* MARK RESPONSE AS INVALID      */ 00584000
         B     @RC00610                                            0620 00585000
@RF00610 NI    VALRSPSW,B'01111111'                                0620 00586000
*             END;                                                 0621 00587000
*         END;                                                     0622 00588000
*     END;                                                         0623 00589000
*   ELSE                            /* LCB MARKED SENDING            */ 00590000
*     DO;                                                          0624 00591000
         B     @RC00593                                            0624 00592000
@RF00593 DS    0H                                                  0625 00593000
*       IF LCBCHN=LCBWFMD THEN      /* 'WAITING FOR RESPONSE TO FM 0625 00594000
*                                      DATA                          */ 00595000
         TM    LCBCHN(IEDQLPTR),B'01000000'                        0625 00596000
         BNO   @RF00625                                            0625 00597000
         TM    LCBCHN(IEDQLPTR),B'10110000'                        0625 00598000
         BNZ   @RF00625                                            0625 00599000
*         DO;                       /* YES                           */ 00600000
*           LCBCHN=LCBBETC;         /* GO TO 'BETWEEN CHAIN-WAITING     00601000
*                                      FOR NO RESPONSE' STATE        */ 00602000
         NI    LCBCHN(IEDQLPTR),B'00001111'                        0627 00603000
*           IF TRHSDI=ON THEN       /* EXCEPTION RESPONSE            */ 00604000
         L     @10,PIUPTR                                          0628 00605000
         TM    TRHSDI+10(@10),B'00000100'                          0628 00606000
         BNO   @RF00628                                            0628 00607000
*             DO;                   /* YES                           */ 00608000
*               CALL SETERSNS;      /* SET UP ERROR INFORMATION      */ 00609000
         BAL   @14,SETERSNS                                        0630 00610000
*               RPARM=RPRF;         /* PIU RESPONSE ADDRESS          */ 00611000
         LR    RPARM,RPRF                                          0631 00612000
*               CALL BLDERBUF;      /* BUILD ERROR BUFFER            */ 00613000
         BAL   @14,BLDERBUF                                        0632 00614000
*             END;                                                 0633 00615000
*           ELSE                    /* POSITIVE RESPONSE TO FM DATA  */ 00616000
*             DO;                                                  0634 00617000
         B     @RC00628                                            0634 00618000
@RF00628 DS    0H                                                  0635 00619000
*               RPARM=RPRF;         /* +RSP PIU ADDRESS              */ 00620000
         LR    RPARM,RPRF                                          0635 00621000
*               CALL XFORM;         /* TRANSFORM INTO 'TCAM BUFFER'     00622000
*                                      FORMAT                        */ 00623000
         BAL   @14,XFORM                                           0636 00624000
*               PRFQCBA=AVTMSGS->BDQCB;/* IEDQBD'S QCB               */ 00625000
         L     @10,AVTMSGS-1(,IEDQAPTR)                            0637 00626000
         MVC   PRFQCBA(3,IEDQPPTR),BDQCB+1(@10)                    0637 00627000
*               IF QCBTSSES=ON THEN /* IF TIME SHARING SESSION       */ 00628000
         TM    QCBTSSES(IEDQQPTR),B'10000000'                      0638 00629000
         BNO   @RF00638                                            0638 00630000
*                 PRFTSMSG=ON;      /* SET TSO INDICATOR             */ 00631000
         OI    PRFTSMSG(IEDQPPTR),B'00010000'                      0639 00632000
*               PRFPRI=PRILNEND;    /* NON-ERROR PRIORITY            */ 00633000
@RF00638 MVI   PRFPRI(IEDQPPTR),X'E4'                              0640 00634000
*             END;                                                 0641 00635000
*                                                                  0641 00636000
*/*                                                                  */ 00637000
*                                                                  0642 00638000
*           RPARM=RPRF;             /* RESPONSE BUFFER ADDRESS       */ 00639000
@RC00628 LR    RPARM,RPRF                                          0642 00640000
*           CALL DSPPOSTR;          /* POST THE RESPONSE BUFFER      */ 00641000
         LA    @15,DSPPOSTR(,RDISP)                                0643 00642000
         BALR  @14,@15                                             0643 00643000
*         END;                                                     0644 00644000
*       ELSE                        /* NOT WAITING FOR FM DATA RSP   */ 00645000
*         DO;                                                      0645 00646000
         B     @RC00625                                            0645 00647000
@RF00625 DS    0H                                                  0646 00648000
*           IF LCBCHN=LCBWMG THEN   /* 'WAITING FOR MSGGEN RESPONSE'    00649000
*                                      STATE                         */ 00650000
         TM    LCBCHN(IEDQLPTR),B'00110000'                        0646 00651000
         BNO   @RF00646                                            0646 00652000
         TM    LCBCHN(IEDQLPTR),B'11000000'                        0646 00653000
         BNZ   @RF00646                                            0646 00654000
*             CALL MSGGNRSP;        /* PROCESS MSGGEN RESPONSE       */ 00655000
         BAL   @14,MSGGNRSP                                        0647 00656000
*           ELSE                    /* NOT WITING FOR MSGGEN RESPONSE*/ 00657000
*             DO;                                                  0648 00658000
         B     @RC00646                                            0648 00659000
@RF00646 DS    0H                                                  0649 00660000
*               IF LCBCHN=LCBINC THEN/* 'IN CHAIN' STATE             */ 00661000
         TM    LCBCHN(IEDQLPTR),B'00010000'                        0649 00662000
         BNO   @RF00649                                            0649 00663000
         TM    LCBCHN(IEDQLPTR),B'11100000'                        0649 00664000
         BNZ   @RF00649                                            0649 00665000
*                 DO;               /* YES                           */ 00666000
*                   IF TRHSDI=ON THEN/* EXCEPTION RESPONSE           */ 00667000
         L     @10,PIUPTR                                          0651 00668000
         TM    TRHSDI+10(@10),B'00000100'                          0651 00669000
         BNO   @RF00651                                            0651 00670000
*                     DO;           /* YES                           */ 00671000
*                       LCBCHN=LCBPURG;/* GO TO 'PURGING CHAIN' STATE*/ 00672000
         NI    LCBCHN(IEDQLPTR),B'00101111'                        0653 00673000
         OI    LCBCHN(IEDQLPTR),B'00100000'                        0653 00674000
*                       CALL SETERSNS;/* SET ERROR INFORMATION       */ 00675000
         BAL   @14,SETERSNS                                        0654 00676000
*                       LCBRSPSV=RPRF;/* SAVE THIS REPONSE           */ 00677000
         ST    RPRF,LCBRSPSV(,IEDQLPTR)                            0655 00678000
*                     END;                                         0656 00679000
*                   ELSE            /* POSITIVE RESPONSE             */ 00680000
*                     VALRSPSW=OFF; /* MARK RESPONSE AS INVALID      */ 00681000
         B     @RC00651                                            0657 00682000
@RF00651 NI    VALRSPSW,B'01111111'                                0657 00683000
*                 END;                                             0658 00684000
*               ELSE                /* NOT 'IN CHAIN' STATE          */ 00685000
*                 VALRSPSW=OFF;     /* MARK RESPONSE AS INVALID      */ 00686000
         B     @RC00649                                            0659 00687000
@RF00649 NI    VALRSPSW,B'01111111'                                0659 00688000
*             END;                                                 0660 00689000
@RC00649 DS    0H                                                  0661 00690000
*         END;                                                     0661 00691000
@RC00646 DS    0H                                                  0662 00692000
*     END;                                                         0662 00693000
*                                                                  0662 00694000
@RC00625 DS    0H                                                  0663 00695000
*/*                                                                  */ 00696000
*                                                                  0663 00697000
*   R14=R14SV04;                    /* RESTORE RETURN ADDRESS        */ 00698000
@RC00593 L     R14,R14SV04                                         0663 00699000
*   RETURN;                         /* RETURN TO CALLER              */ 00700000
@EL00006 DS    0H                                                  0664 00701000
@EF00006 DS    0H                                                  0664 00702000
@ER00006 BR    @14                                                 0664 00703000
*   END FMDRSP;                                                    0665 00704000
*                                                                  0666 00705000
*/********************************************************************/ 00706000
*/*                                                                  */ 00707000
*/* THIS ROUTINE PROCESSES MSGGEN RESPONSES.                         */ 00708000
*/*                                                                  */ 00709000
*/********************************************************************/ 00710000
*                                                                  0666 00711000
*MSGGNRSP:                                                         0666 00712000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0666 00713000
MSGGNRSP DS    0H                                                  0667 00714000
*   R14SV05=R14;                    /* SAVE RETURN ADDRESS           */ 00715000
         ST    R14,R14SV05                                         0667 00716000
*/*                                                                  */ 00717000
*                                                                  0668 00718000
*   LCBCHN=LCBBETC;                 /* GO TO 'BETWEEN CHAIN-WAITING     00719000
*                                      FOR NO RESPONSE' STATE        */ 00720000
         NI    LCBCHN(IEDQLPTR),B'00001111'                        0668 00721000
*   LCBERBQB=AVTMSGS->BDQCB;        /* IEDQBD'S QCB ADDRESS          */ 00722000
         L     @10,AVTMSGS-1(,IEDQAPTR)                            0669 00723000
         MVC   LCBERBQB(3,IEDQLPTR),BDQCB+1(@10)                   0669 00724000
*   LCBERBPY=PRIEDISP;              /* POST PRIORITY                 */ 00725000
         MVI   LCBERBPY(IEDQLPTR),X'E0'                            0670 00726000
*   RPARM=ADDR(LCBERB);             /* ERB ADDRESS                   */ 00727000
         LA    RPARM,LCBERB(,IEDQLPTR)                             0671 00728000
*   CALL DSPPOSTR;                  /* POST THE ERB TO BD            */ 00729000
         LA    @15,DSPPOSTR(,RDISP)                                0672 00730000
         BALR  @14,@15                                             0672 00731000
*   RPARM=RPRF;                     /* ADDRESS OF RESPONSE           */ 00732000
         LR    RPARM,RPRF                                          0673 00733000
*   CALL DISCARD;                   /* DISCARD MSGGEN RESPONSE       */ 00734000
         BAL   @14,DISCARD                                         0674 00735000
*/*                                                                  */ 00736000
*                                                                  0675 00737000
*   R14=R14SV05;                    /* RESTORE RETURN ADDRESS        */ 00738000
         L     R14,R14SV05                                         0675 00739000
*   RETURN;                         /* RETURN TO CALLER              */ 00740000
@EL00007 DS    0H                                                  0676 00741000
@EF00007 DS    0H                                                  0676 00742000
@ER00007 BR    @14                                                 0676 00743000
*   END MSGGNRSP;                                                  0677 00744000
*                                                                  0678 00745000
*/********************************************************************/ 00746000
*/*                                                                  */ 00747000
*/* THIS ROUTINE SETS THE TCAM ERROR WORD AND ERROR INFORMATION IN   */ 00748000
*/*  LCB FOR RESPONSES.                                              */ 00749000
*/*                                                                  */ 00750000
*/********************************************************************/ 00751000
*                                                                  0678 00752000
*SETERSNS:                                                         0678 00753000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0678 00754000
SETERSNS DS    0H                                                  0679 00755000
*   IF LCBRSRH=OFF THEN             /* ARE ERROR BITS ALREADY SET    */ 00756000
         TM    LCBRSRH(IEDQLPTR),B'01000000'                       0679 00757000
         BNZ   @RF00679                                            0679 00758000
*     DO;                           /* NO                            */ 00759000
*       LCBRSRH=ON;                 /* INDICATE AN EXCEPTION RSP HAS    00760000
*                                      BEEN RECEIVED (USED BY      0681 00761000
*                                      ERRORMSG EXIT)        @YM07705*/ 00762000
         OI    LCBRSRH(IEDQLPTR),B'01000000'                       0681 00763000
*       LCBRHSV=IEDRH;              /* SAVE RH (FOR ERRORMSG EXIT) 0682 00764000
*                                                            @YM07705*/ 00765000
         L     @09,PIUPTR                                          0682 00766000
         MVC   LCBRHSV(3,IEDQLPTR),IEDRH+10(@09)                   0682 00767000
*       SCBTXTTN=ON;                /* SET TEXT ERROR                */ 00768000
         L     @05,IEDQSPTR-1(,IEDQLPTR)                           0683 00769000
         LA    @05,0(,@05)                                         0683 00770000
         OI    SCBTXTTN(@05),B'01000000'                           0683 00771000
*       LCBLUSNS=RU(1:4);           /* SET SENSE BYTES               */ 00772000
         AL    @09,@CF00576                                        0684 00773000
         MVC   LCBLUSNS(4,IEDQLPTR),RU(@09)                        0684 00774000
*       SNSPTR=ADDR(RU);            /* SET UP SENSE ADDRESSABILITY   */ 00775000
         LR    SNSPTR,@09                                          0685 00776000
*/*                                                                  */ 00777000
*                                                                  0686 00778000
*       IF SNSMAJ=SNSPATH THEN      /* PATH ERROR                    */ 00779000
         CLI   SNSMAJ(SNSPTR),X'80'                                0686 00780000
         BNE   @RF00686                                            0686 00781000
*         SCBPERRN=ON;              /* YES-SET PATH ERROR BIT        */ 00782000
         OI    SCBPERRN(@05),B'00000001'                           0687 00783000
*       ELSE                                                       0688 00784000
*         IF SNSMAJ=SNSRHUSE THEN   /* RH USAGE ERROR                */ 00785000
         B     @RC00686                                            0688 00786000
@RF00686 CLI   SNSMAJ(SNSPTR),X'40'                                0688 00787000
         BNE   @RF00688                                            0688 00788000
*           SCBCPMEN=ON;            /* YES-SET RH USAGE ERROR BIT    */ 00789000
         L     @09,IEDQSPTR-1(,IEDQLPTR)                           0689 00790000
         OI    SCBCPMEN(@09),B'00000100'                           0689 00791000
*         ELSE                                                     0690 00792000
*           IF SNSMAJ=SNSSTERR THEN /* STATE ERROR                   */ 00793000
         B     @RC00688                                            0690 00794000
@RF00688 CLI   SNSMAJ(SNSPTR),X'20'                                0690 00795000
         BNE   @RF00690                                            0690 00796000
*             SCBSTERN=ON;          /* YES-SET STATE ERROR BIT       */ 00797000
         L     @09,IEDQSPTR-1(,IEDQLPTR)                           0691 00798000
         OI    SCBSTERN(@09),B'00000010'                           0691 00799000
*           ELSE                                                   0692 00800000
*             IF SNSMAJ=SNSRQERR THEN/* REQUEST ERROR                */ 00801000
         B     @RC00690                                            0692 00802000
@RF00690 CLI   SNSMAJ(SNSPTR),X'10'                                0692 00803000
         BNE   @RF00692                                            0692 00804000
*               SCBFIERN=ON;        /* YES-SET REQUEST ERROR BIT     */ 00805000
         L     @09,IEDQSPTR-1(,IEDQLPTR)                           0693 00806000
         OI    SCBFIERN(@09),B'00000100'                           0693 00807000
*             ELSE                                                 0694 00808000
*               IF SNSMAJ=SNSRQREJ THEN/* REQUEST REJECT ERROR       */ 00809000
         B     @RC00692                                            0694 00810000
@RF00692 CLI   SNSMAJ(SNSPTR),X'08'                                0694 00811000
         BNE   @RF00694                                            0694 00812000
*                 SCBRRJN=ON;       /* YES-SET REQUEST REJECT BIT    */ 00813000
         L     @09,IEDQSPTR-1(,IEDQLPTR)                           0695 00814000
         OI    SCBRRJN(@09),B'00000100'                            0695 00815000
*/*                                                                  */ 00816000
*                                                                  0696 00817000
*       IF SNSUSER^=0 THEN          /* USER SENSE PRESENT            */ 00818000
@RF00694 DS    0H                                                  0696 00819000
@RC00692 DS    0H                                                  0696 00820000
@RC00690 DS    0H                                                  0696 00821000
@RC00688 DS    0H                                                  0696 00822000
@RC00686 ICM   @09,3,SNSUSER(SNSPTR)                               0696 00823000
         BZ    @RF00696                                            0696 00824000
*         SCBUNDFN=ON;              /* YES-SET USER SENSE PRESENT BIT*/ 00825000
         L     @10,IEDQSPTR-1(,IEDQLPTR)                           0697 00826000
         OI    SCBUNDFN(@10),B'00000001'                           0697 00827000
*     END;                                                         0698 00828000
*                                                                  0698 00829000
*/*                                                                  */ 00830000
*                                                                  0699 00831000
*   RETURN;                         /* RETURN TO CALLER              */ 00832000
@EL00008 DS    0H                                                  0699 00833000
@EF00008 DS    0H                                                  0699 00834000
@ER00008 BR    @14                                                 0699 00835000
*   END SETERSNS;                                                  0700 00836000
         B     @EL00008                                            0700 00837000
*                                                                  0701 00838000
*/********************************************************************/ 00839000
*/*                                                                  */ 00840000
*/* THIS ROUTINE TRANSFORMS A PIU RESPONSE INTO 'TCAM BUFFER' FORMAT.*/ 00841000
*/*       INPUT: RPARM CONTAINS THE ADDRESS OF THE RESPONSE PIU TO   */ 00842000
*/*              BE TRANSFORMED                                      */ 00843000
*/*                                                                  */ 00844000
*/********************************************************************/ 00845000
*                                                                  0701 00846000
*   RFY                                                            0701 00847000
*     IEDQPRF BASED(BUFPTR);                                       0701 00848000
*   RFY                                                            0702 00849000
*     IEDPIU BASED(PIUBEG);                                        0702 00850000
*XFORM:                                                            0703 00851000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0703 00852000
XFORM    DS    0H                                                  0704 00853000
*   R14SV06=R14;                    /* SAVE RETURN ADDRESS           */ 00854000
         ST    R14,R14SV06                                         0704 00855000
*/*                                                                  */ 00856000
*                                                                  0705 00857000
*   BUFPTR=RPARM;                   /* BUFFER ADDRESSABILITY         */ 00858000
         LR    BUFPTR,RPARM                                        0705 00859000
*   PIUBEG=ADDR(PRFPIUO)+PRFPIUO;   /* PIU ADDRESSABILITY            */ 00860000
         LA    @09,PRFPIUO(,BUFPTR)                                0706 00861000
         SLR   @05,@05                                             0706 00862000
         IC    @05,PRFPIUO(,BUFPTR)                                0706 00863000
         ALR   @09,@05                                             0706 00864000
         ST    @09,PIUBEG                                          0706 00865000
*/*                                                                  */ 00866000
*                                                                  0707 00867000
*   SVTHOAF=TTHOAF;                 /* SAVE OAF                      */ 00868000
         MVC   SVTHOAF(2),TTHOAF(@09)                              0707 00869000
*   TTHOAF=TTHDAF;                  /* MOVE DAF TO OAF               */ 00870000
         MVC   @TS00001(2),TTHDAF(@09)                             0708 00871000
         MVC   TTHOAF(2,@09),@TS00001                              0708 00872000
*   TTHDAF=SVTHOAF;                 /* MOVE OAF TO DAF               */ 00873000
         MVC   TTHDAF(2,@09),SVTHOAF                               0709 00874000
*/*                                                                  */ 00875000
*                                                                  0710 00876000
*   TRHBC=ON;                       /* FORCE BEGIN CHAIN (HEADER)    */ 00877000
*   TRHEC=ON;                       /* FORCE END CHAIN(LAST)         */ 00878000
         OI    TRHBC+10(@09),B'00000011'                           0711 00879000
*   XFORMSW=ON;                     /* INDICATE PIU TRANSFORMED TO 0712 00880000
*                                      TCAM BUFFER           @OY19613*/ 00881000
         OI    XFORMSW,B'01000000'                                 0712 00882000
*/*                                                                  */ 00883000
*                                                                  0713 00884000
*   CALL IEDXFMI;                   /* TRANSFORM TO 'TCAM BUFFER'  0713 00885000
*                                      FORMAT                        */ 00886000
         L     @09,AVTSAVTP(,IEDQAPTR)                             0713 00887000
         L     @15,SAVTXFMI(,@09)                                  0713 00888000
         BALR  @14,@15                                             0713 00889000
*   PRFLCB=RLCB;                    /* ADDRESS OF LCB                */ 00890000
         STCM  RLCB,7,PRFLCB(BUFPTR)                               0714 00891000
*/* SET UP QUEUEING POINTERS                                         */ 00892000
*                                                                  0715 00893000
*   PRFCORE=SCBSCHDR;               /* SET CORE ADDR TO HDR  @YM08017*/ 00894000
         L     @09,IEDQSPTR-1(,IEDQLPTR)                           0715 00895000
         LA    @09,0(,@09)                                         0715 00896000
         MVC   PRFCORE(3,BUFPTR),SCBSCHDR(@09)                     0715 00897000
*   PRFCRCD=SCBSCHDR;               /* SET CURRENT REC TO HDR      0716 00898000
*                                                            @YM08017*/ 00899000
         MVC   PRFCRCD(3,BUFPTR),SCBSCHDR(@09)                     0716 00900000
*   PRFCHDR=SCBSCHDR;               /* SET CURRENT HDR TO HDR      0717 00901000
*                                                            @YM07759*/ 00902000
         MVC   PRFCHDR(3,BUFPTR),SCBSCHDR(@09)                     0717 00903000
*/*                                                                  */ 00904000
*                                                                  0718 00905000
*   LCBUSUE=ON;                     /* SET UNIT EXCEPTION            */ 00906000
         OI    LCBUSUE(IEDQLPTR),B'00000001'                       0718 00907000
*/*                                                                  */ 00908000
*                                                                  0719 00909000
*   R14=R14SV06;                    /* RESTORE RETURN ADDRESS        */ 00910000
         L     R14,R14SV06                                         0719 00911000
*   RETURN;                         /* RETURN TO CALLER              */ 00912000
@EL00009 DS    0H                                                  0720 00913000
@EF00009 DS    0H                                                  0720 00914000
@ER00009 BR    @14                                                 0720 00915000
*   END XFORM;                                                     0721 00916000
*   RFY                                                            0722 00917000
*     IEDQPRF BASED(IEDQPPTR);                                     0722 00918000
*   RFY                                                            0723 00919000
*     IEDPIU BASED(PIUPTR);                                        0723 00920000
*   END IEDRSPIN                                                   0724 00921000
*                                                                  0724 00922000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00923000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00924000
*/*%INCLUDE SYSLIB  (TCD1D   )                                       */ 00925000
*/*%INCLUDE SYSLIB  (TDISPD  )                                       */ 00926000
*/*%INCLUDE SYSLIB  (TLCBD   )                                       */ 00927000
*/*%INCLUDE SYSLIB  (TLGBD   )                                       */ 00928000
*/*%INCLUDE SYSLIB  (TPIUD   )                                       */ 00929000
*/*%INCLUDE SYSLIB  (TPLBMD  )                                       */ 00930000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 00931000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 00932000
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */ 00933000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 00934000
*/*%INCLUDE SYSLIB  (TSCBD   )                                       */ 00935000
*/*%INCLUDE SYSLIB  (TSIBD   )                                       */ 00936000
*/*%INCLUDE SYSLIB  (TSNSD   )                                       */ 00937000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 00938000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00939000
*/*%INCLUDE SYSLIB  (TTSID   )                                       */ 00940000
*                                                                  0724 00941000
*       ;                                                          0724 00942000
@DATA    DS    0H                                                       00943000
         DS    0F                                                       00944000
         DS    0F                                                       00945000
@CF00044 DC    F'8'                                                     00946000
@CF00576 DC    F'13'                                                    00947000
@CF01941 DC    F'14'                                                    00948000
@CF02271 DC    F'-8'                                                    00949000
         DS    0D                                                       00950000
PIUPTR   DS    A                                                        00951000
SIBPTR   DS    A                                                        00952000
PIUBEG   DS    A                                                        00953000
SVTHOAF  DS    H                                                        00954000
@TS00001 DS    CL2                                                      00955000
PLBM     DS    CL16                                                     00956000
CMDBYTE  DS    CL1                                                      00957000
SWITCH1  DS    BL1                                                      00958000
         ORG   SWITCH1                                                  00959000
VALRSPSW DS    BL1                                                      00960000
XFORMSW  EQU   SWITCH1+0                                                00961000
@NM00223 EQU   SWITCH1+0                                                00962000
         ORG   SWITCH1+1                                                00963000
         DS    CL2                                                      00964000
R14SV    DS    CL28                                                     00965000
         ORG   R14SV                                                    00966000
R14SV01  DS    AL4                                                      00967000
R14SV02  DS    AL4                                                      00968000
R14SV03  DS    AL4                                                      00969000
R14SV04  DS    AL4                                                      00970000
R14SV05  DS    AL4                                                      00971000
R14SV06  DS    AL4                                                      00972000
R14SV07  DS    AL4                                                      00973000
         ORG   R14SV+28                                                 00974000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00975000
@01      EQU   01                                                       00976000
@02      EQU   02                                                       00977000
@03      EQU   03                                                       00978000
@04      EQU   04                                                       00979000
@05      EQU   05                                                       00980000
@06      EQU   06                                                       00981000
@07      EQU   07                                                       00982000
@08      EQU   08                                                       00983000
@09      EQU   09                                                       00984000
@10      EQU   10                                                       00985000
@11      EQU   11                                                       00986000
@12      EQU   12                                                       00987000
@13      EQU   13                                                       00988000
@14      EQU   14                                                       00989000
@15      EQU   15                                                       00990000
BUFPTR   EQU   @10                                                      00991000
SNSPTR   EQU   @10                                                      00992000
IEDQAPTR EQU   @13                                                      00993000
RDISP    EQU   @11                                                      00994000
IEDQLPTR EQU   @04                                                      00995000
LCBXPTR  EQU   @05                                                      00996000
IEDQPPTR EQU   @06                                                      00997000
IEDQQPTR EQU   @07                                                      00998000
RTRM     EQU   @08                                                      00999000
RPARM    EQU   @01                                                      01000000
REG0     EQU   @00                                                      01001000
R15      EQU   @15                                                      01002000
RSTCB    EQU   @03                                                      01003000
RLCB     EQU   @04                                                      01004000
RPRF     EQU   @06                                                      01005000
RQCB     EQU   @07                                                      01006000
RBASE    EQU   @12                                                      01007000
RAVT     EQU   @13                                                      01008000
R14      EQU   @14                                                      01009000
IEDQAVTD EQU   0                                                        01010000
AVTSAVEX EQU   IEDQAVTD+216                                             01011000
AVTREADD EQU   IEDQAVTD+308                                             01012000
AVTBUFSW EQU   IEDQAVTD+312                                             01013000
@NM00004 EQU   IEDQAVTD+316                                             01014000
AVTCKFLG EQU   @NM00004                                                 01015000
AVTBASE  EQU   IEDQAVTD+340                                             01016000
AVTPKF   EQU   AVTBASE                                                  01017000
AVTRNMPT EQU   IEDQAVTD+352                                             01018000
AVTOSECB EQU   IEDQAVTD+420                                             01019000
AVTECB1  EQU   AVTOSECB                                                 01020000
AVTHG02  EQU   IEDQAVTD+456                                             01021000
AVTDISP  EQU   IEDQAVTD+480                                             01022000
AVTHD    EQU   IEDQAVTD+484                                             01023000
AVTSCOPT EQU   AVTHD                                                    01024000
AVTSAVTP EQU   IEDQAVTD+540                                             01025000
AVTSAVTF EQU   AVTSAVTP                                                 01026000
AVTCKPEL EQU   IEDQAVTD+580                                             01027000
AVTCKRMV EQU   AVTCKPEL                                                 01028000
AVTCKELF EQU   IEDQAVTD+608                                             01029000
AVTCKBYT EQU   IEDQAVTD+619                                             01030000
AVTHG01  EQU   IEDQAVTD+620                                             01031000
AVTCKLNK EQU   IEDQAVTD+624                                             01032000
AVTCRELE EQU   IEDQAVTD+636                                             01033000
AVTCCELE EQU   AVTCRELE                                                 01034000
AVTCLRHI EQU   IEDQAVTD+644                                             01035000
AVTADBUF EQU   IEDQAVTD+648                                             01036000
AVTSYSER EQU   IEDQAVTD+656                                             01037000
AVTMSGS  EQU   IEDQAVTD+657                                             01038000
AVTTSOPT EQU   IEDQAVTD+668                                             01039000
AVTBFRFG EQU   IEDQAVTD+712                                             01040000
AVTBFRTB EQU   IEDQAVTD+720                                             01041000
AVTCKPQB EQU   IEDQAVTD+732                                             01042000
AVTCKPTB EQU   AVTCKPQB                                                 01043000
AVTCKPEC EQU   AVTCKPQB+4                                               01044000
AVTCKPCC EQU   AVTCKPEC                                                 01045000
AVTOPCQB EQU   IEDQAVTD+744                                             01046000
AVTOPCOB EQU   AVTOPCQB                                                 01047000
AVTOPCEC EQU   AVTOPCQB+4                                               01048000
AVTOPCCC EQU   AVTOPCEC                                                 01049000
AVTOLTQB EQU   IEDQAVTD+756                                             01050000
AVTCWFL1 EQU   IEDQAVTD+852                                             01051000
AVTCWFL2 EQU   IEDQAVTD+853                                             01052000
AVTSUBT  EQU   IEDQAVTD+876                                             01053000
AVTIOTR  EQU   IEDQAVTD+877                                             01054000
AVTBIT1  EQU   IEDQAVTD+978                                             01055000
AVTBIT2  EQU   IEDQAVTD+979                                             01056000
AVTBIT3  EQU   IEDQAVTD+980                                             01057000
AVTBIT4  EQU   IEDQAVTD+1064                                            01058000
@NM00086 EQU   IEDQAVTD+1160                                            01059000
IEDNSVTD EQU   0                                                        01060000
SAVTDIAG EQU   IEDNSVTD                                                 01061000
SAVTDIAF EQU   SAVTDIAG                                                 01062000
SAVTDNIR EQU   IEDNSVTD+60                                              01063000
SAVTLUSQ EQU   IEDNSVTD+88                                              01064000
SAVTXFMI EQU   IEDNSVTD+132                                             01065000
SAVTTCPU EQU   IEDNSVTD+238                                             01066000
SAVTBSM  EQU   IEDNSVTD+240                                             01067000
SAVTRNMP EQU   IEDNSVTD+256                                             01068000
SAVTZELM EQU   IEDNSVTD+270                                             01069000
SAVTRDRV EQU   IEDNSVTD+284                                             01070000
SAVTCKQB EQU   IEDNSVTD+300                                             01071000
SAVTCKTB EQU   SAVTCKQB                                                 01072000
SAVTCKEC EQU   SAVTCKQB+4                                               01073000
SAVTCKCC EQU   SAVTCKEC                                                 01074000
IEDQDISP EQU   0                                                        01075000
DSPDISP  EQU   4                                                        01076000
DSPPOSTR EQU   28                                                       01077000
IEDQLCB  EQU   0                                                        01078000
LCBRCB   EQU   IEDQLCB                                                  01079000
LCBQCBA  EQU   LCBRCB+1                                                 01080000
LCBPRI   EQU   LCBRCB+4                                                 01081000
LCBTSOB  EQU   IEDQLCB+19                                               01082000
LCBCHAIN EQU   IEDQLCB+20                                               01083000
LCBSCRNN EQU   LCBCHAIN                                                 01084000
LCBTETEN EQU   LCBCHAIN                                                 01085000
LCBABRTN EQU   LCBCHAIN                                                 01086000
LCBINSRC EQU   IEDQLCB+21                                               01087000
LCBLKMDE EQU   LCBINSRC+2                                               01088000
LCBNTXT  EQU   IEDQLCB+24                                               01089000
LCBSTAT4 EQU   LCBNTXT                                                  01090000
LCBPHASE EQU   LCBSTAT4                                                 01091000
LCBSCBDA EQU   IEDQLCB+25                                               01092000
LCBMHA   EQU   IEDQLCB+29                                               01093000
LCBFLAG1 EQU   IEDQLCB+32                                               01094000
LCBIOBSN EQU   IEDQLCB+33                                               01095000
LCBSNS   EQU   LCBIOBSN+1                                               01096000
LCBSENS0 EQU   LCBSNS                                                   01097000
LCBLOSDT EQU   LCBSENS0                                                 01098000
LCBTMOUT EQU   LCBSENS0                                                 01099000
LCBFLAG3 EQU   LCBIOBSN+7                                               01100000
LCBCSW   EQU   LCBIOBSN+8                                               01101000
LCBCSWST EQU   LCBCSW+3                                                 01102000
LCBCSWUS EQU   LCBCSWST                                                 01103000
LCBUSUE  EQU   LCBCSWUS                                                 01104000
LCBCSWCS EQU   LCBCSWST+1                                               01105000
LCBSIOCC EQU   LCBIOBSN+15                                              01106000
LCBDCBPT EQU   IEDQLCB+52                                               01107000
LCBRCQCB EQU   IEDQLCB+56                                               01108000
LCBRESTR EQU   LCBRCQCB                                                 01109000
LCBTHSQ  EQU   IEDQLCB+60                                               01110000
LCBINCAM EQU   LCBTHSQ                                                  01111000
LCBERRCT EQU   IEDQLCB+62                                               01112000
LCBLSPCI EQU   IEDQLCB+65                                               01113000
LCBRCBFR EQU   LCBLSPCI                                                 01114000
LCBSTATE EQU   IEDQLCB+70                                               01115000
LCBSTAT1 EQU   LCBSTATE                                                 01116000
LCBRCLLN EQU   LCBSTAT1                                                 01117000
LCBRECVN EQU   LCBSTAT1                                                 01118000
LCBSTAT2 EQU   LCBSTATE+1                                               01119000
LCBBEOTN EQU   LCBSTAT2                                                 01120000
LCBSYNC  EQU   LCBSTAT2                                                 01121000
LCBDIAL  EQU   LCBSTAT2                                                 01122000
LCBTSTSW EQU   IEDQLCB+72                                               01123000
LCBERB   EQU   IEDQLCB+76                                               01124000
LCBERBQB EQU   LCBERB+1                                                 01125000
LCBERBPY EQU   IEDQLCB+80                                               01126000
LCBERBST EQU   IEDQLCB+84                                               01127000
LCBERROR EQU   LCBERBST                                                 01128000
LCBDLNKN EQU   LCBERBST                                                 01129000
LCBERBCT EQU   IEDQLCB+88                                               01130000
LCBRBCT2 EQU   LCBERBCT+1                                               01131000
LCBMSGFM EQU   IEDQLCB+92                                               01132000
LCBSCBA  EQU   IEDQLCB+93                                               01133000
LCBOBRCH EQU   IEDQLCB+96                                               01134000
LCBINVPT EQU   LCBOBRCH+1                                               01135000
LCBBFRW  EQU   LCBINVPT                                                 01136000
LCBTPCD  EQU   IEDQLCB+100                                              01137000
LCBSTAT5 EQU   LCBTPCD                                                  01138000
LCBSTAT6 EQU   LCBTPCD+4                                                01139000
LCBCHN   EQU   LCBSTAT6                                                 01140000
LCBRSPSV EQU   LCBTPCD+8                                                01141000
LCBSAVSN EQU   IEDQLCB+112                                              01142000
LCBERCCW EQU   IEDQLCB+120                                              01143000
LCBCPA   EQU   IEDQLCB+144                                              01144000
LCBCCW5  EQU   LCBCPA+32                                                01145000
LCBATTEL EQU   LCBCCW5                                                  01146000
LCBQEBPL EQU   LCBATTEL                                                 01147000
IEDQLCBX EQU   0                                                        01148000
LCBXCON  EQU   IEDQLCBX                                                 01149000
LCBXFLAG EQU   LCBXCON                                                  01150000
LCBXDCT  EQU   LCBXCON+1                                                01151000
LCBXRADR EQU   LCBXCON+4                                                01152000
IEDNLGB  EQU   0                                                        01153000
LGBBUFOU EQU   IEDNLGB+20                                               01154000
LGBPCI   EQU   IEDNLGB+25                                               01155000
LGBBYTE  EQU   IEDNLGB+29                                               01156000
LGBOFLGS EQU   IEDNLGB+48                                               01157000
LGBRESER EQU   IEDNLGB+56                                               01158000
IEDPIU   EQU   0                                                        01159000
PIUTH    EQU   IEDPIU                                                   01160000
PIURH    EQU   IEDPIU+10                                                01161000
PIURU    EQU   IEDPIU+13                                                01162000
IEDPLBM  EQU   0                                                        01163000
PLBMFLG1 EQU   IEDPLBM                                                  01164000
PLBMSNC  EQU   IEDPLBM+2                                                01165000
PLBMRH   EQU   IEDPLBM+4                                                01166000
PLBMCMD  EQU   IEDPLBM+7                                                01167000
PLBMSIB  EQU   IEDPLBM+8                                                01168000
PLBMLCB  EQU   IEDPLBM+12                                               01169000
PLBMPTR  EQU   0                                                        01170000
IEDQPRF  EQU   0                                                        01171000
PRFRCB   EQU   IEDQPRF                                                  01172000
PRFKEY   EQU   PRFRCB                                                   01173000
PRFQCBA  EQU   PRFRCB+1                                                 01174000
PRFPRI   EQU   PRFRCB+4                                                 01175000
PRFLINK  EQU   PRFRCB+5                                                 01176000
PRFTIC   EQU   IEDQPRF+8                                                01177000
PRFTICC  EQU   PRFTIC                                                   01178000
PRFNBUNT EQU   IEDQPRF+12                                               01179000
PRFSUNIT EQU   PRFNBUNT                                                 01180000
PRFPLQCB EQU   PRFSUNIT                                                 01181000
PRFPIUO  EQU   PRFPLQCB                                                 01182000
PRFLCB   EQU   IEDQPRF+13                                               01183000
@NM00173 EQU   IEDQPRF+16                                               01184000
PRFSVFFO EQU   @NM00173                                                 01185000
PRFSIZE  EQU   PRFSVFFO+2                                               01186000
PRFSTAT1 EQU   IEDQPRF+20                                               01187000
PRFTSMSG EQU   PRFSTAT1                                                 01188000
PRFEOFN  EQU   PRFSTAT1                                                 01189000
PRFCORE  EQU   IEDQPRF+21                                               01190000
PRFXTRA  EQU   PRFCORE                                                  01191000
PRFSCAN  EQU   IEDQPRF+24                                               01192000
PRFISIZE EQU   PRFSCAN+1                                                01193000
PRFTQBCK EQU   IEDQPRF+26                                               01194000
PRFNTXT  EQU   PRFTQBCK                                                 01195000
PRFEOBOF EQU   PRFNTXT                                                  01196000
PRFCRCD  EQU   IEDQPRF+29                                               01197000
PRFCHDR  EQU   IEDQPRF+32                                               01198000
PRFHQBCK EQU   IEDQPRF+35                                               01199000
IEDPF1   EQU   0                                                        01200000
PRF1RH   EQU   IEDPF1                                                   01201000
PRF1FLG1 EQU   IEDPF1+3                                                 01202000
PRF1FORM EQU   PRF1FLG1                                                 01203000
PRF1WD2  EQU   IEDPF1+4                                                 01204000
PRF1SEQP EQU   PRF1WD2                                                  01205000
PRF1SQID EQU   PRF1SEQP                                                 01206000
PRF1TAG1 EQU   PRF1SQID                                                 01207000
PRF1RULN EQU   PRF1SEQP+2                                               01208000
IEDPF2   EQU   0                                                        01209000
PRF2FLG2 EQU   IEDPF2                                                   01210000
PRF2WD2  EQU   IEDPF2+4                                                 01211000
IEDQQCB  EQU   0                                                        01212000
QCBDSFLG EQU   IEDQQCB                                                  01213000
QCBDISK  EQU   QCBDSFLG                                                 01214000
QCBELCHN EQU   IEDQQCB+1                                                01215000
QCBEOLDT EQU   IEDQQCB+16                                               01216000
QCBBYTE1 EQU   QCBEOLDT+1                                               01217000
QCBLKRLN EQU   IEDQQCB+18                                               01218000
QCBRETCT EQU   QCBLKRLN                                                 01219000
QCBSTAT  EQU   IEDQQCB+19                                               01220000
QCBINSRC EQU   IEDQQCB+21                                               01221000
@NM00183 EQU   QCBINSRC                                                 01222000
QCBTSOF2 EQU   @NM00183+1                                               01223000
QCBTSOF1 EQU   @NM00183+2                                               01224000
QCBINTVL EQU   IEDQQCB+24                                               01225000
QCBPREN  EQU   IEDQQCB+28                                               01226000
QCBLKRRN EQU   QCBPREN+1                                                01227000
QCBDCBAD EQU   IEDQQCB+33                                               01228000
QCBLGBAD EQU   QCBDCBAD                                                 01229000
QCBFLAG  EQU   IEDQQCB+36                                               01230000
QCBTSSES EQU   QCBFLAG                                                  01231000
IEDQPQCB EQU   0                                                        01232000
QCBFHDLZ EQU   IEDQPQCB+3                                               01233000
QCBPFEFO EQU   QCBFHDLZ+1                                               01234000
QCBFHDTZ EQU   IEDQPQCB+6                                               01235000
QCBINTLF EQU   IEDQPQCB+12                                              01236000
IEDNQCB  EQU   0                                                        01237000
QCBSTAT1 EQU   IEDNQCB+4                                                01238000
QCBPLCBN EQU   QCBSTAT1                                                 01239000
QCBPLCBA EQU   IEDNQCB+5                                                01240000
IEDRH    EQU   0                                                        01241000
TRHBYTE0 EQU   IEDRH                                                    01242000
TRHRUCAT EQU   TRHBYTE0                                                 01243000
TRHSDI   EQU   TRHBYTE0                                                 01244000
TRHBC    EQU   TRHBYTE0                                                 01245000
TRHEC    EQU   TRHBYTE0                                                 01246000
TRHBYTE1 EQU   IEDRH+1                                                  01247000
TRHBYTE2 EQU   IEDRH+2                                                  01248000
IEDQSCB  EQU   0                                                        01249000
SCBSTATE EQU   IEDQSCB                                                  01250000
SCBSEQIN EQU   SCBSTATE                                                 01251000
SCBRCVCT EQU   IEDQSCB+4                                                01252000
SCBMBHEN EQU   IEDQSCB+5                                                01253000
SCBBKFCT EQU   IEDQSCB+9                                                01254000
SCBEOBSZ EQU   SCBBKFCT+1                                               01255000
SCBSALEV EQU   IEDQSCB+12                                               01256000
SCBQTYPE EQU   SCBSALEV                                                 01257000
SCBERRST EQU   IEDQSCB+16                                               01258000
SCBERR1  EQU   SCBERRST                                                 01259000
SCBHDRRN EQU   SCBERR1                                                  01260000
SCBORIGN EQU   SCBERR1                                                  01261000
SCBNOTRM EQU   SCBERR1                                                  01262000
SCBSEQHN EQU   SCBERR1                                                  01263000
SCBSEQLN EQU   SCBERR1                                                  01264000
SCBCUTFN EQU   SCBERR1                                                  01265000
SCBERR2  EQU   SCBERRST+1                                               01266000
SCBABRTN EQU   SCBERR2                                                  01267000
SCBRRJN  EQU   SCBABRTN                                                 01268000
SCBERR3  EQU   SCBERRST+2                                               01269000
SCBLOSTN EQU   SCBERR3                                                  01270000
SCBTMIDN EQU   SCBERR3                                                  01271000
SCBFORMN EQU   SCBERR3                                                  01272000
SCBFIERN EQU   SCBFORMN                                                 01273000
SCBATTN  EQU   SCBERR3                                                  01274000
SCBXCEPN EQU   SCBERR3                                                  01275000
SCBPERRN EQU   SCBXCEPN                                                 01276000
SCBERR4  EQU   SCBERRST+3                                               01277000
SCBSLCTN EQU   SCBERR4                                                  01278000
SCBTXTTN EQU   SCBERR4                                                  01279000
SCBCTLUN EQU   SCBERR4                                                  01280000
SCBCPMEN EQU   SCBCTLUN                                                 01281000
SCBCHANN EQU   SCBERR4                                                  01282000
SCBSTERN EQU   SCBCHANN                                                 01283000
SCBUNDFN EQU   SCBERR4                                                  01284000
SCBDLPTR EQU   IEDQSCB+22                                               01285000
SCBEOBAC EQU   SCBDLPTR                                                 01286000
SCBCTBAC EQU   SCBEOBAC                                                 01287000
SCBBSCFM EQU   IEDQSCB+24                                               01288000
SCBDATEN EQU   SCBBSCFM                                                 01289000
SCBITBSZ EQU   IEDQSCB+40                                               01290000
SCBCTBSV EQU   SCBITBSZ                                                 01291000
SCBDNSEG EQU   IEDQSCB+41                                               01292000
SCBCLSEG EQU   IEDQSCB+45                                               01293000
SCBSCHDR EQU   SCBCLSEG                                                 01294000
SCBITBAC EQU   IEDQSCB+48                                               01295000
SCBCTBFL EQU   SCBITBAC                                                 01296000
SCBBLKCT EQU   SCBCTBFL                                                 01297000
SCBDCSEG EQU   IEDQSCB+49                                               01298000
SCBSTAT1 EQU   IEDQSCB+60                                               01299000
SCBCORE  EQU   IEDQSCB+61                                               01300000
SCBSCAN  EQU   IEDQSCB+64                                               01301000
SCBNTXT  EQU   IEDQSCB+66                                               01302000
SCBCHDR  EQU   IEDQSCB+72                                               01303000
SCBCCSEG EQU   IEDQSCB+75                                               01304000
SCBEND   EQU   IEDQSCB+84                                               01305000
IEDSIBD  EQU   0                                                        01306000
SIBSESSN EQU   IEDSIBD+10                                               01307000
SIBPACIN EQU   IEDSIBD+11                                               01308000
SIBSEQN  EQU   IEDSIBD+12                                               01309000
SIBSTAT1 EQU   IEDSIBD+16                                               01310000
SIBSTAT2 EQU   IEDSIBD+17                                               01311000
SIBBIND  EQU   IEDSIBD+20                                               01312000
SIBBIND1 EQU   SIBBIND                                                  01313000
SIBBIND2 EQU   SIBBIND+1                                                01314000
SIBBRACK EQU   SIBBIND2                                                 01315000
SIBBIND3 EQU   SIBBIND+2                                                01316000
SIBFMODE EQU   SIBBIND3                                                 01317000
SIBRECOV EQU   SIBBIND3                                                 01318000
SIBSTAT0 EQU   IEDSIBD+23                                               01319000
SIBCD    EQU   SIBSTAT0                                                 01320000
IEDSNSD  EQU   0                                                        01321000
SNSSYSTM EQU   IEDSNSD                                                  01322000
SNSMAJ   EQU   SNSSYSTM                                                 01323000
SNSUSER  EQU   IEDSNSD+2                                                01324000
IEDTH    EQU   0                                                        01325000
TTHBYTE0 EQU   IEDTH                                                    01326000
TTHEFI   EQU   TTHBYTE0                                                 01327000
TTHDAF   EQU   IEDTH+2                                                  01328000
TTHOAF   EQU   IEDTH+4                                                  01329000
TTHSNF   EQU   IEDTH+6                                                  01330000
TTHTAG   EQU   TTHSNF                                                   01331000
TTHTAG1  EQU   TTHTAG                                                   01332000
IEDTRM   EQU   0                                                        01333000
IEDNTRM  EQU   IEDTRM                                                   01334000
TRMBYTE4 EQU   IEDNTRM                                                  01335000
TRMBYTE3 EQU   IEDNTRM+1                                                01336000
TRMBYTE2 EQU   IEDNTRM+2                                                01337000
TRMINPG  EQU   TRMBYTE2                                                 01338000
TRMBYTE1 EQU   IEDNTRM+3                                                01339000
TRMSCPRQ EQU   TRMBYTE1                                                 01340000
TRMBYTE0 EQU   IEDNTRM+6                                                01341000
TRMSIBPT EQU   IEDNTRM+7                                                01342000
IEDQTRM  EQU   IEDTRM+14                                                01343000
TRMSTATE EQU   IEDQTRM                                                  01344000
TRMLOG   EQU   TRMSTATE                                                 01345000
TRMDESTQ EQU   IEDQTRM+1                                                01346000
TRMINSEQ EQU   IEDQTRM+4                                                01347000
TLISTCNT EQU   TRMINSEQ                                                 01348000
TRMOUTSQ EQU   IEDQTRM+6                                                01349000
TLISTEN  EQU   TRMOUTSQ                                                 01350000
TRMDSORG EQU   TLISTEN                                                  01351000
TRMALTD  EQU   IEDQTRM+8                                                01352000
TRMDEVFL EQU   IEDQTRM+10                                               01353000
TRMSTAT  EQU   IEDQTRM+12                                               01354000
IEDQTSI  EQU   0                                                        01355000
TSIFLAG  EQU   IEDQTSI                                                  01356000
TSIMSGEN EQU   IEDQTSI+44                                               01357000
TSIDYQCB EQU   IEDQTSI+52                                               01358000
TSIDYQFG EQU   TSIDYQCB                                                 01359000
TSITSW   EQU   IEDQTSI+124                                              01360000
TSIGMAIN EQU   TSITSW+16                                                01361000
GMFLAG   EQU   TSIGMAIN                                                 01362000
GMCODE   EQU   TSIGMAIN+1                                               01363000
IEDTTPTR EQU   0                                                        01364000
IEDQTNT  EQU   0                                                        01365000
IEDBSM   EQU   0                                                        01366000
IEDXFMI  EQU   0                                                        01367000
RU       EQU   0                                                        01368000
BDQCB    EQU   0                                                        01369000
DSPBYPAS EQU   20                                                       01370000
DSPCHAIN EQU   12                                                       01371000
DSPLIFO  EQU   56                                                       01372000
DSPLIFOR EQU   60                                                       01373000
DSPLIST  EQU   8                                                        01374000
DSPPOST  EQU   24                                                       01375000
DSPPRIO  EQU   48                                                       01376000
DSPPRIOR EQU   52                                                       01377000
DSPTRACE EQU   64                                                       01378000
DSPTSTQ  EQU   32                                                       01379000
DSPTSTQR EQU   36                                                       01380000
DSPUNAV  EQU   40                                                       01381000
DSPUNAVR EQU   44                                                       01382000
DSPWAIT  EQU   16                                                       01383000
IEDIAP05 EQU   0                                                        01384000
QCBLDCB  EQU   0                                                        01385000
LCBRSPIN EQU   LCBIOBSN                                                 01386000
LCBRHSV  EQU   LCBRSPIN+2                                               01387000
LCBLUSNS EQU   LCBRSPIN+5                                               01388000
LCBSCPRS EQU   LCBRSPIN+9                                               01389000
LCBCSWU1 EQU   LCBSCPRS+2                                               01390000
LCBRSPFG EQU   LCBRSPIN+15                                              01391000
LCBRSRH  EQU   LCBRSPFG                                                 01392000
LCBCOREQ EQU   LCBTPCD                                                  01393000
@NM00134 EQU   LCBCPA+40                                                01394000
LCBQNX   EQU   LCBERCCW                                                 01395000
LCBQNXMN EQU   LCBQNX                                                   01396000
LCBCANCL EQU   LCBSAVSN                                                 01397000
LCBCANFG EQU   LCBCANCL                                                 01398000
IEDNLPTR EQU   QCBLGBAD                                                 01399000
IEDQSPTR EQU   LCBSCBA                                                  01400000
TRMPRE1  EQU   TRMBYTE4                                                 01401000
TRMNCP1  EQU   TRMBYTE4                                                 01402000
TRMPRE   EQU   TRMBYTE3                                                 01403000
TRMNCP   EQU   TRMBYTE3                                                 01404000
TRMPU    EQU   TRMBYTE3                                                 01405000
TRMLU    EQU   TRMBYTE3                                                 01406000
TRMLINK  EQU   TRMBYTE3                                                 01407000
PRFSHDR  EQU   IEDQPRF+42                                               01408000
SCBRGSAV EQU   SCBEND                                                   01409000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01410000
@NM00210 EQU   TRMLINK                                                  01411000
TRMLSTAT EQU   TRMLINK                                                  01412000
TRMLINT  EQU   TRMLINK                                                  01413000
TRMEPMOD EQU   TRMLINK                                                  01414000
TRMLULOG EQU   TRMLU                                                    01415000
TRMINERR EQU   TRMLU                                                    01416000
TRMLUREQ EQU   TRMLU                                                    01417000
TRMSESRQ EQU   TRMLU                                                    01418000
TRMTDIFF EQU   TRMLU                                                    01419000
TRMLUTM  EQU   TRMLU                                                    01420000
TRMLUIT  EQU   TRMLU                                                    01421000
TRMAUTO  EQU   TRMLU                                                    01422000
TRMPCONT EQU   TRMPU                                                    01423000
@NM00209 EQU   TRMPU                                                    01424000
TRMNCONT EQU   TRMNCP                                                   01425000
TRMQUCKN EQU   TRMNCP                                                   01426000
TRMSLOWN EQU   TRMNCP                                                   01427000
TRMSYGEN EQU   TRMNCP                                                   01428000
TRMNCPCL EQU   TRMNCP                                                   01429000
TRMIPLDM EQU   TRMNCP                                                   01430000
TRMINOUT EQU   TRMPRE                                                   01431000
TRMRDOUT EQU   TRMPRE                                                   01432000
TRMNLOUT EQU   TRMPRE                                                   01433000
TRMWROUT EQU   TRMPRE                                                   01434000
TRMASNXI EQU   TRMPRE                                                   01435000
TRMSTMM  EQU   TRMPRE                                                   01436000
TRMCMODE EQU   TRMPRE                                                   01437000
TRMSTPND EQU   TRMPRE                                                   01438000
@NM00208 EQU   TRMNCP1                                                  01439000
TRMINOP  EQU   TRMNCP1                                                  01440000
TRMLYNCH EQU   TRMPRE1                                                  01441000
TRMSPOUT EQU   TRMPRE1                                                  01442000
TRMERLCK EQU   TRMPRE1                                                  01443000
TRMQNPL  EQU   TRMPRE1                                                  01444000
TRMSPACT EQU   TRMPRE1                                                  01445000
TRMOCNI  EQU   TRMPRE1                                                  01446000
TRMSESSN EQU   TRMPRE1                                                  01447000
TRMCONT  EQU   TRMPRE1                                                  01448000
@NM00142 EQU   LCBCANCL+3                                               01449000
LCBCANTH EQU   LCBCANCL+1                                               01450000
@NM00141 EQU   LCBCANFG                                                 01451000
LCBCANCD EQU   LCBCANFG                                                 01452000
@NM00140 EQU   LCBCANFG                                                 01453000
LCBCANEB EQU   LCBCANFG                                                 01454000
LCBCANXT EQU   LCBCANFG                                                 01455000
LCBUNADD EQU   LCBQNX+21                                                01456000
LCBUASZE EQU   LCBQNX+20                                                01457000
LCBDSTEA EQU   LCBQNX+16                                                01458000
@NM00139 EQU   LCBQNX+8                                                 01459000
LCBIOSBS EQU   LCBQNX+5                                                 01460000
@NM00138 EQU   LCBQNX+4                                                 01461000
LCBSTSAV EQU   LCBQNX+1                                                 01462000
@NM00137 EQU   LCBQNXMN                                                 01463000
LCBNX509 EQU   LCBQNXMN                                                 01464000
LCBNX162 EQU   LCBQNXMN                                                 01465000
LCBNX142 EQU   LCBQNXMN                                                 01466000
LCBNX064 EQU   LCBQNXMN                                                 01467000
@NM00136 EQU   @NM00134+4                                               01468000
LCBNCPPT EQU   @NM00134+1                                               01469000
@NM00135 EQU   @NM00134                                                 01470000
LCBWRSCH EQU   LCBCOREQ+8                                               01471000
LCBCQLNK EQU   LCBCOREQ+4                                               01472000
LCBCQELE EQU   LCBCOREQ                                                 01473000
LCBPAKCH EQU   LCBRSPIN+16                                              01474000
@NM00133 EQU   LCBRSPFG                                                 01475000
LCBEXPI  EQU   LCBRSPFG                                                 01476000
@NM00132 EQU   LCBRSPIN+12                                              01477000
LCBUSUE1 EQU   LCBCSWU1                                                 01478000
@NM00131 EQU   LCBCSWU1                                                 01479000
@NM00130 EQU   LCBSCPRS+1                                               01480000
LCBDFCMD EQU   LCBSCPRS                                                 01481000
LCBUSER  EQU   LCBLUSNS+2                                               01482000
LCBSMIN  EQU   LCBLUSNS+1                                               01483000
LCBSMAJ  EQU   LCBLUSNS                                                 01484000
LCBSNS0  EQU   LCBRSPIN+1                                               01485000
@NM00129 EQU   LCBRSPIN                                                 01486000
GMDEVCH  EQU   TSIGMAIN+40                                              01487000
GMTSSIZ  EQU   TSIGMAIN+38                                              01488000
GMTSCNT  EQU   TSIGMAIN+36                                              01489000
GMLNSPC  EQU   TSIGMAIN+34                                              01490000
GMTCSPC  EQU   TSIGMAIN+32                                              01491000
GMCRUNT  EQU   TSIGMAIN+28                                              01492000
GMCRBUF  EQU   TSIGMAIN+24                                              01493000
GMTCBUF  EQU   TSIGMAIN+20                                              01494000
GMTSBUF  EQU   TSIGMAIN+16                                              01495000
GMBFRS   EQU   TSIGMAIN+14                                              01496000
GMHBFR   EQU   TSIGMAIN+12                                              01497000
GMBFUNIT EQU   TSIGMAIN+10                                              01498000
GMBFSIZE EQU   TSIGMAIN+8                                               01499000
GMSATCT  EQU   TSIGMAIN+6                                               01500000
GMCARCT  EQU   TSIGMAIN+4                                               01501000
GMLNSZ   EQU   TSIGMAIN+3                                               01502000
GMLNNO   EQU   TSIGMAIN+2                                               01503000
@NM00222 EQU   GMCODE                                                   01504000
GMTSO    EQU   GMCODE                                                   01505000
GMLINE   EQU   GMCODE                                                   01506000
GMTCAM   EQU   GMCODE                                                   01507000
@NM00221 EQU   GMCODE                                                   01508000
@NM00220 EQU   GMFLAG                                                   01509000
GMNUNLCK EQU   GMFLAG                                                   01510000
GMFRMAT  EQU   GMFLAG                                                   01511000
GMINIT   EQU   GMFLAG                                                   01512000
GMENCIN  EQU   GMFLAG                                                   01513000
GMENCON  EQU   GMFLAG                                                   01514000
@NM00219 EQU   TSITSW                                                   01515000
TSIAYO02 EQU   IEDQTSI+120                                              01516000
TSIAYO   EQU   IEDQTSI+116                                              01517000
TSIRNSCH EQU   IEDQTSI+112                                              01518000
TSI3705  EQU   IEDQTSI+108                                              01519000
TSI270X  EQU   IEDQTSI+104                                              01520000
TSI3270  EQU   IEDQTSI+100                                              01521000
TSITSDST EQU   IEDQTSI+96                                               01522000
TSIATTEN EQU   IEDQTSI+92                                               01523000
TSICPBC  EQU   IEDQTSI+88                                               01524000
TSICPBI  EQU   IEDQTSI+84                                               01525000
TSIDEST  EQU   IEDQTSI+80                                               01526000
@NM00218 EQU   IEDQTSI+64                                               01527000
TSIDYDLY EQU   IEDQTSI+60                                               01528000
TSIDYLNK EQU   IEDQTSI+57                                               01529000
TSIDYPRI EQU   IEDQTSI+56                                               01530000
@NM00217 EQU   TSIDYQCB+1                                               01531000
@NM00216 EQU   TSIDYQFG                                                 01532000
TSIDYQB  EQU   TSIDYQFG                                                 01533000
@NM00215 EQU   TSIDYQFG                                                 01534000
TSIDYPOS EQU   TSIDYQFG                                                 01535000
@NM00214 EQU   TSIDYQFG                                                 01536000
TSIHALT  EQU   IEDQTSI+48                                               01537000
TSITSAP  EQU   IEDQTSI+40                                               01538000
TSITSBQ  EQU   IEDQTSI+36                                               01539000
TSIBUFQ  EQU   IEDQTSI+32                                               01540000
TSISCHED EQU   IEDQTSI+28                                               01541000
TSISIMAT EQU   IEDQTSI+24                                               01542000
TSIHANG  EQU   IEDQTSI+20                                               01543000
TSIEDIT  EQU   IEDQTSI+16                                               01544000
TSISTAE  EQU   IEDQTSI+12                                               01545000
TSINPUT  EQU   IEDQTSI+8                                                01546000
TSILINK  EQU   IEDQTSI+5                                                01547000
TSIPRI   EQU   IEDQTSI+4                                                01548000
TSIELCHN EQU   IEDQTSI+1                                                01549000
@NM00213 EQU   TSIFLAG                                                  01550000
TSIQCB   EQU   TSIFLAG                                                  01551000
@NM00212 EQU   TSIFLAG                                                  01552000
TSIPOST  EQU   TSIFLAG                                                  01553000
@NM00211 EQU   TSIFLAG                                                  01554000
TRMOPT   EQU   IEDTRM+34                                                01555000
TRMOPTBL EQU   IEDQTRM+18                                               01556000
TRMOPNO  EQU   IEDQTRM+17                                               01557000
TRMCHCIN EQU   IEDQTRM+16                                               01558000
TRMSENSE EQU   TRMSTAT+3                                                01559000
TRMTEMPR EQU   TRMSTAT+2                                                01560000
TRMSIO   EQU   TRMSTAT                                                  01561000
@NM00207 EQU   TRMDEVFL+1                                               01562000
TRMTPIN  EQU   TRMDEVFL+1                                               01563000
TRMNCPI  EQU   TRMDEVFL+1                                               01564000
TRMRNTRM EQU   TRMDEVFL+1                                               01565000
@NM00206 EQU   TRMDEVFL+1                                               01566000
TRMLMD   EQU   TRMDEVFL+1                                               01567000
TRMCONC  EQU   TRMDEVFL+1                                               01568000
TRMTSOB  EQU   TRMDEVFL                                                 01569000
TRMBFDY  EQU   TRMDEVFL                                                 01570000
TRMTBLK  EQU   TRMDEVFL                                                 01571000
TRMSBLK  EQU   TRMDEVFL                                                 01572000
TRMBLKS  EQU   TRMDEVFL                                                 01573000
TRMADDC  EQU   TRMDEVFL                                                 01574000
TRMDDIG  EQU   TRMDEVFL                                                 01575000
TRMBUFS  EQU   TRMDEVFL                                                 01576000
TRMPRILK EQU   TRMALTD                                                  01577000
TRMLGB   EQU   TRMDSORG                                                 01578000
TRMUTERM EQU   TLISTCNT                                                 01579000
TRMSCNYN EQU   TRMSTATE                                                 01580000
TRMOPTFN EQU   TRMSTATE                                                 01581000
TRMHELDN EQU   TRMSTATE                                                 01582000
TRMACPTN EQU   TRMSTATE                                                 01583000
TRMPREF  EQU   TRMSTATE                                                 01584000
TRMPROC  EQU   TRMLOG                                                   01585000
TRMLIST  EQU   TRMLOG                                                   01586000
TRMLINE  EQU   TRMSTATE                                                 01587000
TRMSUBST EQU   IEDNTRM+12                                               01588000
TRMTYPE  EQU   IEDNTRM+11                                               01589000
TRMRLMCT EQU   IEDNTRM+10                                               01590000
TRMCOHTG EQU   TRMSIBPT+1                                               01591000
TRMGPCNT EQU   TRMSIBPT                                                 01592000
TRMBUFRD EQU   TRMBYTE0                                                 01593000
TRMSNA   EQU   TRMBYTE0                                                 01594000
TRMGP    EQU   TRMBYTE0                                                 01595000
TRMDIAL  EQU   TRMBYTE0                                                 01596000
@NM00205 EQU   TRMBYTE0                                                 01597000
TRMOUTPT EQU   TRMBYTE0                                                 01598000
TRMINPUT EQU   TRMBYTE0                                                 01599000
TRMUDEF  EQU   TRMBYTE0                                                 01600000
TRMCOHRT EQU   IEDNTRM+4                                                01601000
TRMSTOTE EQU   TRMBYTE1                                                 01602000
TRMCKPRN EQU   TRMBYTE1                                                 01603000
TRMTSATN EQU   TRMBYTE1                                                 01604000
TRMTRACE EQU   TRMBYTE1                                                 01605000
TRMSWBCK EQU   TRMBYTE1                                                 01606000
TRMAUTOC EQU   TRMBYTE1                                                 01607000
TRMINPTP EQU   TRMBYTE1                                                 01608000
TRMWTNEG EQU   TRMSCPRQ                                                 01609000
TRMWRBRK EQU   TRMBYTE2                                                 01610000
TRMNOSND EQU   TRMBYTE2                                                 01611000
TRMPREP  EQU   TRMBYTE2                                                 01612000
TRMGPACT EQU   TRMBYTE2                                                 01613000
TRMANDL  EQU   TRMBYTE2                                                 01614000
TRMCLOSN EQU   TRMINPG                                                  01615000
TRMREMB  EQU   TRMBYTE2                                                 01616000
TRMRSACT EQU   TRMBYTE2                                                 01617000
TTHDCF   EQU   IEDTH+8                                                  01618000
TTHTAG2  EQU   TTHTAG+1                                                 01619000
@NM00204 EQU   TTHTAG1                                                  01620000
TTHTAGS  EQU   TTHTAG1                                                  01621000
TTHBYTE1 EQU   IEDTH+1                                                  01622000
@NM00203 EQU   TTHBYTE0                                                 01623000
TTHEBIU  EQU   TTHBYTE0                                                 01624000
TTHBBIU  EQU   TTHBYTE0                                                 01625000
TTHFTYPE EQU   TTHBYTE0                                                 01626000
SNSUSR2  EQU   SNSUSER+1                                                01627000
SNSUSR1  EQU   SNSUSER                                                  01628000
SNSMIN   EQU   SNSSYSTM+1                                               01629000
SIBLUTYP EQU   SIBSTAT0                                                 01630000
@NM00202 EQU   SIBBIND3                                                 01631000
SIBCRES  EQU   SIBBIND3                                                 01632000
SIBSPKR  EQU   SIBBIND3                                                 01633000
SIBALT   EQU   SIBBIND2                                                 01634000
SIBBTERM EQU   SIBBIND2                                                 01635000
SIBFMUSE EQU   SIBBIND2                                                 01636000
SIBSEBI  EQU   SIBBIND2                                                 01637000
SIBSCMP  EQU   SIBBIND2                                                 01638000
SIBSEXC  EQU   SIBBIND2                                                 01639000
SIBSDEF  EQU   SIBBIND2                                                 01640000
SIBSRQM  EQU   SIBBIND1                                                 01641000
SIBSCHNG EQU   SIBBIND1                                                 01642000
SIBPEBI  EQU   SIBBIND1                                                 01643000
SIBPCMP  EQU   SIBBIND1                                                 01644000
SIBPEXC  EQU   SIBBIND1                                                 01645000
SIBPDEF  EQU   SIBBIND1                                                 01646000
SIBPRQM  EQU   SIBBIND1                                                 01647000
SIBPCHN  EQU   SIBBIND1                                                 01648000
SIBFMPRO EQU   IEDSIBD+19                                               01649000
SIBTSPRO EQU   IEDSIBD+18                                               01650000
@NM00201 EQU   SIBSTAT2                                                 01651000
SIBDACLU EQU   SIBSTAT2                                                 01652000
SIBRDSCN EQU   SIBSTAT2                                                 01653000
SIBTERM  EQU   SIBSTAT2                                                 01654000
SIBUSS   EQU   SIBSTAT2                                                 01655000
SIBBSTAT EQU   SIBSTAT1                                                 01656000
SIBRTRP  EQU   SIBSTAT1                                                 01657000
SIBFTERM EQU   SIBSTAT1                                                 01658000
SIBRQEND EQU   SIBSTAT1                                                 01659000
SIBRQSHT EQU   SIBSTAT1                                                 01660000
SIBSEQO  EQU   SIBSEQN+2                                                01661000
SIBSEQI  EQU   SIBSEQN                                                  01662000
SIBNCNT  EQU   SIBPACIN                                                 01663000
SIBMCNT  EQU   SIBPACIN                                                 01664000
SIBDSTAT EQU   SIBSESSN                                                 01665000
SIBSSTAT EQU   SIBSESSN                                                 01666000
SIBINBIU EQU   SIBSESSN                                                 01667000
SIBSHUTC EQU   SIBSESSN                                                 01668000
SIBLGOFF EQU   SIBSESSN                                                 01669000
SIBINDEX EQU   IEDSIBD+8                                                01670000
SIBCHAIN EQU   IEDSIBD+4                                                01671000
SIBRUSEG EQU   IEDSIBD                                                  01672000
SCBTRANS EQU   IEDQSCB+81                                               01673000
SCBUNTCT EQU   IEDQSCB+80                                               01674000
SCBEOB   EQU   IEDQSCB+78                                               01675000
SCBNXCPB EQU   SCBCCSEG                                                 01676000
SCBNHDR  EQU   SCBCHDR                                                  01677000
SCBCRCD  EQU   IEDQSCB+69                                               01678000
SCBTQBCK EQU   SCBNTXT                                                  01679000
SCBOSEQ  EQU   SCBSCAN                                                  01680000
SCBXTRA  EQU   SCBCORE                                                  01681000
SCBNOPST EQU   SCBSTAT1                                                 01682000
SCBNIDLE EQU   SCBSTAT1                                                 01683000
SCBCEND  EQU   SCBSTAT1                                                 01684000
SCBCBGN  EQU   SCBSTAT1                                                 01685000
SCBSIZE  EQU   IEDQSCB+58                                               01686000
SCBSRCE  EQU   IEDQSCB+56                                               01687000
SCBDEOB  EQU   IEDQSCB+52                                               01688000
SCBFEFO  EQU   SCBDCSEG                                                 01689000
SCBCTBND EQU   SCBBLKCT                                                 01690000
SCBHBFNO EQU   IEDQSCB+44                                               01691000
SCBSCSEG EQU   SCBDNSEG                                                 01692000
SCBBCTR  EQU   SCBCTBSV                                                 01693000
SCBCCHDR EQU   IEDQSCB+37                                               01694000
SCBDESTL EQU   IEDQSCB+36                                               01695000
SCBDCHDR EQU   IEDQSCB+33                                               01696000
SCBCPBNO EQU   IEDQSCB+32                                               01697000
SCBMBSSA EQU   IEDQSCB+25                                               01698000
SCBMLMTN EQU   SCBBSCFM                                                 01699000
SCBNOEOT EQU   SCBBSCFM                                                 01700000
@NM00200 EQU   SCBBSCFM                                                 01701000
SCBNPDTR EQU   SCBDATEN                                                 01702000
SCBCNTEN EQU   SCBBSCFM                                                 01703000
SCBRCVTX EQU   SCBBSCFM                                                 01704000
SCBNONTR EQU   SCBBSCFM                                                 01705000
SCBTRNSP EQU   SCBBSCFM                                                 01706000
SCBENDCR EQU   SCBCTBAC+1                                               01707000
SCBCRLEN EQU   SCBCTBAC                                                 01708000
SCBMRFSD EQU   IEDQSCB+20                                               01709000
@NM00199 EQU   SCBERR4                                                  01710000
SCBTRMLN EQU   SCBERR4                                                  01711000
SCBCONNN EQU   SCBERR4                                                  01712000
SCBAPERR EQU   SCBTXTTN                                                 01713000
SCBTHRSN EQU   SCBATTN                                                  01714000
SCBUSERN EQU   SCBERR3                                                  01715000
SCBSATTN EQU   SCBERR3                                                  01716000
SCBTMINN EQU   SCBERR3                                                  01717000
SCBXPD   EQU   SCBTMIDN                                                 01718000
SCBXPI   EQU   SCBLOSTN                                                 01719000
SCBSOHE  EQU   SCBERR2                                                  01720000
SCBFRWDN EQU   SCBERR2                                                  01721000
SCBOLTR  EQU   SCBERR2                                                  01722000
SCBALN   EQU   SCBERR2                                                  01723000
SCBCODER EQU   SCBERR2                                                  01724000
SCBCRMAX EQU   SCBERR2                                                  01725000
SCBCRMIN EQU   SCBERR2                                                  01726000
SCBRVISL EQU   SCBCUTFN                                                 01727000
SCBNOBFN EQU   SCBERR1                                                  01728000
@NM00198 EQU   SCBERR1                                                  01729000
SCBNOVAC EQU   SCBSEQLN                                                 01730000
SCBNOTSO EQU   SCBSEQHN                                                 01731000
SCBRVITX EQU   SCBNOTRM                                                 01732000
SCBHANG  EQU   SCBORIGN                                                 01733000
SCBNOLOG EQU   SCBHDRRN                                                 01734000
SCBMRFPL EQU   IEDQSCB+13                                               01735000
SCBBFMM  EQU   SCBQTYPE                                                 01736000
SCBBBFTM EQU   SCBQTYPE                                                 01737000
SCBNOFF  EQU   SCBQTYPE                                                 01738000
SCBCONC  EQU   SCBQTYPE                                                 01739000
SCBNREUS EQU   SCBQTYPE                                                 01740000
SCBREUS  EQU   SCBQTYPE                                                 01741000
SCBCOREQ EQU   SCBQTYPE                                                 01742000
SCBNORCL EQU   SCBQTYPE                                                 01743000
SCBCTBSZ EQU   SCBEOBSZ                                                 01744000
@NM00197 EQU   SCBBKFCT                                                 01745000
SCBPRI   EQU   IEDQSCB+8                                                01746000
SCBMACR  EQU   SCBMBHEN                                                 01747000
SCBSNDCT EQU   SCBRCVCT                                                 01748000
SCBDESTQ EQU   IEDQSCB+1                                                01749000
SCBCODE  EQU   SCBSTATE                                                 01750000
SCBPRER  EQU   SCBSTATE                                                 01751000
SCBCKPT  EQU   SCBSTATE                                                 01752000
SCBMSGLN EQU   SCBSTATE                                                 01753000
SCBERSDS EQU   SCBSTATE                                                 01754000
SCBLCK1N EQU   SCBSTATE                                                 01755000
SCBMGFMN EQU   SCBSEQIN                                                 01756000
SCBTRANP EQU   SCBSTATE                                                 01757000
@NM00196 EQU   TRHBYTE2                                                 01758000
@NM00195 EQU   TRHBYTE2                                                 01759000
@NM00194 EQU   TRHBYTE2                                                 01760000
TRHCSI   EQU   TRHBYTE2                                                 01761000
@NM00193 EQU   TRHBYTE2                                                 01762000
TRHCDI   EQU   TRHBYTE2                                                 01763000
TRHEB    EQU   TRHBYTE2                                                 01764000
TRHBB    EQU   TRHBYTE2                                                 01765000
TRHPI    EQU   TRHBYTE1                                                 01766000
@NM00192 EQU   TRHBYTE1                                                 01767000
@NM00191 EQU   TRHBYTE1                                                 01768000
@NM00190 EQU   TRHBYTE1                                                 01769000
TRHER    EQU   TRHBYTE1                                                 01770000
TRHDR2   EQU   TRHBYTE1                                                 01771000
@NM00189 EQU   TRHBYTE1                                                 01772000
TRHDR1   EQU   TRHBYTE1                                                 01773000
TRHFI    EQU   TRHBYTE0                                                 01774000
@NM00188 EQU   TRHBYTE0                                                 01775000
TRHTYPE  EQU   TRHBYTE0                                                 01776000
QCBTTCIN EQU   QCBPLCBA+1                                               01777000
@NM00187 EQU   QCBPLCBA                                                 01778000
@NM00186 EQU   QCBSTAT1                                                 01779000
QCBFLUSH EQU   QCBSTAT1                                                 01780000
QCBNDXRQ EQU   QCBSTAT1                                                 01781000
QCBESIG  EQU   QCBSTAT1                                                 01782000
QCBRCVRQ EQU   QCBSTAT1                                                 01783000
QCBSNDRQ EQU   QCBSTAT1                                                 01784000
QCBWAITC EQU   QCBSTAT1                                                 01785000
QCBCHAIN EQU   IEDNQCB                                                  01786000
QCBPQBCK EQU   IEDQPQCB+25                                              01787000
QCBPRIPQ EQU   IEDQPQCB+24                                              01788000
QCBCFHDR EQU   IEDQPQCB+21                                              01789000
QCBLFEFO EQU   IEDQPQCB+18                                              01790000
QCBFFEFO EQU   IEDQPQCB+15                                              01791000
QCBPREVF EQU   QCBINTLF                                                 01792000
QCBINTFF EQU   IEDQPQCB+9                                               01793000
QCBDATSQ EQU   QCBFHDTZ+1                                               01794000
@NM00185 EQU   QCBFHDTZ                                                 01795000
@NM00184 EQU   QCBPFEFO                                                 01796000
QCBDATFL EQU   QCBFHDLZ                                                 01797000
QCBDNHDR EQU   IEDQPQCB                                                 01798000
QCBQBACK EQU   IEDQQCB+37                                               01799000
QCBCKPT  EQU   QCBFLAG                                                  01800000
QCBPROC  EQU   QCBFLAG                                                  01801000
QCBSDFFO EQU   QCBFLAG                                                  01802000
QCBTERMQ EQU   QCBFLAG                                                  01803000
QCBRSRV  EQU   QCBFLAG                                                  01804000
QCBREAD  EQU   QCBFLAG                                                  01805000
QCBNOBRK EQU   QCBFLAG                                                  01806000
QCBRELLN EQU   IEDQQCB+32                                               01807000
QCBTJID  EQU   QCBLKRRN+1                                               01808000
QCBCARCT EQU   QCBLKRRN                                                 01809000
QCBPRLVL EQU   QCBPREN                                                  01810000
QCBMSGCT EQU   IEDQQCB+26                                               01811000
QCBEXTO  EQU   QCBINTVL                                                 01812000
QCBDISC  EQU   QCBTSOF1                                                 01813000
QCBDELAY EQU   QCBTSOF1                                                 01814000
QCBPARTO EQU   QCBTSOF1                                                 01815000
QCBSATRD EQU   QCBTSOF1                                                 01816000
QCBNOBUF EQU   QCBTSOF1                                                 01817000
QCBTPUT  EQU   QCBTSOF1                                                 01818000
QCBTGET  EQU   QCBTSOF1                                                 01819000
QCBWRBRK EQU   QCBTSOF1                                                 01820000
QCBSATLC EQU   QCBTSOF2                                                 01821000
QCBSATTI EQU   QCBTSOF2                                                 01822000
QCBSATCH EQU   QCBTSOF2                                                 01823000
QCBSIMRD EQU   QCBTSOF2                                                 01824000
QCBDSSMI EQU   QCBTSOF2                                                 01825000
QCBPOSTO EQU   QCBTSOF2                                                 01826000
QCBBUFQ  EQU   QCBTSOF2                                                 01827000
QCBINHBN EQU   QCBTSOF2                                                 01828000
QCBSATCT EQU   @NM00183                                                 01829000
QCBSCBOF EQU   IEDQQCB+20                                               01830000
QCBTIME  EQU   QCBSTAT                                                  01831000
QCBCLOCK EQU   QCBSTAT                                                  01832000
QCBSCHDL EQU   QCBSTAT                                                  01833000
QCBSMODE EQU   QCBSTAT                                                  01834000
QCBSEND  EQU   QCBSTAT                                                  01835000
QCBBUFRD EQU   QCBSTAT                                                  01836000
QCBTRMHO EQU   QCBSTAT                                                  01837000
QCBEOM   EQU   QCBSTAT                                                  01838000
QCBHUCT  EQU   QCBRETCT                                                 01839000
QCBIEND  EQU   QCBRETCT                                                 01840000
QCBEND   EQU   QCBRETCT                                                 01841000
QCBNL    EQU   QCBRETCT                                                 01842000
QCBLOGCT EQU   QCBRETCT                                                 01843000
@NM00182 EQU   QCBBYTE1                                                 01844000
QCBRITRM EQU   QCBBYTE1                                                 01845000
@NM00181 EQU   QCBEOLDT                                                 01846000
QCBSLINK EQU   IEDQQCB+13                                               01847000
QCBSTPRI EQU   IEDQQCB+12                                               01848000
QCBSTCHN EQU   IEDQQCB+9                                                01849000
QCBSTVTO EQU   IEDQQCB+8                                                01850000
QCBLINK  EQU   IEDQQCB+5                                                01851000
QCBPRI   EQU   IEDQQCB+4                                                01852000
QCBCNTEN EQU   QCBELCHN+2                                               01853000
@NM00180 EQU   QCBELCHN+2                                               01854000
@NM00179 EQU   QCBELCHN                                                 01855000
QCBHELD  EQU   QCBDSFLG                                                 01856000
QCBFQCB  EQU   QCBDSFLG                                                 01857000
QCBDRQQ  EQU   QCBDSFLG                                                 01858000
QCBALTMH EQU   QCBDSFLG                                                 01859000
QCBREUS  EQU   QCBDISK                                                  01860000
QCBNREUS EQU   QCBDISK                                                  01861000
QCBCORE  EQU   QCBDSFLG                                                 01862000
QCBTSQ   EQU   QCBDSFLG                                                 01863000
PRF2SEQP EQU   PRF2WD2                                                  01864000
@NM00178 EQU   IEDPF2+1                                                 01865000
@NM00177 EQU   PRF2FLG2                                                 01866000
PRF2TERM EQU   PRF2FLG2                                                 01867000
PRF2SMI  EQU   PRF2FLG2                                                 01868000
PRF2FORM EQU   PRF2FLG2                                                 01869000
PRF2TNTI EQU   PRF2FLG2                                                 01870000
PRF1TAG2 EQU   PRF1SQID+1                                               01871000
@NM00176 EQU   PRF1TAG1                                                 01872000
PRF1TAGS EQU   PRF1TAG1                                                 01873000
@NM00175 EQU   PRF1FLG1                                                 01874000
PRF1LOGD EQU   PRF1FLG1                                                 01875000
PRF1USS  EQU   PRF1FLG1                                                 01876000
PRF1EXPI EQU   PRF1FLG1                                                 01877000
PRF1FIDI EQU   PRF1FLG1                                                 01878000
PRFDEST  EQU   IEDQPRF+40                                               01879000
PRFISEQ  EQU   IEDQPRF+38                                               01880000
PRFSTXT  EQU   PRFHQBCK                                                 01881000
PRFNHDR  EQU   PRFCHDR                                                  01882000
PRFSVSEQ EQU   PRFNTXT+1                                                01883000
PRFSVPRI EQU   PRFEOBOF                                                 01884000
@NM00174 EQU   PRFSCAN                                                  01885000
PRFEOB   EQU   PRFXTRA+1                                                01886000
PRFSTSO  EQU   PRFXTRA                                                  01887000
PRFNHDRN EQU   PRFSTAT1                                                 01888000
PRFNLSTN EQU   PRFSTAT1                                                 01889000
PRFLOCK  EQU   PRFEOFN                                                  01890000
PRFDUPLN EQU   PRFSTAT1                                                 01891000
PRFITCPN EQU   PRFSTAT1                                                 01892000
PRFERMGN EQU   PRFSTAT1                                                 01893000
PRFCNCLN EQU   PRFSTAT1                                                 01894000
PRFSVFLG EQU   @NM00173+3                                               01895000
PRFSRCE  EQU   PRFSVFFO                                                 01896000
PRFTI0   EQU   PRFTIC+1                                                 01897000
@NM00172 EQU   PRFTICC                                                  01898000
@NM00171 EQU   PRFTICC                                                  01899000
@NM00170 EQU   PRFTICC                                                  01900000
PRFTICON EQU   PRFTICC                                                  01901000
@NM00169 EQU   PRFTICC                                                  01902000
@NM00168 EQU   PRFTICC                                                  01903000
PRFBFMM  EQU   PRFTICC                                                  01904000
PRFEOMSG EQU   PRFTICC                                                  01905000
PRFCOUNT EQU   PRFLINK+1                                                01906000
@NM00167 EQU   PRFLINK                                                  01907000
PRFFLAGS EQU   PRFPRI                                                   01908000
PRFIOADR EQU   PRFQCBA                                                  01909000
PRFOPCDE EQU   PRFKEY                                                   01910000
@NM00166 EQU   IEDPLBM+1                                                01911000
@NM00165 EQU   PLBMFLG1                                                 01912000
PLBMSTAT EQU   PLBMFLG1                                                 01913000
PLBMSNDI EQU   PLBMFLG1                                                 01914000
LGBIVLST EQU   IEDNLGB+60                                               01915000
LGBRESV4 EQU   LGBRESER+3                                               01916000
LGBRESV3 EQU   LGBRESER+2                                               01917000
LGBRESV2 EQU   LGBRESER+1                                               01918000
LGBRESV1 EQU   LGBRESER                                                 01919000
LGBBUFSI EQU   IEDNLGB+54                                               01920000
@NM00164 EQU   IEDNLGB+53                                               01921000
LGBILCT  EQU   IEDNLGB+52                                               01922000
LGBSCTAD EQU   IEDNLGB+49                                               01923000
@NM00163 EQU   LGBOFLGS                                                 01924000
LGBOPEN  EQU   LGBOFLGS                                                 01925000
@NM00162 EQU   LGBOFLGS                                                 01926000
LGBNAME  EQU   IEDNLGB+40                                               01927000
@NM00161 EQU   IEDNLGB+36                                               01928000
LGBTRANS EQU   IEDNLGB+33                                               01929000
@NM00160 EQU   IEDNLGB+32                                               01930000
@NM00159 EQU   IEDNLGB+31                                               01931000
LGBOPACE EQU   IEDNLGB+30                                               01932000
@NM00158 EQU   LGBBYTE                                                  01933000
LGBPACK  EQU   LGBBYTE                                                  01934000
LGBBUFMA EQU   IEDNLGB+28                                               01935000
LGBDSORG EQU   IEDNLGB+26                                               01936000
@NM00157 EQU   LGBPCI                                                   01937000
@NM00156 EQU   LGBPCI                                                   01938000
LGBPCINO EQU   LGBPCI                                                   01939000
@NM00155 EQU   LGBPCI                                                   01940000
LGBPCIAO EQU   LGBPCI                                                   01941000
@NM00154 EQU   LGBPCI                                                   01942000
@NM00153 EQU   LGBPCI                                                   01943000
@NM00152 EQU   LGBPCI                                                   01944000
@NM00151 EQU   IEDNLGB+24                                               01945000
LGBMHA   EQU   IEDNLGB+21                                               01946000
@NM00150 EQU   LGBBUFOU                                                 01947000
LGBPREF  EQU   LGBBUFOU                                                 01948000
@NM00149 EQU   LGBBUFOU                                                 01949000
LGBSUBST EQU   IEDNLGB+18                                               01950000
LGBTYPE  EQU   IEDNLGB+17                                               01951000
@NM00148 EQU   IEDNLGB                                                  01952000
LCBERADR EQU   LCBXRADR+1                                               01953000
LCBPCIRC EQU   LCBXRADR                                                 01954000
LCBDCT3  EQU   LCBXDCT+2                                                01955000
LCBDCT2  EQU   LCBXDCT+1                                                01956000
LCBDCT1  EQU   LCBXDCT                                                  01957000
@NM00147 EQU   LCBXFLAG                                                 01958000
LCBERPND EQU   LCBXFLAG                                                 01959000
LCBSRCPF EQU   LCBXFLAG                                                 01960000
LCBGPCTV EQU   LCBXFLAG                                                 01961000
@NM00146 EQU   LCBXFLAG                                                 01962000
@NM00145 EQU   LCBXFLAG                                                 01963000
@NM00144 EQU   LCBXFLAG                                                 01964000
@NM00143 EQU   LCBXFLAG                                                 01965000
LCBCCW10 EQU   LCBCPA+72                                                01966000
LCBCCW9  EQU   LCBCPA+64                                                01967000
LCBCCW8  EQU   LCBCPA+56                                                01968000
LCBCCW7  EQU   LCBCPA+48                                                01969000
LCBCCW6  EQU   LCBCPA+40                                                01970000
LCBCP    EQU   LCBQEBPL+4                                               01971000
LCBIOSB  EQU   LCBQEBPL+1                                               01972000
LCBSIO   EQU   LCBQEBPL                                                 01973000
LCBCCW4  EQU   LCBCPA+24                                                01974000
LCBCCW3  EQU   LCBCPA+16                                                01975000
LCBCCW2  EQU   LCBCPA+8                                                 01976000
LCBCCW1  EQU   LCBCPA                                                   01977000
@NM00128 EQU   LCBERCCW+16                                              01978000
LCBATL05 EQU   LCBERCCW+8                                               01979000
@NM00127 EQU   LCBERCCW                                                 01980000
LCBCSWSV EQU   LCBSAVSN+1                                               01981000
LCBSNSV  EQU   LCBSAVSN                                                 01982000
LCBBFSNS EQU   LCBRSPSV                                                 01983000
LCBWAITC EQU   LCBTPCD+5                                                01984000
LCBINPAK EQU   LCBSTAT6                                                 01985000
LCBMHBID EQU   LCBSTAT6                                                 01986000
LCBRTRRO EQU   LCBSTAT6                                                 01987000
LCBHDRPD EQU   LCBSTAT6                                                 01988000
LCBBFRSV EQU   LCBTPCD+1                                                01989000
@NM00126 EQU   LCBSTAT5                                                 01990000
LCBLUS   EQU   LCBSTAT5                                                 01991000
LCBLUNIT EQU   LCBSTAT5                                                 01992000
LCBPERM  EQU   LCBSTAT5                                                 01993000
LCBNXCMD EQU   LCBBFRW                                                  01994000
LCBERMSK EQU   LCBOBRCH                                                 01995000
LCBOLT   EQU   LCBMSGFM                                                 01996000
LCBEOT   EQU   LCBMSGFM                                                 01997000
LCBENQ   EQU   LCBMSGFM                                                 01998000
LCBTTD   EQU   LCBMSGFM                                                 01999000
LCBRSTRT EQU   LCBMSGFM                                                 02000000
LCBVSTRT EQU   LCBMSGFM                                                 02001000
LCBACKI  EQU   LCBMSGFM                                                 02002000
LCBNAK   EQU   LCBMSGFM                                                 02003000
LCBTTCIN EQU   IEDQLCB+90                                               02004000
@NM00125 EQU   LCBRBCT2                                                 02005000
LCBDCNT  EQU   LCBRBCT2                                                 02006000
LCBRBCT1 EQU   LCBERBCT                                                 02007000
LCBERBCH EQU   IEDQLCB+85                                               02008000
LCBCOMPL EQU   LCBDLNKN                                                 02009000
LCBPRCPG EQU   LCBERBST                                                 02010000
@NM00124 EQU   LCBERBST                                                 02011000
LCBINQ   EQU   LCBERBST                                                 02012000
LCBRDERR EQU   LCBERBST                                                 02013000
LCBEOMSG EQU   LCBERBST                                                 02014000
LCBMSG   EQU   LCBERBST                                                 02015000
LCBERBLK EQU   IEDQLCB+81                                               02016000
LCBERBKY EQU   LCBERB                                                   02017000
LCBRECAD EQU   IEDQLCB+73                                               02018000
@NM00123 EQU   LCBTSTSW                                                 02019000
@NM00122 EQU   LCBTSTSW                                                 02020000
@NM00121 EQU   LCBTSTSW                                                 02021000
@NM00120 EQU   LCBTSTSW                                                 02022000
@NM00119 EQU   LCBTSTSW                                                 02023000
@NM00118 EQU   LCBTSTSW                                                 02024000
@NM00117 EQU   LCBTSTSW                                                 02025000
LCBCONCT EQU   LCBTSTSW                                                 02026000
LCBRESP  EQU   LCBSTAT2                                                 02027000
LCBBFRAV EQU   LCBDIAL                                                  02028000
LCBATTN  EQU   LCBSYNC                                                  02029000
LCBNEGRP EQU   LCBSTAT2                                                 02030000
LCBSNDPR EQU   LCBSTAT2                                                 02031000
LCBCONNN EQU   LCBBEOTN                                                 02032000
LCBMSGNN EQU   LCBSTAT2                                                 02033000
LCBTRACE EQU   LCBSTAT2                                                 02034000
LCBSENDN EQU   LCBSTAT1                                                 02035000
LCBFREEN EQU   LCBSTAT1                                                 02036000
LCBCONT  EQU   LCBSTAT1                                                 02037000
LCBINITN EQU   LCBSTAT1                                                 02038000
LCBOCNI  EQU   LCBSTAT1                                                 02039000
LCBOCWTN EQU   LCBSTAT1                                                 02040000
LCBRECOF EQU   IEDQLCB+68                                               02041000
LCBRDBFR EQU   LCBRCBFR                                                 02042000
LCBUCBX  EQU   IEDQLCB+64                                               02043000
LCBTTBIN EQU   LCBERRCT                                                 02044000
@NM00116 EQU   LCBINCAM                                                 02045000
LCBGETMN EQU   LCBINCAM                                                 02046000
@NM00115 EQU   LCBRESTR+1                                               02047000
LCBCMDSV EQU   LCBRESTR                                                 02048000
LCBPCILK EQU   LCBDCBPT                                                 02049000
LCBSTART EQU   LCBIOBSN+16                                              02050000
LCBAP4OL EQU   LCBSIOCC                                                 02051000
LCBAP3OL EQU   LCBSIOCC                                                 02052000
LCBAP2OL EQU   LCBSIOCC                                                 02053000
LCBAP1OL EQU   LCBSIOCC                                                 02054000
LCBSIOC2 EQU   LCBSIOCC                                                 02055000
LCBSIOC1 EQU   LCBSIOCC                                                 02056000
@NM00114 EQU   LCBSIOCC                                                 02057000
LCBCSWRC EQU   LCBCSW+5                                                 02058000
LCBCSCHC EQU   LCBCSWCS                                                 02059000
LCBCSICC EQU   LCBCSWCS                                                 02060000
LCBCSCCC EQU   LCBCSWCS                                                 02061000
LCBCSCDC EQU   LCBCSWCS                                                 02062000
LCBCSPTC EQU   LCBCSWCS                                                 02063000
LCBCSPGC EQU   LCBCSWCS                                                 02064000
LCBCSIL  EQU   LCBCSWCS                                                 02065000
LCBCSPCI EQU   LCBCSWCS                                                 02066000
LCBUSUC  EQU   LCBCSWUS                                                 02067000
LCBUSDE  EQU   LCBCSWUS                                                 02068000
LCBUSCE  EQU   LCBCSWUS                                                 02069000
LCBUSBSY EQU   LCBCSWUS                                                 02070000
LCBUSCUE EQU   LCBCSWUS                                                 02071000
LCBUSSM  EQU   LCBCSWUS                                                 02072000
LCBUSAT  EQU   LCBCSWUS                                                 02073000
LCBCSWCA EQU   LCBCSW                                                   02074000
LCBOBR   EQU   LCBFLAG3                                                 02075000
LCBOBRRD EQU   LCBFLAG3                                                 02076000
LCBIOMSG EQU   LCBFLAG3                                                 02077000
LCBSOHC  EQU   LCBFLAG3                                                 02078000
LCBRLAD  EQU   LCBFLAG3                                                 02079000
LCBSOHR  EQU   LCBFLAG3                                                 02080000
@NM00113 EQU   LCBFLAG3                                                 02081000
LCBECBPT EQU   LCBIOBSN+4                                               02082000
LCBECBCC EQU   LCBIOBSN+3                                               02083000
LCBSENS1 EQU   LCBSNS+1                                                 02084000
LCBABORT EQU   LCBTMOUT                                                 02085000
LCBNOTIN EQU   LCBLOSDT                                                 02086000
LCBOVRUN EQU   LCBSENS0                                                 02087000
LCBDATCK EQU   LCBSENS0                                                 02088000
LCBEQUCK EQU   LCBSENS0                                                 02089000
LCBBUSCK EQU   LCBSENS0                                                 02090000
LCBINTRQ EQU   LCBSENS0                                                 02091000
LCBCMDRJ EQU   LCBSENS0                                                 02092000
LCBFLAG2 EQU   LCBIOBSN                                                 02093000
@NM00112 EQU   LCBFLAG1                                                 02094000
LCBUNREL EQU   LCBFLAG1                                                 02095000
LCBEXCPN EQU   LCBFLAG1                                                 02096000
@NM00111 EQU   LCBFLAG1                                                 02097000
LCBERPIN EQU   LCBFLAG1                                                 02098000
@NM00110 EQU   LCBFLAG1                                                 02099000
LCBFSBFR EQU   LCBMHA                                                   02100000
LCBISZE  EQU   IEDQLCB+28                                               02101000
LCBLNENT EQU   LCBSCBDA+1                                               02102000
@NM00109 EQU   LCBSCBDA                                                 02103000
LCBCPGMH EQU   LCBSTAT4                                                 02104000
LCBREAL  EQU   LCBPHASE                                                 02105000
@NM00108 EQU   LCBSTAT4                                                 02106000
LCBACTRQ EQU   LCBSTAT4                                                 02107000
LCBIPLRQ EQU   LCBSTAT4                                                 02108000
LCBDACRQ EQU   LCBSTAT4                                                 02109000
LCBDMPRQ EQU   LCBSTAT4                                                 02110000
@NM00107 EQU   LCBLKMDE                                                 02111000
LCBLOCKI EQU   LCBLKMDE                                                 02112000
LCBLOCKR EQU   LCBLKMDE                                                 02113000
LCBHMFLG EQU   LCBLKMDE                                                 02114000
LCBBDFLG EQU   LCBLKMDE                                                 02115000
@NM00106 EQU   LCBINSRC                                                 02116000
LCBCTLMD EQU   LCBTETEN                                                 02117000
LCBBFRSZ EQU   LCBCHAIN                                                 02118000
LCBUREQN EQU   LCBCHAIN                                                 02119000
LCBNORTY EQU   LCBCHAIN                                                 02120000
LCBERMSG EQU   LCBCHAIN                                                 02121000
LCBEXCP  EQU   LCBCHAIN                                                 02122000
LCBINVRQ EQU   LCBSCRNN                                                 02123000
LCB2741N EQU   LCBTSOB                                                  02124000
LCBINHBN EQU   LCBTSOB                                                  02125000
LCBCIRCD EQU   LCBTSOB                                                  02126000
LCBPREP  EQU   LCBTSOB                                                  02127000
LCBSOPL  EQU   LCBTSOB                                                  02128000
LCBSATRD EQU   LCBTSOB                                                  02129000
LCBTSBUF EQU   LCBTSOB                                                  02130000
LCBWRBRK EQU   LCBTSOB                                                  02131000
LCBTDL   EQU   IEDQLCB+18                                               02132000
LCBEOLTD EQU   IEDQLCB+16                                               02133000
LCBRSLNK EQU   IEDQLCB+13                                               02134000
LCBRSPRI EQU   IEDQLCB+12                                               02135000
LCBSTCBA EQU   IEDQLCB+9                                                02136000
LCBRSKEY EQU   IEDQLCB+8                                                02137000
LCBLINK  EQU   LCBRCB+5                                                 02138000
LCBKEY   EQU   LCBRCB                                                   02139000
SAVTLLCB EQU   IEDNSVTD+316                                             02140000
SAVTBITN EQU   IEDNSVTD+312                                             02141000
@NM00105 EQU   SAVTCKQB+8                                               02142000
@NM00104 EQU   SAVTCKEC+1                                               02143000
@NM00103 EQU   SAVTCKCC                                                 02144000
SAVTCKPO EQU   SAVTCKCC                                                 02145000
SAVTCKWA EQU   SAVTCKCC                                                 02146000
SAVTCKCH EQU   SAVTCKTB+1                                               02147000
SAVTCKVT EQU   SAVTCKTB                                                 02148000
@NM00102 EQU   IEDNSVTD+297                                             02149000
SAVTRDFG EQU   SAVTRDRV+12                                              02150000
@NM00101 EQU   SAVTRDRV+5                                               02151000
SAVTRDPY EQU   SAVTRDRV+4                                               02152000
SAVTRDQB EQU   SAVTRDRV+1                                               02153000
SAVTRDKY EQU   SAVTRDRV                                                 02154000
SAVTNID  EQU   IEDNSVTD+280                                             02155000
SAVTDVAS EQU   IEDNSVTD+276                                             02156000
SAVTPLSZ EQU   IEDNSVTD+274                                             02157000
@NM00100 EQU   IEDNSVTD+273                                             02158000
SAVTSUBL EQU   IEDNSVTD+272                                             02159000
@NM00099 EQU   SAVTZELM+1                                               02160000
SAVTSUBM EQU   SAVTZELM                                                 02161000
SAVTMHDX EQU   IEDNSVTD+268                                             02162000
SAVTNAT1 EQU   IEDNSVTD+266                                             02163000
SAVTSH20 EQU   IEDNSVTD+264                                             02164000
SAVTLCBS EQU   IEDNSVTD+260                                             02165000
SAVTTNTX EQU   IEDNSVTD+252                                             02166000
SAVTNAX  EQU   IEDNSVTD+248                                             02167000
SAVTSUBV EQU   IEDNSVTD+247                                             02168000
SAVTSUBA EQU   IEDNSVTD+246                                             02169000
SAVTSIBC EQU   IEDNSVTD+244                                             02170000
SAVTSCPT EQU   SAVTTCPU                                                 02171000
SAVTRQTG EQU   IEDNSVTD+236                                             02172000
SAVTRQCH EQU   IEDNSVTD+232                                             02173000
SAVTMAND EQU   IEDNSVTD+228                                             02174000
SAVTSPLN EQU   IEDNSVTD+224                                             02175000
SAVTNADL EQU   IEDNSVTD+222                                             02176000
SAVTNATL EQU   IEDNSVTD+220                                             02177000
SAVTMHTB EQU   IEDNSVTD+216                                             02178000
SAVTSSMH EQU   IEDNSVTD+212                                             02179000
SAVTQRS  EQU   IEDNSVTD+208                                             02180000
SAVTRQIN EQU   IEDNSVTD+204                                             02181000
SAVTDFCO EQU   IEDNSVTD+200                                             02182000
SAVTSAO  EQU   IEDNSVTD+196                                             02183000
SAVTSARI EQU   IEDNSVTD+192                                             02184000
SAVTSAC  EQU   IEDNSVTD+188                                             02185000
SAVTSAI  EQU   IEDNSVTD+184                                             02186000
SAVTCSCI EQU   IEDNSVTD+180                                             02187000
SAVTSSRP EQU   IEDNSVTD+176                                             02188000
SAVTSSRQ EQU   IEDNSVTD+172                                             02189000
SAVTSCLU EQU   IEDNSVTD+168                                             02190000
SAVTXTRQ EQU   IEDNSVTD+164                                             02191000
SAVTMVBF EQU   IEDNSVTD+160                                             02192000
@NM00098 EQU   IEDNSVTD+148                                             02193000
SAVTIPCQ EQU   IEDNSVTD+144                                             02194000
@NM00097 EQU   IEDNSVTD+136                                             02195000
@NM00096 EQU   IEDNSVTD+124                                             02196000
SAVTXFMO EQU   IEDNSVTD+120                                             02197000
@NM00095 EQU   IEDNSVTD+116                                             02198000
SAVTSSSR EQU   IEDNSVTD+112                                             02199000
SAVTSCPQ EQU   IEDNSVTD+108                                             02200000
SAVTSLCB EQU   IEDNSVTD+104                                             02201000
SAVTLUSR EQU   IEDNSVTD+100                                             02202000
@NM00094 EQU   SAVTLUSQ+8                                               02203000
SAVTLUSP EQU   SAVTLUSQ+4                                               02204000
SAVTLUSB EQU   SAVTLUSQ                                                 02205000
@NM00093 EQU   IEDNSVTD+84                                              02206000
SAVTSAT  EQU   IEDNSVTD+80                                              02207000
SAVTNAT  EQU   IEDNSVTD+76                                              02208000
SAVTCLUP EQU   IEDNSVTD+72                                              02209000
SAVTPIUT EQU   IEDNSVTD+68                                              02210000
SAVTRNTA EQU   IEDNSVTD+64                                              02211000
SAVTCNIR EQU   IEDNSVTD+56                                              02212000
SAVTFLDH EQU   IEDNSVTD+52                                              02213000
SAVTSRTN EQU   IEDNSVTD+48                                              02214000
SAVTSREQ EQU   IEDNSVTD+44                                              02215000
SAVTFAIL EQU   IEDNSVTD+42                                              02216000
SAVTSUSE EQU   IEDNSVTD+40                                              02217000
SAVTSIB  EQU   IEDNSVTD+36                                              02218000
SAVTPRTN EQU   IEDNSVTD+32                                              02219000
@NM00092 EQU   IEDNSVTD+28                                              02220000
SAVTWH20 EQU   IEDNSVTD+26                                              02221000
SAVTPWT  EQU   IEDNSVTD+24                                              02222000
SAVTPRTQ EQU   IEDNSVTD+20                                              02223000
SAVTPREQ EQU   IEDNSVTD+16                                              02224000
SAVTPH20 EQU   IEDNSVTD+14                                              02225000
SAVTPUSE EQU   IEDNSVTD+12                                              02226000
SAVTPLCB EQU   IEDNSVTD+8                                               02227000
SAVTPOOL EQU   IEDNSVTD+4                                               02228000
SAVTPRMT EQU   SAVTDIAF                                                 02229000
SAVTVIRT EQU   SAVTDIAF                                                 02230000
AVTCPBNO EQU   IEDQAVTD+1172                                            02231000
AVTHRESS EQU   IEDQAVTD+1171                                            02232000
@NM00091 EQU   IEDQAVTD+1170                                            02233000
@NM00090 EQU   IEDQAVTD+1169                                            02234000
@NM00089 EQU   IEDQAVTD+1168                                            02235000
@NM00088 EQU   IEDQAVTD+1165                                            02236000
@NM00087 EQU   IEDQAVTD+1164                                            02237000
AVTHRESE EQU   @NM00086                                                 02238000
AVTRADDR EQU   IEDQAVTD+1156                                            02239000
AVTNADDR EQU   IEDQAVTD+1152                                            02240000
AVTHRESN EQU   IEDQAVTD+1148                                            02241000
AVTVOLRN EQU   IEDQAVTD+1144                                            02242000
AVTTOTNN EQU   IEDQAVTD+1140                                            02243000
AVTTRCYN EQU   IEDQAVTD+1136                                            02244000
AVTRCTRN EQU   IEDQAVTD+1132                                            02245000
AVTNOVON EQU   IEDQAVTD+1128                                            02246000
AVTADEBN EQU   IEDQAVTD+1124                                            02247000
AVTVOLRR EQU   IEDQAVTD+1120                                            02248000
AVTTOTNR EQU   IEDQAVTD+1116                                            02249000
AVTTRCYR EQU   IEDQAVTD+1112                                            02250000
AVTRCTRR EQU   IEDQAVTD+1108                                            02251000
AVTNOVOR EQU   IEDQAVTD+1104                                            02252000
AVTADEBR EQU   IEDQAVTD+1100                                            02253000
AVTLODPT EQU   IEDQAVTD+1096                                            02254000
AVTIOBN  EQU   IEDQAVTD+1092                                            02255000
AVTIOBR  EQU   IEDQAVTD+1088                                            02256000
AVTCPBPT EQU   IEDQAVTD+1084                                            02257000
AVTFCPB  EQU   IEDQAVTD+1080                                            02258000
@NM00085 EQU   IEDQAVTD+1076                                            02259000
AVTINCPQ EQU   IEDQAVTD+1072                                            02260000
@NM00084 EQU   IEDQAVTD+1068                                            02261000
@NM00083 EQU   IEDQAVTD+1065                                            02262000
@NM00082 EQU   AVTBIT4                                                  02263000
@NM00081 EQU   AVTBIT4                                                  02264000
@NM00080 EQU   AVTBIT4                                                  02265000
@NM00079 EQU   AVTBIT4                                                  02266000
@NM00078 EQU   AVTBIT4                                                  02267000
@NM00077 EQU   AVTBIT4                                                  02268000
@NM00076 EQU   AVTBIT4                                                  02269000
AVTRUFTN EQU   AVTBIT4                                                  02270000
@NM00075 EQU   IEDQAVTD+1060                                            02271000
AVTNOBFQ EQU   IEDQAVTD+1056                                            02272000
@NM00074 EQU   IEDQAVTD+1052                                            02273000
AVTDKENQ EQU   IEDQAVTD+1048                                            02274000
@NM00073 EQU   IEDQAVTD+1044                                            02275000
AVTDKAPQ EQU   IEDQAVTD+1040                                            02276000
AVTCOPY  EQU   IEDQAVTD+1036                                            02277000
AVTIA    EQU   IEDQAVTD+1032                                            02278000
AVTFL    EQU   IEDQAVTD+1028                                            02279000
@NM00072 EQU   IEDQAVTD+1024                                            02280000
AVTNCPBQ EQU   IEDQAVTD+1020                                            02281000
AVTTOTNC EQU   IEDQAVTD+1016                                            02282000
AVTCMAX  EQU   IEDQAVTD+1012                                            02283000
AVTCMIN  EQU   IEDQAVTD+1008                                            02284000
AVTHM02  EQU   IEDQAVTD+1004                                            02285000
AVTOPCIN EQU   IEDQAVTD+1002                                            02286000
AVTDCTLN EQU   IEDQAVTD+1000                                            02287000
AVTOPMSK EQU   IEDQAVTD+996                                             02288000
AVTDDFT  EQU   IEDQAVTD+992                                             02289000
AVTSTEAL EQU   IEDQAVTD+988                                             02290000
AVTOPTN  EQU   IEDQAVTD+984                                             02291000
AVTDSKCT EQU   IEDQAVTD+982                                             02292000
AVTCKRST EQU   IEDQAVTD+981                                             02293000
AVTSTAN  EQU   AVTBIT3                                                  02294000
AVTSTACN EQU   AVTBIT3                                                  02295000
AVTSTAIN EQU   AVTBIT3                                                  02296000
AVTSTAYN EQU   AVTBIT3                                                  02297000
AVTOLTBN EQU   AVTBIT3                                                  02298000
AVTTSAB  EQU   AVTBIT3                                                  02299000
AVTRFULN EQU   AVTBIT3                                                  02300000
AVTRECVN EQU   AVTBIT3                                                  02301000
@NM00071 EQU   AVTBIT2                                                  02302000
@NM00070 EQU   AVTBIT2                                                  02303000
AVTOPEIN EQU   AVTBIT2                                                  02304000
AVTSTRTN EQU   AVTBIT2                                                  02305000
AVTTOPOL EQU   AVTBIT2                                                  02306000
AVTCOPYN EQU   AVTBIT2                                                  02307000
AVTREUSN EQU   AVTBIT2                                                  02308000
AVTEXTSC EQU   AVTBIT2                                                  02309000
AVTDISKN EQU   AVTBIT1                                                  02310000
AVTQUCKN EQU   AVTBIT1                                                  02311000
AVTCLOSN EQU   AVTBIT1                                                  02312000
AVTREADN EQU   AVTBIT1                                                  02313000
AVTDLAYN EQU   AVTBIT1                                                  02314000
AVTAQTAN EQU   AVTBIT1                                                  02315000
AVTTSON  EQU   AVTBIT1                                                  02316000
AVTAPLKN EQU   AVTBIT1                                                  02317000
AVTDUMBR EQU   IEDQAVTD+976                                             02318000
AVTDLQX  EQU   IEDQAVTD+974                                             02319000
AVTINTLV EQU   IEDQAVTD+972                                             02320000
AVTSMCNT EQU   IEDQAVTD+970                                             02321000
AVTAVFCT EQU   IEDQAVTD+968                                             02322000
AVTOPCON EQU   IEDQAVTD+966                                             02323000
AVTOPCNT EQU   IEDQAVTD+964                                             02324000
AVTLNCNT EQU   IEDQAVTD+962                                             02325000
AVTKEYLE EQU   IEDQAVTD+960                                             02326000
AVTHA16  EQU   IEDQAVTD+958                                             02327000
AVTHA7   EQU   IEDQAVTD+956                                             02328000
AVTHA4   EQU   IEDQAVTD+954                                             02329000
AVTHA3   EQU   IEDQAVTD+952                                             02330000
AVTHA2   EQU   IEDQAVTD+950                                             02331000
AVTGETMS EQU   IEDQAVTD+949                                             02332000
@NM00069 EQU   IEDQAVTD+948                                             02333000
AVTGETMD EQU   IEDQAVTD+944                                             02334000
AVTGETMN EQU   IEDQAVTD+940                                             02335000
AVTCWTOT EQU   IEDQAVTD+936                                             02336000
AVTCWINT EQU   IEDQAVTD+884                                             02337000
AVTDTRAP EQU   IEDQAVTD+880                                             02338000
@NM00068 EQU   IEDQAVTD+878                                             02339000
@NM00067 EQU   AVTIOTR                                                  02340000
AVTIOTRH EQU   AVTIOTR                                                  02341000
AVTIOTRE EQU   AVTIOTR                                                  02342000
@NM00066 EQU   AVTSUBT                                                  02343000
AVTSUBPT EQU   AVTSUBT                                                  02344000
AVTSUBON EQU   AVTSUBT                                                  02345000
AVTAFE30 EQU   IEDQAVTD+872                                             02346000
AVTAFE20 EQU   IEDQAVTD+868                                             02347000
AVTAFE10 EQU   IEDQAVTD+864                                             02348000
AVTCWEC2 EQU   IEDQAVTD+860                                             02349000
AVTCWPM2 EQU   IEDQAVTD+856                                             02350000
AVTCWTS2 EQU   IEDQAVTD+855                                             02351000
AVTCWTS1 EQU   IEDQAVTD+854                                             02352000
AVTCWCLD EQU   AVTCWFL2                                                 02353000
AVTCWRAP EQU   AVTCWFL2                                                 02354000
@NM00065 EQU   AVTCWFL2                                                 02355000
@NM00064 EQU   AVTCWFL2                                                 02356000
@NM00063 EQU   AVTCWFL2                                                 02357000
@NM00062 EQU   AVTCWFL2                                                 02358000
@NM00061 EQU   AVTCWFL2                                                 02359000
AVTCWACT EQU   AVTCWFL2                                                 02360000
@NM00060 EQU   AVTCWFL1                                                 02361000
@NM00059 EQU   AVTCWFL1                                                 02362000
@NM00058 EQU   AVTCWFL1                                                 02363000
@NM00057 EQU   AVTCWFL1                                                 02364000
@NM00056 EQU   AVTCWFL1                                                 02365000
@NM00055 EQU   AVTCWFL1                                                 02366000
@NM00054 EQU   AVTCWFL1                                                 02367000
AVTCOMWN EQU   AVTCWFL1                                                 02368000
AVTCWEC1 EQU   IEDQAVTD+848                                             02369000
AVTCWPM1 EQU   IEDQAVTD+844                                             02370000
AVTCAREA EQU   IEDQAVTD+840                                             02371000
AVTFZERO EQU   IEDQAVTD+836                                             02372000
AVTCADDR EQU   IEDQAVTD+832                                             02373000
AVTCOREC EQU   IEDQAVTD+828                                             02374000
@NM00053 EQU   IEDQAVTD+820                                             02375000
AVTCPBCB EQU   IEDQAVTD+816                                             02376000
@NM00052 EQU   IEDQAVTD+808                                             02377000
AVTDSIOB EQU   IEDQAVTD+804                                             02378000
@NM00051 EQU   IEDQAVTD+796                                             02379000
AVTCPRMB EQU   IEDQAVTD+792                                             02380000
@NM00050 EQU   IEDQAVTD+784                                             02381000
AVTCLOSB EQU   IEDQAVTD+780                                             02382000
@NM00049 EQU   IEDQAVTD+772                                             02383000
AVTACTIB EQU   IEDQAVTD+768                                             02384000
@NM00048 EQU   IEDQAVTD+764                                             02385000
AVTOLTEB EQU   IEDQAVTD+760                                             02386000
AVTOLTCH EQU   AVTOLTQB+1                                               02387000
AVTOLTVT EQU   AVTOLTQB                                                 02388000
@NM00047 EQU   AVTOPCQB+8                                               02389000
@NM00046 EQU   AVTOPCEC+1                                               02390000
@NM00045 EQU   AVTOPCCC                                                 02391000
AVTOPCPO EQU   AVTOPCCC                                                 02392000
AVTOPCWA EQU   AVTOPCCC                                                 02393000
AVTOPCCH EQU   AVTOPCOB+1                                               02394000
AVTOPCVT EQU   AVTOPCOB                                                 02395000
@NM00044 EQU   AVTCKPQB+9                                               02396000
AVTCKPTS EQU   AVTCKPQB+8                                               02397000
@NM00043 EQU   AVTCKPEC+1                                               02398000
@NM00042 EQU   AVTCKPCC                                                 02399000
AVTCKPPO EQU   AVTCKPCC                                                 02400000
AVTCKPWA EQU   AVTCKPCC                                                 02401000
AVTCKPCH EQU   AVTCKPTB+1                                               02402000
AVTCKPVT EQU   AVTCKPTB                                                 02403000
@NM00041 EQU   IEDQAVTD+724                                             02404000
@NM00040 EQU   IEDQAVTD+716                                             02405000
AVTSELCH EQU   IEDQAVTD+713                                             02406000
AVTBFRTN EQU   AVTBFRFG                                                 02407000
AVTBFREB EQU   IEDQAVTD+708                                             02408000
AVTTIMQ  EQU   IEDQAVTD+704                                             02409000
@NM00039 EQU   IEDQAVTD+700                                             02410000
AVTIMQPS EQU   IEDQAVTD+696                                             02411000
AVTINOUT EQU   IEDQAVTD+694                                             02412000
AVTREFTM EQU   IEDQAVTD+692                                             02413000
@NM00038 EQU   IEDQAVTD+680                                             02414000
AVTDELYB EQU   IEDQAVTD+676                                             02415000
AVTOCQPT EQU   IEDQAVTD+672                                             02416000
AVTSUPPT EQU   IEDQAVTD+664                                             02417000
AVTCBQCB EQU   IEDQAVTD+660                                             02418000
@NM00037 EQU   AVTSYSER                                                 02419000
@NM00036 EQU   AVTSYSER                                                 02420000
@NM00035 EQU   AVTSYSER                                                 02421000
@NM00034 EQU   AVTSYSER                                                 02422000
@NM00033 EQU   AVTSYSER                                                 02423000
@NM00032 EQU   AVTSYSER                                                 02424000
AVTCMAXN EQU   AVTSYSER                                                 02425000
AVTCMINN EQU   AVTSYSER                                                 02426000
AVT2260L EQU   IEDQAVTD+652                                             02427000
AVTABEPL EQU   AVTADBUF                                                 02428000
AVTHFF   EQU   AVTCLRHI+2                                               02429000
@NM00031 EQU   AVTCLRHI                                                 02430000
AVTCCLNK EQU   AVTCRELE+5                                               02431000
AVTCCPRI EQU   AVTCRELE+4                                               02432000
AVTCCQCB EQU   AVTCCELE+1                                               02433000
AVTCCKEY EQU   AVTCCELE                                                 02434000
AVTDELAD EQU   IEDQAVTD+632                                             02435000
AVTDELEM EQU   IEDQAVTD+628                                             02436000
AVTBSX   EQU   AVTCKLNK                                                 02437000
AVTOPETR EQU   AVTHG01                                                  02438000
@NM00030 EQU   AVTCKBYT                                                 02439000
AVTCKONQ EQU   AVTCKBYT                                                 02440000
@NM00029 EQU   AVTCKBYT                                                 02441000
@NM00028 EQU   AVTCKBYT                                                 02442000
@NM00027 EQU   AVTCKBYT                                                 02443000
@NM00026 EQU   AVTCKBYT                                                 02444000
@NM00025 EQU   AVTCKBYT                                                 02445000
@NM00024 EQU   AVTCKBYT                                                 02446000
AVTOPERT EQU   IEDQAVTD+618                                             02447000
AVTOPXCL EQU   IEDQAVTD+616                                             02448000
AVTOPERL EQU   IEDQAVTD+615                                             02449000
@NM00023 EQU   IEDQAVTD+614                                             02450000
AVTCKTIM EQU   IEDQAVTD+612                                             02451000
AVTCKELV EQU   IEDQAVTD+610                                             02452000
AVTCPRCD EQU   IEDQAVTD+609                                             02453000
AVTWARMN EQU   AVTCKELF                                                 02454000
AVTCRTLN EQU   AVTCKELF                                                 02455000
AVTCPIPN EQU   AVTCKELF                                                 02456000
AVTCCLCN EQU   AVTCKELF                                                 02457000
AVTCINCN EQU   AVTCKELF                                                 02458000
@NM00022 EQU   AVTCKELF                                                 02459000
AVTCMCPN EQU   AVTCKELF                                                 02460000
AVTNQBCK EQU   AVTCKELF                                                 02461000
AVTCKQAD EQU   IEDQAVTD+605                                             02462000
AVTSCBSZ EQU   IEDQAVTD+604                                             02463000
@NM00021 EQU   IEDQAVTD+600                                             02464000
AVTCKELE EQU   IEDQAVTD+596                                             02465000
@NM00020 EQU   AVTCKPEL+8                                               02466000
AVTCKRLK EQU   AVTCKPEL+5                                               02467000
AVTCKRPR EQU   AVTCKPEL+4                                               02468000
AVTCKRMQ EQU   AVTCKRMV+1                                               02469000
AVTCKRKY EQU   AVTCKRMV                                                 02470000
AVTHK    EQU   IEDQAVTD+576                                             02471000
AVTHI    EQU   IEDQAVTD+572                                             02472000
AVTIOT   EQU   IEDQAVTD+568                                             02473000
AVTNX    EQU   IEDQAVTD+564                                             02474000
AVTTONE  EQU   IEDQAVTD+560                                             02475000
AVTA3TL  EQU   IEDQAVTD+556                                             02476000
AVTDMECB EQU   IEDQAVTD+552                                             02477000
AVTABEND EQU   IEDQAVTD+546                                             02478000
AVTPLCBN EQU   IEDQAVTD+544                                             02479000
@NM00019 EQU   AVTSAVTP+1                                               02480000
@NM00018 EQU   AVTSAVTF                                                 02481000
AVTSNA   EQU   AVTSAVTF                                                 02482000
AVTONSNA EQU   AVTSAVTF                                                 02483000
AVTVTMCP EQU   AVTSAVTF                                                 02484000
@NM00017 EQU   IEDQAVTD+536                                             02485000
AVTCMBSS EQU   IEDQAVTD+532                                             02486000
AVTRCV   EQU   IEDQAVTD+528                                             02487000
AVTSEND  EQU   IEDQAVTD+524                                             02488000
AVTCSCH  EQU   IEDQAVTD+520                                             02489000
AVTQ1    EQU   IEDQAVTD+516                                             02490000
AVTE7    EQU   IEDQAVTD+512                                             02491000
AVTHB    EQU   IEDQAVTD+508                                             02492000
AVTR1    EQU   IEDQAVTD+504                                             02493000
AVTBZ    EQU   IEDQAVTD+500                                             02494000
AVTEZ    EQU   IEDQAVTD+496                                             02495000
AVTEC    EQU   IEDQAVTD+492                                             02496000
AVTEW    EQU   IEDQAVTD+488                                             02497000
AVTNDIAL EQU   AVTSCOPT                                                 02498000
AVTN2741 EQU   AVTSCOPT                                                 02499000
AVTCONCO EQU   AVTSCOPT                                                 02500000
AVTCONC  EQU   AVTSCOPT                                                 02501000
AVTCMBUF EQU   AVTSCOPT                                                 02502000
AVTAPDMP EQU   AVTSCOPT                                                 02503000
@NM00016 EQU   AVTSCOPT                                                 02504000
AVTHA    EQU   AVTDISP                                                  02505000
AVTEA    EQU   IEDQAVTD+476                                             02506000
AVTAX    EQU   IEDQAVTD+472                                             02507000
AVTA3    EQU   IEDQAVTD+468                                             02508000
AVTGD    EQU   IEDQAVTD+464                                             02509000
AVTAL    EQU   IEDQAVTD+460                                             02510000
AVTOLTST EQU   AVTHG02                                                  02511000
AVTE8    EQU   IEDQAVTD+452                                             02512000
AVTUI    EQU   IEDQAVTD+448                                             02513000
AVTCOMPT EQU   IEDQAVTD+444                                             02514000
AVTCRSRF EQU   IEDQAVTD+440                                             02515000
@NM00015 EQU   IEDQAVTD+436                                             02516000
AVTKA02  EQU   IEDQAVTD+432                                             02517000
AVTOPTPT EQU   IEDQAVTD+428                                             02518000
AVTPCBPT EQU   IEDQAVTD+424                                             02519000
@NM00014 EQU   AVTECB1                                                  02520000
AVTCOMP  EQU   AVTECB1                                                  02521000
@NM00013 EQU   AVTECB1                                                  02522000
AVTOPECA EQU   IEDQAVTD+416                                             02523000
AVTOLECA EQU   IEDQAVTD+412                                             02524000
AVTCKECA EQU   IEDQAVTD+408                                             02525000
AVTCWECA EQU   IEDQAVTD+404                                             02526000
AVTCWTCB EQU   IEDQAVTD+400                                             02527000
AVTOLTCB EQU   IEDQAVTD+396                                             02528000
AVTOCTCB EQU   IEDQAVTD+392                                             02529000
AVTCKTCB EQU   IEDQAVTD+388                                             02530000
AVTAS    EQU   IEDQAVTD+384                                             02531000
AVTNOLBF EQU   IEDQAVTD+382                                             02532000
AVTNCKPR EQU   IEDQAVTD+381                                             02533000
AVTCIB   EQU   IEDQAVTD+380                                             02534000
AVTSPLPT EQU   IEDQAVTD+376                                             02535000
AVTMVBFR EQU   IEDQAVTD+372                                             02536000
AVTSBTA  EQU   IEDQAVTD+368                                             02537000
AVTRARTN EQU   IEDQAVTD+364                                             02538000
AVTBSCAN EQU   IEDQAVTD+360                                             02539000
AVTRDYA  EQU   IEDQAVTD+356                                             02540000
AVTDISTR EQU   IEDQAVTD+348                                             02541000
AVTPARM3 EQU   IEDQAVTD+344                                             02542000
@NM00012 EQU   AVTPKF                                                   02543000
@NM00011 EQU   AVTPKF                                                   02544000
@NM00010 EQU   AVTPKF                                                   02545000
AVTFTCHF EQU   AVTPKF                                                   02546000
@NM00009 EQU   AVTPKF                                                   02547000
@NM00008 EQU   AVTPKF                                                   02548000
@NM00007 EQU   AVTPKF                                                   02549000
@NM00006 EQU   AVTPKF                                                   02550000
AVTPARM  EQU   IEDQAVTD+336                                             02551000
AVTEXS2A EQU   IEDQAVTD+330                                             02552000
AVTEXA2S EQU   IEDQAVTD+324                                             02553000
AVTOCGET EQU   IEDQAVTD+320                                             02554000
AVTCKAVT EQU   @NM00004+1                                               02555000
@NM00005 EQU   AVTCKFLG                                                 02556000
AVTCKHLT EQU   AVTCKFLG                                                 02557000
AVTCKREQ EQU   AVTCKFLG                                                 02558000
AVTCKENV EQU   AVTCKFLG                                                 02559000
AVTCKNAC EQU   AVTCKFLG                                                 02560000
AVTCKTAC EQU   AVTCKFLG                                                 02561000
AVTBUENT EQU   IEDQAVTD+314                                             02562000
@NM00003 EQU   IEDQAVTD+313                                             02563000
AVTFULLT EQU   AVTBUFSW                                                 02564000
AVTUNCON EQU   AVTBUFSW                                                 02565000
@NM00002 EQU   AVTBUFSW                                                 02566000
AVTBUFTR EQU   AVTREADD                                                 02567000
AVTREADY EQU   IEDQAVTD+304                                             02568000
AVTRACE  EQU   IEDQAVTD+300                                             02569000
AVTTCB   EQU   IEDQAVTD+296                                             02570000
AVTPASWD EQU   IEDQAVTD+288                                             02571000
AVTCTLCH EQU   IEDQAVTD+280                                             02572000
AVTDOUBL EQU   IEDQAVTD+272                                             02573000
AVTDOUBX EQU   IEDQAVTD+264                                             02574000
AVTDPARM EQU   IEDQAVTD+260                                             02575000
AVTCSTCS EQU   IEDQAVTD+256                                             02576000
AVTDLQ   EQU   AVTSAVEX+32                                              02577000
@NM00001 EQU   AVTSAVEX                                                 02578000
AVTSAVE4 EQU   IEDQAVTD+144                                             02579000
AVTSAVE3 EQU   IEDQAVTD+72                                              02580000
AVTSAVE2 EQU   IEDQAVTD                                                 02581000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02582000
@RC00480 EQU   @RC00471                                                 02583000
@RC00534 EQU   @RC00532                                                 02584000
@RC00595 EQU   @RC00593                                                 02585000
@RC00598 EQU   @RC00593                                                 02586000
@RC00610 EQU   @RC00593                                                 02587000
@RC00651 EQU   @RC00649                                                 02588000
@RF00679 EQU   @EL00008                                                 02589000
@RF00696 EQU   @EL00008                                                 02590000
@PB00009 EQU   @EL00001                                                 02591000
@RF00486 EQU   @RC00480                                                 02592000
@PB00008 EQU   @PB00009                                                 02593000
@PB00007 EQU   @PB00008                                                 02594000
@PB00006 EQU   @PB00007                                                 02595000
@PB00005 EQU   @PB00006                                                 02596000
@PB00004 EQU   @PB00005                                                 02597000
@PB00003 EQU   @PB00004                                                 02598000
@PB00002 EQU   @PB00003                                                 02599000
@ENDDATA EQU   *                                                        02600000
         END   IEDRSPIN,(C'PLS1606',0701,78038)                         02601000
