         TITLE 'IEDSCPRP , RESPONSE HANDLER                            *00001000
                        '                                               00002000
IEDSCPRP CSECT ,                                                   0001 00003000
@PROLOG  DS    0H                                                  0002 00004000
         USING *,RBASE                                                  00005000
         DC    A(0)                     START OF QCB                    00006000
         DC    A(0)                                                     00007000
         DC    X'06'                    START OF STCB                   00008000
         DC    AL3(*-1)                                                 00009000
         LR    RBASE,RQCB               SET UP ADDRESSIBILITY           00010000
IEDSCPRP IEDHJN START,HJN                                               00011000
*                                                                  0416 00012000
*   /*****************************************************************/ 00013000
*   /*                                                               */ 00014000
*   /* MAIN ROUTINE                                                  */ 00015000
*   /*                                                               */ 00016000
*   /*****************************************************************/ 00017000
*                                                                  0416 00018000
*                                   /* INITIALIZATION                */ 00019000
*   PIUBFRP=RPARM;                  /* PIU ADDRESS                   */ 00020000
         ST    RPARM,PIUBFRP                                       0416 00021000
*   PIUSTART=ADDR(PRFPIUO)+PRFPIUO; /* START OF PIU                  */ 00022000
         L     @10,PIUBFRP                                         0417 00023000
         LA    @09,PRFPIUO(,@10)                                   0417 00024000
         SLR   @06,@06                                             0417 00025000
         IC    @06,PRFPIUO(,@10)                                   0417 00026000
         ALR   @09,@06                                             0417 00027000
         ST    @09,PIUSTART                                        0417 00028000
*   CMDADDR=ADDR(PIURU);            /* SET UP PTR TO COMMAND         */ 00029000
         LA    @10,PIURU(,@09)                                     0418 00030000
         ST    @10,CMDADDR                                         0418 00031000
*   RPARM=TTHOAF;                   /* TNT OFFSET FOR OAF            */ 00032000
         SLR   RPARM,RPARM                                         0419 00033000
         ICM   RPARM,3,TTHOAF(@09)                                 0419 00034000
*   CALL IEDQTNT;                   /* TNT LOOKUP ROUTINE            */ 00035000
         L     @15,AVTRNMPT(,RAVT)                                 0420 00036000
         BALR  @14,@15                                             0420 00037000
*   RTRM=RPARM;                     /* TERMINAL ENTRY ADDRESS        */ 00038000
         LR    RTRM,RPARM                                          0421 00039000
*/*                                                                  */ 00040000
*                                                                  0422 00041000
*   IF TRHSDI=ON THEN               /* SENSE INCLUDED                */ 00042000
         L     @10,PIUSTART                                        0422 00043000
         TM    TRHSDI+10(@10),B'00000100'                          0422 00044000
         BNO   @RF00422                                            0422 00045000
*     DO;                                                          0423 00046000
*       SNSPTR=ADDR(PIURU);         /* SET UP POINTER TO SENSE       */ 00047000
         LA    @10,PIURU(,@10)                                     0424 00048000
         ST    @10,SNSPTR                                          0424 00049000
*       CMDADDR=CMDADDR+LENGTH(IEDSNSD);/* ADJUST CMD ADDRESS        */ 00050000
         LA    @10,4                                               0425 00051000
         AL    @10,CMDADDR                                         0425 00052000
         ST    @10,CMDADDR                                         0425 00053000
*     END;                                                         0426 00054000
*                                                                  0426 00055000
*/*                                                                  */ 00056000
*                                                                  0427 00057000
*   IF TRMTYPE=TRMLUNT|TRMTYPE=TRMPUNT THEN/* OAF A LU OR NON-NCP PU?*/ 00058000
@RF00422 LR    @10,RTRM                                            0427 00059000
         SL    @10,@CF01505                                        0427 00060000
         CLI   TRMTYPE(@10),X'30'                                  0427 00061000
         BE    @RT00427                                            0427 00062000
         CLI   TRMTYPE(@10),X'18'                                  0427 00063000
         BNE   @RF00427                                            0427 00064000
@RT00427 DS    0H                                                  0428 00065000
*     DO;                                                          0428 00066000
*       TRMSCPRQ=OFF;               /* REQUEST OUTSTANDING =OFF      */ 00067000
         LR    @10,RTRM                                            0429 00068000
         AL    @10,@CF01507                                        0429 00069000
         NI    TRMSCPRQ-3(@10),B'01111111'                         0429 00070000
*       CALL CHAINCHK;              /* CHECK SSCP SERIALIZER CHAIN   */ 00071000
         BAL   @14,CHAINCHK                                        0430 00072000
*     END;                                                         0431 00073000
*   CALL FINDSIB;                   /* FIND APPROPRIATE SIB          */ 00074000
@RF00427 BAL   @14,FINDSIB                                         0432 00075000
*/*                                                                  */ 00076000
*                                                                  0433 00077000
*   IF CMDBYTE=CD1ACTPU THEN        /* RSP TO ACTPU?                 */ 00078000
         L     @09,CMDADDR                                         0433 00079000
         CLI   CMDBYTE(@09),X'11'                                  0433 00080000
         BNE   @RF00433                                            0433 00081000
*     CALL ACTPURSP;                /* PROCESS ACTPU RESPONSE        */ 00082000
         BAL   @14,ACTPURSP                                        0434 00083000
*   ELSE                                                           0435 00084000
*     IF CMDBYTE=CD1SDT THEN        /* START DATA TRAFFIC RSP?       */ 00085000
         B     @RC00433                                            0435 00086000
@RF00433 L     @09,CMDADDR                                         0435 00087000
         CLI   CMDBYTE(@09),X'A0'                                  0435 00088000
         BNE   @RF00435                                            0435 00089000
*       CALL SDTRSP;                /* PROCESS SDT RESPONSE          */ 00090000
         BAL   @14,SDTRSP                                          0436 00091000
*     ELSE                                                         0437 00092000
*       IF CMDBYTE=CD1DATPU THEN    /* DACTPU RESPONSE?              */ 00093000
         B     @RC00435                                            0437 00094000
@RF00435 L     @09,CMDADDR                                         0437 00095000
         CLI   CMDBYTE(@09),X'12'                                  0437 00096000
         BNE   @RF00437                                            0437 00097000
*         CALL DACTPURP;            /* PROCESS DACTPU                */ 00098000
         BAL   @14,DACTPURP                                        0438 00099000
*       ELSE                                                       0439 00100000
*         IF CMDBYTE=CD1ACTLU THEN  /* ACTLU RESPONSE?               */ 00101000
         B     @RC00437                                            0439 00102000
@RF00437 L     @09,CMDADDR                                         0439 00103000
         CLI   CMDBYTE(@09),X'0D'                                  0439 00104000
         BNE   @RF00439                                            0439 00105000
*           CALL ACTLURSP;          /* PROCESS ACTLU RESPONSE        */ 00106000
         BAL   @14,ACTLURSP                                        0440 00107000
*         ELSE                                                     0441 00108000
*           IF CMDBYTE=CD1DATLU THEN/* DACTLU RESPONSE               */ 00109000
         B     @RC00439                                            0441 00110000
@RF00439 L     @09,CMDADDR                                         0441 00111000
         CLI   CMDBYTE(@09),X'0E'                                  0441 00112000
         BNE   @RF00441                                            0441 00113000
*             CALL DACTLURP;        /* PROCESS DACTLU RESPONSE       */ 00114000
         BAL   @14,DACTLURP                                        0442 00115000
*           ELSE                                                   0443 00116000
*             IF CMD3BYTE=CD1XEXT THEN/* EXECUTE TEST RESPONSE       */ 00117000
         B     @RC00441                                            0443 00118000
@RF00441 L     @10,CMDADDR                                         0443 00119000
         CLC   CMD3BYTE(3,@10),@CB00763                            0443 00120000
         BNE   @RF00443                                            0443 00121000
*               CALL TOTERSP;       /* PROCESS EX TEST RESPONSE      */ 00122000
         BAL   @14,TOTERSP                                         0444 00123000
*             ELSE                                                 0445 00124000
*               CALL PIUCNVT;       /* CONVERT PIU AND SET UP FOR  0445 00125000
*                                      POST                          */ 00126000
         B     @RC00443                                            0445 00127000
@RF00443 BAL   @14,PIUCNVT                                         0445 00128000
*/*                                                                  */ 00129000
*                                                                  0446 00130000
*   CALL DSPPOST;                   /* EXIT TO DISPATCHER            */ 00131000
@RC00443 DS    0H                                                  0446 00132000
@RC00441 DS    0H                                                  0446 00133000
@RC00439 DS    0H                                                  0446 00134000
@RC00437 DS    0H                                                  0446 00135000
@RC00435 DS    0H                                                  0446 00136000
@RC00433 LA    @15,DSPPOST(,RDISP)                                 0446 00137000
         BALR  @14,@15                                             0446 00138000
*ACTLURSP:                                                         0447 00139000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0447 00140000
*                                                                  0447 00141000
@EL00001 DS    0H                                                  0447 00142000
@EF00001 DS    0H                                                  0447 00143000
@ER00001 BR    @14                                                 0447 00144000
ACTLURSP DS    0H                                                  0448 00145000
*   /*****************************************************************/ 00146000
*   /*                                                               */ 00147000
*   /* THIS ROUTINE PROCESSES THE RESPONSE TO ACTLU. THIS ROUTINE    */ 00148000
*   /* MAKES SURE THAT THE ACTLU COMMAND WAS SENT AND MAKES STATE    */ 00149000
*   /* CHANGES ACCORDING TO THE RESPONSE. IF ACTLU WAS NOT SENT THE  */ 00150000
*   /* RESPONSE IS THROWN AWAY.                                      */ 00151000
*   /*                                                               */ 00152000
*   /*****************************************************************/ 00153000
*                                                                  0448 00154000
*   SAVE1=RE;                       /* SAVE REG 14                   */ 00155000
         ST    RE,SAVE1                                            0448 00156000
*/*                                                                  */ 00157000
*                                                                  0449 00158000
*   IF SIBSSTAT=SIBSAPND THEN       /* ACTLU SENT                    */ 00159000
         TM    SIBSSTAT(SIBPTR),B'00000100'                        0449 00160000
         BNO   @RF00449                                            0449 00161000
         TM    SIBSSTAT(SIBPTR),B'00011000'                        0449 00162000
         BNZ   @RF00449                                            0449 00163000
*     DO;                                                          0450 00164000
*       IF TRHSDI=OFF|SNSMAJ=SNSRQREJ&/* "GOOD RESPONSE"             */ 00165000
*           SNSMIN=SNSACTV THEN                                    0451 00166000
         L     @09,PIUSTART                                        0451 00167000
         TM    TRHSDI+10(@09),B'00000100'                          0451 00168000
         BZ    @RT00451                                            0451 00169000
         L     @09,SNSPTR                                          0451 00170000
         CLI   SNSMAJ(@09),X'08'                                   0451 00171000
         BNE   @RF00451                                            0451 00172000
         CLI   SNSMIN(@09),X'15'                                   0451 00173000
         BNE   @RF00451                                            0451 00174000
@RT00451 DS    0H                                                  0452 00175000
*         DO;                                                      0452 00176000
*           SIBSSTAT=SIBSACTV;      /* SET SESSION ACTIVE            */ 00177000
         OI    SIBSSTAT(SIBPTR),B'00011100'                        0453 00178000
*           SIBDSTAT=SIBDACTV;      /* SET DATA TRAFFIC ACTIVE     0454 00179000
*                                                            @YM03747*/ 00180000
         OI    SIBDSTAT(SIBPTR),B'00000011'                        0454 00181000
*           TRMRSACT=ON;            /* SET RESOURCE ACTIVE           */ 00182000
         LR    @05,RTRM                                            0455 00183000
         AL    @05,@CF01515                                        0455 00184000
         LA    @06,TRMRSACT-2(,@05)                                0455 00185000
         LR    @02,@06                                             0455 00186000
         LA    @10,3                                               0455 00187000
         NR    @02,@10                                             0455 00188000
         LCR   @02,@02                                             0455 00189000
         ALR   @06,@02                                             0455 00190000
         L     @10,0(,@06)                                         0455 00191000
@GL00004 LR    @09,@10                                             0455 00192000
         O     @09,@CB01511+3(@02)                                 0455 00193000
         CS    @10,@09,0(@06)                                      0455 00194000
         BNE   @GL00004                                            0455 00195000
*         END;                                                     0456 00196000
*       ELSE                                                       0457 00197000
*         SIBSSTAT=SIBSRSET;        /* SET SESSION RESET             */ 00198000
         B     @RC00451                                            0457 00199000
@RF00451 NI    SIBSSTAT(SIBPTR),B'11101111'                        0457 00200000
         OI    SIBSSTAT(SIBPTR),B'00001100'                        0457 00201000
*       CALL PIUCNVT;               /* CONVERT THE PIU               */ 00202000
@RC00451 BAL   @14,PIUCNVT                                         0458 00203000
*     END;                                                         0459 00204000
*                                                                  0459 00205000
*/*                                                                  */ 00206000
*                                                                  0460 00207000
*   ELSE                                                           0460 00208000
*     CALL FREEBUF;                 /* FREE THE BUFFER               */ 00209000
         B     @RC00449                                            0460 00210000
@RF00449 BAL   @14,FREEBUF                                         0460 00211000
*/*                                                                  */ 00212000
*                                                                  0461 00213000
*   RE=SAVE1;                       /* RESTORE REG 14                */ 00214000
@RC00449 L     RE,SAVE1                                            0461 00215000
*   END ACTLURSP;                   /* RETURN                        */ 00216000
@EL00002 DS    0H                                                  0462 00217000
@EF00002 DS    0H                                                  0462 00218000
@ER00002 BR    @14                                                 0462 00219000
*ACTPURSP:                                                         0463 00220000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0463 00221000
*                                                                  0463 00222000
ACTPURSP DS    0H                                                  0464 00223000
*   /*****************************************************************/ 00224000
*   /*                                                               */ 00225000
*   /* THIS ROUTINE PROCESSES THE RESPONSE TO ACTPU. THIS ROUTINE    */ 00226000
*   /* MAKES SURE THAT THE ACTPU COMMAND WAS SENT AND MAKES STATE    */ 00227000
*   /* CHANGES ACCORDING TO THE RESPONSE. IF ACTPU WAS NOT SENT THE  */ 00228000
*   /* RESPONSE IS THROWN AWAY.                                      */ 00229000
*   /*                                                               */ 00230000
*   /*****************************************************************/ 00231000
*                                                                  0464 00232000
*   SAVE1=RE;                       /* SAVE REG 14                   */ 00233000
         ST    RE,SAVE1                                            0464 00234000
*/*                                                                  */ 00235000
*                                                                  0465 00236000
*   IF SIBSSTAT=SIBSAPND THEN       /* ACTPU SENT                    */ 00237000
         TM    SIBSSTAT(SIBPTR),B'00000100'                        0465 00238000
         BNO   @RF00465                                            0465 00239000
         TM    SIBSSTAT(SIBPTR),B'00011000'                        0465 00240000
         BNZ   @RF00465                                            0465 00241000
*     DO;                                                          0466 00242000
*                                                                  0466 00243000
*/*                                                                  */ 00244000
*                                                                  0467 00245000
*       IF TRHSDI=OFF|SNSMAJ=SNSRQREJ&/* GOOD RESPONSE?              */ 00246000
*           SNSMIN=SNSACTV THEN                                    0467 00247000
         L     @09,PIUSTART                                        0467 00248000
         TM    TRHSDI+10(@09),B'00000100'                          0467 00249000
         BZ    @RT00467                                            0467 00250000
         L     @09,SNSPTR                                          0467 00251000
         CLI   SNSMAJ(@09),X'08'                                   0467 00252000
         BNE   @RF00467                                            0467 00253000
         CLI   SNSMIN(@09),X'15'                                   0467 00254000
         BNE   @RF00467                                            0467 00255000
@RT00467 DS    0H                                                  0468 00256000
*         DO;                                                      0468 00257000
*           SIBSSTAT=SIBSACTV;      /* SET SESSION ACTIVE            */ 00258000
         OI    SIBSSTAT(SIBPTR),B'00011100'                        0469 00259000
*           TRMRSACT=ON;            /* MARK ACTIVE                   */ 00260000
         LR    @04,RTRM                                            0470 00261000
         AL    @04,@CF01515                                        0470 00262000
         LA    @02,TRMRSACT-2(,@04)                                0470 00263000
         LR    @05,@02                                             0470 00264000
         LA    @09,3                                               0470 00265000
         NR    @05,@09                                             0470 00266000
         LCR   @05,@05                                             0470 00267000
         ALR   @02,@05                                             0470 00268000
         L     @09,0(,@02)                                         0470 00269000
@GL00007 LR    @06,@09                                             0470 00270000
         O     @06,@CB01511+3(@05)                                 0470 00271000
         CS    @09,@06,0(@02)                                      0470 00272000
         BNE   @GL00007                                            0470 00273000
*/*                                                                  */ 00274000
*                                                                  0471 00275000
*           IF SIBTSPRO<TSPRO3 THEN /* NON-NCP PU?                   */ 00276000
         CLI   SIBTSPRO(SIBPTR),3                                  0471 00277000
         BNL   @RF00471                                            0471 00278000
*             SIBDSTAT=SIBDACTV;    /* SET DATA TRAFFIC ACTIVE       */ 00279000
         OI    SIBDSTAT(SIBPTR),B'00000011'                        0472 00280000
*         END;                                                     0473 00281000
*                                                                  0473 00282000
*/*                                                                  */ 00283000
*                                                                  0474 00284000
*       ELSE                        /* BAD RESPONSE                  */ 00285000
*         SIBSSTAT=SIBSRSET;        /* SET SESSION RESET             */ 00286000
         B     @RC00467                                            0474 00287000
@RF00467 NI    SIBSSTAT(SIBPTR),B'11101111'                        0474 00288000
         OI    SIBSSTAT(SIBPTR),B'00001100'                        0474 00289000
*       CALL PIUCNVT;               /* PREPARE TO CONVERT PIU        */ 00290000
@RC00467 BAL   @14,PIUCNVT                                         0475 00291000
*     END;                                                         0476 00292000
*   ELSE                            /* ACTPU WAS NOT SENT            */ 00293000
*     CALL FREEBUF;                 /* FREE THE RESPONSE PIU         */ 00294000
         B     @RC00465                                            0477 00295000
@RF00465 BAL   @14,FREEBUF                                         0477 00296000
*/*                                                                  */ 00297000
*                                                                  0478 00298000
*   RE=SAVE1;                       /* RESTORE REG 14                */ 00299000
@RC00465 L     RE,SAVE1                                            0478 00300000
*   END ACTPURSP;                                                  0479 00301000
@EL00003 DS    0H                                                  0479 00302000
@EF00003 DS    0H                                                  0479 00303000
@ER00003 BR    @14                                                 0479 00304000
*CHAINCHK:                                                         0480 00305000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0480 00306000
*                                                                  0480 00307000
CHAINCHK DS    0H                                                  0481 00308000
*   /*****************************************************************/ 00309000
*   /*                                                               */ 00310000
*   /* THIS ROUTINE CHECKS THE SSCP SERIALIZER CHAIN TO DETERMINE IF */ 00311000
*   /* A REQUEST EXISTS FOR THE RESOURCE. IF A REQUEST IS FOUND IT   */ 00312000
*   /* DELINKED FROM THE CHAIN AND TPOSTED TO THE SSCP DESTINATION   */ 00313000
*   /* QUEUE.                                                        */ 00314000
*   /*                                                               */ 00315000
*   /*****************************************************************/ 00316000
*                                                                  0481 00317000
*                                   /* INITIALIZATION                */ 00318000
*   SAVE1=RE;                       /* SAVE REG 14                   */ 00319000
         ST    RE,SAVE1                                            0481 00320000
*   FOUNDSW=OFF;                    /* INITIALIZE LOOP SWITCH        */ 00321000
         NI    FOUNDSW,B'01111111'                                 0482 00322000
*   PREVIOUS=ADDR(SAVTSSSR)-4;      /* TREAT SERIALIZER CHAIN ANCHOR    00323000
*                                      AS THE ZEROTH ELEMENT         */ 00324000
         L     @09,AVTSAVTP(,RAVT)                                 0483 00325000
         LA    @06,SAVTSSSR(,@09)                                  0483 00326000
         SL    @06,@CF00255                                        0483 00327000
         ST    @06,PREVIOUS                                        0483 00328000
*   CURRENT=SAVTSSSR;               /* CURRENT POINTS TO FIRST     0484 00329000
*                                      ELEMENT                       */ 00330000
         L     CURRENT,SAVTSSSR(,@09)                              0484 00331000
*/*                                                                  */ 00332000
*                                                                  0485 00333000
*   DO WHILE CURRENT>0&FOUNDSW=OFF; /* NOT LAST ELEMENT AND MATCH NOT   00334000
*                                      FOUND                         */ 00335000
         B     @DE00485                                            0485 00336000
@DL00485 DS    0H                                                  0486 00337000
*     IF TTHOAF=CURRENT->PRFDEST THEN/* BUFFER FOR THIS RESOURCE     */ 00338000
         L     @09,PIUSTART                                        0486 00339000
         SLR   @06,@06                                             0486 00340000
         ICM   @06,3,TTHOAF(@09)                                   0486 00341000
         CH    @06,PRFDEST(,CURRENT)                               0486 00342000
         BNE   @RF00486                                            0486 00343000
*       DO;                                                        0487 00344000
*         PREVIOUS->PRFLINK=CURRENT->PRFLINK;/* MOVE LINK FIELD INTO    00345000
*                                      PREVIOUS LINK FIELD           */ 00346000
         L     @09,PREVIOUS                                        0488 00347000
         MVC   PRFLINK(3,@09),PRFLINK(CURRENT)                     0488 00348000
*         FOUNDSW=ON;               /* SET LOOP SWITCH ON            */ 00349000
         OI    FOUNDSW,B'10000000'                                 0489 00350000
*       END;                                                       0490 00351000
*                                                                  0490 00352000
*/*                                                                  */ 00353000
*                                                                  0491 00354000
*     ELSE                          /* MATCH NOT FOUND               */ 00355000
*       DO;                         /* BUMP POINTERS                 */ 00356000
         B     @RC00486                                            0491 00357000
@RF00486 DS    0H                                                  0492 00358000
*         PREVIOUS=CURRENT;         /* PREV ELEMENT BECOMES THE    0492 00359000
*                                      CURRENT ELEMENT               */ 00360000
         ST    CURRENT,PREVIOUS                                    0492 00361000
*         CURRENT=CURRENT->PRFLINK; /* CURRENT ELEMENT SET UP FROM 0493 00362000
*                                      LINK FIELD                    */ 00363000
         L     @09,PRFLINK-1(,CURRENT)                             0493 00364000
         LA    @09,0(,@09)                                         0493 00365000
         LR    CURRENT,@09                                         0493 00366000
*       END;                                                       0494 00367000
*   END;                                                           0495 00368000
*                                                                  0495 00369000
@RC00486 DS    0H                                                  0495 00370000
@DE00485 LTR   CURRENT,CURRENT                                     0495 00371000
         BNP   @DC00485                                            0495 00372000
         TM    FOUNDSW,B'10000000'                                 0495 00373000
         BZ    @DL00485                                            0495 00374000
@DC00485 DS    0H                                                  0496 00375000
*/*                                                                  */ 00376000
*                                                                  0496 00377000
*   IF FOUNDSW=ON THEN              /* BUFFER FOUND FOR THIS         */ 00378000
         TM    FOUNDSW,B'10000000'                                 0496 00379000
         BNO   @RF00496                                            0496 00380000
*     DO;                           /* RESOURCE - YES TPOST THE    0497 00381000
*                                      BUFFER TO THE SSCP DESTINATION   00382000
*                                      QUEUE                         */ 00383000
*       RPARM=CURRENT;              /* CURRENT ELEMANT ADDRESS       */ 00384000
         LR    RPARM,CURRENT                                       0498 00385000
*       CURRENT->PRFPRI=PRIDESTQ+1; /* SET PRIORITY HIGHER THAN THE     00386000
*                                      NORMAL PRIORITY               */ 00387000
         MVI   PRFPRI(CURRENT),X'E5'                               0499 00388000
*       CALL DSPPOSTR;              /* TPOST ELEMENT TO SSCP       0500 00389000
*                                      DESTINATION QUEUE             */ 00390000
         LA    @15,DSPPOSTR(,RDISP)                                0500 00391000
         BALR  @14,@15                                             0500 00392000
*     END;                                                         0501 00393000
*   RE=SAVE1;                       /* RESTORE REG 14                */ 00394000
@RF00496 L     RE,SAVE1                                            0502 00395000
*/*                                                                  */ 00396000
*                                                                  0503 00397000
*   END CHAINCHK;                                                  0503 00398000
@EL00004 DS    0H                                                  0503 00399000
@EF00004 DS    0H                                                  0503 00400000
@ER00004 BR    @14                                                 0503 00401000
*DACTLURP:                                                         0504 00402000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0504 00403000
*                                                                  0504 00404000
DACTLURP DS    0H                                                  0505 00405000
*   /*****************************************************************/ 00406000
*   /*                                                               */ 00407000
*   /* THIS ROUTINE PROCESSES THE RESPONSE TO DACTLU. THIS ROUTINE   */ 00408000
*   /* MAKES SURE THAT THE DACTLU COMMAND WAS SENT AND MAKES STATE   */ 00409000
*   /* CHANGES ACCORDING TO THE RESPONSE. IF DACTLU WAS NOT SENT THE */ 00410000
*   /* RESPONSE IS THROWN AWAY.                                      */ 00411000
*   /*                                                               */ 00412000
*   /*****************************************************************/ 00413000
*                                                                  0505 00414000
*   SAVE1=RE;                       /* SAVE REG 14                   */ 00415000
         ST    RE,SAVE1                                            0505 00416000
*/*                                                                  */ 00417000
*                                                                  0506 00418000
*   IF SIBSSTAT=SIBSRPND THEN       /* DACTLU SENT                   */ 00419000
         TM    SIBSSTAT(SIBPTR),B'00001000'                        0506 00420000
         BNO   @RF00506                                            0506 00421000
         TM    SIBSSTAT(SIBPTR),B'00010100'                        0506 00422000
         BNZ   @RF00506                                            0506 00423000
*     DO;                                                          0507 00424000
*       SIBSSTAT=SIBSRSET;          /* SET SESSION RESET             */ 00425000
         NI    SIBSSTAT(SIBPTR),B'11101111'                        0508 00426000
         OI    SIBSSTAT(SIBPTR),B'00001100'                        0508 00427000
*       SIBDSTAT=SIBDRSET;          /* SET DATA TRAFFIC RESET      0509 00428000
*                                                            @YM03747*/ 00429000
         NI    SIBDSTAT(SIBPTR),B'11111100'                        0509 00430000
*       TRMRSACT=OFF;               /* SET RESOURCE INACTIVE         */ 00431000
         LR    @05,RTRM                                            0510 00432000
         AL    @05,@CF01515                                        0510 00433000
         LA    @06,TRMRSACT-2(,@05)                                0510 00434000
         LR    @02,@06                                             0510 00435000
         LA    @10,3                                               0510 00436000
         NR    @02,@10                                             0510 00437000
         LCR   @02,@02                                             0510 00438000
         ALR   @06,@02                                             0510 00439000
         L     @10,0(,@06)                                         0510 00440000
@GL00009 LR    @09,@10                                             0510 00441000
         N     @09,@CB01520+3(@02)                                 0510 00442000
         CS    @10,@09,0(@06)                                      0510 00443000
         BNE   @GL00009                                            0510 00444000
*       CALL PIUCNVT;               /* CONVERT THE PIU               */ 00445000
         BAL   @14,PIUCNVT                                         0511 00446000
*     END;                                                         0512 00447000
*                                                                  0512 00448000
*/*                                                                  */ 00449000
*                                                                  0513 00450000
*   ELSE                                                           0513 00451000
*     CALL FREEBUF;                 /* FREE THE BUFFER               */ 00452000
         B     @RC00506                                            0513 00453000
@RF00506 BAL   @14,FREEBUF                                         0513 00454000
*/*                                                                  */ 00455000
*                                                                  0514 00456000
*   RE=SAVE1;                       /* RESTORE REG 14                */ 00457000
@RC00506 L     RE,SAVE1                                            0514 00458000
*   END DACTLURP;                   /* RETURN                        */ 00459000
@EL00005 DS    0H                                                  0515 00460000
@EF00005 DS    0H                                                  0515 00461000
@ER00005 BR    @14                                                 0515 00462000
*DACTPURP:                                                         0516 00463000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0516 00464000
*                                                                  0516 00465000
DACTPURP DS    0H                                                  0517 00466000
*   /*****************************************************************/ 00467000
*   /*                                                               */ 00468000
*   /* THIS ROUTINE PROCESSES THE RESPONSE TO DACTPU. THIS ROUTINE   */ 00469000
*   /* MAKES SURE THAT THE DACTPU COMMAND WAS SENT AND MAKES STATE   */ 00470000
*   /* CHANGES ACCORDING TO THE RESPONSE. IF DACTPU WAS NOT SENT THE */ 00471000
*   /* RESPONSE IS THROWN AWAY.                                      */ 00472000
*   /*                                                               */ 00473000
*   /*****************************************************************/ 00474000
*                                                                  0517 00475000
*   SAVE1=RE;                       /* SAVE REG 14                   */ 00476000
         ST    RE,SAVE1                                            0517 00477000
*/*                                                                  */ 00478000
*                                                                  0518 00479000
*   IF SIBSSTAT=SIBSRPND THEN       /* DACTPU SENT                   */ 00480000
         TM    SIBSSTAT(SIBPTR),B'00001000'                        0518 00481000
         BNO   @RF00518                                            0518 00482000
         TM    SIBSSTAT(SIBPTR),B'00010100'                        0518 00483000
         BNZ   @RF00518                                            0518 00484000
*     DO;                                                          0519 00485000
*       SIBSSTAT=SIBSRSET;          /* SET SESSION RESET             */ 00486000
         NI    SIBSSTAT(SIBPTR),B'11101111'                        0520 00487000
         OI    SIBSSTAT(SIBPTR),B'00001100'                        0520 00488000
*       TRMRSACT=OFF;               /* SET RESOURCE INACTIVE         */ 00489000
         LR    @05,RTRM                                            0521 00490000
         AL    @05,@CF01515                                        0521 00491000
         LA    @06,TRMRSACT-2(,@05)                                0521 00492000
         LR    @02,@06                                             0521 00493000
         LA    @10,3                                               0521 00494000
         NR    @02,@10                                             0521 00495000
         LCR   @02,@02                                             0521 00496000
         ALR   @06,@02                                             0521 00497000
         L     @10,0(,@06)                                         0521 00498000
@GL00010 LR    @09,@10                                             0521 00499000
         N     @09,@CB01520+3(@02)                                 0521 00500000
         CS    @10,@09,0(@06)                                      0521 00501000
         BNE   @GL00010                                            0521 00502000
*       CALL PIUCNVT;               /* CONVERT THE PIU               */ 00503000
         BAL   @14,PIUCNVT                                         0522 00504000
*     END;                                                         0523 00505000
*                                                                  0523 00506000
*/*                                                                  */ 00507000
*                                                                  0524 00508000
*   ELSE                                                           0524 00509000
*     CALL FREEBUF;                 /* FREE THE BUFFER               */ 00510000
         B     @RC00518                                            0524 00511000
@RF00518 BAL   @14,FREEBUF                                         0524 00512000
*/*                                                                  */ 00513000
*                                                                  0525 00514000
*   RE=SAVE1;                       /* RESTORE REG 14                */ 00515000
@RC00518 L     RE,SAVE1                                            0525 00516000
*   END DACTPURP;                   /* RETURN                        */ 00517000
@EL00006 DS    0H                                                  0526 00518000
@EF00006 DS    0H                                                  0526 00519000
@ER00006 BR    @14                                                 0526 00520000
*                                                                  0527 00521000
*   /*****************************************************************/ 00522000
*   /*                                                               */ 00523000
*   /* THIS ROUTINE CHECKS THE SIB CHAIN FOR THE SSCP SIB. A SWITCH  */ 00524000
*   /* (FOUNDSW) IS SET WHEN A MATCH IS FOUND.                       */ 00525000
*   /*                                                               */ 00526000
*   /*****************************************************************/ 00527000
*                                                                  0527 00528000
*FINDSIB:                                                          0527 00529000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0527 00530000
FINDSIB  DS    0H                                                  0528 00531000
*   SIBPTR=TRMSIBPT;                /* INITIALIZE PTR TO SIB         */ 00532000
         LR    @09,RTRM                                            0528 00533000
         AL    @09,@CF01524                                        0528 00534000
         SLR   SIBPTR,SIBPTR                                       0528 00535000
         ICM   SIBPTR,7,TRMSIBPT-7(@09)                            0528 00536000
*   FOUNDSW=OFF;                    /* INITIALIZE LOOP SWITCH        */ 00537000
         NI    FOUNDSW,B'01111111'                                 0529 00538000
*/*                                                                  */ 00539000
*                                                                  0530 00540000
*   DO WHILE FOUNDSW=OFF;           /* CONTINUE UNTIL END OF SIB   0530 00541000
*                                      CHAIN OR MATCH FOUND          */ 00542000
         B     @DE00530                                            0530 00543000
@DL00530 DS    0H                                                  0531 00544000
*     IF SIBINDEX=SAVTSCPT THEN     /* SIB FOR SSCP FLOW -YES        */ 00545000
         L     @09,AVTSAVTP(,RAVT)                                 0531 00546000
         CLC   SIBINDEX(2,SIBPTR),SAVTSCPT(@09)                    0531 00547000
         BNE   @RF00531                                            0531 00548000
*       FOUNDSW=ON;                 /* INDICATE MATCH FOUND          */ 00549000
         OI    FOUNDSW,B'10000000'                                 0532 00550000
*     ELSE                                                         0533 00551000
*       SIBPTR=SIBCHAIN;            /* GET NEXT SIB IN CHAIN         */ 00552000
         B     @RC00531                                            0533 00553000
@RF00531 L     SIBPTR,SIBCHAIN(,SIBPTR)                            0533 00554000
*   END;                                                           0534 00555000
*                                                                  0534 00556000
@RC00531 DS    0H                                                  0534 00557000
@DE00530 TM    FOUNDSW,B'10000000'                                 0534 00558000
         BZ    @DL00530                                            0534 00559000
*/*                                                                  */ 00560000
*                                                                  0535 00561000
*   END FINDSIB;                                                   0535 00562000
@EL00007 DS    0H                                                  0535 00563000
@EF00007 DS    0H                                                  0535 00564000
@ER00007 BR    @14                                                 0535 00565000
*                                                                  0536 00566000
*   /*****************************************************************/ 00567000
*   /*                                                               */ 00568000
*   /* THIS ROUTINE SETS UP ALL THE FIELDS NECESSARY TO FREE A PIU   */ 00569000
*   /*                                                               */ 00570000
*   /*****************************************************************/ 00571000
*                                                                  0536 00572000
*FREEBUF:                                                          0536 00573000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0536 00574000
*                                                                  0536 00575000
FREEBUF  DS    0H                                                  0537 00576000
*/*                                                                  */ 00577000
*                                                                  0537 00578000
*   PRFNBUNT=0;                     /* CLEAR FIELD                   */ 00579000
         L     @10,PIUBFRP                                         0537 00580000
         MVI   PRFNBUNT(@10),X'00'                                 0537 00581000
*   PRFPRI=PRIBFRTB;                /* SET PRIORITY                  */ 00582000
         MVI   PRFPRI(@10),X'E0'                                   0538 00583000
*   PRFQCBA=ADDR(AVTBFRTB);         /* SET UP QCB ADDRESS            */ 00584000
         LA    @09,AVTBFRTB(,RAVT)                                 0539 00585000
         STCM  @09,7,PRFQCBA(@10)                                  0539 00586000
*   RPARM=PIUBFRP;                  /* PIU TO BE FREED               */ 00587000
         LR    RPARM,@10                                           0540 00588000
*/*                                                                  */ 00589000
*                                                                  0541 00590000
*   END FREEBUF;                                                   0541 00591000
@EL00008 DS    0H                                                  0541 00592000
@EF00008 DS    0H                                                  0541 00593000
@ER00008 BR    @14                                                 0541 00594000
*PIUCNVT:                                                          0542 00595000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0542 00596000
*                                                                  0542 00597000
PIUCNVT  DS    0H                                                  0543 00598000
*   /*****************************************************************/ 00599000
*   /*                                                               */ 00600000
*   /* THIS ROUTINE CALLS IEDXFMI TO GET THE RESPONSE PIUS CONVERTED */ 00601000
*   /* INTO BUFFERS                                                  */ 00602000
*   /*                                                               */ 00603000
*   /*****************************************************************/ 00604000
*                                                                  0543 00605000
*   SAVE2=RE;                       /* SAVE REG 14                   */ 00606000
         LR    SAVE2,RE                                            0543 00607000
*/*                                                                  */ 00608000
*                                                                  0544 00609000
*   RPARM=PIUBFRP;                  /* PIU TO BE CONVERTED           */ 00610000
         L     RPARM,PIUBFRP                                       0544 00611000
*   CALL IEDXFMI;                   /* CALL CONVERT ROUTINE SET UP TO   00612000
*                                      POST BUFFER TO THE SSCP       */ 00613000
         L     @09,AVTSAVTP(,RAVT)                                 0545 00614000
         L     @15,SAVTXFMI(,@09)                                  0545 00615000
         BALR  @14,@15                                             0545 00616000
*   PRFQCBA=ADDR(AVTOPCOB);         /* SET QCB ADDRESS TO OPCOB      */ 00617000
         L     @09,PIUBFRP                                         0546 00618000
         LA    @06,AVTOPCOB(,RAVT)                                 0546 00619000
         STCM  @06,7,PRFQCBA(@09)                                  0546 00620000
*   PRFPRI=PRIRESPB;                /* SET PRIORITY                  */ 00621000
         MVI   PRFPRI(@09),X'EA'                                   0547 00622000
*/*                                                                  */ 00623000
*                                                                  0548 00624000
*   RE=SAVE2;                       /* RESTORE REG 14                */ 00625000
         LR    RE,SAVE2                                            0548 00626000
*/*                                                                  */ 00627000
*                                                                  0549 00628000
*   END PIUCNVT;                                                   0549 00629000
@EL00009 DS    0H                                                  0549 00630000
@EF00009 DS    0H                                                  0549 00631000
@ER00009 BR    @14                                                 0549 00632000
*SDTRSP:                                                           0550 00633000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0550 00634000
*                                                                  0550 00635000
SDTRSP   DS    0H                                                  0551 00636000
*   /*****************************************************************/ 00637000
*   /*                                                               */ 00638000
*   /* THIS ROUTINE PROCESSES THE START DATA TRAFFIC RESPONSE. IT    */ 00639000
*   /* MAKES SURE THAT THE START DATA TRAFFIC COMMAND WAS SENT AND   */ 00640000
*   /* AND MAKES CHANGES ACCORDING TO THE RESPONSE. IF START DATA    */ 00641000
*   /* TRAFFIC WAS NOT SENT THE RESPONSE IS THROWN AWAY.             */ 00642000
*   /*                                                               */ 00643000
*   /*****************************************************************/ 00644000
*                                                                  0551 00645000
*   SAVE1=RE;                       /* SAVE REG 14                   */ 00646000
         ST    RE,SAVE1                                            0551 00647000
*/*                                                                  */ 00648000
*                                                                  0552 00649000
*   IF SIBDSTAT=SIBDAPND THEN       /* START DATA TRAFFIC SENT       */ 00650000
         TM    SIBDSTAT(SIBPTR),B'00000001'                        0552 00651000
         BNO   @RF00552                                            0552 00652000
         TM    SIBDSTAT(SIBPTR),B'00000010'                        0552 00653000
         BNZ   @RF00552                                            0552 00654000
*     DO;                                                          0553 00655000
*                                                                  0553 00656000
*/*                                                                  */ 00657000
*                                                                  0554 00658000
*       IF TRHSDI=OFF|SNSMAJ=SNSRQREJ&/* GOOD RESPONSE?              */ 00659000
*           SNSMIN=SNSACTV THEN                                    0554 00660000
         L     @09,PIUSTART                                        0554 00661000
         TM    TRHSDI+10(@09),B'00000100'                          0554 00662000
         BZ    @RT00554                                            0554 00663000
         L     @09,SNSPTR                                          0554 00664000
         CLI   SNSMAJ(@09),X'08'                                   0554 00665000
         BNE   @RF00554                                            0554 00666000
         CLI   SNSMIN(@09),X'15'                                   0554 00667000
         BNE   @RF00554                                            0554 00668000
@RT00554 DS    0H                                                  0555 00669000
*         SIBDSTAT=SIBDACTV;        /* SET DATA TRAFFIC ACTIVE       */ 00670000
         OI    SIBDSTAT(SIBPTR),B'00000011'                        0555 00671000
*       ELSE                        /* BAD RESPONSE                  */ 00672000
*         SIBDSTAT=SIBDRSET;        /* SET DATA TRAFFIC RESET        */ 00673000
         B     @RC00554                                            0556 00674000
@RF00554 NI    SIBDSTAT(SIBPTR),B'11111100'                        0556 00675000
*/*                                                                  */ 00676000
*                                                                  0557 00677000
*       CALL PIUCNVT;               /* PREPARE TO CONVERT PIU        */ 00678000
@RC00554 BAL   @14,PIUCNVT                                         0557 00679000
*     END;                                                         0558 00680000
*   ELSE                            /* START DATA TRAF NOT SENT      */ 00681000
*     CALL FREEBUF;                 /* FREE THE RESPONSE PIU         */ 00682000
         B     @RC00552                                            0559 00683000
@RF00552 BAL   @14,FREEBUF                                         0559 00684000
*/*                                                                  */ 00685000
*                                                                  0560 00686000
*   RE=SAVE1;                       /* RESTORE REG 14                */ 00687000
@RC00552 L     RE,SAVE1                                            0560 00688000
*   END SDTRSP;                                                    0561 00689000
@EL00010 DS    0H                                                  0561 00690000
@EF00010 DS    0H                                                  0561 00691000
@ER00010 BR    @14                                                 0561 00692000
*                                                                  0562 00693000
*   /*****************************************************************/ 00694000
*   /*                                                               */ 00695000
*   /* THIS ROUTINE SETS UP TO SEND THE EXECUTE TEST TO TOTE         */ 00696000
*   /*                                                               */ 00697000
*   /*****************************************************************/ 00698000
*                                                                  0562 00699000
*TOTERSP:                                                          0562 00700000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0562 00701000
*                                                                  0562 00702000
TOTERSP  DS    0H                                                  0563 00703000
*/*                                                                  */ 00704000
*                                                                  0563 00705000
*   SAVE1=RE;                       /* SAVE REG 14                   */ 00706000
         ST    RE,SAVE1                                            0563 00707000
*   RPARM=PIUBFRP;                  /* GET BUFFER ADDRESS            */ 00708000
         L     RPARM,PIUBFRP                                       0564 00709000
*   CALL IEDXFMI;                   /* CONVERT PIU TO BUFFER         */ 00710000
         L     @10,AVTSAVTP(,RAVT)                                 0565 00711000
         L     @15,SAVTXFMI(,@10)                                  0565 00712000
         BALR  @14,@15                                             0565 00713000
*   PRFPRI=PRIONLT;                 /* SET PRIORITY                  */ 00714000
         L     @10,PIUBFRP                                         0566 00715000
         MVI   PRFPRI(@10),X'DC'                                   0566 00716000
*   PRFQCBA=ADDR(AVTOLTQB);         /* SET UP QCB ADDRESS            */ 00717000
         LA    @09,AVTOLTQB(,RAVT)                                 0567 00718000
         STCM  @09,7,PRFQCBA(@10)                                  0567 00719000
*   PRFKEY='24'X;                   /* KEY FOR TOTE                  */ 00720000
         MVI   PRFKEY(@10),X'24'                                   0568 00721000
*/*                                                                  */ 00722000
*                                                                  0569 00723000
*   RE=SAVE1;                       /* RESTORE REG 14                */ 00724000
         L     RE,SAVE1                                            0569 00725000
*   END TOTERSP;                                                   0570 00726000
@EL00011 DS    0H                                                  0570 00727000
@EF00011 DS    0H                                                  0570 00728000
@ER00011 BR    @14                                                 0570 00729000
*   END IEDSCPRP                                                   0571 00730000
*                                                                  0571 00731000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00732000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00733000
*/*%INCLUDE SYSLIB  (TCD1D   )                                       */ 00734000
*/*%INCLUDE SYSLIB  (TDISPD  )                                       */ 00735000
*/*%INCLUDE SYSLIB  (TPIUD   )                                       */ 00736000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 00737000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 00738000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 00739000
*/*%INCLUDE SYSLIB  (TSIBD   )                                       */ 00740000
*/*%INCLUDE SYSLIB  (TSNSD   )                                       */ 00741000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 00742000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00743000
*                                                                  0571 00744000
*       ;                                                          0571 00745000
@DATA    DS    0H                                                       00746000
         DS    0F                                                       00747000
         DS    0F                                                       00748000
@CF00255 DC    F'4'                                                     00749000
@CF01505 DC    F'14'                                                    00750000
@CF01515 DC    F'-12'                                                   00751000
@CF01507 DC    F'-11'                                                   00752000
@CF01524 DC    F'-7'                                                    00753000
         DS    0D                                                       00754000
SNSPTR   DS    A                                                        00755000
PIUSTART DS    A                                                        00756000
PIUBFRP  DS    A                                                        00757000
SAVE1    DS    A                                                        00758000
PREVIOUS DS    A                                                        00759000
CMDADDR  DS    A                                                        00760000
@CB00763 DC    X'010301'                                                00761000
@CB01511 DC    B'000000000000000000000000100000000000000000000000000000C00762000
               00'                                                      00763000
@CB01520 DC    B'111111111111111111111111011111111111111111111111111111C00764000
               11'                                                      00765000
FOUNDSW  DS    BL1                                                      00766000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00767000
@01      EQU   01                                                       00768000
@02      EQU   02                                                       00769000
@03      EQU   03                                                       00770000
@04      EQU   04                                                       00771000
@05      EQU   05                                                       00772000
@06      EQU   06                                                       00773000
@07      EQU   07                                                       00774000
@08      EQU   08                                                       00775000
@09      EQU   09                                                       00776000
@10      EQU   10                                                       00777000
@11      EQU   11                                                       00778000
@12      EQU   12                                                       00779000
@13      EQU   13                                                       00780000
@14      EQU   14                                                       00781000
@15      EQU   15                                                       00782000
CURRENT  EQU   @10                                                      00783000
SAVE2    EQU   @10                                                      00784000
SIBPTR   EQU   @10                                                      00785000
IEDQAPTR EQU   @13                                                      00786000
RDISP    EQU   @11                                                      00787000
IEDQTPTR EQU   @08                                                      00788000
RAVT     EQU   @13                                                      00789000
RTRM     EQU   @08                                                      00790000
RZERO    EQU   @00                                                      00791000
RPARM    EQU   @01                                                      00792000
RSTCB    EQU   @03                                                      00793000
RQCB     EQU   @07                                                      00794000
IEDQQPTR EQU   @07                                                      00795000
RBASE    EQU   @12                                                      00796000
RE       EQU   @14                                                      00797000
RF       EQU   @15                                                      00798000
IEDQAVTD EQU   0                                                        00799000
AVTSAVEX EQU   IEDQAVTD+216                                             00800000
AVTREADD EQU   IEDQAVTD+308                                             00801000
AVTBUFSW EQU   IEDQAVTD+312                                             00802000
@NM00004 EQU   IEDQAVTD+316                                             00803000
AVTCKFLG EQU   @NM00004                                                 00804000
AVTBASE  EQU   IEDQAVTD+340                                             00805000
AVTPKF   EQU   AVTBASE                                                  00806000
AVTRNMPT EQU   IEDQAVTD+352                                             00807000
AVTOSECB EQU   IEDQAVTD+420                                             00808000
AVTECB1  EQU   AVTOSECB                                                 00809000
AVTHG02  EQU   IEDQAVTD+456                                             00810000
AVTDISP  EQU   IEDQAVTD+480                                             00811000
AVTHD    EQU   IEDQAVTD+484                                             00812000
AVTSCOPT EQU   AVTHD                                                    00813000
AVTSAVTP EQU   IEDQAVTD+540                                             00814000
AVTSAVTF EQU   AVTSAVTP                                                 00815000
AVTCKPEL EQU   IEDQAVTD+580                                             00816000
AVTCKRMV EQU   AVTCKPEL                                                 00817000
AVTCKELF EQU   IEDQAVTD+608                                             00818000
AVTCKBYT EQU   IEDQAVTD+619                                             00819000
AVTHG01  EQU   IEDQAVTD+620                                             00820000
AVTCKLNK EQU   IEDQAVTD+624                                             00821000
AVTCRELE EQU   IEDQAVTD+636                                             00822000
AVTCCELE EQU   AVTCRELE                                                 00823000
AVTCLRHI EQU   IEDQAVTD+644                                             00824000
AVTADBUF EQU   IEDQAVTD+648                                             00825000
AVTSYSER EQU   IEDQAVTD+656                                             00826000
AVTBFRFG EQU   IEDQAVTD+712                                             00827000
AVTBFRTB EQU   IEDQAVTD+720                                             00828000
AVTCKPQB EQU   IEDQAVTD+732                                             00829000
AVTCKPTB EQU   AVTCKPQB                                                 00830000
AVTCKPEC EQU   AVTCKPQB+4                                               00831000
AVTCKPCC EQU   AVTCKPEC                                                 00832000
AVTOPCQB EQU   IEDQAVTD+744                                             00833000
AVTOPCOB EQU   AVTOPCQB                                                 00834000
AVTOPCEC EQU   AVTOPCQB+4                                               00835000
AVTOPCCC EQU   AVTOPCEC                                                 00836000
AVTOLTQB EQU   IEDQAVTD+756                                             00837000
AVTCWFL1 EQU   IEDQAVTD+852                                             00838000
AVTCWFL2 EQU   IEDQAVTD+853                                             00839000
AVTSUBT  EQU   IEDQAVTD+876                                             00840000
AVTIOTR  EQU   IEDQAVTD+877                                             00841000
AVTBIT1  EQU   IEDQAVTD+978                                             00842000
AVTBIT2  EQU   IEDQAVTD+979                                             00843000
AVTBIT3  EQU   IEDQAVTD+980                                             00844000
AVTBIT4  EQU   IEDQAVTD+1064                                            00845000
@NM00086 EQU   IEDQAVTD+1160                                            00846000
IEDNSVTD EQU   0                                                        00847000
SAVTDIAG EQU   IEDNSVTD                                                 00848000
SAVTDIAF EQU   SAVTDIAG                                                 00849000
SAVTLUSQ EQU   IEDNSVTD+88                                              00850000
SAVTSSSR EQU   IEDNSVTD+112                                             00851000
SAVTXFMI EQU   IEDNSVTD+132                                             00852000
SAVTTCPU EQU   IEDNSVTD+238                                             00853000
SAVTSCPT EQU   SAVTTCPU                                                 00854000
SAVTZELM EQU   IEDNSVTD+270                                             00855000
SAVTRDRV EQU   IEDNSVTD+284                                             00856000
SAVTCKQB EQU   IEDNSVTD+300                                             00857000
SAVTCKTB EQU   SAVTCKQB                                                 00858000
SAVTCKEC EQU   SAVTCKQB+4                                               00859000
SAVTCKCC EQU   SAVTCKEC                                                 00860000
IEDQDISP EQU   0                                                        00861000
DSPPOST  EQU   24                                                       00862000
DSPPOSTR EQU   28                                                       00863000
IEDPIU   EQU   0                                                        00864000
PIUTH    EQU   IEDPIU                                                   00865000
PIURH    EQU   IEDPIU+10                                                00866000
PIURU    EQU   IEDPIU+13                                                00867000
IEDQPRF  EQU   0                                                        00868000
PRFRCB   EQU   IEDQPRF                                                  00869000
PRFKEY   EQU   PRFRCB                                                   00870000
PRFQCBA  EQU   PRFRCB+1                                                 00871000
PRFPRI   EQU   PRFRCB+4                                                 00872000
PRFLINK  EQU   PRFRCB+5                                                 00873000
PRFTIC   EQU   IEDQPRF+8                                                00874000
PRFTICC  EQU   PRFTIC                                                   00875000
PRFNBUNT EQU   IEDQPRF+12                                               00876000
PRFSUNIT EQU   PRFNBUNT                                                 00877000
PRFPLQCB EQU   PRFSUNIT                                                 00878000
PRFPIUO  EQU   PRFPLQCB                                                 00879000
@NM00112 EQU   IEDQPRF+16                                               00880000
PRFSVFFO EQU   @NM00112                                                 00881000
PRFSTAT1 EQU   IEDQPRF+20                                               00882000
PRFEOFN  EQU   PRFSTAT1                                                 00883000
PRFCORE  EQU   IEDQPRF+21                                               00884000
PRFXTRA  EQU   PRFCORE                                                  00885000
PRFSCAN  EQU   IEDQPRF+24                                               00886000
PRFTQBCK EQU   IEDQPRF+26                                               00887000
PRFNTXT  EQU   PRFTQBCK                                                 00888000
PRFEOBOF EQU   PRFNTXT                                                  00889000
PRFCHDR  EQU   IEDQPRF+32                                               00890000
PRFHQBCK EQU   IEDQPRF+35                                               00891000
PRFDEST  EQU   IEDQPRF+40                                               00892000
IEDPF1   EQU   0                                                        00893000
PRF1FLG1 EQU   IEDPF1+3                                                 00894000
PRF1WD2  EQU   IEDPF1+4                                                 00895000
PRF1SEQP EQU   PRF1WD2                                                  00896000
PRF1SQID EQU   PRF1SEQP                                                 00897000
PRF1TAG1 EQU   PRF1SQID                                                 00898000
IEDPF2   EQU   0                                                        00899000
PRF2FLG2 EQU   IEDPF2                                                   00900000
PRF2WD2  EQU   IEDPF2+4                                                 00901000
IEDRH    EQU   0                                                        00902000
TRHBYTE0 EQU   IEDRH                                                    00903000
TRHSDI   EQU   TRHBYTE0                                                 00904000
TRHBYTE1 EQU   IEDRH+1                                                  00905000
TRHBYTE2 EQU   IEDRH+2                                                  00906000
IEDSIBD  EQU   0                                                        00907000
SIBCHAIN EQU   IEDSIBD+4                                                00908000
SIBINDEX EQU   IEDSIBD+8                                                00909000
SIBSESSN EQU   IEDSIBD+10                                               00910000
SIBSSTAT EQU   SIBSESSN                                                 00911000
SIBDSTAT EQU   SIBSESSN                                                 00912000
SIBPACIN EQU   IEDSIBD+11                                               00913000
SIBSEQN  EQU   IEDSIBD+12                                               00914000
SIBSTAT1 EQU   IEDSIBD+16                                               00915000
SIBSTAT2 EQU   IEDSIBD+17                                               00916000
SIBTSPRO EQU   IEDSIBD+18                                               00917000
SIBBIND  EQU   IEDSIBD+20                                               00918000
SIBBIND1 EQU   SIBBIND                                                  00919000
SIBBIND2 EQU   SIBBIND+1                                                00920000
SIBBIND3 EQU   SIBBIND+2                                                00921000
SIBSTAT0 EQU   IEDSIBD+23                                               00922000
IEDSNSD  EQU   0                                                        00923000
SNSSYSTM EQU   IEDSNSD                                                  00924000
SNSMAJ   EQU   SNSSYSTM                                                 00925000
SNSMIN   EQU   SNSSYSTM+1                                               00926000
SNSUSER  EQU   IEDSNSD+2                                                00927000
IEDTH    EQU   0                                                        00928000
TTHBYTE0 EQU   IEDTH                                                    00929000
TTHOAF   EQU   IEDTH+4                                                  00930000
TTHSNF   EQU   IEDTH+6                                                  00931000
TTHTAG   EQU   TTHSNF                                                   00932000
TTHTAG1  EQU   TTHTAG                                                   00933000
IEDQTRM  EQU   0                                                        00934000
TRMSTATE EQU   IEDQTRM                                                  00935000
TRMLOG   EQU   TRMSTATE                                                 00936000
TRMINSEQ EQU   IEDQTRM+4                                                00937000
TLISTCNT EQU   TRMINSEQ                                                 00938000
TRMOUTSQ EQU   IEDQTRM+6                                                00939000
TLISTEN  EQU   TRMOUTSQ                                                 00940000
TRMDSORG EQU   TLISTEN                                                  00941000
TRMALTD  EQU   IEDQTRM+8                                                00942000
TRMDEVFL EQU   IEDQTRM+10                                               00943000
TRMSTAT  EQU   IEDQTRM+12                                               00944000
IEDNTRM  EQU   0                                                        00945000
TRMBYTE4 EQU   IEDNTRM                                                  00946000
TRMBYTE3 EQU   IEDNTRM+1                                                00947000
TRMBYTE2 EQU   IEDNTRM+2                                                00948000
TRMRSACT EQU   TRMBYTE2                                                 00949000
TRMINPG  EQU   TRMBYTE2                                                 00950000
TRMBYTE1 EQU   IEDNTRM+3                                                00951000
TRMSCPRQ EQU   TRMBYTE1                                                 00952000
TRMBYTE0 EQU   IEDNTRM+6                                                00953000
TRMSIBPT EQU   IEDNTRM+7                                                00954000
TRMTYPE  EQU   IEDNTRM+11                                               00955000
IEDQTNT  EQU   0                                                        00956000
IEDXFMI  EQU   0                                                        00957000
CMDBYTE  EQU   0                                                        00958000
CMD3BYTE EQU   0                                                        00959000
DSPBYPAS EQU   20                                                       00960000
DSPCHAIN EQU   12                                                       00961000
DSPDISP  EQU   4                                                        00962000
DSPLIFO  EQU   56                                                       00963000
DSPLIFOR EQU   60                                                       00964000
DSPLIST  EQU   8                                                        00965000
DSPPRIO  EQU   48                                                       00966000
DSPPRIOR EQU   52                                                       00967000
DSPTRACE EQU   64                                                       00968000
DSPTSTQ  EQU   32                                                       00969000
DSPTSTQR EQU   36                                                       00970000
DSPUNAV  EQU   40                                                       00971000
DSPUNAVR EQU   44                                                       00972000
DSPWAIT  EQU   16                                                       00973000
IEDQPPTR EQU   PIUBFRP                                                  00974000
TRMPRE1  EQU   TRMBYTE4                                                 00975000
TRMNCP1  EQU   TRMBYTE4                                                 00976000
TRMPRE   EQU   TRMBYTE3                                                 00977000
TRMNCP   EQU   TRMBYTE3                                                 00978000
TRMPU    EQU   TRMBYTE3                                                 00979000
TRMLU    EQU   TRMBYTE3                                                 00980000
TRMLINK  EQU   TRMBYTE3                                                 00981000
IEDQSIBP EQU   SIBPTR                                                   00982000
PRFSHDR  EQU   IEDQPRF+42                                               00983000
TRMOPT   EQU   IEDQTRM+20                                               00984000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00985000
@NM00136 EQU   TRMLINK                                                  00986000
TRMLSTAT EQU   TRMLINK                                                  00987000
TRMLINT  EQU   TRMLINK                                                  00988000
TRMEPMOD EQU   TRMLINK                                                  00989000
TRMLULOG EQU   TRMLU                                                    00990000
TRMINERR EQU   TRMLU                                                    00991000
TRMLUREQ EQU   TRMLU                                                    00992000
TRMSESRQ EQU   TRMLU                                                    00993000
TRMTDIFF EQU   TRMLU                                                    00994000
TRMLUTM  EQU   TRMLU                                                    00995000
TRMLUIT  EQU   TRMLU                                                    00996000
TRMAUTO  EQU   TRMLU                                                    00997000
TRMPCONT EQU   TRMPU                                                    00998000
@NM00135 EQU   TRMPU                                                    00999000
TRMNCONT EQU   TRMNCP                                                   01000000
TRMQUCKN EQU   TRMNCP                                                   01001000
TRMSLOWN EQU   TRMNCP                                                   01002000
TRMSYGEN EQU   TRMNCP                                                   01003000
TRMNCPCL EQU   TRMNCP                                                   01004000
TRMIPLDM EQU   TRMNCP                                                   01005000
TRMINOUT EQU   TRMPRE                                                   01006000
TRMRDOUT EQU   TRMPRE                                                   01007000
TRMNLOUT EQU   TRMPRE                                                   01008000
TRMWROUT EQU   TRMPRE                                                   01009000
TRMASNXI EQU   TRMPRE                                                   01010000
TRMSTMM  EQU   TRMPRE                                                   01011000
TRMCMODE EQU   TRMPRE                                                   01012000
TRMSTPND EQU   TRMPRE                                                   01013000
@NM00134 EQU   TRMNCP1                                                  01014000
TRMINOP  EQU   TRMNCP1                                                  01015000
TRMLYNCH EQU   TRMPRE1                                                  01016000
TRMSPOUT EQU   TRMPRE1                                                  01017000
TRMERLCK EQU   TRMPRE1                                                  01018000
TRMQNPL  EQU   TRMPRE1                                                  01019000
TRMSPACT EQU   TRMPRE1                                                  01020000
TRMOCNI  EQU   TRMPRE1                                                  01021000
TRMSESSN EQU   TRMPRE1                                                  01022000
TRMCONT  EQU   TRMPRE1                                                  01023000
TRMSUBST EQU   IEDNTRM+12                                               01024000
TRMRLMCT EQU   IEDNTRM+10                                               01025000
TRMCOHTG EQU   TRMSIBPT+1                                               01026000
TRMGPCNT EQU   TRMSIBPT                                                 01027000
TRMBUFRD EQU   TRMBYTE0                                                 01028000
TRMSNA   EQU   TRMBYTE0                                                 01029000
TRMGP    EQU   TRMBYTE0                                                 01030000
TRMDIAL  EQU   TRMBYTE0                                                 01031000
@NM00133 EQU   TRMBYTE0                                                 01032000
TRMOUTPT EQU   TRMBYTE0                                                 01033000
TRMINPUT EQU   TRMBYTE0                                                 01034000
TRMUDEF  EQU   TRMBYTE0                                                 01035000
TRMCOHRT EQU   IEDNTRM+4                                                01036000
TRMSTOTE EQU   TRMBYTE1                                                 01037000
TRMCKPRN EQU   TRMBYTE1                                                 01038000
TRMTSATN EQU   TRMBYTE1                                                 01039000
TRMTRACE EQU   TRMBYTE1                                                 01040000
TRMSWBCK EQU   TRMBYTE1                                                 01041000
TRMAUTOC EQU   TRMBYTE1                                                 01042000
TRMINPTP EQU   TRMBYTE1                                                 01043000
TRMWTNEG EQU   TRMSCPRQ                                                 01044000
TRMWRBRK EQU   TRMBYTE2                                                 01045000
TRMNOSND EQU   TRMBYTE2                                                 01046000
TRMPREP  EQU   TRMBYTE2                                                 01047000
TRMGPACT EQU   TRMBYTE2                                                 01048000
TRMANDL  EQU   TRMBYTE2                                                 01049000
TRMCLOSN EQU   TRMINPG                                                  01050000
TRMREMB  EQU   TRMBYTE2                                                 01051000
TRMOPTBL EQU   IEDQTRM+18                                               01052000
TRMOPNO  EQU   IEDQTRM+17                                               01053000
TRMCHCIN EQU   IEDQTRM+16                                               01054000
TRMSENSE EQU   TRMSTAT+3                                                01055000
TRMTEMPR EQU   TRMSTAT+2                                                01056000
TRMSIO   EQU   TRMSTAT                                                  01057000
@NM00132 EQU   TRMDEVFL+1                                               01058000
TRMTPIN  EQU   TRMDEVFL+1                                               01059000
TRMNCPI  EQU   TRMDEVFL+1                                               01060000
TRMRNTRM EQU   TRMDEVFL+1                                               01061000
@NM00131 EQU   TRMDEVFL+1                                               01062000
TRMLMD   EQU   TRMDEVFL+1                                               01063000
TRMCONC  EQU   TRMDEVFL+1                                               01064000
TRMTSOB  EQU   TRMDEVFL                                                 01065000
TRMBFDY  EQU   TRMDEVFL                                                 01066000
TRMTBLK  EQU   TRMDEVFL                                                 01067000
TRMSBLK  EQU   TRMDEVFL                                                 01068000
TRMBLKS  EQU   TRMDEVFL                                                 01069000
TRMADDC  EQU   TRMDEVFL                                                 01070000
TRMDDIG  EQU   TRMDEVFL                                                 01071000
TRMBUFS  EQU   TRMDEVFL                                                 01072000
TRMPRILK EQU   TRMALTD                                                  01073000
TRMLGB   EQU   TRMDSORG                                                 01074000
TRMUTERM EQU   TLISTCNT                                                 01075000
TRMDESTQ EQU   IEDQTRM+1                                                01076000
TRMSCNYN EQU   TRMSTATE                                                 01077000
TRMOPTFN EQU   TRMSTATE                                                 01078000
TRMHELDN EQU   TRMSTATE                                                 01079000
TRMACPTN EQU   TRMSTATE                                                 01080000
TRMPREF  EQU   TRMSTATE                                                 01081000
TRMPROC  EQU   TRMLOG                                                   01082000
TRMLIST  EQU   TRMLOG                                                   01083000
TRMLINE  EQU   TRMSTATE                                                 01084000
TTHDCF   EQU   IEDTH+8                                                  01085000
TTHTAG2  EQU   TTHTAG+1                                                 01086000
@NM00130 EQU   TTHTAG1                                                  01087000
TTHTAGS  EQU   TTHTAG1                                                  01088000
TTHDAF   EQU   IEDTH+2                                                  01089000
TTHBYTE1 EQU   IEDTH+1                                                  01090000
TTHEFI   EQU   TTHBYTE0                                                 01091000
@NM00129 EQU   TTHBYTE0                                                 01092000
TTHEBIU  EQU   TTHBYTE0                                                 01093000
TTHBBIU  EQU   TTHBYTE0                                                 01094000
TTHFTYPE EQU   TTHBYTE0                                                 01095000
SNSUSR2  EQU   SNSUSER+1                                                01096000
SNSUSR1  EQU   SNSUSER                                                  01097000
SIBLUTYP EQU   SIBSTAT0                                                 01098000
SIBCD    EQU   SIBSTAT0                                                 01099000
@NM00128 EQU   SIBBIND3                                                 01100000
SIBCRES  EQU   SIBBIND3                                                 01101000
SIBSPKR  EQU   SIBBIND3                                                 01102000
SIBRECOV EQU   SIBBIND3                                                 01103000
SIBFMODE EQU   SIBBIND3                                                 01104000
SIBALT   EQU   SIBBIND2                                                 01105000
SIBBTERM EQU   SIBBIND2                                                 01106000
SIBBRACK EQU   SIBBIND2                                                 01107000
SIBFMUSE EQU   SIBBIND2                                                 01108000
SIBSEBI  EQU   SIBBIND2                                                 01109000
SIBSCMP  EQU   SIBBIND2                                                 01110000
SIBSEXC  EQU   SIBBIND2                                                 01111000
SIBSDEF  EQU   SIBBIND2                                                 01112000
SIBSRQM  EQU   SIBBIND1                                                 01113000
SIBSCHNG EQU   SIBBIND1                                                 01114000
SIBPEBI  EQU   SIBBIND1                                                 01115000
SIBPCMP  EQU   SIBBIND1                                                 01116000
SIBPEXC  EQU   SIBBIND1                                                 01117000
SIBPDEF  EQU   SIBBIND1                                                 01118000
SIBPRQM  EQU   SIBBIND1                                                 01119000
SIBPCHN  EQU   SIBBIND1                                                 01120000
SIBFMPRO EQU   IEDSIBD+19                                               01121000
@NM00127 EQU   SIBSTAT2                                                 01122000
SIBDACLU EQU   SIBSTAT2                                                 01123000
SIBRDSCN EQU   SIBSTAT2                                                 01124000
SIBTERM  EQU   SIBSTAT2                                                 01125000
SIBUSS   EQU   SIBSTAT2                                                 01126000
SIBBSTAT EQU   SIBSTAT1                                                 01127000
SIBRTRP  EQU   SIBSTAT1                                                 01128000
SIBFTERM EQU   SIBSTAT1                                                 01129000
SIBRQEND EQU   SIBSTAT1                                                 01130000
SIBRQSHT EQU   SIBSTAT1                                                 01131000
SIBSEQO  EQU   SIBSEQN+2                                                01132000
SIBSEQI  EQU   SIBSEQN                                                  01133000
SIBNCNT  EQU   SIBPACIN                                                 01134000
SIBMCNT  EQU   SIBPACIN                                                 01135000
SIBINBIU EQU   SIBSESSN                                                 01136000
SIBSHUTC EQU   SIBSESSN                                                 01137000
SIBLGOFF EQU   SIBSESSN                                                 01138000
SIBRUSEG EQU   IEDSIBD                                                  01139000
@NM00126 EQU   TRHBYTE2                                                 01140000
@NM00125 EQU   TRHBYTE2                                                 01141000
@NM00124 EQU   TRHBYTE2                                                 01142000
TRHCSI   EQU   TRHBYTE2                                                 01143000
@NM00123 EQU   TRHBYTE2                                                 01144000
TRHCDI   EQU   TRHBYTE2                                                 01145000
TRHEB    EQU   TRHBYTE2                                                 01146000
TRHBB    EQU   TRHBYTE2                                                 01147000
TRHPI    EQU   TRHBYTE1                                                 01148000
@NM00122 EQU   TRHBYTE1                                                 01149000
@NM00121 EQU   TRHBYTE1                                                 01150000
@NM00120 EQU   TRHBYTE1                                                 01151000
TRHER    EQU   TRHBYTE1                                                 01152000
TRHDR2   EQU   TRHBYTE1                                                 01153000
@NM00119 EQU   TRHBYTE1                                                 01154000
TRHDR1   EQU   TRHBYTE1                                                 01155000
TRHEC    EQU   TRHBYTE0                                                 01156000
TRHBC    EQU   TRHBYTE0                                                 01157000
TRHFI    EQU   TRHBYTE0                                                 01158000
@NM00118 EQU   TRHBYTE0                                                 01159000
TRHRUCAT EQU   TRHBYTE0                                                 01160000
TRHTYPE  EQU   TRHBYTE0                                                 01161000
PRF2SEQP EQU   PRF2WD2                                                  01162000
@NM00117 EQU   IEDPF2+1                                                 01163000
@NM00116 EQU   PRF2FLG2                                                 01164000
PRF2TERM EQU   PRF2FLG2                                                 01165000
PRF2SMI  EQU   PRF2FLG2                                                 01166000
PRF2FORM EQU   PRF2FLG2                                                 01167000
PRF2TNTI EQU   PRF2FLG2                                                 01168000
PRF1RULN EQU   PRF1SEQP+2                                               01169000
PRF1TAG2 EQU   PRF1SQID+1                                               01170000
@NM00115 EQU   PRF1TAG1                                                 01171000
PRF1TAGS EQU   PRF1TAG1                                                 01172000
@NM00114 EQU   PRF1FLG1                                                 01173000
PRF1LOGD EQU   PRF1FLG1                                                 01174000
PRF1USS  EQU   PRF1FLG1                                                 01175000
PRF1FORM EQU   PRF1FLG1                                                 01176000
PRF1EXPI EQU   PRF1FLG1                                                 01177000
PRF1FIDI EQU   PRF1FLG1                                                 01178000
PRF1RH   EQU   IEDPF1                                                   01179000
PRFISEQ  EQU   IEDQPRF+38                                               01180000
PRFSTXT  EQU   PRFHQBCK                                                 01181000
PRFNHDR  EQU   PRFCHDR                                                  01182000
PRFCRCD  EQU   IEDQPRF+29                                               01183000
PRFSVSEQ EQU   PRFNTXT+1                                                01184000
PRFSVPRI EQU   PRFEOBOF                                                 01185000
PRFISIZE EQU   PRFSCAN+1                                                01186000
@NM00113 EQU   PRFSCAN                                                  01187000
PRFEOB   EQU   PRFXTRA+1                                                01188000
PRFSTSO  EQU   PRFXTRA                                                  01189000
PRFNHDRN EQU   PRFSTAT1                                                 01190000
PRFNLSTN EQU   PRFSTAT1                                                 01191000
PRFLOCK  EQU   PRFEOFN                                                  01192000
PRFDUPLN EQU   PRFSTAT1                                                 01193000
PRFTSMSG EQU   PRFSTAT1                                                 01194000
PRFITCPN EQU   PRFSTAT1                                                 01195000
PRFERMGN EQU   PRFSTAT1                                                 01196000
PRFCNCLN EQU   PRFSTAT1                                                 01197000
PRFSVFLG EQU   @NM00112+3                                               01198000
PRFSIZE  EQU   PRFSVFFO+2                                               01199000
PRFSRCE  EQU   PRFSVFFO                                                 01200000
PRFLCB   EQU   IEDQPRF+13                                               01201000
PRFTI0   EQU   PRFTIC+1                                                 01202000
@NM00111 EQU   PRFTICC                                                  01203000
@NM00110 EQU   PRFTICC                                                  01204000
@NM00109 EQU   PRFTICC                                                  01205000
PRFTICON EQU   PRFTICC                                                  01206000
@NM00108 EQU   PRFTICC                                                  01207000
@NM00107 EQU   PRFTICC                                                  01208000
PRFBFMM  EQU   PRFTICC                                                  01209000
PRFEOMSG EQU   PRFTICC                                                  01210000
PRFCOUNT EQU   PRFLINK+1                                                01211000
@NM00106 EQU   PRFLINK                                                  01212000
PRFFLAGS EQU   PRFPRI                                                   01213000
PRFIOADR EQU   PRFQCBA                                                  01214000
PRFOPCDE EQU   PRFKEY                                                   01215000
SAVTLLCB EQU   IEDNSVTD+316                                             01216000
SAVTBITN EQU   IEDNSVTD+312                                             01217000
@NM00105 EQU   SAVTCKQB+8                                               01218000
@NM00104 EQU   SAVTCKEC+1                                               01219000
@NM00103 EQU   SAVTCKCC                                                 01220000
SAVTCKPO EQU   SAVTCKCC                                                 01221000
SAVTCKWA EQU   SAVTCKCC                                                 01222000
SAVTCKCH EQU   SAVTCKTB+1                                               01223000
SAVTCKVT EQU   SAVTCKTB                                                 01224000
@NM00102 EQU   IEDNSVTD+297                                             01225000
SAVTRDFG EQU   SAVTRDRV+12                                              01226000
@NM00101 EQU   SAVTRDRV+5                                               01227000
SAVTRDPY EQU   SAVTRDRV+4                                               01228000
SAVTRDQB EQU   SAVTRDRV+1                                               01229000
SAVTRDKY EQU   SAVTRDRV                                                 01230000
SAVTNID  EQU   IEDNSVTD+280                                             01231000
SAVTDVAS EQU   IEDNSVTD+276                                             01232000
SAVTPLSZ EQU   IEDNSVTD+274                                             01233000
@NM00100 EQU   IEDNSVTD+273                                             01234000
SAVTSUBL EQU   IEDNSVTD+272                                             01235000
@NM00099 EQU   SAVTZELM+1                                               01236000
SAVTSUBM EQU   SAVTZELM                                                 01237000
SAVTMHDX EQU   IEDNSVTD+268                                             01238000
SAVTNAT1 EQU   IEDNSVTD+266                                             01239000
SAVTSH20 EQU   IEDNSVTD+264                                             01240000
SAVTLCBS EQU   IEDNSVTD+260                                             01241000
SAVTRNMP EQU   IEDNSVTD+256                                             01242000
SAVTTNTX EQU   IEDNSVTD+252                                             01243000
SAVTNAX  EQU   IEDNSVTD+248                                             01244000
SAVTSUBV EQU   IEDNSVTD+247                                             01245000
SAVTSUBA EQU   IEDNSVTD+246                                             01246000
SAVTSIBC EQU   IEDNSVTD+244                                             01247000
SAVTBSM  EQU   IEDNSVTD+240                                             01248000
SAVTRQTG EQU   IEDNSVTD+236                                             01249000
SAVTRQCH EQU   IEDNSVTD+232                                             01250000
SAVTMAND EQU   IEDNSVTD+228                                             01251000
SAVTSPLN EQU   IEDNSVTD+224                                             01252000
SAVTNADL EQU   IEDNSVTD+222                                             01253000
SAVTNATL EQU   IEDNSVTD+220                                             01254000
SAVTMHTB EQU   IEDNSVTD+216                                             01255000
SAVTSSMH EQU   IEDNSVTD+212                                             01256000
SAVTQRS  EQU   IEDNSVTD+208                                             01257000
SAVTRQIN EQU   IEDNSVTD+204                                             01258000
SAVTDFCO EQU   IEDNSVTD+200                                             01259000
SAVTSAO  EQU   IEDNSVTD+196                                             01260000
SAVTSARI EQU   IEDNSVTD+192                                             01261000
SAVTSAC  EQU   IEDNSVTD+188                                             01262000
SAVTSAI  EQU   IEDNSVTD+184                                             01263000
SAVTCSCI EQU   IEDNSVTD+180                                             01264000
SAVTSSRP EQU   IEDNSVTD+176                                             01265000
SAVTSSRQ EQU   IEDNSVTD+172                                             01266000
SAVTSCLU EQU   IEDNSVTD+168                                             01267000
SAVTXTRQ EQU   IEDNSVTD+164                                             01268000
SAVTMVBF EQU   IEDNSVTD+160                                             01269000
@NM00098 EQU   IEDNSVTD+148                                             01270000
SAVTIPCQ EQU   IEDNSVTD+144                                             01271000
@NM00097 EQU   IEDNSVTD+136                                             01272000
@NM00096 EQU   IEDNSVTD+124                                             01273000
SAVTXFMO EQU   IEDNSVTD+120                                             01274000
@NM00095 EQU   IEDNSVTD+116                                             01275000
SAVTSCPQ EQU   IEDNSVTD+108                                             01276000
SAVTSLCB EQU   IEDNSVTD+104                                             01277000
SAVTLUSR EQU   IEDNSVTD+100                                             01278000
@NM00094 EQU   SAVTLUSQ+8                                               01279000
SAVTLUSP EQU   SAVTLUSQ+4                                               01280000
SAVTLUSB EQU   SAVTLUSQ                                                 01281000
@NM00093 EQU   IEDNSVTD+84                                              01282000
SAVTSAT  EQU   IEDNSVTD+80                                              01283000
SAVTNAT  EQU   IEDNSVTD+76                                              01284000
SAVTCLUP EQU   IEDNSVTD+72                                              01285000
SAVTPIUT EQU   IEDNSVTD+68                                              01286000
SAVTRNTA EQU   IEDNSVTD+64                                              01287000
SAVTDNIR EQU   IEDNSVTD+60                                              01288000
SAVTCNIR EQU   IEDNSVTD+56                                              01289000
SAVTFLDH EQU   IEDNSVTD+52                                              01290000
SAVTSRTN EQU   IEDNSVTD+48                                              01291000
SAVTSREQ EQU   IEDNSVTD+44                                              01292000
SAVTFAIL EQU   IEDNSVTD+42                                              01293000
SAVTSUSE EQU   IEDNSVTD+40                                              01294000
SAVTSIB  EQU   IEDNSVTD+36                                              01295000
SAVTPRTN EQU   IEDNSVTD+32                                              01296000
@NM00092 EQU   IEDNSVTD+28                                              01297000
SAVTWH20 EQU   IEDNSVTD+26                                              01298000
SAVTPWT  EQU   IEDNSVTD+24                                              01299000
SAVTPRTQ EQU   IEDNSVTD+20                                              01300000
SAVTPREQ EQU   IEDNSVTD+16                                              01301000
SAVTPH20 EQU   IEDNSVTD+14                                              01302000
SAVTPUSE EQU   IEDNSVTD+12                                              01303000
SAVTPLCB EQU   IEDNSVTD+8                                               01304000
SAVTPOOL EQU   IEDNSVTD+4                                               01305000
SAVTPRMT EQU   SAVTDIAF                                                 01306000
SAVTVIRT EQU   SAVTDIAF                                                 01307000
AVTCPBNO EQU   IEDQAVTD+1172                                            01308000
AVTHRESS EQU   IEDQAVTD+1171                                            01309000
@NM00091 EQU   IEDQAVTD+1170                                            01310000
@NM00090 EQU   IEDQAVTD+1169                                            01311000
@NM00089 EQU   IEDQAVTD+1168                                            01312000
@NM00088 EQU   IEDQAVTD+1165                                            01313000
@NM00087 EQU   IEDQAVTD+1164                                            01314000
AVTHRESE EQU   @NM00086                                                 01315000
AVTRADDR EQU   IEDQAVTD+1156                                            01316000
AVTNADDR EQU   IEDQAVTD+1152                                            01317000
AVTHRESN EQU   IEDQAVTD+1148                                            01318000
AVTVOLRN EQU   IEDQAVTD+1144                                            01319000
AVTTOTNN EQU   IEDQAVTD+1140                                            01320000
AVTTRCYN EQU   IEDQAVTD+1136                                            01321000
AVTRCTRN EQU   IEDQAVTD+1132                                            01322000
AVTNOVON EQU   IEDQAVTD+1128                                            01323000
AVTADEBN EQU   IEDQAVTD+1124                                            01324000
AVTVOLRR EQU   IEDQAVTD+1120                                            01325000
AVTTOTNR EQU   IEDQAVTD+1116                                            01326000
AVTTRCYR EQU   IEDQAVTD+1112                                            01327000
AVTRCTRR EQU   IEDQAVTD+1108                                            01328000
AVTNOVOR EQU   IEDQAVTD+1104                                            01329000
AVTADEBR EQU   IEDQAVTD+1100                                            01330000
AVTLODPT EQU   IEDQAVTD+1096                                            01331000
AVTIOBN  EQU   IEDQAVTD+1092                                            01332000
AVTIOBR  EQU   IEDQAVTD+1088                                            01333000
AVTCPBPT EQU   IEDQAVTD+1084                                            01334000
AVTFCPB  EQU   IEDQAVTD+1080                                            01335000
@NM00085 EQU   IEDQAVTD+1076                                            01336000
AVTINCPQ EQU   IEDQAVTD+1072                                            01337000
@NM00084 EQU   IEDQAVTD+1068                                            01338000
@NM00083 EQU   IEDQAVTD+1065                                            01339000
@NM00082 EQU   AVTBIT4                                                  01340000
@NM00081 EQU   AVTBIT4                                                  01341000
@NM00080 EQU   AVTBIT4                                                  01342000
@NM00079 EQU   AVTBIT4                                                  01343000
@NM00078 EQU   AVTBIT4                                                  01344000
@NM00077 EQU   AVTBIT4                                                  01345000
@NM00076 EQU   AVTBIT4                                                  01346000
AVTRUFTN EQU   AVTBIT4                                                  01347000
@NM00075 EQU   IEDQAVTD+1060                                            01348000
AVTNOBFQ EQU   IEDQAVTD+1056                                            01349000
@NM00074 EQU   IEDQAVTD+1052                                            01350000
AVTDKENQ EQU   IEDQAVTD+1048                                            01351000
@NM00073 EQU   IEDQAVTD+1044                                            01352000
AVTDKAPQ EQU   IEDQAVTD+1040                                            01353000
AVTCOPY  EQU   IEDQAVTD+1036                                            01354000
AVTIA    EQU   IEDQAVTD+1032                                            01355000
AVTFL    EQU   IEDQAVTD+1028                                            01356000
@NM00072 EQU   IEDQAVTD+1024                                            01357000
AVTNCPBQ EQU   IEDQAVTD+1020                                            01358000
AVTTOTNC EQU   IEDQAVTD+1016                                            01359000
AVTCMAX  EQU   IEDQAVTD+1012                                            01360000
AVTCMIN  EQU   IEDQAVTD+1008                                            01361000
AVTHM02  EQU   IEDQAVTD+1004                                            01362000
AVTOPCIN EQU   IEDQAVTD+1002                                            01363000
AVTDCTLN EQU   IEDQAVTD+1000                                            01364000
AVTOPMSK EQU   IEDQAVTD+996                                             01365000
AVTDDFT  EQU   IEDQAVTD+992                                             01366000
AVTSTEAL EQU   IEDQAVTD+988                                             01367000
AVTOPTN  EQU   IEDQAVTD+984                                             01368000
AVTDSKCT EQU   IEDQAVTD+982                                             01369000
AVTCKRST EQU   IEDQAVTD+981                                             01370000
AVTSTAN  EQU   AVTBIT3                                                  01371000
AVTSTACN EQU   AVTBIT3                                                  01372000
AVTSTAIN EQU   AVTBIT3                                                  01373000
AVTSTAYN EQU   AVTBIT3                                                  01374000
AVTOLTBN EQU   AVTBIT3                                                  01375000
AVTTSAB  EQU   AVTBIT3                                                  01376000
AVTRFULN EQU   AVTBIT3                                                  01377000
AVTRECVN EQU   AVTBIT3                                                  01378000
@NM00071 EQU   AVTBIT2                                                  01379000
@NM00070 EQU   AVTBIT2                                                  01380000
AVTOPEIN EQU   AVTBIT2                                                  01381000
AVTSTRTN EQU   AVTBIT2                                                  01382000
AVTTOPOL EQU   AVTBIT2                                                  01383000
AVTCOPYN EQU   AVTBIT2                                                  01384000
AVTREUSN EQU   AVTBIT2                                                  01385000
AVTEXTSC EQU   AVTBIT2                                                  01386000
AVTDISKN EQU   AVTBIT1                                                  01387000
AVTQUCKN EQU   AVTBIT1                                                  01388000
AVTCLOSN EQU   AVTBIT1                                                  01389000
AVTREADN EQU   AVTBIT1                                                  01390000
AVTDLAYN EQU   AVTBIT1                                                  01391000
AVTAQTAN EQU   AVTBIT1                                                  01392000
AVTTSON  EQU   AVTBIT1                                                  01393000
AVTAPLKN EQU   AVTBIT1                                                  01394000
AVTDUMBR EQU   IEDQAVTD+976                                             01395000
AVTDLQX  EQU   IEDQAVTD+974                                             01396000
AVTINTLV EQU   IEDQAVTD+972                                             01397000
AVTSMCNT EQU   IEDQAVTD+970                                             01398000
AVTAVFCT EQU   IEDQAVTD+968                                             01399000
AVTOPCON EQU   IEDQAVTD+966                                             01400000
AVTOPCNT EQU   IEDQAVTD+964                                             01401000
AVTLNCNT EQU   IEDQAVTD+962                                             01402000
AVTKEYLE EQU   IEDQAVTD+960                                             01403000
AVTHA16  EQU   IEDQAVTD+958                                             01404000
AVTHA7   EQU   IEDQAVTD+956                                             01405000
AVTHA4   EQU   IEDQAVTD+954                                             01406000
AVTHA3   EQU   IEDQAVTD+952                                             01407000
AVTHA2   EQU   IEDQAVTD+950                                             01408000
AVTGETMS EQU   IEDQAVTD+949                                             01409000
@NM00069 EQU   IEDQAVTD+948                                             01410000
AVTGETMD EQU   IEDQAVTD+944                                             01411000
AVTGETMN EQU   IEDQAVTD+940                                             01412000
AVTCWTOT EQU   IEDQAVTD+936                                             01413000
AVTCWINT EQU   IEDQAVTD+884                                             01414000
AVTDTRAP EQU   IEDQAVTD+880                                             01415000
@NM00068 EQU   IEDQAVTD+878                                             01416000
@NM00067 EQU   AVTIOTR                                                  01417000
AVTIOTRH EQU   AVTIOTR                                                  01418000
AVTIOTRE EQU   AVTIOTR                                                  01419000
@NM00066 EQU   AVTSUBT                                                  01420000
AVTSUBPT EQU   AVTSUBT                                                  01421000
AVTSUBON EQU   AVTSUBT                                                  01422000
AVTAFE30 EQU   IEDQAVTD+872                                             01423000
AVTAFE20 EQU   IEDQAVTD+868                                             01424000
AVTAFE10 EQU   IEDQAVTD+864                                             01425000
AVTCWEC2 EQU   IEDQAVTD+860                                             01426000
AVTCWPM2 EQU   IEDQAVTD+856                                             01427000
AVTCWTS2 EQU   IEDQAVTD+855                                             01428000
AVTCWTS1 EQU   IEDQAVTD+854                                             01429000
AVTCWCLD EQU   AVTCWFL2                                                 01430000
AVTCWRAP EQU   AVTCWFL2                                                 01431000
@NM00065 EQU   AVTCWFL2                                                 01432000
@NM00064 EQU   AVTCWFL2                                                 01433000
@NM00063 EQU   AVTCWFL2                                                 01434000
@NM00062 EQU   AVTCWFL2                                                 01435000
@NM00061 EQU   AVTCWFL2                                                 01436000
AVTCWACT EQU   AVTCWFL2                                                 01437000
@NM00060 EQU   AVTCWFL1                                                 01438000
@NM00059 EQU   AVTCWFL1                                                 01439000
@NM00058 EQU   AVTCWFL1                                                 01440000
@NM00057 EQU   AVTCWFL1                                                 01441000
@NM00056 EQU   AVTCWFL1                                                 01442000
@NM00055 EQU   AVTCWFL1                                                 01443000
@NM00054 EQU   AVTCWFL1                                                 01444000
AVTCOMWN EQU   AVTCWFL1                                                 01445000
AVTCWEC1 EQU   IEDQAVTD+848                                             01446000
AVTCWPM1 EQU   IEDQAVTD+844                                             01447000
AVTCAREA EQU   IEDQAVTD+840                                             01448000
AVTFZERO EQU   IEDQAVTD+836                                             01449000
AVTCADDR EQU   IEDQAVTD+832                                             01450000
AVTCOREC EQU   IEDQAVTD+828                                             01451000
@NM00053 EQU   IEDQAVTD+820                                             01452000
AVTCPBCB EQU   IEDQAVTD+816                                             01453000
@NM00052 EQU   IEDQAVTD+808                                             01454000
AVTDSIOB EQU   IEDQAVTD+804                                             01455000
@NM00051 EQU   IEDQAVTD+796                                             01456000
AVTCPRMB EQU   IEDQAVTD+792                                             01457000
@NM00050 EQU   IEDQAVTD+784                                             01458000
AVTCLOSB EQU   IEDQAVTD+780                                             01459000
@NM00049 EQU   IEDQAVTD+772                                             01460000
AVTACTIB EQU   IEDQAVTD+768                                             01461000
@NM00048 EQU   IEDQAVTD+764                                             01462000
AVTOLTEB EQU   IEDQAVTD+760                                             01463000
AVTOLTCH EQU   AVTOLTQB+1                                               01464000
AVTOLTVT EQU   AVTOLTQB                                                 01465000
@NM00047 EQU   AVTOPCQB+8                                               01466000
@NM00046 EQU   AVTOPCEC+1                                               01467000
@NM00045 EQU   AVTOPCCC                                                 01468000
AVTOPCPO EQU   AVTOPCCC                                                 01469000
AVTOPCWA EQU   AVTOPCCC                                                 01470000
AVTOPCCH EQU   AVTOPCOB+1                                               01471000
AVTOPCVT EQU   AVTOPCOB                                                 01472000
@NM00044 EQU   AVTCKPQB+9                                               01473000
AVTCKPTS EQU   AVTCKPQB+8                                               01474000
@NM00043 EQU   AVTCKPEC+1                                               01475000
@NM00042 EQU   AVTCKPCC                                                 01476000
AVTCKPPO EQU   AVTCKPCC                                                 01477000
AVTCKPWA EQU   AVTCKPCC                                                 01478000
AVTCKPCH EQU   AVTCKPTB+1                                               01479000
AVTCKPVT EQU   AVTCKPTB                                                 01480000
@NM00041 EQU   IEDQAVTD+724                                             01481000
@NM00040 EQU   IEDQAVTD+716                                             01482000
AVTSELCH EQU   IEDQAVTD+713                                             01483000
AVTBFRTN EQU   AVTBFRFG                                                 01484000
AVTBFREB EQU   IEDQAVTD+708                                             01485000
AVTTIMQ  EQU   IEDQAVTD+704                                             01486000
@NM00039 EQU   IEDQAVTD+700                                             01487000
AVTIMQPS EQU   IEDQAVTD+696                                             01488000
AVTINOUT EQU   IEDQAVTD+694                                             01489000
AVTREFTM EQU   IEDQAVTD+692                                             01490000
@NM00038 EQU   IEDQAVTD+680                                             01491000
AVTDELYB EQU   IEDQAVTD+676                                             01492000
AVTOCQPT EQU   IEDQAVTD+672                                             01493000
AVTTSOPT EQU   IEDQAVTD+668                                             01494000
AVTSUPPT EQU   IEDQAVTD+664                                             01495000
AVTCBQCB EQU   IEDQAVTD+660                                             01496000
AVTMSGS  EQU   IEDQAVTD+657                                             01497000
@NM00037 EQU   AVTSYSER                                                 01498000
@NM00036 EQU   AVTSYSER                                                 01499000
@NM00035 EQU   AVTSYSER                                                 01500000
@NM00034 EQU   AVTSYSER                                                 01501000
@NM00033 EQU   AVTSYSER                                                 01502000
@NM00032 EQU   AVTSYSER                                                 01503000
AVTCMAXN EQU   AVTSYSER                                                 01504000
AVTCMINN EQU   AVTSYSER                                                 01505000
AVT2260L EQU   IEDQAVTD+652                                             01506000
AVTABEPL EQU   AVTADBUF                                                 01507000
AVTHFF   EQU   AVTCLRHI+2                                               01508000
@NM00031 EQU   AVTCLRHI                                                 01509000
AVTCCLNK EQU   AVTCRELE+5                                               01510000
AVTCCPRI EQU   AVTCRELE+4                                               01511000
AVTCCQCB EQU   AVTCCELE+1                                               01512000
AVTCCKEY EQU   AVTCCELE                                                 01513000
AVTDELAD EQU   IEDQAVTD+632                                             01514000
AVTDELEM EQU   IEDQAVTD+628                                             01515000
AVTBSX   EQU   AVTCKLNK                                                 01516000
AVTOPETR EQU   AVTHG01                                                  01517000
@NM00030 EQU   AVTCKBYT                                                 01518000
AVTCKONQ EQU   AVTCKBYT                                                 01519000
@NM00029 EQU   AVTCKBYT                                                 01520000
@NM00028 EQU   AVTCKBYT                                                 01521000
@NM00027 EQU   AVTCKBYT                                                 01522000
@NM00026 EQU   AVTCKBYT                                                 01523000
@NM00025 EQU   AVTCKBYT                                                 01524000
@NM00024 EQU   AVTCKBYT                                                 01525000
AVTOPERT EQU   IEDQAVTD+618                                             01526000
AVTOPXCL EQU   IEDQAVTD+616                                             01527000
AVTOPERL EQU   IEDQAVTD+615                                             01528000
@NM00023 EQU   IEDQAVTD+614                                             01529000
AVTCKTIM EQU   IEDQAVTD+612                                             01530000
AVTCKELV EQU   IEDQAVTD+610                                             01531000
AVTCPRCD EQU   IEDQAVTD+609                                             01532000
AVTWARMN EQU   AVTCKELF                                                 01533000
AVTCRTLN EQU   AVTCKELF                                                 01534000
AVTCPIPN EQU   AVTCKELF                                                 01535000
AVTCCLCN EQU   AVTCKELF                                                 01536000
AVTCINCN EQU   AVTCKELF                                                 01537000
@NM00022 EQU   AVTCKELF                                                 01538000
AVTCMCPN EQU   AVTCKELF                                                 01539000
AVTNQBCK EQU   AVTCKELF                                                 01540000
AVTCKQAD EQU   IEDQAVTD+605                                             01541000
AVTSCBSZ EQU   IEDQAVTD+604                                             01542000
@NM00021 EQU   IEDQAVTD+600                                             01543000
AVTCKELE EQU   IEDQAVTD+596                                             01544000
@NM00020 EQU   AVTCKPEL+8                                               01545000
AVTCKRLK EQU   AVTCKPEL+5                                               01546000
AVTCKRPR EQU   AVTCKPEL+4                                               01547000
AVTCKRMQ EQU   AVTCKRMV+1                                               01548000
AVTCKRKY EQU   AVTCKRMV                                                 01549000
AVTHK    EQU   IEDQAVTD+576                                             01550000
AVTHI    EQU   IEDQAVTD+572                                             01551000
AVTIOT   EQU   IEDQAVTD+568                                             01552000
AVTNX    EQU   IEDQAVTD+564                                             01553000
AVTTONE  EQU   IEDQAVTD+560                                             01554000
AVTA3TL  EQU   IEDQAVTD+556                                             01555000
AVTDMECB EQU   IEDQAVTD+552                                             01556000
AVTABEND EQU   IEDQAVTD+546                                             01557000
AVTPLCBN EQU   IEDQAVTD+544                                             01558000
@NM00019 EQU   AVTSAVTP+1                                               01559000
@NM00018 EQU   AVTSAVTF                                                 01560000
AVTSNA   EQU   AVTSAVTF                                                 01561000
AVTONSNA EQU   AVTSAVTF                                                 01562000
AVTVTMCP EQU   AVTSAVTF                                                 01563000
@NM00017 EQU   IEDQAVTD+536                                             01564000
AVTCMBSS EQU   IEDQAVTD+532                                             01565000
AVTRCV   EQU   IEDQAVTD+528                                             01566000
AVTSEND  EQU   IEDQAVTD+524                                             01567000
AVTCSCH  EQU   IEDQAVTD+520                                             01568000
AVTQ1    EQU   IEDQAVTD+516                                             01569000
AVTE7    EQU   IEDQAVTD+512                                             01570000
AVTHB    EQU   IEDQAVTD+508                                             01571000
AVTR1    EQU   IEDQAVTD+504                                             01572000
AVTBZ    EQU   IEDQAVTD+500                                             01573000
AVTEZ    EQU   IEDQAVTD+496                                             01574000
AVTEC    EQU   IEDQAVTD+492                                             01575000
AVTEW    EQU   IEDQAVTD+488                                             01576000
AVTNDIAL EQU   AVTSCOPT                                                 01577000
AVTN2741 EQU   AVTSCOPT                                                 01578000
AVTCONCO EQU   AVTSCOPT                                                 01579000
AVTCONC  EQU   AVTSCOPT                                                 01580000
AVTCMBUF EQU   AVTSCOPT                                                 01581000
AVTAPDMP EQU   AVTSCOPT                                                 01582000
@NM00016 EQU   AVTSCOPT                                                 01583000
AVTHA    EQU   AVTDISP                                                  01584000
AVTEA    EQU   IEDQAVTD+476                                             01585000
AVTAX    EQU   IEDQAVTD+472                                             01586000
AVTA3    EQU   IEDQAVTD+468                                             01587000
AVTGD    EQU   IEDQAVTD+464                                             01588000
AVTAL    EQU   IEDQAVTD+460                                             01589000
AVTOLTST EQU   AVTHG02                                                  01590000
AVTE8    EQU   IEDQAVTD+452                                             01591000
AVTUI    EQU   IEDQAVTD+448                                             01592000
AVTCOMPT EQU   IEDQAVTD+444                                             01593000
AVTCRSRF EQU   IEDQAVTD+440                                             01594000
@NM00015 EQU   IEDQAVTD+436                                             01595000
AVTKA02  EQU   IEDQAVTD+432                                             01596000
AVTOPTPT EQU   IEDQAVTD+428                                             01597000
AVTPCBPT EQU   IEDQAVTD+424                                             01598000
@NM00014 EQU   AVTECB1                                                  01599000
AVTCOMP  EQU   AVTECB1                                                  01600000
@NM00013 EQU   AVTECB1                                                  01601000
AVTOPECA EQU   IEDQAVTD+416                                             01602000
AVTOLECA EQU   IEDQAVTD+412                                             01603000
AVTCKECA EQU   IEDQAVTD+408                                             01604000
AVTCWECA EQU   IEDQAVTD+404                                             01605000
AVTCWTCB EQU   IEDQAVTD+400                                             01606000
AVTOLTCB EQU   IEDQAVTD+396                                             01607000
AVTOCTCB EQU   IEDQAVTD+392                                             01608000
AVTCKTCB EQU   IEDQAVTD+388                                             01609000
AVTAS    EQU   IEDQAVTD+384                                             01610000
AVTNOLBF EQU   IEDQAVTD+382                                             01611000
AVTNCKPR EQU   IEDQAVTD+381                                             01612000
AVTCIB   EQU   IEDQAVTD+380                                             01613000
AVTSPLPT EQU   IEDQAVTD+376                                             01614000
AVTMVBFR EQU   IEDQAVTD+372                                             01615000
AVTSBTA  EQU   IEDQAVTD+368                                             01616000
AVTRARTN EQU   IEDQAVTD+364                                             01617000
AVTBSCAN EQU   IEDQAVTD+360                                             01618000
AVTRDYA  EQU   IEDQAVTD+356                                             01619000
AVTDISTR EQU   IEDQAVTD+348                                             01620000
AVTPARM3 EQU   IEDQAVTD+344                                             01621000
@NM00012 EQU   AVTPKF                                                   01622000
@NM00011 EQU   AVTPKF                                                   01623000
@NM00010 EQU   AVTPKF                                                   01624000
AVTFTCHF EQU   AVTPKF                                                   01625000
@NM00009 EQU   AVTPKF                                                   01626000
@NM00008 EQU   AVTPKF                                                   01627000
@NM00007 EQU   AVTPKF                                                   01628000
@NM00006 EQU   AVTPKF                                                   01629000
AVTPARM  EQU   IEDQAVTD+336                                             01630000
AVTEXS2A EQU   IEDQAVTD+330                                             01631000
AVTEXA2S EQU   IEDQAVTD+324                                             01632000
AVTOCGET EQU   IEDQAVTD+320                                             01633000
AVTCKAVT EQU   @NM00004+1                                               01634000
@NM00005 EQU   AVTCKFLG                                                 01635000
AVTCKHLT EQU   AVTCKFLG                                                 01636000
AVTCKREQ EQU   AVTCKFLG                                                 01637000
AVTCKENV EQU   AVTCKFLG                                                 01638000
AVTCKNAC EQU   AVTCKFLG                                                 01639000
AVTCKTAC EQU   AVTCKFLG                                                 01640000
AVTBUENT EQU   IEDQAVTD+314                                             01641000
@NM00003 EQU   IEDQAVTD+313                                             01642000
AVTFULLT EQU   AVTBUFSW                                                 01643000
AVTUNCON EQU   AVTBUFSW                                                 01644000
@NM00002 EQU   AVTBUFSW                                                 01645000
AVTBUFTR EQU   AVTREADD                                                 01646000
AVTREADY EQU   IEDQAVTD+304                                             01647000
AVTRACE  EQU   IEDQAVTD+300                                             01648000
AVTTCB   EQU   IEDQAVTD+296                                             01649000
AVTPASWD EQU   IEDQAVTD+288                                             01650000
AVTCTLCH EQU   IEDQAVTD+280                                             01651000
AVTDOUBL EQU   IEDQAVTD+272                                             01652000
AVTDOUBX EQU   IEDQAVTD+264                                             01653000
AVTDPARM EQU   IEDQAVTD+260                                             01654000
AVTCSTCS EQU   IEDQAVTD+256                                             01655000
AVTDLQ   EQU   AVTSAVEX+32                                              01656000
@NM00001 EQU   AVTSAVEX                                                 01657000
AVTSAVE4 EQU   IEDQAVTD+144                                             01658000
AVTSAVE3 EQU   IEDQAVTD+72                                              01659000
AVTSAVE2 EQU   IEDQAVTD                                                 01660000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01661000
@RF00471 EQU   @RC00467                                                 01662000
@PB00011 EQU   @EL00001                                                 01663000
@PB00010 EQU   @PB00011                                                 01664000
@PB00009 EQU   @PB00010                                                 01665000
@PB00008 EQU   @PB00009                                                 01666000
@PB00007 EQU   @PB00008                                                 01667000
@PB00006 EQU   @PB00007                                                 01668000
@PB00005 EQU   @PB00006                                                 01669000
@PB00004 EQU   @PB00005                                                 01670000
@PB00003 EQU   @PB00004                                                 01671000
@PB00002 EQU   @PB00003                                                 01672000
@ENDDATA EQU   *                                                        01673000
         END   IEDSCPRP,(C'PLS2307',0701,78089)                         01674000
