         TITLE '******** IKT0940C:  STAUTOCP  - TERMINAL CONTROL MACRO *00001000
                 *******'                                               00002000
IKT0940C CSECT ,                                                   0001 00003000
@MAINENT BALR  @15,0                                               0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IKT0940C  77.319'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
*                                                                  0029 00013000
* /*                   END OF CVT MACRO                              */ 00014000
*                                                                  0030 00015000
*        /************************************************************/ 00016000
*        /*                                                          */ 00017000
*        /* THE PARAMETER REGISTER IS EXPECTED TO BE ZERO. IF IT IS  */ 00018000
*        /* NOT ZERO, THE ERROR IS NOTED WITH RETURN CODE 4.         */ 00019000
*        /*                                                          */ 00020000
*        /************************************************************/ 00021000
*                                                                  0030 00022000
*        IF RPARM1 ^= 0                                            0030 00023000
*        THEN                                                      0030 00024000
         LTR   RPARM1,RPARM1                                       0030 00025000
         BZ    @RF00030                                            0030 00026000
*          RETCODE = CODE04;                                       0031 00027000
         LA    RETCODE,4                                           0031 00028000
*        ELSE                                                      0032 00029000
*                                                                  0032 00030000
*          /**********************************************************/ 00031000
*          /*                                                        */ 00032000
*          /* CHARACTER PROMPT IS NOP'ED FOR DISPLAY TERMINALS AND   */ 00033000
*          /* THE RETURN CODE IS SET TO 0.                           */ 00034000
*          /*                                                        */ 00035000
*          /**********************************************************/ 00036000
*                                                                  0032 00037000
*          IF TSBDSPLY = '1'B                                      0032 00038000
*          THEN                                                    0032 00039000
         B     @RC00030                                            0032 00040000
@RF00030 TM    TSBDSPLY(TSBPTR),B'00100000'                        0032 00041000
         BNO   @RF00032                                            0032 00042000
*            RETCODE = CODE00;                                     0033 00043000
         SLR   RETCODE,RETCODE                                     0033 00044000
*          ELSE                                                    0034 00045000
*                                                                  0034 00046000
*            /********************************************************/ 00047000
*            /*                                                      */ 00048000
*            /* SET UP CHARACTER PROMPT BY SETTING THE PROPER TSB    */ 00049000
*            /* BITS AND MOVE IN PROPER CHARACTER PROMPT CHARACTER   */ 00050000
*            /* STRING.                                              */ 00051000
*            /*                                                      */ 00052000
*            /********************************************************/ 00053000
*                                                                  0034 00054000
*            DO;                                                   0034 00055000
         B     @RC00032                                            0034 00056000
@RF00032 DS    0H                                                  0035 00057000
*              TSBAUTON = '1'B;        /*REQUEST PROMPTING           */ 00058000
*              TSBAUTOC = '1'B;        /*CHARACTER PROMPTING IN US   */ 00059000
*              TSBSTAUT = '1'B;        /*PROMPT USER WITH NEXT LINE  */ 00060000
*              TSBAULST = '0'B;        /*TURN OFF LINE-PROMPT        */ 00061000
         OI    TSBAUTON(TSBPTR),B'01001100'                        0038 00062000
         NI    TSBAULST(TSBPTR),B'11101111'                        0038 00063000
*              TSBSPIT  = '0'B;        /*ALLOW PROMPTING             */ 00064000
         NI    TSBSPIT(TSBPTR),B'11011111'                         0039 00065000
*              XTSBAUTS = CP376770;    /*MOVE IN CHAR STRING TO FIRST   00066000
*                                        TWO CHARS OF TSBAUTOS       */ 00067000
*                                                                  0040 00068000
         MVC   XTSBAUTS(2,TSBPTR),@CB00047                         0040 00069000
*              /******************************************************/ 00070000
*              /*                                                    */ 00071000
*              /* IF THE TERMINAL OUTPUT MANAGER IS AVAILABL AND NOT */ 00072000
*              /* SCHEDULED, THE SCHEDULE MACRO IS ISSUED, AND THE   */ 00073000
*              /* SCHEDULE IS NOTED IN THE TVWA.                     */ 00074000
*              /*                                                    */ 00075000
*              /******************************************************/ 00076000
*                                                                  0041 00077000
*              IF TVWATAS = '0'B & TVWATIS = '0'B                  0041 00078000
*              THEN                                                0041 00079000
         L     @04,TSBEXTNT(,TSBPTR)                               0041 00080000
         L     @11,TVWAPTR(,@04)                                   0041 00081000
         TM    TVWATAS(@11),B'01100000'                            0041 00082000
         BNZ   @RF00041                                            0041 00083000
*                DO;                                               0042 00084000
*                  RFY RWORK3 RSTD;                                0043 00085000
*                  RWORK3 = TSBXSRB;   /*GET ADDRESS OF SRB          */ 00086000
         L     RWORK3,TSBXSRB(,@04)                                0044 00087000
*                  GEN(SCHEDULE SRB=(RWORK3),SCOPE=LOCAL)          0045 00088000
*                       REFS(RWORK3,CVTPTR,CVTLSMQ,CVTMAP,SRBSECT) 0045 00089000
*                      SETS(REG0,RPARM1,RETCODE,SRBFLNK);          0045 00090000
         SCHEDULE SRB=(RWORK3),SCOPE=LOCAL                              00091000
*                  RFY RWORK3 UNRSTD;                              0046 00092000
*                  TVWATIS = '1'B;     /*NOTE TOM SCHEDULED          */ 00093000
         L     @04,TSBEXTNT(,TSBPTR)                               0047 00094000
         L     @04,TVWAPTR(,@04)                                   0047 00095000
         OI    TVWATIS(@04),B'01000000'                            0047 00096000
*                END;                                              0048 00097000
*              ELSE;                                               0049 00098000
@RF00041 DS    0H                                                  0050 00099000
*              RETCODE = CODE00;                 /*SET GOOD RETN CODE*/ 00100000
         SLR   RETCODE,RETCODE                                     0050 00101000
*            END;                                                  0051 00102000
*        RETURN;                                           /*@ZM20487*/ 00103000
@EL00001 DS    0H                                                  0052 00104000
@EF00001 DS    0H                                                  0052 00105000
@ER00001 BR    @14                                                 0052 00106000
*        END IKT0940C                                              0053 00107000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00108000
*/*%INCLUDE SYSLIB  (IKJTSB  )                                        * 00109000
*/*%INCLUDE SYSLIB  (IKTTSBX )                                        * 00110000
*/*%INCLUDE SYSLIB  (IKTTVWA )                                        * 00111000
*/*%INCLUDE SYSLIB  (IHASRB  )                                        * 00112000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        * 00113000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00114000
*;                                                                 0053 00115000
         B     @EL00001                                            0053 00116000
@DATA    DS    0H                                                       00117000
@DATD    DSECT                                                          00118000
         DS    0F                                                       00119000
IKT0940C CSECT                                                          00120000
         DS    0F                                                       00121000
@DATD    DSECT                                                          00122000
         DS    0D                                                       00123000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00124000
@ENDDATD EQU   *                                                        00125000
IKT0940C CSECT                                                          00126000
         DS    0F                                                       00127000
@SIZDATD DC    AL1(0)                                                   00128000
         DC    AL3(@ENDDATD-@DATD)                                      00129000
         DS    0D                                                       00130000
@CB00047 DC    X'6D16'                                                  00131000
         DS    CL2                                                      00132000
PATCH    DC    15F'0'                                                   00133000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00134000
@01      EQU   01                                                       00135000
@02      EQU   02                                                       00136000
@03      EQU   03                                                       00137000
@04      EQU   04                                                       00138000
@05      EQU   05                                                       00139000
@06      EQU   06                                                       00140000
@07      EQU   07                                                       00141000
@08      EQU   08                                                       00142000
@09      EQU   09                                                       00143000
@10      EQU   10                                                       00144000
@11      EQU   11                                                       00145000
@12      EQU   12                                                       00146000
@13      EQU   13                                                       00147000
@14      EQU   14                                                       00148000
@15      EQU   15                                                       00149000
RBASE    EQU   @12                                                      00150000
REG0     EQU   @00                                                      00151000
RPARM1   EQU   @01                                                      00152000
RWORK3   EQU   @03                                                      00153000
TSBPTR   EQU   @05                                                      00154000
RLINK    EQU   @14                                                      00155000
RETCODE  EQU   @15                                                      00156000
PSA      EQU   0                                                        00157000
FLCRNPSW EQU   PSA                                                      00158000
FLCROPSW EQU   PSA+8                                                    00159000
FLCICCW2 EQU   PSA+16                                                   00160000
FLCCVT   EQU   FLCICCW2                                                 00161000
PSAEEPSW EQU   PSA+132                                                  00162000
PSAESPSW EQU   PSA+136                                                  00163000
FLCSVILC EQU   PSAESPSW+1                                               00164000
PSAEPPSW EQU   PSA+140                                                  00165000
FLCPIILC EQU   PSAEPPSW+1                                               00166000
FLCPICOD EQU   PSAEPPSW+2                                               00167000
PSAPICOD EQU   FLCPICOD+1                                               00168000
FLCTEA   EQU   PSAEPPSW+4                                               00169000
FLCPER   EQU   PSA+152                                                  00170000
FLCMCLA  EQU   PSA+168                                                  00171000
FLCIOEL  EQU   FLCMCLA+4                                                00172000
FLCIOA   EQU   FLCMCLA+16                                               00173000
FLCFSA   EQU   FLCMCLA+80                                               00174000
PSASUPER EQU   PSA+552                                                  00175000
PSASUP1  EQU   PSASUPER                                                 00176000
PSASUP2  EQU   PSASUPER+1                                               00177000
PSASUP3  EQU   PSASUPER+2                                               00178000
PSASUP4  EQU   PSASUPER+3                                               00179000
PSACLHT  EQU   PSA+640                                                  00180000
PSALKSA  EQU   PSA+696                                                  00181000
PSAHLHI  EQU   PSA+760                                                  00182000
PSADSSFL EQU   PSA+836                                                  00183000
PSADSSF1 EQU   PSADSSFL                                                 00184000
PSADSSF3 EQU   PSADSSFL+2                                               00185000
PSADSSF4 EQU   PSADSSFL+3                                               00186000
PSARSVT  EQU   PSA+896                                                  00187000
TSB      EQU   0                                                        00188000
TSBASCBA EQU   TSB                                                      00189000
TSBSTAT  EQU   TSBASCBA                                                 00190000
TSBDSPLY EQU   TSBSTAT                                                  00191000
TSBFLG1  EQU   TSB+4                                                    00192000
TSBFLG2  EQU   TSB+16                                                   00193000
TSBAUTON EQU   TSBFLG2                                                  00194000
TSBAULST EQU   TSBFLG2                                                  00195000
TSBAUTOC EQU   TSBFLG2                                                  00196000
TSBSTAUT EQU   TSBFLG2                                                  00197000
TSBFLG3  EQU   TSB+24                                                   00198000
TSBSPIT  EQU   TSBFLG3                                                  00199000
TSBFLG5  EQU   TSB+25                                                   00200000
TSBTERMC EQU   TSB+26                                                   00201000
TSBTERM1 EQU   TSBTERMC                                                 00202000
TSBTERM2 EQU   TSBTERMC+1                                               00203000
TSBSTCC  EQU   TSB+34                                                   00204000
TSBFLG4  EQU   TSB+41                                                   00205000
TSBAUTOS EQU   TSB+48                                                   00206000
TSBRCB   EQU   TSB+64                                                   00207000
TSBLINKA EQU   TSBRCB+4                                                 00208000
TSBTPOST EQU   TSB+72                                                   00209000
TSBTPFLG EQU   TSBTPOST                                                 00210000
TSBMINL  EQU   TSB+84                                                   00211000
TSBEXTNT EQU   TSB+96                                                   00212000
TSBX     EQU   0                                                        00213000
TSBXFLG1 EQU   TSBX+32                                                  00214000
TSBXTVWA EQU   TSBX+36                                                  00215000
TSBXSRB  EQU   TSBX+56                                                  00216000
TSBXTERM EQU   TSBX+72                                                  00217000
TVWA     EQU   0                                                        00218000
TVWAFLG7 EQU   TVWA+110                                                 00219000
TVWAECBL EQU   TVWA+120                                                 00220000
TVWADLST EQU   TVWA+132                                                 00221000
TVWAFLG1 EQU   TVWA+144                                                 00222000
TVWATIS  EQU   TVWAFLG1                                                 00223000
TVWATAS  EQU   TVWAFLG1                                                 00224000
TVWAFLG2 EQU   TVWA+145                                                 00225000
TVWAFLG3 EQU   TVWA+146                                                 00226000
TVWAFLG4 EQU   TVWA+147                                                 00227000
TVWAFLG5 EQU   TVWA+150                                                 00228000
TVWAFLG6 EQU   TVWA+182                                                 00229000
SRBSECT  EQU   0                                                        00230000
SRBFLNK  EQU   SRBSECT+4                                                00231000
SRBFLC   EQU   SRBSECT+12                                               00232000
CVTMAP   EQU   0                                                        00233000
CVTDAR   EQU   CVTMAP+72                                                00234000
CVTFLGS1 EQU   CVTDAR                                                   00235000
CVTDCB   EQU   CVTMAP+116                                               00236000
CVTIERLC EQU   CVTMAP+144                                               00237000
CVTOPTA  EQU   CVTMAP+182                                               00238000
CVTOPTB  EQU   CVTMAP+183                                               00239000
CVTGTF   EQU   CVTMAP+236                                               00240000
CVTGTFST EQU   CVTGTF                                                   00241000
CVTGTFS  EQU   CVTGTFST                                                 00242000
CVTSTATE EQU   CVTGTFST                                                 00243000
CVTTMODE EQU   CVTGTFST                                                 00244000
CVTFORM  EQU   CVTGTFST                                                 00245000
CVTAQAVT EQU   CVTMAP+240                                               00246000
CVTTCMFG EQU   CVTAQAVT                                                 00247000
CVTVOLM2 EQU   CVTMAP+244                                               00248000
CVTTATA  EQU   CVTVOLM2                                                 00249000
CVTTSKS  EQU   CVTTATA                                                  00250000
CVTVOLF2 EQU   CVTTSKS                                                  00251000
CVTTAT   EQU   CVTTATA+1                                                00252000
CVTATER  EQU   CVTMAP+248                                               00253000
CVTEXT1  EQU   CVTMAP+252                                               00254000
CVTPURG  EQU   CVTMAP+260                                               00255000
CVTQMSG  EQU   CVTMAP+268                                               00256000
CVTDMSR  EQU   CVTMAP+272                                               00257000
CVTRSV37 EQU   CVTDMSR                                                  00258000
CVTDMSRF EQU   CVTRSV37                                                 00259000
CVTERPV  EQU   CVTMAP+316                                               00260000
CVTINTLA EQU   CVTMAP+320                                               00261000
CVTAPF   EQU   CVTMAP+324                                               00262000
CVTEXT2  EQU   CVTMAP+328                                               00263000
CVTHJES  EQU   CVTMAP+332                                               00264000
CVTPGSIA EQU   CVTMAP+348                                               00265000
CVTA1F1  EQU   CVTMAP+356                                               00266000
CVTSYSK  EQU   CVTMAP+357                                               00267000
CVTVOLM1 EQU   CVTMAP+380                                               00268000
CVTVOLF1 EQU   CVTVOLM1                                                 00269000
CVTATMCT EQU   CVTMAP+388                                               00270000
CVTXTNT1 EQU   0                                                        00271000
CVTXTNT2 EQU   0                                                        00272000
CVTDSSV  EQU   CVTXTNT2                                                 00273000
CVTFLGBT EQU   CVTXTNT2+5                                               00274000
CVTQID   EQU   CVTXTNT2+24                                              00275000
CVTSHS   EQU   CVTXTNT2+40                                              00276000
CVTRV400 EQU   CVTXTNT2+52                                              00277000
CVTRV409 EQU   CVTXTNT2+53                                              00278000
CVTATCVT EQU   CVTXTNT2+64                                              00279000
CVTRV429 EQU   CVTXTNT2+84                                              00280000
CVTRV438 EQU   CVTXTNT2+85                                              00281000
CVTRV457 EQU   CVTXTNT2+112                                             00282000
CVTRV466 EQU   CVTXTNT2+113                                             00283000
CVTFIX   EQU   0                                                        00284000
CVTRELNO EQU   CVTFIX+252                                               00285000
XTSBAUTS EQU   TSBAUTOS                                                 00286000
TVWAPTR  EQU   TSBXTVWA                                                 00287000
SRBPTR   EQU   TSBXSRB                                                  00288000
PSARSVTE EQU   PSARSVT                                                  00289000
CVTPTR   EQU   FLCCVT                                                   00290000
CVTS01   EQU   CVTPGSIA                                                 00291000
CVTLPDIA EQU   CVTS01+12                                                00292000
CVTDIRST EQU   CVTLPDIA                                                 00293000
CVTSLIDA EQU   CVTS01+24                                                00294000
CVTCTLFG EQU   CVTS01+50                                                00295000
CVTLSMQ  EQU   CVTS01+268                                               00296000
CVTRV210 EQU   CVTS01+424                                               00297000
CVTRV219 EQU   CVTS01+425                                               00298000
CVTRV228 EQU   CVTS01+426                                               00299000
CVTRV237 EQU   CVTS01+427                                               00300000
CVTMFRTR EQU   CVTS01+452                                               00301000
CVTRV262 EQU   CVTS01+468                                               00302000
CVTRV271 EQU   CVTS01+469                                               00303000
CVTRV280 EQU   CVTS01+470                                               00304000
CVTRV289 EQU   CVTS01+471                                               00305000
CVTGSDA  EQU   CVTS01+600                                               00306000
FLC      EQU   PSA                                                      00307000
SRB      EQU   SRBSECT                                                  00308000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00309000
CVTRV628 EQU   CVTS01+728                                               00310000
CVTRV627 EQU   CVTS01+724                                               00311000
CVTRV626 EQU   CVTS01+720                                               00312000
CVTRV625 EQU   CVTS01+716                                               00313000
CVTRV624 EQU   CVTS01+712                                               00314000
CVTRV623 EQU   CVTS01+708                                               00315000
CVTRV622 EQU   CVTS01+704                                               00316000
CVTRV621 EQU   CVTS01+700                                               00317000
CVTRV620 EQU   CVTS01+696                                               00318000
CVTRV619 EQU   CVTS01+692                                               00319000
CVTRV618 EQU   CVTS01+688                                               00320000
CVTRV617 EQU   CVTS01+684                                               00321000
CVTRV616 EQU   CVTS01+680                                               00322000
CVTRV615 EQU   CVTS01+676                                               00323000
CVTRV614 EQU   CVTS01+672                                               00324000
CVTRV613 EQU   CVTS01+668                                               00325000
CVTTCASP EQU   CVTS01+664                                               00326000
CVT0PT03 EQU   CVTS01+660                                               00327000
CVT0PT0E EQU   CVTS01+656                                               00328000
CVTIRM   EQU   CVTS01+652                                               00329000
CVTCGK   EQU   CVTS01+648                                               00330000
CVTRV607 EQU   CVTS01+644                                               00331000
CVTRV606 EQU   CVTS01+640                                               00332000
CVTRV605 EQU   CVTS01+636                                               00333000
CVTRV604 EQU   CVTS01+632                                               00334000
CVTEFF02 EQU   CVTS01+628                                               00335000
CVTCBBR  EQU   CVTS01+624                                               00336000
CVTSSCR  EQU   CVTS01+620                                               00337000
CVTEVENT EQU   CVTS01+616                                               00338000
CVTCRCA  EQU   CVTS01+612                                               00339000
CVTTPIO  EQU   CVTS01+608                                               00340000
CVTADV   EQU   CVTS01+604                                               00341000
CVTGSDAB EQU   CVTGSDA                                                  00342000
CVTQV3   EQU   CVTS01+596                                               00343000
CVTQV2   EQU   CVTS01+592                                               00344000
CVTQV1   EQU   CVTS01+588                                               00345000
CVTRPT   EQU   CVTS01+584                                               00346000
CVTSSRB  EQU   CVTS01+580                                               00347000
CVTCSDRL EQU   CVTS01+576                                               00348000
CVTEXP1  EQU   CVTS01+572                                               00349000
CVTRMPMT EQU   CVTS01+568                                               00350000
CVTRMPTT EQU   CVTS01+564                                               00351000
CVTVPSA  EQU   CVTS01+560                                               00352000
CVTVSTOP EQU   CVTS01+556                                               00353000
CVTGTFR8 EQU   CVTS01+552                                               00354000
CVTQUIT  EQU   CVTS01+548                                               00355000
CVTVACR  EQU   CVTS01+544                                               00356000
CVTWTCB  EQU   CVTS01+540                                               00357000
CVTSTPRS EQU   CVTS01+536                                               00358000
CVT0PT02 EQU   CVTS01+532                                               00359000
CVTDARCM EQU   CVTS01+528                                               00360000
CVTIRECM EQU   CVTS01+524                                               00361000
CVTJRECM EQU   CVTS01+520                                               00362000
CVTVEMS0 EQU   CVTS01+516                                               00363000
CVTSPFRR EQU   CVTS01+512                                               00364000
CVTRLSTG EQU   CVTS01+508                                               00365000
CVT0TC0A EQU   CVTS01+504                                               00366000
CVTGMBR  EQU   CVTS01+500                                               00367000
CVTLFRM  EQU   CVTS01+496                                               00368000
CVTRMBR  EQU   CVTS01+492                                               00369000
CVTVIOP  EQU   CVTS01+488                                               00370000
CVTRV307 EQU   CVTS01+486                                               00371000
CVTRV306 EQU   CVTS01+484                                               00372000
CVTRV305 EQU   CVTS01+482                                               00373000
CVTRV304 EQU   CVTS01+480                                               00374000
CVTRV303 EQU   CVTS01+478                                               00375000
CVTRV302 EQU   CVTS01+476                                               00376000
CVTTRCA  EQU   CVTS01+472                                               00377000
CVTRV297 EQU   CVTRV289                                                 00378000
CVTRV296 EQU   CVTRV289                                                 00379000
CVTRV295 EQU   CVTRV289                                                 00380000
CVTRV294 EQU   CVTRV289                                                 00381000
CVTRV293 EQU   CVTRV289                                                 00382000
CVTRV292 EQU   CVTRV289                                                 00383000
CVTRV291 EQU   CVTRV289                                                 00384000
CVTRV290 EQU   CVTRV289                                                 00385000
CVTRV288 EQU   CVTRV280                                                 00386000
CVTRV287 EQU   CVTRV280                                                 00387000
CVTRV286 EQU   CVTRV280                                                 00388000
CVTRV285 EQU   CVTRV280                                                 00389000
CVTRV284 EQU   CVTRV280                                                 00390000
CVTRV283 EQU   CVTRV280                                                 00391000
CVTRV282 EQU   CVTRV280                                                 00392000
CVTRV281 EQU   CVTRV280                                                 00393000
CVTRV279 EQU   CVTRV271                                                 00394000
CVTRV278 EQU   CVTRV271                                                 00395000
CVTRV277 EQU   CVTRV271                                                 00396000
CVTRV276 EQU   CVTRV271                                                 00397000
CVTRV275 EQU   CVTRV271                                                 00398000
CVTRV274 EQU   CVTRV271                                                 00399000
CVTRV273 EQU   CVTRV271                                                 00400000
CVTRV272 EQU   CVTRV271                                                 00401000
CVTRV270 EQU   CVTRV262                                                 00402000
CVTRV269 EQU   CVTRV262                                                 00403000
CVTRV268 EQU   CVTRV262                                                 00404000
CVTRV267 EQU   CVTRV262                                                 00405000
CVTRV266 EQU   CVTRV262                                                 00406000
CVTRV265 EQU   CVTRV262                                                 00407000
CVTRV264 EQU   CVTRV262                                                 00408000
CVTRV263 EQU   CVTRV262                                                 00409000
CVTVFP   EQU   CVTS01+464                                               00410000
CVTVSI   EQU   CVTS01+460                                               00411000
CVTVPSIB EQU   CVTS01+456                                               00412000
CVTMFACT EQU   CVTMFRTR                                                 00413000
CVTMFCTL EQU   CVTS01+448                                               00414000
CVTPVBP  EQU   CVTS01+444                                               00415000
CVTPWI   EQU   CVTS01+440                                               00416000
CVTRV254 EQU   CVTS01+438                                               00417000
CVTRV253 EQU   CVTS01+436                                               00418000
CVTRV252 EQU   CVTS01+434                                               00419000
CVTRV251 EQU   CVTS01+433                                               00420000
CVTRV250 EQU   CVTS01+432                                               00421000
CVTRV249 EQU   CVTS01+431                                               00422000
CVTRV248 EQU   CVTS01+430                                               00423000
CVTRV247 EQU   CVTS01+429                                               00424000
CVTRV246 EQU   CVTS01+428                                               00425000
CVTRV245 EQU   CVTRV237                                                 00426000
CVTRV244 EQU   CVTRV237                                                 00427000
CVTRV243 EQU   CVTRV237                                                 00428000
CVTRV242 EQU   CVTRV237                                                 00429000
CVTRV241 EQU   CVTRV237                                                 00430000
CVTRV240 EQU   CVTRV237                                                 00431000
CVTRV239 EQU   CVTRV237                                                 00432000
CVTRV238 EQU   CVTRV237                                                 00433000
CVTRV236 EQU   CVTRV228                                                 00434000
CVTRV235 EQU   CVTRV228                                                 00435000
CVTRV234 EQU   CVTRV228                                                 00436000
CVTRV233 EQU   CVTRV228                                                 00437000
CVTRV232 EQU   CVTRV228                                                 00438000
CVTRV231 EQU   CVTRV228                                                 00439000
CVTRV230 EQU   CVTRV228                                                 00440000
CVTRV229 EQU   CVTRV228                                                 00441000
CVTRV227 EQU   CVTRV219                                                 00442000
CVTRV226 EQU   CVTRV219                                                 00443000
CVTRV225 EQU   CVTRV219                                                 00444000
CVTRV224 EQU   CVTRV219                                                 00445000
CVTRV223 EQU   CVTRV219                                                 00446000
CVTRV222 EQU   CVTRV219                                                 00447000
CVTRV221 EQU   CVTRV219                                                 00448000
CVTRV220 EQU   CVTRV219                                                 00449000
CVTRV218 EQU   CVTRV210                                                 00450000
CVTRV217 EQU   CVTRV210                                                 00451000
CVTRV216 EQU   CVTRV210                                                 00452000
CVTRV215 EQU   CVTRV210                                                 00453000
CVTRV214 EQU   CVTRV210                                                 00454000
CVTRV213 EQU   CVTRV210                                                 00455000
CVTRV212 EQU   CVTRV210                                                 00456000
CVTRV211 EQU   CVTRV210                                                 00457000
CVTLCCAT EQU   CVTS01+420                                               00458000
CVTPCCAT EQU   CVTS01+416                                               00459000
CVTIPCRP EQU   CVTS01+412                                               00460000
CVTIPCRI EQU   CVTS01+408                                               00461000
CVTIPCDS EQU   CVTS01+404                                               00462000
CVTAIDVT EQU   CVTS01+400                                               00463000
CVTSSAP  EQU   CVTS01+396                                               00464000
CVTEHCIR EQU   CVTS01+392                                               00465000
CVTEHDEF EQU   CVTS01+388                                               00466000
CVTDAIR  EQU   CVTS01+384                                               00467000
CVTPERFM EQU   CVTS01+380                                               00468000
CVT044R2 EQU   CVTS01+376                                               00469000
CVTFETCH EQU   CVTS01+372                                               00470000
CVTRSTWD EQU   CVTS01+368                                               00471000
CVTSPOST EQU   CVTS01+364                                               00472000
CVTIOBP  EQU   CVTS01+360                                               00473000
CVTASMVT EQU   CVTS01+356                                               00474000
CVTRECRQ EQU   CVTS01+352                                               00475000
CVTWSAC  EQU   CVTS01+348                                               00476000
CVTRV149 EQU   CVTS01+344                                               00477000
CVTWSAL  EQU   CVTS01+340                                               00478000
CVTSPSA  EQU   CVTS01+336                                               00479000
CVTGLMN  EQU   CVTS01+332                                               00480000
CVTVEAC0 EQU   CVTS01+328                                               00481000
CVT062R1 EQU   CVTS01+324                                               00482000
CVTRPOST EQU   CVTS01+320                                               00483000
CVTDQIQE EQU   CVTS01+316                                               00484000
CVTCSD   EQU   CVTS01+312                                               00485000
CVTLKRMA EQU   CVTS01+308                                               00486000
CVTRSPIE EQU   CVTS01+304                                               00487000
CVTRENQ  EQU   CVTS01+300                                               00488000
CVTLQCB  EQU   CVTS01+296                                               00489000
CVTFQCB  EQU   CVTS01+292                                               00490000
CVTQCS01 EQU   CVTS01+288                                               00491000
CVTAPFT  EQU   CVTS01+284                                               00492000
CVTPARRL EQU   CVTS01+280                                               00493000
CVTVWAIT EQU   CVTS01+276                                               00494000
CVTGSPL  EQU   CVTS01+272                                               00495000
CVTGSMQ  EQU   CVTS01+264                                               00496000
CVTEXPRO EQU   CVTS01+260                                               00497000
CVTOPCTP EQU   CVTS01+256                                               00498000
CVTSIC   EQU   CVTS01+252                                               00499000
CVTTPIOS EQU   CVTS01+248                                               00500000
CVTRTMS  EQU   CVTS01+244                                               00501000
CVTSDBF  EQU   CVTS01+240                                               00502000
CVTSCBP  EQU   CVTS01+236                                               00503000
CVTSDMP  EQU   CVTS01+232                                               00504000
CVTSV60  EQU   CVTS01+228                                               00505000
CVTRTMCT EQU   CVTS01+224                                               00506000
CVTASCBL EQU   CVTS01+220                                               00507000
CVTASCBH EQU   CVTS01+216                                               00508000
CVTGDA   EQU   CVTS01+212                                               00509000
CVTASVT  EQU   CVTS01+208                                               00510000
CVTVVMDI EQU   CVTS01+204                                               00511000
CVTAQTOP EQU   CVTS01+200                                               00512000
CVTIOSCS EQU   CVTS01+196                                               00513000
CVTSDRM  EQU   CVTS01+192                                               00514000
CVTOPTE  EQU   CVTS01+188                                               00515000
CVTSTXU  EQU   CVTS01+184                                               00516000
CVTQUIS  EQU   CVTS01+180                                               00517000
CVTPARS  EQU   CVTS01+176                                               00518000
CVTS1EE  EQU   CVTS01+172                                               00519000
CVTFRAS  EQU   CVTS01+168                                               00520000
CVTQSAS  EQU   CVTS01+164                                               00521000
CVTCRAS  EQU   CVTS01+160                                               00522000
CVTCRMN  EQU   CVTS01+156                                               00523000
CVTDELCP EQU   CVTS01+152                                               00524000
CVTFRECL EQU   CVTS01+148                                               00525000
CVTGETCL EQU   CVTS01+144                                               00526000
CVTBLDCP EQU   CVTS01+140                                               00527000
CVTAUTHL EQU   CVTS01+136                                               00528000
CVTSCAN  EQU   CVTS01+132                                               00529000
CVTRV144 EQU   CVTS01+130                                               00530000
CVTMAXMP EQU   CVTS01+128                                               00531000
CVTSTCK  EQU   CVTS01+124                                               00532000
CVTRV139 EQU   CVTS01+123                                               00533000
CVTDSSAC EQU   CVTS01+122                                               00534000
CVTRV513 EQU   CVTS01+121                                               00535000
CVTIOSPL EQU   CVTS01+120                                               00536000
CVTPTGT  EQU   CVTS01+116                                               00537000
CVTCSPIE EQU   CVTS01+112                                               00538000
CVTSMFEX EQU   CVTS01+108                                               00539000
CVTOLT0A EQU   CVTS01+104                                               00540000
CVTSRBRT EQU   CVTS01+100                                               00541000
CVTPUTL  EQU   CVTS01+96                                                00542000
CVTASCRL EQU   CVTS01+92                                                00543000
CVTASCRF EQU   CVTS01+88                                                00544000
CVTRV326 EQU   CVTS01+84                                                00545000
CVTRV325 EQU   CVTS01+80                                                00546000
CVTRV324 EQU   CVTS01+76                                                00547000
CVT0VL01 EQU   CVTS01+72                                                00548000
CVTSHRVM EQU   CVTS01+68                                                00549000
CVTRV332 EQU   CVTS01+64                                                00550000
CVTTAS   EQU   CVTS01+60                                                00551000
CVTRSCN  EQU   CVTS01+56                                                00552000
CVTTRAC2 EQU   CVTS01+54                                                00553000
CVTTRACE EQU   CVTS01+52                                                00554000
CVTAPG   EQU   CVTS01+51                                                00555000
CVTSDTRC EQU   CVTCTLFG                                                 00556000
CVTGTRCE EQU   CVTCTLFG                                                 00557000
CVTNOMP  EQU   CVTCTLFG                                                 00558000
CVTRSV79 EQU   CVTCTLFG                                                 00559000
CVTDSTAT EQU   CVTCTLFG                                                 00560000
CVTRSV78 EQU   CVTCTLFG                                                 00561000
CVTRV333 EQU   CVTCTLFG                                                 00562000
CVTRV323 EQU   CVTCTLFG                                                 00563000
CVTSPVLK EQU   CVTS01+49                                                00564000
CVTRSV77 EQU   CVTS01+48                                                00565000
CVTRV331 EQU   CVTS01+44                                                00566000
CVTRV330 EQU   CVTS01+40                                                00567000
CVTRV329 EQU   CVTS01+36                                                00568000
CVTRV328 EQU   CVTS01+32                                                00569000
CVTRV322 EQU   CVTS01+28                                                00570000
CVTSLID  EQU   CVTSLIDA+1                                               00571000
CVTSYLK  EQU   CVTSLIDA                                                 00572000
CVTRV321 EQU   CVTS01+20                                                00573000
CVTRV320 EQU   CVTS01+16                                                00574000
CVTLPDIR EQU   CVTLPDIA+1                                               00575000
CVTRSV69 EQU   CVTDIRST                                                 00576000
CVTRSV68 EQU   CVTDIRST                                                 00577000
CVTRSV67 EQU   CVTDIRST                                                 00578000
CVTRSV66 EQU   CVTDIRST                                                 00579000
CVTRSV65 EQU   CVTDIRST                                                 00580000
CVTRSV64 EQU   CVTDIRST                                                 00581000
CVTRSV63 EQU   CVTDIRST                                                 00582000
CVTDICOM EQU   CVTDIRST                                                 00583000
CVTPVTP  EQU   CVTS01+8                                                 00584000
CVTLPDSR EQU   CVTS01+4                                                 00585000
CVTGETL  EQU   CVTS01                                                   00586000
PSARSAV  EQU   PSARSVTE+60                                              00587000
PSARSTK  EQU   PSARSVTE+56                                              00588000
PSAESAV3 EQU   PSARSVTE+52                                              00589000
PSAESTK3 EQU   PSARSVTE+48                                              00590000
PSAESAV2 EQU   PSARSVTE+44                                              00591000
PSAESTK2 EQU   PSARSVTE+40                                              00592000
PSAESAV1 EQU   PSARSVTE+36                                              00593000
PSAESTK1 EQU   PSARSVTE+32                                              00594000
PSAPSAV  EQU   PSARSVTE+28                                              00595000
PSAPSTK  EQU   PSARSVTE+24                                              00596000
PSAMSAV  EQU   PSARSVTE+20                                              00597000
PSAMSTK  EQU   PSARSVTE+16                                              00598000
PSASSAV  EQU   PSARSVTE+12                                              00599000
PSASSTK  EQU   PSARSVTE+8                                               00600000
PSANSTK  EQU   PSARSVTE+4                                               00601000
PSACSTK  EQU   PSARSVTE                                                 00602000
CVTLEVL  EQU   CVTRELNO+2                                               00603000
CVTNUMB  EQU   CVTRELNO                                                 00604000
CVTMDL   EQU   CVTFIX+250                                               00605000
@NM00055 EQU   CVTFIX+248                                               00606000
@NM00054 EQU   CVTFIX                                                   00607000
CVTRV482 EQU   CVTXTNT2+128                                             00608000
CVTRV481 EQU   CVTXTNT2+124                                             00609000
CVTRV480 EQU   CVTXTNT2+120                                             00610000
CVTRV479 EQU   CVTXTNT2+118                                             00611000
CVTRV478 EQU   CVTXTNT2+117                                             00612000
CVTRV477 EQU   CVTXTNT2+116                                             00613000
CVTRV476 EQU   CVTXTNT2+115                                             00614000
CVTRV475 EQU   CVTXTNT2+114                                             00615000
CVTRV474 EQU   CVTRV466                                                 00616000
CVTRV473 EQU   CVTRV466                                                 00617000
CVTRV472 EQU   CVTRV466                                                 00618000
CVTRV471 EQU   CVTRV466                                                 00619000
CVTRV470 EQU   CVTRV466                                                 00620000
CVTRV469 EQU   CVTRV466                                                 00621000
CVTRV468 EQU   CVTRV466                                                 00622000
CVTRV467 EQU   CVTRV466                                                 00623000
CVTRV465 EQU   CVTRV457                                                 00624000
CVTRV464 EQU   CVTRV457                                                 00625000
CVTRV463 EQU   CVTRV457                                                 00626000
CVTRV462 EQU   CVTRV457                                                 00627000
CVTRV461 EQU   CVTRV457                                                 00628000
CVTRV460 EQU   CVTRV457                                                 00629000
CVTRV459 EQU   CVTRV457                                                 00630000
CVTRV458 EQU   CVTRV457                                                 00631000
CVTRV456 EQU   CVTXTNT2+108                                             00632000
CVTRV455 EQU   CVTXTNT2+104                                             00633000
CVTRV454 EQU   CVTXTNT2+100                                             00634000
CVTRV453 EQU   CVTXTNT2+96                                              00635000
CVTRV452 EQU   CVTXTNT2+94                                              00636000
CVTRV451 EQU   CVTXTNT2+92                                              00637000
CVTRV450 EQU   CVTXTNT2+90                                              00638000
CVTRV449 EQU   CVTXTNT2+88                                              00639000
CVTRV448 EQU   CVTXTNT2+87                                              00640000
CVTRV447 EQU   CVTXTNT2+86                                              00641000
CVTRV446 EQU   CVTRV438                                                 00642000
CVTRV445 EQU   CVTRV438                                                 00643000
CVTRV444 EQU   CVTRV438                                                 00644000
CVTRV443 EQU   CVTRV438                                                 00645000
CVTRV442 EQU   CVTRV438                                                 00646000
CVTRV441 EQU   CVTRV438                                                 00647000
CVTRV440 EQU   CVTRV438                                                 00648000
CVTRV439 EQU   CVTRV438                                                 00649000
CVTRV437 EQU   CVTRV429                                                 00650000
CVTRV436 EQU   CVTRV429                                                 00651000
CVTRV435 EQU   CVTRV429                                                 00652000
CVTRV434 EQU   CVTRV429                                                 00653000
CVTRV433 EQU   CVTRV429                                                 00654000
CVTRV432 EQU   CVTRV429                                                 00655000
CVTRV431 EQU   CVTRV429                                                 00656000
CVTRV430 EQU   CVTRV429                                                 00657000
CVTRV428 EQU   CVTXTNT2+80                                              00658000
CVTRV427 EQU   CVTXTNT2+76                                              00659000
CVTRV426 EQU   CVTXTNT2+72                                              00660000
CVTRV425 EQU   CVTXTNT2+68                                              00661000
CVTATACT EQU   CVTATCVT                                                 00662000
CVTRV423 EQU   CVTXTNT2+62                                              00663000
CVTRV422 EQU   CVTXTNT2+60                                              00664000
CVTRV421 EQU   CVTXTNT2+58                                              00665000
CVTRV420 EQU   CVTXTNT2+56                                              00666000
CVTRV419 EQU   CVTXTNT2+55                                              00667000
CVTRV418 EQU   CVTXTNT2+54                                              00668000
CVTRV417 EQU   CVTRV409                                                 00669000
CVTRV416 EQU   CVTRV409                                                 00670000
CVTRV415 EQU   CVTRV409                                                 00671000
CVTRV414 EQU   CVTRV409                                                 00672000
CVTRV413 EQU   CVTRV409                                                 00673000
CVTRV412 EQU   CVTRV409                                                 00674000
CVTRV411 EQU   CVTRV409                                                 00675000
CVTRV410 EQU   CVTRV409                                                 00676000
CVTRV408 EQU   CVTRV400                                                 00677000
CVTRV407 EQU   CVTRV400                                                 00678000
CVTRV406 EQU   CVTRV400                                                 00679000
CVTRV405 EQU   CVTRV400                                                 00680000
CVTRV404 EQU   CVTRV400                                                 00681000
CVTRV403 EQU   CVTRV400                                                 00682000
CVTRV402 EQU   CVTRV400                                                 00683000
CVTRV401 EQU   CVTRV400                                                 00684000
CVTICB   EQU   CVTXTNT2+48                                              00685000
CVTSKTA  EQU   CVTXTNT2+44                                              00686000
CVTSHSB  EQU   CVTSHS                                                   00687000
CVTRSV98 EQU   CVTXTNT2+36                                              00688000
CVTRSV97 EQU   CVTXTNT2+34                                              00689000
CVTRSV96 EQU   CVTXTNT2+32                                              00690000
CVTOLTEP EQU   CVTXTNT2+28                                              00691000
CVTQIDA  EQU   CVTQID+1                                                 00692000
CVTRSV95 EQU   CVTQID                                                   00693000
CVTRSV94 EQU   CVTXTNT2+20                                              00694000
CVTRSV93 EQU   CVTXTNT2+16                                              00695000
CVTRSV92 EQU   CVTXTNT2+12                                              00696000
CVTDEBVR EQU   CVTXTNT2+8                                               00697000
CVTRSV91 EQU   CVTXTNT2+6                                               00698000
CVTRSV9H EQU   CVTFLGBT                                                 00699000
CVTRSV9G EQU   CVTFLGBT                                                 00700000
CVTRSV9F EQU   CVTFLGBT                                                 00701000
CVTRSV9E EQU   CVTFLGBT                                                 00702000
CVTRSV9D EQU   CVTFLGBT                                                 00703000
CVTRSV9C EQU   CVTFLGBT                                                 00704000
CVTVME   EQU   CVTFLGBT                                                 00705000
CVTNPE   EQU   CVTFLGBT                                                 00706000
CVTNUCLS EQU   CVTXTNT2+4                                               00707000
CVTDSSVA EQU   CVTDSSV+1                                                00708000
CVTRSV89 EQU   CVTDSSV                                                  00709000
CVTRSV88 EQU   CVTXTNT1+8                                               00710000
CVTRSV87 EQU   CVTXTNT1+4                                               00711000
CVTFACHN EQU   CVTXTNT1                                                 00712000
CVTRV488 EQU   CVTMAP+412                                               00713000
CVTRV487 EQU   CVTMAP+408                                               00714000
CVTRV486 EQU   CVTMAP+404                                               00715000
CVTRV485 EQU   CVTMAP+400                                               00716000
CVTACTAP EQU   CVTMAP+396                                               00717000
CVTAUTH  EQU   CVTMAP+392                                               00718000
CVTATMCA EQU   CVTATMCT+1                                               00719000
CVTATMST EQU   CVTATMCT                                                 00720000
CVTRSV61 EQU   CVTMAP+384                                               00721000
CVTVOLT1 EQU   CVTVOLM1+1                                               00722000
CVTVOLI1 EQU   CVTVOLF1                                                 00723000
CVTSTOA  EQU   CVTMAP+376                                               00724000
CVTRSV58 EQU   CVTMAP+374                                               00725000
CVTRSV57 EQU   CVTMAP+372                                               00726000
CVTDDCE  EQU   CVTMAP+368                                               00727000
CVTPNWFR EQU   CVTMAP+364                                               00728000
CVTSMF   EQU   CVTMAP+360                                               00729000
CVTSULK  EQU   CVTMAP+358                                               00730000
CVTSLKO  EQU   CVTSYSK                                                  00731000
CVTSLKP  EQU   CVTSYSK                                                  00732000
CVTSLKQ  EQU   CVTSYSK                                                  00733000
CVTSLKR  EQU   CVTSYSK                                                  00734000
CVTRSV56 EQU   CVTSYSK                                                  00735000
CVTRSV55 EQU   CVTSYSK                                                  00736000
CVTRSV54 EQU   CVTSYSK                                                  00737000
CVTRSV53 EQU   CVTSYSK                                                  00738000
CVTRSV52 EQU   CVTA1F1                                                  00739000
CVTRSV51 EQU   CVTA1F1                                                  00740000
CVTRSV50 EQU   CVTA1F1                                                  00741000
CVTRSV49 EQU   CVTA1F1                                                  00742000
CVTRSV48 EQU   CVTA1F1                                                  00743000
CVTRSV47 EQU   CVTA1F1                                                  00744000
CVTSRSW  EQU   CVTA1F1                                                  00745000
CVTPFSW  EQU   CVTA1F1                                                  00746000
CVTPCVT  EQU   CVTMAP+352                                               00747000
CVTRSV46 EQU   CVTMAP+344                                               00748000
CVTRSV45 EQU   CVTMAP+340                                               00749000
CVTRSV44 EQU   CVTMAP+338                                               00750000
CVTRSV43 EQU   CVTMAP+336                                               00751000
CVTHJESA EQU   CVTHJES+1                                                00752000
CVTRSV42 EQU   CVTHJES                                                  00753000
CVTEXT2A EQU   CVTEXT2+1                                                00754000
CVTRSV41 EQU   CVTEXT2                                                  00755000
CVTAPFA  EQU   CVTAPF+1                                                 00756000
CVTRSV40 EQU   CVTAPF                                                   00757000
CVTRV518 EQU   CVTINTLA                                                 00758000
CVTRV517 EQU   CVTERPV                                                  00759000
CVTEORM  EQU   CVTMAP+312                                               00760000
CVTMCHPR EQU   CVTMAP+308                                               00761000
CVTTZ    EQU   CVTMAP+304                                               00762000
CVTJEPS  EQU   CVTMAP+300                                               00763000
CVTJESCT EQU   CVTMAP+296                                               00764000
CVTMODE  EQU   CVTMAP+292                                               00765000
CVTPTRV  EQU   CVTMAP+288                                               00766000
CVTREAL  EQU   CVTMAP+284                                               00767000
CVTRSV39 EQU   CVTMAP+280                                               00768000
CVTRSV38 EQU   CVTMAP+276                                               00769000
CVTDMSRA EQU   CVTDMSR+1                                                00770000
CVTRV634 EQU   CVTDMSRF                                                 00771000
CVTRV633 EQU   CVTDMSRF                                                 00772000
CVTRV632 EQU   CVTDMSRF                                                 00773000
CVTRV631 EQU   CVTDMSRF                                                 00774000
CVTRV630 EQU   CVTDMSRF                                                 00775000
CVTRV629 EQU   CVTDMSRF                                                 00776000
CVTUDUMP EQU   CVTDMSRF                                                 00777000
CVTSDUMP EQU   CVTDMSRF                                                 00778000
CVTQMSGA EQU   CVTQMSG+1                                                00779000
CVTRSV36 EQU   CVTQMSG                                                  00780000
CVTAMFF  EQU   CVTMAP+264                                               00781000
CVTPURGA EQU   CVTPURG+1                                                00782000
CVTRSV35 EQU   CVTPURG                                                  00783000
CVTCBSP  EQU   CVTMAP+256                                               00784000
CVTATERA EQU   CVTATER+1                                                00785000
CVTSYST  EQU   CVTATER                                                  00786000
CVTVOLT2 EQU   CVTTAT                                                   00787000
CVTVOLI2 EQU   CVTVOLF2                                                 00788000
CVTAQAVB EQU   CVTAQAVT+1                                               00789000
CVTRSV34 EQU   CVTTCMFG                                                 00790000
CVTRSV33 EQU   CVTTCMFG                                                 00791000
CVTRSV32 EQU   CVTTCMFG                                                 00792000
CVTRSV31 EQU   CVTTCMFG                                                 00793000
CVTRSV30 EQU   CVTTCMFG                                                 00794000
CVTRSV29 EQU   CVTTCMFG                                                 00795000
CVTRSV28 EQU   CVTTCMFG                                                 00796000
CVTTCRDY EQU   CVTTCMFG                                                 00797000
CVTGTFA  EQU   CVTGTF+1                                                 00798000
CVTRSV27 EQU   CVTGTFST                                                 00799000
CVTRNIO  EQU   CVTGTFST                                                 00800000
CVTUSR   EQU   CVTGTFST                                                 00801000
CVTRV318 EQU   CVTFORM                                                  00802000
CVTRV317 EQU   CVTTMODE                                                 00803000
CVTRV316 EQU   CVTSTATE                                                 00804000
CVTRV315 EQU   CVTGTFS                                                  00805000
CVTGTFAV EQU   CVTGTFS                                                  00806000
CVT0SCR1 EQU   CVTMAP+232                                               00807000
CVTRV515 EQU   CVTMAP+228                                               00808000
CVTRMS   EQU   CVTMAP+224                                               00809000
CVTPATCH EQU   CVTMAP+220                                               00810000
CVTTSCE  EQU   CVTMAP+216                                               00811000
CVTLNKSC EQU   CVTMAP+214                                               00812000
CVTQABST EQU   CVTMAP+212                                               00813000
CVTMDLDS EQU   CVTMAP+208                                               00814000
CVTUSER  EQU   CVTMAP+204                                               00815000
CVTABEND EQU   CVTMAP+200                                               00816000
CVTSMCA  EQU   CVTMAP+196                                               00817000
CVTRSV18 EQU   CVTMAP+192                                               00818000
CVTQLPAQ EQU   CVTMAP+188                                               00819000
CVTQCDSR EQU   CVTMAP+184                                               00820000
CVTRSV17 EQU   CVTOPTB                                                  00821000
CVTRSV16 EQU   CVTOPTB                                                  00822000
CVTFP    EQU   CVTOPTB                                                  00823000
CVTAPTHR EQU   CVTOPTB                                                  00824000
CVTNLOG  EQU   CVTOPTB                                                  00825000
CVTTOD   EQU   CVTOPTB                                                  00826000
CVTCTIMS EQU   CVTOPTB                                                  00827000
CVTPROT  EQU   CVTOPTB                                                  00828000
CVTXPFP  EQU   CVTOPTA                                                  00829000
CVTASCII EQU   CVTOPTA                                                  00830000
CVTRSV13 EQU   CVTOPTA                                                  00831000
CVTRSV12 EQU   CVTOPTA                                                  00832000
CVTNIP   EQU   CVTOPTA                                                  00833000
CVTDDR   EQU   CVTOPTA                                                  00834000
CVTAPR   EQU   CVTOPTA                                                  00835000
CVTCCH   EQU   CVTOPTA                                                  00836000
CVTSNCTR EQU   CVTMAP+180                                               00837000
CVTQMWR  EQU   CVTMAP+176                                               00838000
CVTQOCR  EQU   CVTMAP+172                                               00839000
CVT1EF00 EQU   CVTMAP+168                                               00840000
CVTMZ00  EQU   CVTMAP+164                                               00841000
CVTHEAD  EQU   CVTMAP+160                                               00842000
CVTRSV11 EQU   CVTMAP+156                                               00843000
CVT0PT01 EQU   CVTMAP+152                                               00844000
CVTMSER  EQU   CVTMAP+148                                               00845000
CVTRV516 EQU   CVTIERLC                                                 00846000
CVTILCH  EQU   CVTMAP+140                                               00847000
CVT0DS   EQU   CVTMAP+136                                               00848000
CVTFBOSV EQU   CVTMAP+132                                               00849000
CVTNUCB  EQU   CVTMAP+128                                               00850000
CVTIXAVL EQU   CVTMAP+124                                               00851000
CVTIOQET EQU   CVTMAP+120                                               00852000
CVTDCBA  EQU   CVTMAP+117                                               00853000
CVTMVS2  EQU   CVTDCB                                                   00854000
CVT6DAT  EQU   CVTDCB                                                   00855000
CVT4MPS  EQU   CVTDCB                                                   00856000
CVTRSV09 EQU   CVTDCB                                                   00857000
CVT4MS1  EQU   CVTDCB                                                   00858000
CVT2SPS  EQU   CVTDCB                                                   00859000
CVT1SSS  EQU   CVTDCB                                                   00860000
CVTRSV08 EQU   CVTDCB                                                   00861000
CVTSTB   EQU   CVTMAP+112                                               00862000
CVTQTD00 EQU   CVTMAP+108                                               00863000
CVTQTE00 EQU   CVTMAP+104                                               00864000
CVTCUCB  EQU   CVTMAP+100                                               00865000
CVTSJQ   EQU   CVTMAP+96                                                00866000
CVTPBLDL EQU   CVTMAP+92                                                00867000
CVTTPC   EQU   CVTMAP+88                                                00868000
CVTSVDCB EQU   CVTMAP+84                                                00869000
CVTBRET  EQU   CVTMAP+82                                                00870000
CVTEXIT  EQU   CVTMAP+80                                                00871000
CVT0FN00 EQU   CVTMAP+76                                                00872000
CVTDARA  EQU   CVTDAR+1                                                 00873000
CVTRSV07 EQU   CVTFLGS1                                                 00874000
CVTRSV06 EQU   CVTFLGS1                                                 00875000
CVTRSV05 EQU   CVTFLGS1                                                 00876000
CVTRSV04 EQU   CVTFLGS1                                                 00877000
CVTRSV03 EQU   CVTFLGS1                                                 00878000
CVTRSV02 EQU   CVTFLGS1                                                 00879000
CVTRSV01 EQU   CVTFLGS1                                                 00880000
CVTDMPLK EQU   CVTFLGS1                                                 00881000
CVTXITP  EQU   CVTMAP+68                                                00882000
CVTZDTAB EQU   CVTMAP+64                                                00883000
CVTMSLT  EQU   CVTMAP+60                                                00884000
CVTDATE  EQU   CVTMAP+56                                                00885000
CVTBTERM EQU   CVTMAP+52                                                00886000
CVTSYSAD EQU   CVTMAP+48                                                00887000
CVTXTLER EQU   CVTMAP+44                                                00888000
CVTILK2  EQU   CVTMAP+40                                                00889000
CVTILK1  EQU   CVTMAP+36                                                00890000
CVTPRLTV EQU   CVTMAP+32                                                00891000
CVTPCNVT EQU   CVTMAP+28                                                00892000
CVT0VL00 EQU   CVTMAP+24                                                00893000
CVTXAPG  EQU   CVTMAP+20                                                00894000
CVTBUF   EQU   CVTMAP+16                                                00895000
CVTJOB   EQU   CVTMAP+12                                                00896000
CVTLINK  EQU   CVTMAP+8                                                 00897000
CVT0EF00 EQU   CVTMAP+4                                                 00898000
CVTTCBP  EQU   CVTMAP                                                   00899000
CVT      EQU   CVTMAP                                                   00900000
@NM00029 EQU   SRBSECT+40                                               00901000
@NM00028 EQU   SRBSECT+38                                               00902000
SRBPRIOR EQU   SRBSECT+37                                               00903000
SRBPKF   EQU   SRBSECT+36                                               00904000
SRBSAVE  EQU   SRBSECT+32                                               00905000
SRBPARM  EQU   SRBSECT+28                                               00906000
SRBRMTR  EQU   SRBSECT+24                                               00907000
SRBEP    EQU   SRBSECT+20                                               00908000
SRBPTCB  EQU   SRBFLC+4                                                 00909000
SRBPASID EQU   SRBFLC+2                                                 00910000
SRBCPAFF EQU   SRBFLC                                                   00911000
SRBASCB  EQU   SRBSECT+8                                                00912000
SRBID    EQU   SRBSECT                                                  00913000
TVWAEND  EQU   TVWA+216                                                 00914000
@NM00027 EQU   TVWA+208                                                 00915000
TVWAUSRA EQU   TVWA+200                                                 00916000
@NM00026 EQU   TVWA+192                                                 00917000
TVWAFRWO EQU   TVWA+188                                                 00918000
TVWAFRWI EQU   TVWA+184                                                 00919000
TVWARSHW EQU   TVWA+183                                                 00920000
@NM00025 EQU   TVWAFLG6                                                 00921000
TVWAINB  EQU   TVWAFLG6                                                 00922000
TVWAFMEW EQU   TVWAFLG6                                                 00923000
TVWARCDT EQU   TVWAFLG6                                                 00924000
TVWAIOP  EQU   TVWAFLG6                                                 00925000
TVWAIOTR EQU   TVWAFLG6                                                 00926000
TVWAISYS EQU   TVWAFLG6                                                 00927000
@NM00024 EQU   TVWA+180                                                 00928000
TVWAQMLB EQU   TVWA+176                                                 00929000
TVWAATBO EQU   TVWA+172                                                 00930000
TVWAATBI EQU   TVWA+168                                                 00931000
TVWATRNM EQU   TVWA+160                                                 00932000
TVWATABO EQU   TVWA+156                                                 00933000
TVWATABI EQU   TVWA+152                                                 00934000
TVWALNCT EQU   TVWA+151                                                 00935000
TVWAP1ST EQU   TVWAFLG5                                                 00936000
TVWAPRMT EQU   TVWAFLG5                                                 00937000
TVWANFSP EQU   TVWAFLG5                                                 00938000
TVWATIR  EQU   TVWAFLG5                                                 00939000
TVWAFSW  EQU   TVWAFLG5                                                 00940000
TVWAWO   EQU   TVWAFLG5                                                 00941000
TVWAFSM  EQU   TVWAFLG5                                                 00942000
TVWASCAN EQU   TVWAFLG5                                                 00943000
@NM00023 EQU   TVWA+148                                                 00944000
TVWADARC EQU   TVWAFLG4                                                 00945000
TVWARCRS EQU   TVWAFLG4                                                 00946000
TVWAQMEV EQU   TVWAFLG4                                                 00947000
TVWAFLSC EQU   TVWAFLG4                                                 00948000
TVWANOFB EQU   TVWAFLG4                                                 00949000
TVWAKBDL EQU   TVWAFLG4                                                 00950000
TVWADOOQ EQU   TVWAFLG4                                                 00951000
TVWAFMSC EQU   TVWAFLG4                                                 00952000
TVWATRDF EQU   TVWAFLG3                                                 00953000
TVWATRAN EQU   TVWAFLG3                                                 00954000
TVWAQLBU EQU   TVWAFLG3                                                 00955000
TVWAQMIO EQU   TVWAFLG3                                                 00956000
TVWAQMRT EQU   TVWAFLG3                                                 00957000
TVWAAIGN EQU   TVWAFLG3                                                 00958000
TVWASDSG EQU   TVWAFLG3                                                 00959000
TVWABRIN EQU   TVWAFLG3                                                 00960000
TVWABIR  EQU   TVWAFLG2                                                 00961000
TVWARTRY EQU   TVWAFLG2                                                 00962000
TVWABKMG EQU   TVWAFLG2                                                 00963000
TVWAERMG EQU   TVWAFLG2                                                 00964000
TVWAGERR EQU   TVWAFLG2                                                 00965000
TVWASCD  EQU   TVWAFLG2                                                 00966000
TVWAPGN  EQU   TVWAFLG2                                                 00967000
TVWABFC  EQU   TVWAFLG2                                                 00968000
TVWAOOPS EQU   TVWAFLG1                                                 00969000
TVWALTE  EQU   TVWAFLG1                                                 00970000
TVWAULK  EQU   TVWAFLG1                                                 00971000
TVWAXSCD EQU   TVWAFLG1                                                 00972000
TVWATID  EQU   TVWAFLG1                                                 00973000
TVWATOD  EQU   TVWAFLG1                                                 00974000
TVWADIN3 EQU   TVWADLST+8                                               00975000
TVWADIN2 EQU   TVWADLST+4                                               00976000
TVWADIN1 EQU   TVWADLST                                                 00977000
TVWAECB3 EQU   TVWAECBL+8                                               00978000
TVWAECB2 EQU   TVWAECBL+4                                               00979000
TVWAECB1 EQU   TVWAECBL                                                 00980000
TVWATECB EQU   TVWA+116                                                 00981000
TVWAECB  EQU   TVWA+112                                                 00982000
TVWALNSV EQU   TVWA+111                                                 00983000
@NM00022 EQU   TVWAFLG7                                                 00984000
TVWACHSE EQU   TVWAFLG7                                                 00985000
TVWATOBB EQU   TVWAFLG7                                                 00986000
TVWARISW EQU   TVWAFLG7                                                 00987000
TVWARET  EQU   TVWAFLG7                                                 00988000
TVWARDBF EQU   TVWAFLG7                                                 00989000
TVWASND1 EQU   TVWAFLG7                                                 00990000
TVWABKPG EQU   TVWAFLG7                                                 00991000
TVWAVSZ  EQU   TVWA+108                                                 00992000
TVWAVST  EQU   TVWA+104                                                 00993000
TVWAEXL  EQU   TVWA+100                                                 00994000
TVWARPL  EQU   TVWA+96                                                  00995000
TVWANIB  EQU   TVWA+92                                                  00996000
TVWAACB  EQU   TVWA+88                                                  00997000
TVWATQL2 EQU   TVWA+87                                                  00998000
TVWATQL1 EQU   TVWA+86                                                  00999000
TVWAATTN EQU   TVWA+85                                                  01000000
TVWACHNL EQU   TVWA+84                                                  01001000
TVWALBUF EQU   TVWA+80                                                  01002000
TVWAHBUF EQU   TVWA+76                                                  01003000
TVWACLSZ EQU   TVWA+74                                                  01004000
TVWARTR  EQU   TVWA+72                                                  01005000
TVWAGMPT EQU   TVWA+68                                                  01006000
TVWATCB  EQU   TVWA+64                                                  01007000
TVWAUSMN EQU   TVWA+60                                                  01008000
TVWACPID EQU   TVWA+56                                                  01009000
TVWAEOQ  EQU   TVWA+52                                                  01010000
TVWANOM  EQU   TVWA+48                                                  01011000
TVWABOQ  EQU   TVWA+44                                                  01012000
TVWAEIQ  EQU   TVWA+40                                                  01013000
TVWANIM  EQU   TVWA+36                                                  01014000
TVWABIQ  EQU   TVWA+32                                                  01015000
TVWAQMWA EQU   TVWA+28                                                  01016000
TVWALLWA EQU   TVWA+24                                                  01017000
TVWABFPT EQU   TVWA+20                                                  01018000
TVWATOPQ EQU   TVWA+16                                                  01019000
TVWATOMW EQU   TVWA+12                                                  01020000
TVWATIMW EQU   TVWA+8                                                   01021000
TVWAPPL  EQU   TVWA                                                     01022000
TSBXEND  EQU   TSBX+120                                                 01023000
@NM00021 EQU   TSBX+116                                                 01024000
TSBXBIND EQU   TSBX+80                                                  01025000
TSBXRPL  EQU   TSBX+76                                                  01026000
TSBXTMBF EQU   TSBXTERM+2                                               01027000
@NM00020 EQU   TSBXTERM+1                                               01028000
TSBXTMTP EQU   TSBXTERM                                                 01029000
TSBXAIND EQU   TSBX+70                                                  01030000
TSBXRSZO EQU   TSBX+69                                                  01031000
TSBXRSZI EQU   TSBX+68                                                  01032000
TSBXLBUF EQU   TSBX+64                                                  01033000
TSBXCSAP EQU   TSBX+60                                                  01034000
TSBXSRBI EQU   TSBX+52                                                  01035000
@NM00019 EQU   TSBX+48                                                  01036000
TSBXTOM  EQU   TSBX+44                                                  01037000
TSBXTIM  EQU   TSBX+40                                                  01038000
@NM00018 EQU   TSBX+33                                                  01039000
@NM00017 EQU   TSBXFLG1                                                 01040000
TSBXWREC EQU   TSBXFLG1                                                 01041000
TSBXLOGF EQU   TSBXFLG1                                                 01042000
TSBXACTV EQU   TSBXFLG1                                                 01043000
TSBXASCI EQU   TSBXFLG1                                                 01044000
TSBXUID  EQU   TSBX+24                                                  01045000
@NM00016 EQU   TSBX+16                                                  01046000
@NM00015 EQU   TSBX+12                                                  01047000
TSBXECB  EQU   TSBX+8                                                   01048000
TSBXBCK  EQU   TSBX+4                                                   01049000
TSBXFWD  EQU   TSBX                                                     01050000
TSBEND   EQU   TSB+120                                                  01051000
TSBSF1   EQU   TSB+112                                                  01052000
TSBTRMID EQU   TSB+104                                                  01053000
TSBALTC  EQU   TSB+103                                                  01054000
TSBALTR  EQU   TSB+102                                                  01055000
TSBPRMC  EQU   TSB+101                                                  01056000
TSBPRMR  EQU   TSB+100                                                  01057000
TSBPSWD  EQU   TSB+88                                                   01058000
TSBLECB  EQU   TSBMINL                                                  01059000
TSBLINE  EQU   TSB+82                                                   01060000
TSBSTAX  EQU   TSB+81                                                   01061000
TSBATTNC EQU   TSB+80                                                   01062000
TSBF1V   EQU   TSBTPOST+7                                               01063000
TSBF1M   EQU   TSBTPOST+6                                               01064000
TSBF2V   EQU   TSBTPOST+5                                               01065000
TSBF2M   EQU   TSBTPOST+4                                               01066000
TSBFLAGV EQU   TSBTPOST+3                                               01067000
TSBFLAGM EQU   TSBTPOST+2                                               01068000
TSBSBASV EQU   TSBTPOST+1                                               01069000
@NM00014 EQU   TSBTPFLG                                                 01070000
@NM00013 EQU   TSBTPFLG                                                 01071000
@NM00012 EQU   TSBTPFLG                                                 01072000
@NM00011 EQU   TSBTPFLG                                                 01073000
TSBNEWID EQU   TSBTPFLG                                                 01074000
TSBTPAYI EQU   TSBTPFLG                                                 01075000
TSBTPQCB EQU   TSBTPFLG                                                 01076000
TSBPOSTO EQU   TSBTPFLG                                                 01077000
TSBLINKB EQU   TSBLINKA+1                                               01078000
TSBPRI   EQU   TSBLINKA                                                 01079000
TSBRQCB  EQU   TSBRCB                                                   01080000
TSBCTCB  EQU   TSB+60                                                   01081000
TSBERSDS EQU   TSB+56                                                   01082000
TSBAUTOI EQU   TSB+52                                                   01083000
TSBATNCC EQU   TSB+44                                                   01084000
TSBASRCE EQU   TSB+42                                                   01085000
TSBHLDL  EQU   TSBFLG4                                                  01086000
TSBGETBF EQU   TSBFLG4                                                  01087000
TSBCANC  EQU   TSBFLG4                                                  01088000
TSBHOLD  EQU   TSBFLG4                                                  01089000
TSBHUNG  EQU   TSBFLG4                                                  01090000
TSBOWAIT EQU   TSBFLG4                                                  01091000
TSBIWAIT EQU   TSBFLG4                                                  01092000
TSBOCAB  EQU   TSBFLG4                                                  01093000
TSBLNNO  EQU   TSB+40                                                   01094000
TSBATNTC EQU   TSB+38                                                   01095000
TSBATNLC EQU   TSB+36                                                   01096000
TSBCHDCC EQU   TSBSTCC+1                                                01097000
TSBLNDCC EQU   TSBSTCC                                                  01098000
TSBWTJID EQU   TSB+32                                                   01099000
TSBECB   EQU   TSB+28                                                   01100000
TSBC1050 EQU   TSBTERM2                                                 01101000
@NM00010 EQU   TSBTERM2                                                 01102000
@NM00009 EQU   TSBTERM2                                                 01103000
@NM00008 EQU   TSBTERM2                                                 01104000
@NM00007 EQU   TSBTERM2                                                 01105000
TSBCTWX  EQU   TSBTERM2                                                 01106000
@NM00006 EQU   TSBTERM2                                                 01107000
@NM00005 EQU   TSBTERM2                                                 01108000
@NM00004 EQU   TSBTERM1                                                 01109000
@NM00003 EQU   TSBTERM1                                                 01110000
@NM00002 EQU   TSBTERM1                                                 01111000
TSBC2741 EQU   TSBTERM1                                                 01112000
TSBC5041 EQU   TSBTERM1                                                 01113000
TSBCATTN EQU   TSBTERM1                                                 01114000
TSBCBRK  EQU   TSBTERM1                                                 01115000
TSBCIHBN EQU   TSBTERM1                                                 01116000
TSBVTAM  EQU   TSBFLG5                                                  01117000
TSBKEYS  EQU   TSBFLG5                                                  01118000
@NM00001 EQU   TSBFLG5                                                  01119000
TSBATMP  EQU   TSBFLG5                                                  01120000
TSBNFLOP EQU   TSBFLG3                                                  01121000
TSBNOBRK EQU   TSBFLG3                                                  01122000
TSBTPUT  EQU   TSBFLG3                                                  01123000
TSBAWOIP EQU   TSBFLG3                                                  01124000
TSBNBKSP EQU   TSBFLG3                                                  01125000
TSBTJMSG EQU   TSBFLG3                                                  01126000
TSBATTN  EQU   TSBFLG3                                                  01127000
TSBIBFP  EQU   TSB+21                                                   01128000
TSBNIBF  EQU   TSB+20                                                   01129000
TSBITBFP EQU   TSB+17                                                   01130000
TSBSATN2 EQU   TSBFLG2                                                  01131000
TSBSATN1 EQU   TSBFLG2                                                  01132000
TSBBRKIN EQU   TSBFLG2                                                  01133000
TSBBIPI  EQU   TSBFLG2                                                  01134000
TSBOBFP  EQU   TSB+13                                                   01135000
TSBNOBF  EQU   TSB+12                                                   01136000
TSBOTBFP EQU   TSB+9                                                    01137000
TSBLNSZ  EQU   TSB+8                                                    01138000
TSBWTCB  EQU   TSB+5                                                    01139000
TSBTJBF  EQU   TSBFLG1                                                  01140000
TSBTJIP  EQU   TSBFLG1                                                  01141000
TSBTJOW  EQU   TSBFLG1                                                  01142000
TSBIFLSH EQU   TSBFLG1                                                  01143000
TSBWOWIP EQU   TSBFLG1                                                  01144000
TSBOWIP  EQU   TSBFLG1                                                  01145000
TSBOFLSH EQU   TSBFLG1                                                  01146000
TSBANSR  EQU   TSBFLG1                                                  01147000
TSBASCB  EQU   TSBASCBA+1                                               01148000
TSBATNLD EQU   TSBSTAT                                                  01149000
TSB3270  EQU   TSBSTAT                                                  01150000
TSBDISC  EQU   TSBSTAT                                                  01151000
TSBITOFF EQU   TSBSTAT                                                  01152000
TSBNOBUF EQU   TSBSTAT                                                  01153000
TSBLWAIT EQU   TSBSTAT                                                  01154000
TSBINUSE EQU   TSBSTAT                                                  01155000
@NM00053 EQU   PSA+3668                                                 01156000
PSASTAK  EQU   PSA+3072                                                 01157000
@NM00052 EQU   PSA+1048                                                 01158000
PSAUSEND EQU   PSA+1048                                                 01159000
PSARV062 EQU   PSA+1044                                                 01160000
PSACDAL  EQU   PSA+1040                                                 01161000
PSAWTCOD EQU   PSA+1036                                                 01162000
PSAATCVT EQU   PSA+1032                                                 01163000
PSAPCPSW EQU   PSA+1024                                                 01164000
PSAPIR2  EQU   PSA+1020                                                 01165000
PSARV059 EQU   PSA+1018                                                 01166000
PSASVC13 EQU   PSA+1016                                                 01167000
PSALSFCC EQU   PSA+1012                                                 01168000
PSASFACC EQU   PSA+1008                                                 01169000
PSASTOP  EQU   PSA+992                                                  01170000
PSASTART EQU   PSA+976                                                  01171000
PSARSPSW EQU   PSA+968                                                  01172000
PSASRPSW EQU   PSA+960                                                  01173000
PSARV045 EQU   PSA+892                                                  01174000
PSARV044 EQU   PSA+888                                                  01175000
PSARV043 EQU   PSA+884                                                  01176000
PSARV042 EQU   PSA+880                                                  01177000
PSARV041 EQU   PSA+876                                                  01178000
PSARV040 EQU   PSA+872                                                  01179000
PSARV025 EQU   PSA+868                                                  01180000
PSADSSED EQU   PSA+868                                                  01181000
PSADSSPR EQU   PSA+864                                                  01182000
PSADSSFW EQU   PSA+860                                                  01183000
PSADSS14 EQU   PSA+856                                                  01184000
PSADSSPP EQU   PSA+848                                                  01185000
PSADSSRP EQU   PSA+840                                                  01186000
PSADSS05 EQU   PSADSSF4                                                 01187000
PSADSS10 EQU   PSADSSF4                                                 01188000
PSADSSVE EQU   PSADSSF4                                                 01189000
PSADSSDE EQU   PSADSSF4                                                 01190000
PSADSSC0 EQU   PSADSSF4                                                 01191000
PSADSSIE EQU   PSADSSF4                                                 01192000
PSADSS12 EQU   PSADSSF4                                                 01193000
PSADSSRC EQU   PSADSSF4                                                 01194000
PSARV057 EQU   PSADSSF3                                                 01195000
PSARV056 EQU   PSADSSF3                                                 01196000
PSARV055 EQU   PSADSSF3                                                 01197000
PSADSSMC EQU   PSADSSF3                                                 01198000
PSADSSRW EQU   PSADSSF3                                                 01199000
PSADSSNM EQU   PSADSSF3                                                 01200000
PSADSSES EQU   PSADSSF3                                                 01201000
PSADSSGP EQU   PSADSSF3                                                 01202000
PSADSSF2 EQU   PSADSSFL+1                                               01203000
PSADSSPI EQU   PSADSSF1                                                 01204000
PSADSSOI EQU   PSADSSF1                                                 01205000
PSADSSSP EQU   PSADSSF1                                                 01206000
PSADSSTP EQU   PSADSSF1                                                 01207000
PSADSSDW EQU   PSADSSF1                                                 01208000
PSADSSDD EQU   PSADSSF1                                                 01209000
PSADSSDM EQU   PSADSSF1                                                 01210000
PSADSSMV EQU   PSADSSF1                                                 01211000
PSADSSTS EQU   PSA+816                                                  01212000
PSADSSWK EQU   PSA+812                                                  01213000
PSADSSR3 EQU   PSA+808                                                  01214000
PSADSSR2 EQU   PSA+804                                                  01215000
PSADSSRS EQU   PSA+800                                                  01216000
PSASTOR  EQU   PSA+796                                                  01217000
PSACPUSA EQU   PSA+794                                                  01218000
PSAVSTAP EQU   PSA+792                                                  01219000
PSAWKVAP EQU   PSA+788                                                  01220000
PSAWKRAP EQU   PSA+784                                                  01221000
PSAMCHIC EQU   PSA+783                                                  01222000
PSARV061 EQU   PSA+782                                                  01223000
PSASYMSK EQU   PSA+781                                                  01224000
PSAMCHFL EQU   PSA+780                                                  01225000
PSACR0   EQU   PSA+776                                                  01226000
PSAPSWSV EQU   PSA+768                                                  01227000
PSALITA  EQU   PSA+764                                                  01228000
PSACLHS  EQU   PSAHLHI                                                  01229000
PSALKR15 EQU   PSALKSA+60                                               01230000
PSALKR14 EQU   PSALKSA+56                                               01231000
PSALKR13 EQU   PSALKSA+52                                               01232000
PSALKR12 EQU   PSALKSA+48                                               01233000
PSALKR11 EQU   PSALKSA+44                                               01234000
PSALKR10 EQU   PSALKSA+40                                               01235000
PSALKR9  EQU   PSALKSA+36                                               01236000
PSALKR8  EQU   PSALKSA+32                                               01237000
PSALKR7  EQU   PSALKSA+28                                               01238000
PSALKR6  EQU   PSALKSA+24                                               01239000
PSALKR5  EQU   PSALKSA+20                                               01240000
PSALKR4  EQU   PSALKSA+16                                               01241000
PSALKR3  EQU   PSALKSA+12                                               01242000
PSALKR2  EQU   PSALKSA+8                                                01243000
PSALKR1  EQU   PSALKSA+4                                                01244000
PSALKR0  EQU   PSALKSA                                                  01245000
PSARV023 EQU   PSACLHT+52                                               01246000
PSALOCAL EQU   PSACLHT+48                                               01247000
PSACMSL  EQU   PSACLHT+44                                               01248000
PSAOPTL  EQU   PSACLHT+40                                               01249000
PSATPACL EQU   PSACLHT+36                                               01250000
PSATPDNL EQU   PSACLHT+32                                               01251000
PSATPNCL EQU   PSACLHT+28                                               01252000
PSAIOSLL EQU   PSACLHT+24                                               01253000
PSAIOSUL EQU   PSACLHT+20                                               01254000
PSAIOSCL EQU   PSACLHT+16                                               01255000
PSAIOSSL EQU   PSACLHT+12                                               01256000
PSASALCL EQU   PSACLHT+8                                                01257000
PSAASML  EQU   PSACLHT+4                                                01258000
PSADISPL EQU   PSACLHT                                                  01259000
PSASRSA  EQU   PSA+636                                                  01260000
PSARV050 EQU   PSA+634                                                  01261000
PSADSSGO EQU   PSA+633                                                  01262000
PSARECUR EQU   PSA+632                                                  01263000
PSAHLHIS EQU   PSA+628                                                  01264000
PSAIPCSA EQU   PSA+624                                                  01265000
@NM00051 EQU   PSA+621                                                  01266000
PSAIPCDM EQU   PSA+620                                                  01267000
PSAIPCD  EQU   PSA+616                                                  01268000
@NM00050 EQU   PSA+613                                                  01269000
PSAIPCRM EQU   PSA+612                                                  01270000
PSAIPCR  EQU   PSA+608                                                  01271000
PSAMCHEX EQU   PSA+600                                                  01272000
PSAMPSW  EQU   PSA+592                                                  01273000
PSAEXPS2 EQU   PSA+584                                                  01274000
PSAEXPS1 EQU   PSA+576                                                  01275000
PSAPIREG EQU   PSA+572                                                  01276000
PSARSREG EQU   PSA+568                                                  01277000
PSAGPREG EQU   PSA+556                                                  01278000
PSARV022 EQU   PSASUP4                                                  01279000
PSARV021 EQU   PSASUP4                                                  01280000
PSARV020 EQU   PSASUP4                                                  01281000
PSARV019 EQU   PSASUP4                                                  01282000
PSARV018 EQU   PSASUP4                                                  01283000
PSARV017 EQU   PSASUP4                                                  01284000
PSARV016 EQU   PSASUP4                                                  01285000
PSARV015 EQU   PSASUP4                                                  01286000
PSARV014 EQU   PSASUP3                                                  01287000
PSARV013 EQU   PSASUP3                                                  01288000
PSARV012 EQU   PSASUP3                                                  01289000
PSARV011 EQU   PSASUP3                                                  01290000
PSASPR   EQU   PSASUP3                                                  01291000
PSAPSREG EQU   PSASUP3                                                  01292000
PSAPI2   EQU   PSASUP3                                                  01293000
PSAIOSUP EQU   PSASUP3                                                  01294000
PSALCR   EQU   PSASUP2                                                  01295000
PSARTM   EQU   PSASUP2                                                  01296000
PSAACR   EQU   PSASUP2                                                  01297000
PSAIPCE2 EQU   PSASUP2                                                  01298000
PSAIPCES EQU   PSASUP2                                                  01299000
PSAIPCEC EQU   PSASUP2                                                  01300000
PSAGTF   EQU   PSASUP2                                                  01301000
PSAIPCRI EQU   PSASUP2                                                  01302000
PSARV063 EQU   PSASUP1                                                  01303000
PSATCTL  EQU   PSASUP1                                                  01304000
PSADISP  EQU   PSASUP1                                                  01305000
PSALOCK  EQU   PSASUP1                                                  01306000
PSAPI    EQU   PSASUP1                                                  01307000
PSAEXT   EQU   PSASUP1                                                  01308000
PSASVC   EQU   PSASUP1                                                  01309000
PSAIO    EQU   PSASUP1                                                  01310000
PSAAOLD  EQU   PSA+548                                                  01311000
PSAANEW  EQU   PSA+544                                                  01312000
PSATOLD  EQU   PSA+540                                                  01313000
PSATNEW  EQU   PSA+536                                                  01314000
PSALCCAR EQU   PSA+532                                                  01315000
PSALCCAV EQU   PSA+528                                                  01316000
PSAPCCAR EQU   PSA+524                                                  01317000
PSAPCCAV EQU   PSA+520                                                  01318000
PSACPULA EQU   PSA+518                                                  01319000
PSACPUPA EQU   PSA+516                                                  01320000
PSAPSA   EQU   PSA+512                                                  01321000
FLCHDEND EQU   PSA+512                                                  01322000
FLCCRSAV EQU   FLCMCLA+280                                              01323000
FLCGRSAV EQU   FLCMCLA+216                                              01324000
FLCFPSAV EQU   FLCMCLA+184                                              01325000
FLCFLA   EQU   FLCMCLA+88                                               01326000
FLCRGNCD EQU   FLCMCLA+84                                               01327000
FLCFSAA  EQU   FLCFSA+1                                                 01328000
@NM00049 EQU   FLCFSA                                                   01329000
@NM00048 EQU   FLCMCLA+72                                               01330000
FLCMCIC  EQU   FLCMCLA+64                                               01331000
@NM00047 EQU   FLCMCLA+20                                               01332000
FLCIOAA  EQU   FLCIOA+1                                                 01333000
@NM00046 EQU   FLCIOA                                                   01334000
@NM00045 EQU   FLCMCLA+15                                               01335000
@NM00044 EQU   FLCMCLA+14                                               01336000
@NM00043 EQU   FLCMCLA+12                                               01337000
FLCLCL   EQU   FLCMCLA+8                                                01338000
FLCIOELA EQU   FLCIOEL+1                                                01339000
@NM00042 EQU   FLCIOEL                                                  01340000
FLCCHNID EQU   FLCMCLA                                                  01341000
@NM00041 EQU   PSA+160                                                  01342000
FLCMTRCD EQU   PSA+157                                                  01343000
@NM00040 EQU   PSA+156                                                  01344000
FLCPERA  EQU   FLCPER+1                                                 01345000
@NM00039 EQU   FLCPER                                                   01346000
@NM00038 EQU   PSA+151                                                  01347000
FLCPERCD EQU   PSA+150                                                  01348000
FLCMCNUM EQU   PSA+149                                                  01349000
@NM00037 EQU   PSA+148                                                  01350000
FLCTEAA  EQU   FLCTEA+1                                                 01351000
@NM00036 EQU   FLCTEA                                                   01352000
PSAPIPC  EQU   PSAPICOD                                                 01353000
PSAPIMC  EQU   PSAPICOD                                                 01354000
PSAPIPER EQU   PSAPICOD                                                 01355000
PSARV049 EQU   FLCPICOD                                                 01356000
FLCPILCB EQU   FLCPIILC                                                 01357000
@NM00035 EQU   FLCPIILC                                                 01358000
@NM00034 EQU   PSAEPPSW                                                 01359000
FLCSVCN  EQU   PSAESPSW+2                                               01360000
FLCSILCB EQU   FLCSVILC                                                 01361000
@NM00033 EQU   FLCSVILC                                                 01362000
@NM00032 EQU   PSAESPSW                                                 01363000
FLCEICOD EQU   PSAEEPSW+2                                               01364000
PSASPAD  EQU   PSAEEPSW                                                 01365000
@NM00031 EQU   PSA+128                                                  01366000
FLCINPSW EQU   PSA+120                                                  01367000
FLCMNPSW EQU   PSA+112                                                  01368000
FLCPNPSW EQU   PSA+104                                                  01369000
FLCSNPSW EQU   PSA+96                                                   01370000
FLCENPSW EQU   PSA+88                                                   01371000
FLCTRACE EQU   PSA+84                                                   01372000
FLCTIMER EQU   PSA+80                                                   01373000
FLCCVT2  EQU   PSA+76                                                   01374000
FLCCAW   EQU   PSA+72                                                   01375000
FLCCSW   EQU   PSA+64                                                   01376000
FLCIOPSW EQU   PSA+56                                                   01377000
FLCMOPSW EQU   PSA+48                                                   01378000
FLCPOPSW EQU   PSA+40                                                   01379000
FLCSOPSW EQU   PSA+32                                                   01380000
FLCEOPSW EQU   PSA+24                                                   01381000
@NM00030 EQU   FLCICCW2+4                                               01382000
FLCICCW1 EQU   FLCROPSW                                                 01383000
FLCIPPSW EQU   FLCRNPSW                                                 01384000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01385000
@RC00032 EQU   @EL00001                                                 01386000
@RC00030 EQU   @EL00001                                                 01387000
@ENDDATA EQU   *                                                        01388000
         END   IKT0940C,(C'PLS2022',0701,77319)                         01389000
