         TITLE 'IKTLOGR: TSO/VTAM LOGON RECONNECT ROUTINE              *00001000
                        '                                               00002000
IKTLOGR  CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IKTLOGR   77.319'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
         L     @00,@SIZDATD                                        0001 00014000
         GETMAIN  R,LV=(0)                                              00015000
         LR    @07,@01                                             0001 00016000
         USING @DATD,@07                                           0001 00017000
         ST    @13,@SA00001+4                                      0001 00018000
         LM    @00,@01,20(@13)                                     0001 00019000
         ST    @07,8(,@13)                                         0001 00020000
         LR    @13,@07                                             0001 00021000
*                                      SETLOCK MACRO                 */ 00022000
*/****************************************************************** */ 00023000
*/*       OBTAIN LOCAL AND CMS LOCK IN ORDER TO SEARCH TSB CHAIN     */ 00024000
*/****************************************************************** */ 00025000
*                                                                  0037 00026000
*   REG0=REG13;                     /* SAVE PREVIOUS SAVEAREA POINTER   00027000
*                                                            @ZA17868*/ 00028000
         LR    REG0,REG13                                          0037 00029000
*   REG13=ADDR(LOCKWA);             /* INSERT LOCAL LOCK WORKAREA  0038 00030000
*                                                            @ZA17868*/ 00031000
         LA    REG13,LOCKWA                                        0038 00032000
*   GENERATE CODE                   /* OBTAIN THE LOCAL LOCK         */ 00033000
*       REFS(PSALITA,FLC);                                         0039 00034000
         SETLOCK   OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=SAVE,  @ZA17868 **00035000
               RELATED=('PREREQUISITE FOR CMS LOCK')                    00036000
*   GENERATE CODE REFS(PSALITA,FLC);                               0040 00037000
*                                /* GET CMS LOCK */                     00038000
         SETLOCK   OBTAIN,TYPE=CMS,MODE=UNCOND,REGS=SAVE,             **00039000
               RELATED=('SCAN TSB CHAIN ')                              00040000
*   REG13=REG0;                     /* RESTORE REGISTER CONTENTS   0041 00041000
*                                                            @ZA17868*/ 00042000
         LR    REG13,REG0                                          0041 00043000
*/****************************************************************** */ 00044000
*/* SEARCH TSB CHAIN BASED IN TCAS TABLE                             */ 00045000
*/****************************************************************** */ 00046000
*                                                                  0042 00047000
*   RFY                                                            0042 00048000
*    (REG14,                                                       0042 00049000
*     REG15,                                                       0042 00050000
*     REG10) UNRSTD;                /* UNRESTRICT REGISTERS          */ 00051000
*   TSBBASE=TCASTSB;                /* LOAD ADDRESS OF FIRST TSB     */ 00052000
         L     @08,CVTPTR                                          0043 00053000
         L     @08,TCASTPTR(,@08)                                  0043 00054000
         L     TSBBASE,TCASTSB(,@08)                               0043 00055000
*   DO WHILE(TSBBASE>=0);           /* START SEARCH OF CHAIN         */ 00056000
         B     @DE00044                                            0044 00057000
@DL00044 DS    0H                                                  0045 00058000
*     IF TSBBASE=0 THEN             /* TEST FOR END OF CHAIN         */ 00059000
         LTR   TSBBASE,TSBBASE                                     0045 00060000
         BNZ   @RF00045                                            0045 00061000
*       DO;                                                        0046 00062000
*         REG0=REG13;               /* SAVE PREVIOUS SAVEAREA POINTER   00063000
*                                                            @ZA17868*/ 00064000
         LR    REG0,REG13                                          0047 00065000
*         REG13=ADDR(LOCKWA);       /* INSERT LOCAL LOCK WORKAREA  0048 00066000
*                                                            @ZA17868*/ 00067000
         LA    REG13,LOCKWA                                        0048 00068000
*         GENERATE CODE             /* FREE ALL LOCKS                */ 00069000
*             REFS(PSALITA,FLC,PSAMPSW);                           0049 00070000
         SETLOCK RELEASE,TYPE=CMS,REGS=SAVE,                          **00071000
               RELATED=('TSB CHAIN SCANNED')                            00072000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=SAVE,RELATED=('EXITTING')      00073000
*         REG13=REG0;               /* RESTORE REGISTER CONTENTS     */ 00074000
         LR    REG13,REG0                                          0050 00075000
*         GENERATE CODE REFS(RETCODE);                             0051 00076000
         L    15,4(13)       LOAD ADDRESS OF OLD SAVE AREA              00077000
         SLR  0,0            ZERO REGISTER 0                            00078000
         ST   0,20(,15)      STORE ZERO INTO REG0 POSITION              00079000
*         RETURN CODE(USERIDBD);    /* INDICATE UERID IS BAD TO    0052 00080000
*                                      CALLER                        */ 00081000
         L     @13,4(,@13)                                         0052 00082000
         L     @00,@SIZDATD                                        0052 00083000
         LR    @01,@07                                             0052 00084000
         FREEMAIN R,LV=(0),A=(1)                                        00085000
         LA    @15,8                                               0052 00086000
         L     @14,12(,@13)                                        0052 00087000
         LM    @00,@12,20(@13)                                     0052 00088000
         BR    @14                                                 0052 00089000
*       END;                                                       0053 00090000
*     RFY                                                          0054 00091000
*       TSB BASED(TSBBASE);         /* BASE TSB ON CURRENT BASE      */ 00092000
@RF00045 DS    0H                                                  0055 00093000
*     IF TSBXWREC='1'B&USERID=TSBXUID THEN                         0055 00094000
*                                                                  0055 00095000
         L     @10,TSBEXTNT(,TSBBASE)                              0055 00096000
         TM    TSBXWREC(@10),B'00010000'                           0055 00097000
         BNO   @RF00055                                            0055 00098000
         L     @08,PARM1PTR(,REG1)                                 0055 00099000
         CLC   USERID(8,@08),TSBXUID(@10)                          0055 00100000
         BNE   @RF00055                                            0055 00101000
*/********************************************************************/ 00102000
*/*               CHECK FOR WAITING FOR RECONNECT BIT                */ 00103000
*/*                                                                  */ 00104000
*/********************************************************************  00105000
*                                                                    */ 00106000
*                                                                  0056 00107000
*                                                                  0056 00108000
*/*  SEARCH TSB CHAIN FOR COMPARISON ON USERID AND PASSWORD          */ 00109000
*/*                                                                  */ 00110000
*                                                                  0056 00111000
*       IF PASSWORD=TSBPSWD THEN    /* CHECK FOR MATCHING PASSWORD   */ 00112000
         L     @08,PARM2PTR(,REG1)                                 0056 00113000
         CLC   PASSWORD(8,@08),TSBPSWD(TSBBASE)                    0056 00114000
         BNE   @RF00056                                            0056 00115000
*         DO;                       /* INSERT ALL NEW VALUES FROM  0057 00116000
*                                      THIS TSB                      */ 00117000
*           TSBTRMID=ASCBTSB->TSBTRMID;/* INSERT NEW TERMINAL ID   0058 00118000
*                                                            @G32TKKM*/ 00119000
         L     @08,ASCBPTR                                         0058 00120000
         L     @08,ASCBTSB(,@08)                                   0058 00121000
         MVC   TSBTRMID(8,TSBBASE),TSBTRMID(@08)                   0058 00122000
*/*                             INSERT NEW ASCII FLAG                */ 00123000
*                                                                  0059 00124000
*           IF ASCBTSB->TSBEXTNT->TSBXASCI='1'B THEN/* CHECK FOR BIT    00125000
*                                      ON                            */ 00126000
         L     @08,TSBEXTNT(,@08)                                  0059 00127000
         TM    TSBXASCI(@08),B'10000000'                           0059 00128000
         BNO   @RF00059                                            0059 00129000
*             TSBXASCI='1'B;        /* TURN ON BIT VARIABLE          */ 00130000
         OI    TSBXASCI(@10),B'10000000'                           0060 00131000
*           ELSE                                                   0061 00132000
*             TSBXASCI='0'B;        /* TURN OFF THE BIT              */ 00133000
         B     @RC00059                                            0061 00134000
@RF00059 L     @10,TSBEXTNT(,TSBBASE)                              0061 00135000
         NI    TSBXASCI(@10),B'01111111'                           0061 00136000
*/*                              INDICATE DISPLAY SCREEN             */ 00137000
*                                                                  0062 00138000
*           IF ASCBTSB->TSBDSPLY='1'B THEN/* CHECK BIT ORIENTATION   */ 00139000
@RC00059 L     @10,ASCBPTR                                         0062 00140000
         L     @10,ASCBTSB(,@10)                                   0062 00141000
         TM    TSBDSPLY(@10),B'00100000'                           0062 00142000
         BNO   @RF00062                                            0062 00143000
*             DO;                                                  0063 00144000
*               TSB3270='1'B;       /* TURN ON 3270 INDICATOR        */ 00145000
*               TSBDSPLY='1'B;      /* TURN ON THE BIT               */ 00146000
         OI    TSB3270(TSBBASE),B'00100010'                        0065 00147000
*             END;                                                 0066 00148000
*           ELSE                                                   0067 00149000
*             DO;                                                  0067 00150000
         B     @RC00062                                            0067 00151000
@RF00062 DS    0H                                                  0068 00152000
*               TSB3270='0'B;       /* TURN OFF 3270 INDICATOR       */ 00153000
*               TSBDSPLY='0'B;      /* TURN OFF THE BIT VARIABLE     */ 00154000
         NI    TSB3270(TSBBASE),B'11011101'                        0069 00155000
*             END;                                                 0070 00156000
*           TSBXTERM=ASCBTSB->TSBEXTNT->TSBXTERM;/* INSERT NEW     0071 00157000
*                                      TERMINAL CHARACTERISTICS      */ 00158000
@RC00062 L     @10,TSBEXTNT(,TSBBASE)                              0071 00159000
         L     @08,ASCBPTR                                         0071 00160000
         L     @08,ASCBTSB(,@08)                                   0071 00161000
         L     @08,TSBEXTNT(,@08)                                  0071 00162000
         MVC   TSBXTERM(4,@10),TSBXTERM(@08)                       0071 00163000
*           TSBXBIND=ASCBTSB->TSBEXTNT->TSBXBIND;/* INSERT NEW BIND     00164000
*                                      IMAGE                 @G58AKKM*/ 00165000
         MVC   TSBXBIND(36,@10),TSBXBIND(@08)                      0072 00166000
*           RFY                                                    0073 00167000
*             INDXREG RSTD;         /* RESTRICT TWO WORK REGISTERS   */ 00168000
*           INDXREG=TSBXAIND;       /* LOAD OLD ADDRESS SPACE USER 0074 00169000
*                                      INDEX                         */ 00170000
         L     @08,TSBEXTNT(,TSBBASE)                              0074 00171000
         LH    INDXREG,TSBXAIND(,@08)                              0074 00172000
*/****************************************************************** */ 00173000
*/*  CREATE THE APPLID OF THE OLD MEMORY TO FACILITATE PASSING OF    */ 00174000
*/*  CONTROL                                                         */ 00175000
*/****************************************************************** */ 00176000
*                                                                  0075 00177000
*           RFY                                                    0075 00178000
*             TSB BASED(ASCBTSB);   /* ESTABLISH ADDRESSABILITY TO 0075 00179000
*                                      TSB IN THIS ADDRESS SPACE     */ 00180000
*           WORKREG=ADDR(OLDAPPL);  /* LOAD ADDRESS OF WORK AREA FOR    00181000
*                                      CONVERSION                    */ 00182000
         LA    WORKREG,OLDAPPL                                     0076 00183000
*           GENERATE CODE           /* CONVERT FROM BINARY TO PACKED */ 00184000
*               REFS(INDXREG,WORKREG);                             0077 00185000
         CVD   INDXREG,0(WORKREG)   CONVERT FROM BINARY TO PACKED       00186000
         UNPK  0(8,WORKREG),0(8,WORKREG) UNPACK FROM PACKED TO ZONED    00187000
         OI    7(WORKREG),X'F0'     MASK SIGN ZONE                      00188000
*           OLDAPPL(1:7)=OLDAPPL(2:8);/* MOVE CHARACTERS OVER 1 BYTE */ 00189000
         MVC   @TS00001(7),OLDAPPL+1                               0078 00190000
         MVC   OLDAPPL(7),@TS00001                                 0078 00191000
*           OLDAPPL(8)=' ';         /* INSERT BLANK CHARACTER ON   0079 00192000
*                                      RIGHT                         */ 00193000
         MVI   OLDAPPL+7,C' '                                      0079 00194000
*           OLDAPPL(1:3)=TSO;       /* INSERT CHARACTER STRING 'TSO' */ 00195000
         MVC   OLDAPPL(3),TSO                                      0080 00196000
*           RFY                                                    0081 00197000
*             INDXREG UNRSTD;       /* UNRESTRICT THE INDEX REGISTER */ 00198000
*           TSBBASE=-TSBBASE;       /* TURN OF LOOP BY NEGATING BASE    00199000
*                                      REGISTER                      */ 00200000
         LCR   TSBBASE,TSBBASE                                     0082 00201000
*         END;                                                     0083 00202000
*       ELSE                        /* PASSWORD DOES NOT MATCH       */ 00203000
*         DO;                                                      0084 00204000
         B     @RC00056                                            0084 00205000
@RF00056 DS    0H                                                  0085 00206000
*           REG0=REG13;             /* SAVE PREVIOUS SAVEAREA POINTER   00207000
*                                                            @ZA17868*/ 00208000
         LR    REG0,REG13                                          0085 00209000
*           REG13=ADDR(LOCKWA);     /* INSERT LOCAL LOCK WORKAREA  0086 00210000
*                                                            @ZA17868*/ 00211000
         LA    REG13,LOCKWA                                        0086 00212000
*           GENERATE CODE           /* FREE ALL LOCKS                */ 00213000
*               REFS(PSALITA,FLC,PSAMPSW);                         0087 00214000
         SETLOCK RELEASE,TYPE=CMS,REGS=SAVE,                          **00215000
               RELATED=('TSB CHAIN SCANNED')                            00216000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=SAVE,RELATED=('EXITTING')      00217000
*           REG13=REG0;             /* RESTORE REGISTER CONTENTS     */ 00218000
         LR    REG13,REG0                                          0088 00219000
*           RETURN CODE(PASWRDBD);  /* RETURN TO CALLER INDICATING 0089 00220000
*                                      CONDITION                     */ 00221000
         L     @13,4(,@13)                                         0089 00222000
         L     @00,@SIZDATD                                        0089 00223000
         LR    @01,@07                                             0089 00224000
         FREEMAIN R,LV=(0),A=(1)                                        00225000
         LA    @15,4                                               0089 00226000
         L     @14,12(,@13)                                        0089 00227000
         LM    @00,@12,20(@13)                                     0089 00228000
         BR    @14                                                 0089 00229000
*         END;                                                     0090 00230000
*     ELSE                          /* TSB NOT IN RECONNECT STATE OR    00231000
*                                      USERID DOES NOT MATCH         */ 00232000
*       DO;                                                        0091 00233000
         B     @RC00055                                            0091 00234000
@RF00055 DS    0H                                                  0092 00235000
*         RFY                                                      0092 00236000
*           TSB BASED(TSBBASE);     /* BASE TSB ON SEARCH REGISTER   */ 00237000
*         TSBBASE=TSBXFWD;          /* GET ADDRESS OF NEXT TSB       */ 00238000
         L     @10,TSBEXTNT(,TSBBASE)                              0093 00239000
         L     @10,TSBXFWD(,@10)                                   0093 00240000
         LR    TSBBASE,@10                                         0093 00241000
*       END;                                                       0094 00242000
*   END;                            /* END OF LOOP                   */ 00243000
@RC00055 DS    0H                                                  0095 00244000
@DE00044 LTR   TSBBASE,TSBBASE                                     0095 00245000
         BNM   @DL00044                                            0095 00246000
*   TSBBASE=-TSBBASE;               /* RESTORE TSB POINTER           */ 00247000
         LCR   TSBBASE,TSBBASE                                     0096 00248000
*/****************************************************************** */ 00249000
*/*  AFTER HAVING LOCATED THE TSB BELONGING TO THE OLD SESSION       */ 00250000
*/*  FREE ALL LOCKS                                                  */ 00251000
*/****************************************************************** */ 00252000
*                                                                  0097 00253000
*   REG0=REG13;                     /* SAVE PREVIOUS SAVEAREA POINTER   00254000
*                                                            @ZA17868*/ 00255000
         LR    REG0,REG13                                          0097 00256000
*   REG13=ADDR(LOCKWA);             /* INSERT LOCAL LOCK WORKAREA  0098 00257000
*                                                            @ZA17868*/ 00258000
         LA    REG13,LOCKWA                                        0098 00259000
*   GENERATE CODE                   /* FREE ALL LOCKS                */ 00260000
*       REFS(PSALITA,FLC,PSAMPSW);                                 0099 00261000
         SETLOCK RELEASE,TYPE=CMS,REGS=SAVE,                          **00262000
               RELATED=('TSB CHAIN SCANNED')                            00263000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=SAVE,RELATED=('EXITTING')      00264000
*   REG13=REG0;                     /* RESTORE REGISTER CONTENTS     */ 00265000
         LR    REG13,REG0                                          0100 00266000
*/****************************************************************** */ 00267000
*/*       GIVE TERMINAL CONTROL TO OLD ADDRESS SPACE                 */ 00268000
*/****************************************************************** */ 00269000
*                                                                  0101 00270000
*   RFY                                                            0101 00271000
*     TSB BASED(ASCBTSB);           /* TSB IS FOR THIS ADDRESS SPACE */ 00272000
*   RFY                                                            0102 00273000
*    (RETCODE,                                                     0102 00274000
*     RPLREG) RSTD;                 /* RESTRICT RETURN CODE REGISTER */ 00275000
*   RPLREG=TVWARPL;                 /* LOAD ADDRESS OF RPL INTO A  0103 00276000
*                                      REGISTER                      */ 00277000
         L     @14,ASCBPTR                                         0103 00278000
         L     @14,ASCBTSB(,@14)                                   0103 00279000
         L     @14,TSBEXTNT(,@14)                                  0103 00280000
         L     @14,TVWAPTR(,@14)                                   0103 00281000
         L     RPLREG,TVWARPL(,@14)                                0103 00282000
*   TVWARTR=ADDR(RETRYMAX);         /* LOAD MAX RETRY VALUE          */ 00283000
         SLR   @10,@10                                             0104 00284000
         LA    @10,RETRYMAX(,@10)                                  0104 00285000
         STH   @10,TVWARTR(,@14)                                   0104 00286000
*   GENERATE CODE;                                                 0105 00287000
*                  /* PASS TERMINAL CONTROL TO OLD ADDRESS SPACE */     00288000
         CLSDST RPL=(RPLREG),                                         **00289000
               OPTCD=(SYN,PASS),AAREA=(WORKREG)                         00290000
*   RFY                                                            0106 00291000
*     WORKREG UNRSTD;               /* UNRESTRICT WORK REGSITER      */ 00292000
*   DO WHILE RETCODE^=0;            /* CHECK FOR SUCCESSFUL        0107 00293000
*                                      COMPLETION OF PASS            */ 00294000
         B     @DE00107                                            0107 00295000
@DL00107 DS    0H                                                  0108 00296000
*     IF RETCODE=4&REG0=8 THEN      /* TEST FOR RETRYABLE ERROR      */ 00297000
         C     RETCODE,@CF00051                                    0108 00298000
         BNE   @RF00108                                            0108 00299000
         C     REG0,@CF00041                                       0108 00300000
         BNE   @RF00108                                            0108 00301000
*       DO;                                                        0109 00302000
*         IF TVWARTR=0 THEN         /* TEST FOR MAX RETRY            */ 00303000
         L     @14,ASCBPTR                                         0110 00304000
         L     @14,ASCBTSB(,@14)                                   0110 00305000
         L     @14,TSBEXTNT(,@14)                                  0110 00306000
         L     @14,TVWAPTR(,@14)                                   0110 00307000
         LH    @14,TVWARTR(,@14)                                   0110 00308000
         LTR   @14,@14                                             0110 00309000
         BNZ   @RF00110                                            0110 00310000
*           DO;                                                    0111 00311000
*             REG0=REG13;           /* SAVE PREVIOUS SAVEAREA POINTER   00312000
*                                                            @ZA17868*/ 00313000
         LR    REG0,REG13                                          0112 00314000
*             REG13=ADDR(LOCKWA);   /* INSERT LOCAL LOCK WORKAREA  0113 00315000
*                                                            @ZA17868*/ 00316000
         LA    REG13,LOCKWA                                        0113 00317000
*             GENERATE CODE         /* OBTAIN THE LOCAL LOCK         */ 00318000
*                 REFS(PSALITA,FLC);                               0114 00319000
         SETLOCK   OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=SAVE,   @ZA17868**00320000
               RELATED=('PREREQUISITE FOR Q MNGR  ')          @YM03245  00321000
*             REG13=REG0;           /* RESTORE REGISTER CONTENTS   0115 00322000
*                                                            @ZA17868*/ 00323000
         LR    REG13,REG0                                          0115 00324000
*             OUTWA=OUTWA&&OUTWA;   /* ZERO WORK AREA        @YM03245*/ 00325000
         L     @14,ASCBPTR                                         0116 00326000
         L     @14,ASCBTSB(,@14)                                   0116 00327000
         L     @14,TSBEXTNT(,@14)                                  0116 00328000
         L     @14,TVWAPTR(,@14)                                   0116 00329000
         L     @14,TVWALLWA(,@14)                                  0116 00330000
         XC    OUTWA(24,@14),OUTWA(@14)                            0116 00331000
*             OPARMLST=ADDR(OPARMS);/* INSERT ADDRESS OF PARAMETER 0117 00332000
*                                      AREA                  @YM03245*/ 00333000
         ST    @14,OPARMLST(,@14)                                  0117 00334000
*             OPBFSZ=MSGLEN+1;      /* INSERT REQUEST LENGTH @YM03245*/ 00335000
         L     @10,CVTPTR                                          0118 00336000
         L     @10,TCASTPTR(,@10)                                  0118 00337000
         L     @09,TCASMSGS(,@10)                                  0118 00338000
         L     @09,IKTMSGS+4(,@09)                                 0118 00339000
         LA    @06,1                                               0118 00340000
         SLR   @05,@05                                             0118 00341000
         ICM   @05,3,MSGLEN(@09)                                   0118 00342000
         ALR   @06,@05                                             0118 00343000
         STH   @06,OPBFSZ(,@14)                                    0118 00344000
*             OPREQ=ADDTOP;         /* ADD TO TOP OF QUEUE   @YM03245*/ 00345000
         MVI   OPREQ(@14),X'08'                                    0119 00346000
*             RFY                                                  0120 00347000
*               REG1 RSTD;          /* RESTRICT PARAMETER REG      0120 00348000
*                                                            @YM03245*/ 00349000
*             REG1=ADDR(OPARMLST);  /* INSERT LIST ADDRESS INTO REG     00350000
*                                                            @YM03245*/ 00351000
         LA    REG1,OPARMLST(,@14)                                 0121 00352000
*             CALL IKTQMOUT;        /* GET BUFFER            @YM03245*/ 00353000
         L     @15,TCASOQM(,@10)                                   0122 00354000
         BALR  @14,@15                                             0122 00355000
*             IF OPRC=1 THEN        /* CHECK FOR GOOD RETURN CODE  0123 00356000
*                                                            @YM03245*/ 00357000
         L     @14,ASCBPTR                                         0123 00358000
         L     @14,ASCBTSB(,@14)                                   0123 00359000
         L     @14,TSBEXTNT(,@14)                                  0123 00360000
         L     @10,TVWAPTR(,@14)                                   0123 00361000
         L     @10,TVWALLWA(,@10)                                  0123 00362000
         CLI   OPRC(@10),1                                         0123 00363000
         BNE   @RF00123                                            0123 00364000
*               DO;                                                0124 00365000
*                 OBUFFER(1:MSGLEN)=MSGTEXT(1:MSGLEN);/* INSERT    0125 00366000
*                                      MESSAGE               @YM03245*/ 00367000
         L     @10,OPBUFADR(,@10)                                  0125 00368000
         L     @09,CVTPTR                                          0125 00369000
         L     @09,TCASTPTR(,@09)                                  0125 00370000
         L     @09,TCASMSGS(,@09)                                  0125 00371000
         L     @09,IKTMSGS+4(,@09)                                 0125 00372000
         SLR   @06,@06                                             0125 00373000
         ICM   @06,3,MSGLEN(@09)                                   0125 00374000
         LR    @05,@06                                             0125 00375000
         BCTR  @05,0                                               0125 00376000
         EX    @05,@SM01564                                        0125 00377000
*                 IF TSBXTMTP=ROCKET THEN/* CHECK FOR 3767/3770    0126 00378000
*                                                            @YM03245*/ 00379000
         CLI   TSBXTMTP(@14),2                                     0126 00380000
         BNE   @RF00126                                            0126 00381000
*                   OBUFFER(MSGLEN+1)=NEWLINE;/* INSERT NEW LINE   0127 00382000
*                                      CHARACTER             @YM03245*/ 00383000
         LA    @14,21                                              0127 00384000
         STC   @14,OBUFFER(@06,@10)                                0127 00385000
*                 ELSE                                             0128 00386000
*                   OBUFFER(MSGLEN+1)=SPACE;/* INSERT BLANK  @YM03245*/ 00387000
         B     @RC00126                                            0128 00388000
@RF00126 L     @14,CVTPTR                                          0128 00389000
         L     @14,TCASTPTR(,@14)                                  0128 00390000
         L     @14,TCASMSGS(,@14)                                  0128 00391000
         L     @14,IKTMSGS+4(,@14)                                 0128 00392000
         SLR   @10,@10                                             0128 00393000
         ICM   @10,3,MSGLEN(@14)                                   0128 00394000
         L     @14,ASCBPTR                                         0128 00395000
         L     @14,ASCBTSB(,@14)                                   0128 00396000
         L     @14,TSBEXTNT(,@14)                                  0128 00397000
         L     @14,TVWAPTR(,@14)                                   0128 00398000
         L     @14,TVWALLWA(,@14)                                  0128 00399000
         L     @14,OPBUFADR(,@14)                                  0128 00400000
         LA    @09,64                                              0128 00401000
         STC   @09,OBUFFER(@10,@14)                                0128 00402000
*               END;                /*                       @YM03251*/ 00403000
@RC00126 DS    0H                                                  0130 00404000
*             RFY                                                  0130 00405000
*               REG1 UNRSTD;        /* UNRESTRICT REG 1      @YM03245*/ 00406000
@RF00123 DS    0H                                                  0131 00407000
*             REG0=REG13;           /* SAVE PREVIOUS SAVEAREA POINTER   00408000
*                                                            @ZA17868*/ 00409000
         LR    REG0,REG13                                          0131 00410000
*             REG13=ADDR(LOCKWA);   /* INSERT LOCAL LOCK WORKAREA  0132 00411000
*                                                            @ZA17868*/ 00412000
         LA    REG13,LOCKWA                                        0132 00413000
*             GENERATE CODE         /* FREE ALL LOCKS        @YM03245*/ 00414000
*                 REFS(PSALITA,FLC);                               0133 00415000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=SAVE,RELATED=('EXITTING')      00416000
*             REG13=REG0;           /* RESTORE REG13         @ZA17868*/ 00417000
         LR    REG13,REG0                                          0134 00418000
*             RETURN CODE(RECONBD); /* INDICATE RECONNECT FAILED     */ 00419000
         L     @13,4(,@13)                                         0135 00420000
         L     @00,@SIZDATD                                        0135 00421000
         LR    @01,@07                                             0135 00422000
         FREEMAIN R,LV=(0),A=(1)                                        00423000
         LA    @15,12                                              0135 00424000
         L     @14,12(,@13)                                        0135 00425000
         LM    @00,@12,20(@13)                                     0135 00426000
         BR    @14                                                 0135 00427000
*           END;                                                   0136 00428000
*         ELSE                      /* RETRY LIMIT NOT EXCEEDED      */ 00429000
*           DO;                                                    0137 00430000
@RF00110 DS    0H                                                  0138 00431000
*             TVWARTR=TVWARTR-1;    /* DECREMENT COUNTER             */ 00432000
         L     @14,ASCBPTR                                         0138 00433000
         L     @01,ASCBTSB(,@14)                                   0138 00434000
         L     @01,TSBEXTNT(,@01)                                  0138 00435000
         L     @14,TVWAPTR(,@01)                                   0138 00436000
         LH    @10,TVWARTR(,@14)                                   0138 00437000
         BCTR  @10,0                                               0138 00438000
         STH   @10,TVWARTR(,@14)                                   0138 00439000
*             GENERATE CODE;                                       0139 00440000
*                /* REEXECUTE MACRO  */                                 00441000
         EXECRPL   RPL=(RPLREG)                                         00442000
*           END;                                                   0140 00443000
*       END;                                                       0141 00444000
*     ELSE                          /* RETURN CODE INDICATES NON   0142 00445000
*                                      RETRYABLE ERROR               */ 00446000
*       DO;                                                        0142 00447000
         B     @RC00108                                            0142 00448000
@RF00108 DS    0H                                                  0143 00449000
*         REG0=REG13;               /* SAVE PREVIOUS SAVEAREA POINTER   00450000
*                                                            @ZA17868*/ 00451000
         LR    REG0,REG13                                          0143 00452000
*         REG13=ADDR(LOCKWA);       /* INSERT LOCAL LOCK WORKAREA  0144 00453000
*                                                            @ZA17868*/ 00454000
         LA    REG13,LOCKWA                                        0144 00455000
*         GENERATE CODE             /* OBTAIN THE LOCAL LOCK         */ 00456000
*             REFS(PSALITA,FLC);                                   0145 00457000
         SETLOCK   OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=SAVE,   @ZA17868**00458000
               RELATED=('PREREQUISITE FOR Q MNGR  ')          @YM03245  00459000
*         REG13=REG0;               /* RESTORE REGISTER CONTENTS   0146 00460000
*                                                            @ZA17868*/ 00461000
         LR    REG13,REG0                                          0146 00462000
*         OUTWA=OUTWA&&OUTWA;       /* ZERO WORK AREA        @YM03245*/ 00463000
         L     @14,ASCBPTR                                         0147 00464000
         L     @01,ASCBTSB(,@14)                                   0147 00465000
         L     @01,TSBEXTNT(,@01)                                  0147 00466000
         L     @01,TVWAPTR(,@01)                                   0147 00467000
         L     @14,TVWALLWA(,@01)                                  0147 00468000
         XC    OUTWA(24,@14),OUTWA(@14)                            0147 00469000
*         OPARMLST=ADDR(OPARMS);    /* INSERT ADDRESS OF PARAMETER 0148 00470000
*                                      AREA                  @YM03245*/ 00471000
         ST    @14,OPARMLST(,@14)                                  0148 00472000
*         OPBFSZ=MSGLEN+1;          /* INSERT REQUEST LENGTH @YM03245*/ 00473000
         L     @10,CVTPTR                                          0149 00474000
         L     @10,TCASTPTR(,@10)                                  0149 00475000
         L     @01,TCASMSGS(,@10)                                  0149 00476000
         L     @01,IKTMSGS+4(,@01)                                 0149 00477000
         LA    @09,1                                               0149 00478000
         SLR   @06,@06                                             0149 00479000
         ICM   @06,3,MSGLEN(@01)                                   0149 00480000
         ALR   @09,@06                                             0149 00481000
         STH   @09,OPBFSZ(,@14)                                    0149 00482000
*         OPREQ=ADDTOP;             /* ADD TO TOP OF QUEUE   @YM03245*/ 00483000
         MVI   OPREQ(@14),X'08'                                    0150 00484000
*         RFY                                                      0151 00485000
*           REG1 RSTD;              /* RESTRICT PARAMETER REG      0151 00486000
*                                                            @YM03245*/ 00487000
*         REG1=ADDR(OPARMLST);      /* INSERT LIST ADDRESS INTO REG     00488000
*                                                            @YM03245*/ 00489000
         LA    REG1,OPARMLST(,@14)                                 0152 00490000
*         CALL IKTQMOUT;            /* GET BUFFER            @YM03245*/ 00491000
         L     @15,TCASOQM(,@10)                                   0153 00492000
         BALR  @14,@15                                             0153 00493000
*         IF OPRC=1 THEN            /* CHECK FOR GOOD RETURN CODE  0154 00494000
*                                                            @YM03245*/ 00495000
         L     @14,ASCBPTR                                         0154 00496000
         L     @14,ASCBTSB(,@14)                                   0154 00497000
         L     @14,TSBEXTNT(,@14)                                  0154 00498000
         L     @10,TVWAPTR(,@14)                                   0154 00499000
         L     @10,TVWALLWA(,@10)                                  0154 00500000
         CLI   OPRC(@10),1                                         0154 00501000
         BNE   @RF00154                                            0154 00502000
*           DO;                                                    0155 00503000
*             OBUFFER(1:MSGLEN)=MSGTEXT(1:MSGLEN);/* INSERT MESSAGE     00504000
*                                                            @YM03245*/ 00505000
         L     @10,OPBUFADR(,@10)                                  0156 00506000
         L     @09,CVTPTR                                          0156 00507000
         L     @09,TCASTPTR(,@09)                                  0156 00508000
         L     @09,TCASMSGS(,@09)                                  0156 00509000
         L     @09,IKTMSGS+4(,@09)                                 0156 00510000
         SLR   @06,@06                                             0156 00511000
         ICM   @06,3,MSGLEN(@09)                                   0156 00512000
         LR    @05,@06                                             0156 00513000
         BCTR  @05,0                                               0156 00514000
         EX    @05,@SM01564                                        0156 00515000
*             IF TSBXTMTP=ROCKET THEN/* CHECK FOR 3767/3770  @YM03245*/ 00516000
         CLI   TSBXTMTP(@14),2                                     0157 00517000
         BNE   @RF00157                                            0157 00518000
*               OBUFFER(MSGLEN+1)=NEWLINE;/* INSERT NEW LINE       0158 00519000
*                                      CHARACTER             @YM03245*/ 00520000
         LA    @14,21                                              0158 00521000
         STC   @14,OBUFFER(@06,@10)                                0158 00522000
*             ELSE                                                 0159 00523000
*               OBUFFER(MSGLEN+1)=SPACE;/* INSERT BLANK      @YM03245*/ 00524000
         B     @RC00157                                            0159 00525000
@RF00157 L     @14,CVTPTR                                          0159 00526000
         L     @14,TCASTPTR(,@14)                                  0159 00527000
         L     @14,TCASMSGS(,@14)                                  0159 00528000
         L     @14,IKTMSGS+4(,@14)                                 0159 00529000
         SLR   @10,@10                                             0159 00530000
         ICM   @10,3,MSGLEN(@14)                                   0159 00531000
         L     @14,ASCBPTR                                         0159 00532000
         L     @14,ASCBTSB(,@14)                                   0159 00533000
         L     @14,TSBEXTNT(,@14)                                  0159 00534000
         L     @14,TVWAPTR(,@14)                                   0159 00535000
         L     @14,TVWALLWA(,@14)                                  0159 00536000
         L     @14,OPBUFADR(,@14)                                  0159 00537000
         LA    @09,64                                              0159 00538000
         STC   @09,OBUFFER(@10,@14)                                0159 00539000
*           END;                    /*                       @YM03251*/ 00540000
@RC00157 DS    0H                                                  0161 00541000
*         RFY                                                      0161 00542000
*           REG1 UNRSTD;            /* UNRESTRICT REG 1      @YM03245*/ 00543000
@RF00154 DS    0H                                                  0162 00544000
*         REG0=REG13;               /* SAVE PREVIOUS SAVEAREA POINTER   00545000
*                                                            @ZA17868*/ 00546000
         LR    REG0,REG13                                          0162 00547000
*         REG13=ADDR(LOCKWA);       /* INSERT LOCAL LOCK WORKAREA  0163 00548000
*                                                            @ZA17868*/ 00549000
         LA    REG13,LOCKWA                                        0163 00550000
*         GENERATE CODE             /* FREE ALL LOCKS        @YM03245*/ 00551000
*             REFS(PSALITA,FLC);                                   0164 00552000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=SAVE,RELATED=('EXITTING')      00553000
*         REG13=REG0;               /* RESTORE REGISTER CONTENTS   0165 00554000
*                                                            @ZA17868*/ 00555000
         LR    REG13,REG0                                          0165 00556000
*         RETURN CODE(RECONBD);     /* INDICATE RECONNECT FAILED     */ 00557000
         L     @13,4(,@13)                                         0166 00558000
         L     @00,@SIZDATD                                        0166 00559000
         LR    @01,@07                                             0166 00560000
         FREEMAIN R,LV=(0),A=(1)                                        00561000
         LA    @15,12                                              0166 00562000
         L     @14,12(,@13)                                        0166 00563000
         LM    @00,@12,20(@13)                                     0166 00564000
         BR    @14                                                 0166 00565000
*       END;                                                       0167 00566000
*   END;                            /* END OF LOOP                   */ 00567000
@RC00108 DS    0H                                                  0168 00568000
@DE00107 LTR   RETCODE,RETCODE                                     0168 00569000
         BNZ   @DL00107                                            0168 00570000
*   RFY                                                            0169 00571000
*     RPLREG UNRSTD;                /* UNRESTRICT RPL REGISTER       */ 00572000
*   RFY                                                            0170 00573000
*    (REG4,                                                        0170 00574000
*     WORKREG,                                                     0170 00575000
*     INDXREG,                                                     0170 00576000
*     REG8) RSTD;                   /* RESTRICT WORK REGISTERS       */ 00577000
*   TSBXACTV='0'B;                  /* INDICATE TERMINAL NOT       0171 00578000
*                                      ALLOCATED TO ADDRESS SPACE  0171 00579000
*                                      OZ12001                       */ 00580000
         L     @14,ASCBPTR                                         0171 00581000
         L     @01,ASCBTSB(,@14)                                   0171 00582000
         L     @14,TSBEXTNT(,@01)                                  0171 00583000
         NI    TSBXACTV(@14),B'10111111'                           0171 00584000
*   REG4=TVWAVST+4;                 /* LOAD THE ADDRESS OF MACRO AREA*/ 00585000
         L     @01,TVWAPTR(,@14)                                   0172 00586000
         LA    REG4,4                                              0172 00587000
         AL    REG4,TVWAVST(,@01)                                  0172 00588000
*   RFY                                                            0173 00589000
*     MACAREA BASED(REG4);          /* BASE THE AREA ON REGISTER 4   */ 00590000
*   MACAREA(1:LENGTH(POSTL))=POSTL; /* MOVE MACRO TO DYNAMIC STORAGE */ 00591000
         MVC   MACAREA(12,REG4),POSTL                              0174 00592000
*   RFY                                                            0175 00593000
*     TSB BASED(TSBBASE);           /* SET UP ADDRESSABILITY TO OLD     00594000
*                                      ADDRESS SPACE TSB             */ 00595000
*   WORKREG=TSBASCBA;               /* LOAD ADDRESS OF OLD ADDRESS 0176 00596000
*                                      SPACE ASCB                    */ 00597000
         L     WORKREG,TSBASCBA(,TSBBASE)                          0176 00598000
*   INDXREG=ADDR(TSBXECB);          /* LOAD ADDRESS OF X-MEM ECB     */ 00599000
         L     INDXREG,TSBEXTNT(,TSBBASE)                          0177 00600000
         LA    INDXREG,TSBXECB(,INDXREG)                           0177 00601000
*   REG8=ADDR(TCASBR14);            /* LOAD ADDRESS OF A BR 14     0178 00602000
*                                      INSTRUCTION                   */ 00603000
         L     @14,CVTPTR                                          0178 00604000
         L     REG8,TCASTPTR(,@14)                                 0178 00605000
         LA    REG8,TCASBR14(,REG8)                                0178 00606000
*   GENERATE CODE                   /* POST OLD ADDRESS SPACE        */ 00607000
*       REFS(INDXREG,WORKREG,REG8);                                0179 00608000
         POST  (INDXREG),ASCB=(WORKREG),ERRET=(REG8),MF=(E,(4))         00609000
*   RFY                                                            0180 00610000
*    (REG8,                                                        0180 00611000
*     INDXREG,                                                     0180 00612000
*     REG4,                                                        0180 00613000
*     WORKREG) UNRSTD;              /* UNRESTRICT WORK REGISTERS     */ 00614000
*   RETURN CODE(RECONGD);           /* INDICATE RECONNECT SUCCESSFUL */ 00615000
         L     @13,4(,@13)                                         0181 00616000
         L     @00,@SIZDATD                                        0181 00617000
         LR    @01,@07                                             0181 00618000
         FREEMAIN R,LV=(0),A=(1)                                        00619000
         SLR   @15,@15                                             0181 00620000
         L     @14,12(,@13)                                        0181 00621000
         LM    @00,@12,20(@13)                                     0181 00622000
         BR    @14                                                 0181 00623000
*   END IKTLOGR                                                    0182 00624000
*                                                                  0182 00625000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00626000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00627000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00628000
*/*%INCLUDE SYSLIB  (IKTTCAST)                                       */ 00629000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00630000
*/*%INCLUDE SYSLIB  (IKJTSB  )                                       */ 00631000
*/*%INCLUDE SYSLIB  (IKTTSBX )                                       */ 00632000
*/*%INCLUDE SYSLIB  (IKTTVWA )                                       */ 00633000
*/*%INCLUDE SYSLIB  (IKTEQU  )                                       */ 00634000
*/*%INCLUDE SYSLIB  (IKTOPARM)                                       */ 00635000
*                                                                  0182 00636000
*       ;                                                          0182 00637000
@DATA    DS    0H                                                       00638000
@SM01564 MVC   OBUFFER(0,@10),MSGTEXT(@09)                              00639000
@DATD    DSECT                                                          00640000
         DS    0F                                                       00641000
@SA00001 DS    18F                                                      00642000
IKTLOGR  CSECT                                                          00643000
         DS    0F                                                       00644000
@CF00051 DC    F'4'                                                     00645000
@CF00041 DC    F'8'                                                     00646000
@DATD    DSECT                                                          00647000
         DS    0D                                                       00648000
@TS00001 DS    CL7                                                      00649000
         DS    CL1                                                      00650000
LOCKWA   DS    CL28                                                     00651000
         ORG   LOCKWA                                                   00652000
LOCKREGS DS    CL20                                                     00653000
OLDAPPL  DS    CL8                                                      00654000
         ORG   LOCKWA+28                                                00655000
IKTLOGR  CSECT                                                          00656000
         DS    0F                                                       00657000
@SIZDATD DC    AL1(0)                                                   00658000
         DC    AL3(@ENDDATD-@DATD)                                      00659000
         DS    0D                                                       00660000
TSO      DC    CL3'TSO'                                                 00661000
         DS    CL1                                                      00662000
PATAREA  DC    30F'0'                                                   00663000
IKTLOGR  CSECT                                                          00664000
POSTL    POST MF=L                                                      00665000
@DATD    DSECT                                                          00666000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00667000
@ENDDATD EQU   *                                                        00668000
IKTLOGR  CSECT                                                          00669000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00670000
@01      EQU   01                                                       00671000
@02      EQU   02                                                       00672000
@03      EQU   03                                                       00673000
@04      EQU   04                                                       00674000
@05      EQU   05                                                       00675000
@06      EQU   06                                                       00676000
@07      EQU   07                                                       00677000
@08      EQU   08                                                       00678000
@09      EQU   09                                                       00679000
@10      EQU   10                                                       00680000
@11      EQU   11                                                       00681000
@12      EQU   12                                                       00682000
@13      EQU   13                                                       00683000
@14      EQU   14                                                       00684000
@15      EQU   15                                                       00685000
REG1     EQU   @01                                                      00686000
REG0     EQU   @00                                                      00687000
REG13    EQU   @13                                                      00688000
REG14    EQU   @14                                                      00689000
REG15    EQU   @15                                                      00690000
REG4     EQU   @04                                                      00691000
REG8     EQU   @08                                                      00692000
REG10    EQU   @10                                                      00693000
RETCODE  EQU   @15                                                      00694000
RPLREG   EQU   @08                                                      00695000
INDXREG  EQU   @10                                                      00696000
TSBBASE  EQU   @11                                                      00697000
WORKREG  EQU   @09                                                      00698000
REG11    EQU   @11                                                      00699000
REG9     EQU   @09                                                      00700000
PSA      EQU   0                                                        00701000
FLCRNPSW EQU   PSA                                                      00702000
FLCROPSW EQU   PSA+8                                                    00703000
FLCICCW2 EQU   PSA+16                                                   00704000
FLCCVT   EQU   FLCICCW2                                                 00705000
PSAEEPSW EQU   PSA+132                                                  00706000
PSAESPSW EQU   PSA+136                                                  00707000
FLCSVILC EQU   PSAESPSW+1                                               00708000
PSAEPPSW EQU   PSA+140                                                  00709000
FLCPIILC EQU   PSAEPPSW+1                                               00710000
FLCPICOD EQU   PSAEPPSW+2                                               00711000
PSAPICOD EQU   FLCPICOD+1                                               00712000
FLCTEA   EQU   PSAEPPSW+4                                               00713000
FLCPER   EQU   PSA+152                                                  00714000
FLCMCLA  EQU   PSA+168                                                  00715000
FLCIOEL  EQU   FLCMCLA+4                                                00716000
FLCIOA   EQU   FLCMCLA+16                                               00717000
FLCFSA   EQU   FLCMCLA+80                                               00718000
PSAAOLD  EQU   PSA+548                                                  00719000
PSASUPER EQU   PSA+552                                                  00720000
PSASUP1  EQU   PSASUPER                                                 00721000
PSASUP2  EQU   PSASUPER+1                                               00722000
PSASUP3  EQU   PSASUPER+2                                               00723000
PSASUP4  EQU   PSASUPER+3                                               00724000
PSAMPSW  EQU   PSA+592                                                  00725000
PSACLHT  EQU   PSA+640                                                  00726000
PSALKSA  EQU   PSA+696                                                  00727000
PSAHLHI  EQU   PSA+760                                                  00728000
PSALITA  EQU   PSA+764                                                  00729000
PSADSSFL EQU   PSA+836                                                  00730000
PSADSSF1 EQU   PSADSSFL                                                 00731000
PSADSSF3 EQU   PSADSSFL+2                                               00732000
PSADSSF4 EQU   PSADSSFL+3                                               00733000
PSARSVT  EQU   PSA+896                                                  00734000
PARM1PTR EQU   0                                                        00735000
PARM2PTR EQU   4                                                        00736000
USERID   EQU   0                                                        00737000
PASSWORD EQU   0                                                        00738000
CVTMAP   EQU   0                                                        00739000
CVTDAR   EQU   CVTMAP+72                                                00740000
CVTFLGS1 EQU   CVTDAR                                                   00741000
CVTDCB   EQU   CVTMAP+116                                               00742000
CVTIERLC EQU   CVTMAP+144                                               00743000
CVTOPTA  EQU   CVTMAP+182                                               00744000
CVTOPTB  EQU   CVTMAP+183                                               00745000
CVTGTF   EQU   CVTMAP+236                                               00746000
CVTGTFST EQU   CVTGTF                                                   00747000
CVTGTFS  EQU   CVTGTFST                                                 00748000
CVTSTATE EQU   CVTGTFST                                                 00749000
CVTTMODE EQU   CVTGTFST                                                 00750000
CVTFORM  EQU   CVTGTFST                                                 00751000
CVTAQAVT EQU   CVTMAP+240                                               00752000
CVTTCMFG EQU   CVTAQAVT                                                 00753000
CVTVOLM2 EQU   CVTMAP+244                                               00754000
CVTTATA  EQU   CVTVOLM2                                                 00755000
CVTTSKS  EQU   CVTTATA                                                  00756000
CVTVOLF2 EQU   CVTTSKS                                                  00757000
CVTTAT   EQU   CVTTATA+1                                                00758000
CVTATER  EQU   CVTMAP+248                                               00759000
CVTEXT1  EQU   CVTMAP+252                                               00760000
CVTPURG  EQU   CVTMAP+260                                               00761000
CVTQMSG  EQU   CVTMAP+268                                               00762000
CVTDMSR  EQU   CVTMAP+272                                               00763000
CVTRSV37 EQU   CVTDMSR                                                  00764000
CVTDMSRF EQU   CVTRSV37                                                 00765000
CVTERPV  EQU   CVTMAP+316                                               00766000
CVTINTLA EQU   CVTMAP+320                                               00767000
CVTAPF   EQU   CVTMAP+324                                               00768000
CVTEXT2  EQU   CVTMAP+328                                               00769000
CVTHJES  EQU   CVTMAP+332                                               00770000
CVTPGSIA EQU   CVTMAP+348                                               00771000
CVTA1F1  EQU   CVTMAP+356                                               00772000
CVTSYSK  EQU   CVTMAP+357                                               00773000
CVTVOLM1 EQU   CVTMAP+380                                               00774000
CVTVOLF1 EQU   CVTVOLM1                                                 00775000
CVTATMCT EQU   CVTMAP+388                                               00776000
CVTXTNT1 EQU   0                                                        00777000
CVTXTNT2 EQU   0                                                        00778000
CVTDSSV  EQU   CVTXTNT2                                                 00779000
CVTFLGBT EQU   CVTXTNT2+5                                               00780000
CVTQID   EQU   CVTXTNT2+24                                              00781000
CVTSHS   EQU   CVTXTNT2+40                                              00782000
CVTRV400 EQU   CVTXTNT2+52                                              00783000
CVTRV409 EQU   CVTXTNT2+53                                              00784000
CVTATCVT EQU   CVTXTNT2+64                                              00785000
CVTRV429 EQU   CVTXTNT2+84                                              00786000
CVTRV438 EQU   CVTXTNT2+85                                              00787000
CVTRV457 EQU   CVTXTNT2+112                                             00788000
CVTRV466 EQU   CVTXTNT2+113                                             00789000
CVTFIX   EQU   0                                                        00790000
CVTRELNO EQU   CVTFIX+252                                               00791000
TCAST    EQU   0                                                        00792000
TCASUSER EQU   TCAST+4                                                  00793000
TCASMSGS EQU   TCAST+52                                                 00794000
TCASTSB  EQU   TCAST+68                                                 00795000
TCASOQM  EQU   TCAST+76                                                 00796000
TCASFLG1 EQU   TCAST+88                                                 00797000
TCASFLG2 EQU   TCAST+89                                                 00798000
TCASBR14 EQU   TCAST+116                                                00799000
ASCB     EQU   0                                                        00800000
ASCBSUPC EQU   ASCB+16                                                  00801000
ASCBTSB  EQU   ASCB+60                                                  00802000
ASCBFW1  EQU   ASCB+100                                                 00803000
ASCBRCTF EQU   ASCBFW1+2                                                00804000
ASCBFLG1 EQU   ASCBFW1+3                                                00805000
ASCBDSP1 EQU   ASCB+114                                                 00806000
ASCBFLG2 EQU   ASCB+115                                                 00807000
ASCBLKGP EQU   ASCB+128                                                 00808000
ASCBSRQ  EQU   ASCB+180                                                 00809000
ASCBSRQ1 EQU   ASCBSRQ                                                  00810000
ASCBSRQ2 EQU   ASCBSRQ+1                                                00811000
ASCBSRQ3 EQU   ASCBSRQ+2                                                00812000
ASCBSRQ4 EQU   ASCBSRQ+3                                                00813000
TSB      EQU   0                                                        00814000
TSBASCBA EQU   TSB                                                      00815000
TSBSTAT  EQU   TSBASCBA                                                 00816000
TSBDSPLY EQU   TSBSTAT                                                  00817000
TSB3270  EQU   TSBSTAT                                                  00818000
TSBFLG1  EQU   TSB+4                                                    00819000
TSBFLG2  EQU   TSB+16                                                   00820000
TSBFLG3  EQU   TSB+24                                                   00821000
TSBFLG5  EQU   TSB+25                                                   00822000
TSBTERMC EQU   TSB+26                                                   00823000
TSBTERM1 EQU   TSBTERMC                                                 00824000
TSBTERM2 EQU   TSBTERMC+1                                               00825000
TSBSTCC  EQU   TSB+34                                                   00826000
TSBFLG4  EQU   TSB+41                                                   00827000
TSBRCB   EQU   TSB+64                                                   00828000
TSBLINKA EQU   TSBRCB+4                                                 00829000
TSBTPOST EQU   TSB+72                                                   00830000
TSBTPFLG EQU   TSBTPOST                                                 00831000
TSBMINL  EQU   TSB+84                                                   00832000
TSBPSWD  EQU   TSB+88                                                   00833000
TSBEXTNT EQU   TSB+96                                                   00834000
TSBTRMID EQU   TSB+104                                                  00835000
TSBX     EQU   0                                                        00836000
TSBXFWD  EQU   TSBX                                                     00837000
TSBXECB  EQU   TSBX+8                                                   00838000
TSBXUID  EQU   TSBX+24                                                  00839000
TSBXFLG1 EQU   TSBX+32                                                  00840000
TSBXASCI EQU   TSBXFLG1                                                 00841000
TSBXACTV EQU   TSBXFLG1                                                 00842000
TSBXWREC EQU   TSBXFLG1                                                 00843000
TSBXTVWA EQU   TSBX+36                                                  00844000
TSBXAIND EQU   TSBX+70                                                  00845000
TSBXTERM EQU   TSBX+72                                                  00846000
TSBXTMTP EQU   TSBXTERM                                                 00847000
TSBXBIND EQU   TSBX+80                                                  00848000
TVWA     EQU   0                                                        00849000
TVWALLWA EQU   TVWA+24                                                  00850000
TVWARTR  EQU   TVWA+72                                                  00851000
TVWARPL  EQU   TVWA+96                                                  00852000
TVWAVST  EQU   TVWA+104                                                 00853000
TVWAFLG7 EQU   TVWA+110                                                 00854000
TVWAECBL EQU   TVWA+120                                                 00855000
TVWADLST EQU   TVWA+132                                                 00856000
TVWAFLG1 EQU   TVWA+144                                                 00857000
TVWAFLG2 EQU   TVWA+145                                                 00858000
TVWAFLG3 EQU   TVWA+146                                                 00859000
TVWAFLG4 EQU   TVWA+147                                                 00860000
TVWAFLG5 EQU   TVWA+150                                                 00861000
TVWAFLG6 EQU   TVWA+182                                                 00862000
MACAREA  EQU   0                                                        00863000
IKTMSGS  EQU   0                                                        00864000
IKTQMOUT EQU   0                                                        00865000
MSG301   EQU   0                                                        00866000
MSGLEN   EQU   MSG301                                                   00867000
MSGTEXT  EQU   MSG301+2                                                 00868000
OUTWA    EQU   0                                                        00869000
OPARMS   EQU   OUTWA                                                    00870000
OPBUFADR EQU   OPARMS                                                   00871000
OPREQ    EQU   OPARMS+4                                                 00872000
OPRC     EQU   OPARMS+5                                                 00873000
OPBFSZ   EQU   OPARMS+6                                                 00874000
OPFLAGS  EQU   OPARMS+8                                                 00875000
OPOPTNS  EQU   OPFLAGS+1                                                00876000
OPNXFLGS EQU   OPARMS+16                                                00877000
OPARMLST EQU   OUTWA+20                                                 00878000
OBUFFER  EQU   0                                                        00879000
RETRYMAX EQU   10                                                       00880000
FLC      EQU   PSA                                                      00881000
PSARSVTE EQU   PSARSVT                                                  00882000
CVTPTR   EQU   FLCCVT                                                   00883000
CVTS01   EQU   CVTPGSIA                                                 00884000
CVTLPDIA EQU   CVTS01+12                                                00885000
CVTDIRST EQU   CVTLPDIA                                                 00886000
CVTSLIDA EQU   CVTS01+24                                                00887000
CVTCTLFG EQU   CVTS01+50                                                00888000
CVTRV210 EQU   CVTS01+424                                               00889000
CVTRV219 EQU   CVTS01+425                                               00890000
CVTRV228 EQU   CVTS01+426                                               00891000
CVTRV237 EQU   CVTS01+427                                               00892000
CVTMFRTR EQU   CVTS01+452                                               00893000
CVTRV262 EQU   CVTS01+468                                               00894000
CVTRV271 EQU   CVTS01+469                                               00895000
CVTRV280 EQU   CVTS01+470                                               00896000
CVTRV289 EQU   CVTS01+471                                               00897000
CVTGSDA  EQU   CVTS01+600                                               00898000
CVTTCASP EQU   CVTS01+664                                               00899000
TCASTPTR EQU   CVTTCASP                                                 00900000
ASCBPTR  EQU   PSAAOLD                                                  00901000
TSBPTR   EQU   ASCBTSB                                                  00902000
TVWAPTR  EQU   TSBXTVWA                                                 00903000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00904000
CVTRV628 EQU   CVTS01+728                                               00905000
CVTRV627 EQU   CVTS01+724                                               00906000
CVTRV626 EQU   CVTS01+720                                               00907000
CVTRV625 EQU   CVTS01+716                                               00908000
CVTRV624 EQU   CVTS01+712                                               00909000
CVTRV623 EQU   CVTS01+708                                               00910000
CVTRV622 EQU   CVTS01+704                                               00911000
CVTRV621 EQU   CVTS01+700                                               00912000
CVTRV620 EQU   CVTS01+696                                               00913000
CVTRV619 EQU   CVTS01+692                                               00914000
CVTRV618 EQU   CVTS01+688                                               00915000
CVTRV617 EQU   CVTS01+684                                               00916000
CVTRV616 EQU   CVTS01+680                                               00917000
CVTRV615 EQU   CVTS01+676                                               00918000
CVTRV614 EQU   CVTS01+672                                               00919000
CVTRV613 EQU   CVTS01+668                                               00920000
CVT0PT03 EQU   CVTS01+660                                               00921000
CVT0PT0E EQU   CVTS01+656                                               00922000
CVTIRM   EQU   CVTS01+652                                               00923000
CVTCGK   EQU   CVTS01+648                                               00924000
CVTRV607 EQU   CVTS01+644                                               00925000
CVTRV606 EQU   CVTS01+640                                               00926000
CVTRV605 EQU   CVTS01+636                                               00927000
CVTRV604 EQU   CVTS01+632                                               00928000
CVTEFF02 EQU   CVTS01+628                                               00929000
CVTCBBR  EQU   CVTS01+624                                               00930000
CVTSSCR  EQU   CVTS01+620                                               00931000
CVTEVENT EQU   CVTS01+616                                               00932000
CVTCRCA  EQU   CVTS01+612                                               00933000
CVTTPIO  EQU   CVTS01+608                                               00934000
CVTADV   EQU   CVTS01+604                                               00935000
CVTGSDAB EQU   CVTGSDA                                                  00936000
CVTQV3   EQU   CVTS01+596                                               00937000
CVTQV2   EQU   CVTS01+592                                               00938000
CVTQV1   EQU   CVTS01+588                                               00939000
CVTRPT   EQU   CVTS01+584                                               00940000
CVTSSRB  EQU   CVTS01+580                                               00941000
CVTCSDRL EQU   CVTS01+576                                               00942000
CVTEXP1  EQU   CVTS01+572                                               00943000
CVTRMPMT EQU   CVTS01+568                                               00944000
CVTRMPTT EQU   CVTS01+564                                               00945000
CVTVPSA  EQU   CVTS01+560                                               00946000
CVTVSTOP EQU   CVTS01+556                                               00947000
CVTGTFR8 EQU   CVTS01+552                                               00948000
CVTQUIT  EQU   CVTS01+548                                               00949000
CVTVACR  EQU   CVTS01+544                                               00950000
CVTWTCB  EQU   CVTS01+540                                               00951000
CVTSTPRS EQU   CVTS01+536                                               00952000
CVT0PT02 EQU   CVTS01+532                                               00953000
CVTDARCM EQU   CVTS01+528                                               00954000
CVTIRECM EQU   CVTS01+524                                               00955000
CVTJRECM EQU   CVTS01+520                                               00956000
CVTVEMS0 EQU   CVTS01+516                                               00957000
CVTSPFRR EQU   CVTS01+512                                               00958000
CVTRLSTG EQU   CVTS01+508                                               00959000
CVT0TC0A EQU   CVTS01+504                                               00960000
CVTGMBR  EQU   CVTS01+500                                               00961000
CVTLFRM  EQU   CVTS01+496                                               00962000
CVTRMBR  EQU   CVTS01+492                                               00963000
CVTVIOP  EQU   CVTS01+488                                               00964000
CVTRV307 EQU   CVTS01+486                                               00965000
CVTRV306 EQU   CVTS01+484                                               00966000
CVTRV305 EQU   CVTS01+482                                               00967000
CVTRV304 EQU   CVTS01+480                                               00968000
CVTRV303 EQU   CVTS01+478                                               00969000
CVTRV302 EQU   CVTS01+476                                               00970000
CVTTRCA  EQU   CVTS01+472                                               00971000
CVTRV297 EQU   CVTRV289                                                 00972000
CVTRV296 EQU   CVTRV289                                                 00973000
CVTRV295 EQU   CVTRV289                                                 00974000
CVTRV294 EQU   CVTRV289                                                 00975000
CVTRV293 EQU   CVTRV289                                                 00976000
CVTRV292 EQU   CVTRV289                                                 00977000
CVTRV291 EQU   CVTRV289                                                 00978000
CVTRV290 EQU   CVTRV289                                                 00979000
CVTRV288 EQU   CVTRV280                                                 00980000
CVTRV287 EQU   CVTRV280                                                 00981000
CVTRV286 EQU   CVTRV280                                                 00982000
CVTRV285 EQU   CVTRV280                                                 00983000
CVTRV284 EQU   CVTRV280                                                 00984000
CVTRV283 EQU   CVTRV280                                                 00985000
CVTRV282 EQU   CVTRV280                                                 00986000
CVTRV281 EQU   CVTRV280                                                 00987000
CVTRV279 EQU   CVTRV271                                                 00988000
CVTRV278 EQU   CVTRV271                                                 00989000
CVTRV277 EQU   CVTRV271                                                 00990000
CVTRV276 EQU   CVTRV271                                                 00991000
CVTRV275 EQU   CVTRV271                                                 00992000
CVTRV274 EQU   CVTRV271                                                 00993000
CVTRV273 EQU   CVTRV271                                                 00994000
CVTRV272 EQU   CVTRV271                                                 00995000
CVTRV270 EQU   CVTRV262                                                 00996000
CVTRV269 EQU   CVTRV262                                                 00997000
CVTRV268 EQU   CVTRV262                                                 00998000
CVTRV267 EQU   CVTRV262                                                 00999000
CVTRV266 EQU   CVTRV262                                                 01000000
CVTRV265 EQU   CVTRV262                                                 01001000
CVTRV264 EQU   CVTRV262                                                 01002000
CVTRV263 EQU   CVTRV262                                                 01003000
CVTVFP   EQU   CVTS01+464                                               01004000
CVTVSI   EQU   CVTS01+460                                               01005000
CVTVPSIB EQU   CVTS01+456                                               01006000
CVTMFACT EQU   CVTMFRTR                                                 01007000
CVTMFCTL EQU   CVTS01+448                                               01008000
CVTPVBP  EQU   CVTS01+444                                               01009000
CVTPWI   EQU   CVTS01+440                                               01010000
CVTRV254 EQU   CVTS01+438                                               01011000
CVTRV253 EQU   CVTS01+436                                               01012000
CVTRV252 EQU   CVTS01+434                                               01013000
CVTRV251 EQU   CVTS01+433                                               01014000
CVTRV250 EQU   CVTS01+432                                               01015000
CVTRV249 EQU   CVTS01+431                                               01016000
CVTRV248 EQU   CVTS01+430                                               01017000
CVTRV247 EQU   CVTS01+429                                               01018000
CVTRV246 EQU   CVTS01+428                                               01019000
CVTRV245 EQU   CVTRV237                                                 01020000
CVTRV244 EQU   CVTRV237                                                 01021000
CVTRV243 EQU   CVTRV237                                                 01022000
CVTRV242 EQU   CVTRV237                                                 01023000
CVTRV241 EQU   CVTRV237                                                 01024000
CVTRV240 EQU   CVTRV237                                                 01025000
CVTRV239 EQU   CVTRV237                                                 01026000
CVTRV238 EQU   CVTRV237                                                 01027000
CVTRV236 EQU   CVTRV228                                                 01028000
CVTRV235 EQU   CVTRV228                                                 01029000
CVTRV234 EQU   CVTRV228                                                 01030000
CVTRV233 EQU   CVTRV228                                                 01031000
CVTRV232 EQU   CVTRV228                                                 01032000
CVTRV231 EQU   CVTRV228                                                 01033000
CVTRV230 EQU   CVTRV228                                                 01034000
CVTRV229 EQU   CVTRV228                                                 01035000
CVTRV227 EQU   CVTRV219                                                 01036000
CVTRV226 EQU   CVTRV219                                                 01037000
CVTRV225 EQU   CVTRV219                                                 01038000
CVTRV224 EQU   CVTRV219                                                 01039000
CVTRV223 EQU   CVTRV219                                                 01040000
CVTRV222 EQU   CVTRV219                                                 01041000
CVTRV221 EQU   CVTRV219                                                 01042000
CVTRV220 EQU   CVTRV219                                                 01043000
CVTRV218 EQU   CVTRV210                                                 01044000
CVTRV217 EQU   CVTRV210                                                 01045000
CVTRV216 EQU   CVTRV210                                                 01046000
CVTRV215 EQU   CVTRV210                                                 01047000
CVTRV214 EQU   CVTRV210                                                 01048000
CVTRV213 EQU   CVTRV210                                                 01049000
CVTRV212 EQU   CVTRV210                                                 01050000
CVTRV211 EQU   CVTRV210                                                 01051000
CVTLCCAT EQU   CVTS01+420                                               01052000
CVTPCCAT EQU   CVTS01+416                                               01053000
CVTIPCRP EQU   CVTS01+412                                               01054000
CVTIPCRI EQU   CVTS01+408                                               01055000
CVTIPCDS EQU   CVTS01+404                                               01056000
CVTAIDVT EQU   CVTS01+400                                               01057000
CVTSSAP  EQU   CVTS01+396                                               01058000
CVTEHCIR EQU   CVTS01+392                                               01059000
CVTEHDEF EQU   CVTS01+388                                               01060000
CVTDAIR  EQU   CVTS01+384                                               01061000
CVTPERFM EQU   CVTS01+380                                               01062000
CVT044R2 EQU   CVTS01+376                                               01063000
CVTFETCH EQU   CVTS01+372                                               01064000
CVTRSTWD EQU   CVTS01+368                                               01065000
CVTSPOST EQU   CVTS01+364                                               01066000
CVTIOBP  EQU   CVTS01+360                                               01067000
CVTASMVT EQU   CVTS01+356                                               01068000
CVTRECRQ EQU   CVTS01+352                                               01069000
CVTWSAC  EQU   CVTS01+348                                               01070000
CVTRV149 EQU   CVTS01+344                                               01071000
CVTWSAL  EQU   CVTS01+340                                               01072000
CVTSPSA  EQU   CVTS01+336                                               01073000
CVTGLMN  EQU   CVTS01+332                                               01074000
CVTVEAC0 EQU   CVTS01+328                                               01075000
CVT062R1 EQU   CVTS01+324                                               01076000
CVTRPOST EQU   CVTS01+320                                               01077000
CVTDQIQE EQU   CVTS01+316                                               01078000
CVTCSD   EQU   CVTS01+312                                               01079000
CVTLKRMA EQU   CVTS01+308                                               01080000
CVTRSPIE EQU   CVTS01+304                                               01081000
CVTRENQ  EQU   CVTS01+300                                               01082000
CVTLQCB  EQU   CVTS01+296                                               01083000
CVTFQCB  EQU   CVTS01+292                                               01084000
CVTQCS01 EQU   CVTS01+288                                               01085000
CVTAPFT  EQU   CVTS01+284                                               01086000
CVTPARRL EQU   CVTS01+280                                               01087000
CVTVWAIT EQU   CVTS01+276                                               01088000
CVTGSPL  EQU   CVTS01+272                                               01089000
CVTLSMQ  EQU   CVTS01+268                                               01090000
CVTGSMQ  EQU   CVTS01+264                                               01091000
CVTEXPRO EQU   CVTS01+260                                               01092000
CVTOPCTP EQU   CVTS01+256                                               01093000
CVTSIC   EQU   CVTS01+252                                               01094000
CVTTPIOS EQU   CVTS01+248                                               01095000
CVTRTMS  EQU   CVTS01+244                                               01096000
CVTSDBF  EQU   CVTS01+240                                               01097000
CVTSCBP  EQU   CVTS01+236                                               01098000
CVTSDMP  EQU   CVTS01+232                                               01099000
CVTSV60  EQU   CVTS01+228                                               01100000
CVTRTMCT EQU   CVTS01+224                                               01101000
CVTASCBL EQU   CVTS01+220                                               01102000
CVTASCBH EQU   CVTS01+216                                               01103000
CVTGDA   EQU   CVTS01+212                                               01104000
CVTASVT  EQU   CVTS01+208                                               01105000
CVTVVMDI EQU   CVTS01+204                                               01106000
CVTAQTOP EQU   CVTS01+200                                               01107000
CVTIOSCS EQU   CVTS01+196                                               01108000
CVTSDRM  EQU   CVTS01+192                                               01109000
CVTOPTE  EQU   CVTS01+188                                               01110000
CVTSTXU  EQU   CVTS01+184                                               01111000
CVTQUIS  EQU   CVTS01+180                                               01112000
CVTPARS  EQU   CVTS01+176                                               01113000
CVTS1EE  EQU   CVTS01+172                                               01114000
CVTFRAS  EQU   CVTS01+168                                               01115000
CVTQSAS  EQU   CVTS01+164                                               01116000
CVTCRAS  EQU   CVTS01+160                                               01117000
CVTCRMN  EQU   CVTS01+156                                               01118000
CVTDELCP EQU   CVTS01+152                                               01119000
CVTFRECL EQU   CVTS01+148                                               01120000
CVTGETCL EQU   CVTS01+144                                               01121000
CVTBLDCP EQU   CVTS01+140                                               01122000
CVTAUTHL EQU   CVTS01+136                                               01123000
CVTSCAN  EQU   CVTS01+132                                               01124000
CVTRV144 EQU   CVTS01+130                                               01125000
CVTMAXMP EQU   CVTS01+128                                               01126000
CVTSTCK  EQU   CVTS01+124                                               01127000
CVTRV139 EQU   CVTS01+123                                               01128000
CVTDSSAC EQU   CVTS01+122                                               01129000
CVTRV513 EQU   CVTS01+121                                               01130000
CVTIOSPL EQU   CVTS01+120                                               01131000
CVTPTGT  EQU   CVTS01+116                                               01132000
CVTCSPIE EQU   CVTS01+112                                               01133000
CVTSMFEX EQU   CVTS01+108                                               01134000
CVTOLT0A EQU   CVTS01+104                                               01135000
CVTSRBRT EQU   CVTS01+100                                               01136000
CVTPUTL  EQU   CVTS01+96                                                01137000
CVTASCRL EQU   CVTS01+92                                                01138000
CVTASCRF EQU   CVTS01+88                                                01139000
CVTRV326 EQU   CVTS01+84                                                01140000
CVTRV325 EQU   CVTS01+80                                                01141000
CVTRV324 EQU   CVTS01+76                                                01142000
CVT0VL01 EQU   CVTS01+72                                                01143000
CVTSHRVM EQU   CVTS01+68                                                01144000
CVTRV332 EQU   CVTS01+64                                                01145000
CVTTAS   EQU   CVTS01+60                                                01146000
CVTRSCN  EQU   CVTS01+56                                                01147000
CVTTRAC2 EQU   CVTS01+54                                                01148000
CVTTRACE EQU   CVTS01+52                                                01149000
CVTAPG   EQU   CVTS01+51                                                01150000
CVTSDTRC EQU   CVTCTLFG                                                 01151000
CVTGTRCE EQU   CVTCTLFG                                                 01152000
CVTNOMP  EQU   CVTCTLFG                                                 01153000
CVTRSV79 EQU   CVTCTLFG                                                 01154000
CVTDSTAT EQU   CVTCTLFG                                                 01155000
CVTRSV78 EQU   CVTCTLFG                                                 01156000
CVTRV333 EQU   CVTCTLFG                                                 01157000
CVTRV323 EQU   CVTCTLFG                                                 01158000
CVTSPVLK EQU   CVTS01+49                                                01159000
CVTRSV77 EQU   CVTS01+48                                                01160000
CVTRV331 EQU   CVTS01+44                                                01161000
CVTRV330 EQU   CVTS01+40                                                01162000
CVTRV329 EQU   CVTS01+36                                                01163000
CVTRV328 EQU   CVTS01+32                                                01164000
CVTRV322 EQU   CVTS01+28                                                01165000
CVTSLID  EQU   CVTSLIDA+1                                               01166000
CVTSYLK  EQU   CVTSLIDA                                                 01167000
CVTRV321 EQU   CVTS01+20                                                01168000
CVTRV320 EQU   CVTS01+16                                                01169000
CVTLPDIR EQU   CVTLPDIA+1                                               01170000
CVTRSV69 EQU   CVTDIRST                                                 01171000
CVTRSV68 EQU   CVTDIRST                                                 01172000
CVTRSV67 EQU   CVTDIRST                                                 01173000
CVTRSV66 EQU   CVTDIRST                                                 01174000
CVTRSV65 EQU   CVTDIRST                                                 01175000
CVTRSV64 EQU   CVTDIRST                                                 01176000
CVTRSV63 EQU   CVTDIRST                                                 01177000
CVTDICOM EQU   CVTDIRST                                                 01178000
CVTPVTP  EQU   CVTS01+8                                                 01179000
CVTLPDSR EQU   CVTS01+4                                                 01180000
CVTGETL  EQU   CVTS01                                                   01181000
PSARSAV  EQU   PSARSVTE+60                                              01182000
PSARSTK  EQU   PSARSVTE+56                                              01183000
PSAESAV3 EQU   PSARSVTE+52                                              01184000
PSAESTK3 EQU   PSARSVTE+48                                              01185000
PSAESAV2 EQU   PSARSVTE+44                                              01186000
PSAESTK2 EQU   PSARSVTE+40                                              01187000
PSAESAV1 EQU   PSARSVTE+36                                              01188000
PSAESTK1 EQU   PSARSVTE+32                                              01189000
PSAPSAV  EQU   PSARSVTE+28                                              01190000
PSAPSTK  EQU   PSARSVTE+24                                              01191000
PSAMSAV  EQU   PSARSVTE+20                                              01192000
PSAMSTK  EQU   PSARSVTE+16                                              01193000
PSASSAV  EQU   PSARSVTE+12                                              01194000
PSASSTK  EQU   PSARSVTE+8                                               01195000
PSANSTK  EQU   PSARSVTE+4                                               01196000
PSACSTK  EQU   PSARSVTE                                                 01197000
@NM00073 EQU   OPNXFLGS+3                                               01198000
@NM00072 EQU   OPNXFLGS+2                                               01199000
@NM00071 EQU   OPNXFLGS+1                                               01200000
OPNXASID EQU   OPNXFLGS+1                                               01201000
OPNXEDIT EQU   OPNXFLGS+1                                               01202000
OPNXBRK  EQU   OPNXFLGS+1                                               01203000
OPNXHOLD EQU   OPNXFLGS+1                                               01204000
@NM00070 EQU   OPNXFLGS                                                 01205000
OPNXADTP EQU   OPNXFLGS                                                 01206000
OPNXALC  EQU   OPNXFLGS                                                 01207000
OPNXBFSZ EQU   OPARMS+14                                                01208000
@NM00069 EQU   OPARMS+12                                                01209000
@NM00068 EQU   OPFLAGS+3                                                01210000
@NM00067 EQU   OPFLAGS+2                                                01211000
@NM00066 EQU   OPOPTNS                                                  01212000
OPASID   EQU   OPOPTNS                                                  01213000
OPEDIT   EQU   OPOPTNS                                                  01214000
OPBRK    EQU   OPOPTNS                                                  01215000
OPHOLD   EQU   OPOPTNS                                                  01216000
@NM00065 EQU   OPFLAGS                                                  01217000
OPADTOP  EQU   OPFLAGS                                                  01218000
OPALLOC  EQU   OPFLAGS                                                  01219000
TVWAEND  EQU   TVWA+216                                                 01220000
@NM00064 EQU   TVWA+208                                                 01221000
TVWAUSRA EQU   TVWA+200                                                 01222000
@NM00063 EQU   TVWA+192                                                 01223000
TVWAFRWO EQU   TVWA+188                                                 01224000
TVWAFRWI EQU   TVWA+184                                                 01225000
TVWARSHW EQU   TVWA+183                                                 01226000
@NM00062 EQU   TVWAFLG6                                                 01227000
TVWAINB  EQU   TVWAFLG6                                                 01228000
TVWAFMEW EQU   TVWAFLG6                                                 01229000
TVWARCDT EQU   TVWAFLG6                                                 01230000
TVWAIOP  EQU   TVWAFLG6                                                 01231000
TVWAIOTR EQU   TVWAFLG6                                                 01232000
TVWAISYS EQU   TVWAFLG6                                                 01233000
@NM00061 EQU   TVWA+180                                                 01234000
TVWAQMLB EQU   TVWA+176                                                 01235000
TVWAATBO EQU   TVWA+172                                                 01236000
TVWAATBI EQU   TVWA+168                                                 01237000
TVWATRNM EQU   TVWA+160                                                 01238000
TVWATABO EQU   TVWA+156                                                 01239000
TVWATABI EQU   TVWA+152                                                 01240000
TVWALNCT EQU   TVWA+151                                                 01241000
TVWAP1ST EQU   TVWAFLG5                                                 01242000
TVWAPRMT EQU   TVWAFLG5                                                 01243000
TVWANFSP EQU   TVWAFLG5                                                 01244000
TVWATIR  EQU   TVWAFLG5                                                 01245000
TVWAFSW  EQU   TVWAFLG5                                                 01246000
TVWAWO   EQU   TVWAFLG5                                                 01247000
TVWAFSM  EQU   TVWAFLG5                                                 01248000
TVWASCAN EQU   TVWAFLG5                                                 01249000
@NM00060 EQU   TVWA+148                                                 01250000
TVWADARC EQU   TVWAFLG4                                                 01251000
TVWARCRS EQU   TVWAFLG4                                                 01252000
TVWAQMEV EQU   TVWAFLG4                                                 01253000
TVWAFLSC EQU   TVWAFLG4                                                 01254000
TVWANOFB EQU   TVWAFLG4                                                 01255000
TVWAKBDL EQU   TVWAFLG4                                                 01256000
TVWADOOQ EQU   TVWAFLG4                                                 01257000
TVWAFMSC EQU   TVWAFLG4                                                 01258000
TVWATRDF EQU   TVWAFLG3                                                 01259000
TVWATRAN EQU   TVWAFLG3                                                 01260000
TVWAQLBU EQU   TVWAFLG3                                                 01261000
TVWAQMIO EQU   TVWAFLG3                                                 01262000
TVWAQMRT EQU   TVWAFLG3                                                 01263000
TVWAAIGN EQU   TVWAFLG3                                                 01264000
TVWASDSG EQU   TVWAFLG3                                                 01265000
TVWABRIN EQU   TVWAFLG3                                                 01266000
TVWABIR  EQU   TVWAFLG2                                                 01267000
TVWARTRY EQU   TVWAFLG2                                                 01268000
TVWABKMG EQU   TVWAFLG2                                                 01269000
TVWAERMG EQU   TVWAFLG2                                                 01270000
TVWAGERR EQU   TVWAFLG2                                                 01271000
TVWASCD  EQU   TVWAFLG2                                                 01272000
TVWAPGN  EQU   TVWAFLG2                                                 01273000
TVWABFC  EQU   TVWAFLG2                                                 01274000
TVWAOOPS EQU   TVWAFLG1                                                 01275000
TVWALTE  EQU   TVWAFLG1                                                 01276000
TVWAULK  EQU   TVWAFLG1                                                 01277000
TVWAXSCD EQU   TVWAFLG1                                                 01278000
TVWATID  EQU   TVWAFLG1                                                 01279000
TVWATAS  EQU   TVWAFLG1                                                 01280000
TVWATIS  EQU   TVWAFLG1                                                 01281000
TVWATOD  EQU   TVWAFLG1                                                 01282000
TVWADIN3 EQU   TVWADLST+8                                               01283000
TVWADIN2 EQU   TVWADLST+4                                               01284000
TVWADIN1 EQU   TVWADLST                                                 01285000
TVWAECB3 EQU   TVWAECBL+8                                               01286000
TVWAECB2 EQU   TVWAECBL+4                                               01287000
TVWAECB1 EQU   TVWAECBL                                                 01288000
TVWATECB EQU   TVWA+116                                                 01289000
TVWAECB  EQU   TVWA+112                                                 01290000
TVWALNSV EQU   TVWA+111                                                 01291000
@NM00059 EQU   TVWAFLG7                                                 01292000
TVWACHSE EQU   TVWAFLG7                                                 01293000
TVWATOBB EQU   TVWAFLG7                                                 01294000
TVWARISW EQU   TVWAFLG7                                                 01295000
TVWARET  EQU   TVWAFLG7                                                 01296000
TVWARDBF EQU   TVWAFLG7                                                 01297000
TVWASND1 EQU   TVWAFLG7                                                 01298000
TVWABKPG EQU   TVWAFLG7                                                 01299000
TVWAVSZ  EQU   TVWA+108                                                 01300000
TVWAEXL  EQU   TVWA+100                                                 01301000
TVWANIB  EQU   TVWA+92                                                  01302000
TVWAACB  EQU   TVWA+88                                                  01303000
TVWATQL2 EQU   TVWA+87                                                  01304000
TVWATQL1 EQU   TVWA+86                                                  01305000
TVWAATTN EQU   TVWA+85                                                  01306000
TVWACHNL EQU   TVWA+84                                                  01307000
TVWALBUF EQU   TVWA+80                                                  01308000
TVWAHBUF EQU   TVWA+76                                                  01309000
TVWACLSZ EQU   TVWA+74                                                  01310000
TVWAGMPT EQU   TVWA+68                                                  01311000
TVWATCB  EQU   TVWA+64                                                  01312000
TVWAUSMN EQU   TVWA+60                                                  01313000
TVWACPID EQU   TVWA+56                                                  01314000
TVWAEOQ  EQU   TVWA+52                                                  01315000
TVWANOM  EQU   TVWA+48                                                  01316000
TVWABOQ  EQU   TVWA+44                                                  01317000
TVWAEIQ  EQU   TVWA+40                                                  01318000
TVWANIM  EQU   TVWA+36                                                  01319000
TVWABIQ  EQU   TVWA+32                                                  01320000
TVWAQMWA EQU   TVWA+28                                                  01321000
TVWABFPT EQU   TVWA+20                                                  01322000
TVWATOPQ EQU   TVWA+16                                                  01323000
TVWATOMW EQU   TVWA+12                                                  01324000
TVWATIMW EQU   TVWA+8                                                   01325000
TVWAPPL  EQU   TVWA                                                     01326000
TSBXEND  EQU   TSBX+120                                                 01327000
@NM00058 EQU   TSBX+116                                                 01328000
TSBXRPL  EQU   TSBX+76                                                  01329000
TSBXTMBF EQU   TSBXTERM+2                                               01330000
@NM00057 EQU   TSBXTERM+1                                               01331000
TSBXRSZO EQU   TSBX+69                                                  01332000
TSBXRSZI EQU   TSBX+68                                                  01333000
TSBXLBUF EQU   TSBX+64                                                  01334000
TSBXCSAP EQU   TSBX+60                                                  01335000
TSBXSRB  EQU   TSBX+56                                                  01336000
TSBXSRBI EQU   TSBX+52                                                  01337000
@NM00056 EQU   TSBX+48                                                  01338000
TSBXTOM  EQU   TSBX+44                                                  01339000
TSBXTIM  EQU   TSBX+40                                                  01340000
@NM00055 EQU   TSBX+33                                                  01341000
@NM00054 EQU   TSBXFLG1                                                 01342000
TSBXLOGF EQU   TSBXFLG1                                                 01343000
@NM00053 EQU   TSBX+16                                                  01344000
@NM00052 EQU   TSBX+12                                                  01345000
TSBXBCK  EQU   TSBX+4                                                   01346000
TSBEND   EQU   TSB+120                                                  01347000
TSBSF1   EQU   TSB+112                                                  01348000
TSBALTC  EQU   TSB+103                                                  01349000
TSBALTR  EQU   TSB+102                                                  01350000
TSBPRMC  EQU   TSB+101                                                  01351000
TSBPRMR  EQU   TSB+100                                                  01352000
TSBLECB  EQU   TSBMINL                                                  01353000
TSBLINE  EQU   TSB+82                                                   01354000
TSBSTAX  EQU   TSB+81                                                   01355000
TSBATTNC EQU   TSB+80                                                   01356000
TSBF1V   EQU   TSBTPOST+7                                               01357000
TSBF1M   EQU   TSBTPOST+6                                               01358000
TSBF2V   EQU   TSBTPOST+5                                               01359000
TSBF2M   EQU   TSBTPOST+4                                               01360000
TSBFLAGV EQU   TSBTPOST+3                                               01361000
TSBFLAGM EQU   TSBTPOST+2                                               01362000
TSBSBASV EQU   TSBTPOST+1                                               01363000
@NM00051 EQU   TSBTPFLG                                                 01364000
@NM00050 EQU   TSBTPFLG                                                 01365000
@NM00049 EQU   TSBTPFLG                                                 01366000
@NM00048 EQU   TSBTPFLG                                                 01367000
TSBNEWID EQU   TSBTPFLG                                                 01368000
TSBTPAYI EQU   TSBTPFLG                                                 01369000
TSBTPQCB EQU   TSBTPFLG                                                 01370000
TSBPOSTO EQU   TSBTPFLG                                                 01371000
TSBLINKB EQU   TSBLINKA+1                                               01372000
TSBPRI   EQU   TSBLINKA                                                 01373000
TSBRQCB  EQU   TSBRCB                                                   01374000
TSBCTCB  EQU   TSB+60                                                   01375000
TSBERSDS EQU   TSB+56                                                   01376000
TSBAUTOI EQU   TSB+52                                                   01377000
TSBAUTOS EQU   TSB+48                                                   01378000
TSBATNCC EQU   TSB+44                                                   01379000
TSBASRCE EQU   TSB+42                                                   01380000
TSBHLDL  EQU   TSBFLG4                                                  01381000
TSBGETBF EQU   TSBFLG4                                                  01382000
TSBCANC  EQU   TSBFLG4                                                  01383000
TSBHOLD  EQU   TSBFLG4                                                  01384000
TSBHUNG  EQU   TSBFLG4                                                  01385000
TSBOWAIT EQU   TSBFLG4                                                  01386000
TSBIWAIT EQU   TSBFLG4                                                  01387000
TSBOCAB  EQU   TSBFLG4                                                  01388000
TSBLNNO  EQU   TSB+40                                                   01389000
TSBATNTC EQU   TSB+38                                                   01390000
TSBATNLC EQU   TSB+36                                                   01391000
TSBCHDCC EQU   TSBSTCC+1                                                01392000
TSBLNDCC EQU   TSBSTCC                                                  01393000
TSBWTJID EQU   TSB+32                                                   01394000
TSBECB   EQU   TSB+28                                                   01395000
TSBC1050 EQU   TSBTERM2                                                 01396000
@NM00047 EQU   TSBTERM2                                                 01397000
@NM00046 EQU   TSBTERM2                                                 01398000
@NM00045 EQU   TSBTERM2                                                 01399000
@NM00044 EQU   TSBTERM2                                                 01400000
TSBCTWX  EQU   TSBTERM2                                                 01401000
@NM00043 EQU   TSBTERM2                                                 01402000
@NM00042 EQU   TSBTERM2                                                 01403000
@NM00041 EQU   TSBTERM1                                                 01404000
@NM00040 EQU   TSBTERM1                                                 01405000
@NM00039 EQU   TSBTERM1                                                 01406000
TSBC2741 EQU   TSBTERM1                                                 01407000
TSBC5041 EQU   TSBTERM1                                                 01408000
TSBCATTN EQU   TSBTERM1                                                 01409000
TSBCBRK  EQU   TSBTERM1                                                 01410000
TSBCIHBN EQU   TSBTERM1                                                 01411000
TSBVTAM  EQU   TSBFLG5                                                  01412000
TSBKEYS  EQU   TSBFLG5                                                  01413000
@NM00038 EQU   TSBFLG5                                                  01414000
TSBATMP  EQU   TSBFLG5                                                  01415000
TSBNFLOP EQU   TSBFLG3                                                  01416000
TSBNOBRK EQU   TSBFLG3                                                  01417000
TSBTPUT  EQU   TSBFLG3                                                  01418000
TSBAWOIP EQU   TSBFLG3                                                  01419000
TSBNBKSP EQU   TSBFLG3                                                  01420000
TSBSPIT  EQU   TSBFLG3                                                  01421000
TSBTJMSG EQU   TSBFLG3                                                  01422000
TSBATTN  EQU   TSBFLG3                                                  01423000
TSBIBFP  EQU   TSB+21                                                   01424000
TSBNIBF  EQU   TSB+20                                                   01425000
TSBITBFP EQU   TSB+17                                                   01426000
TSBSATN2 EQU   TSBFLG2                                                  01427000
TSBSATN1 EQU   TSBFLG2                                                  01428000
TSBSTAUT EQU   TSBFLG2                                                  01429000
TSBAUTOC EQU   TSBFLG2                                                  01430000
TSBAULST EQU   TSBFLG2                                                  01431000
TSBBRKIN EQU   TSBFLG2                                                  01432000
TSBAUTON EQU   TSBFLG2                                                  01433000
TSBBIPI  EQU   TSBFLG2                                                  01434000
TSBOBFP  EQU   TSB+13                                                   01435000
TSBNOBF  EQU   TSB+12                                                   01436000
TSBOTBFP EQU   TSB+9                                                    01437000
TSBLNSZ  EQU   TSB+8                                                    01438000
TSBWTCB  EQU   TSB+5                                                    01439000
TSBTJBF  EQU   TSBFLG1                                                  01440000
TSBTJIP  EQU   TSBFLG1                                                  01441000
TSBTJOW  EQU   TSBFLG1                                                  01442000
TSBIFLSH EQU   TSBFLG1                                                  01443000
TSBWOWIP EQU   TSBFLG1                                                  01444000
TSBOWIP  EQU   TSBFLG1                                                  01445000
TSBOFLSH EQU   TSBFLG1                                                  01446000
TSBANSR  EQU   TSBFLG1                                                  01447000
TSBASCB  EQU   TSBASCBA+1                                               01448000
TSBATNLD EQU   TSBSTAT                                                  01449000
TSBDISC  EQU   TSBSTAT                                                  01450000
TSBITOFF EQU   TSBSTAT                                                  01451000
TSBNOBUF EQU   TSBSTAT                                                  01452000
TSBLWAIT EQU   TSBSTAT                                                  01453000
TSBINUSE EQU   TSBSTAT                                                  01454000
ASCBEND  EQU   ASCB+208                                                 01455000
ASCBSRBT EQU   ASCB+200                                                 01456000
ASCBSWTL EQU   ASCB+196                                                 01457000
ASCBRS14 EQU   ASCB+195                                                 01458000
ASCBSMCT EQU   ASCB+194                                                 01459000
ASCBRS12 EQU   ASCB+192                                                 01460000
ASCBPCTT EQU   ASCB+188                                                 01461000
ASCBVGTT EQU   ASCB+184                                                 01462000
ASCBRV43 EQU   ASCBSRQ4                                                 01463000
ASCBRV42 EQU   ASCBSRQ4                                                 01464000
ASCBRV41 EQU   ASCBSRQ4                                                 01465000
ASCBRV40 EQU   ASCBSRQ4                                                 01466000
ASCBRV39 EQU   ASCBSRQ4                                                 01467000
ASCBRV38 EQU   ASCBSRQ4                                                 01468000
ASCBRV37 EQU   ASCBSRQ4                                                 01469000
ASCBRV36 EQU   ASCBSRQ4                                                 01470000
ASCBRV35 EQU   ASCBSRQ3                                                 01471000
ASCBRV34 EQU   ASCBSRQ3                                                 01472000
ASCBRV33 EQU   ASCBSRQ3                                                 01473000
ASCBRV32 EQU   ASCBSRQ3                                                 01474000
ASCBRV31 EQU   ASCBSRQ3                                                 01475000
ASCBRV30 EQU   ASCBSRQ3                                                 01476000
ASCBRV29 EQU   ASCBSRQ3                                                 01477000
ASCBRV28 EQU   ASCBSRQ3                                                 01478000
ASCBRV27 EQU   ASCBSRQ2                                                 01479000
ASCBRV26 EQU   ASCBSRQ2                                                 01480000
ASCBRV25 EQU   ASCBSRQ2                                                 01481000
ASCBRV24 EQU   ASCBSRQ2                                                 01482000
ASCBRV23 EQU   ASCBSRQ2                                                 01483000
ASCBRV22 EQU   ASCBSRQ2                                                 01484000
ASCBRV21 EQU   ASCBSRQ2                                                 01485000
ASCBRV20 EQU   ASCBSRQ2                                                 01486000
ASCBRV19 EQU   ASCBSRQ1                                                 01487000
ASCBRV18 EQU   ASCBSRQ1                                                 01488000
ASCBRV17 EQU   ASCBSRQ1                                                 01489000
ASCBRV16 EQU   ASCBSRQ1                                                 01490000
ASCBRV15 EQU   ASCBSRQ1                                                 01491000
ASCBRV14 EQU   ASCBSRQ1                                                 01492000
ASCBRV13 EQU   ASCBSRQ1                                                 01493000
ASCBSTA  EQU   ASCBSRQ1                                                 01494000
ASCBJBNS EQU   ASCB+176                                                 01495000
ASCBJBNI EQU   ASCB+172                                                 01496000
ASCBMCC  EQU   ASCB+168                                                 01497000
ASCBRTWA EQU   ASCB+164                                                 01498000
ASCBIQEA EQU   ASCB+160                                                 01499000
ASCBXMPQ EQU   ASCB+156                                                 01500000
ASCBRS01 EQU   ASCB+154                                                 01501000
ASCBFMCT EQU   ASCB+152                                                 01502000
ASCBOUXB EQU   ASCB+148                                                 01503000
ASCBOUCB EQU   ASCB+144                                                 01504000
ASCBMECB EQU   ASCB+140                                                 01505000
ASCBQECB EQU   ASCB+136                                                 01506000
ASCBLSQH EQU   ASCBLKGP+4                                               01507000
ASCBLOCK EQU   ASCBLKGP                                                 01508000
ASCBTCBS EQU   ASCB+124                                                 01509000
ASCBNVSC EQU   ASCB+122                                                 01510000
ASCBVSC  EQU   ASCB+120                                                 01511000
ASCBSRBS EQU   ASCB+118                                                 01512000
ASCBSSRB EQU   ASCB+116                                                 01513000
ASCBRV06 EQU   ASCBFLG2                                                 01514000
ASCBRV05 EQU   ASCBFLG2                                                 01515000
ASCBRV04 EQU   ASCBFLG2                                                 01516000
ASCBSNQS EQU   ASCBFLG2                                                 01517000
ASCBS2S  EQU   ASCBFLG2                                                 01518000
ASCBCEXT EQU   ASCBFLG2                                                 01519000
ASCBPXMT EQU   ASCBFLG2                                                 01520000
ASCBXMPT EQU   ASCBFLG2                                                 01521000
ASCBRF07 EQU   ASCBDSP1                                                 01522000
ASCBRF06 EQU   ASCBDSP1                                                 01523000
ASCBRF05 EQU   ASCBDSP1                                                 01524000
ASCBRF04 EQU   ASCBDSP1                                                 01525000
ASCBRF03 EQU   ASCBDSP1                                                 01526000
ASCBRF02 EQU   ASCBDSP1                                                 01527000
ASCBFAIL EQU   ASCBDSP1                                                 01528000
ASCBNOQ  EQU   ASCBDSP1                                                 01529000
ASCBSWCT EQU   ASCB+112                                                 01530000
ASCBASXB EQU   ASCB+108                                                 01531000
ASCBTMCH EQU   ASCB+104                                                 01532000
ASCBNSWP EQU   ASCBFLG1                                                 01533000
ASCBTYP1 EQU   ASCBFLG1                                                 01534000
ASCBSTND EQU   ASCBFLG1                                                 01535000
ASCBABNT EQU   ASCBFLG1                                                 01536000
ASCBTERM EQU   ASCBFLG1                                                 01537000
ASCBS3S  EQU   ASCBFLG1                                                 01538000
ASCBCMSH EQU   ASCBFLG1                                                 01539000
ASCBTOFF EQU   ASCBFLG1                                                 01540000
ASCBRF01 EQU   ASCBRCTF                                                 01541000
ASCBTMLW EQU   ASCBRCTF                                                 01542000
ASCBOUT  EQU   ASCBRCTF                                                 01543000
ASCBWAIT EQU   ASCBRCTF                                                 01544000
ASCBRV08 EQU   ASCBRCTF                                                 01545000
ASCBFQU  EQU   ASCBRCTF                                                 01546000
ASCBFRS  EQU   ASCBRCTF                                                 01547000
ASCBTMNO EQU   ASCBRCTF                                                 01548000
ASCBAFFN EQU   ASCBFW1                                                  01549000
ASCBDUMP EQU   ASCB+96                                                  01550000
ASCBQSVC EQU   ASCB+92                                                  01551000
ASCBUBET EQU   ASCB+88                                                  01552000
ASCBECB  EQU   ASCB+84                                                  01553000
ASCBJSTL EQU   ASCB+80                                                  01554000
ASCBEWST EQU   ASCB+72                                                  01555000
ASCBEJST EQU   ASCB+64                                                  01556000
ASCBCSCB EQU   ASCB+56                                                  01557000
ASCBRSM  EQU   ASCB+52                                                  01558000
ASCBLDA  EQU   ASCB+48                                                  01559000
ASCBSTOR EQU   ASCB+44                                                  01560000
ASCBDP   EQU   ASCB+43                                                  01561000
ASCBRV07 EQU   ASCB+42                                                  01562000
ASCBIOSM EQU   ASCB+40                                                  01563000
ASCBSEQN EQU   ASCB+38                                                  01564000
ASCBASID EQU   ASCB+36                                                  01565000
ASCBCPUS EQU   ASCB+32                                                  01566000
ASCBSPL  EQU   ASCB+28                                                  01567000
ASCBIOSP EQU   ASCB+24                                                  01568000
ASCBSYNC EQU   ASCBSUPC+4                                               01569000
ASCBSVRB EQU   ASCBSUPC                                                 01570000
ASCBCMSF EQU   ASCB+12                                                  01571000
ASCBBWDP EQU   ASCB+8                                                   01572000
ASCBFWDP EQU   ASCB+4                                                   01573000
ASCBASCB EQU   ASCB                                                     01574000
ASCBEGIN EQU   ASCB                                                     01575000
TCASTEND EQU   TCAST+136                                                01576000
TCASDUMP EQU   TCAST+132                                                01577000
TCASSCHD EQU   TCAST+128                                                01578000
@NM00037 EQU   TCAST+124                                                01579000
TCASOMJR EQU   TCAST+120                                                01580000
@NM00036 EQU   TCAST+118                                                01581000
TCASATTN EQU   TCAST+112                                                01582000
TCASASCI EQU   TCAST+108                                                01583000
TCASTTQH EQU   TCAST+104                                                01584000
@NM00035 EQU   TCAST+102                                                01585000
@NM00034 EQU   TCAST+100                                                01586000
@NM00033 EQU   TCAST+98                                                 01587000
@NM00032 EQU   TCAST+96                                                 01588000
TCASASCB EQU   TCAST+92                                                 01589000
@NM00031 EQU   TCAST+90                                                 01590000
@NM00030 EQU   TCASFLG2                                                 01591000
@NM00029 EQU   TCASFLG1                                                 01592000
TCASNACT EQU   TCASFLG1                                                 01593000
@NM00028 EQU   TCASFLG1                                                 01594000
TCASABND EQU   TCASFLG1                                                 01595000
TCASMDSW EQU   TCASFLG1                                                 01596000
TCASBKMD EQU   TCASFLG1                                                 01597000
TCASLTE  EQU   TCAST+84                                                 01598000
TCASEXIT EQU   TCAST+80                                                 01599000
TCASIQM  EQU   TCAST+72                                                 01600000
TCASTTL  EQU   TCAST+64                                                 01601000
TCASWA   EQU   TCAST+60                                                 01602000
TCASFRR  EQU   TCAST+56                                                 01603000
TCASDATO EQU   TCAST+48                                                 01604000
TCASDATI EQU   TCAST+44                                                 01605000
TCASXECB EQU   TCAST+40                                                 01606000
TCASTID  EQU   TCAST+32                                                 01607000
@NM00027 EQU   TCAST+31                                                 01608000
TCASCHNL EQU   TCAST+30                                                 01609000
TCASCRSZ EQU   TCAST+28                                                 01610000
TCASLBUF EQU   TCAST+24                                                 01611000
TCASHBUF EQU   TCAST+20                                                 01612000
TCASCLSZ EQU   TCAST+18                                                 01613000
TCASRCON EQU   TCAST+16                                                 01614000
TCASACBP EQU   TCAST+8                                                  01615000
TCASUMAX EQU   TCASUSER+2                                               01616000
TCASUSEC EQU   TCASUSER                                                 01617000
TCASID   EQU   TCAST                                                    01618000
CVTLEVL  EQU   CVTRELNO+2                                               01619000
CVTNUMB  EQU   CVTRELNO                                                 01620000
CVTMDL   EQU   CVTFIX+250                                               01621000
@NM00026 EQU   CVTFIX+248                                               01622000
@NM00025 EQU   CVTFIX                                                   01623000
CVTRV482 EQU   CVTXTNT2+128                                             01624000
CVTRV481 EQU   CVTXTNT2+124                                             01625000
CVTRV480 EQU   CVTXTNT2+120                                             01626000
CVTRV479 EQU   CVTXTNT2+118                                             01627000
CVTRV478 EQU   CVTXTNT2+117                                             01628000
CVTRV477 EQU   CVTXTNT2+116                                             01629000
CVTRV476 EQU   CVTXTNT2+115                                             01630000
CVTRV475 EQU   CVTXTNT2+114                                             01631000
CVTRV474 EQU   CVTRV466                                                 01632000
CVTRV473 EQU   CVTRV466                                                 01633000
CVTRV472 EQU   CVTRV466                                                 01634000
CVTRV471 EQU   CVTRV466                                                 01635000
CVTRV470 EQU   CVTRV466                                                 01636000
CVTRV469 EQU   CVTRV466                                                 01637000
CVTRV468 EQU   CVTRV466                                                 01638000
CVTRV467 EQU   CVTRV466                                                 01639000
CVTRV465 EQU   CVTRV457                                                 01640000
CVTRV464 EQU   CVTRV457                                                 01641000
CVTRV463 EQU   CVTRV457                                                 01642000
CVTRV462 EQU   CVTRV457                                                 01643000
CVTRV461 EQU   CVTRV457                                                 01644000
CVTRV460 EQU   CVTRV457                                                 01645000
CVTRV459 EQU   CVTRV457                                                 01646000
CVTRV458 EQU   CVTRV457                                                 01647000
CVTRV456 EQU   CVTXTNT2+108                                             01648000
CVTRV455 EQU   CVTXTNT2+104                                             01649000
CVTRV454 EQU   CVTXTNT2+100                                             01650000
CVTRV453 EQU   CVTXTNT2+96                                              01651000
CVTRV452 EQU   CVTXTNT2+94                                              01652000
CVTRV451 EQU   CVTXTNT2+92                                              01653000
CVTRV450 EQU   CVTXTNT2+90                                              01654000
CVTRV449 EQU   CVTXTNT2+88                                              01655000
CVTRV448 EQU   CVTXTNT2+87                                              01656000
CVTRV447 EQU   CVTXTNT2+86                                              01657000
CVTRV446 EQU   CVTRV438                                                 01658000
CVTRV445 EQU   CVTRV438                                                 01659000
CVTRV444 EQU   CVTRV438                                                 01660000
CVTRV443 EQU   CVTRV438                                                 01661000
CVTRV442 EQU   CVTRV438                                                 01662000
CVTRV441 EQU   CVTRV438                                                 01663000
CVTRV440 EQU   CVTRV438                                                 01664000
CVTRV439 EQU   CVTRV438                                                 01665000
CVTRV437 EQU   CVTRV429                                                 01666000
CVTRV436 EQU   CVTRV429                                                 01667000
CVTRV435 EQU   CVTRV429                                                 01668000
CVTRV434 EQU   CVTRV429                                                 01669000
CVTRV433 EQU   CVTRV429                                                 01670000
CVTRV432 EQU   CVTRV429                                                 01671000
CVTRV431 EQU   CVTRV429                                                 01672000
CVTRV430 EQU   CVTRV429                                                 01673000
CVTRV428 EQU   CVTXTNT2+80                                              01674000
CVTRV427 EQU   CVTXTNT2+76                                              01675000
CVTRV426 EQU   CVTXTNT2+72                                              01676000
CVTRV425 EQU   CVTXTNT2+68                                              01677000
CVTATACT EQU   CVTATCVT                                                 01678000
CVTRV423 EQU   CVTXTNT2+62                                              01679000
CVTRV422 EQU   CVTXTNT2+60                                              01680000
CVTRV421 EQU   CVTXTNT2+58                                              01681000
CVTRV420 EQU   CVTXTNT2+56                                              01682000
CVTRV419 EQU   CVTXTNT2+55                                              01683000
CVTRV418 EQU   CVTXTNT2+54                                              01684000
CVTRV417 EQU   CVTRV409                                                 01685000
CVTRV416 EQU   CVTRV409                                                 01686000
CVTRV415 EQU   CVTRV409                                                 01687000
CVTRV414 EQU   CVTRV409                                                 01688000
CVTRV413 EQU   CVTRV409                                                 01689000
CVTRV412 EQU   CVTRV409                                                 01690000
CVTRV411 EQU   CVTRV409                                                 01691000
CVTRV410 EQU   CVTRV409                                                 01692000
CVTRV408 EQU   CVTRV400                                                 01693000
CVTRV407 EQU   CVTRV400                                                 01694000
CVTRV406 EQU   CVTRV400                                                 01695000
CVTRV405 EQU   CVTRV400                                                 01696000
CVTRV404 EQU   CVTRV400                                                 01697000
CVTRV403 EQU   CVTRV400                                                 01698000
CVTRV402 EQU   CVTRV400                                                 01699000
CVTRV401 EQU   CVTRV400                                                 01700000
CVTICB   EQU   CVTXTNT2+48                                              01701000
CVTSKTA  EQU   CVTXTNT2+44                                              01702000
CVTSHSB  EQU   CVTSHS                                                   01703000
CVTRSV98 EQU   CVTXTNT2+36                                              01704000
CVTRSV97 EQU   CVTXTNT2+34                                              01705000
CVTRSV96 EQU   CVTXTNT2+32                                              01706000
CVTOLTEP EQU   CVTXTNT2+28                                              01707000
CVTQIDA  EQU   CVTQID+1                                                 01708000
CVTRSV95 EQU   CVTQID                                                   01709000
CVTRSV94 EQU   CVTXTNT2+20                                              01710000
CVTRSV93 EQU   CVTXTNT2+16                                              01711000
CVTRSV92 EQU   CVTXTNT2+12                                              01712000
CVTDEBVR EQU   CVTXTNT2+8                                               01713000
CVTRSV91 EQU   CVTXTNT2+6                                               01714000
CVTRSV9H EQU   CVTFLGBT                                                 01715000
CVTRSV9G EQU   CVTFLGBT                                                 01716000
CVTRSV9F EQU   CVTFLGBT                                                 01717000
CVTRSV9E EQU   CVTFLGBT                                                 01718000
CVTRSV9D EQU   CVTFLGBT                                                 01719000
CVTRSV9C EQU   CVTFLGBT                                                 01720000
CVTVME   EQU   CVTFLGBT                                                 01721000
CVTNPE   EQU   CVTFLGBT                                                 01722000
CVTNUCLS EQU   CVTXTNT2+4                                               01723000
CVTDSSVA EQU   CVTDSSV+1                                                01724000
CVTRSV89 EQU   CVTDSSV                                                  01725000
CVTRSV88 EQU   CVTXTNT1+8                                               01726000
CVTRSV87 EQU   CVTXTNT1+4                                               01727000
CVTFACHN EQU   CVTXTNT1                                                 01728000
CVTRV488 EQU   CVTMAP+412                                               01729000
CVTRV487 EQU   CVTMAP+408                                               01730000
CVTRV486 EQU   CVTMAP+404                                               01731000
CVTRV485 EQU   CVTMAP+400                                               01732000
CVTACTAP EQU   CVTMAP+396                                               01733000
CVTAUTH  EQU   CVTMAP+392                                               01734000
CVTATMCA EQU   CVTATMCT+1                                               01735000
CVTATMST EQU   CVTATMCT                                                 01736000
CVTRSV61 EQU   CVTMAP+384                                               01737000
CVTVOLT1 EQU   CVTVOLM1+1                                               01738000
CVTVOLI1 EQU   CVTVOLF1                                                 01739000
CVTSTOA  EQU   CVTMAP+376                                               01740000
CVTRSV58 EQU   CVTMAP+374                                               01741000
CVTRSV57 EQU   CVTMAP+372                                               01742000
CVTDDCE  EQU   CVTMAP+368                                               01743000
CVTPNWFR EQU   CVTMAP+364                                               01744000
CVTSMF   EQU   CVTMAP+360                                               01745000
CVTSULK  EQU   CVTMAP+358                                               01746000
CVTSLKO  EQU   CVTSYSK                                                  01747000
CVTSLKP  EQU   CVTSYSK                                                  01748000
CVTSLKQ  EQU   CVTSYSK                                                  01749000
CVTSLKR  EQU   CVTSYSK                                                  01750000
CVTRSV56 EQU   CVTSYSK                                                  01751000
CVTRSV55 EQU   CVTSYSK                                                  01752000
CVTRSV54 EQU   CVTSYSK                                                  01753000
CVTRSV53 EQU   CVTSYSK                                                  01754000
CVTRSV52 EQU   CVTA1F1                                                  01755000
CVTRSV51 EQU   CVTA1F1                                                  01756000
CVTRSV50 EQU   CVTA1F1                                                  01757000
CVTRSV49 EQU   CVTA1F1                                                  01758000
CVTRSV48 EQU   CVTA1F1                                                  01759000
CVTRSV47 EQU   CVTA1F1                                                  01760000
CVTSRSW  EQU   CVTA1F1                                                  01761000
CVTPFSW  EQU   CVTA1F1                                                  01762000
CVTPCVT  EQU   CVTMAP+352                                               01763000
CVTRSV46 EQU   CVTMAP+344                                               01764000
CVTRSV45 EQU   CVTMAP+340                                               01765000
CVTRSV44 EQU   CVTMAP+338                                               01766000
CVTRSV43 EQU   CVTMAP+336                                               01767000
CVTHJESA EQU   CVTHJES+1                                                01768000
CVTRSV42 EQU   CVTHJES                                                  01769000
CVTEXT2A EQU   CVTEXT2+1                                                01770000
CVTRSV41 EQU   CVTEXT2                                                  01771000
CVTAPFA  EQU   CVTAPF+1                                                 01772000
CVTRSV40 EQU   CVTAPF                                                   01773000
CVTRV518 EQU   CVTINTLA                                                 01774000
CVTRV517 EQU   CVTERPV                                                  01775000
CVTEORM  EQU   CVTMAP+312                                               01776000
CVTMCHPR EQU   CVTMAP+308                                               01777000
CVTTZ    EQU   CVTMAP+304                                               01778000
CVTJEPS  EQU   CVTMAP+300                                               01779000
CVTJESCT EQU   CVTMAP+296                                               01780000
CVTMODE  EQU   CVTMAP+292                                               01781000
CVTPTRV  EQU   CVTMAP+288                                               01782000
CVTREAL  EQU   CVTMAP+284                                               01783000
CVTRSV39 EQU   CVTMAP+280                                               01784000
CVTRSV38 EQU   CVTMAP+276                                               01785000
CVTDMSRA EQU   CVTDMSR+1                                                01786000
CVTRV634 EQU   CVTDMSRF                                                 01787000
CVTRV633 EQU   CVTDMSRF                                                 01788000
CVTRV632 EQU   CVTDMSRF                                                 01789000
CVTRV631 EQU   CVTDMSRF                                                 01790000
CVTRV630 EQU   CVTDMSRF                                                 01791000
CVTRV629 EQU   CVTDMSRF                                                 01792000
CVTUDUMP EQU   CVTDMSRF                                                 01793000
CVTSDUMP EQU   CVTDMSRF                                                 01794000
CVTQMSGA EQU   CVTQMSG+1                                                01795000
CVTRSV36 EQU   CVTQMSG                                                  01796000
CVTAMFF  EQU   CVTMAP+264                                               01797000
CVTPURGA EQU   CVTPURG+1                                                01798000
CVTRSV35 EQU   CVTPURG                                                  01799000
CVTCBSP  EQU   CVTMAP+256                                               01800000
CVTATERA EQU   CVTATER+1                                                01801000
CVTSYST  EQU   CVTATER                                                  01802000
CVTVOLT2 EQU   CVTTAT                                                   01803000
CVTVOLI2 EQU   CVTVOLF2                                                 01804000
CVTAQAVB EQU   CVTAQAVT+1                                               01805000
CVTRSV34 EQU   CVTTCMFG                                                 01806000
CVTRSV33 EQU   CVTTCMFG                                                 01807000
CVTRSV32 EQU   CVTTCMFG                                                 01808000
CVTRSV31 EQU   CVTTCMFG                                                 01809000
CVTRSV30 EQU   CVTTCMFG                                                 01810000
CVTRSV29 EQU   CVTTCMFG                                                 01811000
CVTRSV28 EQU   CVTTCMFG                                                 01812000
CVTTCRDY EQU   CVTTCMFG                                                 01813000
CVTGTFA  EQU   CVTGTF+1                                                 01814000
CVTRSV27 EQU   CVTGTFST                                                 01815000
CVTRNIO  EQU   CVTGTFST                                                 01816000
CVTUSR   EQU   CVTGTFST                                                 01817000
CVTRV318 EQU   CVTFORM                                                  01818000
CVTRV317 EQU   CVTTMODE                                                 01819000
CVTRV316 EQU   CVTSTATE                                                 01820000
CVTRV315 EQU   CVTGTFS                                                  01821000
CVTGTFAV EQU   CVTGTFS                                                  01822000
CVT0SCR1 EQU   CVTMAP+232                                               01823000
CVTRV515 EQU   CVTMAP+228                                               01824000
CVTRMS   EQU   CVTMAP+224                                               01825000
CVTPATCH EQU   CVTMAP+220                                               01826000
CVTTSCE  EQU   CVTMAP+216                                               01827000
CVTLNKSC EQU   CVTMAP+214                                               01828000
CVTQABST EQU   CVTMAP+212                                               01829000
CVTMDLDS EQU   CVTMAP+208                                               01830000
CVTUSER  EQU   CVTMAP+204                                               01831000
CVTABEND EQU   CVTMAP+200                                               01832000
CVTSMCA  EQU   CVTMAP+196                                               01833000
CVTRSV18 EQU   CVTMAP+192                                               01834000
CVTQLPAQ EQU   CVTMAP+188                                               01835000
CVTQCDSR EQU   CVTMAP+184                                               01836000
CVTRSV17 EQU   CVTOPTB                                                  01837000
CVTRSV16 EQU   CVTOPTB                                                  01838000
CVTFP    EQU   CVTOPTB                                                  01839000
CVTAPTHR EQU   CVTOPTB                                                  01840000
CVTNLOG  EQU   CVTOPTB                                                  01841000
CVTTOD   EQU   CVTOPTB                                                  01842000
CVTCTIMS EQU   CVTOPTB                                                  01843000
CVTPROT  EQU   CVTOPTB                                                  01844000
CVTXPFP  EQU   CVTOPTA                                                  01845000
CVTASCII EQU   CVTOPTA                                                  01846000
CVTRSV13 EQU   CVTOPTA                                                  01847000
CVTRSV12 EQU   CVTOPTA                                                  01848000
CVTNIP   EQU   CVTOPTA                                                  01849000
CVTDDR   EQU   CVTOPTA                                                  01850000
CVTAPR   EQU   CVTOPTA                                                  01851000
CVTCCH   EQU   CVTOPTA                                                  01852000
CVTSNCTR EQU   CVTMAP+180                                               01853000
CVTQMWR  EQU   CVTMAP+176                                               01854000
CVTQOCR  EQU   CVTMAP+172                                               01855000
CVT1EF00 EQU   CVTMAP+168                                               01856000
CVTMZ00  EQU   CVTMAP+164                                               01857000
CVTHEAD  EQU   CVTMAP+160                                               01858000
CVTRSV11 EQU   CVTMAP+156                                               01859000
CVT0PT01 EQU   CVTMAP+152                                               01860000
CVTMSER  EQU   CVTMAP+148                                               01861000
CVTRV516 EQU   CVTIERLC                                                 01862000
CVTILCH  EQU   CVTMAP+140                                               01863000
CVT0DS   EQU   CVTMAP+136                                               01864000
CVTFBOSV EQU   CVTMAP+132                                               01865000
CVTNUCB  EQU   CVTMAP+128                                               01866000
CVTIXAVL EQU   CVTMAP+124                                               01867000
CVTIOQET EQU   CVTMAP+120                                               01868000
CVTDCBA  EQU   CVTMAP+117                                               01869000
CVTMVS2  EQU   CVTDCB                                                   01870000
CVT6DAT  EQU   CVTDCB                                                   01871000
CVT4MPS  EQU   CVTDCB                                                   01872000
CVTRSV09 EQU   CVTDCB                                                   01873000
CVT4MS1  EQU   CVTDCB                                                   01874000
CVT2SPS  EQU   CVTDCB                                                   01875000
CVT1SSS  EQU   CVTDCB                                                   01876000
CVTRSV08 EQU   CVTDCB                                                   01877000
CVTSTB   EQU   CVTMAP+112                                               01878000
CVTQTD00 EQU   CVTMAP+108                                               01879000
CVTQTE00 EQU   CVTMAP+104                                               01880000
CVTCUCB  EQU   CVTMAP+100                                               01881000
CVTSJQ   EQU   CVTMAP+96                                                01882000
CVTPBLDL EQU   CVTMAP+92                                                01883000
CVTTPC   EQU   CVTMAP+88                                                01884000
CVTSVDCB EQU   CVTMAP+84                                                01885000
CVTBRET  EQU   CVTMAP+82                                                01886000
CVTEXIT  EQU   CVTMAP+80                                                01887000
CVT0FN00 EQU   CVTMAP+76                                                01888000
CVTDARA  EQU   CVTDAR+1                                                 01889000
CVTRSV07 EQU   CVTFLGS1                                                 01890000
CVTRSV06 EQU   CVTFLGS1                                                 01891000
CVTRSV05 EQU   CVTFLGS1                                                 01892000
CVTRSV04 EQU   CVTFLGS1                                                 01893000
CVTRSV03 EQU   CVTFLGS1                                                 01894000
CVTRSV02 EQU   CVTFLGS1                                                 01895000
CVTRSV01 EQU   CVTFLGS1                                                 01896000
CVTDMPLK EQU   CVTFLGS1                                                 01897000
CVTXITP  EQU   CVTMAP+68                                                01898000
CVTZDTAB EQU   CVTMAP+64                                                01899000
CVTMSLT  EQU   CVTMAP+60                                                01900000
CVTDATE  EQU   CVTMAP+56                                                01901000
CVTBTERM EQU   CVTMAP+52                                                01902000
CVTSYSAD EQU   CVTMAP+48                                                01903000
CVTXTLER EQU   CVTMAP+44                                                01904000
CVTILK2  EQU   CVTMAP+40                                                01905000
CVTILK1  EQU   CVTMAP+36                                                01906000
CVTPRLTV EQU   CVTMAP+32                                                01907000
CVTPCNVT EQU   CVTMAP+28                                                01908000
CVT0VL00 EQU   CVTMAP+24                                                01909000
CVTXAPG  EQU   CVTMAP+20                                                01910000
CVTBUF   EQU   CVTMAP+16                                                01911000
CVTJOB   EQU   CVTMAP+12                                                01912000
CVTLINK  EQU   CVTMAP+8                                                 01913000
CVT0EF00 EQU   CVTMAP+4                                                 01914000
CVTTCBP  EQU   CVTMAP                                                   01915000
CVT      EQU   CVTMAP                                                   01916000
@NM00024 EQU   PSA+3668                                                 01917000
PSASTAK  EQU   PSA+3072                                                 01918000
@NM00023 EQU   PSA+1048                                                 01919000
PSAUSEND EQU   PSA+1048                                                 01920000
PSARV062 EQU   PSA+1044                                                 01921000
PSACDAL  EQU   PSA+1040                                                 01922000
PSAWTCOD EQU   PSA+1036                                                 01923000
PSAATCVT EQU   PSA+1032                                                 01924000
PSAPCPSW EQU   PSA+1024                                                 01925000
PSAPIR2  EQU   PSA+1020                                                 01926000
PSARV059 EQU   PSA+1018                                                 01927000
PSASVC13 EQU   PSA+1016                                                 01928000
PSALSFCC EQU   PSA+1012                                                 01929000
PSASFACC EQU   PSA+1008                                                 01930000
PSASTOP  EQU   PSA+992                                                  01931000
PSASTART EQU   PSA+976                                                  01932000
PSARSPSW EQU   PSA+968                                                  01933000
PSASRPSW EQU   PSA+960                                                  01934000
PSARV045 EQU   PSA+892                                                  01935000
PSARV044 EQU   PSA+888                                                  01936000
PSARV043 EQU   PSA+884                                                  01937000
PSARV042 EQU   PSA+880                                                  01938000
PSARV041 EQU   PSA+876                                                  01939000
PSARV040 EQU   PSA+872                                                  01940000
PSARV025 EQU   PSA+868                                                  01941000
PSADSSED EQU   PSA+868                                                  01942000
PSADSSPR EQU   PSA+864                                                  01943000
PSADSSFW EQU   PSA+860                                                  01944000
PSADSS14 EQU   PSA+856                                                  01945000
PSADSSPP EQU   PSA+848                                                  01946000
PSADSSRP EQU   PSA+840                                                  01947000
PSADSS05 EQU   PSADSSF4                                                 01948000
PSADSS10 EQU   PSADSSF4                                                 01949000
PSADSSVE EQU   PSADSSF4                                                 01950000
PSADSSDE EQU   PSADSSF4                                                 01951000
PSADSSC0 EQU   PSADSSF4                                                 01952000
PSADSSIE EQU   PSADSSF4                                                 01953000
PSADSS12 EQU   PSADSSF4                                                 01954000
PSADSSRC EQU   PSADSSF4                                                 01955000
PSARV057 EQU   PSADSSF3                                                 01956000
PSARV056 EQU   PSADSSF3                                                 01957000
PSARV055 EQU   PSADSSF3                                                 01958000
PSADSSMC EQU   PSADSSF3                                                 01959000
PSADSSRW EQU   PSADSSF3                                                 01960000
PSADSSNM EQU   PSADSSF3                                                 01961000
PSADSSES EQU   PSADSSF3                                                 01962000
PSADSSGP EQU   PSADSSF3                                                 01963000
PSADSSF2 EQU   PSADSSFL+1                                               01964000
PSADSSPI EQU   PSADSSF1                                                 01965000
PSADSSOI EQU   PSADSSF1                                                 01966000
PSADSSSP EQU   PSADSSF1                                                 01967000
PSADSSTP EQU   PSADSSF1                                                 01968000
PSADSSDW EQU   PSADSSF1                                                 01969000
PSADSSDD EQU   PSADSSF1                                                 01970000
PSADSSDM EQU   PSADSSF1                                                 01971000
PSADSSMV EQU   PSADSSF1                                                 01972000
PSADSSTS EQU   PSA+816                                                  01973000
PSADSSWK EQU   PSA+812                                                  01974000
PSADSSR3 EQU   PSA+808                                                  01975000
PSADSSR2 EQU   PSA+804                                                  01976000
PSADSSRS EQU   PSA+800                                                  01977000
PSASTOR  EQU   PSA+796                                                  01978000
PSACPUSA EQU   PSA+794                                                  01979000
PSAVSTAP EQU   PSA+792                                                  01980000
PSAWKVAP EQU   PSA+788                                                  01981000
PSAWKRAP EQU   PSA+784                                                  01982000
PSAMCHIC EQU   PSA+783                                                  01983000
PSARV061 EQU   PSA+782                                                  01984000
PSASYMSK EQU   PSA+781                                                  01985000
PSAMCHFL EQU   PSA+780                                                  01986000
PSACR0   EQU   PSA+776                                                  01987000
PSAPSWSV EQU   PSA+768                                                  01988000
PSACLHS  EQU   PSAHLHI                                                  01989000
PSALKR15 EQU   PSALKSA+60                                               01990000
PSALKR14 EQU   PSALKSA+56                                               01991000
PSALKR13 EQU   PSALKSA+52                                               01992000
PSALKR12 EQU   PSALKSA+48                                               01993000
PSALKR11 EQU   PSALKSA+44                                               01994000
PSALKR10 EQU   PSALKSA+40                                               01995000
PSALKR9  EQU   PSALKSA+36                                               01996000
PSALKR8  EQU   PSALKSA+32                                               01997000
PSALKR7  EQU   PSALKSA+28                                               01998000
PSALKR6  EQU   PSALKSA+24                                               01999000
PSALKR5  EQU   PSALKSA+20                                               02000000
PSALKR4  EQU   PSALKSA+16                                               02001000
PSALKR3  EQU   PSALKSA+12                                               02002000
PSALKR2  EQU   PSALKSA+8                                                02003000
PSALKR1  EQU   PSALKSA+4                                                02004000
PSALKR0  EQU   PSALKSA                                                  02005000
PSARV023 EQU   PSACLHT+52                                               02006000
PSALOCAL EQU   PSACLHT+48                                               02007000
PSACMSL  EQU   PSACLHT+44                                               02008000
PSAOPTL  EQU   PSACLHT+40                                               02009000
PSATPACL EQU   PSACLHT+36                                               02010000
PSATPDNL EQU   PSACLHT+32                                               02011000
PSATPNCL EQU   PSACLHT+28                                               02012000
PSAIOSLL EQU   PSACLHT+24                                               02013000
PSAIOSUL EQU   PSACLHT+20                                               02014000
PSAIOSCL EQU   PSACLHT+16                                               02015000
PSAIOSSL EQU   PSACLHT+12                                               02016000
PSASALCL EQU   PSACLHT+8                                                02017000
PSAASML  EQU   PSACLHT+4                                                02018000
PSADISPL EQU   PSACLHT                                                  02019000
PSASRSA  EQU   PSA+636                                                  02020000
PSARV050 EQU   PSA+634                                                  02021000
PSADSSGO EQU   PSA+633                                                  02022000
PSARECUR EQU   PSA+632                                                  02023000
PSAHLHIS EQU   PSA+628                                                  02024000
PSAIPCSA EQU   PSA+624                                                  02025000
@NM00022 EQU   PSA+621                                                  02026000
PSAIPCDM EQU   PSA+620                                                  02027000
PSAIPCD  EQU   PSA+616                                                  02028000
@NM00021 EQU   PSA+613                                                  02029000
PSAIPCRM EQU   PSA+612                                                  02030000
PSAIPCR  EQU   PSA+608                                                  02031000
PSAMCHEX EQU   PSA+600                                                  02032000
PSAEXPS2 EQU   PSA+584                                                  02033000
PSAEXPS1 EQU   PSA+576                                                  02034000
PSAPIREG EQU   PSA+572                                                  02035000
PSARSREG EQU   PSA+568                                                  02036000
PSAGPREG EQU   PSA+556                                                  02037000
PSARV022 EQU   PSASUP4                                                  02038000
PSARV021 EQU   PSASUP4                                                  02039000
PSARV020 EQU   PSASUP4                                                  02040000
PSARV019 EQU   PSASUP4                                                  02041000
PSARV018 EQU   PSASUP4                                                  02042000
PSARV017 EQU   PSASUP4                                                  02043000
PSARV016 EQU   PSASUP4                                                  02044000
PSARV015 EQU   PSASUP4                                                  02045000
PSARV014 EQU   PSASUP3                                                  02046000
PSARV013 EQU   PSASUP3                                                  02047000
PSARV012 EQU   PSASUP3                                                  02048000
PSARV011 EQU   PSASUP3                                                  02049000
PSASPR   EQU   PSASUP3                                                  02050000
PSAPSREG EQU   PSASUP3                                                  02051000
PSAPI2   EQU   PSASUP3                                                  02052000
PSAIOSUP EQU   PSASUP3                                                  02053000
PSALCR   EQU   PSASUP2                                                  02054000
PSARTM   EQU   PSASUP2                                                  02055000
PSAACR   EQU   PSASUP2                                                  02056000
PSAIPCE2 EQU   PSASUP2                                                  02057000
PSAIPCES EQU   PSASUP2                                                  02058000
PSAIPCEC EQU   PSASUP2                                                  02059000
PSAGTF   EQU   PSASUP2                                                  02060000
PSAIPCRI EQU   PSASUP2                                                  02061000
PSARV063 EQU   PSASUP1                                                  02062000
PSATCTL  EQU   PSASUP1                                                  02063000
PSADISP  EQU   PSASUP1                                                  02064000
PSALOCK  EQU   PSASUP1                                                  02065000
PSAPI    EQU   PSASUP1                                                  02066000
PSAEXT   EQU   PSASUP1                                                  02067000
PSASVC   EQU   PSASUP1                                                  02068000
PSAIO    EQU   PSASUP1                                                  02069000
PSAANEW  EQU   PSA+544                                                  02070000
PSATOLD  EQU   PSA+540                                                  02071000
PSATNEW  EQU   PSA+536                                                  02072000
PSALCCAR EQU   PSA+532                                                  02073000
PSALCCAV EQU   PSA+528                                                  02074000
PSAPCCAR EQU   PSA+524                                                  02075000
PSAPCCAV EQU   PSA+520                                                  02076000
PSACPULA EQU   PSA+518                                                  02077000
PSACPUPA EQU   PSA+516                                                  02078000
PSAPSA   EQU   PSA+512                                                  02079000
FLCHDEND EQU   PSA+512                                                  02080000
FLCCRSAV EQU   FLCMCLA+280                                              02081000
FLCGRSAV EQU   FLCMCLA+216                                              02082000
FLCFPSAV EQU   FLCMCLA+184                                              02083000
FLCFLA   EQU   FLCMCLA+88                                               02084000
FLCRGNCD EQU   FLCMCLA+84                                               02085000
FLCFSAA  EQU   FLCFSA+1                                                 02086000
@NM00020 EQU   FLCFSA                                                   02087000
@NM00019 EQU   FLCMCLA+72                                               02088000
FLCMCIC  EQU   FLCMCLA+64                                               02089000
@NM00018 EQU   FLCMCLA+20                                               02090000
FLCIOAA  EQU   FLCIOA+1                                                 02091000
@NM00017 EQU   FLCIOA                                                   02092000
@NM00016 EQU   FLCMCLA+15                                               02093000
@NM00015 EQU   FLCMCLA+14                                               02094000
@NM00014 EQU   FLCMCLA+12                                               02095000
FLCLCL   EQU   FLCMCLA+8                                                02096000
FLCIOELA EQU   FLCIOEL+1                                                02097000
@NM00013 EQU   FLCIOEL                                                  02098000
FLCCHNID EQU   FLCMCLA                                                  02099000
@NM00012 EQU   PSA+160                                                  02100000
FLCMTRCD EQU   PSA+157                                                  02101000
@NM00011 EQU   PSA+156                                                  02102000
FLCPERA  EQU   FLCPER+1                                                 02103000
@NM00010 EQU   FLCPER                                                   02104000
@NM00009 EQU   PSA+151                                                  02105000
FLCPERCD EQU   PSA+150                                                  02106000
FLCMCNUM EQU   PSA+149                                                  02107000
@NM00008 EQU   PSA+148                                                  02108000
FLCTEAA  EQU   FLCTEA+1                                                 02109000
@NM00007 EQU   FLCTEA                                                   02110000
PSAPIPC  EQU   PSAPICOD                                                 02111000
PSAPIMC  EQU   PSAPICOD                                                 02112000
PSAPIPER EQU   PSAPICOD                                                 02113000
PSARV049 EQU   FLCPICOD                                                 02114000
FLCPILCB EQU   FLCPIILC                                                 02115000
@NM00006 EQU   FLCPIILC                                                 02116000
@NM00005 EQU   PSAEPPSW                                                 02117000
FLCSVCN  EQU   PSAESPSW+2                                               02118000
FLCSILCB EQU   FLCSVILC                                                 02119000
@NM00004 EQU   FLCSVILC                                                 02120000
@NM00003 EQU   PSAESPSW                                                 02121000
FLCEICOD EQU   PSAEEPSW+2                                               02122000
PSASPAD  EQU   PSAEEPSW                                                 02123000
@NM00002 EQU   PSA+128                                                  02124000
FLCINPSW EQU   PSA+120                                                  02125000
FLCMNPSW EQU   PSA+112                                                  02126000
FLCPNPSW EQU   PSA+104                                                  02127000
FLCSNPSW EQU   PSA+96                                                   02128000
FLCENPSW EQU   PSA+88                                                   02129000
FLCTRACE EQU   PSA+84                                                   02130000
FLCTIMER EQU   PSA+80                                                   02131000
FLCCVT2  EQU   PSA+76                                                   02132000
FLCCAW   EQU   PSA+72                                                   02133000
FLCCSW   EQU   PSA+64                                                   02134000
FLCIOPSW EQU   PSA+56                                                   02135000
FLCMOPSW EQU   PSA+48                                                   02136000
FLCPOPSW EQU   PSA+40                                                   02137000
FLCSOPSW EQU   PSA+32                                                   02138000
FLCEOPSW EQU   PSA+24                                                   02139000
@NM00001 EQU   FLCICCW2+4                                               02140000
FLCICCW1 EQU   FLCROPSW                                                 02141000
FLCIPPSW EQU   FLCRNPSW                                                 02142000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02143000
@RC00056 EQU   @RC00055                                                 02144000
@ENDDATA EQU   *                                                        02145000
         END   IKTLOGR,(C'PLS1919',0701,77319)                          02146000
