         TITLE 'IFDOLT30 CE COMMUNICATIONS ROOT MODULE'                 00010000
         TITLE 'IFDOLT30 C.E. COMMUNICATIONS ROOT MODULE'               00020000
         LCLA  &T,&SPN                                            0002  00030000
.@001    ANOP                                                     0002  00040000
IFDOLT30 CSECT ,                                                  0002  00050000
         BC    15,24(0,@F)                                              00060000
         DC    C'IFDOLT30 01 MAR 77'                             0002  00070000
         ST    @E,12(0,@D)                                        0002  00080000
         STM   @0,@C,20(@D)                                       0002  00090000
         BALR  @B,0                                               0002  00100000
@PSTART  DS    0H                                                 0002  00110000
         USING @PSTART+00000,@B                                   0002  00120000
         ST    @D,@SAV001+4                                       0002  00130000
         LA    @F,@SAV001                                         0002  00140000
         ST    @F,8(0,@D)                                         0002  00150000
         LR    @D,@F                                              0002  00160000
         ENTRY ECB                                                      00170000
         ENTRY CECINP02                                                 00180000
         ENTRY CECINP03                                                 00190000
         ENTRY CNTRLREC                                                 00200000
         ENTRY SYMLIB                                                   00210000
         DS    0H                                                       00220000
*         GEN(USING CHASCT,2);                                          00230000
         USING CHASCT,2                                                 00240000
         DS    0H                                                       00250000
*         GENERATE DATA;                                                00260000
*         /************************************************************ 00270000
*         /*                                                          * 00280000
*         /*                        DECLARES                          * 00290000
*         /*                                                          * 00300000
*         /************************************************************ 00310000
*         DCL R0 REG(0) PTR(31);                                        00320000
*         DCL R1 REG(1) PTR(31);                                        00330000
*         DCL R2 REG(2) PTR(31);                                        00340000
*         DCL I REG(5) PTR(24);                                         00350000
*         DCL R6 REG(6) PTR(31);         /* REGISTER 6.               * 00360000
*         DCL R7 REG(7) PTR;             /*                      M4506* 00370000
*         DCL R8 REG(8) PTR(31);                                        00380000
*         DCL SLASHCNT REG(9) PTR(24);                                  00390000
*         DCL RETCODE REG(9) PTR(24);                                   00400000
*         DCL R9 REG(9) PTR(31);                                        00410000
*         DCL SA REG(13) PTR(31);                                       00420000
*         DCL R13 REG(13) PTR(31);                                      00430000
*         DCL R14 REG(14) PTR(31);                                      00440000
*         DCL R15 REG(15) PTR(31);                                      00450000
*         DCL RC REG(15) PTR(24);                                       00460000
*         DCL SAVE4 PTR(31) BASED(R13+4);                               00470000
*         DCL SECLST CHAR(138) GENERATED;                               00480000
*         DCL SOSPRUN CHAR(4) BASED(ADDR(SECLST)+3) ;/*SOSP IN SYSTEM?* 00490000
*                                        /*                     S20203* 00500000
*         DCL 1 CDSBLDL BASED(ADDR(SECLST)),                            00510000
*               3 ENTRIES FIXED(15),                                    00520000
*               3 LENGTH FIXED(15),                                     00530000
*               3 NAME CHAR(8);                                         00540000
*         DCL TPSAVE CHAR(4) GENERATED;                                 00550000
*  DCL ECB FIXED;                        /* WTOR ECB                  * 00560000
*         DCL UNICTR PTR(8) GEND;                                       00570000
*         DCL DEVTBPTR PTR(31) GENERATED; /* PTR TO DEV TABLES.  21050* 00580000
*  DCL TABLNGTH FIXED(15) GENERATED;     /* DEVICE TABLE SIZE         * 00590000
*  DCL 1 * BASED(R8),                    /* DEVICE TABLE              * 00600000
*         2 DVT CHAR(16),                /* TABLE AREA                * 00610000
*         2 DVTN CHAR(16);               /* NEXT TABLE AREA           * 00620000
*  DCL 1 STOPREI CHAR(7) INIT('STOPREI'), /* STOPREI CONSTANT         * 00630000
*         2 * CHAR(4),                   /* NA                        * 00640000
*         2 REI CHAR(3);                 /* REI CONSTANT              * 00650000
*  DCL 1 FECSA BASED(SA),                /* SAVE AREA                 * 00660000
*               3 * CHAR(4),                                            00670000
*               3 INTSAPTR PTR(31);                                     00680000
*         DCL 1 SVAREA BDY(WORD) BASED(ADDR(IFDOLT30)+20), /* SA      * 00690000
*               3 * CHAR(4),                                            00700000
*               3 SVR13 PTR(31);                                        00710000
*         DCL 1 INITSA BASED(SVR13),                                    00720000
*               3 * CHAR(8),                                            00730000
*               3 SAVAREAD PTR(31);                                     00740000
*         DCL INBUFR CHAR(72) GENERATED;                                00750000
*         DCL INPUTBUF CHAR(72) BASED(ADDR(INBUFR));                    00760000
*  DCL 1 * BASED(R8),                    /* BUFFER LOCATION           * 00770000
*         2 B1ST CHAR(1),                /* FIRST LOCATION            * 00780000
*         2 TESTTYPE CHAR(5),            /* TEST TYPE                 * 00790000
*           3 B2ND CHAR(1);              /* SECOND LOCATION           * 00800000
*         DCL CNTRLREC CHAR(92) GENERATED;                              00810000
*         DCL SYMLIB CHAR(92) GENERATED; /* REMOTE CDS DCB       21051* 00820000
*         DCL OFLAGS BIT(8) BASED(ADDR(CNTRLREC)+48);                   00830000
*         DCL CAN CHAR(1) INIT('FF'X);                                  00840000
*       DCL CANFLG CHAR(1);     /* SAVE CANCEL INDICATOR      @ZA08985* 00850000
*         DCL REPBUFLN CHAR(1) BASED(R1);/* REPLY BUFFER LENGTH.      * 00860000
*         DCL 1 MSGPTR BASED(R6),        /*-FORMAT OF MESSAGE MODULE--* 00870000
*               3 MSGPTR00 PTR(31),      /* POINTER TO MESSAGE IFD100I* 00880000
*               3 MSGPTR02 PTR(31),      /* POINTER TO MESSAGE IFD102I* 00890000
*               3 MSGPTR03 PTR(31),      /* POINTER TO MESSAGE IFD103I* 00900000
*               3 MSGPTR05 PTR(31),      /* POINTER TO MESSAGE IFD105D* 00910000
*               3 MSGPTR06 PTR(31),      /* POINTER TO MESSAGE IFD106I* 00920000
*               3 MSGPTR08 PTR(31),      /* POINTER TO MESSAGE IFD108I* 00930000
*               3 MSGPTR17 PTR(31),      /* POINTER TO MESSAGE IFD117I* 00940000
*               3 MSGPR166 PTR(31),      /* PTR TO MSG IFD166I  Y02008* 00950000
*               3 MSGPTR29 PTR(31),      /* POINTER TO MESSAGE IFD129I* 00960000
*               3 MSGPTR34 PTR(31),      /* PTR TO MSG IFD134I  Y02008* 00970000
*               3 MSGPR501 PTR(31),      /* PTR TO MSG IFD501I  Y02008* 00980000
*               3 MSGPTR57 PTR(31),      /* POINTER TO MESSAGE IFD157I* 00990000
*               3 MSGPTR58 PTR(31),      /* POINTER TO MESSAGE IFD158I* 01000000
*               3 MSGPTR59 PTR(31),      /* POINTER TO MESSAGE IFD159I* 01010000
*               3 MSGPTR60 PTR(31),      /* POINTER TO MESSAGE IFD160I* 01020000
*               3 MSGPTR61 PTR(31),     /* PTR TO MSG IFD161I   X02008* 01030000
*               3 * CHAR(56),                                           01040000
*               3 MSGPTR66 PTR(31),      /* PTR TO MSG IFD166I  X03008* 01050000
*               3 MSGPTR13 PTR(31),      /* PTR TO MSG IFD113I  YM3333* 01060000
*               3 MSGPTR99 PTR(31),      /* PTR TO MSG IFD899I  YM3333* 01070000
*               3 MSGPR260 PTR(31);      /* PTR TO MSG IFD260I  Y02068* 01080000
*         DCL 1 IFD100 BASED(R1),        /*-FORMAT OF MESSAGE IFD100I-* 01090000
*               3 * CHAR(4),             /* MSG. LENGTH & MCS FLAGS.  * 01100000
*               3 IFD100I CHAR(80);      /* MESSAGE TEXT.             * 01110000
*         DCL 1 * BASED(R1),       /*-FORMAT OF MESSAGE IFD899I-YM3333* 01120000
*               3 * CHAR(65),      /* OFFSET                    YM3333* 01130000
*               3 MSG899ID CHAR(2); /* MESSAGE VARABLE          YM3333* 01140000
*         DCL 1 MSSGE BASED(R1),                                        01150000
*               3 * CHAR(4),                                            01160000
*               3 MESSAGE1 CHAR(40);                                    01170000
*         DCL CESWT  CHAR(1) GENERATED;                                 01180000
*         DCL 1 OLTEPSW  CHAR(1) BASED(ADDR(CESWT)),                    01190000
*           3 LEGALTST BIT(1),          /* LEGAL TEST ENTRY      M4832* 01200000
*           3 * BIT(3),                                                 01210000
*               3 LEGALDEV BIT(1),                                      01220000
*               3 * BIT(1),                                             01230000
*               3 FERINT BIT(1);                                        01240000
*         DCL CESWT1 CHAR(1) GENERATED;  /*                     S20203* 01250000
*         DCL 1 OLTEPSW1 CHAR(1) BASED(ADDR(CESWT1)),         /*S20203* 01260000
*                3 RTNFLD BIT(1);   /* SET ON WHEN NEW RTNS DECODED OR  01270000
*                                   /* BY IFDOLT32 IF RTNS PRESENT      01280000
*                                        /*                     S20203* 01290000
*         DCL CESWT2 CHAR(1) GENERATED;                                 01300000
*         DCL 1 OLTEPSW2 CHAR(1) BASED(ADDR(CESWT2)),                   01310000
*               3 NDCFO BIT(1),                                         01320000
*               3 * BIT(3),                                             01330000
*               3 INITENT BIT(1),                                       01340000
*               3 NDR BIT(1),                                           01350000
*               3 TAPEHDR BIT(1);                                       01360000
*         DCL CESWT3 CHAR(1) GENERATED;                                 01370000
*         DCL 1 OLTEPSW3 CHAR(1) BASED(ADDR(CESWT3)),                   01380000
*           3 TALKVERB BIT(1),          /* TALK RQST BY CE MADE X02008* 01390000
*               3 BYPALDEV BIT(1),                                      01400000
*           3 * BIT(2),                  /* NA                   M4506* 01410000
*           3 SUSDEL BIT(1),             /* SUSPENDED DELETION   M4506* 01420000
*           3 * BIT(1),                  /* NA                   M4506* 01430000
*               3 CDSEXIST BIT(1);                                      01440000
*         DCL CESWT5 CHAR(1) GENERATED;                                 01450000
*         DCL 1 OLTEPSW5 CHAR(1) BASED(ADDR(CESWT5)),                   01460000
*               3 * BIT(3),                                             01470000
*               3 DPRINTFL BIT(2),                                      01480000
*               3 * BIT(2),                                             01490000
*               3 PRNTOPTN BIT(1); /* PRINT OPTIONS FROM PREVIOUS 21050 01500000
*                                  /* DTO ENTRY, OR DEFAULT OPNS 21050* 01510000
*         DCL CESWT6 CHAR(1) GENERATED;                                 01520000
*         DCL 1 OLTEPSW6 CHAR(1) BASED(ADDR(CESWT6)),                   01530000
*               3 UTSCAL BIT(1),         /* CALL NOT RESIDENT OLTEP.  * 01540000
*               3 ATM BIT(1);                                           01550000
*         DCL CESWT7 CHAR(1) GENERATED;                                 01560000
*         DCL 1 OLTEPSW7 CHAR(1) BASED(ADDR(CESWT7)), /*         21050* 01570000
*               3 * BIT(1),        /* NOT USED                   21050* 01580000
*               3 RETTO31 BIT(1),  /* RETURN TO IFDOLT31         21050* 01590000
*           3 REMOTE BIT(1),            /* REMOTE TP DEVICE      M4832* 01600000
*           3 * BIT(3),                                       /*X03008* 01610000
*           3 VIRTUAL BIT(1),           /*OLTEP LOADED VIRTUAL  X03008* 01620000
*           3 GOTINPUT BIT(1);          /* D/T/O/ ENTRY MADE     M4832* 01630000
*         DCL CESWT8 CHAR(1) GEND;      /* CESWT 8 IN COMM AREA X02008* 01640000
*                                                                       01650000
*         DCL 1 OLTEPSW8 CHAR(1) BASED(ADDR(CESWT8)),                   01660000
*           3 * BIT(5),                                       /*X03008* 01670000
*           3 SUTMSG BIT(1),            /*OLT IN PROCESS        X03008* 01680000
*           3 * BIT(1),                                       /*X03008* 01690000
*           3 TALKHERE BIT(1);          /* TALK VERB ENTERED IN X02008* 01700000
*                                       /* IN THIS COMM INTVL.  X02008* 01710000
*         DCL CESWT9 CHAR(1) GEND;      /*CESWT 9 IN COMM AREA  X03008* 01720000
*         DCL 1 OLTEPSW9 CHAR(1) BASED(ADDR(CESWT9)),         /*X03008* 01730000
*               3 CDSEQU BIT(1),        /* CDS EQUATE           X03906* 01740000
*               3 RESENTB BIT(1),       /* RESIDENT ENTRY       X03906* 01750000
*               3 * BIT(1),                                   /*X03008* 01760000
*               3 MODEV BIT(1),         /*OLT TOBE RUN VIRTUAL  X03008* 01770000
*               3 MODER BIT(1),         /*OLT TOBE RUN REAL     X03008* 01780000
*               3 MIXDEV BIT(1),        /* SET SYMB 1ST INPUT   X03008* 01790000
*               3 * BIT(2);                                   /*X03008* 01800000
*         DCL CESWT10 CHAR(1) GEND;      /* CE SW 10 IN C A     Y02068* 01810000
*         DCL 1 OLTPSW10 CHAR(1) BASED(ADDR(CESWT10)),        /*Y02068* 01820000
*               3 MPSYS BIT(1),          /* OLTEP IN MP SYSTEM  Y02068* 01830000
*               3 AFFNSET BIT(1),        /* CPU AFFINITY SET    Y02068* 01840000
*               3 VERBCALL BIT(1),       /* VERB ENTERED        Y02068* 01850000
*               3 * BIT(5);              /* NOT LOOKED AT       Y02068* 01860000
*         DCL CESWTR CHAR(1) GENERATED;  /* RETAIN 370 SWITCHES S20203* 01870000
*         DCL 1 * CHAR(1) BASED(ADDR(CESWTR)),  /*              S20203* 01880000
*               3 RETAINAC BIT(1),       /* REI ACTIVE          S20203* 01890000
*               3 REMERR BIT(1),         /* ERROR OCCURRED      S20203* 01900000
*               3 REMNOMSG BIT(1),       /* REMOTE NO MSG       S20203* 01910000
*               3 CENOMSG BIT(1),        /* ONSITE NO MSG       S20203* 01920000
*               3 PRTNOMSG BIT(1),       /* SYSOUT NO MSG       S20203* 01930000
*               3 IMRESP BIT(1),         /* IMMEDIATE RESP MSG  S20203* 01940000
*               3 EXECOUT BIT(1),        /* MSG IFD104E ISSUED  S20203* 01950000
*               3 CECOMOUT BIT(1);       /* MSG IFD154E ISSUED  S20203* 01960000
*         DCL CESWTR1 CHAR(1) GENERATED; /*                     S20203* 01970000
*         DCL 1 * CHAR(1) BASED(ADDR(CESWTR1)),  /*             S20203* 01980000
*               3 ILLRESP BIT(1),        /* ILLEGAL RESP FROM R S20203* 01990000
*               3 EXECANS BIT(1),        /* REMOTE ANS IFD104E  S20203* 02000000
*               3 CECOMANS BIT(1),       /* REMOTE ANS IFD154E  S20203* 02010000
*               3 INFOMSG BIT(1),        /* CE TALK TO REMOTE   S20203* 02020000
*               3 RETRIEVE BIT(1),       /* MSG IN FROM REMOTE  S20203* 02030000
*               3 REMANS BIT(1),         /* REMOTE ANS IMMEDIAT S20203* 02040000
*               3 EDTOMSG BIT(1),        /* MSG IFD105D ISSUED  S20203* 02050000
*               3 * BIT(1);              /* NOT USED            S20203* 02060000
*         DCL CESWTR2 CHAR(1) GENERATED;    /* REI SWITCHES     S20203* 02070000
*         DCL 1 * CHAR(1) BASED(ADDR(CESWTR2)),     /*          S20203* 02080000
*               2 * BIT(2),              /*                     S20203* 02090000
*               2 ONCOMM BIT(1),         /*                     S20203* 02100000
*               2 * BIT(5);              /*                     S20203* 02110000
*         DCL CECINP03 LABEL;            /*                     S20203* 02120000
*         DCL INBUFPTR PTR(31) GENERATED;                               02130000
*         DCL SAVEBUF CHAR(72);         /* SAVE D/T/O/ ENTRY     M4832* 02140000
*         DCL CHASCT CHAR(116) GENERATED;                               02150000
*         DCL 1 SCT BASED(ADDR(CHASCT)),                                02160000
*               3 * CHAR(3),                                            02170000
*               3 FLAGS CHAR(1),                                        02180000
*                 5 SETERROR BIT(1),                                    02190000
*                 5 ASTERB BIT(1),                                      02200000
*                 5 UTCATAS BIT(1),      /*                     S20203* 02210000
*               3 RTNFLDXX CHAR(2),      /* NORMAL ROUTINE SELECTION  * 02220000
*                                        /* FIELD.              S20203* 02230000
*               3 * CHAR(27),            /* NOT LOOKED AT.      S20203* 02240000
*               3 EXPGMFLG CHAR(1),      /* EXECUTIVE PROGRAM FLAGS.  * 02250000
*                                        /*                     S20203* 02260000
*                 5 * BIT(2),            /* NOT LOOKED AT.      S20203* 02270000
*                 5 RTNSLCTN BIT(1),     /* ROUTINES SELECTED FLAG.   * 02280000
*                                        /*                     S20203* 02290000
*           3 * CHAR(2),                                                02300000
*           3 OLTFLGS CHAR(1),          /* OLT FLAGS            X02008* 02310000
*             5 * BIT(7),                                               02320000
*             5 TALKOLT BIT(1),         /* OLT CAN HANDLE TALK  X02008* 02330000
*           3 OLTFLG2 CHAR(1),          /* OLT FLAGS            X02008* 02340000
*             5 TALKCE BIT(1),          /* CE HAS NTRD TALK VERBX02008* 02350000
*           3 * CHAR(2),                /*                      X02008* 02360000
*               3 EXPANDED CHAR(30);     /* EXPANDED ROUTINE SELECTION* 02370000
*                                        /* FIELD.              S20203* 02380000
*         DCL ZUESUCB CHAR(2) GEND;      /* DEVICE EXPO IN C.A. X03008* 02390000
*         DCL ROPT CHAR(8) GENERATED;                                   02400000
*         DCL ROPTMIN2 CHAR(2) BASED(ADDR(ROPT)-2);                     02410000
*         DCL REIDEBAD PTR BASED(ADDR(ROPT)+8);  /* REI DEB PTR S20203* 02420000
*         DCL TSTDEBAD PTR GENERATED;    /* PTR TO TEST DEB     S20203* 02430000
*         DCL SCHEDSA PTR(31) GENERATED;                                02440000
*         DCL ADSVAREA PTR(31) GENERATED;                               02450000
*         DCL DATPTR PTR(31) GENERATED;                                 02460000
*         DCL MSGMOD PTR(31) GENERATED;                                 02470000
*         DCL IFDOLT48 LABEL NONLOCAL EXTERNAL;                         02480000
*         RESTRICT(1,2,5,6,7,8,9);                                      02490000
*         DCL TALK CHAR(4) INIT('TALK');/* COMPARE FOR TALK VERBX02008* 02500000
*                                                                       02510000
*         DCL 1 PARMLIST CHAR(16) BDY(WORD), /* LIST FOR LOADER X02008* 02520000
*           3 CDSNAME CHAR(8),          /* NAME OF MOD TO LOAD. X02008* 02530000
*           3 LOADPT PTR,               /* LOAD ADDR FOR CDS    X02008* 02540000
*           3 PFLAGS CHAR(1),           /* LOADER FLAGS NEEDED  X02008* 02550000
*           3 * CHAR(1),                                                02560000
*           3 CDSSIZE CHAR(2);          /* SIZE OF MODULE TO LD X02008* 02570000
*                                                                       02580000
*  SVR13=INTSAPTR;                       /* SECOND SAVE AREA          * 02590000
         L     @3,@A1              ADDRESS OF IFDOLT30            0093  02600000
         MVC   24(4,@3),4(@D)                                     0093  02610000
*  SA=ADDR(SVAREA);                      /* SAVE AREA ADDRESS         * 02620000
         LA    @D,20(0,@3)                                        0094  02630000
*  ADSVAREA=SA;                          /* SAVE ADDRESS              * 02640000
         ST    @D,ADSVAREA                                        0095  02650000
*  SAVAREAD=SA;                          /* CHAINBACK ADDRESS         * 02660000
         L     @4,@A1              ADDRESS OF IFDOLT30            0096  02670000
         L     @4,24(0,@4)         SVAREA                         0096  02680000
         ST    @D,8(0,@4)                                         0096  02690000
*         CDSNAME='TCDSMDUM';           /* DUMMY CDS ENTRY. IF  X02008* 02700000
         MVC   PARMLIST(8),@C1                                    0097  02710000
*                                       /* IT EXISTS, CDS FILE  X02008* 02720000
*                                       /* IS PRESENT           X02008* 02730000
*         LOADPT=ADDR(LOADPT);          /* ADDR OF WHERE MOD LD X02008* 02740000
         LA    @F,PARMLIST+8                                      0098  02750000
         ST    @F,PARMLIST+8                                      0098  02760000
*         PFLAGS='60'X;                 /* COMPUTE, CDS FLGS SETX02008* 02770000
         MVI   PARMLIST+12,X'60'                                  0099  02780000
*         CDSSIZE='0001'X;              /* LOAD ONLY ONE BYTE   X02008* 02790000
         MVC   PARMLIST+14(2),@X3                                 0100  02800000
*                                                                       02810000
*                                                                       02820000
*         /*          ISSUE LOAD FOR DUMMY CDS MODULE           X02008* 02830000
*                                                                       02840000
*         GEN(IFDMOD CALL='12',LIST=PARMLIST);                          02850000
         IFDMOD CALL='12',LIST=PARMLIST                                 02860000
         DS    0H                                                       02870000
*                                                                       02880000
*         RETCODE=RC;                                                   02890000
         LR    @9,@F                                              0102  02900000
*                                                                       02910000
*           /*        NON ZERO RETURN CODE ENDS OLTEP,NO CDS LOADED.  * 02920000
*                                                                       02930000
*         IF RETCODE ^= '00'X THEN  /* DID OPEN GO OK          XA01373* 02940000
         LA    @F,X'00'                                           0103  02950000
         CR    @F,@9                                              0103  02960000
         BC    08,@9FF                                            0103  02970000
*            DO;                    /*  ISSUE A TOTAL CLEANUP  XA01373* 02980000
*             ROPTMIN2 = '00';      /* IF NO OPEN, SET MYID    XA01373* 02990000
         MVC   ROPTMIN2(2),@C4                                    0105  03000000
*             R0 = ADDR(ROPT);      /* SET ROPT ADDRESS        XA01373* 03010000
         LA    @0,ROPT                                            0106  03020000
*             R1 = '14'X;           /* SET TOTAL CALL CODE     XA01373* 03030000
         LA    @1,X'14'                                           0107  03040000
*             GEN( SVC 59);         /* ISSUE SVC TO EFFECT CLEANS01373* 03050000
          SVC 59                                                        03060000
         DS    0H                                                       03070000
*             R6 = MSGMOD;          /* PTR TO MSG MOD FOR WTO   YM3333* 03080000
         L     @6,MSGMOD                                          0109  03090000
*             R1 = MSGPTR99;      /* PTR TO MSG IFD899I FOR WTO YM3333* 03100000
         L     @1,128(0,@6)                                       0110  03110000
*             IF MSG899ID(2) ^= '4' THEN /* HAS MSG BEEN ISSUED BEFORE* 03120000
         CLI   66(@1),C'4'                                        0111  03130000
         BC    08,@9FE                                            0111  03140000
*               DO;                        /* NO, NOW ISSUE IT  YM3333* 03150000
*                 MSG899ID(2) = '2';    /* MSG IDENT            YM3333* 03160000
         MVI   66(@1),C'2'                                        0113  03170000
*                 GEN(PWTO   REG=(1));  /* ISSUE MSG IFD899I    YM3333* 03180000
         PWTO   REG=(1)                                                 03190000
         DS    0H                                                       03200000
*               END;                                          /*YM3333* 03210000
*             GO TO CECINP17;       /* AND EXIT MOD            XA01373* 03220000
         BC    15,CECINP17                                        0116  03230000
*            END;                   /* END OF DO LOOP          XA01373* 03240000
*                                                                       03250000
*    CDSEXIST='1'B;                      /* CDS EXISTS INDICATED      * 03260000
@9FF     OI    OLTEPSW3,B'00000010'                               0118  03270000
*    IF MPSYS = '1'B THEN                /* IS OLTEP IN MP SYSTMY02068* 03280000
         TM    OLTPSW10,B'10000000'                               0119  03290000
         BC    12,@9FD                                            0119  03300000
*      DO;                               /* YES, SET SEFAULT AFFY02068* 03310000
*      VERBCALL = '0'B;                  /* SET TO INDICATE DEF Y02068* 03320000
         NI    OLTPSW10,B'10011111'                               0121  03330000
*      AFFNSET  = '0'B;                  /* SET TO NOT SET      Y02068* 03340000
*        GEN;                            /* CALL IFDOLT62 AFFN  Y02068* 03350000
         IFDMOD CALL='62'                * SET DEFAULT AFFINITY Y02068* 03360000
         IFDMOD DELETE='62'              * DELETE MODULE        Y02068* 03370000
         DS    0H                                                       03380000
*        IF  AFFNSET='0'B THEN           /* AND AFFINIY NOT SET Y02068* 03390000
         TM    OLTPSW10,B'01000000'                               0124  03400000
*           GOTO CECINP17;               /*CANCEL EXIT FROM AFFNY02068* 03410000
         BC    08,CECINP17                                        0125  03420000
*      END;                              /* CONTINUE PROCESSING Y02068* 03430000
* CECINP01:                                                             03440000
*         /************************************************************ 03450000
*         /*             CAN CONTROL RECORD INPUT BE USED             * 03460000
*         /************************************************************ 03470000
*  GEN(OPEN  (CNTRLREC,(INPUT),SYMLIB,(INPUT))); /* CONTROL AND REMOTE* 03480000
@9FD     EQU   *                                                  0127  03490000
CECINP01 OPEN  (CNTRLREC,(INPUT),SYMLIB,(INPUT))                        03500000
         DS    0H                                                       03510000
*                                      /* INPUT DATA SET.     */        03520000
* CECINP02:                                                             03530000
*         /************************************************************ 03540000
*         /*             DID CONTROL RECORD DATA SET OPEN             * 03550000
*         /************************************************************ 03560000
*         IF OFLAGS(4)='0'B THEN    /* WAS THERE A SUCCESSFUL OPEN. */  03570000
CECINP02 TM    OFLAGS,B'00010000'                                 0128  03580000
*           GO TO CECINP03;         /* NO, GET INPUT FROM CONSOLE. */   03590000
         BC    08,CECINP03                                        0129  03600000
*         ONCOMM='0'B;                   /* ZERO ONCOMM SWITCH  S20203* 03610000
         NI    A00028,B'11011111'                                 0130  03620000
*         IF RETAINAC='1'B               /* REI ACTIVE          S20203* 03630000
*           & REMANS='1'B                /* RE OPTION           S20203* 03640000
*               THEN GOTO CECINP03;      /* BRANCH              S20203* 03650000
         TM    A00025,B'10000000'                                 0131  03660000
         BC    12,@9FC                                            0131  03670000
         TM    A00026,B'00000100'                                 0131  03680000
         BC    03,CECINP03                                        0132  03690000
*         R9=ADDR(INPUTBUF);                                            03700000
@9FB     EQU   *                                                  0133  03710000
@9FC     LA    @9,INPUTBUF                                        0133  03720000
*         GEN;                      /* READ A RECORD */                 03730000
          READ  CNTLDECB,SF,CNTRLREC,(9),'S'                            03740000
          CHECK CNTLDECB                                                03750000
         DS    0H                                                       03760000
*         R6=MSGMOD;                /* GET POINTER TO MESSAGE MODULE. * 03770000
         L     @6,MSGMOD                                          0135  03780000
*         R1=MSGPTR00;              /* GET POINTER TO MESSAGE.        * 03790000
         L     @1,0(0,@6)                                         0136  03800000
*         IFD100I(9:80)=INPUTBUF;   /* PUT RECORD READ INTO MESSAGE.  * 03810000
         MVC   12(72,@1),INPUTBUF                                 0137  03820000
*         GEN(BAL   R7,CECPWTO);         /* ISSUE WTO            M4506* 03830000
         BAL   R7,CECPWTO                                               03840000
         DS    0H                                                       03850000
*         ONCOMM='1'B;                   /* CARD INPUT          S20203* 03860000
         OI    A00028,B'00100000'                                 0139  03870000
*         GO TO CECINP04;           /* LOOK AT INPUT. */                03880000
         BC    15,CECINP04                                        0140  03890000
* CECINP18:                                                             03900000
*         /************************************************************ 03910000
*         /*                       END OF FILE                        * 03920000
*         /************************************************************ 03930000
*         GEN(CLOSE (CNTRLREC));    /* CLOSE CNTRLIN.                 * 03940000
CECINP18 CLOSE (CNTRLREC)                                               03950000
         DS    0H                                                       03960000
* CECINP03:                                                             03970000
*         /************************************************************ 03980000
*         /*                                                          * 03990000
*         /*                 GET INPUT FROM CONSOLE                   * 04000000
*         /*                                                          * 04010000
*         /************************************************************ 04020000
*  IF CDSEQU='1'B THEN                   /* CHECK INDICATOR     XM0088* 04030000
CECINP03 TM    OLTEPSW9,B'10000000'                               0142  04040000
         BC    12,@9FA                                            0142  04050000
*    DO;                                 /* CDS EQUATE REQUEST  XM0088* 04060000
*      GEN(IFDMOD CALL='49');            /* CALL MODULE         XM0088* 04070000
         IFDMOD CALL='49'                                               04080000
         DS    0H                                                       04090000
*      GEN(IFDMOD DELETE='49');          /* DELETE MODULE       XM4982* 04100000
         IFDMOD DELETE='49'                                             04110000
         DS    0H                                                       04120000
*      LEGALDEV='0'B;                    /* NO DEVICE ENTRY     XM0088* 04130000
         NI    OLTEPSW,B'11110111'                                0146  04140000
*      CDSEQU='0'B;                      /* CDS EQUATES DONE    XM0088* 04150000
         NI    OLTEPSW9,B'01111111'                               0147  04160000
*    END;                                /* END CHECK           XM0088* 04170000
*         NDCFO='1'B;                    /* NO DYN COMM ALLOWEDXA01054* 04180000
@9FA     OI    OLTEPSW2,B'10000000'                               0149  04190000
*         PRNTOPTN='1'B;           /* SET FLAG TO INDECATE PREVIOUS OR* 04200000
         OI    OLTEPSW5,B'00000001'                               0150  04210000
*                                  /* DEFAULT OPTIONS  PRINTED   PRIOR  04220000
*                                  /* TO DTO MESSAGE OUTPUT.     21050* 04230000
*         GEN;                                                          04240000
CL33OPTN IFDMOD CALL='33'                                               04250000
         DS    0H                                                       04260000
*         GEN;                                                          04270000
DLT33    IFDMOD DELETE='33'             DELETE IFDOLT33                 04280000
         DS    0H                                                       04290000
*         PRNTOPTN='0'B;           /* RESET OPTN PRNT FLAG.      21050* 04300000
         NI    OLTEPSW5,B'11111110'                               0153  04310000
*         ECB=ECB&&ECB;                /* CLEAR ECB.    */              04320000
         XC    ECB(4),ECB                                         0154  04330000
*         INPUTBUF(1)=' ';          /* CLEAR INBUFR.                  * 04340000
         MVI   INPUTBUF,C' '                                      0155  04350000
*         INPUTBUF(2:72)=INPUTBUF(1:71);                                04360000
         MVC   INPUTBUF+1(71),INPUTBUF                            0156  04370000
*         /************************************************************ 04380000
*         /*                                                          * 04390000
*         /*                 PWTO MESSAGE IFD105D                     * 04400000
*         /*                                                          * 04410000
*         /************************************************************ 04420000
*         R6=MSGMOD;                /* GET POINTER TO MESSAGE MODULE. * 04430000
         L     @6,MSGMOD                                          0157  04440000
*         R1=MSGPTR05;              /* GET POINTER TO MESSAGE IFD105D * 04450000
         L     @1,12(0,@6)                                        0158  04460000
*         REPBUFLN='48'X;           /* PUT REPLY BUFFER LENGTH IN     * 04470000
         MVI   0(@1),X'48'                                        0159  04480000
*                                   /* WTOR PARAMETER LIST.           * 04490000
*         REMERR='0'B;                   /* ZERO RE ERROR FLAG   M4502* 04500000
         NI    A00025,B'10111111'                                 0160  04510000
*         ONCOMM='0'B;                   /* ZERO FLAG           S20203* 04520000
         NI    A00028,B'11011111'                                 0161  04530000
*         EDTOMSG='1'B;                  /* IDENTIFY MSG        S20203* 04540000
         OI    A00026,B'00000010'                                 0162  04550000
*         GEN(PWTOR REG=(1),WAIT=YES);                                  04560000
         PWTOR REG=(1),WAIT=YES                                         04570000
         DS    0H                                                       04580000
*         EDTOMSG='0'B;                  /* ZERO EDTOMSG FLAG   S20203* 04590000
         NI    A00026,B'11111101'                                 0164  04600000
* CECINP04:                                                             04610000
*         NDCFO='1'B;               /* SET BYPASS FOR DYNAMIC COMM.   * 04620000
CECINP04 OI    OLTEPSW2,B'10000000'                               0165  04630000
*         INBUFPTR=ADDR(INBUFR);    /* INITIALIZE INBUFR POINTER. */    04640000
         LA    @F,INBUFR                                          0166  04650000
         ST    @F,INBUFPTR                                        0166  04660000
*         /************************************************************ 04670000
*         /*                                                          * 04680000
*         /*             ARE 3 SLASH DELIMITERS PRESENT               * 04690000
*         /*                                                          * 04700000
*         /************************************************************ 04710000
*         R8=ADDR(INPUTBUF);            /* ADDRESS INPUTBUFFER   M4832* 04720000
         LA    @8,INPUTBUF                                        0167  04730000
*         SLASHCNT=0;               /* INITIALIZE SLASH COUNTER. */     04740000
         SR    @9,@9                                              0168  04750000
*  DO I=72 BY -1 TO 1;                   /* SEARCH BUFFER             * 04760000
         LA    @5,72                                              0169  04770000
*    IF B1ST='/' THEN                    /* CHECK FOR SLASH           * 04780000
@DO9F9   CLI   0(@8),C'/'                                         0170  04790000
         BC    07,@9F5                                            0170  04800000
*           DO;                                                         04810000
*           SLASHCNT=SLASHCNT+1;    /* YES, INCREMENT SLASH COUNTER. */ 04820000
         LA    @9,1(0,@9)                                         0172  04830000
*           IF SLASHCNT=1&                  /* IS SLASH COUNTER A ONE * 04840000
*            B2ND^='/' THEN              /* AND TEST ENTERED          * 04850000
         CH    @9,@D1                                             0173  04860000
         BC    07,@9F4                                            0173  04870000
         CLI   1(@8),C'/'                                         0173  04880000
         BC    08,@9F3                                            0173  04890000
*              DO;                       /* SAVE TEST TYPE            * 04900000
*             IF TESTTYPE(1)='T'|                                       04910000
*                   TESTTYPE(1)='P'|                                    04920000
*                         TESTTYPE(1)='N'|                              04930000
*                               TESTTYPE(1)='R' THEN                    04940000
         CLI   1(@8),C'T'                                         0175  04950000
         BC    08,@9F2                                            0175  04960000
         CLI   1(@8),C'P'                                         0175  04970000
         BC    08,@9F1                                            0175  04980000
         CLI   1(@8),C'N'                                         0175  04990000
         BC    08,@9F0                                            0175  05000000
         CLI   1(@8),C'R'                                         0175  05010000
         BC    07,@9EF                                            0175  05020000
*               TPSAVE=TESTTYPE(2:5);                                   05030000
@9F0     EQU   *                                                  0176  05040000
@9F1     EQU   *                                                  0176  05050000
@9F2     MVC   TPSAVE(4),2(@8)                                    0176  05060000
         BC    15,@9EE                                            0177  05070000
*             ELSE                                                      05080000
*               TPSAVE=TESTTYPE(1:4);                                   05090000
@9EF     MVC   TPSAVE(4),1(@8)                                    0177  05100000
*             END;                                                      05110000
@9EE     EQU   *                                                  0178  05120000
*           END;                                                        05130000
@9F3     EQU   *                                                  0179  05140000
@9F4     EQU   *                                                  0179  05150000
*        R8=ADDR(B2ND);                  /* NEXT CHARACTER            * 05160000
@9F5     LA    @8,1(0,@8)                                         0180  05170000
*  END;                                  /* NEXT CHARACTER            * 05180000
* CECINP4B:                             /* LABEL, SLASH CHECK   X02008* 05190000
*         IF SLASHCNT^=3 THEN           /* THREE SLASHES IN BUF XM5089* 05200000
         BCT   @5,@DO9F9                                          0181  05210000
CECINP4B CH    @9,@D2                                             0182  05220000
*           GO TO CECINP4A;             /* CHECK FOR SPECIALS   XM5089* 05230000
         BC    07,CECINP4A                                        0183  05240000
*         IF INPUTBUF(1:2)='//' &       /* SAME DEV AND TEST?    M4832* 05250000
*          LEGALDEV='1'B &              /* VALID DEV TO TEST     M4832* 05260000
*          LEGALTST='1'B THEN           /* VALID TEST ENTERED    M4823* 05270000
         CLC   INPUTBUF(2),@C16                                   0184  05280000
         BC    07,@9ED                                            0184  05290000
         TM    OLTEPSW,B'00001000'                                0184  05300000
         BC    12,@9EC                                            0184  05310000
         TM    OLTEPSW,B'10000000'                                0184  05320000
         BC    12,@9EB                                            0184  05330000
*           DO;                         /* YES, THEN SET UP      M4832* 05340000
*            INBUFPTR=INBUFPTR+1;       /* INPUT BUFFER FOR      M4832* 05350000
         LA    @F,1                                               0186  05360000
         A     @F,INBUFPTR                                        0186  05370000
         ST    @F,INBUFPTR                                        0186  05380000
*            GO TO CECINP15;            /* OPTION DECODE,DYN COM M4832* 05390000
         BC    15,CECINP15                                        0187  05400000
*           END;                                                        05410000
*         IF FERINT='1'B THEN           /* 1ST ERROR, DYN COMM?  M4832* 05420000
@9EB     EQU   *                                                  0189  05430000
@9EC     EQU   *                                                  0189  05440000
@9ED     TM    OLTEPSW,B'00000010'                                0189  05450000
         BC    12,@9EA                                            0189  05460000
*          DO;                          /* YES, SETUP FOR OLT    M4832* 05470000
*           SAVEBUF=INPUTBUF;           /* CLEANUP BY SAVING BUFRM4832* 05480000
         MVC   SAVEBUF(72),INPUTBUF                               0191  05490000
*           GOTINPUT='1'B;              /* SET BIT ON,SET UP FOR M4832* 05500000
         OI    OLTEPSW7,B'00000001'                               0192  05510000
*           GO TO CECINP09;             /* OLT SCHEDULER.        M4832* 05520000
         BC    15,CECINP09                                        0193  05530000
*          END;                                                         05540000
*         GO TO CECINP07;               /* CONTINUE DECODING BUFXM5089* 05550000
* CECINP4A:                                                             05560000
*         /************************************************************ 05570000
*         /*                                                          * 05580000
*         /*         LOOK FOR SPECIAL ENTRIES                         * 05590000
*         /*                                                          * 05600000
*         /************************************************************ 05610000
*                                        /* CPUAFFN VERB CHECK  Y02068* 05620000
*         IF INPUTBUF(1:8)^='CPUAFFN=' THEN/* IF AFFN VERB NOT  Y02068* 05630000
CECINP4A CLC   INPUTBUF(8),@C17                                   0196  05640000
*           GOTO CECINP4D;               /* ENTERED CHECK NEXT  Y02068* 05650000
         BC    07,CECINP4D                                        0197  05660000
*         IF FERINT='1'B                 /* IF THIS IS FIRST ERRY02068* 05670000
*           | UTCATAS='1'B THEN          /* REPLY OR CATASTROFICY02068* 05680000
         TM    OLTEPSW,B'00000010'                                0198  05690000
         BC    01,@9E9                                            0198  05700000
         TM    SCT+3,B'00100000'                                  0198  05710000
         BC    12,@9E8                                            0198  05720000
*             GOTO CECINP4D;             /* CPUAFFN REQ INVALID Y02068* 05730000
         BC    03,CECINP4D                                        0199  05740000
*         IF RETAINAC='1'B               /* IF REI ACTIVE & THISY02068* 05750000
*           & ONCOMM='0'B THEN           /* IS NOT A ONSITE COMMY02068* 05760000
@9E8     TM    A00025,B'10000000'                                 0200  05770000
         BC    12,@9E7                                            0200  05780000
         TM    A00028,B'00100000'                                 0200  05790000
*             GOTO CECINP4D;             /* CPUAFFN REQUEST NO GY02068* 05800000
         BC    10,CECINP4D                                        0201  05810000
*         IF MPSYS='0'B THEN             /* IF IS CHECK IF MP   Y02068* 05820000
@9E6     EQU   *                                                  0202  05830000
@9E7     TM    OLTPSW10,B'10000000'                               0202  05840000
         BC    05,@9E5                                            0202  05850000
*           DO;                          /* SYSTEM IF NOT THEN  Y02068* 05860000
*             R1 = MSGPR260;             /* ISSUE MSG IFD260I   Y02068* 05870000
         L     @1,132(0,@6)                                       0204  05880000
*             GEN(BAL   R7,CECPWTO);     /* VERB NOT VALID      Y02068* 05890000
         BAL   R7,CECPWTO                                               05900000
         DS    0H                                                       05910000
*             GOTO CECINP03;             /* REDEFINE E DTO MSG  Y02068* 05920000
         BC    15,CECINP03                                        0206  05930000
*           END;                         /* IFD105D             Y02068* 05940000
*         VERBCALL = '1'B;               /* INDICATE THIS IS VRBY02068* 05950000
@9E5     OI    OLTPSW10,B'00100000'                               0208  05960000
*         AFFNSET = '0'B;                /* SHOW AFFN NOT SET   Y02068* 05970000
         NI    OLTPSW10,B'10111111'                               0209  05980000
*         GEN;                           /* GOTO CPU AFFINITY   Y02068* 05990000
         IFDMOD CALL='62'                * CALL IFDOLT62        Y02068* 06000000
         IFDMOD DELETE='62'              * DELETE MODULE        Y02068* 06010000
         DS    0H                                                       06020000
*         IF AFFNSET = '1'B THEN         /* COMPLETE?           Y02068* 06030000
         TM    OLTPSW10,B'01000000'                               0211  06040000
*           GOTO CECINP02;               /* YES, READ NEXT      Y02068* 06050000
         BC    01,CECINP02                                        0212  06060000
*         IF  AFFNSET='0'B THEN          /* NO  AFFINIY NOT SET Y02068* 06070000
         TM    OLTPSW10,B'01000000'                               0213  06080000
*           GOTO CECINP17;               /*CANCEL EXIT FROM AFFNY02068* 06090000
         BC    08,CECINP17                                        0214  06100000
* CECINP4D:                                                   /*Y02068* 06110000
*                                        /* ELSE EQU VERB CHECK Y02068* 06120000
*  IF RETAINAC='1'B&                     /* REI ACTIVE          XM0088* 06130000
*    ONCOMM='0'B THEN                    /* NOT ONSITE          XM0088* 06140000
CECINP4D TM    A00025,B'10000000'                                 0215  06150000
         BC    12,@9E4                                            0215  06160000
         TM    A00028,B'00100000'                                 0215  06170000
*      GOTO CECINP4C;                    /* EQUATE NOT ALLOWED  XM0088* 06180000
         BC    10,CECINP4C                                        0216  06190000
*  IF INPUTBUF(1:3)='EQU' THEN           /* CHECK REPLY         XM0088* 06200000
@9E3     EQU   *                                                  0217  06210000
@9E4     CLC   INPUTBUF(3),@C18                                   0217  06220000
         BC    07,@9E2                                            0217  06230000
*    DO;                                 /* CDS EQUATE REQUEST  XM0088* 06240000
*      CDSEQU='1'B;                      /* INDICATE CDS EQUATE XM0088* 06250000
         OI    OLTEPSW9,B'10000000'                               0219  06260000
*      IF FERINT='1'B THEN               /* CHECK INDICATOR     XM0088* 06270000
         TM    OLTEPSW,B'00000010'                                0220  06280000
*        GOTO CECINP09;                  /* DYN COMMUNICATIONS  XM0088* 06290000
         BC    01,CECINP09                                        0221  06300000
*      GOTO CECINP02;                    /* ISSUE WTOR          XM0088* 06310000
         BC    15,CECINP02                                        0222  06320000
*    END;                                /* END REPLY CHECK     XM0088* 06330000
* CECINP4C:                              /* LABEL               XM0088* 06340000
*  IF INPUTBUF(1:3)^=REI THEN            /* IS REI SPECIFIED          * 06350000
@9E2     EQU   *                                                  0224  06360000
CECINP4C CLC   INPUTBUF(3),STOPREI+4                              0224  06370000
*    GOTO CECINP20;                      /* NO CONTINUE               * 06380000
         BC    07,CECINP20                                        0225  06390000
*         IF RETAINAC='1'B THEN          /* IF REI ALREADY      S20203* 06400000
         TM    A00025,B'10000000'                                 0226  06410000
*           GOTO CECINP02;               /* GO REDEFINE TEST    S20203* 06420000
         BC    01,CECINP02                                        0227  06430000
*  GEN;                                                                 06440000
CL54     IFDMOD CALL='54'               MODULE CALL               M4506 06450000
DLT54    IFDMOD DELETE='54'             DELETE IFDOLT54                 06460000
         DS    0H                                                       06470000
*         IF RETAINAC='0'B THEN          /* NO REI GOTO CONSOLE S20203* 06480000
         TM    A00025,B'10000000'                                 0229  06490000
*           GOTO CECINP03;               /*                     S20203* 06500000
         BC    08,CECINP03                                        0230  06510000
*         GOTO CECINP02;                 /* GO REDEFINE TEST    S20203* 06520000
         BC    15,CECINP02                                        0231  06530000
*  CECINP20:                             /*                     S20203* 06540000
*  IF INPUTBUF(1:7)^=STOPREI THEN        /* IS STOPREI ENTERED        * 06550000
CECINP20 CLC   INPUTBUF(7),STOPREI                                0232  06560000
*           GOTO CECINP21;               /* NO CONTINUE         S20203* 06570000
         BC    07,CECINP21                                        0233  06580000
*         IF RETAINAC='0'B THEN          /* IF REI NOT ACTIVE   S20203* 06590000
         TM    A00025,B'10000000'                                 0234  06600000
*           GOTO CECINP02;               /* GO REDEFINE TEST    S20203* 06610000
         BC    08,CECINP02                                        0235  06620000
*  GEN;                                                                 06630000
CL56     IFDMOD CALL='56'               MODULE CALL               M4506 06640000
DLT56    IFDMOD DELETE='56'             DELETE IFDOLT56                 06650000
         DS    0H                                                       06660000
*         GOTO CECINP02;                 /* GO REDEFINE TEST    S20203* 06670000
         BC    15,CECINP02                                        0237  06680000
*  CECINP21:                             /*                     S20203* 06690000
*         IF INPUTBUF(1:3)^='CAN' THEN /* IS CANCEL SPECIFIED. */       06700000
CECINP21 CLC   INPUTBUF(3),@C19                                   0238  06710000
*           GO TO CECINP05;           /* NO, CONTINUE.        */        06720000
         BC    07,CECINP05                                        0239  06730000
*         IF RETAINAC='1'B               /* REI ACTIVE          S20203* 06740000
*           & ONCOMM='0'B THEN           /* NOT ONSITE DYN COMM S20203* 06750000
         TM    A00025,B'10000000'                                 0240  06760000
         BC    12,@9E1                                            0240  06770000
         TM    A00028,B'00100000'                                 0240  06780000
*           GOTO CECINP02;               /* GO REDEFINE TEST    S20203* 06790000
         BC    10,CECINP02                                        0241  06800000
*         IF RETAINAC='1'B THEN          /* IS REI ACTIVE.      S20203* 06810000
@9E0     EQU   *                                                  0242  06820000
@9E1     TM    A00025,B'10000000'                                 0242  06830000
         BC    12,@9DF                                            0242  06840000
*           DO;                          /* YES.                S20203* 06850000
*  GEN(BAL   R14,CL56+4);                /* MODULE IDENTITY      M4506* 06860000
         BAL   R14,CL56+4                                               06870000
         DS    0H                                                       06880000
*  GEN(BAL   R14,DLT56+4);               /* DELETE IFDOLT56           * 06890000
         BAL   R14,DLT56+4                                              06900000
         DS    0H                                                       06910000
*           END;                         /* CONTINUE            S20203* 06920000
*         INPUTBUF(1)=CAN;          /* PUT CANCEL INDICATOR IN INBUFR.* 06930000
@9DF     MVC   INPUTBUF(1),CAN                                    0247  06940000
*         IF FERINT='1'B|           /* IS A TEST STILL IN PROCESS. */   06950000
*               UTCATAS='1'B THEN   /* YES, FREE IT UP AND BY-PASS */   06960000
         TM    OLTEPSW,B'00000010'                                0248  06970000
         BC    01,@9DE                                            0248  06980000
         TM    SCT+3,B'00100000'                                  0248  06990000
         BC    12,@9DD                                            0248  07000000
*           DO;                     /* ALL OTHERS.                 */   07010000
*           BYPALDEV='1'B;          /* SET BYPASS FLAG ON. */           07020000
@9DE     OI    OLTEPSW3,B'01000000'                               0250  07030000
*  GEN;                                                     /*@ZA16985* 07040000
         L     R13,SCHEDSA        /* SET UP TO GO */           @ZA16985 07050000
         BC    15,@EL01+4         /* TO SCHEDULER */           @ZA16985 07060000
         DS    0H                                                       07070000
*           END;                                                        07080000
*         GO TO CECINP16;           /* CLEAN-UP. */                     07090000
         BC    15,CECINP16                                        0253  07100000
* CECINP05:                                                             07110000
*                                                                       07120000
*         /*          DOES CE  WISH TO 'TALK' TO THE OLT?       X02008* 07130000
*                                                                       07140000
*         IF INPUTBUF(1:4)^=TALK THEN   /* IS TALK SPECIFIED?   X02008* 07150000
CECINP05 CLC   INPUTBUF(4),TALK                                   0254  07160000
*           GO TO CECINP19;             /* NO, GO ON.           X02008* 07170000
         BC    07,CECINP19                                        0255  07180000
*         IF FERINT='0'B &              /* NOT DYN COM OR FIRST X02008* 07190000
*           UTCATAS='0'B THEN           /* ERROR OR CATAS ERROR X02008* 07200000
         TM    OLTEPSW,B'00000010'                                0256  07210000
         BC    05,@9DC                                            0256  07220000
         TM    SCT+3,B'00100000'                                  0256  07230000
*           GO TO CECINP19;             /* COMM THEN GO  OUTPUT X02008* 07240000
         BC    10,CECINP19                                        0257  07250000
*                                       /* IFD106I MESSAGE.     X02008* 07260000
*         TALKVERB='1'B;                /* TALK VERB ENTERED.   X02008* 07270000
@9DB     EQU   *                                                  0258  07280000
@9DC     OI    OLTEPSW3,B'10000000'                               0258  07290000
*                                                                       07300000
*         /* CAN THE OLT ENTERED HANDLE THE TALK FACILITY?      X02008* 07310000
*                                                                       07320000
*         IF TALKOLT='1'B THEN          /* CAN OLT HANDLE TALK? X02008* 07330000
         TM    SCT+36,B'00000001'                                 0259  07340000
         BC    12,@9DA                                            0259  07350000
*           DO;                         /* YES,                 X02008* 07360000
*             TALKCE='1'B;              /* TURN ON FLAG FOR CE. X02008* 07370000
         OI    SCT+37,B'10000000'                                 0261  07380000
*             TALKHERE='1'B;            /* SET SWITCH, TALK ENT X02008* 07390000
         OI    OLTEPSW8,B'00000001'                               0262  07400000
*             GO TO CECINP15;           /* CONT.--ISSUE MSG 104 X02008* 07410000
         BC    15,CECINP15                                        0263  07420000
*           END;                        /* END LOOP.            X02008* 07430000
*                                                                       07440000
*         R1=MSGPTR66;                  /* ADDRESS TALK MSG.    X02008* 07450000
@9DA     L     @1,120(0,@6)                                       0265  07460000
*         GEN(BAL R7,CECPWTO);          /* ISSUE MESSAGE        X02008* 07470000
         BAL R7,CECPWTO                                                 07480000
         DS    0H                                                       07490000
*         TALKHERE='1'B;                /* SET SWITCH, TALK ENT X02008* 07500000
         OI    OLTEPSW8,B'00000001'                               0267  07510000
*         GO TO CECINP15;               /* CONTINUE DECODE PROCEX02008* 07520000
         BC    15,CECINP15                                        0268  07530000
* CECINP19:                             /* LABEL                X02008* 07540000
*         /************************************************************ 07550000
*         /*                                                          * 07560000
*         /*                 IS PROMPTING SPECIFIED                   * 07570000
*         /*                                                          * 07580000
*         /************************************************************ 07590000
*         IF INPUTBUF(1:6)='PROMPT' THEN /* IS PROMPTING DESIRED. */    07600000
CECINP19 CLC   INPUTBUF(6),@C20                                   0269  07610000
         BC    07,@9D9                                            0269  07620000
*           DO;                          /* YES, IS IT A VALID    */    07630000
*           IF INPUTBUF(8)='A'|          /* REQUEST. YES, PROMPT. */    07640000
*                 INPUTBUF(8)='D'|       /* NO, CONTINUE.         */    07650000
*                       INPUTBUF(8)='T'|                                07660000
*                             INPUTBUF(8)='O' THEN                      07670000
         CLI   INPUTBUF+7,C'A'                                    0271  07680000
         BC    08,@9D8                                            0271  07690000
         CLI   INPUTBUF+7,C'D'                                    0271  07700000
         BC    08,@9D7                                            0271  07710000
         CLI   INPUTBUF+7,C'T'                                    0271  07720000
         BC    08,@9D6                                            0271  07730000
         CLI   INPUTBUF+7,C'O'                                    0271  07740000
         BC    07,@9D5                                            0271  07750000
*             DO;                                                       07760000
@9D6     EQU   *                                                  0272  07770000
@9D7     EQU   *                                                  0272  07780000
@9D8     EQU   *                                                  0272  07790000
*  GEN;                                                                 07800000
CL50     IFDMOD CALL='50'               MODULE CALL               M4506 07810000
DLT50    IFDMOD DELETE='50'             DELETE IFDOLT50                 07820000
         DS    0H                                                       07830000
*             GO TO CECINP03;                                           07840000
         BC    15,CECINP03                                        0274  07850000
*             END;                                                      07860000
*           END;                                                        07870000
@9D5     EQU   *                                                  0276  07880000
*         /************************************************************ 07890000
*         /*                                                          * 07900000
*         /*                 PWTO MESSAGE IFD106I                     * 07910000
*         /*                                                          * 07920000
*         /************************************************************ 07930000
*         R1=MSGPTR06;              /* MESSAGE IFD106I. */              07940000
@9D9     L     @1,16(0,@6)                                        0277  07950000
*         GEN(BAL   R7,CECPWTO);         /* ISSUE WTO            M4506* 07960000
         BAL   R7,CECPWTO                                               07970000
         DS    0H                                                       07980000
*         GO TO CECINP03;           /* TRY AGAIN. */                    07990000
         BC    15,CECINP03                                        0279  08000000
* CECINP06:                                                             08010000
*         /************************************************************ 08020000
*         /*                                                          * 08030000
*         /*            REWRITE TAPE LABELS AND CLEAN UP              * 08040000
*         /*                                                          * 08050000
*         /************************************************************ 08060000
*         TAPEHDR='1'B;             /* REWRITE TAPE LABELS.           * 08070000
CECINP06 OI    OLTEPSW2,B'00000010'                               0280  08080000
*            CANFLG = INPUTBUF(1); /* SAVE CAN FLAG           @ZA08985* 08090000
         MVC   CANFLG(1),INPUTBUF                                 0281  08100000
*         R15=DATPTR;                                                   08110000
         L     @F,DATPTR                                          0282  08120000
*         GEN(BALR  14,15);                                             08130000
         BALR  14,15                                                    08140000
         DS    0H                                                       08150000
*            INPUTBUF(1)=CANFLG;  /* RESTORE CAN FLG          @ZA08985* 08160000
         MVC   INPUTBUF(1),CANFLG                                 0284  08170000
* CECINP6A:                              /*                     S20203* 08180000
*         TAPEHDR='0'B;                  /* RESET TAPE LABEL FLGS20203* 08190000
CECINP6A NI    OLTEPSW2,B'11111101'                               0285  08200000
*         IF REMOTE='1'B THEN       /* REMOTE TERMINAL IN D/T/O/.     * 08210000
         TM    OLTEPSW7,B'00100000'                               0286  08220000
         BC    12,@9D4                                            0286  08230000
*           DO;                     /* YES, DISABLE ANY UP LINES.     * 08240000
*      GEN(IFDMOD CALL='74',LIST=0);     /* DISABLE                   * 08250000
         IFDMOD CALL='74',LIST=0                                        08260000
         DS    0H                                                       08270000
*      GEN(IFDMOD DELETE='74');          /* DELETE MODULE       XM4982* 08280000
         IFDMOD DELETE='74'                                             08290000
         DS    0H                                                       08300000
*           END;                    /* END DISABLE PROCEEDURE.        * 08310000
*         ROPTMIN2='00';            /* ISSUE SVC 59 TO CLEAN UP. */     08320000
@9D4     MVC   ROPTMIN2(2),@C4                                    0291  08330000
*         IF RETAINAC='1'B THEN          /* IF REI ACTIVE       S20203* 08340000
         TM    A00025,B'10000000'                                 0292  08350000
         BC    12,@9D3                                            0292  08360000
*           REIDEBAD=TSTDEBAD+128;       /* PTR TO REI DEB      S20203* 08370000
         LA    @F,128                                             0293  08380000
         A     @F,TSTDEBAD                                        0293  08390000
         ST    @F,REIDEBAD                                        0293  08400000
         BC    15,@9D2                                            0294  08410000
*           ELSE REIDEBAD=0;             /* NO. SET TO ZERO     S20203* 08420000
@9D3     SR    @F,@F                                              0294  08430000
         ST    @F,REIDEBAD                                        0294  08440000
*         R0=ADDR(ROPT);                                                08450000
@9D2     LA    @0,ROPT                                            0295  08460000
*                                                                       08470000
*         IF INPUTBUF(1)^=CAN           /* CAN IN INPUT BUFR    XM0097* 08480000
*         THEN                          /* NO ISSUE SVC FOR     XM0097* 08490000
         CLC   INPUTBUF(1),CAN                                    0296  08500000
         BC    08,@9D1                                            0296  08510000
*         R1='8014'X;                   /* PARTIAL CLEANUP.     XM0097* 08520000
         L     @1,@X24                                            0297  08530000
         BC    15,@9D0                                            0298  08540000
*         ELSE                          /* YES,  TOTAL CLEANUP. XM0097* 08550000
*         R1='14'X;                                                     08560000
@9D1     LA    @1,X'14'                                           0298  08570000
*         GEN(SVC   59);                /* GO CLEAN UP          X03008* 08580000
@9D0     EQU   *                                                  0299  08590000
         SVC   59                                                       08600000
         DS    0H                                                       08610000
*         ZUESUCB=ZUESUCB&&ZUESUCB;    /* CLEAN UP DEVICE EXPO  X03008* 08620000
         XC    ZUESUCB(2),ZUESUCB                                 0300  08630000
*         GO TO R8;                 /* RETURN.                        * 08640000
         BCR   15,@8                                              0301  08650000
* CECINP07:                                                             08660000
*         /************************************************************ 08670000
*         /*                HAS A DEVICE BEEN ENTERED                 * 08680000
*         /************************************************************ 08690000
*         IF INPUTBUF(1)='/' THEN   /* HAS A DEVICE BEEN ENTERED. */    08700000
CECINP07 CLI   INPUTBUF,C'/'                                      0302  08710000
*           GO TO CECINP08;         /* NO, CONTINUE. */                 08720000
         BC    08,CECINP08                                        0303  08730000
*         IF INPUTBUF(1:2)='.N' THEN                                    08740000
         CLC   INPUTBUF(2),@C25                                   0304  08750000
*           GOTO CECINP22;               /* YES. BRANCH         S20203* 08760000
         BC    08,CECINP22                                        0305  08770000
*         IF RETAINAC='1'B               /*                     S20203* 08780000
*           & ONCOMM='0'B THEN           /*                     S20203* 08790000
         TM    A00025,B'10000000'                                 0306  08800000
         BC    12,@9CF                                            0306  08810000
         TM    A00028,B'00100000'                                 0306  08820000
*               GOTO CECINP13;           /* REMOTE ANSWERED     S20203* 08830000
         BC    10,CECINP13                                        0307  08840000
*  CECINP22:                             /*                     S20203* 08850000
*         IF INITENT='1'B | LEGALDEV='1'B THEN                /*YM6196* 08860000
@9CE     EQU   *                                                  0308  08870000
@9CF     EQU   *                                                  0308  08880000
CECINP22 TM    OLTEPSW2,B'00001000'                               0308  08890000
         BC    01,@9CD                                            0308  08900000
         TM    OLTEPSW,B'00001000'                                0308  08910000
         BC    12,@9CC                                            0308  08920000
*                            /* YES, IS IT THE INITIAL ENTRY.   YM6196* 08930000
*           DO;                     /* NO, CLEAN-UP BY REWRITING TAPE * 08940000
@9CD     EQU   *                                                  0309  08950000
*           GEN(BAL   R8,CECINP06); /* REWRITE TAPE LABELS AND CLEANUP* 08960000
         BAL   R8,CECINP06                                              08970000
         DS    0H                                                       08980000
*                                   /* LABELS, BY ISSUEING SVC 59 AND * 08990000
*                                   /* CLEARING THE DEVTABLE.         * 09000000
*         REIDEBAD=0;                   /* CLEAR ROPT DEB ADDR  XM6301* 09010000
         SR    @F,@F                                              0311  09020000
         ST    @F,REIDEBAD                                        0311  09030000
*  R8=DEVTBPTR;                          /* DEVICE TABLES             * 09040000
         L     @8,DEVTBPTR                                        0312  09050000
*  DO R9=TABLNGTH BY -1 TO 1;            /* TABLE LENGTH              * 09060000
         LH    @9,TABLNGTH                                        0313  09070000
         LTR   @9,@9                                              0313  09080000
         BC    12,@DO9CA                                          0313  09090000
*    DVT=DVT&&DVT;                       /* ZERO TABLE AREA           * 09100000
@DO9CB   XC    0(16,@8),0(@8)                                     0314  09110000
*    R8=ADDR(DVTN);                      /* NEXT TABLE AREA           * 09120000
         LA    @8,16(0,@8)                                        0315  09130000
*  END;                                  /* ZERO TOTAL TABLE          * 09140000
*           DPRINTFL='00'B;         /* CLEAR DPRINT INTERNAL FLAGS.   * 09150000
         BCT   @9,@DO9CB                                          0316  09160000
@DO9CA   NI    OLTEPSW5,B'11100111'                               0317  09170000
*           END;                                                        09180000
*         GO TO CECINP09;           /* CONTINUE. */                     09190000
         BC    15,CECINP09                                        0319  09200000
* CECINP08:                                                             09210000
*         /************************************************************ 09220000
*         /*                 HAS A TEST BEEN ENTERED                  * 09230000
*         /************************************************************ 09240000
*         IF INPUTBUF(2)='/' THEN   /* HAS A TEST BEEN ENTERED. */      09250000
CECINP08 CLI   INPUTBUF+1,C'/'                                    0320  09260000
*           GO TO CECINP11;         /* NO, CONTINUE.            */      09270000
         BC    08,CECINP11                                        0321  09280000
* CECINP09:                                                             09290000
*         /************************************************************ 09300000
*         /*                SHOULD TESTS BE CANCELED                  * 09310000
*         /************************************************************ 09320000
*         IF FERINT^='1'B THEN      /* IS THIS FIRST ERROR COMM. */     09330000
CECINP09 TM    OLTEPSW,B'00000010'                                0322  09340000
*           GO TO CECINP11;         /* NO, CONTINUE. */                 09350000
         BC    12,CECINP11                                        0323  09360000
*         BYPALDEV='1'B;            /* BYPASS ALL TESTING. */           09370000
         OI    OLTEPSW3,B'01000000'                               0324  09380000
*         ATM='1'B;                 /* SET ABNORMAL TERMINATION */      09390000
         OI    OLTEPSW6,B'01000000'                               0325  09400000
*                                   /* MESSAGE FLAG ON.         */      09410000
*         TALKVERB='0'B;                /* ZERO TALKVERB FLAG   X02008* 09420000
         NI    OLTEPSW3,B'01111111'                               0326  09430000
*         TALKCE='0'B;                  /* ZERO TALK FLG IN SCT X02008* 09440000
         NI    SCT+37,B'01111111'                                 0327  09450000
*         ASTERB = '1'B;               /* TERMINATE OLT WITH * T MSG  * 09460000
         OI    SCT+3,B'01000000'                                  0328  09470000
*  GEN;                                                     /*@ZA16985* 09480000
         L     R13,SCHEDSA      /* SET UP TO GO */             @ZA16985 09490000
         BC    15,@EL01+4       /* TO SCHEDULER */             @ZA16985 09500000
         DS    0H                                                       09510000
* CECINP10:                                                             09520000
*         FERINT='0'B;              /* CLEAR FERINT INDICATOR. */       09530000
CECINP10 NI    OLTEPSW,B'11111101'                                0330  09540000
*         SETERROR='0'B;            /* CLEAR ERROR BIT IN SCT. */       09550000
         NI    SCT+3,B'01111111'                                  0331  09560000
*         ATM='0'B;                 /* CLEAR ATM FLAG. */               09570000
         NI    OLTEPSW6,B'10111111'                               0332  09580000
*         BYPALDEV='0'B;            /* CLEAR BYPASS ALL DEVICES FLAG. * 09590000
         NI    OLTEPSW3,B'10111111'                               0333  09600000
*  IF CDSEQU='1'B THEN                   /* CHECK INDICATOR     XM0088* 09610000
         TM    OLTEPSW9,B'10000000'                               0334  09620000
*    GOTO CECINP02;                      /* CDS EQUATES         XM0088* 09630000
         BC    01,CECINP02                                        0335  09640000
*         IF GOTINPUT='1'B THEN         /* D/T/O/ ENTERED?       M4832* 09650000
         TM    OLTEPSW7,B'00000001'                               0336  09660000
         BC    12,@9C7                                            0336  09670000
*          DO;                          /* YES, RESET BIT TO ZEROM4832* 09680000
*           GOTINPUT='0'B;              /* AND RESTORE INBUT BUF M4832* 09690000
         NI    OLTEPSW7,B'11111110'                               0338  09700000
*           INPUTBUF=SAVEBUF;           /* FER, CONTINUE DECODINGM4832* 09710000
         MVC   INPUTBUF(72),SAVEBUF                               0339  09720000
*           GO TO CECINP04;             /* CHECK SLASH DELIMITERXM6301* 09730000
         BC    15,CECINP04                                        0340  09740000
*          END;                         /*                       M4832* 09750000
* CECINP11:                                                             09760000
*         IF INPUTBUF(1)^='/' THEN  /* IS CHAR. A SLASH. */             09770000
@9C7     EQU   *                                                  0342  09780000
CECINP11 CLI   INPUTBUF,C'/'                                      0342  09790000
*           GO TO CECINP13;             /* DECODE DEVICE FIELD. SM2411* 09800000
         BC    07,CECINP13                                        0343  09810000
*         IF LEGALDEV^='1'B THEN    /* HAVE LEGAL DEVICES BEEN ENTERED* 09820000
         TM    OLTEPSW,B'00001000'                                0344  09830000
*           GO TO CECINP12;         /* PREVIOUSLY. NO, ERROR.         * 09840000
*         GO TO CECINP14;           /* DECODE TESTS. */                 09850000
         BC    03,CECINP14                                        0346  09860000
* CECINP12:                                                             09870000
*         /************************************************************ 09880000
*         /*                                                          * 09890000
*         /*                 PWTO MESSAGE IFD108I                     * 09900000
*         /*                                                          * 09910000
*         /************************************************************ 09920000
*         R1=MSGPTR08;              /* GET POINTER TO MESSAGE IFD108I.* 09930000
CECINP12 L     @1,20(0,@6)                                        0347  09940000
*         GEN(BAL   R7,CECPWTO);         /* ISSUE WTO            M4506* 09950000
         BAL   R7,CECPWTO                                               09960000
         DS    0H                                                       09970000
*         R1=MSGPTR61;              /* GIVE MEANS OF PROMPTING, IF */   09980000
         L     @1,60(0,@6)                                        0349  09990000
*         GEN(BAL   R7,CECPWTO);         /* ISSUE WTO            M4506* 10000000
         BAL   R7,CECPWTO                                               10010000
         DS    0H                                                       10020000
*         GO TO CECINP03;           /* CONTINUE. */                     10030000
         BC    15,CECINP03                                        0351  10040000
* CECINP13:                                                             10050000
*         /************************************************************ 10060000
*         /*                                                          * 10070000
*         /*                     DECODE DEVICES                       * 10080000
*         /*                                                          * 10090000
*         /************************************************************ 10100000
*         IF INPUTBUF(1)<'A'|       /* IS DEV ENTRY EQUAL TO    X03008* 10110000
*            INPUTBUF(1)>'Z' THEN   /* DEV ADDR OR SYMBOLIC     X03008* 10120000
CECINP13 CLI   INPUTBUF,C'A'                                      0352  10130000
         BC    04,@9C6                                            0352  10140000
         CLI   INPUTBUF,C'Z'                                      0352  10150000
         BC    12,@9C5                                            0352  10160000
*           MIXDEV='0'B;            /* ADDRESS ENTRY = DEV ADDR X03008* 10170000
@9C6     NI    OLTEPSW9,B'11111011'                               0353  10180000
         BC    15,@9C4                                            0354  10190000
*         ELSE                                                /*X03008* 10200000
*           MIXDEV='1'B;            /* SYMBOLIC ENTRY           X03008* 10210000
@9C5     OI    OLTEPSW9,B'00000100'                               0354  10220000
* CECIN13A:                         /* MORE ENTRIES DEV TABLE   X03008* 10230000
*         REMOTE='0'B;              /* NO REMOTE DEV DECODED YET. 21051 10240000
@9C4     EQU   *                                                  0355  10250000
CECIN13A NI    OLTEPSW7,B'11011111'                               0355  10260000
*  GEN;                                                                 10270000
CL31     IFDMOD CALL='31'               MODULE CALL               M4506 10280000
DLT31    IFDMOD DELETE='31'             DELETE IFDOLT31                 10290000
         DS    0H                                                       10300000
*         IF UNICTR=0|                                                  10310000
*           NDR='1'B THEN                                               10320000
         CLI   UNICTR,0                                           0357  10330000
         BC    08,@9C3                                            0357  10340000
         TM    OLTEPSW2,B'00000100'                               0357  10350000
         BC    12,@9C2                                            0357  10360000
*           GO TO CECINP14;                                             10370000
         BC    03,CECINP14                                        0358  10380000
*         GEN;                                                          10390000
@9C2     EQU   *                                                  0359  10400000
CL61     IFDMOD CALL='61'                                               10410000
DLT61    IFDMOD DELETE='61'             DELETE IFDOLT61                 10420000
         DS    0H                                                       10430000
*         IF RETTO31='1'B THEN     /* RETURN TO IFDOLT31,CONT DECODING* 10440000
         TM    OLTEPSW7,B'01000000'                               0360  10450000
*           GO TO CECIN13A;        /* DTO ENTRY & FILL DEV TABS.X03008* 10460000
         BC    01,CECIN13A                                        0361  10470000
* CECINP14:                                                             10480000
*         /************************************************************ 10490000
*         /*                                                          * 10500000
*         /*                      DECODE TEST SECTIONS                  10510000
*         /*                                                          * 10520000
*         /************************************************************ 10530000
*  GEN;                                                                 10540000
CECINP14 EQU   *                                                  0362  10550000
CL32     IFDMOD CALL='32'               MODULE CALL               M4506 10560000
DLT32    IFDMOD DELETE='32'             DELETE IFDOLT32                 10570000
         DS    0H                                                       10580000
*         IF RTNSLCTN='0'B & RTNFLD='1'B THEN DO; /* ROUTINES SELECTED* 10590000
         TM    SCT+33,B'00100000'                                 0363  10600000
         BC    05,@9C1                                            0363  10610000
         TM    OLTEPSW1,B'10000000'                               0363  10620000
         BC    12,@9C0                                            0363  10630000
*                                  /* IN IFDOLT32 BUT NOT DECODED YET?* 10640000
*                                        /*                     S20203* 10650000
*         /************************************************************ 10660000
*         /*                                                          * 10670000
*         /*                   DECODE TEST ROUTINES                   * 10680000
*         /*                                                          * 10690000
*         /************************************************************ 10700000
*  GEN;                                                                 10710000
CL38     IFDMOD CALL='38'               MODULE CALL               M4506 10720000
DLT38    IFDMOD DELETE='38'             DELETE IFDOLT38                 10730000
         DS    0H                                                       10740000
*         END;                           /*                     S20203* 10750000
* CECINP15:                                                             10760000
*         /************************************************************ 10770000
*         /*                                                          * 10780000
*         /*                     DECODE OPTIONS                       * 10790000
*         /*                                                          * 10800000
*         /************************************************************ 10810000
*  GEN;                                                                 10820000
@9C0     EQU   *                                                  0367  10830000
@9C1     EQU   *                                                  0367  10840000
CECINP15 EQU   *                                                  0367  10850000
CL33     IFDMOD CALL='33'               MODULE CALL               M4506 10860000
DLTE33   IFDMOD DELETE='33'             DELETE IFDOLT33                 10870000
         DS    0H                                                       10880000
*         /************************************************************ 10890000
*         /*                                                          * 10900000
*         /*                PERFORM DATA PROTECTION                   * 10910000
*         /*                                                          * 10920000
*         /************************************************************ 10930000
*         R15=ADDR(IFDOLT48);       /* GET ADDRESS OF IFDOLT48.       * 10940000
         L     @3,@V2              ADDRESS OF IFDOLT48            0368  10950000
         LR    @F,@3                                              0368  10960000
*         GEN(BALR  14,15);         /* GO TO DATA PROTECTION.         * 10970000
         BALR  14,15                                                    10980000
         DS    0H                                                       10990000
* CECINP16:                                                             11000000
*         /************************************************************ 11010000
*         /*                                                          * 11020000
*         /*                     FINISH ROUTINE                       * 11030000
*         /*                                                          * 11040000
*         /************************************************************ 11050000
*         IF FERINT='1'B&           /* SHOULD PROCESSING CONTINUE. */   11060000
*               ATM='1'B THEN       /* YES, START DECODING NEW ENTRY*/  11070000
CECINP16 TM    OLTEPSW,B'00000010'                                0370  11080000
         BC    12,@9BF                                            0370  11090000
         TM    OLTEPSW6,B'01000000'                               0370  11100000
*           GO TO CECINP10;                                             11110000
         BC    03,CECINP10                                        0371  11120000
*                                   /* NO, FINISH. */                   11130000
*         IF INPUTBUF(1)^=CAN THEN  /* IS CANCEL IN INPUT BUFFER.     * 11140000
@9BE     EQU   *                                                  0372  11150000
@9BF     CLC   INPUTBUF(1),CAN                                    0372  11160000
*           GO TO CECINP02;         /* NO, GET NEXT TEST DEFINITION.  * 11170000
         BC    07,CECINP02                                        0373  11180000
*         GEN(BAL   R8,CECINP06);   /* REWRITE TAPE LABELS AND CLEANUP* 11190000
         BAL   R8,CECINP06                                              11200000
         DS    0H                                                       11210000
* CECINP17:                                                             11220000
*         R15=0;                                                        11230000
CECINP17 SR    @F,@F                                              0375  11240000
*         R13=ADDR(SVAREA);                                             11250000
         L     @3,@A1              ADDRESS OF IFDOLT30            0376  11260000
         LA    @D,20(0,@3)                                        0376  11270000
*         RETURN;                                                       11280000
         BC    15,@EL01                                           0377  11290000
*  GEN;                                                                 11300000
CECPWTO  PWTO  REG=(1)                  ISSUE WTO                 M4506 11310000
         DS    0H                                                       11320000
*  GOTO R7;                              /* RESUME               M4506* 11330000
         BCR   15,@7                                              0379  11340000
*  GEN(DS     0H);                                                      11350000
         DS     0H                                                      11360000
         DS    0H                                                       11370000
*  GOTO FISTERR6;                        /* DYNAMIC ENTRY             * 11380000
         BC    15,FISTERR6                                        0381  11390000
* FISTERR:                                                              11400000
*         /************************************************************ 11410000
*         /*                                                          * 11420000
*         /*   DYNAMIC, FIRST-ERROR OR CATASTROPHIC COMMUNICATION     * 11430000
*         /*                                                          * 11440000
*         /************************************************************ 11450000
*         ENTRY;                                                        11460000
FISTERR  ST    @E,12(0,@D)                                        0382  11470000
         STM   @0,@C,20(@D)                                       0382  11480000
         BALR  @B,0                                               0382  11490000
         LA    @F,FISTERR-IFDOLT30-24                             0382  11500000
         SR    @B,@F                                              0382  11510000
         ST    @D,@SAV001+4                                       0382  11520000
         LA    @F,@SAV001                                         0382  11530000
         ST    @F,8(0,@D)                                         0382  11540000
         LR    @D,@F                                              0382  11550000
*         RESTRICT(1,2,5,6,8,9);                                        11560000
*         IF FERINT='1'B                 /* FIRST ERROR COMM     M4502* 11570000
*           | REMERR='1'B THEN           /* REMOTE ERROR         M4502* 11580000
@9BD     TM    OLTEPSW,B'00000010'                                0384  11590000
         BC    01,@9BC                                            0384  11600000
         TM    A00025,B'01000000'                                 0384  11610000
         BC    12,@9BB                                            0384  11620000
*               GOTO CECINP23;           /* DONT ZERO SWITCHES   M4502* 11630000
         BC    03,CECINP23                                        0385  11640000
*         EXECOUT='0'B;                  /* ZERO EXECOUT FLAG   S20203* 11650000
@9BB     NI    A00025,B'11111101'                                 0386  11660000
*         EXECANS='0'B;                  /* ZERO EXECANS FLG    S20203* 11670000
         NI    A00026,B'10111111'                                 0387  11680000
*  CECINP23:                             /*                      M4502* 11690000
*         REMERR='0'B;                   /* ZERO ERROR FLAG     S20203* 11700000
CECINP23 NI    A00025,B'10111111'                                 0388  11710000
*         IF UTCATAS='1'B THEN      /* IS IT CATASTROPHIC COMM. */      11720000
         TM    SCT+3,B'00100000'                                  0389  11730000
*           DO;                     /* YES, PRINT MESSAGE IFD157I */    11740000
*                                   /* AND FIND OUT WHAT USER WANTS*/   11750000
*                                   /* TO DO.                      */   11760000
*           GO TO CECINP03;                                             11770000
         BC    03,CECINP03                                        0391  11780000
*           END;                                                        11790000
*         FERINT='1'B;              /* INDICATE THIS IS DYNAMIC */      11800000
@9BA     OI    OLTEPSW,B'00000010'                                0393  11810000
*                                   /* COMMUNICATION.           */      11820000
*         GO TO CECINP03;                                               11830000
         BC    15,CECINP03                                        0394  11840000
* FISTERR6:                                                             11850000
*  GEN(BAL   R14,DLTE33+4);              /* DELETE IFDOLT33           * 11860000
FISTERR6 BAL   R14,DLTE33+4                                             11870000
         DS    0H                                                       11880000
*         RETURN;                   /* RETURN THROUGH DYNAMIC   */      11890000
*         END;                      /* COMMUNICATION SAVE AREA. */      11900000
@EL01    L     @D,4(0,@D)                                         0397  11910000
         L     @E,12(0,@D)                                        0397  11920000
         LM    @0,@C,20(@D)                                       0397  11930000
         BCR   15,@E                                              0397  11940000
@DATA1   EQU   *                                                        11950000
@0       EQU   00                  EQUATES FOR REGISTERS 0-15           11960000
@1       EQU   01                                                       11970000
@2       EQU   02                                                       11980000
@3       EQU   03                                                       11990000
@4       EQU   04                                                       12000000
@5       EQU   05                                                       12010000
@6       EQU   06                                                       12020000
@7       EQU   07                                                       12030000
@8       EQU   08                                                       12040000
@9       EQU   09                                                       12050000
@A       EQU   10                                                       12060000
@B       EQU   11                                                       12070000
@C       EQU   12                                                       12080000
@D       EQU   13                                                       12090000
@E       EQU   14                                                       12100000
@F       EQU   15                                                       12110000
@D1      DC    H'1'                                                     12120000
@D2      DC    H'3'                                                     12130000
@A1      DC    A(IFDOLT30)                                              12140000
@V2      DC    V(IFDOLT48)                                              12150000
         DS    0F                                                       12160000
@C1      DC    C'TCDSMDUM'                                              12170000
@C17     DC    C'CPUAFFN='                                              12180000
@X24     DC    X'00008014'                                              12190000
@X3      DC    X'0001'                                                  12200000
@C4      DC    C'00'                                                    12210000
@C16     DC    C'//'                                                    12220000
@C20     DC    C'PROMPT'                                                12230000
@C25     DC    C'.N'                                                    12240000
@C18     DC    C'EQU'                                                   12250000
@C19     DC    C'CAN'                                                   12260000
         DS    0D                                                       12270000
@DATA    EQU   *                                                        12280000
@SAV001  EQU   @DATA+00000000      72 BYTE(S) ON WORD                   12290000
R0       EQU   00000000            FULLWORD POINTER REGISTER            12300000
R1       EQU   00000001            FULLWORD POINTER REGISTER            12310000
R2       EQU   00000002            FULLWORD POINTER REGISTER            12320000
I        EQU   00000005            3  BYTE  POINTER REGISTER            12330000
R6       EQU   00000006            FULLWORD POINTER REGISTER            12340000
R7       EQU   00000007            FULLWORD POINTER REGISTER            12350000
R8       EQU   00000008            FULLWORD POINTER REGISTER            12360000
SLASHCNT EQU   00000009            3  BYTE  POINTER REGISTER            12370000
RETCODE  EQU   00000009            3  BYTE  POINTER REGISTER            12380000
R9       EQU   00000009            FULLWORD POINTER REGISTER            12390000
SA       EQU   00000013            FULLWORD POINTER REGISTER            12400000
R13      EQU   00000013            FULLWORD POINTER REGISTER            12410000
R14      EQU   00000014            FULLWORD POINTER REGISTER            12420000
R15      EQU   00000015            FULLWORD POINTER REGISTER            12430000
RC       EQU   00000015            3  BYTE  POINTER REGISTER            12440000
SAVE4    EQU   00000004            FULLWORD POINTER                     12450000
ECB      EQU   @DATA+00000072      FULLWORD INTEGER                     12460000
A00000   EQU   00000000            32 BYTE(S) ON WORD                   12470000
DVT      EQU   A00000+00000000     16 BYTE(S)                           12480000
DVTN     EQU   A00000+00000016     16 BYTE(S)                           12490000
         ORG   @DATA+00000076                                           12500000
STOPREI  EQU   *                   7 BYTE(S)                            12510000
         DC    C'STOPREI'                                               12520000
A00001   EQU   STOPREI+00000000    4 BYTE(S)                            12530000
REI      EQU   STOPREI+00000004    3 BYTE(S)                            12540000
FECSA    EQU   00000000            8 BYTE(S) ON WORD                    12550000
A00002   EQU   FECSA+00000000      4 BYTE(S)                            12560000
INTSAPTR EQU   FECSA+00000004      FULLWORD POINTER                     12570000
SVAREA   EQU   IFDOLT30+00000020   8 BYTE(S) ON WORD                    12580000
A00003   EQU   SVAREA+00000000     4 BYTE(S)                            12590000
SVR13    EQU   SVAREA+00000004     FULLWORD POINTER                     12600000
INITSA   EQU   00000000            12 BYTE(S) ON WORD                   12610000
A00004   EQU   INITSA+00000000     8 BYTE(S)                            12620000
SAVAREAD EQU   INITSA+00000008     FULLWORD POINTER                     12630000
A00005   EQU   00000000            6 BYTE(S) ON WORD                    12640000
B1ST     EQU   A00005+00000000     1 BYTE(S)                            12650000
TESTTYPE EQU   A00005+00000001     5 BYTE(S)                            12660000
B2ND     EQU   A00005+00000001     1 BYTE(S)                            12670000
CAN      EQU   *                   1 BYTE(S)                            12680000
         DC    X'FF'                                                    12690000
CANFLG   EQU   @DATA+00000084      1 BYTE(S)                            12700000
REPBUFLN EQU   00000000            1 BYTE(S)                            12710000
MSGPTR   EQU   00000000            136 BYTE(S) ON WORD                  12720000
MSGPTR00 EQU   MSGPTR+00000000     FULLWORD POINTER                     12730000
MSGPTR02 EQU   MSGPTR+00000004     FULLWORD POINTER                     12740000
MSGPTR03 EQU   MSGPTR+00000008     FULLWORD POINTER                     12750000
MSGPTR05 EQU   MSGPTR+00000012     FULLWORD POINTER                     12760000
MSGPTR06 EQU   MSGPTR+00000016     FULLWORD POINTER                     12770000
MSGPTR08 EQU   MSGPTR+00000020     FULLWORD POINTER                     12780000
MSGPTR17 EQU   MSGPTR+00000024     FULLWORD POINTER                     12790000
MSGPR166 EQU   MSGPTR+00000028     FULLWORD POINTER                     12800000
MSGPTR29 EQU   MSGPTR+00000032     FULLWORD POINTER                     12810000
MSGPTR34 EQU   MSGPTR+00000036     FULLWORD POINTER                     12820000
MSGPR501 EQU   MSGPTR+00000040     FULLWORD POINTER                     12830000
MSGPTR57 EQU   MSGPTR+00000044     FULLWORD POINTER                     12840000
MSGPTR58 EQU   MSGPTR+00000048     FULLWORD POINTER                     12850000
MSGPTR59 EQU   MSGPTR+00000052     FULLWORD POINTER                     12860000
MSGPTR60 EQU   MSGPTR+00000056     FULLWORD POINTER                     12870000
MSGPTR61 EQU   MSGPTR+00000060     FULLWORD POINTER                     12880000
A00006   EQU   MSGPTR+00000064     56 BYTE(S)                           12890000
MSGPTR66 EQU   MSGPTR+00000120     FULLWORD POINTER                     12900000
MSGPTR13 EQU   MSGPTR+00000124     FULLWORD POINTER                     12910000
MSGPTR99 EQU   MSGPTR+00000128     FULLWORD POINTER                     12920000
MSGPR260 EQU   MSGPTR+00000132     FULLWORD POINTER                     12930000
IFD100   EQU   00000000            84 BYTE(S) ON WORD                   12940000
A00007   EQU   IFD100+00000000     4 BYTE(S)                            12950000
IFD100I  EQU   IFD100+00000004     80 BYTE(S)                           12960000
A00008   EQU   00000000            67 BYTE(S) ON WORD                   12970000
A00009   EQU   A00008+00000000     65 BYTE(S)                           12980000
MSG899ID EQU   A00008+00000065     2 BYTE(S)                            12990000
MSSGE    EQU   00000000            44 BYTE(S) ON WORD                   13000000
A00010   EQU   MSSGE+00000000      4 BYTE(S)                            13010000
MESSAGE1 EQU   MSSGE+00000004      40 BYTE(S)                           13020000
SAVEBUF  EQU   @DATA+00000085      72 BYTE(S)                           13030000
         ORG   @DATA+00000157                                           13040000
TALK     EQU   *                   4 BYTE(S)                            13050000
         DC    C'TALK'                                                  13060000
PARMLIST EQU   @DATA+00000164      16 BYTE(S) ON WORD                   13070000
CDSNAME  EQU   PARMLIST+00000000   8 BYTE(S)                            13080000
LOADPT   EQU   PARMLIST+00000008   FULLWORD POINTER                     13090000
PFLAGS   EQU   PARMLIST+00000012   1 BYTE(S)                            13100000
A00037   EQU   PARMLIST+00000013   1 BYTE(S)                            13110000
CDSSIZE  EQU   PARMLIST+00000014   2 BYTE(S)                            13120000
         ENTRY FISTERR                                                  13130000
         ORG   @DATA                                                    13140000
         DS    00000180C                                                13150000
@TEMPS   DS    0F                                                       13160000
CNTRLREC DCB   DSORG=PS,BLKSIZE=80,DDNAME=CNTRLIN,DEVD=DA,             X13170000
               EODAD=CECINP18,LRECL=80,MACRF=(R),RECFM=F,NCP=1,        X13180000
               SYNAD=CECINP18                                  SA46803  13190000
SYMLIB   DCB   DDNAME=SYMSYM,DSORG=PO,RECFM=UT,BLKSIZE=3600,LRECL=80,  X13200000
               MACRF=R                                                  13210000
INPCOMM  IFDCOM                                                         13220000
SOSPRUN  EQU   SECLST+00000003     4 BYTE(S)                            13230000
CDSBLDL  EQU   SECLST+00000000     12 BYTE(S) ON WORD                   13240000
ENTRIES  EQU   CDSBLDL+00000000    HALFWORD INTEGER                     13250000
LENGTH   EQU   CDSBLDL+00000002    HALFWORD INTEGER                     13260000
NAME     EQU   CDSBLDL+00000004    8 BYTE(S)                            13270000
INPUTBUF EQU   INBUFR+00000000     72 BYTE(S)                           13280000
OFLAGS   EQU   CNTRLREC+00000048   8 BIT(S) ON BYTE                     13290000
OLTEPSW  EQU   CESWT+00000000      1 BYTE(S)                            13300000
LEGALTST EQU   OLTEPSW+00000000    1 BIT(S)                             13310000
A00011   EQU   OLTEPSW+00000000    3 BIT(S)                             13320000
LEGALDEV EQU   OLTEPSW+00000000    1 BIT(S)                             13330000
A00012   EQU   OLTEPSW+00000000    1 BIT(S)                             13340000
FERINT   EQU   OLTEPSW+00000000    1 BIT(S)                             13350000
OLTEPSW1 EQU   CESWT1+00000000     1 BYTE(S)                            13360000
RTNFLD   EQU   OLTEPSW1+00000000   1 BIT(S)                             13370000
OLTEPSW2 EQU   CESWT2+00000000     1 BYTE(S)                            13380000
NDCFO    EQU   OLTEPSW2+00000000   1 BIT(S)                             13390000
A00013   EQU   OLTEPSW2+00000000   3 BIT(S)                             13400000
INITENT  EQU   OLTEPSW2+00000000   1 BIT(S)                             13410000
NDR      EQU   OLTEPSW2+00000000   1 BIT(S)                             13420000
TAPEHDR  EQU   OLTEPSW2+00000000   1 BIT(S)                             13430000
OLTEPSW3 EQU   CESWT3+00000000     1 BYTE(S)                            13440000
TALKVERB EQU   OLTEPSW3+00000000   1 BIT(S)                             13450000
BYPALDEV EQU   OLTEPSW3+00000000   1 BIT(S)                             13460000
A00014   EQU   OLTEPSW3+00000000   2 BIT(S)                             13470000
SUSDEL   EQU   OLTEPSW3+00000000   1 BIT(S)                             13480000
A00015   EQU   OLTEPSW3+00000000   1 BIT(S)                             13490000
CDSEXIST EQU   OLTEPSW3+00000000   1 BIT(S)                             13500000
OLTEPSW5 EQU   CESWT5+00000000     1 BYTE(S)                            13510000
A00016   EQU   OLTEPSW5+00000000   3 BIT(S)                             13520000
DPRINTFL EQU   OLTEPSW5+00000000   2 BIT(S)                             13530000
A00017   EQU   OLTEPSW5+00000000   2 BIT(S)                             13540000
PRNTOPTN EQU   OLTEPSW5+00000000   1 BIT(S)                             13550000
OLTEPSW6 EQU   CESWT6+00000000     1 BYTE(S)                            13560000
UTSCAL   EQU   OLTEPSW6+00000000   1 BIT(S)                             13570000
ATM      EQU   OLTEPSW6+00000000   1 BIT(S)                             13580000
OLTEPSW7 EQU   CESWT7+00000000     1 BYTE(S)                            13590000
A00018   EQU   OLTEPSW7+00000000   1 BIT(S)                             13600000
RETTO31  EQU   OLTEPSW7+00000000   1 BIT(S)                             13610000
REMOTE   EQU   OLTEPSW7+00000000   1 BIT(S)                             13620000
A00019   EQU   OLTEPSW7+00000000   3 BIT(S)                             13630000
VIRTUAL  EQU   OLTEPSW7+00000000   1 BIT(S)                             13640000
GOTINPUT EQU   OLTEPSW7+00000000   1 BIT(S)                             13650000
OLTEPSW8 EQU   CESWT8+00000000     1 BYTE(S)                            13660000
A00020   EQU   OLTEPSW8+00000000   5 BIT(S)                             13670000
SUTMSG   EQU   OLTEPSW8+00000000   1 BIT(S)                             13680000
A00021   EQU   OLTEPSW8+00000000   1 BIT(S)                             13690000
TALKHERE EQU   OLTEPSW8+00000000   1 BIT(S)                             13700000
OLTEPSW9 EQU   CESWT9+00000000     1 BYTE(S)                            13710000
CDSEQU   EQU   OLTEPSW9+00000000   1 BIT(S)                             13720000
RESENTB  EQU   OLTEPSW9+00000000   1 BIT(S)                             13730000
A00022   EQU   OLTEPSW9+00000000   1 BIT(S)                             13740000
MODEV    EQU   OLTEPSW9+00000000   1 BIT(S)                             13750000
MODER    EQU   OLTEPSW9+00000000   1 BIT(S)                             13760000
MIXDEV   EQU   OLTEPSW9+00000000   1 BIT(S)                             13770000
A00023   EQU   OLTEPSW9+00000000   2 BIT(S)                             13780000
OLTPSW10 EQU   CESWT10+00000000    1 BYTE(S)                            13790000
MPSYS    EQU   OLTPSW10+00000000   1 BIT(S)                             13800000
AFFNSET  EQU   OLTPSW10+00000000   1 BIT(S)                             13810000
VERBCALL EQU   OLTPSW10+00000000   1 BIT(S)                             13820000
A00024   EQU   OLTPSW10+00000000   5 BIT(S)                             13830000
A00025   EQU   CESWTR+00000000     1 BYTE(S)                            13840000
RETAINAC EQU   A00025+00000000     1 BIT(S)                             13850000
REMERR   EQU   A00025+00000000     1 BIT(S)                             13860000
REMNOMSG EQU   A00025+00000000     1 BIT(S)                             13870000
CENOMSG  EQU   A00025+00000000     1 BIT(S)                             13880000
PRTNOMSG EQU   A00025+00000000     1 BIT(S)                             13890000
IMRESP   EQU   A00025+00000000     1 BIT(S)                             13900000
EXECOUT  EQU   A00025+00000000     1 BIT(S)                             13910000
CECOMOUT EQU   A00025+00000000     1 BIT(S)                             13920000
A00026   EQU   CESWTR1+00000000    1 BYTE(S)                            13930000
ILLRESP  EQU   A00026+00000000     1 BIT(S)                             13940000
EXECANS  EQU   A00026+00000000     1 BIT(S)                             13950000
CECOMANS EQU   A00026+00000000     1 BIT(S)                             13960000
INFOMSG  EQU   A00026+00000000     1 BIT(S)                             13970000
RETRIEVE EQU   A00026+00000000     1 BIT(S)                             13980000
REMANS   EQU   A00026+00000000     1 BIT(S)                             13990000
EDTOMSG  EQU   A00026+00000000     1 BIT(S)                             14000000
A00027   EQU   A00026+00000000     1 BIT(S)                             14010000
A00028   EQU   CESWTR2+00000000    1 BYTE(S)                            14020000
A00029   EQU   A00028+00000000     2 BIT(S)                             14030000
ONCOMM   EQU   A00028+00000000     1 BIT(S)                             14040000
A00030   EQU   A00028+00000000     5 BIT(S)                             14050000
SCT      EQU   CHASCT+00000000     70 BYTE(S) ON WORD                   14060000
A00031   EQU   SCT+00000000        3 BYTE(S)                            14070000
FLAGS    EQU   SCT+00000003        1 BYTE(S)                            14080000
SETERROR EQU   SCT+00000003        1 BIT(S)                             14090000
ASTERB   EQU   SCT+00000003        1 BIT(S)                             14100000
UTCATAS  EQU   SCT+00000003        1 BIT(S)                             14110000
RTNFLDXX EQU   SCT+00000004        2 BYTE(S)                            14120000
A00032   EQU   SCT+00000006        27 BYTE(S)                           14130000
EXPGMFLG EQU   SCT+00000033        1 BYTE(S)                            14140000
A00033   EQU   SCT+00000033        2 BIT(S)                             14150000
RTNSLCTN EQU   SCT+00000033        1 BIT(S)                             14160000
A00034   EQU   SCT+00000034        2 BYTE(S)                            14170000
OLTFLGS  EQU   SCT+00000036        1 BYTE(S)                            14180000
A00035   EQU   SCT+00000036        7 BIT(S)                             14190000
TALKOLT  EQU   SCT+00000036        1 BIT(S)                             14200000
OLTFLG2  EQU   SCT+00000037        1 BYTE(S)                            14210000
TALKCE   EQU   SCT+00000037        1 BIT(S)                             14220000
A00036   EQU   SCT+00000038        2 BYTE(S)                            14230000
EXPANDED EQU   SCT+00000040        30 BYTE(S)                           14240000
ROPTMIN2 EQU   ROPT-00000002       2 BYTE(S)                            14250000
REIDEBAD EQU   ROPT+00000008       FULLWORD POINTER                     14260000
@DATEND  EQU   *                                                        14270000
@9FE     EQU   CECINP17                                                 14280000
@9EA     EQU   CECINP07                                                 14290000
@9E9     EQU   CECINP4D                                                 14300000
@9DD     EQU   CECINP16                                                 14310000
@9CC     EQU   CECINP09                                                 14320000
@9C3     EQU   CECINP14                                                 14330000
@9BC     EQU   CECINP23                                                 14340000
         END    ,(C'PL/S',1400,77060)                                   14350000
