         TITLE 'IFDOLT44 DIO (HIO) HANDLER'                             00010000
         TITLE 'IFDOLT44 DIO (HALTIO) HANDLER'                          00020000
         LCLA  &T,&SPN                                            0002  00030000
.@001    ANOP                                                     0002  00040000
IFDOLT44 CSECT ,                                                  0002  00050000
         BC    15,24(0,@F)                                              00060000
         DC    C'IFDOLT44 23 JAN 74'                             0002  00070000
         ST    @E,12(0,@D)                                        0002  00080000
         STM   @0,@C,20(@D)                                       0002  00090000
         BALR  @B,0                                               0002  00100000
@PSTART  DS    0H                                                 0002  00110000
         USING @PSTART+00000,@B                                   0002  00120000
*         PURGE: GEN(EQU X'3B');         /* SVC59               YM5411* 00130000
PURGE    EQU X'3B'                                                      00140000
         DS    0H                                                       00150000
*         /* CONSTANT USED TO MAKE BINARY CHECKS                      * 00160000
*         DECLARE ON CHAR(1) INIT('01'X);                               00170000
*         /* CONSTANT  USED  TO  TEST  FOR  NO  OPERAND GIVEN         * 00180000
*         DCL ZERO FIXED(31) INIT('00000000'X);                         00190000
*         /* CONSTANT USED FOR ERROR RETURN CODE                      * 00200000
*         DCL FOUR FIXED(31) INIT('00000004'X);                         00210000
*         /* SVC 33 PARM                                        Y02008* 00220000
*         DCL XFF CHAR(1) INIT('FF'X);   /*                     Y02008* 00230000
*         /* SVC 16 PARM                                              * 00240000
*         DCL X00 CHAR(1) INIT('00'X);   /*                     Y02008* 00250000
*         DCL ONER FIXED(31) INIT('00000001'X);                         00260000
*    GENERATE DATA;                  /* PATCH AREA                    * 00270000
*         /* GET DSECT FOR COMMON  AREA                               * 00280000
*         GEN(EJECT);                                                   00290000
         EJECT                                                          00300000
         DS    0H                                                       00310000
**                                                                      00320000
**/******************************************************************** 00330000
**/*      COMMON AREA MAP                                             * 00340000
**/******************************************************************** 00350000
** DECLARE                                                              00360000
**  1 COMMAP BASED(COMMAPT) BDY(WORD),                                  00370000
**    3 CHASCT CHAR(92),                 /* SECTION CONTROL TABLE     * 00380000
**    3 DOLT00PT PTR(31),                /* INITIALIZATION MODULE     * 00390000
**    3 LGWRTCT CHAR(40),                /* LAST SCT WORDS            * 00400000
**    3 INBUFPTR PTR(31),                /* ADDR OF ITEM IN BUFFER    * 00410000
**    3 INBUFR CHAR(72),                 /* INPUT BUFFER              * 00420000
**    3 PRTBUFR CHAR(124),               /* PRINTING BUFFER           * 00430000
**    3 SECPTR PTR(31),                  /* ACTIVE SECTION ENTRY POINT* 00440000
**    3 UTENT PTR(31),                   /* 1ST UT INSTRUCTION        * 00450000
**    3 DATPTR PTR(31),                  /* PTR TO DP ROOT MODULE     * 00460000
**    3 DATIND CHAR(2),                  /* OLTEP DATA INDICATOR      * 00470000
**    3 PGMTAB CHAR(8),                  /* ACTIVE PGM ID             * 00480000
**    3 SECLST CHAR(138),                /* SECTION LIST              * 00490000
**    3 PCIEXIT PTR(31),                 /* PTR TO PCI EXIT           * 00500000
**    3 NORMEXIT PTR(31),                /* PTR TO NORMAL EXIT        * 00510000
**    3 ABNMEXIT PTR(31),                /* PTR TO ABNORMAL EXIT      * 00520000
**    3 DIEPTR PTR(31),                  /* PTR TO DISABLED INT HNDLR * 00530000
**    3 IOSCB CHAR(136),                 /* CTRL BLK SET FOR IOS      * 00540000
**      5 MODIOSB CHAR(108),             /* MODEL IOSB                * 00550000
**      5 MODUSECB CHAR(24),             /* MODEL USE CONTROL BLOCK   * 00560000
**      5 OECBWRD1 CHAR(4),              /* 1ST WORD OF OECB          * 00570000
**        7 OECBSNSC CHAR(1),            /* SENSE COUNT FOR THIS REQ  * 00580000
**        7 OECBINCT CHAR(1),            /* INTERRUPT COUNT FLD       * 00590000
**        7 OECBX CHAR(2),               /* NOT USED                  * 00600000
**    3 EFCTRCB CHAR(20) BDY(WORD),      /* IOEFFECTOR CNTRL BLOCK    * 00610000
**      5 CCWPTR PTR(31),                /* PTR TO CCW LIST           * 00620000
**      5 DVTPTR PTR(31),                /* PTR TO DEVTBLE ENTRY      * 00630000
**      5 FLGA CHAR(1),                  /* FLAGS:                    * 00640000
**        7 BYPASPFX BIT(1),             /*   BYPASS PREFIX           * 00650000
**        7 CEDEPOST BIT(1),             /*   CE DE SEPERATION        * 00660000
**        7 GDP BIT(1),                  /*   GUARANTEED DEV PATH     * 00670000
**        7 SPEXPOS BIT(1),              /*   SPECIFIC EXPOSURE       * 00680000
**        7 * BIT(1),                    /*   NOT USED                * 00690000
**        7 * BIT(1),                    /*   NOT USED                * 00700000
**        7 * BIT(1),                    /*   NOT USED                * 00710000
**        7 * BIT(1),                    /*   NOT USED                * 00720000
**      5 FLGB CHAR(1),                  /* FLAGS:                    * 00730000
**        7 INTIRNAL BIT(1),             /*   INTERNAL CALL BY DP ETC.* 00740000
**        7 ATTNIN BIT(1),               /*   ATTENTION FUNCTION      * 00750000
**        7 VIRTCCWS BIT(1),             /*   CCWS ARE VIRTUAL        * 00760000
**        7 OLDTECBX BIT(1),             /*   P3116 TECB              * 00770000
**        7 * BIT(1),                    /*   NOT USED                * 00780000
**        7 * BIT(1),                    /*   NOT USED                * 00790000
**        7 * BIT(1),                    /*   NOT USED                * 00800000
**        7 * BIT(1),                    /*   NOT USED                * 00810000
**      5 FILEMSK CHAR(1),               /*   FILEMASK OR MODE SET    * 00820000
**      5 SNSCNT CHAR(1),                /*   SENSE BYTE COUNT        * 00830000
**      5 TECBPTRX PTR(31),              /*   PTR TO TECB             * 00840000
**      5 SEEKPTR PTR(31),               /*   PTR TO SEEK ADDR        * 00850000
**    3 IOEFTRAD PTR(31),                /*   PTR TO IO EFFECTOR      * 00860000
**    3 IODEVTAB(3) CHAR(12) BDY(WORD),  /* IO DEVICE TABLES          * 00870000
**      5 IODEV1 PTR(31),                /*      PTR TO DEV TBLE NTRY * 00880000
**      5 IOSBPTR1 PTR(31),              /*      PTR TO IOSB          * 00890000
**      5 IOECB1 CHAR(4),                /*      ECB                  * 00900000
**        7 CMPLT CHAR(1),               /*                           * 00910000
**          9 WAITBIT BIT(1),            /* ECB WAITED ON             * 00920000
**          9 POSTBIT BIT(1),            /* ECB POSTED                * 00930000
**          9 CMPLCODE BIT(6),           /* SYSTEM COMPLETION CODE    * 00940000
**        7 * CHAR(1),                   /* NOT USED                  * 00950000
**        7 * CHAR(2),                   /*                           * 00960000
**          9 PSUDPOST BIT(1),           /* SET BY NAPA               * 00970000
**          9 * BIT(3),                  /* NOT USED                  * 00980000
**          9 WTCMPCD BIT(12),           /* SET BY WAITIO ON TMOUT    * 00990000
**    3 SELAFFN CHAR(2),                 /* SELECTED AFFN             * 01000000
**    3 CHARAFFN CHAR(2),                /* CHAR REP OF SEL AFFN      * 01010000
**    3 XXXXXXXX CHAR(144),              /* NOT USED                  * 01020000
**    3 DEVTBPTR PTR(31),                /* PTR TO DEVICE TABLES      * 01030000
**    3 TABLNGTH FIXED(15),              /* LENGTH OF EACH TABLE      * 01040000
**    3 CESWT9 CHAR(1),                  /* SWITCHES:                 * 01050000
**      5 CDSEQU BIT(1),                 /*   CDS EQUATE REQ          * 01060000
**      5 RESTBENT BIT(1),               /*   RESIDENT TBL ENTRY      * 01070000
**      5 VRCAP BIT(1),                  /*   VIRTUAL OR REAL OLT     * 01080000
**      5 *  BIT(4),                     /*   NOT USED                * 01090000
**    3 CESWT10 CHAR(1),                 /* SWITCHES OR FLAGS         * 01100000
**      5 MPSYS BIT(1),                  /* MP SYSTEM                 * 01110000
**      5 AFFNSET BIT(1),                /* AFFN SET                  * 01120000
**      5 VERBCALL BIT(1),               /* VERB SELECTED             * 01130000
**    3 OPEN2 PTR(31),                   /* NOT USED                  * 01140000
**    3 OPEN3 PTR(31),                   /* NOT USED                  * 01150000
**    3 PSCT PTR(31),                    /* PTR TO SCT                * 01160000
**    3 DEVDEPAD PTR(31),                /* ACTIVE SCT ENTRY PTR      * 01170000
**    3 TABAD PTR(31),                   /* UNIT TESTING TBLE PTR     * 01180000
**    3 UTCOMAD PTR(31),                 /* POINTER TO PASSON AREA    * 01190000
**    3 MCT CHAR(208) BDY(WORD),         /* MODULE CONTROL TABLE      * 01200000
**      5 * CHAR(164),                   /*                           * 01210000
**      5 PARPRADR PTR(31),              /* DPRINT MODULE ADDR        * 01220000
**      5 * CHAR(40),                    /*                           * 01230000
**    3 MCT1ADR PTR(31),                 /* PTR TO MCT                * 01240000
**    3 WKSVC CHAR(16) BDY(WORD),        /* SVC WORK AREA             * 01250000
**      5 * CHAR(4),                     /*                           * 01260000
**      5 ROPT PTR(31),                  /* SVC PARM LIST             * 01270000
**      5 * CHAR(8),                     /*                           * 01280000
**    3 OLTTAB CHAR(40) BDY(WORD),       /* LINK TABLE                * 01290000
**      5 * CHAR(28),                    /*                           * 01300000
**      5 TAB28 PTR(31),                 /* NEW MACRO ENTRY POINT     * 01310000
**      5 * CHAR(8),                     /*                           * 01320000
**    3 LOGADR PTR(31),                  /* PTR TO LOGSCAN MODULE     * 01330000
**    3 SCHEDSA PTR(31),                 /* PTR TO SCHEDULER SVAREA   * 01340000
**    3 SATAB CHAR(12),                  /* SYSTEM ASSIGNMENT TABLE   * 01350000
**    3 PLKMOR CHAR(16),                 /* PLINK AND MORECORE MNGMT  * 01360000
**    3 REGX PTR(31),                    /* ACTIVE UCB ADDR PTR       * 01370000
**    3 TUCBAD1 PTR(31),                 /* 1ST ACTIVE UCB ADDR       * 01380000
**    3 TUCBAD2 PTR(31),                 /* 2ND ACTIVE UCB ADDR       * 01390000
**    3 TSTDEBAD PTR(31),                /* TEST DEB ADDR             * 01400000
**    3 ECB3 CHAR(4),                    /* DYNAMIC COMMUNICATION ECB * 01410000
**    3 UTCOM CHAR(64),                  /* PASSON AREA               * 01420000
**    3 EXTBUF CHAR(56),                 /* EXTERNAL BUFFER           * 01430000
**    3 DPRDEBAD PTR(31),                /* PTR TO DPRINT DEB         * 01440000
**    3 PRIDVPTR PTR(31),                /* PTR TO ACTIVE PRIME DEVTAB* 01450000
**    3 SECDVPTR PTR(31),                /* PTR TO LAST GRAB DEVICE   * 01460000
**    3 REDEFINE PTR(31),                /* CE COMM ENTRY IN    Y02906* 01470000
**                                       /* IFDOLT30            Y02906* 01480000
**    3 COMMINT PTR(31),                 /* DYN COMM ENTRY IN   Y02906* 01490000
**                                       /* IFDOLT30            Y02906* 01500000
**    3 NEXTREC PTR(31),                 /* NEXT INPUT RECORD   Y02906* 01510000
**                                       /* ENTRY IN IFDOLT30   Y02906* 01520000
**    3 ADSVAREA PTR(31),                /* IFDOLT30 1ST SVAREA ADDR  * 01530000
**    3 ECB37 CHAR(4),                   /* CECOM ECB                 * 01540000
**    3 REPLY37 CHAR(72),                /* CECOM INPUT BUFFER        * 01550000
**    3 MSGAD37 PTR(31),                 /* OLTS BUFFER ADDR          * 01560000
**    3 TPSAVE CHAR(4),                  /* TEST ID                   * 01570000
**    3 TLCOUNT FIXED(15),               /* TEST LOOP COUNT           * 01580000
**    3 HRTSEL FIXED(15),                /* HIGHEST ROUTINE SELECTED  * 01590000
**    3 SAVECNT CHAR(2),                 /* COUNTER FOR DEVICE DELODE * 01600000
**    3 * CHAR(2),                       /* TEST LOOP RUN             * 01610000
**    3 SAVENT CHAR(4),                  /* LAST INCLUSIVE SERIES     * 01620000
**    3 CESWITCH CHAR(9),                /* OLTEP SWITCHES            * 01630000
**      5 CESWT CHAR(1),                 /* CE SWITCH                 * 01640000
**        7 LEGALTST BIT(1),             /* LEGAL TEST ENTRY          * 01650000
**        7 SECDEV BIT(1),               /* DO DP FOR SEC DEV         * 01660000
**        7 OUTS BIT(1),                 /* OLD OLT LOADED            * 01670000
**        7 NUTS BIT(1),                 /* NEW OLT LOADED            * 01680000
**        7 LEGALDEV BIT(1),             /* LEGAL DEVICE ENTRY        * 01690000
**        7 REINT BIT(1),                /* NEW D/T/O/ ENTRY          * 01700000
**        7 FERINT BIT(1),               /* COMMUNICATION INTERVAL    * 01710000
**        7 * BIT(1),                    /*                           * 01720000
**      5 CESWT1 CHAR(1),                /* SWITCH 1:                 * 01730000
**        7 RTNFLD BIT(1),               /* ROUTINES SELECTED         * 01740000
**        7 SKTST BIT(1),                /*                           * 01750000
**        7 * BIT(1),                    /*                           * 01760000
**        7 WAITFG BIT(1),               /* WAITIO NEEDED             * 01770000
**        7 FILMSK BIT(1),               /* ALLOW MODESET CHANGE      * 01780000
**        7 * BIT(1),                    /*                           * 01790000
**        7 ONLINEOK BIT(1),             /* ONLINE TESTING OK         * 01800000
**        7 TPFLAG BIT(1),               /* UNITS COUNTER GTR THEN 1  * 01810000
**      5 CESWT2 CHAR(1),                /* SWITCH 2:                 * 01820000
**        7 NDCFO BIT(1),                /* NO DYN COMM FOR OLTEP     * 01830000
**        7 * BIT(1),                    /*                           * 01840000
**        7 FECOND BIT(1),               /* FIRST ERROR CONDITION     * 01850000
**        7 * BIT(1),                    /*                           * 01860000
**        7 INITENT BIT(1),              /* OPTION ENTRY DECODED      * 01870000
**        7 NDR BIT(1),                  /* NDR ENTRY                 * 01880000
**        7 TAPEHDR BIT(1),              /* TAPE LABEL TO RESTORE     * 01890000
**        7 * BIT(1),                    /*                           * 01900000
**      5 CESWT3 CHAR(1),                /* SWITCH 3:                 * 01910000
**        7 TALKVERB BIT(1),             /* TALK REQUESTED            * 01920000
**        7 BYPALDEV BIT(1),             /* STOP SCHEDULING DEVICES   * 01930000
**        7 BYPDEV BIT(1),               /* STOP TESTING CURRENT DEV  * 01940000
**        7 GRBCNTL BIT(1),              /* GRAB MACRO ISSUED         * 01950000
**        7 SUSDEL BIT(1),               /* MODULE CAN BE DELETED     * 01960000
**        7 TP1419 BIT(1),               /* TP DEVICES IN SYSTEM      * 01970000
**        7 CDEXIST BIT(1),              /* CDS LIBRARY EXISTS        * 01980000
**        7 NODP BIT(1),                 /* CANT DO DATA PROJECT      * 01990000
**      5 CESWT4 CHAR(1),                /* SWITCH 4:                 * 02000000
**        7 RSTRFLG BIT(1),              /* PAGE RESTORE -BYPASS WTO  * 02010000
**        7 DPRFLG BIT(1),               /* USE DPRINT 2ND SVAREA     * 02020000
**        7 WAITFLG BIT(1),              /* BYPASS DPRINT INTRNL WAIT * 02030000
**        7 WRTFLG BIT(1),               /* DPRINT WRITE REQUEST      * 02040000
**        7 * BIT(1),                    /* NOT USED                  * 02050000
**        7 WTORFLG BIT(1),              /* DPRINT WTOR REQUEST       * 02060000
**        7 RPLYFLG BIT(1),              /* REPLY EXPECTED            * 02070000
**        7 WTOFLG BIT(1),               /* DPRINT WTO REQUEST        * 02080000
**      5 CESWT5 CHAR(1),                /* SWITCH 5:                 * 02090000
**        7 HDRFLG BIT(1),               /* PRINT HEADER LINE         * 02100000
**        7 RSLTFLG BIT(1),              /* PRINT RESULTS             * 02110000
**        7 FFEFLG BIT(1),               /* 1ST ERROR HAS OCCURRED    * 02120000
**        7 FCEFLG BIT(1),               /* 1ST CAT ERROR HAS OCCURRED* 02130000
**        7 PFEMSG BIT(1),               /* PRINT 1ST ERROR MSG       * 02140000
**        7 PCEMSG BIT(1),               /* PRINT CAT ERROR MSG       * 02150000
**        7 SYMBFLG BIT(1),              /* SYMBOLIC NAME IN HEADER   * 02160000
**        7 PRNTOPTN BIT(1),             /* PRINT PRIOR OPTIONS MSG   * 02170000
**      5 CESWT6 CHAR(1),                /* SWITCH 6:                 * 02180000
**        7 UTSCAL BIT(1),               /* UNIT TEST MACRO CALL      * 02190000
**        7 ATM BIT(1),                  /* PRINT * ON TERM MSG       * 02200000
**        7 EOFBIT BIT(1),               /* RESET INTERNAL SWITCHES   * 02210000
**        7 PFPMSG BIT(1),               /* PRINT FP MSG-CANCEL OLT   * 02220000
**        7 CODE5 BIT(1),                /* REPEAT TESTS              * 02230000
**        7 NORUN BIT(1),                /* DONT RUN SCHEDULED TEST   * 02240000
**        7 SECRUN BIT(1),               /* SCHEDULED TEST DONE       * 02250000
**        7 RTSTAE BIT(1),               /* ENTRY TO STAE             * 02260000
**      5 CESWT7 CHAR(1),                /* SWITCH 7:                 * 02270000
**        7 INCLST BIT(1),               /* INCLUSIVE DEVICE ENTRY    * 02280000
**        7 RETTO31 BIT(1),              /* NOT ALL DEVICES VALID     * 02290000
**       7 REMOTE BIT(1),                /* REMOTE TERM IN DEV ENTRY  * 02300000
**        7 * BIT(1),                    /* NOT USED                  * 02310000
**        7 * BIT(1),                    /* NOT USED                  * 02320000
**        7 * BIT(1),                    /* NOT USED                  * 02330000
**        7 VIRTUAL BIT(1),              /* RUNNING IN VIRTUAL        * 02340000
**        7 GOTINPUT BIT(1),             /* ENTRY TO D/T/O            * 02350000
**      5 CESWT8 CHAR(1),                /* SWITCH 8:                 * 02360000
**        7 LISTFIX BIT(1),              /* PARMLIST FIXED            * 02370000
**        7 * BIT(1),                    /* NOT USED                  * 02380000
**        7 * BIT(1),                    /* NOT USED                  * 02390000
**        7 READDCHK BIT(1),             /* READD ENTERED             * 02400000
**        7 OLTINVV BIT(1),              /* OLT IN VIRTUAL            * 02410000
**        7 SUTMSG BIT(1),               /* MSG 158I ISSUED           * 02420000
**        7 SNEWRUN BIT(1),              /* NEW TEST RUN              * 02430000
**        7 TALKHERE BIT(1),             /* TALK VERB ENTERED         * 02440000
**    3 DYNCOM CHAR(1),                  /* RESPONSE BUFFER DYN MSG   * 02450000
**    3 SECTUSE  CHAR(1),                /* NO. OF SECTIONS RUNYM03331* 02460000
**    3 UNICTR  CHAR(1),                 /* NO. OF UNITS TO RUNYM03331* 02470000
**    3 UNITUSE  CHAR(1),                /* NO.   OF UNITS RUN YM03331* 02480000
**    3 DPLEVEL CHAR(1),                 /* MSG PRINTING LEVEL        * 02490000
**    3 CNT37  CHAR(1),                  /* CECOM REPLY LENGTH YM03331* 02500000
**    3 READDSV CHAR(6),                 /* READD SVAREA              * 02510000
**    3 * CHAR(3),                       /* NOT USED                  * 02520000
**    3 READDMOD PTR(31),                /* PTR TO READD MODULE       * 02530000
**    3 RDCBPTR PTR(31),                 /* READD DCB PTRPTR -  Y02906* 02540000
**                                       /* DCB IN IFDOLT51     Y02906* 02550000
**    3 MSGMOD PTR(31),                  /* PTR TO RESIDENT MSG MODULE* 02560000
**    3 ENDJOB PTR(31),                  /* PTR TO INIT SVAREA        * 02570000
**    3 MHRPTR PTR(31),                  /*                           * 02580000
**    3 RTALKBUF PTR(31),                /* PTR TO TALK BUFFER- Y02906* 02590000
**                                       /* BUFFER IN IFDOLT55  Y02906* 02600000
**    3 RINBUF PTR(31),                  /* PTR TO REMOTE INBUFRY02906* 02610000
**                                       /* BUFR IN IFDOLT55    Y02906* 02620000
**    3 REIDCBPT PTR(31),                /* PTR TO REI DCB-     Y02906* 02630000
**                                       /* DCB IN IFDOLT55     Y02906* 02640000
**    3 REIOBPTR PTR(31),                /* PTR TO REI IOB-     Y02906* 02650000
**                                       /* IOB IN IFDOLT55     Y02906* 02660000
**    3 REIECB CHAR(4),                  /* REMOTE COMM ECB           * 02670000
**    3 TALKECB CHAR(4),                 /* ONSITE COMM ECB           * 02680000
**    3 RESPBUF PTR(31),                 /* PTR TO REPLY BUFR         * 02690000
**    3 REIUCB PTR(31),                  /* 2955 UCB ADDR             * 02700000
**    3 CESWTR CHAR(1),                  /* RETAIN SWITCHES:          * 02710000
**      5 RETAINAC BIT(1),               /* RETAIN ACTIVE             * 02720000
**      5 REMERR BIT(1),                 /* REMOTE ERROR              * 02730000
**      5 REMONMSG BIT(1),               /* DONT SEND TO REMOTE       * 02740000
**      5 CENOMSG BIT(1),                /* DONT SEND TO CONSOLE      * 02750000
**      5 TRANSMSG BIT(1),               /* TRANSLATE MSG             * 02760000
**      5 IMRESP BIT(1),                 /*  ATTACH 04 REPLY CODE     * 02770000
**      5 EXECOUT BIT(1),                /*  SCCEPT 00 REPLY CODE     * 02780000
**      5 * BIT(1),                      /*  NOT USED                 * 02790000
**    3 CESWTR1 CHAR(1),                 /*  REMOTE SWITCH1:          * 02800000
**      5 ILLRESP BIT(1),                /*  INVALID RESP BY REMOTE   * 02810000
**      5 EXECANS BIT(1),                /*  REMOTE REPLIED TO 104E   * 02820000
**      5 CECOMANS BIT(1),               /*  REMOTE REPLIED TO OUTSMSG* 02830000
**      5 INFOMSG BIT(1),                /*   3 MSG RCVD FROM REMOTE  * 02840000
**      5 RETRIEVE BIT(1),               /*  REIECB POSTED            * 02850000
**      5 REMANS BIT(1),                 /*  REMOTE CAN REPLY         * 02860000
**      5 EDOTMSG BIT(1),                /*  ATTACH 01 REPLY CODE     * 02870000
**      5 REIENTRY BIT(1),               /*  ENTRY FROM REI           * 02880000
**    3 CESWTR2 CHAR(1),                 /*  REMOTE SWITCH2:          * 02890000
**      5 REPLY00 BIT(1),                /*  ATTACH 00 REPLY CODE     * 02900000
**      5 * BIT(1),                      /*  NOT USED                 * 02910000
**      5 ONCOMM BIT(1),                 /*  ONSITE REPLIED           * 02920000
**      5 COMLOOP BIT(1),                /*  105D ISSUED - TALK REPLY * 02930000
**      5 WAIT BIT(1),                   /*  ISSUE WTOR               * 02940000
**      5 OPTERR BIT(1),                 /*  RE AND MI OPTIONS SELECT * 02950000
**      5 * BIT(1),                      /*  NOT USED                 * 02960000
**      5 DPMSGREI BIT(1),               /* REI REPLY NOT ALLOWED     * 02970000
**    3 CESWTR3 CHAR(1),                 /*  REMOTE SWITCH3           * 02980000
**    3 ZUESUCB FIXED(15),               /*  SPEC EXP BASE UCB ADDR   * 02990000
**    3 * CHAR(2),                       /*  NOT USED                 * 03000000
**    3 EXPAND1 CHAR(4),                 /* EXPANSION BYTES           * 03010000
**    3 SYMPTR PTR(31),                  /* SYMBOLIC LIB DCB PTRY02906* 03020000
**                                       /* DCB IN IFDOLT30     Y02906* 03030000
**    3 PGFXLIST CHAR(16),               /* PAGEFIX LIST              * 03040000
**    3 PARTITEM CHAR(12),               /* PARTITION ITEMS           * 03050000
**    3 PGFXOLT CHAR(8),                 /* OLT PAGEFIX LIST          * 03060000
**    3 CORERSLT CHAR(8),                /* GETMAIN CORE RESULTS      * 03070000
**    3 VRSIZE FIXED(31),                /* REAL CORE AREA SIZE       * 03080000
**    3 * CHAR(8),                       /* NOT USED                  * 03090000
**    3 NEXTMCT CHAR(208),               /* NEXT MCT                  * 03100000
**    3 THIRDMCT CHAR(208),              /* THIRD MCT                 * 03110000
**    3 DEVTAB CHAR(896);                /* START OF DEVICE TABLES    * 03120000
**                                                                      03130000
**/*************************************************************Y02906* 03140000
**/*                 DEVTAB                                     Y02906* 03150000
**/*      DEVICE TABLE ENTRY MAP FOR OLTEP                      Y02906* 03160000
**/*                                                            Y02906* 03170000
**/* OLTEP/VS2 RELEASE 2                                        Y02906* 03180000
**/*                                                            Y02906* 03190000
**/* METHOD OF ACCESS                                           Y02906* 03200000
**/*    BAL - DSECT NAMED 'DEVTAB' IS PRODUCED                  Y02906* 03210000
**/*          A 'USING' ON SYMBOL 'DEVTAB' GIVES ADDRESSABILITY Y02906* 03220000
**/*           FOR ALL SYMBOLS.                                 Y02906* 03230000
**/*                                                            Y02906* 03240000
**/*    PL/S -   DECLARE DEVTABPT PTR,  IS NECESSARY FOR ADDRESSY02906* 03250000
**/*              ABILITY                                       Y02906* 03260000
**/*                                                            Y02906* 03270000
**/*************************************************************Y02906* 03280000
**                                                                      03290000
** DECLARE                                                              03300000
**   1 DEVTABMP CHAR(56) BASED(DEVTABPT) BDY(WORD),                     03310000
**     3 DEVEBCAD CHAR(8),         /* EBCDIC DEVICE ADDRESS           * 03320000
**     3 DEVUCBAD PTR(31),         /* UCB POINTER FOR THIS DEVICE     * 03330000
**     3 DEVFLAG1 CHAR(1),         /* DEVICE FLAG BYTE 1              * 03340000
**       5 ONLINE BIT(1),          /* IF 1- DEVICE IS ONLINE          * 03350000
**       5 PRIMARY BIT(1),         /* IF 1- DEVICE IS PRIMARY         * 03360000
**       5 DPDONE BIT(1),          /* IF 1- DEVICE IS DATA PROTECTED  * 03370000
**       5 ACTIVE BIT(1),          /* IF 1- DEVICE IS ACTIVE          * 03380000
**       5 ALOCATED BIT(1),        /* IF 1- DEVICE IS ALOCATED        * 03390000
**       5 GRABED BIT(1),          /* IF 1- DEVICE IS GRABBED 2NDARY  * 03400000
**       5 FILEPRT BIT(1),         /* IF 1- DEVICE IS FILE PROTECTED  * 03410000
**       5 *        BIT(1),        /* UNUSED BIT                      * 03420000
**     3 DEVFLAG2 CHAR(1),         /* DEVICE FLAG BYTE 2              * 03430000
**       5 DSNAME BIT(1),          /* IF 0 AND ALOCATED=1-DATA SET    * 03440000
**                                 /*  NAME IS OSOLTEP1.              * 03450000
**                                 /* IF 1 AND ALOCATED=1-DATA SET    * 03460000
**                                 /*  NAME IS OSOLTEP2.              * 03470000
**       5 SHARED BIT(1),          /* IF 1-DEVICE IS SHARED           * 03480000
**       5 CEVOLUMN BIT(1),        /* IF 1-DASD   HAS A CE VOLUME ON  * 03490000
**       5 STANDLBL BIT(1),        /* IF 1-TAPE   HAS A STANDARD LABLE* 03500000
**       5 HIODONE BIT(1),         /* IF 1-HALT I/O DONE TO THIS DEV  * 03510000
**       5 EXIOLVL3 BIT(1),        /* IF 1-EXIO MACRO WAS A LEVEL 3   * 03520000
**       5 PCIIND BIT(1),          /* IF 1-A PCI INTERRUPT OCCURRED   * 03530000
**       5 *        BIT(1),        /* UNUSED                          * 03540000
**     3 DEVFLAG3 CHAR(1),         /* DEVICE FLAG BYTE 3              * 03550000
**       5 ANRNOTST BIT(1),        /*                                 * 03560000
**       5 *        BIT(1),        /* UNUSED                          * 03570000
**       5 *        BIT(1),        /* UNUSED                          * 03580000
**       5 TAPEBIT  BIT(1),        /* UNUSED                          * 03590000
**       5 NOTEST   BIT(1),        /* NOT TESTABLE                    * 03600000
**       5 DEVALC   BIT(1),        /* ALLOCATED                       * 03610000
**       5 WAITPOST BIT(1),        /* WAITIO IS POSTING               * 03620000
**       5 REISPEUD BIT(1),        /* REI PSEUDO DEV TAB              * 03630000
**     3 DEVFLAG4 CHAR(1),         /* DEVICE FLAG BYTE 4              * 03640000
**       5 DEVREMDA BIT(1),        /*                                 * 03650000
**       5 DEVREMEA BIT(1),        /*                                 * 03660000
**       5 RESERVD1 BIT(1),        /*                                 * 03670000
**       5 RESERVD2 BIT(1),        /* UNUSED                          * 03680000
**       5 *        BIT(1),        /* UNUSED                          * 03690000
**       5 *        BIT(1),        /* UNUSED                          * 03700000
**       5 *        BIT(1),        /* UNUSED                          * 03710000
**       5 *        BIT(1),        /* UNUSED                          * 03720000
**     3 DEVLOEXT CHAR(6),         /* LOW EXTENT FOR THIS DEVICE      * 03730000
**       5 LOEXTBB CHAR(2),        /* LOW EXTENT BB                   * 03740000
**       5 LOEXTCC CHAR(2),        /* LOW EXTENT CC                   * 03750000
**       5 LOEXTHH CHAR(2),        /* LOW EXTENT HH                   * 03760000
**     3 DEVHIEXT CHAR(6),         /* HIGH EXTENT FOR THIS DEVICE     * 03770000
**       5 HIEXTBB CHAR(2),        /* HIGH EXTENT BB                  * 03780000
**       5 HIEXTCC CHAR(2),        /* HIGH EXTENT CC                  * 03790000
**       5 HIEXTHH CHAR(2),        /* HIGH EXTENT BB                  * 03800000
**     3 TAPELABL CHAR(1),         /* DATA BYTE FOR TAPE LABEL SAVE   * 03810000
**     3 *        CHAR(1),         /* UNUSED                          * 03820000
**     3 DEVMODE CHAR(1),          /* MODE SET SAVE AREA FOR TAPE     * 03830000
**     3 DEVEXPOS CHAR(1),         /* EXPOSURE NUMBER FOR MULTI-EXPO- * 03840000
**                                 /*  SURE TYPE DEVICE-2305.         * 03850000
**     3 DEVHEXAD CHAR(4),         /* DEVICE ADDRESS IN HEX           * 03860000
**       5 DEVADPAD CHAR(2),       /* 2 BYTES PADDING                 * 03870000
**       5 DEVAD    CHAR(2),       /* 2 BYTE HEX DEVICE ADDRESS       * 03880000
**         7 *        BIT(4),      /* NOT APPLICABLE                  * 03890000
**         7 DEVCHANL BIT(4),      /* DEVICE CHANNEL ADDRESS          * 03900000
**         7 DEVCTRLU BIT(4),      /* DEVICE CONTROL UNIT ADDRESS     * 03910000
**         7 DEVADDR  BIT(4),      /* DEVICE ADDRESS                  * 03920000
**     3 DEVDESCR CHAR(4),         /* DEVICE DESCRIPTORS              * 03930000
**       5 DEVMODEL CHAR(1),       /* DEVICE MODEL NUMBER             * 03940000
**       5 DEVFEATR CHAR(1),       /* DEVICE FEATURES                 * 03950000
**       5 DEVCLASS CHAR(1),       /* DEVICE CLASS                    * 03960000
**       5 DEVUNTYP CHAR(1),       /* DEVICE UNIT TYPE                * 03970000
**     3 DEVCDSCT CHAR(1),         /* ACTUAL CDS INFORMATION BYTE CNT * 03980000
**     3 DEVCDSFG CHAR(2),         /* FLAG BYTES FROM CDS             * 03990000
**       5 CDSFLAG1 CHAR(1),       /* CDS FLAG BYTE 1                 * 04000000
**         7 CDSFILPT BIT(1),      /* RUN FILE PROTECT MODE IF 1      * 04010000
**         7 CDSSHRED BIT(1),      /* DEVICE IS SHARED IF 1           * 04020000
**         7 CDSCEMNT BIT(1),      /* CE VOLUME IS MOUNTED IF 1       * 04030000
**         7 CDSEXMSK BIT(1),      /* EXTERNAL SIGNAL MASK IN CDS BYTE* 04040000
**                                 /*  11 IF 1                        * 04050000
**         7 CDSYMBLC BIT(1),      /* SYMBOLIC NAME IN CDS BYTES 12-19* 04060000
**                                 /*  IF 1                           * 04070000
**         7 CDS2CHSW BIT(1),      /* 2 CHANNEL SWITCH ON THIS DEVICE * 04080000
**                                 /*  IF 1                           * 04090000
**         7 CDSREMDV BIT(1),      /* THIS CDS FOR A REMOTE DEVICE    * 04100000
**                                 /*  IF 1                           * 04110000
**         7 CDSLNCON BIT(1),      /* LINE CONNECTION REQUIRED FOR    * 04120000
**                                 /*  THIS DEVICE IF 1               * 04130000
**       5 CDSFLAG2 CHAR(1),       /* CDS FLAG BYTE 2                 * 04140000
**         7 CDSNOPRI BIT(1),      /* DON'T ASSIGN THIS DEVICE AS     * 04150000
**                                 /*  PRIMARY IF 1                   * 04160000
**         7 *        BIT(1),      /* UNDEFINED                       * 04170000
**         7 *        BIT(1),      /* UNDEFINED                       * 04180000
**         7 *        BIT(1),      /* UNDEFINED                       * 04190000
**         7 *        BIT(1),      /* UNDEFINED                       * 04200000
**         7 *        BIT(1),      /* UNDEFINED                       * 04210000
**         7 *        BIT(1),      /* UNDEFINED                       * 04220000
**         7 *        BIT(1),      /* UNDEFINED                       * 04230000
**     3 CDSEXTSG CHAR(1),         /* CDS EXTERNAL SIGNAL MASK IF FLAG* 04240000
**                                 /*  1 BIT 3 IS 1                   * 04250000
**     3 CDSYMNAM CHAR(8),         /* SYMBOLIC NAME FOR THIS DEVICE   * 04260000
**                                 /*  IF FLAG 1 BIT 4 IS ON          * 04270000
**     3 SAVMDMSK CHAR(1),         /* SAVED MODESET/FILEMASK          * 04280000
**     3 DEVINTPT CHAR(1),         /* COUNT OF INTERRUPTS POSTED IN   * 04290000
**                                 /*  OECB TO THIS POINT. USED TO    * 04300000
**                                 /*  SYNCHRONIZE WAITIO-POLL POSTING* 04310000
**                                 /*  AND NAPA-IFDOLT58              * 04320000
**     3 DEVEXPAN CHAR(2);         /* 3 CHAR FOR EXPANSION            * 04330000
*         /* GO TO NEXT PAGE                                          * 04340000
*         GEN (EJECT);                                                  04350000
         EJECT                                                          04360000
         DS    0H                                                       04370000
*         /* PARAMETER LISTING MAP                                    * 04380000
*         DECLARE 1 * BASED(LSTPTR),    /* PARM LIST FOLLOWS          * 04390000
*                  3 * CHAR(1),         /* FILL                       * 04400000
*                  3 DIOLVL CHAR(1),    /* MACRO LEVEL                * 04410000
*                  3 * CHAR(2),         /* MORE FILL                  * 04420000
*                  3 CDSADR PTR(31),    /* CDS POINTER                * 04430000
*                  3 TECBADR PTR(31),   /* EVENT BLOCK POINTER        * 04440000
*                  3 OPERANDS CHAR(1);  /* OPERATION REQUESTED        * 04450000
*    DCL 1 IOSB BASED(ROPT),            /* MAP FOR                    * 04460000
*          3 * CHAR(112),               /*   TECB ADDRESS             * 04470000
*          3 TECBPTR;                   /*     CHECK                  * 04480000
*    DCL 1 * BASED(DVADPTR),         /* CALLERS DEVICE        @YM03331* 04490000
*          3 HEXADCDS CHAR(4);       /* HEX ADDRESS           @YM03331* 04500000
*         /* GO TO NEXT PAGE                                          * 04510000
*         GEN (EJECT);                                                  04520000
         EJECT                                                          04530000
         DS    0H                                                       04540000
*         /*     SECTION CONTROL TABLE MAP                            * 04550000
*         DCL 1 * BASED(COMMAPT),        /* SCT MAP             Y02008* 04560000
*              3 * CHAR(12),             /* FILL                Y02008* 04570000
*              3 PDEVADR CHAR(4);        /* HEX PRIMARY DEV ADDRY02008* 04580000
*         GEN (EJECT);                                                  04590000
         EJECT                                                          04600000
         DS    0H                                                       04610000
*         /* GO AHEAD BIG BOY                                         * 04620000
*         DEVTABPT=DEVTBPTR;             /* GET DEV TAB PTR     Y02906* 04630000
         L     @6,856(0,@2)                                       0034  04640000
*         /* CHECK MACRO LEVEL                                        * 04650000
*         IF DIOLVL  =  MACLVL THEN     /* IS MACRO LEVEL LEGIT       * 04660000
         CLC   1(1,@1),MACLVL                                     0035  04670000
*         GO TO  OPTIONCK;              /*IF SO ,GO                   * 04680000
         BC    08,OPTIONCK                                        0036  04690000
*         /*  SET ERROR RETURN CODE                                   * 04700000
*         ERROUT:                       /* LEAVE  DIO  MODULE         * 04710000
*         R15  =  FOUR;                 /* TO CALLER                  * 04720000
ERROUT   L     @F,FOUR                                            0037  04730000
*         RETURN;                       /* EXIT                       * 04740000
         BC    15,@EL01                                           0038  04750000
*         /* CHECK OUT OPTIONS SUPPLIED BY CALLER                     * 04760000
*         OPTIONCK:                     /* LOOK AT OPTIONS            * 04770000
*         IF OPERANDS ^= ON THEN        /* IF ANYTHING OTHER THAN     * 04780000
OPTIONCK CLC   12(1,@1),ON                                        0039  04790000
*           GO TO ERROUT;               /* HIO SPECIFIED GO CAN REQST * 04800000
         BC    07,ERROUT                                          0040  04810000
*         /* INSURE TECB ADDRESS IS SUPPLIED                          * 04820000
*         TECBCHK:                      /* CHECK TECB ADDRESS         * 04830000
*         IF TECBADR  =  ZERO THEN      /* IF TECB ADDRESS WAS NOT    * 04840000
TECBCHK  L     @F,ZERO                                            0041  04850000
         C     @F,8(0,@1)                                         0041  04860000
*           GO TO ERROUT;               /* PACK HIM IN                * 04870000
         BC    08,ERROUT                                          0042  04880000
*            IF CDSADR = 0               /* IF NO CDS ADDRESS GIVEN,  * 04890000
*               THEN DO;                 /*   SEARCH            Y02008* 04900000
         SR    @F,@F                                              0043  04910000
         C     @F,4(0,@1)                                         0043  04920000
         BC    07,@9FF                                            0043  04930000
*                 DVADPTR = ADDR(PDEVADR);  /*  FOR             Y02008* 04940000
         LA    @4,12(0,@2)                                        0045  04950000
*                 GOTO DVTBSRCH;         /*  PRIMARY DEVICE     Y02008* 04960000
         BC    15,DVTBSRCH                                        0046  04970000
*              END;                      /*                     Y02008* 04980000
*              DVADPTR = CDSADR;         /* SEARCH FOR REQ'D DEVY02008* 04990000
@9FF     L     @4,4(0,@1)                                         0048  05000000
* DVTBSRCH:                              /*                     Y02008* 05010000
*         /* SEARCH DEVICE TABLE FOR A DEVICE MATCH                   * 05020000
*         DO WKREG1 = UNICTR TO ONE  BY -ONE;                           05030000
DVTBSRCH SR    @F,@F                                              0049  05040000
         IC    @F,1467(0,@2)                                      0049  05050000
         LR    @7,@F                                              0049  05060000
         BC    15,@DO9FD                                          0049  05070000
*         IF HEXADCDS=DEVHEXAD       /* IF MATCH              @YM03331* 05080000
*            THEN GOTO IOSBCK;           /*   GET IOSB PTR      Y02008* 05090000
@DO9FE   CLC   0(4,@4),32(@6)                                     0050  05100000
         BC    08,IOSBCK                                          0051  05110000
*         DEVTABPT=DEVTABPT+TABLNGTH;    /* GET NEXT DEV ENTRY  Y02906* 05120000
         AH    @6,860(0,@2)                                       0052  05130000
*         END;                          /* CONTINUE SCAN              * 05140000
*         /* GO TO ERROR EXITOR                                       * 05150000
*         GO TO ERROUT;                 /* PACK HIM IN                * 05160000
         SR    @0,@0                                              0053  05170000
         IC    @0,ONE                                             0053  05180000
         SR    @7,@0                                              0053  05190000
@DO9FD   SR    @0,@0                                              0053  05200000
         IC    @0,ONE                                             0053  05210000
         CR    @7,@0                                              0053  05220000
         BC    10,@DO9FE                                          0053  05230000
         BC    15,ERROUT                                          0054  05240000
* IOSBCK:                                /*                     Y02008* 05250000
*         /*     GET IOSB POINTER                               Y02008* 05260000
*         IF DEVTABPT=IODEV1(1)          /* SEARCH IO DEV TAB   Y02008* 05270000
*            THEN DO;                    /*   FOR IOSB PTR      Y02008* 05280000
IOSBCK   C     @6,672(0,@2)                                       0055  05290000
         BC    07,@9FA                                            0055  05300000
*               ROPT=IOSBPTR1(1);        /*     OF REQUESTED DEVY02008* 05310000
         MVC   1104(4,@2),676(@2)                                 0057  05320000
*               IF TECBADR=TECBPTR THEN  /* MAY NOT BE DP CALL        * 05330000
         L     @3,1104(0,@2)                                      0058  05340000
         L     @F,112(0,@3)                                       0058  05350000
         C     @F,8(0,@1)                                         0058  05360000
*                  GOTO CLASSCK;         /* IF DP, CHECK CLASS  Y02008* 05370000
         BC    08,CLASSCK                                         0059  05380000
*            END;                        /*                     Y02008* 05390000
*         IF DEVTABPT=IODEV1(2)          /*                     Y02008* 05400000
*            THEN DO;                    /*                     Y02008* 05410000
@9FA     C     @6,684(0,@2)                                       0061  05420000
         BC    07,@9F9                                            0061  05430000
*               ROPT=IOSBPTR1(2);        /*                     Y02008* 05440000
         MVC   1104(4,@2),688(@2)                                 0063  05450000
*               GOTO CLASSCK;            /*                     Y02008* 05460000
         BC    15,CLASSCK                                         0064  05470000
*            END;                        /*                     Y02008* 05480000
*         IF DEVTABPT=IODEV1(3)          /*                     Y02008* 05490000
*            THEN DO;                    /*                     Y02008* 05500000
@9F9     C     @6,696(0,@2)                                       0066  05510000
         BC    07,@9F8                                            0066  05520000
*               ROPT=IOSBPTR1(3);        /*                     Y02008* 05530000
         MVC   1104(4,@2),700(@2)                                 0068  05540000
*               GOTO CLASSCK;            /*                     Y02008* 05550000
*            END;                        /*                     Y02008* 05560000
*         GOTO ERROUT;                   /* ERROR               Y02008* 05570000
*         /* CHECK  CLASS OF REQUESTED  DEVICE                        * 05580000
*         CLASSCK:                      /* CK CLASS OF THIS DEVICE    * 05590000
*         IF ACTIVE='0'B THEN            /* IF NOTHING ACTIVE,  Y02906* 05600000
CLASSCK  TM    12(@6),B'00010000'                                 0072  05610000
*            GOTO CKOUT;                 /*  EXIT               Y02906* 05620000
         BC    08,CKOUT                                           0073  05630000
*         /*        ISSUE PURGE REQUEST                         Y02008* 05640000
*         R0=ADDR(ROPT);                 /* PARAMETER LIST PTR  Y02008* 05650000
         LA    @0,1104(0,@2)                                      0074  05660000
*         WKSVC(9) = XFF;                /* SVC33               Y02008* 05670000
         MVC   1108(1,@2),XFF                                     0075  05680000
*         IF DEVCLASS=TELCOMM |          /* IF                  Y02906* 05690000
*            DEVCLASS=TELCOMN |          /*  TP                 Y02906* 05700000
*            DEVCLASS=TELCONM  THEN      /*  DEVICE,            Y02906* 05710000
         CLC   38(1,@6),TELCOMM                                   0076  05720000
         BC    08,@9F7                                            0076  05730000
         CLC   38(1,@6),TELCOMN                                   0076  05740000
         BC    08,@9F6                                            0076  05750000
         CLC   38(1,@6),TELCONM                                   0076  05760000
         BC    07,@9F5                                            0076  05770000
*           GO TO SVC33;                /* GO ISSUE SVC33 FOR PURGE   * 05780000
         BC    08,SVC33                                           0077  05790000
*               WKSVC(9) = X00;          /* SVC 16              Y02008* 05800000
@9F5     MVC   1108(1,@2),X00                                     0078  05810000
* SVC33:                            /*                          Y02008* 05820000
*         LSTPTR=80;                     /* CALL CODE = X'50'   Y02008* 05830000
SVC33    LA    @1,80                                              0079  05840000
*         GEN(SVC PURGE);                /* SVC 59              Y02008* 05850000
         SVC PURGE                                                      05860000
         DS    0H                                                       05870000
*         CKOUT:                        /* EXIT THIS MODULE           * 05880000
*         ACTIVE='0'B;                   /* TURN OFF ACTIVE FLAGY02906* 05890000
CKOUT    NI    12(@6),B'11101111'                                 0081  05900000
*         HIODONE='1'B;                  /* TURN ON HIO DONE FLGY02906* 05910000
         OI    13(@6),B'00001000'                                 0082  05920000
*         R15  =  R15  &&  R15;         /* SET RETURN CODE            * 05930000
         XR    @F,@F                                              0083  05940000
*         END IFDOLT44                  /* EXIT THIS MODULE           * 05950000
* /* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.       05960000
* /*%INCLUDE SYSLIB  (IFDPF1  )                                         05970000
* /*%INCLUDE SYSLIB  (IFDEVTAB)                                         05980000
* ;                                                                     05990000
@EL01    L     @E,12(0,@D)                                        0084  06000000
         LM    @0,@C,20(@D)                                       0084  06010000
         BCR   15,@E                                              0084  06020000
@DATA1   EQU   *                                                        06030000
@0       EQU   00                  EQUATES FOR REGISTERS 0-15           06040000
@1       EQU   01                                                       06050000
@2       EQU   02                                                       06060000
@3       EQU   03                                                       06070000
@4       EQU   04                                                       06080000
@5       EQU   05                                                       06090000
@6       EQU   06                                                       06100000
@7       EQU   07                                                       06110000
@8       EQU   08                                                       06120000
@9       EQU   09                                                       06130000
@A       EQU   10                                                       06140000
@B       EQU   11                                                       06150000
@C       EQU   12                                                       06160000
@D       EQU   13                                                       06170000
@E       EQU   14                                                       06180000
@F       EQU   15                                                       06190000
         DS    0F                                                       06200000
         DS    0D                                                       06210000
@DATA    EQU   *                                                        06220000
LSTPTR   EQU   00000001            FULLWORD POINTER REGISTER            06230000
COMMAPT  EQU   00000002            FULLWORD POINTER REGISTER            06240000
DVADPTR  EQU   00000004            FULLWORD POINTER REGISTER            06250000
DEVTABPT EQU   00000006            FULLWORD POINTER REGISTER            06260000
WKREG1   EQU   00000007            FULLWORD POINTER REGISTER            06270000
R0       EQU   00000000            FULLWORD POINTER REGISTER            06280000
R15      EQU   00000015            FULLWORD POINTER REGISTER            06290000
MACLVL   EQU   *                   1 BYTE(S)                            06300000
         DC    X'02'                                                    06310000
ONE      EQU   *                   1 BYTE(S)                            06320000
         DC    X'01'                                                    06330000
TELCOMM  EQU   *                   1 BYTE(S)                            06340000
         DC    X'40'                                                    06350000
TELCONM  EQU   *                   1 BYTE(S)                            06360000
         DC    X'42'                                                    06370000
TELCOMN  EQU   *                   1 BYTE(S)                            06380000
         DC    X'10'                                                    06390000
ON       EQU   *                   1 BYTE(S)                            06400000
         DC    X'01'                                                    06410000
         ORG   @DATA+00000008                                           06420000
ZERO     EQU   *                   FULLWORD INTEGER                     06430000
         DC    XL4'00000000'                                            06440000
FOUR     EQU   *                   FULLWORD INTEGER                     06450000
         DC    XL4'00000004'                                            06460000
XFF      EQU   *                   1 BYTE(S)                            06470000
         DC    X'FF'                                                    06480000
X00      EQU   *                   1 BYTE(S)                            06490000
         DC    X'00'                                                    06500000
         ORG   @DATA+00000020                                           06510000
ONER     EQU   *                   FULLWORD INTEGER                     06520000
         DC    XL4'00000001'                                            06530000
COMMAP   EQU   00000000            2916 BYTE(S) ON WORD                 06540000
CHASCT   EQU   COMMAP+00000000     92 BYTE(S)                           06550000
DOLT00PT EQU   COMMAP+00000092     FULLWORD POINTER                     06560000
LGWRTCT  EQU   COMMAP+00000096     40 BYTE(S)                           06570000
INBUFPTR EQU   COMMAP+00000136     FULLWORD POINTER                     06580000
INBUFR   EQU   COMMAP+00000140     72 BYTE(S)                           06590000
PRTBUFR  EQU   COMMAP+00000212     124 BYTE(S)                          06600000
SECPTR   EQU   COMMAP+00000336     FULLWORD POINTER                     06610000
UTENT    EQU   COMMAP+00000340     FULLWORD POINTER                     06620000
DATPTR   EQU   COMMAP+00000344     FULLWORD POINTER                     06630000
DATIND   EQU   COMMAP+00000348     2 BYTE(S)                            06640000
PGMTAB   EQU   COMMAP+00000350     8 BYTE(S)                            06650000
SECLST   EQU   COMMAP+00000358     138 BYTE(S)                          06660000
PCIEXIT  EQU   COMMAP+00000496     FULLWORD POINTER                     06670000
NORMEXIT EQU   COMMAP+00000500     FULLWORD POINTER                     06680000
ABNMEXIT EQU   COMMAP+00000504     FULLWORD POINTER                     06690000
DIEPTR   EQU   COMMAP+00000508     FULLWORD POINTER                     06700000
IOSCB    EQU   COMMAP+00000512     136 BYTE(S)                          06710000
MODIOSB  EQU   COMMAP+00000512     108 BYTE(S)                          06720000
MODUSECB EQU   COMMAP+00000620     24 BYTE(S)                           06730000
OECBWRD1 EQU   COMMAP+00000644     4 BYTE(S)                            06740000
OECBSNSC EQU   COMMAP+00000644     1 BYTE(S)                            06750000
OECBINCT EQU   COMMAP+00000645     1 BYTE(S)                            06760000
OECBX    EQU   COMMAP+00000646     2 BYTE(S)                            06770000
EFCTRCB  EQU   COMMAP+00000648     20 BYTE(S) ON WORD                   06780000
CCWPTR   EQU   COMMAP+00000648     FULLWORD POINTER                     06790000
DVTPTR   EQU   COMMAP+00000652     FULLWORD POINTER                     06800000
FLGA     EQU   COMMAP+00000656     1 BYTE(S)                            06810000
BYPASPFX EQU   COMMAP+00000656     1 BIT(S)                             06820000
CEDEPOST EQU   COMMAP+00000656     1 BIT(S)                             06830000
GDP      EQU   COMMAP+00000656     1 BIT(S)                             06840000
SPEXPOS  EQU   COMMAP+00000656     1 BIT(S)                             06850000
A00000   EQU   COMMAP+00000656     1 BIT(S)                             06860000
A00001   EQU   COMMAP+00000656     1 BIT(S)                             06870000
A00002   EQU   COMMAP+00000656     1 BIT(S)                             06880000
A00003   EQU   COMMAP+00000656     1 BIT(S)                             06890000
FLGB     EQU   COMMAP+00000657     1 BYTE(S)                            06900000
INTIRNAL EQU   COMMAP+00000657     1 BIT(S)                             06910000
ATTNIN   EQU   COMMAP+00000657     1 BIT(S)                             06920000
VIRTCCWS EQU   COMMAP+00000657     1 BIT(S)                             06930000
OLDTECBX EQU   COMMAP+00000657     1 BIT(S)                             06940000
A00004   EQU   COMMAP+00000657     1 BIT(S)                             06950000
A00005   EQU   COMMAP+00000657     1 BIT(S)                             06960000
A00006   EQU   COMMAP+00000657     1 BIT(S)                             06970000
A00007   EQU   COMMAP+00000657     1 BIT(S)                             06980000
FILEMSK  EQU   COMMAP+00000658     1 BYTE(S)                            06990000
SNSCNT   EQU   COMMAP+00000659     1 BYTE(S)                            07000000
TECBPTRX EQU   COMMAP+00000660     FULLWORD POINTER                     07010000
SEEKPTR  EQU   COMMAP+00000664     FULLWORD POINTER                     07020000
IOEFTRAD EQU   COMMAP+00000668     FULLWORD POINTER                     07030000
IODEVTAB EQU   COMMAP+00000672     3*12 BYTE(S) ON WORD                 07040000
IODEV1   EQU   COMMAP+00000672     FULLWORD POINTER                     07050000
IOSBPTR1 EQU   COMMAP+00000676     FULLWORD POINTER                     07060000
IOECB1   EQU   COMMAP+00000680     4 BYTE(S)                            07070000
CMPLT    EQU   COMMAP+00000680     1 BYTE(S)                            07080000
WAITBIT  EQU   COMMAP+00000680     1 BIT(S)                             07090000
POSTBIT  EQU   COMMAP+00000680     1 BIT(S)                             07100000
CMPLCODE EQU   COMMAP+00000680     6 BIT(S)                             07110000
A00008   EQU   COMMAP+00000681     1 BYTE(S)                            07120000
A00009   EQU   COMMAP+00000682     2 BYTE(S)                            07130000
PSUDPOST EQU   COMMAP+00000682     1 BIT(S)                             07140000
A00010   EQU   COMMAP+00000682     3 BIT(S)                             07150000
WTCMPCD  EQU   COMMAP+00000682     12 BIT(S)                            07160000
SELAFFN  EQU   COMMAP+00000708     2 BYTE(S)                            07170000
CHARAFFN EQU   COMMAP+00000710     2 BYTE(S)                            07180000
XXXXXXXX EQU   COMMAP+00000712     144 BYTE(S)                          07190000
DEVTBPTR EQU   COMMAP+00000856     FULLWORD POINTER                     07200000
TABLNGTH EQU   COMMAP+00000860     HALFWORD INTEGER                     07210000
CESWT9   EQU   COMMAP+00000862     1 BYTE(S)                            07220000
CDSEQU   EQU   COMMAP+00000862     1 BIT(S)                             07230000
RESTBENT EQU   COMMAP+00000862     1 BIT(S)                             07240000
VRCAP    EQU   COMMAP+00000862     1 BIT(S)                             07250000
A00011   EQU   COMMAP+00000862     4 BIT(S)                             07260000
CESWT10  EQU   COMMAP+00000863     1 BYTE(S)                            07270000
MPSYS    EQU   COMMAP+00000863     1 BIT(S)                             07280000
AFFNSET  EQU   COMMAP+00000863     1 BIT(S)                             07290000
VERBCALL EQU   COMMAP+00000863     1 BIT(S)                             07300000
OPEN2    EQU   COMMAP+00000864     FULLWORD POINTER                     07310000
OPEN3    EQU   COMMAP+00000868     FULLWORD POINTER                     07320000
PSCT     EQU   COMMAP+00000872     FULLWORD POINTER                     07330000
DEVDEPAD EQU   COMMAP+00000876     FULLWORD POINTER                     07340000
TABAD    EQU   COMMAP+00000880     FULLWORD POINTER                     07350000
UTCOMAD  EQU   COMMAP+00000884     FULLWORD POINTER                     07360000
MCT      EQU   COMMAP+00000888     208 BYTE(S) ON WORD                  07370000
A00012   EQU   COMMAP+00000888     164 BYTE(S)                          07380000
PARPRADR EQU   COMMAP+00001052     FULLWORD POINTER                     07390000
A00013   EQU   COMMAP+00001056     40 BYTE(S)                           07400000
MCT1ADR  EQU   COMMAP+00001096     FULLWORD POINTER                     07410000
WKSVC    EQU   COMMAP+00001100     16 BYTE(S) ON WORD                   07420000
A00014   EQU   COMMAP+00001100     4 BYTE(S)                            07430000
ROPT     EQU   COMMAP+00001104     FULLWORD POINTER                     07440000
A00015   EQU   COMMAP+00001108     8 BYTE(S)                            07450000
OLTTAB   EQU   COMMAP+00001116     40 BYTE(S) ON WORD                   07460000
A00016   EQU   COMMAP+00001116     28 BYTE(S)                           07470000
TAB28    EQU   COMMAP+00001144     FULLWORD POINTER                     07480000
A00017   EQU   COMMAP+00001148     8 BYTE(S)                            07490000
LOGADR   EQU   COMMAP+00001156     FULLWORD POINTER                     07500000
SCHEDSA  EQU   COMMAP+00001160     FULLWORD POINTER                     07510000
SATAB    EQU   COMMAP+00001164     12 BYTE(S)                           07520000
PLKMOR   EQU   COMMAP+00001176     16 BYTE(S)                           07530000
REGX     EQU   COMMAP+00001192     FULLWORD POINTER                     07540000
TUCBAD1  EQU   COMMAP+00001196     FULLWORD POINTER                     07550000
TUCBAD2  EQU   COMMAP+00001200     FULLWORD POINTER                     07560000
TSTDEBAD EQU   COMMAP+00001204     FULLWORD POINTER                     07570000
ECB3     EQU   COMMAP+00001208     4 BYTE(S)                            07580000
UTCOM    EQU   COMMAP+00001212     64 BYTE(S)                           07590000
EXTBUF   EQU   COMMAP+00001276     56 BYTE(S)                           07600000
DPRDEBAD EQU   COMMAP+00001332     FULLWORD POINTER                     07610000
PRIDVPTR EQU   COMMAP+00001336     FULLWORD POINTER                     07620000
SECDVPTR EQU   COMMAP+00001340     FULLWORD POINTER                     07630000
REDEFINE EQU   COMMAP+00001344     FULLWORD POINTER                     07640000
COMMINT  EQU   COMMAP+00001348     FULLWORD POINTER                     07650000
NEXTREC  EQU   COMMAP+00001352     FULLWORD POINTER                     07660000
ADSVAREA EQU   COMMAP+00001356     FULLWORD POINTER                     07670000
ECB37    EQU   COMMAP+00001360     4 BYTE(S)                            07680000
REPLY37  EQU   COMMAP+00001364     72 BYTE(S)                           07690000
MSGAD37  EQU   COMMAP+00001436     FULLWORD POINTER                     07700000
TPSAVE   EQU   COMMAP+00001440     4 BYTE(S)                            07710000
TLCOUNT  EQU   COMMAP+00001444     HALFWORD INTEGER                     07720000
HRTSEL   EQU   COMMAP+00001446     HALFWORD INTEGER                     07730000
SAVECNT  EQU   COMMAP+00001448     2 BYTE(S)                            07740000
A00018   EQU   COMMAP+00001450     2 BYTE(S)                            07750000
SAVENT   EQU   COMMAP+00001452     4 BYTE(S)                            07760000
CESWITCH EQU   COMMAP+00001456     9 BYTE(S)                            07770000
CESWT    EQU   COMMAP+00001456     1 BYTE(S)                            07780000
LEGALTST EQU   COMMAP+00001456     1 BIT(S)                             07790000
SECDEV   EQU   COMMAP+00001456     1 BIT(S)                             07800000
OUTS     EQU   COMMAP+00001456     1 BIT(S)                             07810000
NUTS     EQU   COMMAP+00001456     1 BIT(S)                             07820000
LEGALDEV EQU   COMMAP+00001456     1 BIT(S)                             07830000
REINT    EQU   COMMAP+00001456     1 BIT(S)                             07840000
FERINT   EQU   COMMAP+00001456     1 BIT(S)                             07850000
A00019   EQU   COMMAP+00001456     1 BIT(S)                             07860000
CESWT1   EQU   COMMAP+00001457     1 BYTE(S)                            07870000
RTNFLD   EQU   COMMAP+00001457     1 BIT(S)                             07880000
SKTST    EQU   COMMAP+00001457     1 BIT(S)                             07890000
A00020   EQU   COMMAP+00001457     1 BIT(S)                             07900000
WAITFG   EQU   COMMAP+00001457     1 BIT(S)                             07910000
FILMSK   EQU   COMMAP+00001457     1 BIT(S)                             07920000
A00021   EQU   COMMAP+00001457     1 BIT(S)                             07930000
ONLINEOK EQU   COMMAP+00001457     1 BIT(S)                             07940000
TPFLAG   EQU   COMMAP+00001457     1 BIT(S)                             07950000
CESWT2   EQU   COMMAP+00001458     1 BYTE(S)                            07960000
NDCFO    EQU   COMMAP+00001458     1 BIT(S)                             07970000
A00022   EQU   COMMAP+00001458     1 BIT(S)                             07980000
FECOND   EQU   COMMAP+00001458     1 BIT(S)                             07990000
A00023   EQU   COMMAP+00001458     1 BIT(S)                             08000000
INITENT  EQU   COMMAP+00001458     1 BIT(S)                             08010000
NDR      EQU   COMMAP+00001458     1 BIT(S)                             08020000
TAPEHDR  EQU   COMMAP+00001458     1 BIT(S)                             08030000
A00024   EQU   COMMAP+00001458     1 BIT(S)                             08040000
CESWT3   EQU   COMMAP+00001459     1 BYTE(S)                            08050000
TALKVERB EQU   COMMAP+00001459     1 BIT(S)                             08060000
BYPALDEV EQU   COMMAP+00001459     1 BIT(S)                             08070000
BYPDEV   EQU   COMMAP+00001459     1 BIT(S)                             08080000
GRBCNTL  EQU   COMMAP+00001459     1 BIT(S)                             08090000
SUSDEL   EQU   COMMAP+00001459     1 BIT(S)                             08100000
TP1419   EQU   COMMAP+00001459     1 BIT(S)                             08110000
CDEXIST  EQU   COMMAP+00001459     1 BIT(S)                             08120000
NODP     EQU   COMMAP+00001459     1 BIT(S)                             08130000
CESWT4   EQU   COMMAP+00001460     1 BYTE(S)                            08140000
RSTRFLG  EQU   COMMAP+00001460     1 BIT(S)                             08150000
DPRFLG   EQU   COMMAP+00001460     1 BIT(S)                             08160000
WAITFLG  EQU   COMMAP+00001460     1 BIT(S)                             08170000
WRTFLG   EQU   COMMAP+00001460     1 BIT(S)                             08180000
A00025   EQU   COMMAP+00001460     1 BIT(S)                             08190000
WTORFLG  EQU   COMMAP+00001460     1 BIT(S)                             08200000
RPLYFLG  EQU   COMMAP+00001460     1 BIT(S)                             08210000
WTOFLG   EQU   COMMAP+00001460     1 BIT(S)                             08220000
CESWT5   EQU   COMMAP+00001461     1 BYTE(S)                            08230000
HDRFLG   EQU   COMMAP+00001461     1 BIT(S)                             08240000
RSLTFLG  EQU   COMMAP+00001461     1 BIT(S)                             08250000
FFEFLG   EQU   COMMAP+00001461     1 BIT(S)                             08260000
FCEFLG   EQU   COMMAP+00001461     1 BIT(S)                             08270000
PFEMSG   EQU   COMMAP+00001461     1 BIT(S)                             08280000
PCEMSG   EQU   COMMAP+00001461     1 BIT(S)                             08290000
SYMBFLG  EQU   COMMAP+00001461     1 BIT(S)                             08300000
PRNTOPTN EQU   COMMAP+00001461     1 BIT(S)                             08310000
CESWT6   EQU   COMMAP+00001462     1 BYTE(S)                            08320000
UTSCAL   EQU   COMMAP+00001462     1 BIT(S)                             08330000
ATM      EQU   COMMAP+00001462     1 BIT(S)                             08340000
EOFBIT   EQU   COMMAP+00001462     1 BIT(S)                             08350000
PFPMSG   EQU   COMMAP+00001462     1 BIT(S)                             08360000
CODE5    EQU   COMMAP+00001462     1 BIT(S)                             08370000
NORUN    EQU   COMMAP+00001462     1 BIT(S)                             08380000
SECRUN   EQU   COMMAP+00001462     1 BIT(S)                             08390000
RTSTAE   EQU   COMMAP+00001462     1 BIT(S)                             08400000
CESWT7   EQU   COMMAP+00001463     1 BYTE(S)                            08410000
INCLST   EQU   COMMAP+00001463     1 BIT(S)                             08420000
RETTO31  EQU   COMMAP+00001463     1 BIT(S)                             08430000
REMOTE   EQU   COMMAP+00001463     1 BIT(S)                             08440000
A00026   EQU   COMMAP+00001463     1 BIT(S)                             08450000
A00027   EQU   COMMAP+00001463     1 BIT(S)                             08460000
A00028   EQU   COMMAP+00001463     1 BIT(S)                             08470000
VIRTUAL  EQU   COMMAP+00001463     1 BIT(S)                             08480000
GOTINPUT EQU   COMMAP+00001463     1 BIT(S)                             08490000
CESWT8   EQU   COMMAP+00001464     1 BYTE(S)                            08500000
LISTFIX  EQU   COMMAP+00001464     1 BIT(S)                             08510000
A00029   EQU   COMMAP+00001464     1 BIT(S)                             08520000
A00030   EQU   COMMAP+00001464     1 BIT(S)                             08530000
READDCHK EQU   COMMAP+00001464     1 BIT(S)                             08540000
OLTINVV  EQU   COMMAP+00001464     1 BIT(S)                             08550000
SUTMSG   EQU   COMMAP+00001464     1 BIT(S)                             08560000
SNEWRUN  EQU   COMMAP+00001464     1 BIT(S)                             08570000
TALKHERE EQU   COMMAP+00001464     1 BIT(S)                             08580000
DYNCOM   EQU   COMMAP+00001465     1 BYTE(S)                            08590000
SECTUSE  EQU   COMMAP+00001466     1 BYTE(S)                            08600000
UNICTR   EQU   COMMAP+00001467     1 BYTE(S)                            08610000
UNITUSE  EQU   COMMAP+00001468     1 BYTE(S)                            08620000
DPLEVEL  EQU   COMMAP+00001469     1 BYTE(S)                            08630000
CNT37    EQU   COMMAP+00001470     1 BYTE(S)                            08640000
READDSV  EQU   COMMAP+00001471     6 BYTE(S)                            08650000
A00031   EQU   COMMAP+00001477     3 BYTE(S)                            08660000
READDMOD EQU   COMMAP+00001480     FULLWORD POINTER                     08670000
RDCBPTR  EQU   COMMAP+00001484     FULLWORD POINTER                     08680000
MSGMOD   EQU   COMMAP+00001488     FULLWORD POINTER                     08690000
ENDJOB   EQU   COMMAP+00001492     FULLWORD POINTER                     08700000
MHRPTR   EQU   COMMAP+00001496     FULLWORD POINTER                     08710000
RTALKBUF EQU   COMMAP+00001500     FULLWORD POINTER                     08720000
RINBUF   EQU   COMMAP+00001504     FULLWORD POINTER                     08730000
REIDCBPT EQU   COMMAP+00001508     FULLWORD POINTER                     08740000
REIOBPTR EQU   COMMAP+00001512     FULLWORD POINTER                     08750000
REIECB   EQU   COMMAP+00001516     4 BYTE(S)                            08760000
TALKECB  EQU   COMMAP+00001520     4 BYTE(S)                            08770000
RESPBUF  EQU   COMMAP+00001524     FULLWORD POINTER                     08780000
REIUCB   EQU   COMMAP+00001528     FULLWORD POINTER                     08790000
CESWTR   EQU   COMMAP+00001532     1 BYTE(S)                            08800000
RETAINAC EQU   COMMAP+00001532     1 BIT(S)                             08810000
REMERR   EQU   COMMAP+00001532     1 BIT(S)                             08820000
REMONMSG EQU   COMMAP+00001532     1 BIT(S)                             08830000
CENOMSG  EQU   COMMAP+00001532     1 BIT(S)                             08840000
TRANSMSG EQU   COMMAP+00001532     1 BIT(S)                             08850000
IMRESP   EQU   COMMAP+00001532     1 BIT(S)                             08860000
EXECOUT  EQU   COMMAP+00001532     1 BIT(S)                             08870000
A00032   EQU   COMMAP+00001532     1 BIT(S)                             08880000
CESWTR1  EQU   COMMAP+00001533     1 BYTE(S)                            08890000
ILLRESP  EQU   COMMAP+00001533     1 BIT(S)                             08900000
EXECANS  EQU   COMMAP+00001533     1 BIT(S)                             08910000
CECOMANS EQU   COMMAP+00001533     1 BIT(S)                             08920000
INFOMSG  EQU   COMMAP+00001533     1 BIT(S)                             08930000
RETRIEVE EQU   COMMAP+00001533     1 BIT(S)                             08940000
REMANS   EQU   COMMAP+00001533     1 BIT(S)                             08950000
EDOTMSG  EQU   COMMAP+00001533     1 BIT(S)                             08960000
REIENTRY EQU   COMMAP+00001533     1 BIT(S)                             08970000
CESWTR2  EQU   COMMAP+00001534     1 BYTE(S)                            08980000
REPLY00  EQU   COMMAP+00001534     1 BIT(S)                             08990000
A00033   EQU   COMMAP+00001534     1 BIT(S)                             09000000
ONCOMM   EQU   COMMAP+00001534     1 BIT(S)                             09010000
COMLOOP  EQU   COMMAP+00001534     1 BIT(S)                             09020000
WAIT     EQU   COMMAP+00001534     1 BIT(S)                             09030000
OPTERR   EQU   COMMAP+00001534     1 BIT(S)                             09040000
A00034   EQU   COMMAP+00001534     1 BIT(S)                             09050000
DPMSGREI EQU   COMMAP+00001534     1 BIT(S)                             09060000
CESWTR3  EQU   COMMAP+00001535     1 BYTE(S)                            09070000
ZUESUCB  EQU   COMMAP+00001536     HALFWORD INTEGER                     09080000
A00035   EQU   COMMAP+00001538     2 BYTE(S)                            09090000
EXPAND1  EQU   COMMAP+00001540     4 BYTE(S)                            09100000
SYMPTR   EQU   COMMAP+00001544     FULLWORD POINTER                     09110000
PGFXLIST EQU   COMMAP+00001548     16 BYTE(S)                           09120000
PARTITEM EQU   COMMAP+00001564     12 BYTE(S)                           09130000
PGFXOLT  EQU   COMMAP+00001576     8 BYTE(S)                            09140000
CORERSLT EQU   COMMAP+00001584     8 BYTE(S)                            09150000
VRSIZE   EQU   COMMAP+00001592     FULLWORD INTEGER                     09160000
A00036   EQU   COMMAP+00001596     8 BYTE(S)                            09170000
NEXTMCT  EQU   COMMAP+00001604     208 BYTE(S)                          09180000
THIRDMCT EQU   COMMAP+00001812     208 BYTE(S)                          09190000
DEVTAB   EQU   COMMAP+00002020     896 BYTE(S)                          09200000
DEVTABMP EQU   00000000            56 BYTE(S) ON WORD                   09210000
DEVEBCAD EQU   DEVTABMP+00000000   8 BYTE(S)                            09220000
DEVUCBAD EQU   DEVTABMP+00000008   FULLWORD POINTER                     09230000
DEVFLAG1 EQU   DEVTABMP+00000012   1 BYTE(S)                            09240000
ONLINE   EQU   DEVTABMP+00000012   1 BIT(S)                             09250000
PRIMARY  EQU   DEVTABMP+00000012   1 BIT(S)                             09260000
DPDONE   EQU   DEVTABMP+00000012   1 BIT(S)                             09270000
ACTIVE   EQU   DEVTABMP+00000012   1 BIT(S)                             09280000
ALOCATED EQU   DEVTABMP+00000012   1 BIT(S)                             09290000
GRABED   EQU   DEVTABMP+00000012   1 BIT(S)                             09300000
FILEPRT  EQU   DEVTABMP+00000012   1 BIT(S)                             09310000
A00037   EQU   DEVTABMP+00000012   1 BIT(S)                             09320000
DEVFLAG2 EQU   DEVTABMP+00000013   1 BYTE(S)                            09330000
DSNAME   EQU   DEVTABMP+00000013   1 BIT(S)                             09340000
SHARED   EQU   DEVTABMP+00000013   1 BIT(S)                             09350000
CEVOLUMN EQU   DEVTABMP+00000013   1 BIT(S)                             09360000
STANDLBL EQU   DEVTABMP+00000013   1 BIT(S)                             09370000
HIODONE  EQU   DEVTABMP+00000013   1 BIT(S)                             09380000
EXIOLVL3 EQU   DEVTABMP+00000013   1 BIT(S)                             09390000
PCIIND   EQU   DEVTABMP+00000013   1 BIT(S)                             09400000
A00038   EQU   DEVTABMP+00000013   1 BIT(S)                             09410000
DEVFLAG3 EQU   DEVTABMP+00000014   1 BYTE(S)                            09420000
ANRNOTST EQU   DEVTABMP+00000014   1 BIT(S)                             09430000
A00039   EQU   DEVTABMP+00000014   1 BIT(S)                             09440000
A00040   EQU   DEVTABMP+00000014   1 BIT(S)                             09450000
TAPEBIT  EQU   DEVTABMP+00000014   1 BIT(S)                             09460000
NOTEST   EQU   DEVTABMP+00000014   1 BIT(S)                             09470000
DEVALC   EQU   DEVTABMP+00000014   1 BIT(S)                             09480000
WAITPOST EQU   DEVTABMP+00000014   1 BIT(S)                             09490000
REISPEUD EQU   DEVTABMP+00000014   1 BIT(S)                             09500000
DEVFLAG4 EQU   DEVTABMP+00000015   1 BYTE(S)                            09510000
DEVREMDA EQU   DEVTABMP+00000015   1 BIT(S)                             09520000
DEVREMEA EQU   DEVTABMP+00000015   1 BIT(S)                             09530000
RESERVD1 EQU   DEVTABMP+00000015   1 BIT(S)                             09540000
RESERVD2 EQU   DEVTABMP+00000015   1 BIT(S)                             09550000
A00041   EQU   DEVTABMP+00000015   1 BIT(S)                             09560000
A00042   EQU   DEVTABMP+00000015   1 BIT(S)                             09570000
A00043   EQU   DEVTABMP+00000015   1 BIT(S)                             09580000
A00044   EQU   DEVTABMP+00000015   1 BIT(S)                             09590000
DEVLOEXT EQU   DEVTABMP+00000016   6 BYTE(S)                            09600000
LOEXTBB  EQU   DEVTABMP+00000016   2 BYTE(S)                            09610000
LOEXTCC  EQU   DEVTABMP+00000018   2 BYTE(S)                            09620000
LOEXTHH  EQU   DEVTABMP+00000020   2 BYTE(S)                            09630000
DEVHIEXT EQU   DEVTABMP+00000022   6 BYTE(S)                            09640000
HIEXTBB  EQU   DEVTABMP+00000022   2 BYTE(S)                            09650000
HIEXTCC  EQU   DEVTABMP+00000024   2 BYTE(S)                            09660000
HIEXTHH  EQU   DEVTABMP+00000026   2 BYTE(S)                            09670000
TAPELABL EQU   DEVTABMP+00000028   1 BYTE(S)                            09680000
A00045   EQU   DEVTABMP+00000029   1 BYTE(S)                            09690000
DEVMODE  EQU   DEVTABMP+00000030   1 BYTE(S)                            09700000
DEVEXPOS EQU   DEVTABMP+00000031   1 BYTE(S)                            09710000
DEVHEXAD EQU   DEVTABMP+00000032   4 BYTE(S)                            09720000
DEVADPAD EQU   DEVTABMP+00000032   2 BYTE(S)                            09730000
DEVAD    EQU   DEVTABMP+00000034   2 BYTE(S)                            09740000
A00046   EQU   DEVTABMP+00000034   4 BIT(S)                             09750000
DEVCHANL EQU   DEVTABMP+00000034   4 BIT(S)                             09760000
DEVCTRLU EQU   DEVTABMP+00000035   4 BIT(S)                             09770000
DEVADDR  EQU   DEVTABMP+00000035   4 BIT(S)                             09780000
DEVDESCR EQU   DEVTABMP+00000036   4 BYTE(S)                            09790000
DEVMODEL EQU   DEVTABMP+00000036   1 BYTE(S)                            09800000
DEVFEATR EQU   DEVTABMP+00000037   1 BYTE(S)                            09810000
DEVCLASS EQU   DEVTABMP+00000038   1 BYTE(S)                            09820000
DEVUNTYP EQU   DEVTABMP+00000039   1 BYTE(S)                            09830000
DEVCDSCT EQU   DEVTABMP+00000040   1 BYTE(S)                            09840000
DEVCDSFG EQU   DEVTABMP+00000041   2 BYTE(S)                            09850000
CDSFLAG1 EQU   DEVTABMP+00000041   1 BYTE(S)                            09860000
CDSFILPT EQU   DEVTABMP+00000041   1 BIT(S)                             09870000
CDSSHRED EQU   DEVTABMP+00000041   1 BIT(S)                             09880000
CDSCEMNT EQU   DEVTABMP+00000041   1 BIT(S)                             09890000
CDSEXMSK EQU   DEVTABMP+00000041   1 BIT(S)                             09900000
CDSYMBLC EQU   DEVTABMP+00000041   1 BIT(S)                             09910000
CDS2CHSW EQU   DEVTABMP+00000041   1 BIT(S)                             09920000
CDSREMDV EQU   DEVTABMP+00000041   1 BIT(S)                             09930000
CDSLNCON EQU   DEVTABMP+00000041   1 BIT(S)                             09940000
CDSFLAG2 EQU   DEVTABMP+00000042   1 BYTE(S)                            09950000
CDSNOPRI EQU   DEVTABMP+00000042   1 BIT(S)                             09960000
A00047   EQU   DEVTABMP+00000042   1 BIT(S)                             09970000
A00048   EQU   DEVTABMP+00000042   1 BIT(S)                             09980000
A00049   EQU   DEVTABMP+00000042   1 BIT(S)                             09990000
A00050   EQU   DEVTABMP+00000042   1 BIT(S)                             10000000
A00051   EQU   DEVTABMP+00000042   1 BIT(S)                             10010000
A00052   EQU   DEVTABMP+00000042   1 BIT(S)                             10020000
A00053   EQU   DEVTABMP+00000042   1 BIT(S)                             10030000
CDSEXTSG EQU   DEVTABMP+00000043   1 BYTE(S)                            10040000
CDSYMNAM EQU   DEVTABMP+00000044   8 BYTE(S)                            10050000
SAVMDMSK EQU   DEVTABMP+00000052   1 BYTE(S)                            10060000
DEVINTPT EQU   DEVTABMP+00000053   1 BYTE(S)                            10070000
DEVEXPAN EQU   DEVTABMP+00000054   2 BYTE(S)                            10080000
A00054   EQU   00000000            13 BYTE(S) ON WORD                   10090000
A00055   EQU   A00054+00000000     1 BYTE(S)                            10100000
DIOLVL   EQU   A00054+00000001     1 BYTE(S)                            10110000
A00056   EQU   A00054+00000002     2 BYTE(S)                            10120000
CDSADR   EQU   A00054+00000004     FULLWORD POINTER                     10130000
TECBADR  EQU   A00054+00000008     FULLWORD POINTER                     10140000
OPERANDS EQU   A00054+00000012     1 BYTE(S)                            10150000
IOSB     EQU   00000000            116 BYTE(S) ON WORD                  10160000
A00057   EQU   IOSB+00000000       112 BYTE(S)                          10170000
TECBPTR  EQU   IOSB+00000112       FULLWORD INTEGER                     10180000
A00058   EQU   00000000            4 BYTE(S) ON WORD                    10190000
HEXADCDS EQU   A00058+00000000     4 BYTE(S)                            10200000
A00059   EQU   00000000            16 BYTE(S) ON WORD                   10210000
A00060   EQU   A00059+00000000     12 BYTE(S)                           10220000
PDEVADR  EQU   A00059+00000012     4 BYTE(S)                            10230000
         ORG   @DATA                                                    10240000
         DS    00000024C                                                10250000
@TEMPS   DS    0F                                                       10260000
         IFDPATCH                                                       10270000
@DATEND  EQU   *                                                        10280000
@9F8     EQU   ERROUT                                                   10290000
@9F7     EQU   SVC33                                                    10300000
@9F6     EQU   SVC33                                                    10310000
         END   IFDOLT44                                                 10320000
