         TITLE '**********  ICKVA01:  OBTAIN VOLUME AUTHORIZATION  *****00001000
               *********'                                               00002000
        MACRO                                                           00003000
        GETMAIN &R,&LV=                                                 00004000
        L     REG15,0(REG1)           GDTTBL ADDRESS                    00005000
        L     REG15,GDTPRL(REG15)     PROL ROUTINE ADDRESS              00006000
        CNOP  2,4                     BOUNDARY ALIGNMENT                00007000
        LA    REG14,*+14              RETURN ADDRESS                    00008000
        BALR  REG1,REG15              LINKAGE TO PROL ROUTINE           00009000
        DC    A(MODID)                MODULE ID ADDRESS                 00010000
        DC    A(@SIZDATD)             AUTOMATIC STORAGE SIZE ADDRESS    00011000
        MEND                                                            00012000
ICKVA01  CSECT ,                                                   0002 00013000
@MAINENT DS    0H                                                  0002 00014000
         USING *,@15                                               0002 00015000
         B     @PROLOG                                             0002 00016000
         DC    AL1(16)                                             0002 00017000
         DC    C'ICKVA01   78.192'                                 0002 00018000
         DROP  @15                                                      00019000
@PROLOG  STM   @14,@12,12(@13)                                     0002 00020000
         BALR  @12,0                                               0002 00021000
@PSTART  DS    0H                                                  0002 00022000
         USING @PSTART,@12                                         0002 00023000
         L     @00,@SIZDATD                                        0002 00024000
         GETMAIN  R,LV=(0)                                              00025000
         LR    @11,@01                                             0002 00026000
         USING @DATD,@11                                           0002 00027000
         ST    @13,@SA00001+4                                      0002 00028000
         LM    @00,@01,20(@13)                                     0002 00029000
         ST    @11,8(,@13)                                         0002 00030000
         LR    @13,@11                                             0002 00031000
         XC    @ZTEMPS(@ZLEN),@ZTEMPS                                   00032000
         MVC   @PC00001(12),0(@01)                                 0002 00033000
*                                                                  0176 00034000
         EJECT                                                          00035000
*/*****  B E G I N    E X E C U T I O N  *****************************/ 00036000
*                                                                  0177 00037000
*    IF GDTDBG = NULLPTR                                           0177 00038000
*      THEN;                                                       0177 00039000
         L     @10,@PC00001                                        0177 00040000
         L     @10,GDTDBG(,@10)                                    0177 00041000
         LTR   @10,@10                                             0177 00042000
         BZ    @RT00177                                            0177 00043000
*      ELSE                                                        0179 00044000
*        CALL ICKDB010 (GDTTBL, 'VA00');                           0179 00045000
*                                                                  0179 00046000
*                                                                  0179 00047000
         L     @10,@PC00001                                        0179 00048000
         ST    @10,@AL00001                                        0179 00049000
         LA    @15,@CC00515                                        0179 00050000
         ST    @15,@AL00001+4                                      0179 00051000
         MVI   @AL00001+4,X'80'                                    0179 00052000
         L     @15,GDTDBG(,@10)                                    0179 00053000
         LA    @01,@AL00001                                        0179 00054000
         BALR  @14,@15                                             0179 00055000
*/*  ESTABLISH UPRINT ARGUMENT LIST                                  */ 00056000
*    PRTHDR = 'DARGLIST';                                          0180 00057000
@RT00177 MVC   PRTHDR(8),@CC00516                                  0180 00058000
*    DDSTRU = ADDR(PRTARGS);                                       0181 00059000
         LA    @10,PRTARGS                                         0181 00060000
         ST    @10,DDSTRU                                          0181 00061000
*    PRTARGS = ''B;                                                0182 00062000
         XC    PRTARGS(20),PRTARGS                                 0182 00063000
*    DARGSMOD = MSGMODZ;                                           0183 00064000
         MVC   DARGSMOD(3,@10),@CC00482                            0183 00065000
*/*  INDICATE SUCCESSFUL COMPLETION INITIALLY                        */ 00066000
*    CONDCODE = SUCCEEDS;                                          0184 00067000
         L     @10,@PC00001+8                                      0184 00068000
         SLR   @15,@15                                             0184 00069000
         ST    @15,CONDCODE(,@10)                                  0184 00070000
*/*  OBTAIN THE FLAG WHICH INDICATES IF VOLUME IS BEING PROCESSED    */ 00071000
*/*   OFF-LINE OR ON-LINE (UDEVINFO)                                 */ 00072000
*    CALL ICKDVIN0 (GDTTBL                                         0185 00073000
*             ,VOLIB                                               0185 00074000
*             ,VOLSTATE                                            0185 00075000
*             ,POOLID                                              0185 00076000
*             ,VLNPTR                                              0185 00077000
*             ,VLNLEN                                              0185 00078000
*             ,RETCODE);                                           0185 00079000
         L     @10,@PC00001                                        0185 00080000
         ST    @10,@AL00001                                        0185 00081000
         L     @15,@PC00001+4                                      0185 00082000
         ST    @15,@AL00001+4                                      0185 00083000
         LA    @15,@CF00040                                        0185 00084000
         ST    @15,@AL00001+8                                      0185 00085000
         LA    @15,POOLID                                          0185 00086000
         ST    @15,@AL00001+12                                     0185 00087000
         LA    @15,VLNPTR                                          0185 00088000
         ST    @15,@AL00001+16                                     0185 00089000
         LA    @15,VLNLEN                                          0185 00090000
         ST    @15,@AL00001+20                                     0185 00091000
         LA    @15,RETCODE                                         0185 00092000
         ST    @15,@AL00001+24                                     0185 00093000
         L     @15,GDTDIN(,@10)                                    0185 00094000
         LA    @01,@AL00001                                        0185 00095000
         BALR  @14,@15                                             0185 00096000
*/*  IF THE VOLUME IS BEING PROCESSED OFF-LINE                       */ 00097000
*    IF LINEFLAG = OFFLINE                                         0186 00098000
*/*    THEN                                                          */ 00099000
*      THEN DO;                                                    0186 00100000
*                                                                  0186 00101000
         L     @10,VLNPTR                                          0186 00102000
         TM    LINEFLAG(@10),B'10000000'                           0186 00103000
         BNZ   @RF00186                                            0186 00104000
*        REPLY = 'X';                                              0188 00105000
         MVI   REPLY,C'X'                                          0188 00106000
*/*      DO-WHILE PROPER REPLY IS NOT OBTAINED                       */ 00107000
*        DO WHILE (REPLY ^= 'T') & (REPLY ^= 'U');                 0189 00108000
*                                                                  0189 00109000
         B     @DE00189                                            0189 00110000
@DL00189 DS    0H                                                  0190 00111000
*/*        ISSUE MESSAGE TO ACQUIRE PERMISSION TO PROCESS VOLUME     */ 00112000
*/*         (UWTO)                                                   */ 00113000
*          CALL ICKDVIN0 (GDTTBL                                   0190 00114000
*                   ,VOLIB                                         0190 00115000
*                   ,VOLCUU                                        0190 00116000
*                   ,POOLID                                        0190 00117000
*                   ,VLNPTR                                        0190 00118000
*                   ,VLNLEN                                        0190 00119000
*                   ,RETCODE);                                     0190 00120000
         L     @10,@PC00001                                        0190 00121000
         ST    @10,@AL00001                                        0190 00122000
         L     @15,@PC00001+4                                      0190 00123000
         ST    @15,@AL00001+4                                      0190 00124000
         LA    @15,@CF00112                                        0190 00125000
         ST    @15,@AL00001+8                                      0190 00126000
         LA    @15,POOLID                                          0190 00127000
         ST    @15,@AL00001+12                                     0190 00128000
         LA    @15,VLNPTR                                          0190 00129000
         ST    @15,@AL00001+16                                     0190 00130000
         LA    @15,VLNLEN                                          0190 00131000
         ST    @15,@AL00001+20                                     0190 00132000
         LA    @15,RETCODE                                         0190 00133000
         ST    @15,@AL00001+24                                     0190 00134000
         L     @15,GDTDIN(,@10)                                    0190 00135000
         LA    @01,@AL00001                                        0190 00136000
         BALR  @14,@15                                             0190 00137000
*          PERMIT = PERMITM;                                       0191 00138000
         MVC   PERMIT(52),@CC00498                                 0191 00139000
*          PERMITB = DEVADDR;                                      0192 00140000
         MVI   PERMITB+3,C' '                                      0192 00141000
         L     @10,VLNPTR                                          0192 00142000
         MVC   PERMITB(3),DEVADDR(@10)                             0192 00143000
*          CALL ICKSAWO0  (GDTTBL                                  0193 00144000
*                ,PERMILEN                                         0193 00145000
*                ,ADDR (PERMIT)                                    0193 00146000
*                ,NOROUT                                           0193 00147000
*                ,NODESC                                           0193 00148000
*                ,REPLYLEN                                         0193 00149000
*                ,ADDR (REPLY));                                   0193 00150000
         MVC   @AL00001+4(20),@AL00193                             0193 00151000
         L     @10,@PC00001                                        0193 00152000
         ST    @10,@AL00001                                        0193 00153000
         LA    @15,PERMIT                                          0193 00154000
         ST    @15,@AFTEMPS                                        0193 00155000
         LA    @15,@AFTEMPS                                        0193 00156000
         ST    @15,@AL00001+8                                      0193 00157000
         LA    @15,REPLY                                           0193 00158000
         ST    @15,@AFTEMPS+4                                      0193 00159000
         LA    @15,@AFTEMPS+4                                      0193 00160000
         ST    @15,@AL00001+24                                     0193 00161000
         MVI   @AL00001+24,X'80'                                   0193 00162000
         L     @15,GDTWTO(,@10)                                    0193 00163000
         LA    @01,@AL00001                                        0193 00164000
         BALR  @14,@15                                             0193 00165000
*/*        IF PERMISSION NOT GRANTED                                 */ 00166000
*          IF REPLY = 'T'                                          0194 00167000
*/*          THEN                                                    */ 00168000
*            THEN DO;                                              0194 00169000
*                                                                  0194 00170000
         CLI   REPLY,C'T'                                          0194 00171000
         BNE   @RF00194                                            0194 00172000
*/*            ISSUE MESSAGE ABOUT TERMINATION (MSGTERM) (UPRINT)    */ 00173000
*              DARGSENT = MSGTERM;                                 0196 00174000
         L     @10,DDSTRU                                          0196 00175000
         MVI   DARGSENT(@10),X'31'                                 0196 00176000
*              CALL ICKTPPR0 (GDTTBL                               0197 00177000
*                     ,PRTFILE                                     0197 00178000
*                     ,DDSTRU);                                    0197 00179000
         L     @10,@PC00001                                        0197 00180000
         ST    @10,@AL00001                                        0197 00181000
         LA    @15,@CF00090                                        0197 00182000
         ST    @15,@AL00001+4                                      0197 00183000
         LA    @15,DDSTRU                                          0197 00184000
         ST    @15,@AL00001+8                                      0197 00185000
         MVI   @AL00001+8,X'80'                                    0197 00186000
         L     @15,GDTPRT(,@10)                                    0197 00187000
         LA    @01,@AL00001                                        0197 00188000
         BALR  @14,@15                                             0197 00189000
*/*            INDICATE UNSUCCESSFUL COMPLETION                      */ 00190000
*              CONDCODE = FAILS;                                   0198 00191000
         L     @10,@PC00001+8                                      0198 00192000
         MVC   CONDCODE(4,@10),@CF00161                            0198 00193000
*/*            END-THEN                                              */ 00194000
*              END;                                                0199 00195000
*/*      END-WHILE                                                   */ 00196000
*        END;                                                      0200 00197000
@RF00194 DS    0H                                                  0200 00198000
@DE00189 CLI   REPLY,C'T'                                          0200 00199000
         BE    @DC00189                                            0200 00200000
         CLI   REPLY,C'U'                                          0200 00201000
         BNE   @DL00189                                            0200 00202000
@DC00189 DS    0H                                                  0201 00203000
*/*      END-THEN (VOLUME BEING PROCESSED OFF-LINE)                  */ 00204000
*        END;                                                      0201 00205000
*/*  END-PROCEDURE OBTAIN_VOLUME_AUTHORIZATION                       */ 00206000
*    IF GDTDBG = NULLPTR                                           0202 00207000
*      THEN;                                                       0202 00208000
@RF00186 L     @10,@PC00001                                        0202 00209000
         L     @10,GDTDBG(,@10)                                    0202 00210000
         LTR   @10,@10                                             0202 00211000
         BZ    @RT00202                                            0202 00212000
*      ELSE                                                        0204 00213000
*        CALL ICKDB010 (GDTTBL                                     0204 00214000
*          ,'VA99');                                               0204 00215000
         L     @10,@PC00001                                        0204 00216000
         ST    @10,@AL00001                                        0204 00217000
         LA    @15,@CC00522                                        0204 00218000
         ST    @15,@AL00001+4                                      0204 00219000
         MVI   @AL00001+4,X'80'                                    0204 00220000
         L     @15,GDTDBG(,@10)                                    0204 00221000
         LA    @01,@AL00001                                        0204 00222000
         BALR  @14,@15                                             0204 00223000
*    CALL ICKSAFP0 (GDTTBL                                         0205 00224000
*           ,POOLID);                                              0205 00225000
@RT00202 L     @10,@PC00001                                        0205 00226000
         ST    @10,@AL00001                                        0205 00227000
         LA    @15,POOLID                                          0205 00228000
         ST    @15,@AL00001+4                                      0205 00229000
         MVI   @AL00001+4,X'80'                                    0205 00230000
         L     @15,GDTFPL(,@10)                                    0205 00231000
         LA    @01,@AL00001                                        0205 00232000
         BALR  @14,@15                                             0205 00233000
*    CALL ICKSAEP0(GDTTBL,MODID);                                  0206 00234000
*                                                                  0206 00235000
*                                                                  0206 00236000
         L     @10,@PC00001                                        0206 00237000
         ST    @10,@AL00001                                        0206 00238000
         LA    @15,MODID                                           0206 00239000
         ST    @15,@AL00001+4                                      0206 00240000
         MVI   @AL00001+4,X'80'                                    0206 00241000
         L     @15,GDTEPL(,@10)                                    0206 00242000
         LA    @01,@AL00001                                        0206 00243000
         BALR  @14,@15                                             0206 00244000
*    END ICKVA01                                                   0207 00245000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00246000
*/*%INCLUDE SYSLIB  (DMSDF01 )                                        * 00247000
*/*%INCLUDE SYSLIB  (DMSDF00 )                                        * 00248000
*/*@INCLUDE SYSLIB  (DMSDF02 )                                        * 00249000
*;                                                                 0207 00250000
@DATA    DS    0H                                                       00251000
         DS    0F                                                       00252000
@AL00193 DC    A(PERMILEN)             LIST WITH   5 ARGUMENT(S)        00253000
         DS    F                                                        00254000
         DC    A(NOROUT)                                                00255000
         DC    A(NODESC)                                                00256000
         DC    A(REPLYLEN)                                              00257000
@DATD    DSECT                                                          00258000
         DS    0F                                                       00259000
@SA00001 DS    18F                                                      00260000
@PC00001 DS    3F                                                       00261000
@AL00001 DS    7A                                                       00262000
@AFTEMPS DS    2F                                                       00263000
@ZTEMPS  DS    C                                                        00264000
@ZTEMPND EQU   *                                                        00265000
@ZLEN    EQU   @ZTEMPND-@ZTEMPS                                         00266000
ICKVA01  CSECT                                                          00267000
         DS    0F                                                       00268000
@CF00090 DC    F'0'                                                     00269000
@CF00161 DC    F'1'                                                     00270000
@CF00112 DC    F'2'                                                     00271000
@CF00040 DC    F'4'                                                     00272000
@DATD    DSECT                                                          00273000
         DS    0D                                                       00274000
LISTSCAN DS    A                                                        00275000
IOCSPTR  DS    A                                                        00276000
OPNPTR   DS    A                                                        00277000
DDSTRU   DS    A                                                        00278000
FSADDR   DS    A                                                        00279000
DMPINDEX DS    A                                                        00280000
VLNPTR   DS    A                                                        00281000
VLNLEN   DS    F                                                        00282000
RETCODE  DS    F                                                        00283000
I        DS    F                                                        00284000
LISTPTR  DS    A                                                        00285000
VOLTYPE  DS    F                                                        00286000
SETRC    DS    H                                                        00287000
TESTRC   DS    H                                                        00288000
LISTLN   DS    FL1                                                      00289000
         DS    CL3                                                      00290000
PRTSTR   DS    CL28                                                     00291000
         ORG   PRTSTR                                                   00292000
PRTHDR   DS    CL8                                                      00293000
PRTARGS  DS    CL20                                                     00294000
         ORG   PRTSTR+28                                                00295000
PERMIT   DS    CL52                                                     00296000
         ORG   PERMIT                                                   00297000
PERMITA  DS    CL32                                                     00298000
PERMITB  DS    CL4                                                      00299000
PERMITC  DS    CL16                                                     00300000
         ORG   PERMIT+52                                                00301000
REPLY    DS    CL1                                                      00302000
VOLNAME  DS    CL3                                                      00303000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00304000
@ENDDATD EQU   *                                                        00305000
ICKVA01  CSECT                                                          00306000
         DS    0F                                                       00307000
@SIZDATD DC    AL1(0)                                                   00308000
         DC    AL3(@ENDDATD-@DATD)                                      00309000
         DS    0D                                                       00310000
PERMILEN DC    AL2(52)                                                  00311000
NOROUT   DC    AL2(0)                                                   00312000
NODESC   DC    AL2(0)                                                   00313000
REPLYLEN DC    AL1(1)                                                   00314000
@CC00498 DC    C'ICK003D REPLY U TO PURGE VOLUME XXX CONTENTS, ELSE T'  00315000
@CC00516 DC    C'DARGLIST'                                              00316000
@CC00515 DC    C'VA00'                                                  00317000
@CC00522 DC    C'VA99'                                                  00318000
@CC00482 DC    C'EF0'                                                   00319000
MODID    DC    CL4'VA01'                                                00320000
POOLID   DC    CL4'VA01'                                                00321000
PTCHVA01 DS    CL256                                                    00322000
         ORG   PTCHVA01                                                 00323000
@NM00018 DC    256X'00'                                                 00324000
         ORG   PTCHVA01+256                                             00325000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00326000
@01      EQU   01                                                       00327000
@02      EQU   02                                                       00328000
@03      EQU   03                                                       00329000
@04      EQU   04                                                       00330000
@05      EQU   05                                                       00331000
@06      EQU   06                                                       00332000
@07      EQU   07                                                       00333000
@08      EQU   08                                                       00334000
@09      EQU   09                                                       00335000
@10      EQU   10                                                       00336000
@11      EQU   11                                                       00337000
@12      EQU   12                                                       00338000
@13      EQU   13                                                       00339000
@14      EQU   14                                                       00340000
@15      EQU   15                                                       00341000
REG12    EQU   @12                                                      00342000
REG0     EQU   @00                                                      00343000
REG1     EQU   @01                                                      00344000
REG10    EQU   @10                                                      00345000
REG11    EQU   @11                                                      00346000
REG13    EQU   @13                                                      00347000
REG14    EQU   @14                                                      00348000
REG15    EQU   @15                                                      00349000
REG2     EQU   @02                                                      00350000
REG3     EQU   @03                                                      00351000
REG4     EQU   @04                                                      00352000
REG5     EQU   @05                                                      00353000
REG6     EQU   @06                                                      00354000
REG7     EQU   @07                                                      00355000
REG8     EQU   @08                                                      00356000
REG9     EQU   @09                                                      00357000
RTNREG   EQU   @15                                                      00358000
ICKSAEP0 EQU   0                                                        00359000
ICKSAFP0 EQU   0                                                        00360000
ICKSAWO0 EQU   0                                                        00361000
TRACE1   EQU   0                                                        00362000
OLDERID1 EQU   TRACE1                                                   00363000
TRACE2   EQU   0                                                        00364000
STAEPARM EQU   0                                                        00365000
STAEPFX  EQU   STAEPARM                                                 00366000
IOCSTR   EQU   0                                                        00367000
IOCDSO   EQU   IOCSTR+13                                                00368000
IOCRFM   EQU   IOCSTR+14                                                00369000
IOCMAC   EQU   IOCSTR+15                                                00370000
IOCMSG   EQU   IOCSTR+16                                                00371000
OPNAGL   EQU   0                                                        00372000
OPNOPT   EQU   OPNAGL                                                   00373000
OPNRFM   EQU   OPNAGL+1                                                 00374000
OPNTYP   EQU   OPNAGL+2                                                 00375000
OPNMOD   EQU   OPNAGL+3                                                 00376000
UVOLLIST EQU   0                                                        00377000
UVOLENT  EQU   UVOLLIST+2                                               00378000
ICKDVIN0 EQU   0                                                        00379000
ICKTPPR0 EQU   0                                                        00380000
DARGLIST EQU   0                                                        00381000
DARGSTID EQU   DARGLIST+8                                               00382000
DARGSMOD EQU   DARGSTID                                                 00383000
DARGSENT EQU   DARGSTID+3                                               00384000
DARGARY  EQU   DARGLIST+20                                              00385000
DARGINS  EQU   DARGARY                                                  00386000
DARGINL  EQU   DARGARY+2                                                00387000
FMTLIST  EQU   0                                                        00388000
FMTFLGS  EQU   FMTLIST                                                  00389000
FMTSPF   EQU   FMTLIST+2                                                00390000
FMTRFNO  EQU   FMTSPF                                                   00391000
FMTILEN  EQU   FMTRFNO                                                  00392000
FMTIOFF  EQU   FMTLIST+4                                                00393000
FMTTRBC  EQU   FMTIOFF                                                  00394000
FMTSTO   EQU   FMTTRBC                                                  00395000
FMTOCOL  EQU   FMTLIST+6                                                00396000
FMTCNVF  EQU   FMTLIST+10                                               00397000
ICKDB010 EQU   0                                                        00398000
DMPITM   EQU   0                                                        00399000
DMPARY   EQU   0                                                        00400000
LINEFLAG EQU   0                                                        00401000
DEVADDR  EQU   0                                                        00402000
DMPTRM   EQU   0                                                        00403000
ICKDVCL0 EQU   0                                                        00404000
ICKDVON0 EQU   0                                                        00405000
ICKDVOP0 EQU   0                                                        00406000
ICKIOCL0 EQU   0                                                        00407000
ICKIOGT0 EQU   0                                                        00408000
ICKIOIT0 EQU   0                                                        00409000
ICKIOOP0 EQU   0                                                        00410000
ICKIOPT0 EQU   0                                                        00411000
ICKIOTM0 EQU   0                                                        00412000
ICKSACL0 EQU   0                                                        00413000
ICKSADE0 EQU   0                                                        00414000
ICKSAFS0 EQU   0                                                        00415000
ICKSAGP0 EQU   0                                                        00416000
ICKSAGS0 EQU   0                                                        00417000
ICKSALD0 EQU   0                                                        00418000
ICKSAPR0 EQU   0                                                        00419000
ICKSASC0 EQU   0                                                        00420000
ICKSASN0 EQU   0                                                        00421000
ICKSAST0 EQU   0                                                        00422000
ICKSATI0 EQU   0                                                        00423000
ICKSAVC0 EQU   0                                                        00424000
ICKTPEA0 EQU   0                                                        00425000
ICKTPES0 EQU   0                                                        00426000
ICKTPRE0 EQU   0                                                        00427000
ICKTPRS0 EQU   0                                                        00428000
LISTTEST EQU   0                                                        00429000
NEWERID1 EQU   5                                                        00430000
NEWERID2 EQU   5                                                        00431000
GDTTBL   EQU   0                                                        00432000
GDTTR1   EQU   GDTTBL+8                                                 00433000
GDTTR2   EQU   GDTTBL+12                                                00434000
GDTDIN   EQU   GDTTBL+44                                                00435000
GDTDOP   EQU   GDTTBL+48                                                00436000
GDTDBG   EQU   GDTTBL+52                                                00437000
GDTDVO   EQU   GDTTBL+56                                                00438000
GDTPRT   EQU   GDTTBL+60                                                00439000
GDTESS   EQU   GDTTBL+64                                                00440000
GDTESA   EQU   GDTTBL+68                                                00441000
GDTRST   EQU   GDTTBL+72                                                00442000
GDTRES   EQU   GDTTBL+76                                                00443000
GDTCAL   EQU   GDTTBL+80                                                00444000
GDTGSP   EQU   GDTTBL+84                                                00445000
GDTFSP   EQU   GDTTBL+88                                                00446000
GDTGPL   EQU   GDTTBL+92                                                00447000
GDTFPL   EQU   GDTTBL+96                                                00448000
GDTLOD   EQU   GDTTBL+100                                               00449000
GDTDEL   EQU   GDTTBL+104                                               00450000
GDTPRL   EQU   GDTTBL+108                                               00451000
GDTEPL   EQU   GDTTBL+112                                               00452000
GDTTIM   EQU   GDTTBL+116                                               00453000
GDTIIO   EQU   GDTTBL+120                                               00454000
GDTTIO   EQU   GDTTBL+124                                               00455000
GDTOPN   EQU   GDTTBL+136                                               00456000
GDTCLS   EQU   GDTTBL+140                                               00457000
GDTGET   EQU   GDTTBL+144                                               00458000
GDTPUT   EQU   GDTTBL+148                                               00459000
GDTSNP   EQU   GDTTBL+160                                               00460000
GDTWTO   EQU   GDTTBL+168                                               00461000
GDTSCR   EQU   GDTTBL+172                                               00462000
GDTVCK   EQU   GDTTBL+176                                               00463000
GDTDVC   EQU   GDTTBL+180                                               00464000
GDTSTE   EQU   GDTTBL+188                                               00465000
VOLIB    EQU   0                                                        00466000
CONDCODE EQU   0                                                        00467000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00468000
GDTCVR   EQU   GDTTBL+184                                               00469000
GDTSPR   EQU   GDTTBL+164                                               00470000
GDTABH   EQU   GDTTBL+156                                               00471000
GDTABT   EQU   GDTTBL+152                                               00472000
GDTTOH   EQU   GDTTBL+132                                               00473000
GDTRIP   EQU   GDTTBL+128                                               00474000
GDTDVH   EQU   GDTTBL+40                                                00475000
GDTIOH   EQU   GDTTBL+36                                                00476000
GDTSAH   EQU   GDTTBL+32                                                00477000
GDTTPH   EQU   GDTTBL+28                                                00478000
GDTRIH   EQU   GDTTBL+24                                                00479000
GDTSTH   EQU   GDTTBL+20                                                00480000
GDTDBH   EQU   GDTTBL+16                                                00481000
GDTPRM   EQU   GDTTBL+4                                                 00482000
GDTHDR   EQU   GDTTBL                                                   00483000
@NM00017 EQU   DMPARY+15                                                00484000
DMPARYTP EQU   DMPARY+14                                                00485000
DMPARYEX EQU   DMPARY+12                                                00486000
DMPARYIC EQU   DMPARY+10                                                00487000
DMPARYSZ EQU   DMPARY+8                                                 00488000
DMPARYNM EQU   DMPARY                                                   00489000
@NM00016 EQU   DMPITM+15                                                00490000
DMPITMTP EQU   DMPITM+14                                                00491000
DMPITMLN EQU   DMPITM+12                                                00492000
DMPITMPT EQU   DMPITM+8                                                 00493000
DMPITMNM EQU   DMPITM                                                   00494000
@NM00015 EQU   FMTCNVF+1                                                00495000
FMTBS    EQU   FMTCNVF+1                                                00496000
FMTSS    EQU   FMTCNVF+1                                                00497000
FMTAL    EQU   FMTCNVF+1                                                00498000
FMTZS    EQU   FMTCNVF+1                                                00499000
@NM00014 EQU   FMTCNVF                                                  00500000
FMTPU    EQU   FMTCNVF                                                  00501000
FMTBD    EQU   FMTCNVF                                                  00502000
FMTBHD   EQU   FMTCNVF                                                  00503000
FMTBHA   EQU   FMTCNVF                                                  00504000
FMTBH    EQU   FMTCNVF                                                  00505000
FMTOLEN  EQU   FMTLIST+8                                                00506000
FMTRIO   EQU   FMTOCOL                                                  00507000
FMTSPT   EQU   FMTSTO                                                   00508000
FMTSTL   EQU   FMTILEN                                                  00509000
@NM00013 EQU   FMTFLGS+1                                                00510000
FMTHDF   EQU   FMTFLGS                                                  00511000
FMTDFF   EQU   FMTFLGS                                                  00512000
FMTSTF   EQU   FMTFLGS                                                  00513000
FMTREPF  EQU   FMTFLGS                                                  00514000
FMTBDF   EQU   FMTFLGS                                                  00515000
FMTIDF   EQU   FMTFLGS                                                  00516000
FMTSCF   EQU   FMTFLGS                                                  00517000
FMTEOLF  EQU   FMTFLGS                                                  00518000
DARGDTM  EQU   DARGARY+4                                                00519000
DARGPCT  EQU   DARGINL                                                  00520000
DARGREP  EQU   DARGINS                                                  00521000
@NM00012 EQU   DARGLIST+19                                              00522000
DARGIND  EQU   DARGLIST+18                                              00523000
DARGRETL EQU   DARGLIST+16                                              00524000
DARGCNT  EQU   DARGLIST+14                                              00525000
DARGILP  EQU   DARGLIST+12                                              00526000
DARGRETP EQU   DARGLIST+4                                               00527000
DARGDBP  EQU   DARGLIST                                                 00528000
UVOLVOL  EQU   UVOLENT+4                                                00529000
UVOLDEV  EQU   UVOLENT                                                  00530000
UVOLCNT  EQU   UVOLLIST                                                 00531000
OPNRSVD  EQU   OPNAGL+28                                                00532000
OPNVOL   EQU   OPNAGL+24                                                00533000
OPNBLK   EQU   OPNAGL+20                                                00534000
OPNREC   EQU   OPNAGL+16                                                00535000
OPNDSN   EQU   OPNAGL+12                                                00536000
OPNDDN   EQU   OPNAGL+8                                                 00537000
OPNIOC   EQU   OPNAGL+4                                                 00538000
@NM00011 EQU   OPNMOD                                                   00539000
OPNMODRC EQU   OPNMOD                                                   00540000
OPNMODAC EQU   OPNMOD                                                   00541000
@NM00010 EQU   OPNTYP                                                   00542000
OPNTYPSO EQU   OPNTYP                                                   00543000
OPNTYPSI EQU   OPNTYP                                                   00544000
@NM00009 EQU   OPNRFM                                                   00545000
OPNRFMBK EQU   OPNRFM                                                   00546000
OPNRFMSF EQU   OPNRFM                                                   00547000
OPNRFMUN EQU   OPNRFM                                                   00548000
OPNRFMVR EQU   OPNRFM                                                   00549000
OPNRFMFX EQU   OPNRFM                                                   00550000
@NM00008 EQU   OPNOPT                                                   00551000
OPNOPTJM EQU   OPNOPT                                                   00552000
OPNOPTKS EQU   OPNOPT                                                   00553000
OPNOPTBK EQU   OPNOPT                                                   00554000
OPNOPTUP EQU   OPNOPT                                                   00555000
OPNOPTOT EQU   OPNOPT                                                   00556000
OPNOPTIN EQU   OPNOPT                                                   00557000
IOCEXT   EQU   IOCSTR+36                                                00558000
IOCRRN   EQU   IOCSTR+32                                                00559000
@NM00007 EQU   IOCSTR+30                                                00560000
IOCPNM   EQU   IOCSTR+28                                                00561000
IOCCBP   EQU   IOCSTR+24                                                00562000
IOCDSN   EQU   IOCSTR+20                                                00563000
@NM00006 EQU   IOCSTR+17                                                00564000
@NM00005 EQU   IOCMSG                                                   00565000
IOCMSGOP EQU   IOCMSG                                                   00566000
IOCMACPA EQU   IOCMAC                                                   00567000
@NM00004 EQU   IOCMAC                                                   00568000
IOCMACBK EQU   IOCMAC                                                   00569000
IOCMACUP EQU   IOCMAC                                                   00570000
IOCMACOT EQU   IOCMAC                                                   00571000
IOCMACIN EQU   IOCMAC                                                   00572000
@NM00003 EQU   IOCRFM                                                   00573000
IOCRFMBK EQU   IOCRFM                                                   00574000
IOCRFMSF EQU   IOCRFM                                                   00575000
IOCRFMUN EQU   IOCRFM                                                   00576000
IOCRFMVR EQU   IOCRFM                                                   00577000
IOCRFMFX EQU   IOCRFM                                                   00578000
@NM00002 EQU   IOCDSO                                                   00579000
IOCDSOPS EQU   IOCDSO                                                   00580000
IOCKYL   EQU   IOCSTR+12                                                00581000
IOCTRN   EQU   IOCSTR+8                                                 00582000
IOCDLN   EQU   IOCSTR+4                                                 00583000
IOCDAD   EQU   IOCSTR                                                   00584000
STAEWORK EQU   STAEPARM+32                                              00585000
STARPTR  EQU   STAEPFX+28                                               00586000
STASPTR  EQU   STAEPFX+24                                               00587000
STALEN   EQU   STAEPFX+20                                               00588000
STAID    EQU   STAEPFX+16                                               00589000
STAEPA   EQU   STAEPFX+12                                               00590000
STAGDT   EQU   STAEPFX+8                                                00591000
STABPTR  EQU   STAEPFX+4                                                00592000
STAFPTR  EQU   STAEPFX                                                  00593000
NEWID2   EQU   TRACE2+95                                                00594000
OLDERID2 EQU   TRACE2                                                   00595000
NEWID1   EQU   TRACE1+95                                                00596000
CALLID   EQU   OLDERID1+90                                              00597000
@NM00001 EQU   OLDERID1                                                 00598000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00599000
@ENDDATA EQU   *                                                        00600000
         END   ICKVA01,(C'PLS1819',0701,78192)                          00601000
