         TITLE ' IECVRSTI                                              *00001000
                        '                                               00002000
         TITLE 'IECVRSTI - BASIC ENTRY AND SETUP'                       00003000
IECVRSTI CSECT                                                          00004000
         ENTRY IECHK6                  DSS HOOK                         00005000
         ENTRY IECHK7                  DSS HOOK                         00006000
         ENTRY IORFRR                  FRR ENTRY               @YM05487 00007000
         ENTRY IECVRST1                LYLE TEST                        00008000
         BALR  @15,0               INITIAL BASE REG            @G552PLM 00009000
         BCTR  @15,0               BACK UP                     @G552PLM 00010000
         BCTR  @15,0                       TO ENTRY POINT      @G552PLM 00011000
         USING IECVRSTI,@15        USE R15 AS TEMP BASE        @G552PLM 00012000
         MODID                                                          00013000
         CLM   @01,8,LOSTCHAN      CALLED FOR LOST CHAN        @G552PLM 00014000
         BNE   DOSAVE              NO, WE ARE ALREADY DISABLD  @G552PLM 00015000
         LR    @02,@00             SRB IN AN ADDRESSABLE REG   @G552PLM 00016000
         STNSM 0(@02),X'FC'        STORE SYS MASK IN SRB       @G552PLM 00017000
         B     NOSAVE              NO SAVE AREA BYPASS SAVE    @G552PLM 00018000
LOSTCHAN DC    X'03000000'         IND LOSTCHAN CALLER         @G552PLM 00019000
DOSAVE   EQU   *                   TARGET IF NOT POS LOSTCHAN  @G552PLM 00020000
         STM   @14,@12,0(13)       SAVE REGISTERS              @G552PLM 00021000
NOSAVE   EQU   *                   TARGET IF POSSIBLE LOSTCHN  @G552PLM 00022000
         DROP  @15                 NO LONGER NEED R15 AS BASE  @G552PLM 00023000
         LR    @10,@15                 SET ADDRESSIBILITY               00024000
         USING IECVRSTI,@10                                             00025000
         LA     @02,4094(@10)           GET SECOND BASE        @OZ06051 00026000
         USING IECVRSTI+4094,@02                               @OZ06051 00027000
*   REG8=ZERO;                      /* ZERO PTR TO WORK AREA FOR FRR    00028000
*                                                            @YM05487*/ 00029000
         SLR   REG8,REG8                                           0269 00030000
*   REG11=ADDR(IORFRR);             /* FRR ADDR FOR FRR CALL         */ 00031000
         LA    REG11,IORFRR                                        0270 00032000
*   GEN CODE;                                                      0271 00033000
         SETFRR A,PARMAD=(@09),FRRAD=(@11),WRKREGS=(@03,@05)            00034000
*   RFY                                                            0272 00035000
*    (REG11) UNRSTD;                                               0272 00036000
*   RFY                                                            0273 00037000
*    (REG11,                                                       0273 00038000
*     REG13,                                                       0273 00039000
*     REG15) RSTD;                  /*                       @YM05487*/ 00040000
*   IF PSAIOSUP=ON1                 /* IF SUPER BIT ON WHEN ENTERRED    00041000
*                                                            @YM05487*/ 00042000
*     THEN                                                         0274 00043000
         TM    PSAIOSUP,B'10000000'                                0274 00044000
         BNO   @RF00274                                            0274 00045000
*     FRRIOSUP=OFF1;                /* I DID NOT TURN IT ON  @YM05487*/ 00046000
         NI    FRRIOSUP(REG9),B'01111111'                          0275 00047000
*   ELSE                                                           0276 00048000
*     DO;                           /* OTHERWISE             @YM05487*/ 00049000
         B     @RC00274                                            0276 00050000
@RF00274 DS    0H                                                  0277 00051000
*       FRRIOSUP=ON1;               /* INDICATE I TURNED IT ON     0277 00052000
*                                                            @YM05487*/ 00053000
         OI    FRRIOSUP(REG9),B'10000000'                          0277 00054000
*       PSAIOSUP=ON1;               /* TURN ON IOS SUPER BIT SO IOS     00055000
*                                      STORAGE MANAGER WILL NOT CAUSE   00056000
*                                      ENABLE                @YM05487*/ 00057000
         OI    PSAIOSUP,B'10000000'                                0278 00058000
*     END;                          /*                       @YM05487*/ 00059000
*   FRRSAV=REG13;                   /* SAVE SAVE AREA PTR            */ 00060000
@RC00274 ST    REG13,FRRSAV(,REG9)                                 0280 00061000
*   REG11=GET320;                   /* SET TO GET WORK AREA AND    0281 00062000
*                                      MESSAGE BUFFER                */ 00063000
         L     REG11,@CF03039                                      0281 00064000
*   REG13=WSACRSTI;                 /* GET IO RESTART SAVE           */ 00065000
         L     @14,PSALCCAV                                        0282 00066000
         L     @14,LCCACPUS(,@14)                                  0282 00067000
         L     REG13,WSACRSTI(,@14)                                0282 00068000
*   REG15=IOCORMGT;                 /* STORAGE MANAGER ENTRY         */ 00069000
         L     @06,CVTPTR                                          0283 00070000
         L     @06,CVTIXAVL(,@06)                                  0283 00071000
         L     REG15,IOCORMGT(,@06)                                0283 00072000
*   CALL SMGRGB;                    /* CALL STORAGE MANAGER FOR A 160   00073000
*                                      BYTE BLOCK                    */ 00074000
         BALR  @14,@15                                             0284 00075000
*   REG8=REG11;                     /* SET WORK AREA PTR             */ 00076000
         LR    REG8,REG11                                          0285 00077000
*   REG11=BLKCHAIN;                 /* PICK UP MESSBUF PTR           */ 00078000
         L     REG11,BLKCHAIN(,REG8)                               0286 00079000
*   RFY                                                            0287 00080000
*    (REG13) UNRSTD;                                               0287 00081000
*   RFY                                                            0288 00082000
*    (REG15) UNRSTD;                                               0288 00083000
*   IORWORK=IORWORK&&IORWORK;       /* ZERO THE WORK AREA            */ 00084000
         XC    IORWORK(120,REG8),IORWORK(REG8)                     0289 00085000
*   PWAPTR=PCCAPWAV;                /* ADDR OF PWA           @G552PLM*/ 00086000
         L     @06,PSAPCCAV                                        0290 00087000
         MVC   PWAPTR(4,REG8),PCCAPWAV(@06)                        0290 00088000
*   INPARM=REG1;                    /* SET PARM INDICATOR            */ 00089000
         ST    REG1,INPARM(,REG8)                                  0291 00090000
*   MESSPTR=REG11;                  /* SET MESSAGE BUF PTR           */ 00091000
         ST    REG11,MESSPTR(,REG8)                                0292 00092000
*   REG11->MSGENT=ONE;              /* SET INITIAL MESSAGE COUNT     */ 00093000
         MVC   MSGENT(2,REG11),@CH00039                            0293 00094000
*   REG11->MESSBUF=REG11->MESSBUF&&REG11->MESSBUF;/* CLEAR THE MSG 0294 00095000
*                                      BUFFER INDEX VALUE            */ 00096000
         XC    MESSBUF(152,REG11),MESSBUF(REG11)                   0294 00097000
*   IORSIOCM=CVTIXAVL;              /* IOCOM ADDR TO WORK            */ 00098000
         L     @06,CVTPTR                                          0295 00099000
         MVC   IORSIOCM(4,REG8),CVTIXAVL(@06)                      0295 00100000
*   RFY                                                            0296 00101000
*     IOCOM BASED(IORSIOCM);                                       0296 00102000
*   FRRIORWA=REG8;                  /* SAVE WORK AREA PTR    @G552PLM*/ 00103000
         ST    REG8,FRRIORWA(,REG9)                                0297 00104000
*   RFY                                                            0298 00105000
*    (REG1) UNRSTD;                                                0298 00106000
*   RFY                                                            0299 00107000
*    (REG11) UNRSTD;                                               0299 00108000
*                                                                  0299 00109000
*/***************************************************************  0300 00110000
**       THE FOLLOWING CODE DETERMINES THE CALLER OF I/O RESTART   0300 00111000
**       AND ROUTES CONTROL TO THE SPECIFIC SECTION OF CODE        0300 00112000
**       FOR THAT CALLER.                                          0300 00113000
***************************************************************      */ 00114000
*                                                                  0300 00115000
*   IF INDICAT=ACR                  /* IS THIS AN ACR CALL           */ 00116000
*     THEN                                                         0300 00117000
         CLI   INDICAT(REG8),X'00'                                 0300 00118000
         BE    @RT00300                                            0300 00119000
*     GO TO ACRPROC;                /* IF YES GO PROCESS             */ 00120000
*   IF INDICAT=LOSTCHAN             /* IF CHAN LOST          @G552PLM*/ 00121000
*     THEN                                                         0302 00122000
         CLC   INDICAT(1,REG8),LOSTCHAN                            0302 00123000
         BE    @RT00302                                            0302 00124000
*     GO TO LOSTCHCD;               /* GO PROCESS IT         @G552PLM*/ 00125000
*   ELSE                                                           0304 00126000
*     UCBPTR=UCBP;                  /* SET UP PTR TO UCB             */ 00127000
         SLR   UCBPTR,UCBPTR                                       0304 00128000
         ICM   UCBPTR,7,UCBP(REG8)                                 0304 00129000
*   IF INDICAT=CCH                  /* IS THIS A CCH CALL IF SO DO 0305 00130000
*                                      THEN CLAUSE IF NOT DO ELSE  0305 00131000
*                                      CLAUSE                        */ 00132000
*     THEN                                                         0305 00133000
         CLI   INDICAT(REG8),X'40'                                 0305 00134000
         BNE   @RF00305                                            0305 00135000
*     DO;                           /* IF YES PROCESS                */ 00136000
*       GEN(TITLE 'IECVRSTI - CCH CALL CODE');                     0307 00137000
*                                                                  0307 00138000
         TITLE 'IECVRSTI - CCH CALL CODE'                               00139000
*/***************************************************************  0308 00140000
**       THE FOLLOWING CODE HANDLES THE CCH CALL TO I/O RESTART.   0308 00141000
**       AFTER THE CSW HAS BEEN SAVED AN ATTEMPT TO CLEAR THE      0308 00142000
**       DEVICE (VIA THE CLEARDEV SUBROUTINE) IS MADE. BASED ON    0308 00143000
**       THE SUCCESS OF THE CLEARING THE NO RETRY BIT MAY BE SET   0308 00144000
**       FOR ERP NOTIFICATION. THE CSW IS THEN RESTORED AND THE    0308 00145000
**       COMMON MIH-CCH EXIT ROUTINE IS ENTERED.                   0308 00146000
***************************************************************      */ 00147000
*                                                                  0308 00148000
*CCHPROC:                                                          0308 00149000
*       IORCSW(ONE:EIGHT)=CSW;      /* SAVE THE CSW                  */ 00150000
CCHPROC  MVC   IORCSW(8,REG8),CSW                                  0308 00151000
*       ERPIBPTR=REG12;             /* SET ERPIB PTR                 */ 00152000
         ST    REG12,ERPIBPTR(,REG8)                               0309 00153000
*       CALL CLEARDEV;              /* ATTEMPT TO CLEAR DEV          */ 00154000
         BAL   @14,CLEARDEV                                        0310 00155000
*       IF ERPIBPTR^=ZERO           /* IS THERE AN ERPIB             */ 00156000
*         THEN                                                     0311 00157000
         L     @11,ERPIBPTR(,REG8)                                 0311 00158000
         LTR   @11,@11                                             0311 00159000
         BZ    @RF00311                                            0311 00160000
*         DO;                       /* YES - PROCESS IT              */ 00161000
*           RSTIERP(FIVE:EIGHT)=ERPIBSTD;/* SET STANDARD ERPIB       */ 00162000
         MVC   RSTIERP+4(4,@11),ERPIBSTD                           0313 00163000
*           IF NODEVCLR=ON1         /* DID DEV CLEAR                 */ 00164000
*             THEN                                                 0314 00165000
         TM    NODEVCLR(REG8),B'01000000'                          0314 00166000
         BNO   @RF00314                                            0314 00167000
*             RSTINOR=ON1;          /* NO - SET ERPIB NO RTY         */ 00168000
         OI    RSTINOR(@11),B'00000001'                            0315 00169000
*           ELSE                                                   0316 00170000
*             ;                                                    0316 00171000
@RF00314 DS    0H                                                  0317 00172000
*         END;                                                     0317 00173000
*       ELSE                                                       0318 00174000
*         ;                                                        0318 00175000
@RF00311 DS    0H                                                  0319 00176000
*       CALL IGFPSAD0;              /* OBTAIN AUTHORIZATION  @G51BPLC*/ 00177000
         L     @15,@CV03195                                        0319 00178000
         BALR  @14,@15                                             0319 00179000
*       CSW(ONE:EIGHT)=IORCSW(ONE:EIGHT);/* RESTORE CSW              */ 00180000
         MVC   CSW(8),IORCSW(REG8)                                 0320 00181000
*       CHANSTAT=CHANSTAT|CCCICC2;  /* SET CCC ICC IN CSW            */ 00182000
         OI    CHANSTAT,X'06'                                      0321 00183000
*       CALL IGFPSAE0;              /* RELEASE AUTHORIZATION@G51BPLC */ 00184000
         L     @15,@CV03196                                        0322 00185000
         BALR  @14,@15                                             0322 00186000
*     END;                                                         0323 00187000
*   ELSE                                                           0324 00188000
*     DO;                           /* NO - DO MIH PROCESS           */ 00189000
         B     @RC00305                                            0324 00190000
@RF00305 DS    0H                                                  0325 00191000
*       RFY                                                        0325 00192000
*        (REG12) UNRSTD;                                           0325 00193000
*       GEN(TITLE 'IECVRSTI - MIH CALL CODE');                     0326 00194000
*                                                                  0326 00195000
         TITLE 'IECVRSTI - MIH CALL CODE'                               00196000
*/***************************************************************  0327 00197000
**       THIS CODE HANDLES THE MIH CALL TO I/O RESTART.            0327 00198000
**       THE CSW IS RESET TO INDICATE THE RESULT OF THE CLEARDEV   0327 00199000
**       SUBROUTINE. DIFFERENT STATUS IS STORED DEPENDING ON       0327 00200000
**       WHAT KIND OF CHANNEL PROGRAM (SENSE OR NORMAL) WAS        0327 00201000
**       RUNNING WHEN THE INTERRUPT WAS LOST.                      0327 00202000
***************************************************************      */ 00203000
*                                                                  0327 00204000
*MIHPROC:                                                          0327 00205000
*       ;                                                          0327 00206000
MIHPROC  DS    0H                                                  0328 00207000
*       UCBPTR=UCBPTR-UCBPRELN;     /* GET TO PREFIX                 */ 00208000
         SH    UCBPTR,@CH03050                                     0328 00209000
*       UCBP=UCBPTR;                /* RESET PARAMETER               */ 00210000
         STCM  UCBPTR,7,UCBP(REG8)                                 0329 00211000
*       CALL CLEARDEV;              /* ATTEMPT TO CLEAR DEV          */ 00212000
         BAL   @14,CLEARDEV                                        0330 00213000
*       PCCACHUB=UCBPTR+UCBPRELN;   /* SET PCCA ERPIB UCB ADDRESS    */ 00214000
         L     @12,PSAPCCAV                                        0331 00215000
         LA    @11,512                                             0331 00216000
         ALR   @11,UCBPTR                                          0331 00217000
         ST    @11,PCCACHUB(,@12)                                  0331 00218000
*       PCCAWERP(FIVE:EIGHT)=ERPIBSTD;/* SET STANDARD ERPIB          */ 00219000
         MVC   PCCAWERP+4(4,@12),ERPIBSTD                          0332 00220000
*       CALL IGFPSAD0;              /* OBTAIN AUTHORIZATION  @G51BPLC*/ 00221000
         L     @15,@CV03195                                        0333 00222000
         BALR  @14,@15                                             0333 00223000
*       CSW=CSW&&CSW;               /* CLEAR CSW             @G51BPLC*/ 00224000
         XC    CSW(8),CSW                                          0334 00225000
*       IF UCBPSNS=ON1              /* IS A SENSE PENDING            */ 00226000
*         THEN                                                     0335 00227000
         LA    @12,512                                             0335 00228000
         ALR   @12,UCBPTR                                          0335 00229000
         TM    UCBPSNS(@12),B'00010000'                            0335 00230000
         BNO   @RF00335                                            0335 00231000
*         IF UCBASNS=ON1            /* IS A SENSE ACTIVE             */ 00232000
*           THEN                                                   0336 00233000
         TM    UCBASNS(@12),B'01000000'                            0336 00234000
         BNO   @RF00336                                            0336 00235000
*           DO;                     /* YES BOTH SET U.C.             */ 00236000
*             CMDADDR=IOCIOSCP+(UCBCCWOF*8)+EIGHT;/* SET CSW COMMAND    00237000
*                                      ADDR TO POINT 8 PAST THE SENSE   00238000
*                                      CCW                   @ZA16150*/ 00239000
         L     @11,IORSIOCM(,REG8)                                 0338 00240000
         L     @12,UCBEXTPT(,@12)                                  0338 00241000
         LH    @12,UCBCCWOF(,@12)                                  0338 00242000
         SLA   @12,3                                               0338 00243000
         AL    @12,IOCIOSCP(,@11)                                  0338 00244000
         LA    @12,8(,@12)                                         0338 00245000
         STCM  @12,7,CMDADDR                                       0338 00246000
*             STATUS=UCSTAT;        /* SET UNIT CHECK CSW            */ 00247000
         MVC   STATUS(2),@CB03050                                  0339 00248000
*           END;                                                   0340 00249000
*         ELSE                                                     0341 00250000
*           STATUS=DESTAT;          /* SENSE NOT ACTIVE SET DEVICE 0341 00251000
*                                      END.                          */ 00252000
         B     @RC00336                                            0341 00253000
@RF00336 MVC   STATUS(2),@CB03052                                  0341 00254000
*       ELSE                                                       0342 00255000
*         DO;                       /* NO SENSE PENDING              */ 00256000
         B     @RC00335                                            0342 00257000
@RF00335 DS    0H                                                  0343 00258000
*           STATUS=CCCICCST;        /* SET CCC ICC IN CSW            */ 00259000
         MVC   STATUS(2),@CB03054                                  0343 00260000
*           IF NODEVCLR=ON1         /* DID THE DEVICE CLEAR          */ 00261000
*             THEN                                                 0344 00262000
         TM    NODEVCLR(REG8),B'01000000'                          0344 00263000
         BNO   @RF00344                                            0344 00264000
*             PCCACNOR=ON1;         /* NO - SET ERPIB FOR RETRY NOT     00265000
*                                      POSS                          */ 00266000
         L     @12,PSAPCCAV                                        0345 00267000
         OI    PCCACNOR(@12),B'00000001'                           0345 00268000
*           ELSE                                                   0346 00269000
*             ;                                                    0346 00270000
@RF00344 DS    0H                                                  0347 00271000
*         END;                                                     0347 00272000
*       RSTIIOAA(TWO:THREE)=UCBCHAN;/* SET UP INT ADDR       @G51BPLC*/ 00273000
@RC00335 MVC   RSTIIOAA+1(2),UCBCHAN+512(UCBPTR)                   0348 00274000
*       CALL IGFPSAE0;              /* RELEASE AUTHORIZATION@G51BPLC */ 00275000
         L     @15,@CV03196                                        0349 00276000
         BALR  @14,@15                                             0349 00277000
*       RFY                                                        0350 00278000
*        (REG13) RSTD;                                             0350 00279000
*       RFY                                                        0351 00280000
*        (REG11) RSTD;                                             0351 00281000
*       RFY                                                        0352 00282000
*        (REG5) RSTD;                                              0352 00283000
*       GEN(TITLE 'IECVRSTI - I/O RESTART IFACE WITH SLIH');       0353 00284000
*                                                                  0353 00285000
         TITLE 'IECVRSTI - I/O RESTART IFACE WITH SLIH'                 00286000
*/***************************************************************  0354 00287000
**       THIS CODE INTERFACES WITH THE I/O SLIH TO CAUSE A         0354 00288000
**       SIMULATED INTERRUPT ON THE DEVICE FOR WHICH THE MIH       0354 00289000
**       CALL WAS MADE.                                            0354 00290000
***************************************************************      */ 00291000
*                                                                  0354 00292000
*       REG11=RSTIPINT;             /* SET ENVIRONMENT BYTE FOR IOS     00293000
*                                      CALL                          */ 00294000
         LA    REG11,10                                            0354 00295000
*       REG13=WSACRSTI;             /* SAVE AREA ADDRESS             */ 00296000
         L     @06,PSALCCAV                                        0355 00297000
         L     @06,LCCACPUS(,@06)                                  0355 00298000
         L     REG13,WSACRSTI(,@06)                                0355 00299000
*       REG5=ADIECINT;              /* INTERRUPT HANDLER ENTRY POINT */ 00300000
         L     REG5,ADIECINT                                       0356 00301000
*       GEN CODE;                                                  0357 00302000
         STM   @00,@15,0(@13)          SAVE THE REGS ACROSS SLIH        00303000
         BAL   @04,4(@05)               GO TO INT HANDLER               00304000
         LM    @00,@15,0(@13)           RESTORE REGS                    00305000
*       RFY                                                        0358 00306000
*        (REG13) UNRSTD;                                           0358 00307000
*       RFY                                                        0359 00308000
*        (REG11) UNRSTD;                                           0359 00309000
*       RFY                                                        0360 00310000
*        (REG5) UNRSTD;                                            0360 00311000
*     END;                                                         0361 00312000
*   GO TO IORSEND;                  /* RETURN TO MIH AFTER CLEANUP   */ 00313000
         B     IORSEND                                             0362 00314000
*   GEN(TITLE 'IECVRSTI - LOST CHANNEL ROUTINE');/*          @G552PLM*/ 00315000
         TITLE 'IECVRSTI - LOST CHANNEL ROUTINE'                        00316000
*/********************************************************************* 00317000
**       THIS CODE HANDLES I/O RESTART PROCESSING FOR A LOST       0364 00318000
**       CHANNEL.  A LOST CHANNEL IS INDICATED AS SUCH BY THE      0364 00319000
**       CATIORST FLAG BEING ON IN THE CAT ENTRY FOR THE CHANNEL.  0364 00320000
**       THIS CODE WILL SCAN THE CAT FOR A LOST CHANNEL AND CALL   0364 00321000
**       UCBACT PROCEEDURE FOR EACH DEVICE ON THE CHANNEL.         0364 00322000
*************************************************************@G552PLM*/ 00323000
*                                                                  0364 00324000
*LOSTCHCD:                                                         0364 00325000
*   ;                                                              0364 00326000
LOSTCHCD DS    0H                                                  0365 00327000
*   PWAEDSRB=0;                     /* SRB IS RE-USABLE      @G552PLM*/ 00328000
         L     @12,PWAPTR(,REG8)                                   0365 00329000
         MVI   PWAEDSRB(@12),X'00'                                 0365 00330000
*   FRRLCSRB='1'B;                  /* IND SRB HAS BEEN SET RE-USABLE   00331000
*                                                            @G552PLM*/ 00332000
         OI    FRRLCSRB(REG9),B'01000000'                          0366 00333000
*   RFY                                                            0367 00334000
*    (REG1,                                                        0367 00335000
*     REG11,                                                       0367 00336000
*     REG13,                                                       0367 00337000
*     REG15) RSTD;                  /*                       @G552PLM*/ 00338000
*   REG13=WSACRSTI;                 /* STOR MGR SAVE AREA    @G552PLM*/ 00339000
         L     @14,PSALCCAV                                        0368 00340000
         L     @14,LCCACPUS(,@14)                                  0368 00341000
         L     REG13,WSACRSTI(,@14)                                0368 00342000
*   REG11=GET160;                   /* SIZE OF RESERVE TAB   @G552PLM*/ 00343000
         L     REG11,@CF03037                                      0369 00344000
*   REG15=IOCORMGT;                 /* EP OF STOR MGR        @G552PLM*/ 00345000
         L     @12,IORSIOCM(,REG8)                                 0370 00346000
         L     REG15,IOCORMGT(,@12)                                0370 00347000
*   CALL SMGRGB;                    /* GET 160 BYTE BLOCK    @G552PLM*/ 00348000
         BALR  @14,@15                                             0371 00349000
*   BLKCHAIN=REG11;                 /* CHAIN PTR TO TABLE    @G552PLM*/ 00350000
         ST    REG11,BLKCHAIN(,REG8)                               0372 00351000
*   RSVTBLPT=REG11;                 /* BASE PTR FOR TABLE    @G552PLM*/ 00352000
         ST    REG11,RSVTBLPT(,REG8)                               0373 00353000
*   RFY                                                            0374 00354000
*    (REG1,                                                        0374 00355000
*     REG13,                                                       0374 00356000
*     REG15) UNRSTD;                /*                       @G552PLM*/ 00357000
*   REG11->RSVTBL=REG11->RSVTBL&&REG11->RSVTBL;/* CLEAR RESERVE TABLE   00358000
*                                                            @G552PLM*/ 00359000
         XC    RSVTBL(160,REG11),RSVTBL(REG11)                     0375 00360000
*   REG11->ENTCNT=ONE;              /* COUNT OF TAB ENTRYS   @G552PLM*/ 00361000
         MVC   ENTCNT(4,REG11),@CF00039                            0376 00362000
*   RFY                                                            0377 00363000
*     REG11 UNRSTD;                 /*                       @G552PLM*/ 00364000
*   CATPTR=ADDR(PCCACAT);           /* CAT IS IN PCCA        @G552PLM*/ 00365000
         L     @12,PSAPCCAV                                        0378 00366000
         LA    @12,PCCACAT(,@12)                                   0378 00367000
         ST    @12,CATPTR(,REG8)                                   0378 00368000
*CATLOOP:                                                          0379 00369000
*   ;                               /* THIS POINT IS BRANCHED TO   0379 00370000
*                                      AFTER THIS CPU'S CAT HAS BEEN    00371000
*                                      PROCESSED AND IT IS FOUND THAT   00372000
*                                      A CRH CONNECTED CHANNEL HAS 0379 00373000
*                                      BEEN LOST. CATPTR CONTAINS  0379 00374000
*                                      ADDR OF OTHER CAT     @G552PLM*/ 00375000
CATLOOP  DS    0H                                                  0380 00376000
*   DO CATINDEX=1 TO LENGTH(PCCACAT)/LENGTH(CAT);/* SCAN ALL ENTRIES    00377000
*                                                            @G552PLM*/ 00378000
         LA    @12,1                                               0380 00379000
         STC   @12,CATINDEX(,REG8)                                 0380 00380000
@DL00380 DS    0H                                                  0381 00381000
*     IF CATIORST='1'B THEN         /* IF CHANNEL LOST       @G552PLM*/ 00382000
         L     @12,CATPTR(,REG8)                                   0381 00383000
         TM    CATIORST(@12),B'01000000'                           0381 00384000
         BNO   @RF00381                                            0381 00385000
*       DO;                         /* DO I/O RESTART PROC   @G552PLM*/ 00386000
*         CHANID=CATINDEX-1;        /* CHANNEL NUMBER        @G552PLM*/ 00387000
         SLR   @12,@12                                             0383 00388000
         IC    @12,CATINDEX(,REG8)                                 0383 00389000
         BCTR  @12,0                                               0383 00390000
         STC   @12,CHANID(,REG8)                                   0383 00391000
*         MSG410(ONE:LENGTH(MSG410))=IEA410I(ONE:LENGTH(MSG410));/*     00392000
*                                                            @G552PLM*/ 00393000
         LA    @12,8                                               0384 00394000
         AL    @12,MESSPTR(,REG8)                                  0384 00395000
         MVC   MSG410(44,@12),IEA410I                              0384 00396000
*         IF CRHCHSW='0'B THEN      /* IF THIS CAT           @G552PLM*/ 00397000
         TM    CRHCHSW(REG8),B'01000000'                           0385 00398000
         BNZ   @RF00385                                            0385 00399000
*           TXTCPU=CPUID|NUMERMSK;  /* THIS CPU NO           @G552PLM*/ 00400000
         MVC   TXTCPU(1,@12),CPUID(REG8)                           0386 00401000
         OI    TXTCPU(@12),X'F0'                                   0386 00402000
*         ELSE                      /* CRH CAT               @G552PLM*/ 00403000
*           TXTCPU=(CVTCRCA->CRCAPCCA->OFFCPUID)|NUMERMSK;/* CRH CPU    00404000
*                                      NO                    @G552PLM*/ 00405000
         B     @RC00385                                            0387 00406000
@RF00385 L     @12,MESSPTR(,REG8)                                  0387 00407000
         L     @11,CVTPTR                                          0387 00408000
         L     @11,CVTCRCA(,@11)                                   0387 00409000
         L     @11,CRCAPCCA(,@11)                                  0387 00410000
         MVC   TXTCPU+8(1,@12),OFFCPUID(@11)                       0387 00411000
         OI    TXTCPU+8(@12),X'F0'                                 0387 00412000
*         IF CHANID<10 THEN                                        0388 00413000
@RC00385 CLI   CHANID(REG8),10                                     0388 00414000
         BNL   @RF00388                                            0388 00415000
*           TXTCHAN=CHANID|NUMERMSK;/* CHANNEL NO            @G552PLM*/ 00416000
         L     @12,MESSPTR(,REG8)                                  0389 00417000
         LA    @11,240                                             0389 00418000
         SLR   @06,@06                                             0389 00419000
         IC    @06,CHANID(,REG8)                                   0389 00420000
         OR    @11,@06                                             0389 00421000
         STC   @11,TXTCHAN+8(,@12)                                 0389 00422000
*         ELSE                      /*                       @G552PLM*/ 00423000
*           TXTCHAN=(CHANID-9)|CHARMASK;/*                   @G552PLM*/ 00424000
         B     @RC00388                                            0390 00425000
@RF00388 L     @12,MESSPTR(,REG8)                                  0390 00426000
         SLR   @11,@11                                             0390 00427000
         IC    @11,CHANID(,REG8)                                   0390 00428000
         SH    @11,@CH03145                                        0390 00429000
         O     @11,@CF03028                                        0390 00430000
         STC   @11,TXTCHAN+8(,@12)                                 0390 00431000
*         CALL RECORDIT;            /* PUT OUT MESSAGE       @G552PLM*/ 00432000
@RC00388 BAL   @14,RECORDIT                                        0391 00433000
*         MSG004(ONE:LENGTH(MSG004))=IEA004I(ONE:LENGTH(MSG004));/*     00434000
*                                                            @G552PLM*/ 00435000
         L     @12,MESSPTR(,REG8)                                  0392 00436000
         LA    @11,8                                               0392 00437000
         ALR   @11,@12                                             0392 00438000
         MVC   MSG004(88,@11),IEA004I                              0392 00439000
*         MSG004(TWENTY:FIFTY1)=BLANK1;/*                    @G552PLM*/ 00440000
         MVI   MSG004+20(@11),C' '                                 0393 00441000
         MVC   MSG004+21(30,@11),MSG004+20(@11)                    0393 00442000
         MVI   MSG004+19(@11),C' '                                 0393 00443000
*         MSGENT=ONE;               /*                       @G552PLM*/ 00444000
         MVC   MSGENT(2,@12),@CH00039                              0394 00445000
*         RFY                                                      0395 00446000
*          (REG11,                                                 0395 00447000
*           REG13,                                                 0395 00448000
*           REG15) RSTD;            /*                       @G552PLM*/ 00449000
*         FIRSTCHN=CHANID;          /* FIRST DEV             @G552PLM*/ 00450000
         MVC   FIRSTCHN(1,REG8),CHANID(REG8)                       0396 00451000
*         FIRSTUNT=0;               /* ADDRESS               @G552PLM*/ 00452000
         MVI   FIRSTUNT(REG8),X'00'                                0397 00453000
*         DO DEVINDEX=FIRSTDEV TO(FIRSTDEV+255);/* X00 - XFF @G552PLM*/ 00454000
         LH    @14,FIRSTDEV(,REG8)                                 0398 00455000
         B     @DE00398                                            0398 00456000
@DL00398 DS    0H                                                  0399 00457000
*           REG13=WSACRSTI;         /* SAVE AREA             @G552PLM*/ 00458000
         L     @14,PSALCCAV                                        0399 00459000
         L     @14,LCCACPUS(,@14)                                  0399 00460000
         L     REG13,WSACRSTI(,@14)                                0399 00461000
*           REG11=DEVINDEX;         /* DEV ADDR              @G552PLM*/ 00462000
         LH    REG11,DEVINDEX(,REG8)                               0400 00463000
*           GEN REFS(CVTILK1,CVTILK2,CVTIXAVL,CVTMAP,IOCOMEX,CVTPTR,    00464000
*               IOCOM,IOX,IOCUCBBM,IOXHICH)                        0401 00465000
*               (IOSGEN UCBLOOK,UCB=(UCBPTR),REG=(REG11));/* FIND UCB   00466000
*                                                            @G552PLM*/ 00467000
         IOSGEN UCBLOOK,UCB=(UCBPTR),REG=(REG11)                        00468000
*           IF REG15=0 THEN         /* IF UCB EXISTS         @G552PLM*/ 00469000
         LTR   REG15,REG15                                         0402 00470000
         BNZ   @RF00402                                            0402 00471000
*             CALL UCBACT;          /* PROCESS DEVICE        @G552PLM*/ 00472000
         BAL   @14,UCBACT                                          0403 00473000
*         END;                                                     0404 00474000
@RF00402 LA    @14,1                                               0404 00475000
         AH    @14,DEVINDEX(,REG8)                                 0404 00476000
@DE00398 STH   @14,DEVINDEX(,REG8)                                 0404 00477000
         LA    @12,255                                             0404 00478000
         AH    @12,FIRSTDEV(,REG8)                                 0404 00479000
         CR    @14,@12                                             0404 00480000
         BNH   @DL00398                                            0404 00481000
*         RFY                                                      0405 00482000
*          (REG11,                                                 0405 00483000
*           REG13,                                                 0405 00484000
*           REG15) UNRSTD;          /*                       @G552PLM*/ 00485000
*         IF MSGENT>ONE THEN        /* IF IEA004I HAS DEV    @G552PLM*/ 00486000
         L     @12,MESSPTR(,REG8)                                  0406 00487000
         CLC   MSGENT(2,@12),@CH00039                              0406 00488000
         BNH   @RF00406                                            0406 00489000
*           CALL RECORDIT;          /* WRITE IT OUT          @G552PLM*/ 00490000
*                                                                  0407 00491000
         BAL   @14,RECORDIT                                        0407 00492000
*         /***********************************************************/ 00493000
*         /*                                                         */ 00494000
*         /* SIMULATE CHANNEL AVAILABLE INTERRUPT TO ENSURE IOS      */ 00495000
*         /* CLEARS HIS QUEUES FOR THE LOST CHAN.            @G552PLM*/ 00496000
*         /*                                                         */ 00497000
*         /***********************************************************/ 00498000
*                                                                  0408 00499000
*         CSW=CSW&&CSW;             /* 0 CSW FOR CHAN AVAL   @G552PLM*/ 00500000
@RF00406 XC    CSW(8),CSW                                          0408 00501000
*         FLCIOA=0;                 /* ZERO DEVICE ADDRESS   @G552PLM*/ 00502000
         SLR   @12,@12                                             0409 00503000
         ST    @12,FLCIOA                                          0409 00504000
*         RSTIIOAA(2:2)=CHANID;     /* CHANNEL ADDRESS       @G552PLM*/ 00505000
         MVC   RSTIIOAA+1(1),CHANID(REG8)                          0410 00506000
*         RFY                                                      0411 00507000
*          (REG5,                                                  0411 00508000
*           REG11,                                                 0411 00509000
*           REG13) RSTD;            /*                       @G552PLM*/ 00510000
*         REG11=RSTIPINT;           /* PSEUDO INT FROM IOR   @G552PLM*/ 00511000
         LA    REG11,10                                            0412 00512000
*         REG5=ADIECINT;            /* ADDR IOS SLIH         @G552PLM*/ 00513000
         L     REG5,ADIECINT                                       0413 00514000
*         REG13=WSACRSTI;           /* SAVE AREA ADDR        @G552PLM*/ 00515000
         L     @06,PSALCCAV                                        0414 00516000
         L     @06,LCCACPUS(,@06)                                  0414 00517000
         L     REG13,WSACRSTI(,@06)                                0414 00518000
*         GEN CODE;                                                0415 00519000
*                                      /*SIMULATE INTERRUPT  @G552PLM*/ 00520000
                  STM   @00,@15,0(@13)  SAVE REGISTERS         @G552PLM 00521000
                  BAL   @04,4(@05)      ENTER IOS SLIH         @G552PLM 00522000
                  LM    @00,@15,0(@13)  RESTORE REGISTERS      @G552PLM 00523000
*         RFY                                                      0416 00524000
*          (REG5,                                                  0416 00525000
*           REG11,                                                 0416 00526000
*           REG13) UNRSTD;          /*                       @G552PLM*/ 00527000
*         CATIORST='0'B;            /* IND DONE WITH CHAN    @G552PLM*/ 00528000
         L     @12,CATPTR(,REG8)                                   0417 00529000
         NI    CATIORST(@12),B'10111111'                           0417 00530000
*       END;                        /* DONE WITH LOST CHAN   @G552PLM*/ 00531000
*     CATPTR=CATPTR+LENGTH(CAT);    /* PTR TO NEXT ENTRY     @G552PLM*/ 00532000
@RF00381 LA    @12,8                                               0419 00533000
         AL    @12,CATPTR(,REG8)                                   0419 00534000
         ST    @12,CATPTR(,REG8)                                   0419 00535000
*   END;                            /* DONE WITH CAT, ALL ENTRIES  0420 00536000
*                                      HAVE BEEN SCANNED     @G552PLM*/ 00537000
         LA    @12,1                                               0420 00538000
         SLR   @11,@11                                             0420 00539000
         IC    @11,CATINDEX(,REG8)                                 0420 00540000
         ALR   @12,@11                                             0420 00541000
         STC   @12,CATINDEX(,REG8)                                 0420 00542000
         CH    @12,@CH00787                                        0420 00543000
         BNH   @DL00380                                            0420 00544000
*   RFY                                                            0421 00545000
*     CRCA BASED(CRCAPTR);          /* CVTCRCA POINTS CRCA   @G552PLM*/ 00546000
*   IF CRHCHSW='0'B&                /* FIRST TIME THRU       @G552PLM*/ 00547000
*       CVTCRCA^=0&                 /* CRH IS ACTIVE         @G552PLM*/ 00548000
*       CRCACAT^=0 THEN             /* CAT FOR CPU EXISTS    @G552PLM*/ 00549000
         TM    CRHCHSW(REG8),B'01000000'                           0422 00550000
         BNZ   @RF00422                                            0422 00551000
         SLR   @12,@12                                             0422 00552000
         L     @11,CVTPTR                                          0422 00553000
         C     @12,CVTCRCA(,@11)                                   0422 00554000
         BE    @RF00422                                            0422 00555000
         L     @11,CRCAPTR(,@11)                                   0422 00556000
         L     @11,CRCACAT(,@11)                                   0422 00557000
         CR    @11,@12                                             0422 00558000
         BE    @RF00422                                            0422 00559000
*     DO;                           /* CHECK LOST CRH CHAN   @G552PLM*/ 00560000
*       CRHCHSW='1'B;               /* DO CRH CHECK ONCE     @G552PLM*/ 00561000
         OI    CRHCHSW(REG8),B'01000000'                           0424 00562000
*       CATPTR=CRCACAT;             /* ADDR OF CRH CAT       @G552PLM*/ 00563000
         ST    @11,CATPTR(,REG8)                                   0425 00564000
*       GO TO CATLOOP;              /* DO LOST CHAN WITH CAT FOR CRH    00565000
*                                      CONNECTED CHAN        @G552PLM*/ 00566000
         B     CATLOOP                                             0426 00567000
*     END;                          /*                       @G552PLM*/ 00568000
*   ELSE                                                           0428 00569000
*     ;                             /*                       @G552PLM*/ 00570000
@RF00422 DS    0H                                                  0429 00571000
*   RFY                                                            0429 00572000
*     CRCA BASED(REG3);             /*                       @G552PLM*/ 00573000
*   IF FRRLCRSV='1'B THEN           /* IF RESERVED DEVICES   @G552PLM*/ 00574000
         TM    FRRLCRSV(REG9),B'00100000'                          0430 00575000
         BNO   @RF00430                                            0430 00576000
*     DO;                           /* SETUP TO LOAD WAIT    @G552PLM*/ 00577000
*       ENT(ENTCNT)=ENT(ENTCNT)&&ENT(ENTCNT);/* NEXT SLOT IN TABLE 0432 00578000
*                                      DOES NOT CONTAIN A RESERVED 0432 00579000
*                                      DEVICE                @G552PLM*/ 00580000
         L     @12,RSVTBLPT(,REG8)                                 0432 00581000
         L     @11,ENTCNT(,@12)                                    0432 00582000
         SLA   @11,3                                               0432 00583000
         ALR   @12,@11                                             0432 00584000
         XC    ENT-8(8,@12),ENT-8(@12)                             0432 00585000
*       RFY                                                        0433 00586000
*         REG0 RSTD;                /*                       @G552PLM*/ 00587000
*LOSTCHWT:                                                         0434 00588000
*       ;                           /* IF RESTART KEY HIT-LOOP     0434 00589000
*                                                            @G552PLM*/ 00590000
LOSTCHWT DS    0H                                                  0435 00591000
*       REG0=LTCHANCD;              /* WAIT STATE CODE       @G552PLM*/ 00592000
         LA    REG0,73                                             0435 00593000
*       CALL WAITRTN;               /* PUT SYS IN WAIT       @G552PLM*/ 00594000
         BAL   @14,WAITRTN                                         0436 00595000
*       GO TO LOSTCHWT;             /* REMAIN IN WAIT IF RESTART KEY    00596000
*                                      HIT                   @G552PLM*/ 00597000
         B     LOSTCHWT                                            0437 00598000
*       RFY                                                        0438 00599000
*         REG0 UNRSTD;              /*                       @G552PLM*/ 00600000
*     END;                                                         0439 00601000
*   ELSE                                                           0440 00602000
*     GO TO IORSEND;                /* RELEASE RESOURCES AND RETURN     00603000
*                                      TO SRB DISPATCHER     @G552PLM*/ 00604000
*   GEN(TITLE 'IECVRSTI - ACR PROCESSING ROUTINE');                0441 00605000
*                                                                  0441 00606000
         TITLE 'IECVRSTI - ACR PROCESSING ROUTINE'                      00607000
*/***************************************************************  0442 00608000
**       THE FOLLOWING CODE GETS CONTROL IF AN ACR CALL TO I/O     0442 00609000
**       RESTART IS MADE.                                          0442 00610000
**       IF THE CHANNEL RECONFIGURATION HARDWARE IS AVAILABLE  @Y30CQLF 00611000
**       AN ATTEMPT WILL BE MADE TO ACTIVATE CRH. IF CRH IS    @Y30CQLF 00612000
**       UNABLE TO ACTIVATE OR CRH IS NOT AVAILABLE, NORMAL    @Y30CQLF 00613000
**       ACR PROCESSING WILL BE PERFORMED.                     @Y30CQLF 00614000
**       THE FIRST SECTION OF ACR CODE GETS A RESERVE TABLE AND    0442 00615000
**       INITIALIZES THE I/O TERMINATED MESSAGE IN THE MESSAGE     0442 00616000
**       BUFFER.                                                   0442 00617000
***************************************************************      */ 00618000
*                                                                  0442 00619000
*ACRPROC:                                                          0442 00620000
*   ;                                                              0442 00621000
ACRPROC  DS    0H                                                  0443 00622000
*   RFY                                                            0443 00623000
*    (REG1,                                                        0443 00624000
*     REG11,                                                       0443 00625000
*     REG13,                                                       0443 00626000
*     REG15) RSTD;                                                 0443 00627000
*   REG13=WSACRSTI;                 /* GET RESTART SAVE AREA         */ 00628000
         L     @14,PSALCCAV                                        0444 00629000
         L     @14,LCCACPUS(,@14)                                  0444 00630000
         L     REG13,WSACRSTI(,@14)                                0444 00631000
*/*****  CHANNEL RECONFIGURATION HARDWARE (CRH) SUPPORT  *** @Y30CQLF*/ 00632000
*/* CHECK WHETHER THE CHANNEL RECONFIGURATION HARDWARE       @Y30CQLF*/ 00633000
*/* ROUTINE (IECVCRHA) HAS BEEN SYSGENED. THE CRH FUNCTION   @Y30CQLF*/ 00634000
*/* IS AVAILABLE ONLY ON A 168MP SYSGENED SYSTEM AND THE     @Y30CQLF*/ 00635000
*/* ACTIVATION ROUTINE WILL VERIFY THAT WE ARE RUNNING ON A  @Y30CQLF*/ 00636000
*/* 168MP.                                                   @Y30CQLF*/ 00637000
*/********************************************************** @Y30CQLF*/ 00638000
*                                                                  0445 00639000
*   IF(IOXCRHA^=ZERO)&(PCCACPID(9:12)=CPU168)                      0445 00640000
*                                                                  0445 00641000
*   /*****************************************************************/ 00642000
*   /*                                                               */ 00643000
*   /* CRH FUNCTION AVAILABLE ?                              @Y30CQLF*/ 00644000
*   /*                                                               */ 00645000
*   /*****************************************************************/ 00646000
*                                                                  0445 00647000
*     THEN                                                         0445 00648000
         L     @14,IORSIOCM(,REG8)                                 0445 00649000
         L     @14,IOCOMEX(,@14)                                   0445 00650000
         ICM   @12,15,IOXCRHA(@14)                                 0445 00651000
         BZ    @RF00445                                            0445 00652000
         L     @14,PSAPCCAV                                        0445 00653000
         CLC   PCCACPID+8(4,@14),CPU168                            0445 00654000
         BNE   @RF00445                                            0445 00655000
*     DO;                           /* YES                   @Y30CQLF*/ 00656000
*       RESETCPU=ON1;               /* INDICATE CPU RESET REQUEST FOR   00657000
*                                      SIGP                  @Y30CQLF*/ 00658000
         OI    RESETCPU(REG8),B'00000100'                          0447 00659000
*       CALL SIGPRTN;               /* ISSUE SIGP CPU RESET TO PUT 0448 00660000
*                                      DEAD CPU IN STOPPED STATE   0448 00661000
*                                                            @Y30CQLF*/ 00662000
         BAL   @14,SIGPRTN                                         0448 00663000
*       IF IORCC3=ON1 THEN          /* IF CC=3 DO NOT ACTIVATE     0449 00664000
*                                                            @OZ06051*/ 00665000
         TM    IORCC3(REG8),B'00000010'                            0449 00666000
         BO    @RT00449                                            0449 00667000
*         GOTO RSTSIGPF;            /* CRH,NORMAL ACR        @OZ06051*/ 00668000
*       REG15=IOXCRHA;              /* PICK UP ADDRESS OF ACTIVATION    00669000
*                                      ROUTINE               @Y30CQLF*/ 00670000
         L     @12,IORSIOCM(,REG8)                                 0451 00671000
         L     @12,IOCOMEX(,@12)                                   0451 00672000
         L     REG15,IOXCRHA(,@12)                                 0451 00673000
*       CALL CRHA;                  /* ACTIVATE CRH          @Y30CQLF*/ 00674000
         BALR  @14,@15                                             0452 00675000
*       IF REG15=ZERO|              /* CRH ACTIVATED ?       @Y30CQLF*/ 00676000
*           REG15=FOUR              /* OR ALREADY ACTIVE ?@Y30CQLF   */ 00677000
*         THEN                                                     0453 00678000
         LTR   REG15,REG15                                         0453 00679000
         BZ    @RT00453                                            0453 00680000
         CH    REG15,@CH00036                                      0453 00681000
         BE    @RT00453                                            0453 00682000
*         GOTO IORSEND;             /* YES-RETURN TO ACR     @Y30CQLF*/ 00683000
*       ELSE                                                       0455 00684000
*         ;                         /* NO-CONTINUE           @Y30CQLF*/ 00685000
*     END;                          /*                       @Y30CQLF*/ 00686000
*RSTSIGPF:                                                         0457 00687000
*   IORCC3=OFF1;                    /* TURN OFF CC=3         @OZ06051*/ 00688000
@RF00445 DS    0H                                                  0457 00689000
RSTSIGPF DS    0H                                                  0458 00690000
*   RESETCPU=OFF1;                  /* ENSURE FLAG OFF IN CASE SIGP     00691000
*                                      IPR IS REQUIRED               */ 00692000
         NI    IORCC3(REG8),B'11111001'                            0458 00693000
*   REG11=GET160;                   /* SET TO GET RESV TABL          */ 00694000
         L     REG11,@CF03037                                      0459 00695000
*   REG15=IOCORMGT;                 /* GET ENTRY ADDRESS             */ 00696000
         L     @12,IORSIOCM(,REG8)                                 0460 00697000
         L     REG15,IOCORMGT(,@12)                                0460 00698000
*   CALL SMGRGB;                    /* GET 160 BYTE BLOCK            */ 00699000
         BALR  @14,@15                                             0461 00700000
*   BLKCHAIN=REG11;                 /* SET UP CHN PTR TO TBL         */ 00701000
         ST    REG11,BLKCHAIN(,REG8)                               0462 00702000
*   RSVTBLPT=REG11;                 /* SET TABLE POINTER             */ 00703000
         ST    REG11,RSVTBLPT(,REG8)                               0463 00704000
*   RFY                                                            0464 00705000
*    (REG1,                                                        0464 00706000
*     REG13,                                                       0464 00707000
*     REG15) UNRSTD;                                               0464 00708000
*   REG11->RSVTBL=REG11->RSVTBL&&REG11->RSVTBL;/* CLEAR THE TABLE    */ 00709000
         XC    RSVTBL(160,REG11),RSVTBL(REG11)                     0465 00710000
*   REG11->ENTCNT=ONE;              /* SET CNTR OF TBL ENT           */ 00711000
         MVC   ENTCNT(4,REG11),@CF00039                            0466 00712000
*   RFY                                                            0467 00713000
*    (REG11) UNRSTD;                                               0467 00714000
*   MSG004(ONE:LENGTH(MSG004))=IEA004I(ONE:LENGTH(MSG004));/*      0468 00715000
*                                      INITIALIZE MSG 004            */ 00716000
         LA    @12,8                                               0468 00717000
         AL    @12,MESSPTR(,REG8)                                  0468 00718000
         MVC   MSG004(88,@12),IEA004I                              0468 00719000
*   MSG004(TWENTY:FIFTY1)=BLANK1;   /* BLANK OUT DEV NAMES           */ 00720000
         MVI   MSG004+20(@12),C' '                                 0469 00721000
         MVC   MSG004+21(30,@12),MSG004+20(@12)                    0469 00722000
         MVI   MSG004+19(@12),C' '                                 0469 00723000
*   TBLPTR=CVTILK2;                 /* POINT TO THE UCB TBL          */ 00724000
         L     @12,CVTPTR                                          0470 00725000
         MVC   TBLPTR(4,REG8),CVTILK2(@12)                         0470 00726000
*   OFFIND=OFF1;                    /* SET OFFLINE RESERVE         0471 00727000
*                                      ENCOUNTERED INDICATOR OFF     */ 00728000
         NI    OFFIND(REG8),B'11110111'                            0471 00729000
*                                                                  0472 00730000
*/********************************************************** @Y30LPLC*/ 00731000
*/*      SS1 SUPPORT:                                        @Y30LPLC*/ 00732000
*/*      IF AN ACR EVENT OCCURS, SS1 MUST BE NOTIFIED. SS1   @Y30LPLC*/ 00733000
*/*      HAS POINTERS TO AN SRB AND A ROUTINE TO HANDLE      @Y30LPLC*/ 00734000
*/*      THIS SITUATION IN ITS SSCB CONTROL BLOCK. THE       @Y30LPLC*/ 00735000
*/*      FOLLOWING INSTRUCTIONS ZERO THE SRB, AND FILL       @Y30LPLC*/ 00736000
*/*      IN THE FOLLOWING FIELDS IN THE SRB: SRBASCB,        @Y30LPLC*/ 00737000
*/*      SRBEP, AND SRBPRIOR.                                @Y30LPLC*/ 00738000
*/********************************************************** @Y30LPLC*/ 00739000
*                                                                  0472 00740000
*   IF CVTICB^=ZERO THEN                                           0472 00741000
         L     @12,CVTEXT2(,@12)                                   0472 00742000
         L     @12,CVTICB(,@12)                                    0472 00743000
         LTR   @12,@12                                             0472 00744000
         BZ    @RF00472                                            0472 00745000
*     DO;                           /* SS1 IN SYSTEM         @Y30LPLC*/ 00746000
*       RFY                                                        0474 00747000
*        (REG1) RSTD;               /*                       @Y30LPLC*/ 00748000
*       RFY                                                        0475 00749000
*         SRBSECT BASED(REG1);      /* BASE SRB ON REG 1     @Y30LPLC*/ 00750000
*       REG1=ICBSRBP;               /* SET UP SRB BASE       @Y30LPLC*/ 00751000
         L     REG1,ICBSRBP(,@12)                                  0476 00752000
*       SRBEP=ICBIORCI;             /* SS1 CODE EP           @Y30LPLC*/ 00753000
         MVC   SRBEP(4,REG1),ICBIORCI(@12)                         0477 00754000
*       SRBASCB=ADDR(IEAMASCB);     /* MASTER SCHEDULER      @Y30LPLC   00755000
*                                      ASCB.                 @Y30LPLC*/ 00756000
         L     @12,@CV03191                                        0478 00757000
         ST    @12,SRBASCB(,REG1)                                  0478 00758000
*       SRBPRIOR=0;                 /* PRIORITY-SYSTEM       @Y30LPLC*/ 00759000
         MVI   SRBPRIOR(REG1),X'00'                                0479 00760000
*       GEN( SCHEDULE SRB=(REG1),SCOPE=GLOBAL);/* SS1 SRB    @Y30LPLC*/ 00761000
          SCHEDULE SRB=(REG1),SCOPE=GLOBAL                              00762000
*     END;                                                         0481 00763000
*                                                                  0481 00764000
*/********************************************************** @G552PLM*/ 00765000
*/*      CHECK ALL DEVICES IN SYSTEM TO DETERMINE WHICH      @G552PLM*/ 00766000
*/*      REQUIRE I/O RESTART PROCESS BECAUSE OF THE LOSS     @G552PLM*/ 00767000
*/*      OF A CPU.                                           @G552PLM*/ 00768000
*/********************************************************** @G552PLM*/ 00769000
*                                                                  0482 00770000
*   UCBPTR=UCBPT;                   /* GET PTR TO 1ST UCB    @G552PLM*/ 00771000
@RF00472 L     @12,TBLPTR(,REG8)                                   0482 00772000
         SLR   UCBPTR,UCBPTR                                       0482 00773000
         ICM   UCBPTR,3,UCBPT(@12)                                 0482 00774000
*   DO WHILE UCBPTR^=TABLEND;       /* INDEX THRU ALL UCB    @G552PLM*/ 00775000
         B     @DE00483                                            0483 00776000
@DL00483 DS    0H                                                  0484 00777000
*     IF UCBPTR^=ZERO THEN          /* IF UCB EXISTS         @G552PLM*/ 00778000
         LTR   UCBPTR,UCBPTR                                       0484 00779000
         BZ    @RF00484                                            0484 00780000
*       DO;                                                        0485 00781000
*         CALL UCBACT;              /* PROCESS DEVICE        @G552PLM*/ 00782000
         BAL   @14,UCBACT                                          0486 00783000
*       END;                                                       0487 00784000
*     ELSE                                                         0488 00785000
*       ;                                                          0488 00786000
@RF00484 DS    0H                                                  0489 00787000
*     TBLPTR=TBLPTR+TWO;            /* UP LOOKUP TAB INDX    @G552PLM*/ 00788000
         LA    @12,2                                               0489 00789000
         AL    @12,TBLPTR(,REG8)                                   0489 00790000
         ST    @12,TBLPTR(,REG8)                                   0489 00791000
*     UCBPTR=UCBPT;                 /* PTR TO NEXT UCB       @G552PLM*/ 00792000
         SLR   UCBPTR,UCBPTR                                       0490 00793000
         ICM   UCBPTR,3,UCBPT(@12)                                 0490 00794000
*   END;                                                           0491 00795000
@DE00483 C     UCBPTR,@CF03012                                     0491 00796000
         BNE   @DL00483                                            0491 00797000
*                                                                  0492 00798000
*/***************************************************************  0492 00799000
**       IF THE END OF THE TABLE HAS BEEN REACHED THE MESSAGE      0492 00800000
**       BUFFER IS PURGED IF NECESSARY, AND A CHECK IS MADE TO     0492 00801000
**       DETERMINE IF THE RESERVE TABLE HAS ANY VALID ENTRIES.     0492 00802000
**       IF NO ENTRIES ARE FOUND AN I/O RESET (SIGP) IS ISSUED     0492 00803000
**       TO THE BAD CPU TO CLEAR ANY CONNECTION WITH ACTIVE        0492 00804000
**       DEVICES AND CONTROL IS RETURNED TO ACR.                   0492 00805000
**       IF THE RESERVE TABLE DOES HAVE VALID ENTRIES THIS CODE    0492 00806000
**       CALLS THE WAIT ROUTINE TO PUT THE SYSTEM INTO A 041       0492 00807000
**       WAIT STATE. AFTER DOING THIS THE I/O RESET (SIGP) IS      0492 00808000
**       ISSUED TO THE BAD CPU.                                    0492 00809000
***************************************************************      */ 00810000
*                                                                  0492 00811000
*   IF MSGENT>ONE                   /* IS THERE SOMETHING IN THE   0492 00812000
*                                      MESSAGE BUFFER                */ 00813000
*     THEN                                                         0492 00814000
         L     @12,MESSPTR(,REG8)                                  0492 00815000
         CLC   MSGENT(2,@12),@CH00039                              0492 00816000
         BNH   @RF00492                                            0492 00817000
*     CALL RECORDIT;                /* YES - OUTPUT IT GO RECORD   0493 00818000
*                                      MESSAGE                       */ 00819000
         BAL   @14,RECORDIT                                        0493 00820000
*   ELSE                                                           0494 00821000
*     ;                                                            0494 00822000
@RF00492 DS    0H                                                  0495 00823000
*   PASSIND=OFF1;                   /* SET PASS INDICATOR TO FIRST 0495 00824000
*                                      PASS                          */ 00825000
         NI    PASSIND(REG8),B'01111111'                           0495 00826000
*   IF(ENTCNT=ONE&RCHAIN=ZERO)      /* IS TABLE EMPTY                */ 00827000
*     THEN                                                         0496 00828000
         L     @12,RSVTBLPT(,REG8)                                 0496 00829000
         CLC   ENTCNT(4,@12),@CF00039                              0496 00830000
         BNE   @RF00496                                            0496 00831000
         ICM   @11,15,RCHAIN(@12)                                  0496 00832000
         BNZ   @RF00496                                            0496 00833000
*     DO;                           /* YES - CLEAR OTHER CPU         */ 00834000
*       CALL SIGPRTN;               /* I/O RESET TO DOWN CPU         */ 00835000
         BAL   @14,SIGPRTN                                         0498 00836000
*       GO TO IORSEND;              /* CLEAN UP AND RETURN           */ 00837000
         B     IORSEND                                             0499 00838000
*     END;                                                         0500 00839000
*   ELSE                                                           0501 00840000
*     ;                                                            0501 00841000
@RF00496 DS    0H                                                  0502 00842000
*   RFY                                                            0502 00843000
*    (REG0) RSTD;                                                  0502 00844000
*   ENT(ENTCNT)=ENT(ENTCNT)&&ENT(ENTCNT);/* ZERO THE RESIDUAL ENT    */ 00845000
         L     @12,RSVTBLPT(,REG8)                                 0503 00846000
         L     @11,ENTCNT(,@12)                                    0503 00847000
         SLA   @11,3                                               0503 00848000
         ALR   @12,@11                                             0503 00849000
         XC    ENT-8(8,@12),ENT-8(@12)                             0503 00850000
*   REG0=FORTY1;                    /* SET WAIT CODE                 */ 00851000
         LA    REG0,65                                             0504 00852000
*   CALL WAITRTN;                   /* GO TO WAIT RNT IFACE          */ 00853000
         BAL   @14,WAITRTN                                         0505 00854000
*   RFY                                                            0506 00855000
*    (REG0) UNRSTD;                                                0506 00856000
*   CALL SIGPRTN;                   /* I/O RESET TO DOWN CPU         */ 00857000
         BAL   @14,SIGPRTN                                         0507 00858000
*                                                                  0508 00859000
*/***************************************************************  0508 00860000
**       THE FOLLOWING CODE IS ENTERED AFTER THE I/O RESET HAS     0508 00861000
**       TAKEN PLACE. IT SETS THE WORK AREA RESERVE TABLE          0508 00862000
**       POINTER TO POINT TO THE FIRST RESERVE TABLE AND SETS      0508 00863000
**       THE TABLE INDEX TO PROCESS THE FIRST ENTRY.               0508 00864000
***************************************************************      */ 00865000
*                                                                  0508 00866000
*RERESV:                                                           0508 00867000
*   ;                                                              0508 00868000
RERESV   DS    0H                                                  0509 00869000
*   RSVTBLPT=BLKCHAIN;              /* SET RESERVE TABLE PTR TO FIRST   00870000
*                                      ENTRY                         */ 00871000
         L     @12,BLKCHAIN(,REG8)                                 0509 00872000
         ST    @12,RSVTBLPT(,REG8)                                 0509 00873000
*   ENTCNT=ONE;                     /* SET FOR FIRST ENT             */ 00874000
         MVC   ENTCNT(4,@12),@CF00039                              0510 00875000
*   RFY                                                            0511 00876000
*    (REG4) RESTRICTED;                                            0511 00877000
*                                                                  0511 00878000
*/***************************************************************  0512 00879000
**       THIS CODE PROCESSES THE RESERVE TABLE.                    0512 00880000
**       FOR ONLINE RESERVE ENTRIES CONTROL IS PASSED TO THE       0512 00881000
**       RESERVE ROUTINE.                                          0512 00882000
**       FOR OFFILNE RESERVE ENTRIES IF THIS IS THE FIRST (ONLINE  0512 00883000
**       RESERVE) PASS THE ENTRY IS IGNORED. IF THIS IS THE        0512 00884000
**       SECOND (OFFLINE RESERVE) PASS THE ENTRY IS PROCESSED      0512 00885000
**       AS A NORMAL RESERVE. AS OFFLINE RESERVES ARE ENCOUNTERED  0512 00886000
**       A FLAG INDICATING OFFLINE RESERVES PRESENT IS SET AND     0512 00887000
**       USED TO DETERMINE IF A SECOND PASS IS NECESSARY AFTER     0512 00888000
**       THE ONLINE RESERVE PASS.(WHETHER A 042 WAIT SHOULD BE     0512 00889000
**       ISSUED.)                                                  0512 00890000
**       IF THE ENTRY IS ZERO THE TABLE IS UPPED TO THE NEXT       0512 00891000
**       ENTRY.                                                    0512 00892000
**       WHEN ALL ENTRIES HAVE BEEN PROCESSED THE TABLE IS         0512 00893000
**       CHECKED TO SEE THAT ALL ENTRIES ARE ZERO. IF SO           0512 00894000
**       NORMAL TERMINATION TAKES PLACE, OTHERWISE A 043 HARD      0512 00895000
**       WAIT IS ENTERED.                                          0512 00896000
***************************************************************      */ 00897000
*                                                                  0512 00898000
*CKOFF:                                                            0512 00899000
*   IF ENT(ENTCNT,ONE:TWO)=ZERO     /* IS THIS A NULL ENTRY          */ 00900000
*     THEN                                                         0512 00901000
CKOFF    L     @12,RSVTBLPT(,REG8)                                 0512 00902000
         L     @11,ENTCNT(,@12)                                    0512 00903000
         SLA   @11,3                                               0512 00904000
         ALR   @11,@12                                             0512 00905000
         SLR   @06,@06                                             0512 00906000
         ICM   @06,3,ENT-8(@11)                                    0512 00907000
         LTR   @06,@06                                             0512 00908000
         BZ    @RT00512                                            0512 00909000
*     GO TO UPNXT1;                 /* YES - GET NEXT ENRTY          */ 00910000
*   ELSE                                                           0514 00911000
*     DO;                           /* NO - PROCESS THIS INT         */ 00912000
*       UCBPTR=ENTUCB(EVAL(ENTCNT));/* SET UP UCB POINTER            */ 00913000
         L     @11,ENTCNT(,@12)                                    0515 00914000
         SLA   @11,3                                               0515 00915000
         L     UCBPTR,ENTUCB-8(@11,@12)                            0515 00916000
*       IF ROFFLINE(EVAL(ENTCNT))=ON1/* IS THIS AN OFFLINE ENTRY     */ 00917000
*         THEN                                                     0516 00918000
         ALR   @12,@11                                             0516 00919000
         TM    ROFFLINE-8(@12),B'10000000'                         0516 00920000
         BNO   @RF00516                                            0516 00921000
*         DO;                       /* YES CHECK FIRST PASS          */ 00922000
*           OFFIND=ON1;             /* SET OFFLINE RESERVE         0518 00923000
*                                      ENCOUNTERED INDICATOR         */ 00924000
         OI    OFFIND(REG8),B'00001000'                            0518 00925000
*           IF PASSIND=OFF1         /* IS THIS FIRST PASS            */ 00926000
*             THEN                                                 0519 00927000
         TM    PASSIND(REG8),B'10000000'                           0519 00928000
         BNZ   @RF00519                                            0519 00929000
*             DO;                   /* YES-UPDATE TABLE INDX         */ 00930000
*UPNXT1:                                                           0521 00931000
*               ENTCNT=ENTCNT+ONE;  /* INCR ENTCNT                   */ 00932000
UPNXT1   L     @12,RSVTBLPT(,REG8)                                 0521 00933000
         LA    @11,1                                               0521 00934000
         AL    @11,ENTCNT(,@12)                                    0521 00935000
         ST    @11,ENTCNT(,@12)                                    0521 00936000
*               IF ENTCNT=ENTMAX+ONE/* LAST ENTRY IN TABLE           */ 00937000
*                 THEN                                             0522 00938000
         CH    @11,@CH01699                                        0522 00939000
         BNE   @RF00522                                            0522 00940000
*                 DO;                                              0523 00941000
*                   IF RCHAIN=ZERO  /* LAST TABLE IN CHAIN           */ 00942000
*                     THEN                                         0524 00943000
         ICM   @11,15,RCHAIN(@12)                                  0524 00944000
         BNZ   @RF00524                                            0524 00945000
*                     DO;                                          0525 00946000
*                       IF PASSIND=OFF1/* IS THIS FIRST PASS         */ 00947000
*                         THEN                                     0526 00948000
         TM    PASSIND(REG8),B'10000000'                           0526 00949000
         BNZ   @RF00526                                            0526 00950000
*                         DO;                                      0527 00951000
*                           IF OFFIND=OFF1/* WAS AN OFFLINE RESV   0528 00952000
*                                      ENCOUNTERED                   */ 00953000
*                             THEN                                 0528 00954000
         TM    OFFIND(REG8),B'00001000'                            0528 00955000
         BZ    @RT00528                                            0528 00956000
*                             GO TO TBLCK0;/* NO - GET OUT           */ 00957000
*                           ELSE                                   0530 00958000
*                             ;     /* YES-SET 042 WAIT              */ 00959000
*                           RFY                                    0531 00960000
*                            (REG0) RSTD;                          0531 00961000
*                           REG0=FORTY2;/* SET WAIT CODE             */ 00962000
         LA    REG0,66                                             0532 00963000
*                           CALL WAITRTN;/* GO TO WAIT RTN IFACE     */ 00964000
         BAL   @14,WAITRTN                                         0533 00965000
*                           RFY                                    0534 00966000
*                            (REG0) UNRSTD;                        0534 00967000
*                           PASSIND=ON1;/* SET SECOND PASS           */ 00968000
         OI    PASSIND(REG8),B'10000000'                           0535 00969000
*                           GO TO RERESV;/* PROCESS OFFLINE RESVS    */ 00970000
         B     RERESV                                              0536 00971000
*                         END;                                     0537 00972000
*                       ELSE                                       0538 00973000
*                         DO;       /* INSURE ALL ENTS 0             */ 00974000
@RF00526 DS    0H                                                  0539 00975000
*TBLCK0:                                                           0539 00976000
*                           RSVTBLPT=BLKCHAIN;/* RESET RESERVE TBL 0539 00977000
*                                      PTR                           */ 00978000
TBLCK0   MVC   RSVTBLPT(4,REG8),BLKCHAIN(REG8)                     0539 00979000
*TBLCK:                                                            0540 00980000
*                           IF((ENTRIES(ONE:ONE)=ZERO)&(ENTRIES(ONE:    00981000
*                               ONE51)=ENTRIES(TWO:ONE52)))/* ARE ALL   00982000
*                                      ENTRIES ZERO SECOND PASS    0540 00983000
*                                      PROCESS                       */ 00984000
*                             THEN                                 0540 00985000
TBLCK    SLR   @12,@12                                             0540 00986000
         L     @11,RSVTBLPT(,REG8)                                 0540 00987000
         SLR   @06,@06                                             0540 00988000
         IC    @06,ENTRIES(,@11)                                   0540 00989000
         CR    @12,@06                                             0540 00990000
         BNE   @RF00540                                            0540 00991000
         CLC   ENTRIES(151,@11),ENTRIES+1(@11)                     0540 00992000
         BNE   @RF00540                                            0540 00993000
*                             DO;   /* YES - TRY NEXT TBL            */ 00994000
*                               RSVTBLPT=RCHAIN;/* SET TO NEXT TABLE */ 00995000
         L     @11,RCHAIN(,@11)                                    0542 00996000
         ST    @11,RSVTBLPT(,REG8)                                 0542 00997000
*                               IF RSVTBLPT=ZERO/* LAST ENTRY        */ 00998000
*                                 THEN                             0543 00999000
         CR    @11,@12                                             0543 01000000
         BE    @RT00543                                            0543 01001000
*                                 GO TO IORSEND;/* FINISHED - RETURN    01002000
*                                      TO ACR                        */ 01003000
*                               ELSE                               0545 01004000
*                                 GO TO TBLCK;/* CONTINUE TABLE SCAN    01005000
*                                      FOR NON-ZERO ENTS             */ 01006000
         B     TBLCK                                               0545 01007000
*                             END;                                 0546 01008000
*                           ELSE                                   0547 01009000
*                             GO TO HARDWAIT;/* PUT SYSTEM INTO A  0547 01010000
*                                      HARD WAIT STATE (043)         */ 01011000
*                         END;                                     0548 01012000
*                     END;                                         0549 01013000
*                   ELSE                                           0550 01014000
*                     DO;                                          0550 01015000
@RF00524 DS    0H                                                  0551 01016000
*                       RSVTBLPT=RCHAIN;/* GET NEXT TABLE            */ 01017000
         L     @12,RSVTBLPT(,REG8)                                 0551 01018000
         L     @12,RCHAIN(,@12)                                    0551 01019000
         ST    @12,RSVTBLPT(,REG8)                                 0551 01020000
*                       ENTCNT=ONE; /* SET FOR FIRST ENT             */ 01021000
         MVC   ENTCNT(4,@12),@CF00039                              0552 01022000
*                       GO TO CKOFF;/* CHECK ENTS IN TABLE           */ 01023000
         B     CKOFF                                               0553 01024000
*                     END;                                         0554 01025000
*                 END;                                             0555 01026000
*               ELSE                                               0556 01027000
*                 GO TO CKOFF;      /* NOT LAST ENT CK NEXT          */ 01028000
*             END;                                                 0557 01029000
*           ELSE                                                   0558 01030000
*             ;                                                    0558 01031000
@RF00519 DS    0H                                                  0559 01032000
*         END;                                                     0559 01033000
*       ELSE                                                       0560 01034000
*         ;                                                        0560 01035000
@RF00516 DS    0H                                                  0561 01036000
*     END;                                                         0561 01037000
*                                                                  0561 01038000
*/***************************************************************  0562 01039000
**       THIS CODE DOES THE ACTUAL RESERVE FOR ENTRIES IN THE      0562 01040000
**       RESERVE TABLE. AFTER ISSUING THE SIO FOR THE RESERVE      0562 01041000
**       ONE OF SEVERAL ROUTINES IS ENTERED TO HANDLE THE          0562 01042000
**       PRESENTED CONDITION CODE.                                 0562 01043000
***************************************************************      */ 01044000
*                                                                  0562 01045000
*RESVIT:                                                           0562 01046000
*   ;                                                              0562 01047000
RESVIT   DS    0H                                                  0563 01048000
*   GEN;                                                           0563 01049000
         LRA   4,RESRVCCW              LOAD REAL ADDR OF CCW            01050000
*   CALL IGFPSAD0;                  /* OBTAIN AUTHORIZATION  @G51BPLC*/ 01051000
         L     @15,@CV03195                                        0564 01052000
         BALR  @14,@15                                             0564 01053000
*   FLCCAW=REG4;                    /* SET CCW ADDR AND KEY OF ZERO     01054000
*                                                            @G51BPLC*/ 01055000
         ST    REG4,FLCCAW                                         0565 01056000
*   CALL IGFPSAE0;                  /* RELEASE AUTHORIZATION @G51BPLC*/ 01057000
         L     @15,@CV03196                                        0566 01058000
         BALR  @14,@15                                             0566 01059000
*   TIOCNTR=ZERO;                   /* INITIALIZE TIO COUNT          */ 01060000
         SLR   @12,@12                                             0567 01061000
         STH   @12,TIOCNTR(,REG8)                                  0567 01062000
*   REG4=ENT(ENTCNT,ONE:TWO)&ORMASK;/* SET DEV ADDR IN REG   @YM04703   01063000
*                                      FOR USE IN RESERVE            */ 01064000
         L     @12,RSVTBLPT(,REG8)                                 0568 01065000
         L     @11,ENTCNT(,@12)                                    0568 01066000
         SLA   @11,3                                               0568 01067000
         LA    REG4,4095                                           0568 01068000
         ALR   @12,@11                                             0568 01069000
         SLR   @11,@11                                             0568 01070000
         ICM   @11,3,ENT-8(@12)                                    0568 01071000
         NR    REG4,@11                                            0568 01072000
*RESVSIO:                                                          0569 01073000
*   ;                                                              0569 01074000
RESVSIO  DS    0H                                                  0570 01075000
*   GEN( SIO   0(4) );              /* ISSUE THE RESERVE             */ 01076000
          SIO   0(4)                                                    01077000
*   BC(4,CKSTAT1);                  /* CC=1 CHECK STATUS             */ 01078000
         BC    4,CKSTAT1                                           0571 01079000
*   BC(2,CHBSY);                    /* CC=2 GO ENABLE CHAN           */ 01080000
         BC    2,CHBSY                                             0572 01081000
*   BC(1,ROFFCK);                   /* CC=3 INOP-HARDWAIT CC=0 BRING    01082000
*                                      IN INT                        */ 01083000
         BC    1,ROFFCK                                            0573 01084000
*/***************************************************************  0574 01085000
**       THIS CODE IS ENTERED BY DEFAULT WHEN A CC0 RESPONSE IS    0574 01086000
**       MADE TO THE SIO FOR THE RESERVE. IT ATTEMPTS TO BRING     0574 01087000
**       IN THE INTERRUPT WITH A TIO LOOP. CC0 OR CC3 RESPONSE     0574 01088000
**       OR THE FAILURE OF THE DEVICE TO STORE STATUS BEFORE THE   0574 01089000
**       LOOP ENDS IS CONSIDERED AN ERROR AND AN 043 WAIT IS       0574 01090000
**       ENTERED. CC1 CAUSES A STATUS CHECKING ROUTINE TO GET      0574 01091000
**       CONTROL.                                                  0574 01092000
***************************************************************      */ 01093000
*                                                                  0574 01094000
*TESTIT:                                                           0574 01095000
*   ;                                                              0574 01096000
TESTIT   DS    0H                                                  0575 01097000
*   GEN( TIO   0(4) );              /* TIO DEVICE                    */ 01098000
          TIO   0(4)                                                    01099000
*   BC(9,HARDWAIT);                 /* CC=3 OR CC=0 HARDWAIT         */ 01100000
         BC    9,HARDWAIT                                          0576 01101000
*   BC(4,CKSTAT);                   /* CC=1 CHECK STATUS             */ 01102000
         BC    4,CKSTAT                                            0577 01103000
*/*************                                                    0578 01104000
**       TIO LOOP COUNT                                            0578 01105000
*************                                                        */ 01106000
*                                                                  0578 01107000
*TMLOOP:                                                           0578 01108000
*   TIOCNTR=TIOCNTR+ONE;            /* INCREMENT TIO CNT             */ 01109000
TMLOOP   LA    @12,1                                               0578 01110000
         AH    @12,TIOCNTR(,REG8)                                  0578 01111000
         STH   @12,TIOCNTR(,REG8)                                  0578 01112000
*   IF TIOCNTR<TIOMAX               /* HAS THE INTERRUPT FOR THE   0579 01113000
*                                      RESERVE TAKEN TOO LONG        */ 01114000
*     THEN                                                         0579 01115000
         CH    @12,@CH03022                                        0579 01116000
         BL    @RT00579                                            0579 01117000
*     GO TO TESTIT;                 /* NO - CONTINUE TO TRY TO BRING    01118000
*                                      IN INTERRUPT                  */ 01119000
*   ELSE                                                           0581 01120000
*     ;                             /* YES - FALL INTO HARD WAIT   0581 01121000
*                                      ROUTINE                       */ 01122000
*/***************************************************************  0582 01123000
**       THIS ROUTINE PUTS THE SYSTEM INTO A HARD 043 WAIT STATE   0582 01124000
**       DUE TO SOME FAILURE IN RESERVE PROCESSING FOR AN ACR      0582 01125000
**       I/O RESTART ENTRY.                                        0582 01126000
***************************************************************      */ 01127000
*                                                                  0582 01128000
*HARDWAIT:                                                         0582 01129000
*   ;                                                              0582 01130000
HARDWAIT DS    0H                                                  0583 01131000
*   RFY                                                            0583 01132000
*    (REG0) RSTD;                                                  0583 01133000
*   REG0=FORTY3;                    /* SET HARDWAIT CODE             */ 01134000
         LA    REG0,67                                             0584 01135000
*   CALL WAITRTN;                   /* GO TO WAIT RTN IFACE          */ 01136000
         BAL   @14,WAITRTN                                         0585 01137000
*   GO TO HARDWAIT;                 /* STAY IN HARDWAIT LOOP         */ 01138000
         B     HARDWAIT                                            0586 01139000
*   RFY                                                            0587 01140000
*    (REG0) UNRSTD;                                                0587 01141000
*                                                                  0588 01142000
*/***************************************************************  0588 01143000
**       THIS SECTION HANDLES STATUS TAKEN AS CC1 TO THE SIO FOR   0588 01144000
**       THE RESERVE CCW. IF CHANNEL ERRORS ARE PRESENT THE        0588 01145000
**       HARDWAIT ROUTINE IS ENTERED OTHERWISE THE RESERVE IS      0588 01146000
**       RETRIED.                                                  0588 01147000
***************************************************************      */ 01148000
*                                                                  0588 01149000
*CKSTAT1:                                                          0588 01150000
*   IF(STATUS&ENDSTAT)=ZERO         /* BAD STATUS - OTHER THAN CE DE    01151000
*                                      WLR UC UE                     */ 01152000
*     THEN                                                         0588 01153000
CKSTAT1  SLR   @12,@12                                             0588 01154000
         ICM   @12,3,ENDSTAT                                       0588 01155000
         SLR   @11,@11                                             0588 01156000
         ICM   @11,3,STATUS                                        0588 01157000
         NR    @12,@11                                             0588 01158000
         LTR   @12,@12                                             0588 01159000
         BZ    @RT00588                                            0588 01160000
*     GO TO RESVSIO;                /* STATUS GOOD - RETRY THE     0589 01161000
*                                      RESERVE                       */ 01162000
*   ELSE                                                           0590 01163000
*     GO TO HARDWAIT;               /* BAD STAT WAIT SYSTEM          */ 01164000
         B     HARDWAIT                                            0590 01165000
*/***************************************************************  0591 01166000
**       THIS CODE GETS CONTROL ON CC1 TO THE TIO AFTER THE        0591 01167000
**       RESERVE SIO HAS BEEN ISSUED. IT ASSUMES THAT THE RESERVE  0591 01168000
**       COMPLETED SUCCESSFULLY REGARDLESS OF STATUS AND SETS      0591 01169000
**       UP THE LAST PATH STARTED FIELDS IN THE UCB.               0591 01170000
**       IT ALSO BUILDS AN OFFLINE RESERVE MESSAGE IF THE          0591 01171000
**       RESERVE WAS DONE TO A DEVICE WHICH IS OFFLINE FROM THIS   0591 01172000
**       CPU.                                                      0591 01173000
***************************************************************      */ 01174000
*                                                                  0591 01175000
*CKSTAT:                                                           0591 01176000
*   ;                                                              0591 01177000
CKSTAT   DS    0H                                                  0592 01178000
*   UCBRESVH=ON1;                   /* SET DEV RESERVED              */ 01179000
         LA    @12,512                                             0592 01180000
         ALR   @12,UCBPTR                                          0592 01181000
         OI    UCBRESVH(@12),B'00010000'                           0592 01182000
*   UCBCPU=PHYSCPU(TWO:TWO);        /* RESET CPU RESERVED            */ 01183000
         MVC   UCBCPU(1,@12),PHYSCPU+1                             0593 01184000
*   UCBCHAN=ENT(ENTCNT,ONE:TWO);    /* SET UP LAST PATH              */ 01185000
         L     @11,RSVTBLPT(,REG8)                                 0594 01186000
         L     @06,ENTCNT(,@11)                                    0594 01187000
         SLA   @06,3                                               0594 01188000
         ALR   @11,@06                                             0594 01189000
         MVC   UCBCHAN(2,@12),ENT-8(@11)                           0594 01190000
*   GEN REFS(ENTCNT);                                              0595 01191000
*   RFY                                                            0596 01192000
*    (REG12) RSTD;                                                 0596 01193000
*   IF ROFFLINE(ENTCNT)=ON1         /* IS THIS AN OFFLINE RESERVE    */ 01194000
*     THEN                                                         0597 01195000
         L     @11,RSVTBLPT(,REG8)                                 0597 01196000
         L     @06,ENTCNT(,@11)                                    0597 01197000
         SLA   @06,3                                               0597 01198000
         ALR   @11,@06                                             0597 01199000
         TM    ROFFLINE-8(@11),B'10000000'                         0597 01200000
         BNO   @RF00597                                            0597 01201000
*     DO;                           /* YES - SETUP MESSAGE           */ 01202000
*       REG12=ADDR(MESSBUF);        /* LOAD MESSAGE BUFFER ADDRESS   */ 01203000
         L     REG12,MESSPTR(,REG8)                                0599 01204000
         LA    REG12,MESSBUF(,REG12)                               0599 01205000
*       REG12->MSG005(ONE:LENGTH(MSG005))=IEA005I(ONE:LENGTH(MSG005));  01206000
         MVC   MSG005(65,REG12),IEA005I                            0600 01207000
*                                   /* SET 05I MESSAGE               */ 01208000
*       REG12->DEV5(ONE:THREE)=UCBNAME;/* PUT DEV NAME IN MSG        */ 01209000
         MVC   DEV5(3,REG12),UCBNAME+512(UCBPTR)                   0601 01210000
*       GEN REFS(ENTCNT);                                          0602 01211000
*       REG12->PATH5(ONE:ONE)=ENT(ENTCNT,ONE:ONE);/* SET PATH IN   0603 01212000
*                                      MESSAGE                       */ 01213000
         L     @11,RSVTBLPT(,REG8)                                 0603 01214000
         L     @06,ENTCNT(,@11)                                    0603 01215000
         SLA   @06,3                                               0603 01216000
         ALR   @11,@06                                             0603 01217000
         MVC   PATH5(1,REG12),ENT-8(@11)                           0603 01218000
*       IF REG12->PATH5(ONE:ONE)>NUMERIC9/* IS THIS A CHAN > 9       */ 01219000
*         THEN                                                     0604 01220000
         CLI   PATH5(REG12),X'89'                                  0604 01221000
         BNH   @RF00604                                            0604 01222000
*         REG12->PATH5=(REG12->PATH5-NUMERIC9)|CHARMASK;/* YES - SET    01223000
*                                      CHARACTER                     */ 01224000
         SLR   @11,@11                                             0605 01225000
         IC    @11,PATH5(,REG12)                                   0605 01226000
         SH    @11,@CH03026                                        0605 01227000
         O     @11,@CF03028                                        0605 01228000
         STC   @11,PATH5(,REG12)                                   0605 01229000
*       ELSE                                                       0606 01230000
*         REG12->PATH5=REG12->PATH5|NUMERMSK;/* NO - SET NUMERIC     */ 01231000
         B     @RC00604                                            0606 01232000
@RF00604 OI    PATH5(REG12),X'F0'                                  0606 01233000
*       REG12->CPU5(ONE:ONE)=PHYSCPU(TWO:TWO)|NUMERMSK;/* SET CPU IN    01234000
*                                      MESSAGE SET CPU NO. NUMERIC   */ 01235000
@RC00604 MVC   CPU5(1,REG12),PHYSCPU+1                             0607 01236000
         OI    CPU5(REG12),X'F0'                                   0607 01237000
*       CALL RECORDIT;              /* CALL MSG WRITER               */ 01238000
         BAL   @14,RECORDIT                                        0608 01239000
*     END;                                                         0609 01240000
*   ELSE                                                           0610 01241000
*     ;                                                            0610 01242000
@RF00597 DS    0H                                                  0611 01243000
*   GEN REFS(ENTCNT);                                              0611 01244000
*   ENT(ENTCNT)=ENT(ENTCNT)&&ENT(ENTCNT);/*                  @YM01377   01245000
*                                      RESERVE SUCCESSFUL ZERO THIS     01246000
*                                      ENT                           */ 01247000
         L     @11,RSVTBLPT(,REG8)                                 0612 01248000
         L     @06,ENTCNT(,@11)                                    0612 01249000
         SLA   @06,3                                               0612 01250000
         ALR   @11,@06                                             0612 01251000
         XC    ENT-8(8,@11),ENT-8(@11)                             0612 01252000
*   GO TO UPNXT1;                   /* TRY THE NEXT ENTRY            */ 01253000
         B     UPNXT1                                              0613 01254000
*   RFY                                                            0614 01255000
*    (REG4) UNRSTD;                                                0614 01256000
*                                                                  0615 01257000
*/***************************************************************  0615 01258000
**       THIS SECTION OF CODE RECEIVES CONTROL IF THE PATH ON      0615 01259000
**       WHICH THE RESERVE WAS ATTEMPTED DOES NOT EXIST (CC3).     0615 01260000
**       IF THIS IS A RESERVE OF AN ONLINE DEVICE THE 043 WAIT     0615 01261000
**       IS INVOKED. IF THIS IS AN OFFLINE RESERVE ATTEMPT ALL     0615 01262000
**       POSSIBLE PATHS TO THE DEVICE WILL BE TRIED AND THE WAIT   0615 01263000
**       WILL BE INVOKED ONLY IF ALL PATHS PRESENT CC3.            0615 01264000
***************************************************************      */ 01265000
*                                                                  0615 01266000
*ROFFCK:                                                           0615 01267000
*   IF ROFFLINE(ENTCNT)=OFF1        /* IS THIS AN OFFLINE            */ 01268000
*     THEN                                                         0615 01269000
ROFFCK   L     @11,RSVTBLPT(,REG8)                                 0615 01270000
         L     @06,ENTCNT(,@11)                                    0615 01271000
         SLA   @06,3                                               0615 01272000
         ALR   @11,@06                                             0615 01273000
         TM    ROFFLINE-8(@11),B'10000000'                         0615 01274000
         BZ    @RT00615                                            0615 01275000
*     GO TO HARDWAIT;               /* NO - ERROR - HARDWAIT         */ 01276000
*   ELSE                                                           0617 01277000
*     DO;                           /* YES SEE IF OTHER PATH POSSIBLE*/ 01278000
*       CALL IOSGIFAC;              /* DO PATH MAP                   */ 01279000
         BAL   @14,IOSGIFAC                                        0618 01280000
*IOSGRTN2:                                                         0619 01281000
*       ;                           /* IOSGEN RETURN                 */ 01282000
IOSGRTN2 DS    0H                                                  0620 01283000
*       PATH2=PATH2|HIBIT;          /* SET HI ORDER BIT ON FOR     0620 01284000
*                                      COMPARE                       */ 01285000
         OC    PATH2(2,REG8),@CB03065                              0620 01286000
*       IF ENT(ENTCNT,ONE:TWO)=PATH2/* IS THIS THE SECOND OR ONLY  0621 01287000
*                                      PATH                          */ 01288000
*         THEN                                                     0621 01289000
         L     @11,RSVTBLPT(,REG8)                                 0621 01290000
         L     @06,ENTCNT(,@11)                                    0621 01291000
         SLA   @06,3                                               0621 01292000
         ALR   @06,@11                                             0621 01293000
         CLC   ENT-8(2,@06),PATH2(REG8)                            0621 01294000
         BE    @RT00621                                            0621 01295000
*         GO TO HARDWAIT;           /* YES - THEN HARDWAIT           */ 01296000
*       ELSE                                                       0623 01297000
*         ;                         /* NO - FIRST PATH BAD           */ 01298000
*       ENT(EVAL(ENTCNT),ONE:TWO)=PATH2;/* SET TO TRY SEC PATH       */ 01299000
         L     @06,ENTCNT(,@11)                                    0624 01300000
         SLA   @06,3                                               0624 01301000
         ALR   @11,@06                                             0624 01302000
         MVC   ENT-8(2,@11),PATH2(REG8)                            0624 01303000
*       GO TO RESVIT;               /* GO ATTEMPT TO RESERVE ON    0625 01304000
*                                      SECOND PATH                   */ 01305000
         B     RESVIT                                              0625 01306000
*     END;                                                         0626 01307000
*                                                                  0627 01308000
*/***************************************************************  0627 01309000
**       THE FOLLOWING SECTION GETS CONTROL IF THE CHANNEL         0627 01310000
**       PRESENTS BUSY TO THE RESERVE SIO. IN THIS CASE THE        0627 01311000
**       SYSTEM MUST BE ENABLED TO ALLOW THE CHANNEL TO            0627 01312000
**       INTERRUPT BEFORE THE RESERVE WILL BE ACCEPTED.            0627 01313000
**       I/O RESTART REPLACES THE SYSTEM I/O NEW PSW WITH A PSW    0627 01314000
**       WHICH WILL CAUSE I/O RESTART TO GET CONTROL ON THE        0627 01315000
**       INTERRUPT. IT THEN SELECTIVLY ENABLES THE DESIRED         0627 01316000
**       CHANNEL AND PASSES THE INTERRUPT ON TO THE I/O SLIH       0627 01317000
**       WHEN IT OCCURS. WHEN THE I/O SLIH RETURNS CONTROL         0627 01318000
**       AFTER PROCESSING THE INTERRUPT THE RESERVE IS             0627 01319000
**       RETRIED.                                                  0627 01320000
***************************************************************      */ 01321000
*                                                                  0627 01322000
*CHBSY:                                                            0627 01323000
*   IONEWSAV=FLCINPSW(FIVE:EIGHT);  /* SAVE IO NEW ADDR      @G552PLM*/ 01324000
CHBSY    MVC   IONEWSAV(4,REG8),FLCINPSW+4                         0627 01325000
*   CALL IGFPSAD0;                  /* OBTAIN AUTHORIZATION@G51BPLC  */ 01326000
         L     @15,@CV03195                                        0628 01327000
         BALR  @14,@15                                             0628 01328000
*   GEN REFS(INTEADDR) SETS(FLCINPSW);                             0629 01329000
IECHK6   NOPR  0                       DSS HOOK FOR PSW SWAP            01330000
*                                      NEXT INSTR, IMMEDIATELY AFTER    01331000
*                                      NOPR, MUST BE MVC TO CHANGE I/O  01332000
*                                      NEW PSW. DSS DEPENDENCY.         01333000
         MVC   FLCINPSW+4(4),INTEADDR IECVRSTI IS I/O FLIH    @G552PLM' 01334000
*   CALL IGFPSAE0;                  /* RELSE AUTHORIZATION   @G51BPLC*/ 01335000
         L     @15,@CV03196                                        0630 01336000
         BALR  @14,@15                                             0630 01337000
*   IONEWPSW=ON1;                   /* I/O NEW PSW CHANGED   @YM05487*/ 01338000
         OI    IONEWPSW(REG8),B'00100000'                          0631 01339000
*   GEN CODE;                                                      0632 01340000
         STCTL @02,@02,CNTRLSAV(8)    SAVE THE I/O CNTL REG             01341000
*   TMCTL(ONE:FOUR)=ZERO;           /* ZERO TEMP CNTRL REG           */ 01342000
         SLR   @11,@11                                             0633 01343000
         ST    @11,TMCTL(,REG8)                                    0633 01344000
*   RFY                                                            0634 01345000
*    (REG5) RSTD;                                                  0634 01346000
*   RFY                                                            0635 01347000
*    (REG3) RSTD;                                                  0635 01348000
*   REG3=BIT0WORD;                  /* SET HI ORDER BIT IN 4         */ 01349000
         L     REG3,@CF03077                                       0636 01350000
*   REG5=ENT(ENTCNT,ONE:ONE);       /* SET REG 5 WITH THE BUSY     0637 01351000
*                                      CHANNEL NUMBER                */ 01352000
         L     @11,RSVTBLPT(,REG8)                                 0637 01353000
         L     @06,ENTCNT(,@11)                                    0637 01354000
         SLA   @06,3                                               0637 01355000
         SLR   REG5,REG5                                           0637 01356000
         IC    REG5,ENT-8(@06,@11)                                 0637 01357000
*   GEN( SRL   @03,0(@05)              SHIFT TO PROPER CHANNEL );  0638 01358000
          SRL   @03,0(@05)              SHIFT TO PROPER CHANNEL         01359000
*   TMCTL=REG3;                     /* SET THAT CHANNEL AS ENABLED IN   01360000
*                                      TEMPORARY CONTROL REGISTER    */ 01361000
         ST    REG3,TMCTL(,REG8)                                   0639 01362000
*   RFY                                                            0640 01363000
*    (REG3,                                                        0640 01364000
*     REG5) UNRSTD;                                                0640 01365000
*   GEN CODE(LCTL  @02,@02,TMCTL(8));/* LOAD I/O CONTROL2 REG      0641 01366000
*                                                            @YM05487*/ 01367000
         LCTL  @02,@02,TMCTL(8)                                         01368000
*   CTLREG=ON1;                     /* CONTROL REG CHANGED   @YM05487*/ 01369000
         OI    CTLREG(REG8),B'00001000'                            0642 01370000
*   GEN CODE;                                                      0643 01371000
IOENAB   EQU   X'02'                   ENABLE I/O INTS                  01372000
IODISAB  EQU   X'FD'                   DISABLE I/O INTS                 01373000
REENABLE STOSM SYSMASK(8),IOENAB       ENABLE BUSY CHANNEL              01374000
         STNSM SYSMASK(8),IODISAB      DISABLE SYSTEM FOR I/O           01375000
         B     REENABLE                LOOP ENABLE DISABLE              01376000
*                                                                  0644 01377000
*/***************************************************************  0644 01378000
**       THIS CODE HANDLES THE INTERRUPT RESULTING FROM I/O        0644 01379000
**       RESTART ENABLING THE BUSY CHANNEL BY GOING TO THE         0644 01380000
**       I/O SLIH.                                                 0644 01381000
***************************************************************      */ 01382000
*                                                                  0644 01383000
*INTERRPT:                                                         0644 01384000
*   GEN CODE;                                                      0644 01385000
INTERRPT DS    0H                                                  0644 01386000
         LCTL  @02,@02,CNTRLSAV(8)     RELOAD SAVED CTL REG             01387000
*   CTLREG=OFF1;                    /* CTL REG2 RESTORED     @G552PLM*/ 01388000
         NI    CTLREG(REG8),B'11110111'                            0645 01389000
*   CALL IGFPSAD0;                  /* OBTAIN AUTHORIZATION@G51BPLC  */ 01390000
         L     @15,@CV03195                                        0646 01391000
         BALR  @14,@15                                             0646 01392000
*   GEN REFS(IONEWSAV) SETS(FLCINPSW);                             0647 01393000
IECHK7   NOPR  0                       DSS HOOK FOR PSW SWAP. NEXT      01394000
*                                      INSTR, IMMEDIATELY AFTER NOPR,   01395000
*                                      MUST BE MVC TO CHANGE I/O NEW    01396000
*                                      PSW. DSS DEPENDENCY.             01397000
         MVC   FLCINPSW+4(4),IONEWSAV(REG8)  RESTORE I/O NEW  @G552PLM' 01398000
*   CALL IGFPSAE0;                  /* RELSE AUTHORIZATION   @G51BPLC*/ 01399000
         L     @15,@CV03196                                        0648 01400000
         BALR  @14,@15                                             0648 01401000
*   IONEWPSW=OFF1;                  /* PSW RESTORED          @YM05487*/ 01402000
         NI    IONEWPSW(REG8),B'11011111'                          0649 01403000
*   RFY                                                            0650 01404000
*    (REG5,                                                        0650 01405000
*     REG11,                                                       0650 01406000
*     REG13) RSTD;                  /*                       @YM05487*/ 01407000
*   REG11=RSTIIND;                  /* SET ENVIRONMENT FOR IOS CALL  */ 01408000
         LA    REG11,8                                             0651 01409000
*   REG13=WSACRSTI;                 /* SAVE AREA ADDRESS             */ 01410000
         L     @06,PSALCCAV                                        0652 01411000
         L     @06,LCCACPUS(,@06)                                  0652 01412000
         L     REG13,WSACRSTI(,@06)                                0652 01413000
*   REG5=ADIECINT;                  /* ADDRESS OF I/O SLIH           */ 01414000
         L     REG5,ADIECINT                                       0653 01415000
*   GEN CODE;                                                      0654 01416000
         STM   @00,@15,0(@13)          SAVE REGS                        01417000
         BAL   @04,4(@05)              GO TO I/O SLIH FOR INT           01418000
         LM    @00,@15,0(@13)          RESTORE REGS                     01419000
*   RFY                                                            0655 01420000
*    (REG13) UNRSTD;                                               0655 01421000
*   RFY                                                            0656 01422000
*    (REG11) UNRSTD;                                               0656 01423000
*   RFY                                                            0657 01424000
*    (REG5) UNRSTD;                                                0657 01425000
*   GO TO RESVIT;                   /* RE-ATTEMPT RESERVE            */ 01426000
         B     RESVIT                                              0658 01427000
*   RFY                                                            0659 01428000
*    (REG12) UNRSTD;                                               0659 01429000
*   GEN(TITLE ' IECVRSTI - CLEAR DEVICE SUBROUTINE');              0660 01430000
*                                                                  0660 01431000
         TITLE ' IECVRSTI - CLEAR DEVICE SUBROUTINE'                    01432000
*/***************************************************************  0661 01433000
**       THIS SUBROUTINE IS USED DURING CCH OR MIH CALLS TO        0661 01434000
**       ATTEMPT TO CLEAR A HUNG DEVICE OR SUBCHANNEL. IT          0661 01435000
**       ISSUES A HALT DEVICE (HDV) FOLLOWED BY A CLEAR I/O (CIO)  0661 01436000
**       AND SETS THE NODEVCLR INDICATOR ON IF THE DEVICE FAILS    0661 01437000
**       EITHER OF THESE CLEARING INSTRUCTIONS. THE SETTING OF     0661 01438000
**       NODEVCLR WILL CAUSE THE ERPIB WHICH IS BUILT TO INDICATE  0661 01439000
**       NO RETRY.                                                 0661 01440000
**                                                                 0661 01441000
**       INPUT - INPUT TO THIS ROUTINE CONSISTS OF THE UCB PREFIX  0661 01442000
**                 ADDRESS IN UCBPTR.                              0661 01443000
**                                                                 0661 01444000
**       OUTPUT - OUTPUT FROM THE ROUTINE CONSISTS OF THE          0661 01445000
**                 NODEVCLR BIT BEING SET TO INDICATE THE STATUS   0661 01446000
**                 OF THE DEVICE AND AN ASYNCHRONOUS OPERATOR      0661 01447000
**                 MESSAGE IF THE DEVICE FAILED TO CLEAR.          0661 01448000
***************************************************************      */ 01449000
*/*****  CHANNEL RECONFIGURATION HARDWARE (CRH) SUPPORT **** @Y30CQLF*/ 01450000
*/* THIS SEGMENT CHECKS WHETHER WE ARE PROCESSING A SIO      @Y30CQLF*/ 01451000
*/* ACROSS A CRH CONNECTION WHICH FAILED OR AN INTERRUPT     @Y30CQLF*/ 01452000
*/* FROM A REMOTE CHANNEL ON THE DEAD CPU ACROSS A CRH       @Y30CQLF*/ 01453000
*/* CONNECTION. IF THE CRH CONNECTION IS STILL OUTSTANDING   @Y30CQLF*/ 01454000
*/* DUE TO AN ATTEMPTED SIO,CLEADEV MUST PERFORM THE HDV AND @Y30CQLF*/ 01455000
*/* CLRIO ACROSS THE CRH INTERFACE USING CHANNEL 6 ON THE    @Y30CQLF*/ 01456000
*/* CPU WE ARE RUNNING ON. IF PROCESSING A CRH INTERRUPT,    @Y30CQLF*/ 01457000
*/* WE MUST MAKE THE CRH CONNECTION TO THE REMOTE CHANNEL    @Y30CQLF*/ 01458000
*/* AND USE CHANNEL 6 TO DO THE HDV AND CLRIO.               @Y30CQLF*/ 01459000
*/********************************************************** @Y30CQLF*/ 01460000
*                                                                  0661 01461000
*   RFY                                                            0661 01462000
*    (REG3,                                                        0661 01463000
*     REG4,                                                        0661 01464000
*     REG12,                                                       0661 01465000
*     REG14) RSTD;                  /*                       @Y30CQLF*/ 01466000
*CLEARDEV:                          /*                       @Y30CQLF*/ 01467000
*   REG3=CVTCRCA;                   /* GET POINTER TO CRCA   @Y30CQLF*/ 01468000
CLEARDEV L     @15,CVTPTR                                          0662 01469000
         L     REG3,CVTCRCA(,@15)                                  0662 01470000
*   GEN(LA    UCBPTR,0(UCBPTR));    /* ZERO HIGH ORDER BYTE  @OZ02110*/ 01471000
         LA    UCBPTR,0(UCBPTR)                                         01472000
*   IF(CVTCRCA=ZERO)|               /* CRH NOT ACTIVE ? OR   @Y30CQLF*/ 01473000
*       (UCBPTR=ZERO)|              /* UCBPOINTER = ZERO OR  @OZ02110*/ 01474000
*       (CRCADIAG=OFF1&             /* NO CRH CONNECTION?    @Y30CQLF*/ 01475000
*       UCBIORST=OFF1&              /* NOR CRH INT. ? NOR    @Y30CQLF*/ 01476000
*       CRCACCH=OFF1)               /* CRH CHAN ERRORS ?     @Y30CQLF*/ 01477000
*/********************************************************** @Y30CQLF*/ 01478000
*/*  CLRIO AND HDV MUST BE DONE THRU NORMAL PATH             @Y30CQLF*/ 01479000
*/********************************************************** @Y30CQLF*/ 01480000
*                                                                  0664 01481000
*     THEN                                                         0664 01482000
         SLR   @15,@15                                             0664 01483000
         L     @11,CVTPTR                                          0664 01484000
         C     @15,CVTCRCA(,@11)                                   0664 01485000
         BE    @RT00664                                            0664 01486000
         CR    UCBPTR,@15                                          0664 01487000
         BE    @RT00664                                            0664 01488000
         TM    CRCADIAG(REG3),B'10000000'                          0664 01489000
         BNZ   @RF00664                                            0664 01490000
         TM    UCBIORST+512(UCBPTR),B'10000000'                    0664 01491000
         BNZ   @RF00664                                            0664 01492000
         TM    CRCACCH(REG3),B'00100000'                           0664 01493000
         BNZ   @RF00664                                            0664 01494000
@RT00664 DS    0H                                                  0665 01495000
*     REG4=UCBCHAN;                 /* YES, USE UCB PATH     @Y30CQLF*/ 01496000
         SLR   REG4,REG4                                           0665 01497000
         ICM   REG4,3,UCBCHAN+512(UCBPTR)                          0665 01498000
*/********************************************************** @Y30CQLF*/ 01499000
*/*  CLRIO AND HDV MUST BE DONE THRU CRH CONNECTION          @Y30CQLF*/ 01500000
*/********************************************************** @Y30CQLF*/ 01501000
*                                                                  0666 01502000
*   ELSE                                                           0666 01503000
*     DO;                           /* CRH PROCESSING        @Y30CQLF*/ 01504000
         B     @RC00664                                            0666 01505000
@RF00664 DS    0H                                                  0667 01506000
*       IF CRCADIAG=OFF1            /* NO CRH CONNECTION?    @Y30CQLF*/ 01507000
*         THEN                                                     0667 01508000
         TM    CRCADIAG(REG3),B'10000000'                          0667 01509000
         BNZ   @RF00667                                            0667 01510000
*         IF UCBIORST=ON1           /* BUT CRH INTERRUPT ?   @Y30CQLF*/ 01511000
*             |CRCACCH=ON1          /* OR CRH CHAN. ERRORS   @Y30CQLF*/ 01512000
*           THEN                                                   0668 01513000
         TM    UCBIORST+512(UCBPTR),B'10000000'                    0668 01514000
         BO    @RT00668                                            0668 01515000
         TM    CRCACCH(REG3),B'00100000'                           0668 01516000
         BNO   @RF00668                                            0668 01517000
@RT00668 DS    0H                                                  0669 01518000
*           DO;                     /* YES                   @Y30CQLF*/ 01519000
*                                                                  0669 01520000
*             /*******************************************************/ 01521000
*             /*                                                     */ 01522000
*             /* MAKE CRH CONNECTION *                       @Y30CQLF*/ 01523000
*             /*                                                     */ 01524000
*             /*******************************************************/ 01525000
*                                                                  0670 01526000
*             CRCACHAN=UCBCHAN;     /* SAVE PATH             @Y30CQLF*/ 01527000
         MVC   CRCACHAN(2,REG3),UCBCHAN+512(UCBPTR)                0670 01528000
*             CRCAMCWF=CRCACHAN(1:1);/* SET UP CHANNEL IN MCW      0671 01529000
*                                                            @Y30CQLF*/ 01530000
         MVC   CRCAMCWF(1,REG3),CRCACHAN(REG3)                     0671 01531000
*             CRCAMCWI=ON1;         /* INDICATE CRH MCW      @Y30CQLF*/ 01532000
*             CRCAMCWM=ON1;         /* MAKE CONNECTION       @Y30CQLF*/ 01533000
         OI    CRCAMCWI(REG3),B'00110000'                          0673 01534000
*             CRCADIAG=ON1;         /* CRH CONNECTION        @Y30CQLF*/ 01535000
         OI    CRCADIAG(REG3),B'10000000'                          0674 01536000
*             GEN CODE REFS(CRCA,REG3);                            0675 01537000
                             USING CRCA,REG3                   @Y30CQLF 01538000
                             DC X'8300',S(CRCAMCW)             @Y30CQLF 01539000
                             DROP REG3                         @Y30CQLF 01540000
*           END;                    /*                       @Y30CQLF*/ 01541000
*         ELSE                                                     0677 01542000
*           ;                       /* CAN NOT GET HERE      @Y30CQLF*/ 01543000
@RF00668 DS    0H                                                  0678 01544000
*/********************************************************** @Y30CQLF*/ 01545000
*/*   CRH CONNECTION OUTSTANDING, USE CHANNEL 6              @Y30CQLF*/ 01546000
*/********************************************************** @Y30CQLF*/ 01547000
*                                                                  0678 01548000
*       ELSE                                                       0678 01549000
*         ;                         /* YES,CRH CONNECTION    @Y30CQLF*/ 01550000
@RF00667 DS    0H                                                  0679 01551000
*       REG4=UCBCHAN&OFFCHAN;       /* AND OFF CHANNEL NUM   @Y30CQLF*/ 01552000
         L     REG4,@CF03041                                       0679 01553000
         SLR   @15,@15                                             0679 01554000
         ICM   @15,3,UCBCHAN+512(UCBPTR)                           0679 01555000
         NR    REG4,@15                                            0679 01556000
*       REG4=REG4|CHAN6;            /* USE CHANNEL 6 FOR I/O       0680 01557000
*                                      INSTRUCTIONS          @Y30CQLF*/ 01558000
         O     REG4,@CF03043                                       0680 01559000
*     END;                          /*                       @Y30CQLF*/ 01560000
*                                                                  0682 01561000
*/********************************************************** @Y30CQLF*/ 01562000
*/* PERFORM HDV AND CLRIO. CHECK FOR LOGOUT.                 @Y30CQLF*/ 01563000
*/********************************************************** @Y30CQLF*/ 01564000
*                                                                  0682 01565000
*   NODEVCLR=OFF1;                  /* INITIALIZE DEV CLR SW         */ 01566000
@RC00664 DS    0H                                                  0683 01567000
*   LOGOUT=OFF1;                    /* INITIALIZE LOGOUT SW  @YM04212*/ 01568000
         NI    NODEVCLR(REG8),B'10011111'                          0683 01569000
*   IF UCBPTR=ZERO THEN             /* ZERO UCBPTR ?         @OZ02110*/ 01570000
         LTR   UCBPTR,UCBPTR                                       0684 01571000
         BZ    @RT00684                                            0684 01572000
*     GO TO FCLEAR2;                /* YES SKIP HDV, CLRIO OZ02110   */ 01573000
*   ELSE                                                           0686 01574000
*     ;                                                            0686 01575000
*IECVRST1:                                                         0687 01576000
*   ;                               /* LYLE TEST HOOK                */ 01577000
IECVRST1 DS    0H                                                  0688 01578000
*   GEN(HDV   0(@04)                  ATTEMPT TO HALT DEVICE );    0688 01579000
         HDV   0(@04)                  ATTEMPT TO HALT DEVICE           01580000
*   BC(10,DOCLR);                   /* CC=0 CC=2 ATTEMPT CIO         */ 01581000
         BC    10,DOCLR                                            0689 01582000
*   BC(1,FCLEAR1);                  /* CC=3 SET FAILED CLEAR         */ 01583000
         BC    1,FCLEAR1                                           0690 01584000
*   IF(STATUS&ENDSTAT)=ZERO THEN    /* CC=1 GOOD STATUS ?            */ 01585000
         SLR   @15,@15                                             0691 01586000
         ICM   @15,3,ENDSTAT                                       0691 01587000
         SLR   @11,@11                                             0691 01588000
         ICM   @11,3,STATUS                                        0691 01589000
         NR    @15,@11                                             0691 01590000
         LTR   @15,@15                                             0691 01591000
         BZ    @RT00691                                            0691 01592000
*     GO TO DOCLR;                  /* YES ATTEMPT TO CLEAR          */ 01593000
*   ELSE                                                           0693 01594000
*     IF(CCC=ON1|ICC=ON1|CDC=ON1)&(LOP^=ON1) THEN/* LOGOUT ? @YMO4212*/ 01595000
         TM    CCC,B'00001110'                                     0693 01596000
         BZ    @RF00693                                            0693 01597000
         TM    LOP,B'00000100'                                     0693 01598000
         BO    @RF00693                                            0693 01599000
*       LOGOUT=ON1;                 /* INDICATE LOGOUT       @YM04212*/ 01600000
         OI    LOGOUT(REG8),B'00100000'                            0694 01601000
*     ELSE                                                         0695 01602000
*       ;                                                          0695 01603000
@RF00693 DS    0H                                                  0696 01604000
*FCLEAR1:                                                          0696 01605000
*   NODEVCLR=ON1;                   /* SET DEV FAILED CLEAR          */ 01606000
FCLEAR1  OI    NODEVCLR(REG8),B'01000000'                          0696 01607000
*DOCLR:                                                            0697 01608000
*   ;                               /* CLEAR I/O TO DEV              */ 01609000
DOCLR    DS    0H                                                  0698 01610000
*   GEN(CLRIO 0(@04)                 CLEAR I/O TO DEVICE);         0698 01611000
         CLRIO 0(@04)                 CLEAR I/O TO DEVICE               01612000
*   BC(1,FCLEAR2);                  /* CC=3 DEV FAILED CLEAR         */ 01613000
         BC    1,FCLEAR2                                           0699 01614000
*   BC(10,SINDCK);                  /* CC=0 CC=2 RETURN              */ 01615000
         BC    10,SINDCK                                           0700 01616000
*   IF(STATUS&ENDSTAT)=ZERO THEN    /* CC=1 GOOD STATUS ?            */ 01617000
         SLR   @15,@15                                             0701 01618000
         ICM   @15,3,ENDSTAT                                       0701 01619000
         SLR   @11,@11                                             0701 01620000
         ICM   @11,3,STATUS                                        0701 01621000
         NR    @15,@11                                             0701 01622000
         LTR   @15,@15                                             0701 01623000
         BZ    @RT00701                                            0701 01624000
*     GO TO SINDCK;                 /* YES - RETURN                  */ 01625000
*   ELSE                                                           0703 01626000
*     IF(CCC=ON1|ICC=ON1|CDC=ON1)&(LOP^=ON1) THEN/* LOGOUT ? @YMO4212*/ 01627000
         TM    CCC,B'00001110'                                     0703 01628000
         BZ    @RF00703                                            0703 01629000
         TM    LOP,B'00000100'                                     0703 01630000
         BO    @RF00703                                            0703 01631000
*       LOGOUT=ON1;                 /* INDICATE LOGOUT       @YM04212*/ 01632000
         OI    LOGOUT(REG8),B'00100000'                            0704 01633000
*     ELSE                                                         0705 01634000
*       ;                                                          0705 01635000
@RF00703 DS    0H                                                  0706 01636000
*FCLEAR2:                                                          0706 01637000
*   NODEVCLR=ON1;                   /* SET DEV FAILED CLEAR          */ 01638000
FCLEAR2  OI    NODEVCLR(REG8),B'01000000'                          0706 01639000
*                                                                  0707 01640000
*/********************************************************************* 01641000
** IF A LOGOUT OCCURRED ON THE HDV OR CLRIO, RE-INITIALIZE THE LOGOUT * 01642000
** AREAS TO FOXES FOR CCH.THIS IS A DEPENDENCY CCH HAS ON ANY         * 01643000
** COMPONENT DOING I/O FOR WHICH CCH WILL NOT SEE THE CHANNEL ERRORS. * 01644000
** THIS CODE IS LIFTED FROM MODULE IGFCCHR.                  @YM04212*/ 01645000
*/********************************************************************/ 01646000
*                                                                  0707 01647000
*SINDCK:                                                           0707 01648000
*   IF LOGOUT=ON1                   /* DID LOGOUT OCCUR ?    @YM04212*/ 01649000
*     THEN                                                         0707 01650000
SINDCK   TM    LOGOUT(REG8),B'00100000'                            0707 01651000
         BNO   @RF00707                                            0707 01652000
*     DO;                           /* YES FOX LOGOUT AREAS  @YM04212*/ 01653000
*       IF PCCACPID(9:12)=CPU165|PCCACPID(9:12)=CPU168/* INTEGRATED     01654000
*                                      CHANNEL ?             @YM04212*/ 01655000
*         THEN                                                     0709 01656000
         L     @15,PSAPCCAV                                        0709 01657000
         CLC   PCCACPID+8(4,@15),CPU165                            0709 01658000
         BE    @RT00709                                            0709 01659000
         CLC   PCCACPID+8(4,@15),CPU168                            0709 01660000
         BNE   @RF00709                                            0709 01661000
@RT00709 DS    0H                                                  0710 01662000
*         DO;                       /* YES                   @YM04212*/ 01663000
*           ADDRESS=ADDR(CHANLOG);  /* POINT TO FIXED AREA   @YM04212*/ 01664000
         LA    ADDRESS,CHANLOG                                     0711 01665000
*           COUNT=LENGTH(CHANLOG);  /* GET LENGTH FOR MVC    @YM04212*/ 01666000
         LA    COUNT,24                                            0712 01667000
*         END;                                                     0713 01668000
*       ELSE                                                       0714 01669000
*         DO;                       /* NOT INTEGRATED        @YM04212*/ 01670000
         B     @RC00709                                            0714 01671000
@RF00709 DS    0H                                                  0715 01672000
*           ADDRESS=ADDR(FLCLCL);   /* POINT TO LIMITED AREA@YM04212 */ 01673000
         LA    ADDRESS,FLCLCL                                      0715 01674000
*           COUNT=LENGTH(FLCLCL);   /* GET LENGTH FOR MVC    @YM04212*/ 01675000
         LA    COUNT,4                                             0716 01676000
*         END;                                                     0717 01677000
*       REG12=REG14;                /* SAVE RETURN REG       @G51BPLC*/ 01678000
@RC00709 LR    REG12,REG14                                         0718 01679000
*       RFY                                                        0719 01680000
*        (REG14) UNRSTD;            /*                       @G51BPLC*/ 01681000
*       CALL IGFPSAD0;              /* OBTAIN AUTHORIZATION  @G51BPLC*/ 01682000
         L     @15,@CV03195                                        0720 01683000
         BALR  @14,@15                                             0720 01684000
*       WKAREA1(ONE:ONE)=FOXFOX;    /* MVI FOXES             @YM04212*/ 01685000
         MVI   WKAREA1(ADDRESS),X'FF'                              0721 01686000
*       WKAREA2(TWO:COUNT)=WKAREA1(ONE:COUNT-ONE);/* FORCE MVC OF  0722 01687000
*                                      OVERLAPPED AREA       @YM04212*/ 01688000
         LR    @11,COUNT                                           0722 01689000
         BCTR  @11,0                                               0722 01690000
         BCTR  @11,0                                               0722 01691000
         EX    @11,@SM03347                                        0722 01692000
*       CALL IGFPSAE0;              /* RELEASE AUTHORIZATION @G51BPLC*/ 01693000
         L     @15,@CV03196                                        0723 01694000
         BALR  @14,@15                                             0723 01695000
*       RFY                                                        0724 01696000
*        (REG14) RSTD;              /*                       @G51BPLC*/ 01697000
*       REG14=REG12;                /* RESTORE RETURN REG    @G51BPLC*/ 01698000
         LR    REG14,REG12                                         0725 01699000
*       ADDRESS=PCCAELAD;           /* POINT TO EXTENDED LOGOUT AREA    01700000
*                                                            @G51BPLC*/ 01701000
         L     @15,PSAPCCAV                                        0726 01702000
         L     ADDRESS,PCCAELAD(,@15)                              0726 01703000
*       WKAREA1(ONE:FOUR)=FOXWORD;  /* MVI FOXES             @G51BPLC*/ 01704000
         MVC   WKAREA1(4,ADDRESS),@CB03103                         0727 01705000
*     END;                                                         0728 01706000
*   ELSE                                                           0729 01707000
*     ;                                                            0729 01708000
@RF00707 DS    0H                                                  0730 01709000
*                                                                  0730 01710000
*/****  CHANNEL RECONFIGURATION HARDWARE (CRH) SUPPORT  **** @Y30CQLF*/ 01711000
*/*  IF CRCADIAG WAS OFF (NO CRH CONNECTION OUTSTANDING) AND @Y30CQLF*/ 01712000
*/*  UCBIORST WAS ON (CRH INTERRUPT), THEN I/O RESTART MADE  @Y30CQLF*/ 01713000
*/*  THE CRH CONNECTION AND MUST THEREFORE BREAK THE CRH     @Y30CQLF*/ 01714000
*/*  CONNECTION. IT WOULD BE AN ERROR CONDITION IF I/O       @Y30CQLF*/ 01715000
*/*  RESTART WAS CALLED WITH CRCADIAG ON AND UCBIORST ON     @Y30CQLF*/ 01716000
*/*  BUT IF IT DOES OCCUR I/O RESTART WILL ENSURE THE CRH    @Y30CQLF*/ 01717000
*/*  CONNECTION IS BROKEN.                                   @Y30CQLF*/ 01718000
*/********************************************************** @Y30CQLF*/ 01719000
*                                                                  0730 01720000
*   IF(CVTCRCA^=ZERO)&(UCBPTR^=ZERO)&(UCBIORST=ON1|CRCACCH=ON1)/* I/O   01721000
*                                      RESTRT                @OZ02216   01722000
*                                      MAKE CRH CONNECTION?  @ZM30452*/ 01723000
*     THEN                                                         0730 01724000
         SLR   @15,@15                                             0730 01725000
         L     @11,CVTPTR                                          0730 01726000
         C     @15,CVTCRCA(,@11)                                   0730 01727000
         BE    @RF00730                                            0730 01728000
         CR    UCBPTR,@15                                          0730 01729000
         BE    @RF00730                                            0730 01730000
         TM    UCBIORST+512(UCBPTR),B'10000000'                    0730 01731000
         BO    @RT00730                                            0730 01732000
         TM    CRCACCH(REG3),B'00100000'                           0730 01733000
         BNO   @RF00730                                            0730 01734000
@RT00730 DS    0H                                                  0731 01735000
*     DO;                           /* YES                   @Y30CQLF*/ 01736000
*       CRCAMCWM=OFF1;              /* BREAK CONNECTION      @Y30CQLF*/ 01737000
         NI    CRCAMCWM(REG3),B'11101111'                          0732 01738000
*       GEN CODE REFS(CRCA,REG3);                                  0733 01739000
*                                      /*                    @Y30CQLF*/ 01740000
            USING CRCA,REG3                                  @Y30CQLF   01741000
            DC X'8300',S(CRCAMCW)      ISSUE DIAGNOSE        @Y30CQLF   01742000
            DROP REG3                                        @Y30CQLF   01743000
*       CRCADIAG=OFF1;              /* INDICATE NO CRH CONNECTION  0734 01744000
*                                                            @Y30CQLF*/ 01745000
         NI    CRCADIAG(REG3),B'01111111'                          0734 01746000
*     END;                          /*                       @Y30CQLF*/ 01747000
*                                                                  0736 01748000
*/********************************************************************* 01749000
** IF DEVICE FALIED TO CLEAR, ISSUE MESSAGE IEA003I I/O MALFUNCTION   * 01750000
** ON DEVICE XXX  I/O TERMINATED.                                     * 01751000
**********************************************************************/ 01752000
*                                                                  0736 01753000
*   IF NODEVCLR=ON1&UCBPTR^=ZERO    /* DID THE DEVICE FAIL TO CLEAR ?*/ 01754000
*                                                                  0736 01755000
*   /*****************************************************************/ 01756000
*   /*                                                               */ 01757000
*   /* IF UCBPTR=0 NO MESSAGE                                @OZ02110*/ 01758000
*   /*                                                               */ 01759000
*   /*****************************************************************/ 01760000
*                                                                  0736 01761000
*     THEN                                                         0736 01762000
@RF00730 TM    NODEVCLR(REG8),B'01000000'                          0736 01763000
         BNO   @RF00736                                            0736 01764000
         LTR   UCBPTR,UCBPTR                                       0736 01765000
         BZ    @RF00736                                            0736 01766000
*     DO;                           /* YES - ISSUE MESSAGE           */ 01767000
*       MSG003(ONE:LENGTH(MSG003))=IEA003I(ONE:LENGTH(MSG003));/*  0738 01768000
*                                      INITIALIZE MESSAGE            */ 01769000
         LA    @15,8                                               0738 01770000
         AL    @15,MESSPTR(,REG8)                                  0738 01771000
         MVC   MSG003(62,@15),IEA003I                              0738 01772000
*       DEV3(ONE:THREE)=UCBNAME;    /* SET DEV NAME IN MSG           */ 01773000
         MVC   DEV3(3,@15),UCBNAME+512(UCBPTR)                     0739 01774000
*       REG12=REG14;                /* SAVE RETURN REG               */ 01775000
         LR    REG12,REG14                                         0740 01776000
*       RFY                                                        0741 01777000
*        (REG14) UNRSTD;                                           0741 01778000
*       CALL RECORDIT;              /* CALL RTN TO WRITE AND RECORD     01779000
*                                      MESSAGE                       */ 01780000
         BAL   @14,RECORDIT                                        0742 01781000
*       RFY                                                        0743 01782000
*        (REG14) RSTD;                                             0743 01783000
*       REG14=REG12;                /* RESTORE RETURN REG            */ 01784000
         LR    REG14,REG12                                         0744 01785000
*     END;                                                         0745 01786000
*   ELSE                                                           0746 01787000
*     ;                                                            0746 01788000
@RF00736 DS    0H                                                  0747 01789000
*   GEN CODE;                                                      0747 01790000
         BR   @14                      RETURN TO CALLER                 01791000
*   RFY                                                            0748 01792000
*    (REG3,                                                        0748 01793000
*     REG4,                                                        0748 01794000
*     REG12) UNRSTD;                                               0748 01795000
*   GEN(TITLE ' IECVRSTI - SIGNAL PROCESSOR SUBROUTINE');          0749 01796000
*                                                                  0749 01797000
         TITLE ' IECVRSTI - SIGNAL PROCESSOR SUBROUTINE'                01798000
*/***********************************************************@YM04440*/ 01799000
*/*     THIS SUBROUTINE ISSUES A SIGP INSTRUCTION TO THE     @Y30CQLF*/ 01800000
*/*     FAILING CPU ON AN ACR CALL. IF CRH IS BEIN ACTIVATED @Y30CQLF*/ 01801000
*/*     A CPU RESET WILL BE REQUESTED,OTHERWISE AN INITIAL   @Y30CQLF*/ 01802000
*/*     PROGRAM RESET WILL BE REQUESTED. A CC=3 ON THE       @Y30CQLF*/ 01803000
*/*     SIGP WILL CAUSE A WARNING MESSAGE TO BE ISSUED TO    @YM04440*/ 01804000
*/*     THE OPERATOR WARNING HIM NOT TO TOUCH THE DEAD CPU   @YM04440*/ 01805000
*/*     BECAUSE IT HAS NOT BEEN RESET. THE MESSAGE ALSO      @YM04440*/ 01806000
*/*     EXPLAINS THAT SINCE THE RESET FAILED SOME OF THE I/O @YM04440*/ 01807000
*/*     GEAR MAY NO LONGER BE ACCESSIBLE TO THE LIVE CPU.    @YM04440*/ 01808000
*/*     A CC=1,2 WILL RESULT IN RETRYING THE SIGP A FIXED    @YM04440*/ 01809000
*/*     NUMBER OF TIMES AND THEN ISSUEING THE SAME WARNING   @YM04440*/ 01810000
*/*     MESSAGE. A CC=0 INDICATES THAT THE SIGP WAS DECODED  @YM04440*/ 01811000
*/*     AND THE COMMAND RECOGNIZED BY THE FAILING CPU.       @Y30CQLF*/ 01812000
*/*     A CC=0 DOES NOT MEAN THAT THE SIGP HAS COMPLETED     @Y30CQLF*/ 01813000
*/*     SUCCESSFULLY, AND THIS IS THE MAIN REASON THE CC=3   @YM04440*/ 01814000
*/*     RESULTS IN A WARNING MESSAGE RATHER THAN A WAIT      @YM04440*/ 01815000
*/*     STATE, PLUS THE FACT THAT THE SYSTEM MAY BE ABLE TO  @YM04440*/ 01816000
*/*     CONTINUE.                                            @YM04440*/ 01817000
*/***********************************************************@YM04440*/ 01818000
*                                                                  0750 01819000
*   RFY                                                            0750 01820000
*    (REG0,                                                        0750 01821000
*     REG5,                                                        0750 01822000
*     REG6) RSTD;                   /*                       @YM04440*/ 01823000
*SIGPRTN:                           /*                       @YM04440*/ 01824000
*   REG0=SIGPCNT;                   /* LOAD RETRY COUNT      @YM04440*/ 01825000
SIGPRTN  LA    REG0,100                                            0751 01826000
*   DO WHILE REG0>ZERO;             /* SET UP RETRY LOGIC    @YM04440*/ 01827000
         B     @DE00752                                            0752 01828000
@DL00752 DS    0H                                                  0753 01829000
*     REG6=CPUID;                   /* GET CPUID OF FAILING CPU    0753 01830000
*                                                            @YM04440*/ 01831000
         SLR   REG6,REG6                                           0753 01832000
         IC    REG6,CPUID(,REG8)                                   0753 01833000
*     REG5=ZERO;                    /* ZERO STATUS REG       @YM04440*/ 01834000
         SLR   REG5,REG5                                           0754 01835000
*     IF RESETCPU=ON1               /* CPU RESET REQUEST     @Y30CQLF*/ 01836000
*       THEN                        /*                       @OZ06051*/ 01837000
         TM    RESETCPU(REG8),B'00000100'                          0755 01838000
         BNO   @RF00755                                            0755 01839000
*       DO;                         /*                       @OZ06051*/ 01840000
*         GENERATE CODE;                                           0757 01841000
    SIGP  @05,@06,SIGPSEN        DETERMINE STATE OF CPU        @OZ06051 01842000
    BC    2,SIGPST               CC=2 ISSUE STOP IF BUSY       @OZ06051 01843000
    BC    1,SIGPFAIL             CC=3 ISSUE FAIL MSG IF NOT OP @OZ06051 01844000
*                                CC=0 OR 1                              01845000
         N     @05,SIGPSCKS      CHECK FOR STOP OR CHECK STOP  @OZ06051 01846000
         LTR   @05,@05           STATE.                        @OZ06051 01847000
         BNZ   SIGPOK            ONE OR OTHER, YES RETURN      @OZ06051 01848000
SIGPST SIGP @05,@06,SIGPSTOP     OTHERWISE ISSUE STOP          @OZ06051 01849000
*       END;                                                       0758 01850000
*     ELSE                                                         0759 01851000
*       DO;                         /* TRY IPR RESET         @OZ06051*/ 01852000
         B     @RC00755                                            0759 01853000
@RF00755 DS    0H                                                  0760 01854000
*         GEN CODE(SIGP @05,@06,IPR);/* ISSUE IPR            @OZ06051*/ 01855000
         SIGP @05,@06,IPR                                               01856000
*         BC(EIGHT,SIGPOK);         /* CC=0,RETURN           @OZ06051*/ 01857000
         BC    8,SIGPOK                                            0761 01858000
*         BC(ONE,SIGPFAIL);         /* CC=3,SIGP FAILED      @OZ06051*/ 01859000
         BC    1,SIGPFAIL                                          0762 01860000
*       END;                        /*                       @OZ06051*/ 01861000
*     REG0=REG0-ONE;                /* CC=1 OR 2,RETRY SIGPCNT TIMES    01862000
*                                                            @YM04440*/ 01863000
@RC00755 BCTR  REG0,0                                              0764 01864000
*   END;                                                           0765 01865000
@DE00752 LTR   REG0,REG0                                           0765 01866000
         BP    @DL00752                                            0765 01867000
*   GEN(SIGP @05,@06,CPURESET);     /* CAN'T STOP THE CPU    @OZ06051   01868000
*                                      CATASTROPHIC ERROR    @OZ06051   01869000
*                                      ISSUE CPU RESET       @OZ06051*/ 01870000
*                                                                  0766 01871000
         SIGP @05,@06,CPURESET                                          01872000
*   /*****************************************************************/ 01873000
*   /*                                                               */ 01874000
*   /* IT WILL NOT HELP                                      @OZ06051*/ 01875000
*   /*                                                               */ 01876000
*   /*****************************************************************/ 01877000
*                                                                  0767 01878000
*SIGPFAIL:                                                         0767 01879000
*   IORCC3=ON1;                     /* DON'T ACT CRH, BECAUSE      0767 01880000
*                                                            @OZ06051*/ 01881000
SIGPFAIL OI    IORCC3(REG8),B'00000010'                            0767 01882000
*   MSG969(ONE:LENGTH(MSG969))=IEA969A(ONE:LENGTH(MSG969));/*      0768 01883000
*                                      INITIALIZE MESSAGE    @YM04440*/ 01884000
         L     @15,MESSPTR(,REG8)                                  0768 01885000
         MVC   MSG969+8(79,@15),IEA969A                            0768 01886000
*   RETURNAD=REG14;                 /* SAVE RETURN REG       @YM04440*/ 01887000
         ST    REG14,RETURNAD(,REG8)                               0769 01888000
*   RFY                                                            0770 01889000
*     REG14 UNRSTD;                 /*                       @YM04440*/ 01890000
*   CALL RECORDIT;                  /* ISSUE MESSAGE         @YM04440*/ 01891000
         BAL   @14,RECORDIT                                        0771 01892000
*   RFY                                                            0772 01893000
*     REG14 RSTD;                   /*                       @YM04440*/ 01894000
*   REG14=RETURNAD;                 /* RESTORE RETURN REG    @YM04440*/ 01895000
         L     REG14,RETURNAD(,REG8)                               0773 01896000
*SIGPOK:                                                           0774 01897000
*   GEN CODE( BR  @14);             /* RETURN                @YM04440*/ 01898000
SIGPOK    BR  @14                                                       01899000
*   RFY                                                            0775 01900000
*    (REG5,                                                        0775 01901000
*     REG6) UNRSTD;                                                0775 01902000
*   GEN(TITLE ' IECVRSTI - WAIT STATE SUBROUTINE');                0776 01903000
*                                                                  0776 01904000
         TITLE ' IECVRSTI - WAIT STATE SUBROUTINE'                      01905000
*/***************************************************************  0777 01906000
**       THIS SECTION OF CODE INTERFACES WITH THE SYSTEM STOP      0777 01907000
**       AND RESTART SUBROUTINE. WHEN CALLED DURING ACR            0777 01908000
**       PROCESSING IT WILL ATTEMPT TO PUT ALL CPU'S IN THE MP     0777 01909000
**       CONFIGURATION INTO A WAIT STATE DEFINED BY THE CALLER     0777 01910000
**       THE ROUTINE FIRST ACQUIRES THE RESTART RESOURCE AND       0777 01911000
**       THEN CALLS THE SUBROUTINE. IF THE SUBROUTINE IS UNABLE    0777 01912000
**       TO STOP ALL THE CPU'S THIS ROUTINE WILL PUT THE CPU       0777 01913000
**       ON WHICH IT IS RUNNING INTO THE DESIRED WAIT STATE.       0777 01914000
***************************************************************      */ 01915000
*                                                                  0777 01916000
*   RFY                                                            0777 01917000
*    (REG0,                                                        0777 01918000
*     REG1,                                                        0777 01919000
*     REG4,                                                        0777 01920000
*     REG12,                                                       0777 01921000
*     REG13,                                                       0777 01922000
*     REG14) RSTD;                                                 0777 01923000
*WAITRTN:                                                          0778 01924000
*   ;                               /* INTERFACE TO THE SYS STOP AND    01925000
*                                      RESTART SUBROUTINE            */ 01926000
WAITRTN  DS    0H                                                  0779 01927000
*   RCPU=PSACPULA;                  /* SET CPU ADDRESS FOR         0779 01928000
*                                      ACQUISITION OF THE RESTART  0779 01929000
*                                      RESOURCE                      */ 01930000
         MVC   RCPU(2,REG8),PSACPULA                               0779 01931000
*   RHLDR=IORSCODE;                 /* INSERT I/O RESTART USER ID    */ 01932000
         MVC   RHLDR(2,REG8),IORSCODE                              0780 01933000
*   REG12=REG14;                    /* SAVE RETURN REG               */ 01934000
         LR    REG12,REG14                                         0781 01935000
*RSTRTRSC:                                                         0782 01936000
*   REG4=RSTRTWRD;                  /* LOAD THE RESTART RESOURCE LOCK*/ 01937000
RSTRTRSC L     REG4,RSTRTWRD(,REG8)                                0782 01938000
*   REG13=ZERO;                     /* LOAD UNLOCKED VALUE           */ 01939000
         SLR   REG13,REG13                                         0783 01940000
*   REG1=ADDR(CVTRSTWD);            /* ADDRESS OF RESTART RESOURCE 0784 01941000
*                                      LOCKWORD                      */ 01942000
         L     REG1,CVTPTR                                         0784 01943000
         LA    REG1,CVTRSTWD(,REG1)                                0784 01944000
*   GEN CODE;                                                      0785 01945000
         CS    @13,@04,0(@01)          ATTEMPT TO LOCK RESOURCE         01946000
*   BC(7,LDWAIT);                   /* COMP FAIL LOOP                */ 01947000
         BC    7,LDWAIT                                            0786 01948000
*RSTRTWR1:                                                         0787 01949000
*   ;                               /* SET UP TO RECORD              */ 01950000
RSTRTWR1 DS    0H                                                  0788 01951000
*   IF(REG0=FORTY3)|(REG0=LTCHANCD) /* IF HARD WAIT          @G552PLM*/ 01952000
*     THEN                                                         0788 01953000
         CH    REG0,@CH03158                                       0788 01954000
         BE    @RT00788                                            0788 01955000
         CH    REG0,@CH03070                                       0788 01956000
         BNE   @RF00788                                            0788 01957000
@RT00788 DS    0H                                                  0789 01958000
*     LOGHDR=DEADWAIT;              /* HARD WAIT HEADER      @G552PLM*/ 01959000
         L     @15,MESSPTR(,REG8)                                  0789 01960000
         MVC   LOGHDR+8(4,@15),DEADWAIT                            0789 01961000
*   ELSE                                                           0790 01962000
*     LOGHDR=RESTWAIT;              /* RESTARTABLE HEADER    @G552PLM*/ 01963000
         B     @RC00788                                            0790 01964000
@RF00788 L     @15,MESSPTR(,REG8)                                  0790 01965000
         MVC   LOGHDR+8(4,@15),RESTWAIT                            0790 01966000
*   LOGPTR=ADDR(LOGDA);             /* BEGIN DATA            @G552PLM*/ 01967000
@RC00788 LA    @15,8                                               0791 01968000
         AL    @15,MESSPTR(,REG8)                                  0791 01969000
         LA    @11,LOGDA(,@15)                                     0791 01970000
         ST    @11,LOGPTR(,@15)                                    0791 01971000
*   LOGDA=EIGHTY8;                  /* LEN OF DATA           @G552PLM*/ 01972000
         MVC   LOGDA(4,@15),@CF03167                               0792 01973000
*   LOGWAIT=REG0;                   /* WAIT STATE CODE       @G552PLM*/ 01974000
         ST    REG0,LOGWAIT(,@15)                                  0793 01975000
*   LOGTIME=LOGTIME&&LOGTIME;       /* ZERO TIME             @G552PLM*/ 01976000
         XC    LOGTIME(8,@15),LOGTIME(@15)                         0794 01977000
*   STM(REG0,REG15,LOGREGS);        /* REGISTERS             @G552PLM*/ 01978000
         STM   REG0,REG15,LOGREGS(@15)                             0795 01979000
*   LOGMSC=LOGMSC&&LOGMSC;          /* NO MSC DATA           @G552PLM*/ 01980000
         XC    LOGMSC(12,@15),LOGMSC(@15)                          0796 01981000
*   REG1=ADDR(RSTILOGB);            /* ADDR OF RCD TO RECD   @G552PLM*/ 01982000
         LR    REG1,@15                                            0797 01983000
*   REG13=WSACRSTI;                 /*                       @YM01377   01984000
*                                      LOAD SAVE AREA ADDRESS        */ 01985000
         L     @15,PSALCCAV                                        0798 01986000
         L     @15,LCCACPUS(,@15)                                  0798 01987000
         L     REG13,WSACRSTI(,@15)                                0798 01988000
*   GEN;                                                           0799 01989000
         RECORD TYPE=LOGREC,RCVRY=SETFRR,HEADER=YES,LENGTH=96,         *01990000
               PARMADR=(REG1)                                           01991000
*   REG0=LOGWAIT;                   /* RESTORE REGISTER FOR STOP   0800 01992000
*                                      START CALL            @YM05421*/ 01993000
         L     @15,MESSPTR(,REG8)                                  0800 01994000
         L     REG0,LOGWAIT+8(,@15)                                0800 01995000
*   REG1=ZERO;                      /* SET NO STAT AREA              */ 01996000
         SLR   REG1,REG1                                           0801 01997000
*   IOCRSVTB=BLKCHAIN;              /* LOAD RESVTBL PTR              */ 01998000
         L     @15,IORSIOCM(,REG8)                                 0802 01999000
         MVC   IOCRSVTB(4,@15),BLKCHAIN(REG8)                      0802 02000000
*   RFY                                                            0803 02001000
*    (REG14) UNRSTD;                                               0803 02002000
*   CALL IEESTPRS;                  /* CALL THE STOP AND RESTART   0804 02003000
*                                      SUBROUTINE                    */ 02004000
         L     @11,CVTPTR                                          0804 02005000
         L     @15,CVTSTPRS(,@11)                                  0804 02006000
         BALR  @14,@15                                             0804 02007000
*   RFY                                                            0805 02008000
*    (REG15) RSTD;                                                 0805 02009000
*   CVTRSTWD=ZERO;                  /* UNLOCK RESOURCE               */ 02010000
         SLR   @14,@14                                             0806 02011000
         L     @11,CVTPTR                                          0806 02012000
         ST    @14,CVTRSTWD(,@11)                                  0806 02013000
*   IF REG15^=ZERO                  /* CHECK WAIT RTRN CODE          */ 02014000
*     THEN                                                         0807 02015000
         CR    REG15,@14                                           0807 02016000
         BE    @RF00807                                            0807 02017000
*     DO;                           /* YES - WAIT THIS CPU           */ 02018000
*/*************                                                    0809 02019000
**       THIS SECTION PUTS THIS CPU INTO A WAIT IF SYSTEM STOP     0809 02020000
**       AND RESTART SUBROUTINE IS UNABLE TO STOP THE ENTIRE       0809 02021000
**       CONFIGURATION.                                            0809 02022000
*************                                                        */ 02023000
*                                                                  0809 02024000
*LDWAIT:                                                           0809 02025000
*       ;                                                          0809 02026000
LDWAIT   DS    0H                                                  0810 02027000
*       RSPSW1=FLCRNPSW;            /* SAVE OLD RESTART PSW          */ 02028000
         MVC   RSPSW1(8,REG8),FLCRNPSW                             0810 02029000
*       RSPSW2(FIVE:EIGHT)=REG0;    /* SET DESIRED CODE              */ 02030000
         ST    REG0,RSPSW2+4(,REG8)                                0811 02031000
*       RSPSW2(ONE:FOUR)=WAITPSW;   /* SET FOR WAIT STATE            */ 02032000
         MVC   RSPSW2(4,REG8),WAITPSW                              0812 02033000
*       CALL IGFPSAD0;              /* OBTAIN AUTHORIZATION  @G51BPLC*/ 02034000
         L     @15,@CV03195                                        0813 02035000
         BALR  @14,@15                                             0813 02036000
*       FLCRNPSW(ONE:FOUR)=IORSPSW; /*                       @G552PLM   02037000
*                                      SET UP FIRST HALF OF PSW TO 0814 02038000
*                                      ROUTE CONTROL TO I/O RESTART     02039000
*                                      WHEN RESTART KEY PRESSED      */ 02040000
         MVC   FLCRNPSW(4),IORSPSW                                 0814 02041000
*       FLCRNPSW(FIVE:EIGHT)=ADDR(IORSTKEY);/* SET ADDRESS PORTION   */ 02042000
         LA    @14,IORSTKEY                                        0815 02043000
         ST    @14,FLCRNPSW+4                                      0815 02044000
*       GEN;                                                       0816 02045000
         LPSW  RSPSW2(8)               LOAD WAIT STATE                  02046000
*IORSTKEY:                                                         0817 02047000
*       ;                           /* RESTART ROUTINE               */ 02048000
IORSTKEY DS    0H                                                  0818 02049000
*       FLCRNPSW=RSPSW1;            /* RESTORE RESTART PSW           */ 02050000
         MVC   FLCRNPSW(8),RSPSW1(REG8)                            0818 02051000
*       CALL IGFPSAE0;              /* RELEASE AUTHORIZATION@G51BPLC */ 02052000
         L     @15,@CV03196                                        0819 02053000
         BALR  @14,@15                                             0819 02054000
*     END;                                                         0820 02055000
*   ELSE                                                           0821 02056000
*     ;                                                            0821 02057000
@RF00807 DS    0H                                                  0822 02058000
*   RFY                                                            0822 02059000
*    (REG14) RSTD;                                                 0822 02060000
*   REG14=REG12;                    /* RESTORE RETURN REGISTER       */ 02061000
         LR    REG14,REG12                                         0823 02062000
*   GEN CODE;                                                      0824 02063000
        BR  @14                        RETURN TO CALLER                 02064000
*   RFY                                                            0825 02065000
*    (REG0,                                                        0825 02066000
*     REG1,                                                        0825 02067000
*     REG4,                                                        0825 02068000
*     REG12,                                                       0825 02069000
*     REG13,                                                       0825 02070000
*     REG14,                                                       0825 02071000
*     REG15) UNRSTD;                                               0825 02072000
*   GEN(TITLE ' IECVRSTI - TERMINATION ROUTINE');                  0826 02073000
*                                                                  0826 02074000
         TITLE ' IECVRSTI - TERMINATION ROUTINE'                        02075000
*/***************************************************************  0827 02076000
**       THIS SECTION OF CODE IS THE TERMINATION SEQUENCE OF I/O   0827 02077000
**       RESTART. IT IS CALLED WHEN CONTROL IS TO BE RETURNED TO   0827 02078000
**       THE CALLER OF I/O RESTART (OR IN THE CASE OF CCH TO IOS)  0827 02079000
**       IT FREES ALL WORK AREAS GOTTEN FROM STORAGE MANAGER,      0827 02080000
**       DELETES THE I/O RESTART FRR AND RESTORES REGISTERS        0827 02081000
**       BEFORE RETURNING.                                         0827 02082000
***************************************************************      */ 02083000
*                                                                  0827 02084000
*   RFY                                                            0827 02085000
*    (REG1,                                                        0827 02086000
*     REG11,                                                       0827 02087000
*     REG13,                                                       0827 02088000
*     REG15) RSTD;                                                 0827 02089000
*IORSEND:                                                          0828 02090000
*   ;                                                              0828 02091000
IORSEND  DS    0H                                                  0829 02092000
*   MBLKCHN=BLKCHAIN;               /* PREPARE TO INSERT THE MESSAGE    02093000
*                                      BUFFER IN THE BLOCK CHAIN     */ 02094000
         L     @14,MESSPTR(,REG8)                                  0829 02095000
         MVC   MBLKCHN(4,@14),BLKCHAIN(REG8)                       0829 02096000
*   BLKCHAIN=MESSPTR;               /* INSERT MESSAGE BUFFER IN CHAIN*/ 02097000
         ST    @14,BLKCHAIN(,REG8)                                 0830 02098000
*   REG13=WSACRSTI;                 /*                       @YM01377   02099000
*                                      SAVE AREA ADDRESS             */ 02100000
         L     @14,PSALCCAV                                        0831 02101000
         L     @14,LCCACPUS(,@14)                                  0831 02102000
         L     REG13,WSACRSTI(,@14)                                0831 02103000
*   REG11=FREE160;                  /* SET TO FREE BLOCKS            */ 02104000
         LA    REG11,32                                            0832 02105000
*   REG15=IOCORMGT;                 /* SET ENTRY POINT               */ 02106000
         L     @12,IORSIOCM(,REG8)                                 0833 02107000
         L     REG15,IOCORMGT(,@12)                                0833 02108000
*   REG1=REG8;                      /* LOAD FIRST BLK IN CHAIN TO  0834 02109000
*                                      FREE                          */ 02110000
         LR    REG1,REG8                                           0834 02111000
*   FRRIORWA=0;                     /* IORWORK FREED         @G552PLM*/ 02112000
         SLR   @14,@14                                             0835 02113000
         ST    @14,FRRIORWA(,REG9)                                 0835 02114000
*   GEN CODE;                                                      0836 02115000
         BAL   @14,4(@15)              GO TO STORAGE MGR FREE           02116000
*                                   /* CALL THE FREE BLOCK SECTION OF   02117000
*                                      IOS STORAGE MANAGER           */ 02118000
*   REG13=FRRSAV;                   /* RESET REG 13 TO SAVE AREA     */ 02119000
         L     REG13,FRRSAV(,REG9)                                 0837 02120000
*   IF FRRIOSUP=ON1                 /* DID I TURN ON IOS SUPER BIT 0838 02121000
*                                                            @YM05487*/ 02122000
*     THEN                                                         0838 02123000
         TM    FRRIOSUP(REG9),B'10000000'                          0838 02124000
         BNO   @RF00838                                            0838 02125000
*     DO;                           /* YES I DID IT          @YM05487*/ 02126000
*       PSAIOSUP=OFF1;              /* TURN IT OFF           @YM05487*/ 02127000
         NI    PSAIOSUP,B'01111111'                                0840 02128000
*       FRRIOSUP=OFF1;              /* INDICATE I TURNED IT OFF    0841 02129000
*                                                            @YM05487*/ 02130000
         NI    FRRIOSUP(REG9),B'01111111'                          0841 02131000
*     END;                          /*                       @YM05487*/ 02132000
*   IF FRRLCSRB='1'B THEN           /* IF LOST CHAN PROC     @G552PLM*/ 02133000
@RF00838 TM    FRRLCSRB(REG9),B'01000000'                          0843 02134000
         BNO   @RF00843                                            0843 02135000
*     DO;                           /*                       @G552PLM*/ 02136000
*       RFY                                                        0845 02137000
*         REG14 RSTD;               /*                       @G552PLM*/ 02138000
*       REG14=CVTSRBRT;             /* LOST CHAN RET ADDR    @G552PLM*/ 02139000
         L     @12,CVTPTR                                          0846 02140000
         L     REG14,CVTSRBRT(,@12)                                0846 02141000
*       REG15=4;                    /* IND LOST CHAN RET     @G552PLM*/ 02142000
         LA    REG15,4                                             0847 02143000
*       GEN(STOSM FRRLCSYS(REG9),X'03');/* ENABLE I/O, EXT   @G552PLM*/ 02144000
         STOSM FRRLCSYS(REG9),X'03'                                     02145000
*     END;                          /*                       @G552PLM*/ 02146000
*   ELSE                                                           0850 02147000
*     REG15=0;                      /* IND NOT LOST CHAN     @G552PLM*/ 02148000
         B     @RC00843                                            0850 02149000
@RF00843 SLR   REG15,REG15                                         0850 02150000
*   GEN CODE;                                                      0851 02151000
@RC00843 DS    0H                                                  0851 02152000
         SETFRR D,WRKREGS=(@11,@03)                                     02153000
         LTR   @15,@15                 DET RETURN              @G552PLM 02154000
         BNZ   NORESTOR                IF LOST CHAN DO NOT     @G552PLM 02155000
*                                       RESTORE REGISTERS      @G552PLM 02156000
         LM    @14,@12,0(@13)          RESTORE REGISTERS       @G552PLM 02157000
NORESTOR EQU   *                       LOST CHAN RET TO SRB    @G552PLM 02158000
*                                      DISPATCHER              @G552PLM 02159000
         BR     @14                    RETURN TO CALLER                 02160000
*   RFY                                                            0852 02161000
*    (REG1,                                                        0852 02162000
*     REG11,                                                       0852 02163000
*     REG13,                                                       0852 02164000
*     REG15,                                                       0852 02165000
*     REG14) UNRSTD;                /*                       @G552PLM*/ 02166000
*   GEN(TITLE ' IECVRSTI - IOSGEN INTERFACE SUBROUTINE');          0853 02167000
*                                                                  0853 02168000
         TITLE ' IECVRSTI - IOSGEN INTERFACE SUBROUTINE'                02169000
*/***************************************************************  0854 02170000
**       THIS SUBROUTINE IS THE I/O RESTART INTERFACE TO IOSGEN'S  0854 02171000
**       PATHMAP FACILITY. IT IS CALLED WITH THE UCB ADDRESS AND   0854 02172000
**       OUTPUTS A PATHMAP TABLE IN THE I/O RESTART WORK AREA      0854 02173000
**       WHICH IS THEN USED TO DETERMINE PATH AVAILABILITY.        0854 02174000
***************************************************************      */ 02175000
*                                                                  0854 02176000
*   RFY                                                            0854 02177000
*    (REG4,                                                        0854 02178000
*     REG5,                                                        0854 02179000
*     REG13,                                                       0854 02180000
*     REG14) RSTD;                                                 0854 02181000
*IOSGIFAC:                                                         0855 02182000
*   REG13=WSACRSTI;                 /* RESTART SAVE AREA             */ 02183000
IOSGIFAC L     @15,PSALCCAV                                        0855 02184000
         L     @15,LCCACPUS(,@15)                                  0855 02185000
         L     REG13,WSACRSTI(,@15)                                0855 02186000
*   REG4=UCBPTR+UCBPRELN;           /* SET UP FOR IOSGEN             */ 02187000
         LA    REG4,512                                            0856 02188000
         ALR   REG4,UCBPTR                                         0856 02189000
*   REG5=ADDR(IOSGTABL);            /* PATH TABLE ADDRESS            */ 02190000
         LA    REG5,IOSGTABL(,REG8)                                0857 02191000
*   GEN CODE;                                                      0858 02192000
         IOSGEN MAP,VAR=ONE                                             02193000
*   RFY                                                            0859 02194000
*    (REG4,                                                        0859 02195000
*     REG5,                                                        0859 02196000
*     REG13,                                                       0859 02197000
*     REG14) UNRSTD;                                               0859 02198000
*   GEN(TITLE ' IECVRSTI - ASYNCHRONOUS MESSAGE INTERFACE');       0860 02199000
*                                                                  0860 02200000
         TITLE ' IECVRSTI - ASYNCHRONOUS MESSAGE INTERFACE'             02201000
*/***************************************************************  0861 02202000
**       THIS SUBROUTINE INTERFACES WITH THE SYSTEM ASYNCHRONOUS   0861 02203000
**       RECORDING FACILITY VIA THE RECORD MACRO. THE MESSAGE      0861 02204000
**       BUFFER IS INPUT BY THE CALLER AND RECORDIT TRIES TO       0861 02205000
**       HAVE THE RECORD FUNCTION TRANSFER THIS INFORMATION TO     0861 02206000
**       ITS BUFFERS FOR EVENTUAL RECORDING. IF THE RECORDING      0861 02207000
**       ROUTINE IS UNABLE TO GET BUFFERS I/O RESTART GOES         0861 02208000
**       TO THE STORAGE MANAGER FOR ANOTHER MESSAGE BUFFER         0861 02209000
**       AND GIVES THE CURRENT ONE TO THE RECORD FUNCTION.         0861 02210000
**            NOTE: THESE BUFFERS ARE LOST TO THE STORAGE          0861 02211000
**                 MANAGER IF THIS IS DONE.                        0861 02212000
***************************************************************      */ 02213000
*                                                                  0861 02214000
*   RFY                                                            0861 02215000
*    (REG1,                                                        0861 02216000
*     REG4,                                                        0861 02217000
*     REG11,                                                       0861 02218000
*     REG12,                                                       0861 02219000
*     REG13,                                                       0861 02220000
*     REG14,                                                       0861 02221000
*     REG15) RSTD;                                                 0861 02222000
*RECORDIT:                                                         0862 02223000
*   ;                                                              0862 02224000
RECORDIT DS    0H                                                  0863 02225000
*   REG4=REG14;                     /* SAVE RETURN ADDRESS           */ 02226000
         LR    REG4,REG14                                          0863 02227000
*   REG1=ADDR(MESSBUF);             /* GET MESS BUF ADDR             */ 02228000
         L     REG1,MESSPTR(,REG8)                                 0864 02229000
         LA    REG1,MESSBUF(,REG1)                                 0864 02230000
*   MSGAD=REG1;                     /* SAVE MSG ADDR IN CASE REISSUE    02231000
*                                      NEEDED                        */ 02232000
         ST    REG1,MSGAD(,REG8)                                   0865 02233000
*   REG13=WSACRSTI;                 /* GET SAVE AREA PTR             */ 02234000
         L     @06,PSALCCAV                                        0866 02235000
         L     @06,LCCACPUS(,@06)                                  0866 02236000
         L     REG13,WSACRSTI(,@06)                                0866 02237000
*RCD1:                                                             0867 02238000
*   ;                               /* ISSUE RECORD                  */ 02239000
RCD1     DS    0H                                                  0868 02240000
*   GEN CODE;                                                      0868 02241000
         LH    @11,0(@01)              GET WTO LENGTH                   02242000
         LA    @11,4(@11)              ADD FOR HEADER                   02243000
         RECORD TYPE=WTO,DATAADR=(@01),BUFFER=YES,RCVRY=SETFRR,        *02244000
               LENGTH=(@11)                                             02245000
*   IF REG15=TWELVE                 /* NOT ENOUGH ROOM IN BUFFER?  0869 02246000
*                                                            @YM05483*/ 02247000
*     THEN                                                         0869 02248000
         CH    REG15,@CH01904                                      0869 02249000
         BNE   @RF00869                                            0869 02250000
*     DO;                                                          0870 02251000
*       REG11=GET160;               /* SET TO GET NEW MSG BUFFER     */ 02252000
         L     REG11,@CF03037                                      0871 02253000
*       REG15=IOCORMGT;             /* IOS STORAGE MGR ADDR          */ 02254000
         L     @06,IORSIOCM(,REG8)                                 0872 02255000
         L     REG15,IOCORMGT(,@06)                                0872 02256000
*       CALL SMGRGB;                /* DO A GET BLOCK                */ 02257000
         BALR  @14,@15                                             0873 02258000
*       MESSPTR=REG11;              /* SET NEW MESSAGE BUFF          */ 02259000
         ST    REG11,MESSPTR(,REG8)                                0874 02260000
*       REG11->MSGENT=ONE;          /* SET MSG COUNT TO 1            */ 02261000
         MVC   MSGENT(2,REG11),@CH00039                            0875 02262000
*RCRDIT2:                                                          0876 02263000
*       REG1=MSGAD;                 /* RELOAD MESSAGE PTR AND ISSUE     02264000
*                                      RECORD WITH BUFFER = NO       */ 02265000
RCRDIT2  L     REG1,MSGAD(,REG8)                                   0876 02266000
*       GEN CODE;                                                  0877 02267000
         RECORD TYPE=WTO,DATAADR=(1),BUFFER=NO,RCVRY=SETFRR             02268000
*     END;                                                         0878 02269000
*   ELSE                                                           0879 02270000
*     ;                             /* GO TO RCRDIT2 REMOVED @YM04212*/ 02271000
@RF00869 DS    0H                                                  0880 02272000
*   REG14=REG4;                     /* RESTORE RETURN REG            */ 02273000
         LR    REG14,REG4                                          0880 02274000
*   GEN CODE;                                                      0881 02275000
        BR   @14                       RETURN TO CALLER                 02276000
*   RFY                                                            0882 02277000
*    (REG1,                                                        0882 02278000
*     REG4,                                                        0882 02279000
*     REG11,                                                       0882 02280000
*     REG12,                                                       0882 02281000
*     REG13,                                                       0882 02282000
*     REG14,                                                       0882 02283000
*     REG15) UNRSTD;                                               0882 02284000
*   GEN(TITLE ' IECVRSTI - FRR');   /*                       @G552PLM*/ 02285000
         TITLE ' IECVRSTI - FRR'                                        02286000
*/***********************************************************@YM05487*/ 02287000
*/*     THE FUNCTIONAL RECOVERY ROUTINE FOR I/O RESTART      @YM05487*/ 02288000
*/*     ATTEMPTS TO FREE OR RESTORE ANY SYSTEM RESOURCES     @YM05487*/ 02289000
*/*     WHICH ARE HELD BY I/O RESTART AT THE TIME THE        @YM05487*/ 02290000
*/*     ERROR OCCURRED. THE I/O RESTART FRR PERCOLATES TO    @YM05487*/ 02291000
*/*     THE CALLERS FRR TO INDICATE THAT THE I/O RESTART     @YM05487*/ 02292000
*/*     FUNCTION FAILED.                                     @YM05487*/ 02293000
*/***********************************************************@YM05487*/ 02294000
*/***********************************************************@YM05487*/ 02295000
*/*     ESTABLISH ADDRESSABILITY AND INITIALIZE SDWA         @YM05487*/ 02296000
*/***********************************************************@YM05487*/ 02297000
*                                                                  0884 02298000
*   RFY                                                            0884 02299000
*    (REG1,                                                        0884 02300000
*     REG14,                                                       0884 02301000
*     REG15,                                                       0884 02302000
*     REG4,                                                        0884 02303000
*     REG5,                                                        0884 02304000
*     REG9) RSTD;                   /*                       @YM05487*/ 02305000
*IORFRR:                            /*                       @YM05487*/ 02306000
*   GEN CODE;                                                      0885 02307000
IORFRR   DS    0H                                                  0885 02308000
*                                                         /* @YM05487*/ 02309000
    LR    REG10,REG15                  GET BASE ADDRESS        @YM05487 02310000
         LA    REG15,IORFRR-IECVRSTI    GET 1ST BASE           @OZ06051 02311000
         SR    REG10,REG15              ADDRESSIBILITY         @OZ06051 02312000
         LA    REG2,4094(,REG10)        GET 2ND BASE           @OZ06051 02313000
*   DO;                             /* SETRP RECORD(YES)RC(0)        */ 02314000
*     RESPECIFY                                                    0887 02315000
*      (GPR00P,                                                    0887 02316000
*       GPR01P,                                                    0887 02317000
*       GPR14P,                                                    0887 02318000
*       GPR15P) RSTD;                                              0887 02319000
*     GPR01P->SDWARCDE=0;           /* SAVE RC VALUE                 */ 02320000
         MVI   SDWARCDE(GPR01P),X'00'                              0888 02321000
*     GPR01P->SDWARCRD='1'B;        /* TURN ON RECORD INDICATOR      */ 02322000
         OI    SDWARCRD(GPR01P),B'10000000'                        0889 02323000
*     RESPECIFY                                                    0890 02324000
*      (GPR00P,                                                    0890 02325000
*       GPR01P,                                                    0890 02326000
*       GPR14P,                                                    0890 02327000
*       GPR15P) UNRSTD;                                            0890 02328000
*   END;                            /* REQUEST NO RETRY,THEREFORE  0891 02329000
*                                      PERCOLATE TO NEXT FRR @YM05487*/ 02330000
*   SDWAMODN=MODNAME;               /* MODULE NAME IN SDWA   @YM05487*/ 02331000
         MVC   SDWAMODN(8,REG1),MODNAME                            0892 02332000
*   SDWACSCT=MODNAME;               /* CSECT NAME IN SDWA    @YM05487*/ 02333000
         MVC   SDWACSCT(8,REG1),MODNAME                            0893 02334000
*   SDWAREXN=FRRNAME;               /* FRR NAME IN SDWA      @YM05487*/ 02335000
         MVC   SDWAREXN(8,REG1),FRRNAME                            0894 02336000
*/***********************************************************@YM05487*/ 02337000
*/*     MAKE SURE I/O RESTART DOES NOT HOLD THE RESTART WORD @YM05487*/ 02338000
*/***********************************************************@YM05487*/ 02339000
*                                                                  0895 02340000
*   REG15=ADDR(CVTRSTWD);           /* GET ADDRESS OF RESTART WORD 0895 02341000
*                                                            @YM05487*/ 02342000
         L     REG15,CVTPTR                                        0895 02343000
         LA    REG15,CVTRSTWD(,REG15)                              0895 02344000
*   REG5=ZERO;                      /* LOAD UNLOCKED VALUE   @YM05487*/ 02345000
         SLR   REG5,REG5                                           0896 02346000
*   REG4=ZERO;                      /* CLEAR REGISTER        @YM05487*/ 02347000
         SLR   REG4,REG4                                           0897 02348000
*   REG4=REG4|PSACPULA;             /* GET LOGICAL CPU ID    @YM05487*/ 02349000
         LH    @12,PSACPULA                                        0898 02350000
         OR    REG4,@12                                            0898 02351000
*   GEN CODE(SLL @04,16);           /* PUT IN HIGH END       @YM05487*/ 02352000
         SLL @04,16                                                     02353000
*   REG4=REG4|IORID;                /* OR IN RESTART ID      @YM05487*/ 02354000
         O     REG4,IORID                                          0900 02355000
*   GEN CODE(CS @04,@05,0(@15) );   /* IF I/O RESTART HAS WORD,THIS     02356000
*                                      WILL FREE IT,IF NOT RESTART 0901 02357000
*                                      WORD IS UNCHANGED     @YM05487*/ 02358000
         CS @04,@05,0(@15)                                              02359000
*/***********************************************************@YM05487*/ 02360000
*/*     GET POINTER TO I/O RESTART WORK AREA FROM FRR AREA   @YM05487*/ 02361000
*/***********************************************************@YM05487*/ 02362000
*                                                                  0902 02363000
*   REG9=SDWAPARM;                  /* GET FRR AREA PTR      @YM05487*/ 02364000
         L     REG9,SDWAPARM(,REG1)                                0902 02365000
*   REG8=FRRIORWA;                  /* GET WORK AREA PTR     @YM05487*/ 02366000
         L     REG8,FRRIORWA(,REG9)                                0903 02367000
*/***********************************************************@YM05487*/ 02368000
*/*     IF WORK AREA POINTER IS ZERO,THERE IS NOTHING TO     @YM05487*/ 02369000
*/*     BACK OUT OR FREE,RETURN TO RTM WITH PERCOLATE.       @YM05487*/ 02370000
*/***********************************************************@YM05487*/ 02371000
*                                                                  0904 02372000
*   IF REG8=ZERO THEN               /* IF NO WORK AREA       @G552PLM*/ 02373000
         LTR   REG8,REG8                                           0904 02374000
         BNZ   @RF00904                                            0904 02375000
*     DO;                           /* RETURN TO RTM         @G552PLM*/ 02376000
*       IF FRRIOSUP=ON1 THEN        /* IF WE SET SUPER BIT   @G552PLM*/ 02377000
         TM    FRRIOSUP(REG9),B'10000000'                          0906 02378000
         BNO   @RF00906                                            0906 02379000
*         DO;                       /*                       @G552PLM*/ 02380000
*           PSAIOSUP=OFF1;          /* TURN IT OFF           @G552PLM*/ 02381000
         NI    PSAIOSUP,B'01111111'                                0908 02382000
*           FRRIOSUP=OFF1;          /* IND WE TURNED OFF     @G552PLM*/ 02383000
         NI    FRRIOSUP(REG9),B'01111111'                          0909 02384000
*         END;                      /*                       @G552PLM*/ 02385000
*       ELSE                                                       0911 02386000
*         ;                         /*                       @G552PLM*/ 02387000
@RF00906 DS    0H                                                  0912 02388000
*       GEN CODE(BR    @14);        /* RETURN TO RTM         @G552PLM*/ 02389000
         BR    @14                                                      02390000
*     END;                          /*                       @G552PLM*/ 02391000
*   ELSE                                                           0914 02392000
*     ;                             /*                       @G552PLM*/ 02393000
@RF00904 DS    0H                                                  0915 02394000
*                                                                  0915 02395000
*/***********************************************************@YM05487*/ 02396000
*/*     RELEASE UCBLOCK IF HELD                              @YM05487*/ 02397000
*/***********************************************************@YM05487*/ 02398000
*                                                                  0915 02399000
*   IF LOCKUCB=ON1                  /* UCB LOCK HELD ?       @YM05487*/ 02400000
*     THEN                                                         0915 02401000
         TM    LOCKUCB(REG8),B'10000000'                           0915 02402000
         BNO   @RF00915                                            0915 02403000
*     DO;                           /* YES                   @YM05487*/ 02404000
*       SDWAIUCB=ON1;               /* REQUEST RTM FREE IT   @YM05487*/ 02405000
         OI    SDWAIUCB(REG1),B'10000000'                          0917 02406000
*       SDWAIULW=LOCKADDR;          /* PASS LOCK ADDRESS     @YM05487*/ 02407000
         MVC   SDWAIULW(4,REG1),LOCKADDR(REG8)                     0918 02408000
*       LOCKUCB=OFF1;               /* LOCK NOT HELD         @YM05487*/ 02409000
         NI    LOCKUCB(REG8),B'01111111'                           0919 02410000
*     END;                          /*                       @YM05487*/ 02411000
*/***********************************************************@YM05487*/ 02412000
*/*     RESTORE RESTART NEW PSW IF CHANGED                   @YM05487*/ 02413000
*/***********************************************************@YM05487*/ 02414000
*                                                                  0921 02415000
*   REG5=REG14;                     /* SAVE RETURN REG       @G51BPLC*/ 02416000
@RF00915 LR    REG5,REG14                                          0921 02417000
*   CALL IGFPSAD0;                  /* OBTAIN AUTHORIZATION  @G51BPLC*/ 02418000
         L     @15,@CV03195                                        0922 02419000
         BALR  @14,@15                                             0922 02420000
*   IF FLCRNPSW(FIVE:EIGHT)=RSTKEYAD/* IF RESTART NEW PSW POINTS TO     02421000
*                                      I/O RESTART           @YM05487*/ 02422000
*     THEN                                                         0923 02423000
         CLC   FLCRNPSW+4(4),RSTKEYAD                              0923 02424000
         BNE   @RF00923                                            0923 02425000
*     FLCRNPSW=RSPSW1;              /* THEN RESTORE          @YM05487*/ 02426000
         MVC   FLCRNPSW(8),RSPSW1(REG8)                            0924 02427000
*/***********************************************************@YM05487*/ 02428000
*/*     RESTORE I/O NEW PSW IF CHANGED                       @YM05487*/ 02429000
*/***********************************************************@YM05487*/ 02430000
*                                                                  0925 02431000
*   IF IONEWPSW=ON1                 /* I/O NEW PSW CHANGED   @YM05487*/ 02432000
*     THEN                                                         0925 02433000
@RF00923 TM    IONEWPSW(REG8),B'00100000'                          0925 02434000
         BNO   @RF00925                                            0925 02435000
*     DO;                           /*                       @YM05487*/ 02436000
*       FLCINPSW(FIVE:EIGHT)=IONEWSAV;/* RESTORE IO NEW      @G552PLM*/ 02437000
         MVC   FLCINPSW+4(4),IONEWSAV(REG8)                        0927 02438000
*       IONEWPSW=OFF1;              /* NOT CHANGED           @YM05487*/ 02439000
         NI    IONEWPSW(REG8),B'11011111'                          0928 02440000
*     END;                          /*                       @YM05487*/ 02441000
*   CALL IGFPSAE0;                  /* RELEASE AUTHORIZATION@G51BPLC */ 02442000
@RF00925 L     @15,@CV03196                                        0930 02443000
         BALR  @14,@15                                             0930 02444000
*   REG14=REG5;                     /* RESTORE RETURN REG    @G51BPLC*/ 02445000
         LR    REG14,REG5                                          0931 02446000
*/***********************************************************@YM05487*/ 02447000
*/*     RESTORE SYSTEM CONTROL REGISTER 2 IF CHANGED         @YM05487*/ 02448000
*/***********************************************************@YM05487*/ 02449000
*                                                                  0932 02450000
*   IF CTLREG=ON1                   /* CTL REG2 CHANGED ?    @YM05487*/ 02451000
*     THEN                                                         0932 02452000
         TM    CTLREG(REG8),B'00001000'                            0932 02453000
         BNO   @RF00932                                            0932 02454000
*     DO;                           /*                       @YM05487*/ 02455000
*       GEN CODE( LCTL @02,@02,CNTRLSAV(@08));/* RESTORE     @YM05487*/ 02456000
          LCTL @02,@02,CNTRLSAV(@08)                                    02457000
*       CTLREG=OFF1;                /* FLAG OFF              @YM05487*/ 02458000
         NI    CTLREG(REG8),B'11110111'                            0935 02459000
*     END;                          /*                       @YM05487*/ 02460000
*/***********************************************************@G552PLM*/ 02461000
*/*     IF LOST CHANNEL FOUND A RESERVED DEVICE, LOAD A      @G552PLM*/ 02462000
*/*     DISABLED WAIT STATE                                  @G552PLM*/ 02463000
*/***********************************************************@G552PLM*/ 02464000
*                                                                  0937 02465000
*   SDWAADDR=ADDR(SDWA);            /* IF LOAD WAIT ADDR OF SDWA IN     02466000
*                                      IORWORK               @G552PLM*/ 02467000
@RF00932 ST    REG1,SDWAADDR(,REG8)                                0937 02468000
*   IF FRRLCRSV='1'B THEN           /* IF RESERVED DEVICE    @G552PLM*/ 02469000
         TM    FRRLCRSV(REG9),B'00100000'                          0938 02470000
         BO    @RT00938                                            0938 02471000
*     GO TO LOSTCHWT;               /* LOAD DISABLED WAIT    @G552PLM*/ 02472000
*   IF INDICAT=LOSTCHAN&            /* IF LOST CHAN AND      @G552PLM*/ 02473000
*       FRRLCSRB='0'B THEN          /* SRB STILL RESERVED    @G552PLM*/ 02474000
         CLC   INDICAT(1,REG8),LOSTCHAN                            0940 02475000
         BNE   @RF00940                                            0940 02476000
         TM    FRRLCSRB(REG9),B'01000000'                          0940 02477000
         BNZ   @RF00940                                            0940 02478000
*     PWAEDSRB=0;                   /* UNALLOCATE SRB        @G552PLM*/ 02479000
         L     @12,PWAPTR(,REG8)                                   0941 02480000
         MVI   PWAEDSRB(@12),X'00'                                 0941 02481000
*/***********************************************************@YM05487*/ 02482000
*/*     RETURN WORK AREAS TO STORAGE MANAGER                 @YM05487*/ 02483000
*/***********************************************************@YM05487*/ 02484000
*                                                                  0942 02485000
*   RFY                                                            0942 02486000
*    (REG11,                                                       0942 02487000
*     REG13) RSTD;                                                 0942 02488000
@RF00940 DS    0H                                                  0943 02489000
*   REG5=REG14;                     /* SAVE RETURN REGISTER  @YM05487*/ 02490000
         LR    REG5,REG14                                          0943 02491000
*   REG4=REG1;                      /* SAVE SDWA POINTER     @YM05487*/ 02492000
         LR    REG4,REG1                                           0944 02493000
*   MBLKCHN=BLKCHAIN;               /* GET BLOCK POINTER     @YM05487*/ 02494000
         L     @12,MESSPTR(,REG8)                                  0945 02495000
         MVC   MBLKCHN(4,@12),BLKCHAIN(REG8)                       0945 02496000
*   BLKCHAIN=MESSPTR;               /* PUT BUFFER IN CHAIN   @YM05487*/ 02497000
         ST    @12,BLKCHAIN(,REG8)                                 0946 02498000
*   REG13=WSACRSTI;                 /* POINT TO SAVE AREA    @YM05487*/ 02499000
         L     @06,PSALCCAV                                        0947 02500000
         L     @06,LCCACPUS(,@06)                                  0947 02501000
         L     REG13,WSACRSTI(,@06)                                0947 02502000
*   REG11=FREE160;                  /* SET UP PARAMETER      @YM05487*/ 02503000
         LA    REG11,32                                            0948 02504000
*   REG15=IOCORMGT;                 /* GET ENTRY ADDRESS     @YM05487*/ 02505000
         L     @12,IORSIOCM(,REG8)                                 0949 02506000
         L     REG15,IOCORMGT(,@12)                                0949 02507000
*   REG1=REG8;                      /* POINT TO FIRST BLOCK  @YM05487*/ 02508000
         LR    REG1,REG8                                           0950 02509000
*   GEN CODE(BAL   @14,4(@15));     /* GO TO STORAGE MGR+4   @YM05487*/ 02510000
         BAL   @14,4(@15)                                               02511000
*   RFY                                                            0952 02512000
*    (REG11,                                                       0952 02513000
*     REG13) UNRSTD;                                               0952 02514000
*                                                                  0952 02515000
*/***********************************************************@YM05487*/ 02516000
*/*     TURN OFF IOS SUPER BIT IF I TURNED IT ON             @YM05487*/ 02517000
*/***********************************************************@YM05487*/ 02518000
*                                                                  0953 02519000
*   IF FRRIOSUP=ON1                 /* DID I TURN ON IOS SUPER BIT 0953 02520000
*                                                            @YM05487*/ 02521000
*     THEN                                                         0953 02522000
         TM    FRRIOSUP(REG9),B'10000000'                          0953 02523000
         BNO   @RF00953                                            0953 02524000
*     DO;                           /* YES I DID IT          @YM05487*/ 02525000
*       PSAIOSUP=OFF1;              /* TURN IT OFF           @YM05487*/ 02526000
         NI    PSAIOSUP,B'01111111'                                0955 02527000
*       FRRIOSUP=OFF1;              /* INDICATE I TURNED IT OFF    0956 02528000
*                                                            @YM05487*/ 02529000
         NI    FRRIOSUP(REG9),B'01111111'                          0956 02530000
*     END;                          /*                       @YM05487*/ 02531000
*/***********************************************************@YM05487*/ 02532000
*/*     RETURN TO RTM WITH PERCOLATE REQUEST                 @YM05487*/ 02533000
*/***********************************************************@YM05487*/ 02534000
*                                                                  0958 02535000
*   REG14=REG5;                     /* RESTORE RETURN REG    @YM05487*/ 02536000
@RF00953 LR    REG14,REG5                                          0958 02537000
*   REG1=REG4;                      /* RESTORE SDWA PTR      @YM05487*/ 02538000
         LR    REG1,REG4                                           0959 02539000
*   GEN CODE( BR @14);              /* RETURN TO RTM         @YM05487*/ 02540000
          BR @14                                                        02541000
*   GEN(TITLE ' IECVRSTI - UCB PROCESSOR RTN - UCBACT');/*   @G552PLM*/ 02542000
         TITLE ' IECVRSTI - UCB PROCESSOR RTN - UCBACT'                 02543000
*UCBACT:                                                           0962 02544000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* PROCESS A UCB         @G552PLM*/ 02545000
         B     @PB00002                                            0962 02546000
UCBACT   DS    0H                                                  0963 02547000
*/***************************************************************  0963 02548000
**       THE FOLLOWING CODE  PERFORMS SEVERAL FUNCTIONS.           0963 02549000
**       1) JUSTIFY THE UCB POINTER TO THE PREFIX.                 0963 02550000
**       2) GET THE UCB LOCK.                                      0963 02551000
**       3) DETERMINE (VIA A CALL TO IOSGEN) WHETHER THERE ARE     0963 02552000
**          ANY PATHS LEFT TO THE DEVICE FROM THE GOOD CPU.        0963 02553000
**       4) IF THERE IS A GOOD PATH THAT PATH IS PUT IN THE        0963 02554000
**          RESERVE TABLE FOR TEMP HOLD.                           0963 02555000
**       5) IF THERE ARE NO PATHS THE FIRST PATH TO THE DEVICE     0963 02556000
**          IS PUT IN THE RESERVE TABLE FOR TEMP HOLD. IN          0963 02557000
**          ADDITION THE DEVICE IS MARKED OFFLINE FOR HEIRARCHY    0963 02558000
**          REASONS AND A DESCRIPTIVE MESSAGE IS BUILT.            0963 02559000
***************************************************************      */ 02560000
*                                                                  0963 02561000
*   UCBACTRT=REG14;                 /* SAVE RET ADDR         @G552PLM*/ 02562000
         ST    REG14,UCBACTRT(,REG8)                               0963 02563000
*   PATHAVIL=ON1;                   /* SET PATH AVAILABLE AS INITIAL    02564000
*                                      STATE                         */ 02565000
         OI    PATHAVIL(REG8),B'00010000'                          0964 02566000
*   UCBPTR=UCBPTR-UCBPRELN;         /* JUSTIFY TO UCB PREFIX         */ 02567000
         SH    UCBPTR,@CH03050                                     0965 02568000
*   RFY                                                            0966 02569000
*    (REG11) RSTD;                                                 0966 02570000
*   RFY                                                            0967 02571000
*    (REG14) RSTD;                                                 0967 02572000
*   RFY                                                            0968 02573000
*    (REG13) RSTD;                                                 0968 02574000
*   RFY                                                            0969 02575000
*    (REG12) RSTD;                                                 0969 02576000
*   IF UCBMTPXP=ON1                 /* MULT EXPOSURE DEVICE          */ 02577000
*     THEN                                                         0970 02578000
         LA    @06,512                                             0970 02579000
         ALR   @06,UCBPTR                                          0970 02580000
         TM    UCBMTPXP(@06),B'00001000'                           0970 02581000
         BNO   @RF00970                                            0970 02582000
*     REG11=ADDR(UCBBASE->UCBLOCK); /* YES - LOCK ON BASE            */ 02583000
         L     REG11,UCBBASE(,@06)                                 0971 02584000
         LA    REG11,UCBLOCK(,REG11)                               0971 02585000
*   ELSE                                                           0972 02586000
*     REG11=ADDR(UCBLOCK);          /* NO - LOCK ON UCB              */ 02587000
         B     @RC00970                                            0972 02588000
@RF00970 LA    REG11,UCBLOCK(,UCBPTR)                              0972 02589000
*   LOCKADDR=REG11;                 /* SAVE UCBLOCK ADDR.    @YM05487*/ 02590000
@RC00970 ST    REG11,LOCKADDR(,REG8)                               0973 02591000
*   GEN;                                                           0974 02592000
GLOCK1   SETLOCK   OBTAIN,TYPE=IOSUCB,ADDR=(11),RELATED=(UCB,IECVRSTI(FX02593000
               RLOCK1)),MODE=UNCOND                                     02594000
*   LOCKUCB=ON1;                    /* UCB LOCK HELD         @YM05487*/ 02595000
         OI    LOCKUCB(REG8),B'10000000'                           0975 02596000
*   RFY                                                            0976 02597000
*    (REG11,                                                       0976 02598000
*     REG12) UNRSTD;                                               0976 02599000
*   RFY                                                            0977 02600000
*    (REG4,                                                        0977 02601000
*     REG5) RSTD;                                                  0977 02602000
*   CALL IOSGIFAC;                  /* CALL IOSGEN CODE              */ 02603000
         BAL   @14,IOSGIFAC                                        0978 02604000
*IOSGRTN1:                                                         0979 02605000
*   ;                                                              0979 02606000
*                                                                  0979 02607000
IOSGRTN1 DS    0H                                                  0980 02608000
*/***********************************************************@G552PLM*/ 02609000
*/* DETERMINE IF PATH TO DEVICE IS AVAILABLE                 @G552PLM*/ 02610000
*/*                                                                  */ 02611000
*/* NOTE -                                                           */ 02612000
*/*        THE FLAG UCBIORST HAS TWO MEANINGS.                       */ 02613000
*/*        IT CAN MEAN I/O IS ACTIVE FOR THE DEVICE VIA A CRH        */ 02614000
*/*        CONNECTED CHANNEL ATTACHED TO AN OFFLINE CPU.             */ 02615000
*/*        IT CAN ALSO MEAN THAT A DEVICE IS LOST TO THE SYSTEM (NO  */ 02616000
*/*        PATHS TO THE DEVICE EXIST) AND IOS MUST REJECT ANY        */ 02617000
*/*        REQUESTS FOR THE DEVICE.                                  */ 02618000
*/*                                                                  */ 02619000
*/*        I/O RESTART ACR CALLER - IF UCBIORST IS ON, DEVICE HAS    */ 02620000
*/*        ALREADY BEEN PROCESSED.  IT CANNOT BE ACTIVE.             */ 02621000
*/*                                                                  */ 02622000
*/*        I/O RESTART LOSTCHAN CALLER - DEPENDENT ON CRHCHSW        */ 02623000
*/*                                                                  */ 02624000
*/*          UCBIORST  CRHCHSW                                       */ 02625000
*/*                                                                  */ 02626000
*/*             1         1       I/O RESTART IS PROCESSING A CRH    */ 02627000
*/*                               CONNECTED LOSTCHAN.  DEVICE MAY BE */ 02628000
*/*                               REFERENCED OVER CONNECTION AND     */ 02629000
*/*                               MUST BE PROCESSED.                 */ 02630000
*/*                                                                  */ 02631000
*/*             0         1       I/O RESTART IS PROCESSING A CRH    */ 02632000
*/*                               CONNECTED LOSTCHAN.  DEVICE IS NOT */ 02633000
*/*                               BEING USED OVER CRH CONNECTION AND */ 02634000
*/*                               MUST NOT BE PROCESSED AS IT MAY BE */ 02635000
*/*                               CONNECTED TO THIS CPU.             */ 02636000
*/*                                                                  */ 02637000
*/*             0         0       I/O RESTART IS PROCESSING A LOST   */ 02638000
*/*                               CHANNEL ATTACHED TO THIS CPU.      */ 02639000
*/*                               DEVICE IS NOT ACTIVE OVER A CRH    */ 02640000
*/*                               CONNECTION AND MUST BE PROCESSED.  */ 02641000
*/*                                                                  */ 02642000
*/*             1         0       I/O RESTART IS PROCESSING A LOST   */ 02643000
*/*                               CHANNEL ATTACHED TO THIS CPU.      */ 02644000
*/*                               DEVICE HAS EITHER BEEN PROCESSED   */ 02645000
*/*                               OR IS ACTIVE OVER CRH CONNECTED    */ 02646000
*/*                               CHANNEL.  DEVICE MUST NOT BE       */ 02647000
*/*                               PROCESSED.                         */ 02648000
*/*                                                                  */ 02649000
*/*        IF UCBIORST=CRHCHSW PROCESS DEVICE ELSE BYPASS            */ 02650000
*/*                                                                  */ 02651000
*/***********************************************************@G552PLM*/ 02652000
*                                                                  0980 02653000
*   ENTUCB(ENTCNT)=UCBPTR;          /* UCB ADR IN RSV TAB ENTRY    0980 02654000
*                                                            @G552PLM*/ 02655000
         L     @12,RSVTBLPT(,REG8)                                 0980 02656000
         L     @11,ENTCNT(,@12)                                    0980 02657000
         SLA   @11,3                                               0980 02658000
         ST    UCBPTR,ENTUCB-8(@11,@12)                            0980 02659000
*   IF INDICAT=ACR THEN             /* IF PROCESSING FOR ACR @G552PLM*/ 02660000
         CLI   INDICAT(REG8),X'00'                                 0981 02661000
         BNE   @RF00981                                            0981 02662000
*     DO;                           /* ONLY THIS CPU ONLINE  @G552PLM*/ 02663000
*       IF UCBIORST=ON1 THEN        /* IF UCB ALREADY DONE   @G552PLM*/ 02664000
         TM    UCBIORST+512(UCBPTR),B'10000000'                    0983 02665000
         BO    @RT00983                                            0983 02666000
*         GO TO CKACTV;             /* GO TO CKACTV TO FREE LOCK,  0984 02667000
*                                      DEVICE CANNOT BE ACTIVE       */ 02668000
*       ELSE                                                       0985 02669000
*         ;                                                        0985 02670000
*       ENT(ENTCNT,ONE:TWO)=PATH1;  /* INIT PATH IN RSV TAB  @G552PLM*/ 02671000
         ALR   @12,@11                                             0986 02672000
         MVC   ENT-8(2,@12),PATH1(REG8)                            0986 02673000
*       REG5=PSACPUSA+ONE;          /* INDEX FOR THIS CPU    @G552PLM*/ 02674000
         LA    REG5,1                                              0987 02675000
         AH    REG5,PSACPUSA                                       0987 02676000
*       IF PSTAT1(REG5)=ONLINEG     /* IF PRIMARY PATH AVAIL @G552PLM*/ 02677000
*         THEN                                                     0988 02678000
         LR    @12,REG8                                            0988 02679000
         ALR   @12,REG5                                            0988 02680000
         CLI   PSTAT1-1(@12),X'01'                                 0988 02681000
         BE    @RT00988                                            0988 02682000
*         ;                         /* PATH ADDR ALREADY SET @G552PLM*/ 02683000
*       ELSE                        /*                       @G552PLM*/ 02684000
*         DO;                       /*                       @G552PLM*/ 02685000
*           IF PSTAT2(REG5)=ONLINEG THEN/* IF SECONDARY      @G552PLM*/ 02686000
         LR    @12,REG8                                            0991 02687000
         ALR   @12,REG5                                            0991 02688000
         CLI   PSTAT2-1(@12),X'01'                                 0991 02689000
         BNE   @RF00991                                            0991 02690000
*             ENT(ENTCNT,ONE:TWO)=PATH2;/* SET PATH ADDR     @G552PLM*/ 02691000
         L     @12,RSVTBLPT(,REG8)                                 0992 02692000
         L     @11,ENTCNT(,@12)                                    0992 02693000
         SLA   @11,3                                               0992 02694000
         ALR   @12,@11                                             0992 02695000
         MVC   ENT-8(2,@12),PATH2(REG8)                            0992 02696000
*           ELSE                                                   0993 02697000
*             PATHAVIL=OFF1;        /* NO PATH AVAIL         @G552PLM*/ 02698000
         B     @RC00991                                            0993 02699000
@RF00991 NI    PATHAVIL(REG8),B'11101111'                          0993 02700000
*         END;                      /*                       @G552PLM*/ 02701000
*     END;                          /* END ACR PORTION       @G552PLM*/ 02702000
*   ELSE                            /* PROCESS FOR LOST CHAN @G552PLM*/ 02703000
*     DO;                           /* ALL CPU'S STILL ONLINE      0996 02704000
*                                                            @G552PLM*/ 02705000
*                                                                  0996 02706000
         B     @RC00981                                            0996 02707000
@RF00981 DS    0H                                                  0997 02708000
*       /*************************************************************/ 02709000
*       /*                                                           */ 02710000
*       /* DETERMINE IF DEVICE SHOULD BE PROCESSED.          @G552PLM*/ 02711000
*       /* SEE PREVIOUS BIG BLOCK COMMENT.                   @G552PLM*/ 02712000
*       /*                                                           */ 02713000
*       /*************************************************************/ 02714000
*                                                                  0997 02715000
*       IF(UCBIORST=ON1&CRHCHSW=ON1)|/*                      @G552PLM*/ 02716000
*           (UCBIORST=OFF1&CRHCHSW=OFF1) THEN                      0997 02717000
         TM    UCBIORST+512(UCBPTR),B'10000000'                    0997 02718000
         BNO   @GL00021                                            0997 02719000
         TM    CRHCHSW(REG8),B'01000000'                           0997 02720000
         BO    @RT00997                                            0997 02721000
@GL00021 TM    UCBIORST+512(UCBPTR),B'10000000'                    0997 02722000
         BNZ   @RF00997                                            0997 02723000
         TM    CRHCHSW(REG8),B'01000000'                           0997 02724000
         BNZ   @RF00997                                            0997 02725000
@RT00997 DS    0H                                                  0998 02726000
*         ;                         /*                       @G552PLM*/ 02727000
*       ELSE                                                       0999 02728000
*         GO TO FREELOCK;           /*                       @G552PLM*/ 02729000
*       ENT(ENTCNT,ONE:TWO)=UCBCHAN;/* DEV ADR LAST I/O OPER @G552PLM*/ 02730000
         L     @12,RSVTBLPT(,REG8)                                 1000 02731000
         L     @11,ENTCNT(,@12)                                    1000 02732000
         SLA   @11,3                                               1000 02733000
         ALR   @12,@11                                             1000 02734000
         MVC   ENT-8(2,@12),UCBCHAN+512(UCBPTR)                    1000 02735000
*       IF PSTAT1(ONE)=ONLINEG|     /* IF                    @G552PLM*/ 02736000
*           PSTAT1(TWO)=ONLINEG|    /* ANY                   @G552PLM*/ 02737000
*           PSTAT2(ONE)=ONLINEG|    /* PATH                  @G552PLM*/ 02738000
*           PSTAT2(TWO)=ONLINEG     /* ONLINE                @G552PLM*/ 02739000
*         THEN                                                     1001 02740000
         CLI   PSTAT1(REG8),X'01'                                  1001 02741000
         BE    @RT01001                                            1001 02742000
         CLI   PSTAT1+1(REG8),X'01'                                1001 02743000
         BE    @RT01001                                            1001 02744000
         CLI   PSTAT2(REG8),X'01'                                  1001 02745000
         BE    @RT01001                                            1001 02746000
         CLI   PSTAT2+1(REG8),X'01'                                1001 02747000
         BE    @RT01001                                            1001 02748000
*         ;                         /* DEVICE IS STILL AVAILABE    1002 02749000
*                                                            @G552PLM*/ 02750000
*       ELSE                                                       1003 02751000
*         PATHAVIL=OFF1;            /* DEVICE LOST TO SYSTEM @G552PLM*/ 02752000
         NI    PATHAVIL(REG8),B'11101111'                          1003 02753000
*     END;                          /*                       @G552PLM*/ 02754000
@RT01001 DS    0H                                                  1005 02755000
*   IF PATHAVIL=OFF1 THEN           /* IF NO PATH            @G552PLM*/ 02756000
@RC00981 TM    PATHAVIL(REG8),B'00010000'                          1005 02757000
         BNZ   @RF01005                                            1005 02758000
*     DO;                           /* EXISTS                @G552PLM*/ 02759000
*                                                                  1006 02760000
*       /*************************************************************/ 02761000
*       /*                                                           */ 02762000
*       /* *****************************                     @G552PLM*/ 02763000
*       /* NO PATH TO DEVICE EXISTS.                         @G552PLM*/ 02764000
*       /* FORCE DEVICE OFFLINE AND PUT                      @G552PLM*/ 02765000
*       /* DEVICE ADDR IN MESG IEA004I.                      @G552PLM*/ 02766000
*       /* *****************************                     @G552PLM*/ 02767000
*       /*                                                           */ 02768000
*       /*************************************************************/ 02769000
*                                                                  1007 02770000
*       IF UCBMTPXP=ON1             /* MULT EXP DEV                  */ 02771000
*         THEN                                                     1007 02772000
         LA    @12,512                                             1007 02773000
         ALR   @12,UCBPTR                                          1007 02774000
         TM    UCBMTPXP(@12),B'00001000'                           1007 02775000
         BNO   @RF01007                                            1007 02776000
*         IF UCBBASE^=UCBPTR        /* IS THIS THE BASE              */ 02777000
*           THEN                                                   1008 02778000
         C     UCBPTR,UCBBASE(,@12)                                1008 02779000
         BNE   @RT01008                                            1008 02780000
*           GO TO ADACK;            /* NO DON'T BLD MSG              */ 02781000
*         ELSE                                                     1010 02782000
*           ;                                                      1010 02783000
*       ELSE                                                       1011 02784000
*         ;                                                        1011 02785000
@RF01007 DS    0H                                                  1012 02786000
*       IORONLI=OFF1;               /* SET UCB OFFLINE TO PREVENT  1012 02787000
*                                      ALLOCATION            @G552PLM*/ 02788000
         L     @12,IORONLI+509(,UCBPTR)                            1012 02789000
@GL00027 LR    @11,@12                                             1012 02790000
         N     @11,@CF03351                                        1012 02791000
         CS    @12,@11,IORONLI+509(UCBPTR)                         1012 02792000
         BNE   @GL00027                                            1012 02793000
*       IORVHRSN=ON1;               /* SET HEIRARCHY REASON BIT FOR     02794000
*                                      VARY COMMANDS         @G552PLM*/ 02795000
         L     @12,IORVHRSN+512(,UCBPTR)                           1013 02796000
@GL00028 LR    @11,@12                                             1013 02797000
         O     @11,@CF03354                                        1013 02798000
         CS    @12,@11,IORVHRSN+512(UCBPTR)                        1013 02799000
         BNE   @GL00028                                            1013 02800000
*       IF MSGENT=ONE               /* IS THIS THE FIRST ENTRY IN A     02801000
*                                      MESSAGE                       */ 02802000
*         THEN                                                     1014 02803000
         L     @12,MESSPTR(,REG8)                                  1014 02804000
         LH    @11,MSGENT(,@12)                                    1014 02805000
         CH    @11,@CH00039                                        1014 02806000
         BNE   @RF01014                                            1014 02807000
*         INTMSG(MSGENT,ONE:ONE)=':';/* SET FIRST CHAR ':'           */ 02808000
         SLA   @11,2                                               1015 02809000
         ALR   @12,@11                                             1015 02810000
         MVI   INTMSG+4(@12),C':'                                  1015 02811000
*       ELSE                                                       1016 02812000
*         INTMSG(MSGENT,ONE:ONE)=',';/* SET COMMA ','                */ 02813000
         B     @RC01014                                            1016 02814000
@RF01014 L     @12,MESSPTR(,REG8)                                  1016 02815000
         LH    @11,MSGENT(,@12)                                    1016 02816000
         SLA   @11,2                                               1016 02817000
         ALR   @12,@11                                             1016 02818000
         MVI   INTMSG+4(@12),C','                                  1016 02819000
*       INTMSG(MSGENT,TWO:FOUR)=UCBNAME;/* SET EBCDIC NAME IN MSG    */ 02820000
@RC01014 L     @12,MESSPTR(,REG8)                                  1017 02821000
         LH    @11,MSGENT(,@12)                                    1017 02822000
         LR    @06,@11                                             1017 02823000
         SLA   @06,2                                               1017 02824000
         LA    @03,8                                               1017 02825000
         ALR   @12,@03                                             1017 02826000
         ALR   @12,@06                                             1017 02827000
         MVC   INTMSG-3(3,@12),UCBNAME+512(UCBPTR)                 1017 02828000
*       IF MSGENT=MSGMAX            /* IS MESSAGE BUF FULL           */ 02829000
*         THEN                                                     1018 02830000
         CR    @11,@03                                             1018 02831000
         BNE   @RF01018                                            1018 02832000
*         DO;                                                      1019 02833000
*           CALL RECORDIT;          /* CALL RTN TO PRINT MSG         */ 02834000
         BAL   @14,RECORDIT                                        1020 02835000
*           MSG004(ONE:LENGTH(MSG004))=IEA004I(ONE:LENGTH(MSG004));/*   02836000
*                                      RESET MESSAGE IN BUFF         */ 02837000
         L     @12,MESSPTR(,REG8)                                  1021 02838000
         LA    @11,8                                               1021 02839000
         ALR   @11,@12                                             1021 02840000
         MVC   MSG004(88,@11),IEA004I                              1021 02841000
*           MSG004(TWENTY:FIFTY1)=BLANK1;/* BLANK OUT FIRST CHAR     */ 02842000
         MVI   MSG004+20(@11),C' '                                 1022 02843000
         MVC   MSG004+21(30,@11),MSG004+20(@11)                    1022 02844000
         MVI   MSG004+19(@11),C' '                                 1022 02845000
*           MSGENT=ONE;             /* RESET COUNTER                 */ 02846000
         MVC   MSGENT(2,@12),@CH00039                              1023 02847000
*         END;                                                     1024 02848000
*       ELSE                                                       1025 02849000
*         MSGENT=MSGENT+ONE;        /* UP TO NEXT ENTRY              */ 02850000
         B     @RC01018                                            1025 02851000
@RF01018 L     @12,MESSPTR(,REG8)                                  1025 02852000
         LA    @11,1                                               1025 02853000
         AH    @11,MSGENT(,@12)                                    1025 02854000
         STH   @11,MSGENT(,@12)                                    1025 02855000
*       UCBIORST=ON1;               /* SET UCB FOR RESTART INTERCEPT */ 02856000
@RC01018 OI    UCBIORST+512(UCBPTR),B'10000000'                    1026 02857000
*     END;                                                         1027 02858000
*   RFY                                                            1028 02859000
*    (REG4) UNRSTD;                                                1028 02860000
@RF01005 DS    0H                                                  1029 02861000
*   RFY                                                            1029 02862000
*    (REG5) UNRSTD;                                                1029 02863000
*   RFY                                                            1030 02864000
*    (REG1) RSTD;                                                  1030 02865000
*                                                                  1031 02866000
*/***************************************************************  1031 02867000
**       THIS SECTION OF CODE SETS A STANDARD ERPIB IN THE         1031 02868000
**       PCCA ERPIB. IT THEN CHECKS TO SEE IF THE DEVICE IS        1031 02869000
**       RESERVED TO THE FAILING CPU. IF SO THE TEMPORARY          1031 02870000
**       ENTRY IN THE RESERVE TABLE IS MADE PERMENANT (BY          1031 02871000
**       UPPING THE ENTRY COUNT) AND THE ENTRY IS SET ONLINE       1031 02872000
**       OR OFFLINE AS APPROPRIATE. IF THE RESERVE TABLE IS        1031 02873000
**       FULL AFTER THIS ENTRY A NEW ONE IS ACQUIRED AND           1031 02874000
**       FORMATTED.                                                1031 02875000
***************************************************************      */ 02876000
*                                                                  1031 02877000
*ADACK:                                                            1031 02878000
*   PCCAWERP(FIVE:EIGHT)=ERPIBSTD;  /* SET STANDARD ERPIB            */ 02879000
ADACK    L     @12,PSAPCCAV                                        1031 02880000
         MVC   PCCAWERP+4(4,@12),ERPIBSTD                          1031 02881000
*   PCCACHUB=ADDR(UCBOB);           /* INSERT UCB ADDRESS            */ 02882000
         LA    @11,512                                             1032 02883000
         ALR   @11,UCBPTR                                          1032 02884000
         ST    @11,PCCACHUB(,@12)                                  1032 02885000
*   IF((UCB3DACC=ON1&UCBRR=ON1&UCBRESVH=ON1)&(UCBCPU=CPUID)&(UCBSQC^=   02886000
*       ZERO))                      /* DIRECT ACCESS AND RESERVE   1033 02887000
*                                      RELEASE AND AND RSV ON THE DEV   02888000
*                                      ON FAILING CPU                */ 02889000
*       &((INDICAT=ACR)|(INDICAT=LOSTCHAN&UCBCHA=CHANID))/* CALLER IS   02890000
*                                      ACR OR                @G552PLM   02891000
*                                      RSV WAS ON LOST CH    @G552PLM*/ 02892000
*     THEN                                                         1033 02893000
         TM    UCB3DACC(@11),B'00100000'                           1033 02894000
         BNO   @RF01033                                            1033 02895000
         TM    UCBRR(@11),B'00100000'                              1033 02896000
         BNO   @RF01033                                            1033 02897000
         TM    UCBRESVH(@11),B'00010000'                           1033 02898000
         BNO   @RF01033                                            1033 02899000
         CLC   UCBCPU(1,@11),CPUID(REG8)                           1033 02900000
         BNE   @RF01033                                            1033 02901000
         CLI   UCBSQC(@11),0                                       1033 02902000
         BE    @RF01033                                            1033 02903000
         CLI   INDICAT(REG8),X'00'                                 1033 02904000
         BE    @RT01033                                            1033 02905000
         CLC   INDICAT(1,REG8),LOSTCHAN                            1033 02906000
         BNE   @RF01033                                            1033 02907000
         CLC   UCBCHA(1,@11),CHANID(REG8)                          1033 02908000
         BNE   @RF01033                                            1033 02909000
@RT01033 DS    0H                                                  1034 02910000
*     DO;                           /* YES - SET IN RESV TBL         */ 02911000
*       IF INDICAT=LOSTCHAN         /* IF RSV FROM LOSTCHN   @G552PLM*/ 02912000
*         THEN                                                     1035 02913000
         CLC   INDICAT(1,REG8),LOSTCHAN                            1035 02914000
         BNE   @RF01035                                            1035 02915000
*         FRRLCRSV='1'B;            /* INDICATE RSV FOUND    @G552PLM*/ 02916000
         OI    FRRLCRSV(REG9),B'00100000'                          1036 02917000
*       IF PATHAVIL=OFF1            /* IS THERE A PATH               */ 02918000
*         THEN                                                     1037 02919000
@RF01035 TM    PATHAVIL(REG8),B'00010000'                          1037 02920000
         BNZ   @RF01037                                            1037 02921000
*         DO;                       /* NO SET OFFLINE RESV           */ 02922000
*           PCCACNOR=ON1;           /* SET NO RETRY                  */ 02923000
         L     @12,PSAPCCAV                                        1039 02924000
         OI    PCCACNOR(@12),B'00000001'                           1039 02925000
*           ROFFLINE(ENTCNT)=ON1;   /* SET OFFLINE RESV IND          */ 02926000
         L     @12,RSVTBLPT(,REG8)                                 1040 02927000
         L     @11,ENTCNT(,@12)                                    1040 02928000
         SLA   @11,3                                               1040 02929000
         ALR   @12,@11                                             1040 02930000
         OI    ROFFLINE-8(@12),B'10000000'                         1040 02931000
*         END;                                                     1041 02932000
*       ELSE                                                       1042 02933000
*         ;                                                        1042 02934000
@RF01037 DS    0H                                                  1043 02935000
*       IF ENTCNT=ENTMAX            /* IS THIS RESV TBL FULL         */ 02936000
*         THEN                                                     1043 02937000
         L     @12,RSVTBLPT(,REG8)                                 1043 02938000
         CLC   ENTCNT(4,@12),@CF02947                              1043 02939000
         BNE   @RF01043                                            1043 02940000
*         DO;                       /* YES - GET ANOTHER TBL         */ 02941000
*           RFY                                                    1045 02942000
*            (REG11,                                               1045 02943000
*             REG13,                                               1045 02944000
*             REG15) RSTD;                                         1045 02945000
*           REG13=WSACRSTI;         /* SAVE AREA ADDRESS             */ 02946000
         L     @06,PSALCCAV                                        1046 02947000
         L     @06,LCCACPUS(,@06)                                  1046 02948000
         L     REG13,WSACRSTI(,@06)                                1046 02949000
*           REG15=IOCORMGT;         /* ADDRESS OF STORAGE MANAGER    */ 02950000
         L     @12,IORSIOCM(,REG8)                                 1047 02951000
         L     REG15,IOCORMGT(,@12)                                1047 02952000
*           REG11=GET160;           /* GET 1 160 BYTE BLOCK          */ 02953000
         L     REG11,@CF03037                                      1048 02954000
*           CALL SMGRGB;            /* GO TO STORAGE MANAGER         */ 02955000
         BALR  @14,@15                                             1049 02956000
*           REG11->RSVTBL=REG11->RSVTBL&&REG11->RSVTBL;/* CLEAR NEW     02957000
*                                      TABLE                         */ 02958000
         XC    RSVTBL(160,REG11),RSVTBL(REG11)                     1050 02959000
*           REG11->RCHAIN=BLKCHAIN; /* SET GOTTEN BLOCK TO POINT TO     02960000
*                                      CURRENT TBL                   */ 02961000
         MVC   RCHAIN(4,REG11),BLKCHAIN(REG8)                      1051 02962000
*           BLKCHAIN=REG11;         /* CHAIN NEW FIRST BLK           */ 02963000
         ST    REG11,BLKCHAIN(,REG8)                               1052 02964000
*           RSVTBLPT=REG11;         /* SET NEW BLK AS THE CURRENT  1053 02965000
*                                      RESV TBL                      */ 02966000
         ST    REG11,RSVTBLPT(,REG8)                               1053 02967000
*           RFY                                                    1054 02968000
*            (REG15) UNRSTD;                                       1054 02969000
*           ENTCNT=ONE;             /* RESET ENTRY COUNT             */ 02970000
         L     @15,RSVTBLPT(,REG8)                                 1055 02971000
         MVC   ENTCNT(4,@15),@CF00039                              1055 02972000
*         END;                                                     1056 02973000
*       ELSE                                                       1057 02974000
*         ENTCNT=ENTCNT+ONE;        /* INCREMENT ENT CNT             */ 02975000
         B     @RC01043                                            1057 02976000
@RF01043 L     @15,RSVTBLPT(,REG8)                                 1057 02977000
         LA    @12,1                                               1057 02978000
         AL    @12,ENTCNT(,@15)                                    1057 02979000
         ST    @12,ENTCNT(,@15)                                    1057 02980000
*       UCBRESVH=OFF1;              /*                       @YM01377   02981000
*                                      SET UCB AS NOT RESVD TO     1058 02982000
*                                      PREVENT MULT ENTS             */ 02983000
@RC01043 NI    UCBRESVH+512(UCBPTR),B'11101111'                    1058 02984000
*     END;                                                         1059 02985000
*   ELSE                                                           1060 02986000
*     DO;                           /* SET NO RETRY IF NECES         */ 02987000
         B     @RC01033                                            1060 02988000
@RF01033 DS    0H                                                  1061 02989000
*       IF PATHAVIL=OFF1            /* IS THERE AN ONLINE PATH       */ 02990000
*         THEN                                                     1061 02991000
         TM    PATHAVIL(REG8),B'00010000'                          1061 02992000
         BNZ   @RF01061                                            1061 02993000
*         PCCACNOR=ON1;             /* NO - SET NO RETRY             */ 02994000
         L     @15,PSAPCCAV                                        1062 02995000
         OI    PCCACNOR(@15),B'00000001'                           1062 02996000
*       ELSE                                                       1063 02997000
*         ;                         /* CODE DELETED          @ZA24791*/ 02998000
@RF01061 DS    0H                                                  1064 02999000
*     END;                                                         1064 03000000
*   RFY                                                            1065 03001000
*    (REG1) UNRSTD;                                                1065 03002000
@RC01033 DS    0H                                                  1066 03003000
*                                                                  1066 03004000
*/***************************************************************  1066 03005000
**       THIS SECTION OF CODE CHECKS TO SEE IF THE DEVICE WAS      1066 03006000
**       ACTIVE ON THE FAILING CPU AT THE TIME OF FAILURE. IF IT   1066 03007000
**       WAS THE FOLLOWING ACTIONS ARE PERFORMED:                  1066 03008000
**            1) THE HARDWARE CSW IS SET AS CHANNEL CONTROL        1066 03009000
**                 CHECK/INTERFACE CONTROL CHECK.                  1066 03010000
**            2) THE CPU FAILURE INDICATOR IS SET IN THE PCCA      1066 03011000
**                 ERPIB.                                          1066 03012000
**            3) FREE THE UCB LOCK.                                1066 03013000
**            4) SET THE IOS ENVIRONMENT BITS TO INDICATE A        1066 03014000
**               PSEUDO INTERRUPT.                                 1066 03015000
**            5) GO TO THE I/O SLIH TO PROCESS THE INTERRUPT.      1066 03016000
***************************************************************      */ 03017000
*                                                                  1066 03018000
*CKACTV:                                                           1066 03019000
*   ;                                                              1066 03020000
CKACTV   DS    0H                                                  1067 03021000
*   IF UCBMTPXP=ON1                 /* MULT EXP DEVICE CK            */ 03022000
*     THEN                                                         1067 03023000
         LA    @15,512                                             1067 03024000
         ALR   @15,UCBPTR                                          1067 03025000
         TM    UCBMTPXP(@15),B'00001000'                           1067 03026000
         BNO   @RF01067                                            1067 03027000
*     REG11=ADDR(UCBBASE->UCBLOCK); /* YES - GET BASE LOCK           */ 03028000
         L     REG11,UCBBASE(,@15)                                 1068 03029000
         LA    REG11,UCBLOCK(,REG11)                               1068 03030000
*   ELSE                                                           1069 03031000
*     REG11=ADDR(UCBLOCK);          /* NO - GET UCB LOCK             */ 03032000
         B     @RC01067                                            1069 03033000
@RF01067 LA    REG11,UCBLOCK(,UCBPTR)                              1069 03034000
*   IF((UCBBSY=ON1|UCBPSNS=ON1)&(UCBCPU=CPUID))/* IS THE DEVICE    1070 03035000
*                                      ACTIVE ON THE FAILING CPU     */ 03036000
*       &((INDICAT=ACR)|            /* AND ERR IS ACR OR     @G552PLM*/ 03037000
*       (INDICAT=LOSTCHAN&UCBCHA=CHANID&FRRLCRSV='0'B))/* ERR IS   1070 03038000
*                                      LOSTCHAN WITH LAST I/O OPER ON   03039000
*                                      LOSTCHAN AND NO RESERVES HAVE    03040000
*                                      YET BEEN FOUND. IF RESERVE  1070 03041000
*                                      FOUND DONT WASTE TIME       1070 03042000
*                                      SIMULATING INTERRUPT AS     1070 03043000
*                                      DISABLED WAIT WILL BE LOADED     03044000
*                                      AFTER ALL RESERVES HAVE BEEN     03045000
*                                      FOUND.                @G552PLM*/ 03046000
*     THEN                                                         1070 03047000
@RC01067 LA    @15,512                                             1070 03048000
         ALR   @15,UCBPTR                                          1070 03049000
         TM    UCBBSY(@15),B'10010000'                             1070 03050000
         BZ    @RF01070                                            1070 03051000
         CLC   UCBCPU(1,@15),CPUID(REG8)                           1070 03052000
         BNE   @RF01070                                            1070 03053000
         CLI   INDICAT(REG8),X'00'                                 1070 03054000
         BE    @RT01070                                            1070 03055000
         CLC   INDICAT(1,REG8),LOSTCHAN                            1070 03056000
         BNE   @RF01070                                            1070 03057000
         CLC   UCBCHA(1,@15),CHANID(REG8)                          1070 03058000
         BNE   @RF01070                                            1070 03059000
         TM    FRRLCRSV(REG9),B'00100000'                          1070 03060000
         BNZ   @RF01070                                            1070 03061000
@RT01070 DS    0H                                                  1071 03062000
*     DO;                           /* YES SET CHANNEL ERRS          */ 03063000
*       CALL IGFPSAD0;              /* OBTAIN AUTHORIZATION  @G51BPLG*/ 03064000
         L     @15,@CV03195                                        1072 03065000
         BALR  @14,@15                                             1072 03066000
*       STATUS=CCCICCST;            /* SET CCC ICC IN CSW            */ 03067000
         MVC   STATUS(2),@CB03054                                  1073 03068000
*       RSTIIOAA(TWO:THREE)=UCBCHAN;/* SET INTERRUPT ADDR    @G51BPLC*/ 03069000
         MVC   RSTIIOAA+1(2),UCBCHAN+512(UCBPTR)                   1074 03070000
*       CALL IGFPSAE0;              /* RELEASE AUTHORIZATION @G51BPLC*/ 03071000
         L     @15,@CV03196                                        1075 03072000
         BALR  @14,@15                                             1075 03073000
*       IF INDICAT=ACR THEN         /* IF ACR INDICATE       @G552PLM*/ 03074000
         CLI   INDICAT(REG8),X'00'                                 1076 03075000
         BNE   @RF01076                                            1076 03076000
*         PCCACCPU=ON1;             /* CPU FAIL IN ERPIB     @G552PLM*/ 03077000
         L     @15,PSAPCCAV                                        1077 03078000
         OI    PCCACCPU(@15),B'10000000'                           1077 03079000
*       ELSE                        /* FOR LOSTCHAN IND      @G552PLM*/ 03080000
*         PCCACCHA=ON1;             /* CHAN FAIL IN ERPIB    @G552PLM*/ 03081000
         B     @RC01076                                            1078 03082000
@RF01076 L     @15,PSAPCCAV                                        1078 03083000
         OI    PCCACCHA(@15),B'01000000'                           1078 03084000
*       RFY                                                        1079 03085000
*        (REG5,                                                    1079 03086000
*         REG12,                                                   1079 03087000
*         REG14) RSTD;                                             1079 03088000
@RC01076 DS    0H                                                  1080 03089000
*       GEN;                                                       1080 03090000
         SETLOCK RELEASE,TYPE=IOSUCB,ADDR=(11),RELATED=(UCB,IECVRSTI(GL*03091000
               OCK1)),DISABLED                                 @YM01377 03092000
*       LOCKUCB=OFF1;               /* UCBLOCK NOT HELD      @YM05487*/ 03093000
         NI    LOCKUCB(REG8),B'01111111'                           1081 03094000
*       RFY                                                        1082 03095000
*        (REG12,                                                   1082 03096000
*         REG14) UNRSTD;                                           1082 03097000
*       REG11=RSTIPINT;             /* SET ENVIRONMENT FOR IOS CALL  */ 03098000
         LA    REG11,10                                            1083 03099000
*       REG5=ADIECINT;              /* ADDRESS OF INT HANDLER        */ 03100000
         L     REG5,ADIECINT                                       1084 03101000
*       REG13=WSACRSTI;             /* SAVE AREA ADDRESS             */ 03102000
         L     @06,PSALCCAV                                        1085 03103000
         L     @06,LCCACPUS(,@06)                                  1085 03104000
         L     REG13,WSACRSTI(,@06)                                1085 03105000
*       GEN CODE;                                                  1086 03106000
         STM   @00,@15,0(@13)          SAVE REGS                        03107000
         BAL   @04,4(@05)              HANDLE SIMULATED INT             03108000
         LM    @00,@15,0(@13)          RESTORE REGS                     03109000
*     END;                                                         1087 03110000
*   ELSE                                                           1088 03111000
*     DO;                                                          1088 03112000
         B     @RC01070                                            1088 03113000
@RF01070 DS    0H                                                  1089 03114000
*FREELOCK:                                                         1089 03115000
*       ;                           /* BRANCH HERE IF DEVICE NOT TO     03116000
*                                      BE PROCESSED FOR LOSTCHAN   1089 03117000
*                                                            @G552PLM*/ 03118000
FREELOCK DS    0H                                                  1090 03119000
*       IF UCBMTPXP=ON1 THEN        /* MULTI EXPOSURE DEV    @G552PLM*/ 03120000
         LA    @12,512                                             1090 03121000
         ALR   @12,UCBPTR                                          1090 03122000
         TM    UCBMTPXP(@12),B'00001000'                           1090 03123000
         BNO   @RF01090                                            1090 03124000
*         REG11=ADDR(UCBBASE->UCBLOCK);/* YES-GET BASE LOCK  @G552PLM*/ 03125000
         L     REG11,UCBBASE(,@12)                                 1091 03126000
         LA    REG11,UCBLOCK(,REG11)                               1091 03127000
*       ELSE                                                       1092 03128000
*         REG11=ADDR(UCBLOCK);      /* NO -LOCK THIS UCB     @G552PLM*/ 03129000
         B     @RC01090                                            1092 03130000
@RF01090 LA    REG11,UCBLOCK(,UCBPTR)                              1092 03131000
*       RFY                                                        1093 03132000
*        (REG12,                                                   1093 03133000
*         REG14) RSTD;                                             1093 03134000
@RC01090 DS    0H                                                  1094 03135000
*       GEN;                                                       1094 03136000
         SETLOCK RELEASE,TYPE=IOSUCB,ADDR=(11),RELATED=(UCB,IECVRSTI(GL*03137000
               OCK1)),DISABLED                                 @YM01377 03138000
*       RFY                                                        1095 03139000
*        (REG5,                                                    1095 03140000
*         REG11,                                                   1095 03141000
*         REG12,                                                   1095 03142000
*         REG13,                                                   1095 03143000
*         REG14) UNRSTD;                                           1095 03144000
*       LOCKUCB=OFF1;               /* UCBLOCK NOT HELD      @YM05487*/ 03145000
         NI    LOCKUCB(REG8),B'01111111'                           1096 03146000
*     END;                                                         1097 03147000
*   PCCAWERP(ONE:EIGHT)=PCCAWERP&&PCCAWERP;/* ZERO THE PCCA ERPIB    */ 03148000
@RC01070 L     @12,PSAPCCAV                                        1098 03149000
         XC    PCCAWERP(8,@12),PCCAWERP(@12)                       1098 03150000
*   RFY                                                            1099 03151000
*     REG14 RSTD;                   /*                       @G552PLM*/ 03152000
*   REG14=UCBACTRT;                 /* RESTORE RET ADDR      @G552PLM*/ 03153000
         L     REG14,UCBACTRT(,REG8)                               1100 03154000
*   RFY                                                            1101 03155000
*     REG14 UNRSTD;                 /*                       @G552PLM*/ 03156000
*   END UCBACT;                     /*                       @G552PLM*/ 03157000
@EL00002 DS    0H                                                  1102 03158000
@EF00002 DS    0H                                                  1102 03159000
@ER00002 BR    @14                                                 1102 03160000
@PB00002 DS    0H                                                  1102 03161000
*   GEN(TITLE ' IECVRSTI - MESSAGES');                             1103 03162000
*                                                                  1103 03163000
         TITLE ' IECVRSTI - MESSAGES'                                   03164000
*/***************************************************************  1104 03165000
**       THE FOLLOWING MESSAGES ARE ISSUED ASYNCHRONOUSLY BY       1104 03166000
**       I/O RESTART TO INFORM THE OPERATOR OF ACTIONS TAKEN       1104 03167000
**       BY I/O RESTART IN ITS RECOVERY EFFORT.                    1104 03168000
***************************************************************      */ 03169000
*                                                                  1104 03170000
*   GEN;                                                           1104 03171000
         DS     0F                                                      03172000
ASMDATE  DC     CL8'&SYSDATE'                                           03173000
IEA003I  WTO   'IEA003I I/O MALFUNCTION ON DEVICE XXX. I/O TERMINATED.'X03174000
               ,ROUTCDE=(1,10),DESC=(4),MF=L                            03175000
IEA004I  WTO   'IEA004I DEVICE 11112222333344445555666677778888 SET FORX03176000
                I/O REQUEST TERMINATION.',ROUTCDE=(1,10),DESC=(4),MF=L  03177000
IEA005I  WTO   'IEA005I DEVICE XXX RESERVED ON OFFLINE PATH Y FROM CPU *03178000
               Z.',ROUTCDE=(1,10),DESC=(4),MF=L                         03179000
IEA969A  WTO   'IEA969A WARNING - SIGP FAILED DURING ACR PROCESSING.',RX03180000
               OUTCDE=(1,10),DESC=(4),MF=L                              03181000
IEA410I  WTO   'IEA410I CHANNEL (X,Y) FORCED OFFLINE',                 X03182000
               ROUTCDE=(1,10),DESC=(4),MF=L                    @G552PLM 03183000
*                                                              @YM04440 03184000
SIGPSCKS DC    X'00000050'         SENSE FOR STOP OR CK STOP   @ZA06051 03185000
IPR      EQU   X'07'          IPRCODE FOR SIGP                 @YM04440 03186000
CPURESET EQU   X'0C'          CPU RESET CODE FOR SIGP          @Y30CQLF 03187000
SIGPSTOP EQU   X'05'               SIGP STOP ORDER             @ZA06051 03188000
SIGPSEN  EQU   X'01'               SENSE ORDER                 @ZA06051 03189000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 03190000
*     GPR00P PTR(31) REG(0),                                       1105 03191000
*     GPR01P PTR(31) REG(1),                                       1105 03192000
*     GPR14P PTR(31) REG(14),                                      1105 03193000
*     GPR15P PTR(31) REG(15);                                      1105 03194000
*   DECLARE                         /* COMMON VARIABLES              */ 03195000
*     I256C CHAR(256) BASED,                                       1106 03196000
*     I031F FIXED(31) BASED,                                       1106 03197000
*     I031P PTR(31) BASED,                                         1106 03198000
*     I015F FIXED(15) BASED,                                       1106 03199000
*     I015P PTR(15) BASED,                                         1106 03200000
*     I008P PTR(8) BASED,                                          1106 03201000
*     I001C CHAR(1) BASED;                                         1106 03202000
*   END IECVRSTI                                                   1107 03203000
*                                                                  1107 03204000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 03205000
*/*%INCLUDE SYSLIB  (IECDCRCA)                                       */ 03206000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 03207000
*/*%INCLUDE SYSLIB  (IEZSSC  )                                       */ 03208000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 03209000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 03210000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 03211000
*/*%INCLUDE SYSLIB  (IECDIOQ )                                       */ 03212000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 03213000
*/*%INCLUDE SYSLIB  (IECDIOCM)                                       */ 03214000
*/*%INCLUDE SYSLIB  (IECDIOCX)                                       */ 03215000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 03216000
*/*%INCLUDE SYSLIB  (IHALCCA )                                       */ 03217000
*/*%INCLUDE SYSLIB  (IHAPCCA )                                       */ 03218000
*/*%INCLUDE SYSLIB  (IECDIRT )                                       */ 03219000
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                       */ 03220000
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */ 03221000
*/*%INCLUDE SYSLIB  (IHACSD  )                                       */ 03222000
*/*%INCLUDE SYSLIB  (IECDCAT )                                       */ 03223000
*/*%INCLUDE SYSLIB  (IECDLCH )                                       */ 03224000
*/*%INCLUDE SYSLIB  (IGFPWA  )                                       */ 03225000
*                                                                  1107 03226000
*       ;                                                          1107 03227000
@DATA    DS    0H                                                       03228000
@CH00036 DC    H'4'                                                     03229000
@CH03145 DC    H'9'                                                     03230000
@CH01904 DC    H'12'                                                    03231000
@CH00787 DC    H'16'                                                    03232000
@CH01699 DC    H'20'                                                    03233000
@CH03022 DC    H'25'                                                    03234000
@CH03158 DC    H'67'                                                    03235000
@CH03050 DC    XL2'0200'                                                03236000
@CH03070 DC    XL2'0049'                                                03237000
@CH03026 DC    XL2'89'                                                  03238000
@SM03347 MVC   WKAREA2+1(0,WKPTR1),WKAREA1(ADDRESS)                     03239000
@DATD    DSECT                                                          03240000
         DS    0F                                                       03241000
IECVRSTI CSECT                                                          03242000
         DS    0F                                                       03243000
@CF00039 DC    F'1'                                                     03244000
@CH00039 EQU   @CF00039+2                                               03245000
@CF02947 DC    F'19'                                                    03246000
@CF03167 DC    F'88'                                                    03247000
@CF03037 DC    XL4'10000020'                                            03248000
@CF03039 DC    XL4'20000020'                                            03249000
@CF03043 DC    XL4'00000600'                                            03250000
@CF03077 DC    XL4'80000000'                                            03251000
@CF03012 DC    XL4'FFFF'                                                03252000
@CF03041 DC    XL4'F0FF'                                                03253000
@CF03028 DC    XL4'C0'                                                  03254000
@CF03351 DC    BL4'11111111111111111111111101111111'                    03255000
@CF03354 DC    BL4'00000010000000000000000000000000'                    03256000
@DATD    DSECT                                                          03257000
         DS    0D                                                       03258000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                03259000
@ENDDATD EQU   *                                                        03260000
IECVRSTI CSECT                                                          03261000
         DS    0F                                                       03262000
@SIZDATD DC    AL1(0)                                                   03263000
         DC    AL3(@ENDDATD-@DATD)                                      03264000
@CV03190 DC    V(IECINT)                                                03265000
@CV03191 DC    V(IEAMASCB)                                              03266000
@CV03195 DC    V(IGFPSAD0)                                              03267000
@CV03196 DC    V(IGFPSAE0)                                              03268000
         DS    0D                                                       03269000
LENIORWK DC    AL4(120)                                                 03270000
IORID    DC    XL4'0000C9E2'                                            03271000
ADDRIOR  DC    AL4(IECVRSTI)                                            03272000
RSTKEYAD DC    AL4(IORSTKEY)                                            03273000
INTEADDR DC    AL4(INTERRPT)                                            03274000
ADIECINT DC    VL4(IECINT)                                              03275000
@CB03103 DC    X'FFFFFFFF'                                              03276000
@CB03050 DC    X'0200'                                                  03277000
@CB03052 DC    X'0400'                                                  03278000
@CB03054 DC    X'0006'                                                  03279000
@CB03065 DC    X'8000'                                                  03280000
         DS    CL4                                                      03281000
RESRVCCW DC    X'B400000030000001'                                      03282000
RESTWAIT DC    X'84200000'                                              03283000
DEADWAIT DC    X'81200000'                                              03284000
IORSCODE DC    CL2'IS'                                                  03285000
ENDSTAT  DC    X'000F'                                                  03286000
ERPIBSTD DC    X'00001007'                                              03287000
MODNAME  DC    CL8'IECVRSTI'                                            03288000
FRRNAME  DC    CL8'IORFRR'                                              03289000
CPU165   DC    CL4'0165'                                                03290000
CPU168   DC    CL4'0168'                                                03291000
IORSPSW  DC    X'040C0000'                                              03292000
WAITPSW  DS    CL4                                                      03293000
         ORG   WAITPSW                                                  03294000
PHALF1   DC    X'00020000'                                              03295000
         ORG   WAITPSW+4                                                03296000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       03297000
@01      EQU   01                                                       03298000
@02      EQU   02                                                       03299000
@03      EQU   03                                                       03300000
@04      EQU   04                                                       03301000
@05      EQU   05                                                       03302000
@06      EQU   06                                                       03303000
@07      EQU   07                                                       03304000
@08      EQU   08                                                       03305000
@09      EQU   09                                                       03306000
@10      EQU   10                                                       03307000
@11      EQU   11                                                       03308000
@12      EQU   12                                                       03309000
@13      EQU   13                                                       03310000
@14      EQU   14                                                       03311000
@15      EQU   15                                                       03312000
UCBPTR   EQU   @07                                                      03313000
REG0     EQU   @00                                                      03314000
REG1     EQU   @01                                                      03315000
REG3     EQU   @03                                                      03316000
REG4     EQU   @04                                                      03317000
REG5     EQU   @05                                                      03318000
REG6     EQU   @06                                                      03319000
REG8     EQU   @08                                                      03320000
REG9     EQU   @09                                                      03321000
REG11    EQU   @11                                                      03322000
REG12    EQU   @12                                                      03323000
REG13    EQU   @13                                                      03324000
REG14    EQU   @14                                                      03325000
REG15    EQU   @15                                                      03326000
COUNT    EQU   @04                                                      03327000
ADDRESS  EQU   @03                                                      03328000
WKPTR1   EQU   @03                                                      03329000
GPR00P   EQU   @00                                                      03330000
GPR01P   EQU   @01                                                      03331000
GPR14P   EQU   @14                                                      03332000
GPR15P   EQU   @15                                                      03333000
REG10    EQU   @10                                                      03334000
REG2     EQU   @02                                                      03335000
CVTPTR   EQU   16                                                       03336000
PSA      EQU   0                                                        03337000
FLCRNPSW EQU   PSA                                                      03338000
FLCROPSW EQU   PSA+8                                                    03339000
FLCICCW2 EQU   PSA+16                                                   03340000
FLCCAW   EQU   PSA+72                                                   03341000
FLCINPSW EQU   PSA+120                                                  03342000
PSAEEPSW EQU   PSA+132                                                  03343000
PSAESPSW EQU   PSA+136                                                  03344000
FLCSVILC EQU   PSAESPSW+1                                               03345000
PSAEPPSW EQU   PSA+140                                                  03346000
FLCPIILC EQU   PSAEPPSW+1                                               03347000
FLCPICOD EQU   PSAEPPSW+2                                               03348000
PSAPICOD EQU   FLCPICOD+1                                               03349000
FLCTEA   EQU   PSAEPPSW+4                                               03350000
FLCPER   EQU   PSA+152                                                  03351000
FLCMCLA  EQU   PSA+168                                                  03352000
FLCCHNID EQU   FLCMCLA                                                  03353000
FLCCHTM  EQU   FLCCHNID                                                 03354000
FLCIOEL  EQU   FLCMCLA+4                                                03355000
FLCLCL   EQU   FLCMCLA+8                                                03356000
FLCIOA   EQU   FLCMCLA+16                                               03357000
FLCIOAA  EQU   FLCIOA+1                                                 03358000
PSAMEDC  EQU   FLCMCLA+76                                               03359000
FLCFSA   EQU   FLCMCLA+80                                               03360000
PSACPULA EQU   PSA+518                                                  03361000
PSAPCCAV EQU   PSA+520                                                  03362000
PSALCCAV EQU   PSA+528                                                  03363000
PSASUPER EQU   PSA+552                                                  03364000
PSASUP1  EQU   PSASUPER                                                 03365000
PSASUP2  EQU   PSASUPER+1                                               03366000
PSASUP3  EQU   PSASUPER+2                                               03367000
PSAIOSUP EQU   PSASUP3                                                  03368000
PSASUP4  EQU   PSASUPER+3                                               03369000
PSACLHT  EQU   PSA+640                                                  03370000
PSALKSA  EQU   PSA+696                                                  03371000
PSAHLHI  EQU   PSA+760                                                  03372000
PSACPUSA EQU   PSA+794                                                  03373000
PSADSSFL EQU   PSA+836                                                  03374000
PSADSSF1 EQU   PSADSSFL                                                 03375000
PSADSSF3 EQU   PSADSSFL+2                                               03376000
PSADSSF4 EQU   PSADSSFL+3                                               03377000
PSARSVT  EQU   PSA+896                                                  03378000
CSW      EQU   64                                                       03379000
KEY0000  EQU   CSW                                                      03380000
LOP      EQU   KEY0000                                                  03381000
CMDADDR  EQU   CSW+1                                                    03382000
STATUS   EQU   CSW+4                                                    03383000
CHANSTAT EQU   STATUS+1                                                 03384000
CDC      EQU   CHANSTAT                                                 03385000
CCC      EQU   CHANSTAT                                                 03386000
ICC      EQU   CHANSTAT                                                 03387000
CAW      EQU   72                                                       03388000
CRCA     EQU   0                                                        03389000
CRCAFLGS EQU   CRCA+4                                                   03390000
CRCAFLG1 EQU   CRCAFLGS                                                 03391000
CRCADIAG EQU   CRCAFLG1                                                 03392000
CRCACCH  EQU   CRCAFLG1                                                 03393000
CRCAMCW  EQU   CRCA+8                                                   03394000
CRCAMCWZ EQU   CRCAMCW                                                  03395000
CRCAMCWF EQU   CRCAMCW+3                                                03396000
CRCAMCWI EQU   CRCAMCWF                                                 03397000
CRCAMCWM EQU   CRCAMCWF                                                 03398000
CRCAPCCA EQU   CRCA+36                                                  03399000
CRCACAT  EQU   CRCA+40                                                  03400000
CRCACHAN EQU   CRCA+52                                                  03401000
CVTMAP   EQU   0                                                        03402000
CVTILK1  EQU   CVTMAP+36                                                03403000
CVTILK2  EQU   CVTMAP+40                                                03404000
CVTDAR   EQU   CVTMAP+72                                                03405000
CVTFLGS1 EQU   CVTDAR                                                   03406000
CVTDCB   EQU   CVTMAP+116                                               03407000
CVTIOQET EQU   CVTMAP+120                                               03408000
CVTIXAVL EQU   CVTMAP+124                                               03409000
CVTIERLC EQU   CVTMAP+144                                               03410000
CVTHEAD  EQU   CVTMAP+160                                               03411000
CVTSV76C EQU   CVTHEAD                                                  03412000
CVTOPTA  EQU   CVTMAP+182                                               03413000
CVTOPTB  EQU   CVTMAP+183                                               03414000
CVTGTF   EQU   CVTMAP+236                                               03415000
CVTGTFST EQU   CVTGTF                                                   03416000
CVTGTFS  EQU   CVTGTFST                                                 03417000
CVTSTATE EQU   CVTGTFST                                                 03418000
CVTTMODE EQU   CVTGTFST                                                 03419000
CVTFORM  EQU   CVTGTFST                                                 03420000
CVTAQAVT EQU   CVTMAP+240                                               03421000
CVTTCMFG EQU   CVTAQAVT                                                 03422000
CVTVOLM2 EQU   CVTMAP+244                                               03423000
CVTTATA  EQU   CVTVOLM2                                                 03424000
CVTTSKS  EQU   CVTTATA                                                  03425000
CVTVOLF2 EQU   CVTTSKS                                                  03426000
CVTTAT   EQU   CVTTATA+1                                                03427000
CVTATER  EQU   CVTMAP+248                                               03428000
CVTEXT1  EQU   CVTMAP+252                                               03429000
CVTPURG  EQU   CVTMAP+260                                               03430000
CVTQMSG  EQU   CVTMAP+268                                               03431000
CVTDMSR  EQU   CVTMAP+272                                               03432000
CVTRSV37 EQU   CVTDMSR                                                  03433000
CVTDMSRF EQU   CVTRSV37                                                 03434000
CVTERPV  EQU   CVTMAP+316                                               03435000
CVTINTLA EQU   CVTMAP+320                                               03436000
CVTAPF   EQU   CVTMAP+324                                               03437000
CVTEXT2  EQU   CVTMAP+328                                               03438000
CVTHJES  EQU   CVTMAP+332                                               03439000
CVTPGSIA EQU   CVTMAP+348                                               03440000
CVTA1F1  EQU   CVTMAP+356                                               03441000
CVTSYSK  EQU   CVTMAP+357                                               03442000
CVTVOLM1 EQU   CVTMAP+380                                               03443000
CVTVOLF1 EQU   CVTVOLM1                                                 03444000
CVTATMCT EQU   CVTMAP+388                                               03445000
CVTXTNT1 EQU   0                                                        03446000
CVTXTNT2 EQU   0                                                        03447000
CVTDSSV  EQU   CVTXTNT2                                                 03448000
CVTFLGBT EQU   CVTXTNT2+5                                               03449000
CVTQID   EQU   CVTXTNT2+24                                              03450000
CVTICB   EQU   CVTXTNT2+48                                              03451000
CVTRV400 EQU   CVTXTNT2+52                                              03452000
CVTRV409 EQU   CVTXTNT2+53                                              03453000
CVTATCVT EQU   CVTXTNT2+64                                              03454000
CVTRV429 EQU   CVTXTNT2+84                                              03455000
CVTRV438 EQU   CVTXTNT2+85                                              03456000
CVTRV457 EQU   CVTXTNT2+112                                             03457000
CVTRV466 EQU   CVTXTNT2+113                                             03458000
CVTFIX   EQU   0                                                        03459000
CVTRELNO EQU   CVTFIX+252                                               03460000
ICB2SSCB EQU   0                                                        03461000
ICBOPT   EQU   ICB2SSCB+48                                              03462000
ICBFLG   EQU   ICB2SSCB+52                                              03463000
ICBFG1   EQU   ICBFLG                                                   03464000
ICBIORCI EQU   ICB2SSCB+60                                              03465000
ICBSRBP  EQU   ICB2SSCB+80                                              03466000
ICBTRACE EQU   ICB2SSCB+112                                             03467000
SRBSECT  EQU   0                                                        03468000
SRB      EQU   SRBSECT                                                  03469000
SRBASCB  EQU   SRB+8                                                    03470000
SRBFLC   EQU   SRB+12                                                   03471000
SRBEP    EQU   SRB+20                                                   03472000
SRBPRIOR EQU   SRB+37                                                   03473000
UCB      EQU   0                                                        03474000
UCBLOCK  EQU   UCB+504                                                  03475000
UCBIOQ   EQU   UCB+508                                                  03476000
UCBOB    EQU   0                                                        03477000
UCBJBNR  EQU   UCBOB                                                    03478000
UCBFL5   EQU   UCBOB+1                                                  03479000
UCBAF    EQU   UCBFL5                                                   03480000
UCBSTAT  EQU   UCBOB+3                                                  03481000
UCBCHAN  EQU   UCBOB+4                                                  03482000
UCBCHA   EQU   UCBCHAN                                                  03483000
UCBSFLS  EQU   UCBOB+6                                                  03484000
UCBFLA   EQU   UCBSFLS                                                  03485000
UCBFL1   EQU   UCBFLA                                                   03486000
UCBBSY   EQU   UCBFL1                                                   03487000
UCBNRY   EQU   UCBFL1                                                   03488000
UCBPST   EQU   UCBFL1                                                   03489000
UCBPSNS  EQU   UCBFL1                                                   03490000
UCBCUB   EQU   UCBFL1                                                   03491000
UCBFLB   EQU   UCBSFLS+1                                                03492000
UCBIORST EQU   UCBFLB                                                   03493000
UCBASNS  EQU   UCBFLB                                                   03494000
UCBRESVH EQU   UCBFLB                                                   03495000
UCBCHM   EQU   UCBOB+8                                                  03496000
UCBCHM1  EQU   UCBCHM                                                   03497000
UCBPTH0  EQU   UCBCHM1                                                  03498000
UCBPTH1  EQU   UCBCHM1                                                  03499000
UCBCPU   EQU   UCBOB+11                                                 03500000
UCBWGT   EQU   UCBOB+12                                                 03501000
UCBMTPXP EQU   UCBWGT                                                   03502000
UCBNAME  EQU   UCBOB+13                                                 03503000
UCBTYP   EQU   UCBOB+16                                                 03504000
UCBTBYT1 EQU   UCBTYP                                                   03505000
UCB1FEA5 EQU   UCBTBYT1                                                 03506000
UCB1FEA6 EQU   UCBTBYT1                                                 03507000
UCBTBYT2 EQU   UCBTYP+1                                                 03508000
UCB2OPT2 EQU   UCBTBYT2                                                 03509000
UCBDUDN1 EQU   UCB2OPT2                                                 03510000
UCBRR    EQU   UCBDUDN1                                                 03511000
UCB2OPT3 EQU   UCBTBYT2                                                 03512000
UCBDUDN2 EQU   UCB2OPT3                                                 03513000
UCB2OPT4 EQU   UCBTBYT2                                                 03514000
UCBRWTAU EQU   UCB2OPT4                                                 03515000
UCB2OPT6 EQU   UCBTBYT2                                                 03516000
UCB2OPT7 EQU   UCBTBYT2                                                 03517000
UCBTBYT3 EQU   UCBTYP+2                                                 03518000
UCBDVCLS EQU   UCBTBYT3                                                 03519000
UCB3DACC EQU   UCBDVCLS                                                 03520000
UCBTBYT4 EQU   UCBTYP+3                                                 03521000
UCBEXTPT EQU   UCBOB+20                                                 03522000
UCBFLC   EQU   UCBEXTPT                                                 03523000
UCBDEV   EQU   UCBOB+24                                                 03524000
UCBCMEXT EQU   0                                                        03525000
UCBATI   EQU   UCBCMEXT+3                                               03526000
@NM00014 EQU   UCBATI                                                   03527000
UCBFLP1  EQU   UCBCMEXT+5                                               03528000
UCBCCWOF EQU   UCBCMEXT+8                                               03529000
UCBMT    EQU   0                                                        03530000
UCBOCR   EQU   0                                                        03531000
UCB3540X EQU   0                                                        03532000
UCBDKBYT EQU   UCB3540X+6                                               03533000
UCB3800X EQU   0                                                        03534000
UCBOPTNS EQU   UCB3800X                                                 03535000
UCBACTIV EQU   UCB3800X+3                                               03536000
UCBMDRBF EQU   UCB3800X+36                                              03537000
UCBUCS   EQU   0                                                        03538000
UCBUCSOP EQU   UCBUCS+4                                                 03539000
UCBFCBOP EQU   UCBUCS+5                                                 03540000
SDWA     EQU   0                                                        03541000
SDWAPARM EQU   SDWA                                                     03542000
SDWAFIOB EQU   SDWA+4                                                   03543000
SDWAABCC EQU   SDWAFIOB                                                 03544000
SDWACMPF EQU   SDWAABCC                                                 03545000
SDWACTL1 EQU   SDWA+8                                                   03546000
SDWACMKA EQU   SDWACTL1                                                 03547000
SDWAMWPA EQU   SDWACTL1+1                                               03548000
SDWAPMKA EQU   SDWACTL1+4                                               03549000
SDWACTL2 EQU   SDWA+16                                                  03550000
SDWACMKP EQU   SDWACTL2                                                 03551000
SDWAMWPP EQU   SDWACTL2+1                                               03552000
SDWAPMKP EQU   SDWACTL2+4                                               03553000
SDWAGRSV EQU   SDWA+24                                                  03554000
SDWANAME EQU   SDWA+88                                                  03555000
SDWAEC1  EQU   SDWA+104                                                 03556000
SDWAEMK1 EQU   SDWAEC1                                                  03557000
SDWAMWP1 EQU   SDWAEC1+1                                                03558000
SDWAINT1 EQU   SDWAEC1+2                                                03559000
SDWANXT1 EQU   SDWAEC1+4                                                03560000
SDWAAEC1 EQU   SDWA+112                                                 03561000
SDWAILC1 EQU   SDWAAEC1+1                                               03562000
SDWAINC1 EQU   SDWAAEC1+2                                               03563000
SDWAICD1 EQU   SDWAINC1+1                                               03564000
SDWAEC2  EQU   SDWA+120                                                 03565000
SDWAEMK2 EQU   SDWAEC2                                                  03566000
SDWAMWP2 EQU   SDWAEC2+1                                                03567000
SDWAINT2 EQU   SDWAEC2+2                                                03568000
SDWANXT2 EQU   SDWAEC2+4                                                03569000
SDWAAEC2 EQU   SDWA+128                                                 03570000
SDWAILC2 EQU   SDWAAEC2+1                                               03571000
SDWAINC2 EQU   SDWAAEC2+2                                               03572000
SDWAICD2 EQU   SDWAINC2+1                                               03573000
SDWASRSV EQU   SDWA+136                                                 03574000
SDWAIDNT EQU   SDWA+200                                                 03575000
SDWAMCH  EQU   SDWA+204                                                 03576000
SDWASTCK EQU   SDWAMCH                                                  03577000
SDWAMCHI EQU   SDWAMCH+8                                                03578000
SDWAMCHS EQU   SDWAMCHI                                                 03579000
SDWAMCHD EQU   SDWAMCHI+1                                               03580000
SDWARSR1 EQU   SDWAMCH+12                                               03581000
SDWARSR2 EQU   SDWAMCH+13                                               03582000
SDWAFLGS EQU   SDWA+232                                                 03583000
SDWAERRA EQU   SDWAFLGS                                                 03584000
SDWAERRB EQU   SDWAFLGS+1                                               03585000
SDWAERRC EQU   SDWAFLGS+2                                               03586000
SDWAERRD EQU   SDWAFLGS+3                                               03587000
SDWAIOFS EQU   SDWA+238                                                 03588000
SDWACPUA EQU   SDWA+248                                                 03589000
SDWAPARQ EQU   SDWA+252                                                 03590000
SDWARCDE EQU   SDWAPARQ                                                 03591000
SDWAACF2 EQU   SDWAPARQ+1                                               03592000
SDWARCRD EQU   SDWAACF2                                                 03593000
SDWAACF3 EQU   SDWAPARQ+2                                               03594000
SDWAACF4 EQU   SDWAPARQ+3                                               03595000
SDWAIUCB EQU   SDWAACF4                                                 03596000
SDWALKWA EQU   SDWA+256                                                 03597000
SDWALKWS EQU   SDWALKWA                                                 03598000
SDWAIULW EQU   SDWALKWS+4                                               03599000
SDWARECP EQU   SDWA+292                                                 03600000
SDWAMODN EQU   SDWARECP                                                 03601000
SDWACSCT EQU   SDWARECP+8                                               03602000
SDWAREXN EQU   SDWARECP+16                                              03603000
SDWASNPA EQU   SDWA+320                                                 03604000
SDWADUMP EQU   SDWASNPA                                                 03605000
SDWADPFS EQU   SDWADUMP+1                                               03606000
SDWADDAT EQU   SDWASNPA+4                                               03607000
SDWASDAT EQU   SDWADDAT                                                 03608000
SDWAPDAT EQU   SDWADDAT+2                                               03609000
SDWADPSA EQU   SDWA+328                                                 03610000
SDWADPSL EQU   SDWADPSA                                                 03611000
SDWARA   EQU   SDWA+400                                                 03612000
SDWADPVA EQU   SDWARA+2                                                 03613000
IOQ      EQU   0                                                        03614000
IOQFLAGS EQU   IOQ+4                                                    03615000
IOQFLA   EQU   IOQFLAGS                                                 03616000
IOQFLB   EQU   IOQFLAGS+1                                               03617000
IOQIOSB  EQU   IOQ+8                                                    03618000
IOSB     EQU   0                                                        03619000
IOSFLA   EQU   IOSB                                                     03620000
IOSACHN  EQU   IOSFLA                                                   03621000
IOSFLB   EQU   IOSB+1                                                   03622000
IOSFLC   EQU   IOSB+2                                                   03623000
IOSDVALT EQU   IOSFLC                                                   03624000
IOSPKEY  EQU   IOSB+12                                                  03625000
IOSOPT   EQU   IOSB+14                                                  03626000
IOSOPT2  EQU   IOSB+15                                                  03627000
@NM00065 EQU   IOSB+20                                                  03628000
IOSCSW   EQU   @NM00065+1                                               03629000
IOSTATUS EQU   IOSCSW+3                                                 03630000
IOSSRB   EQU   IOSB+28                                                  03631000
IOSIPIB  EQU   IOSB+44                                                  03632000
IOSDIE   EQU   IOSB+68                                                  03633000
IOSDIEFG EQU   IOSDIE                                                   03634000
IOSPATH  EQU   IOSB+86                                                  03635000
IOSCHN   EQU   IOSPATH                                                  03636000
IOSCKEY  EQU   IOSB+89                                                  03637000
IOSEEKA  EQU   IOSB+100                                                 03638000
IOSCCHH  EQU   IOSEEKA+3                                                03639000
IOSSKHH  EQU   IOSCCHH+2                                                03640000
IOCOM    EQU   0                                                        03641000
IOCORMGT EQU   IOCOM+36                                                 03642000
IOCIOSCP EQU   IOCOM+40                                                 03643000
IOCOMEX  EQU   IOCOM+64                                                 03644000
IOCRSVTB EQU   IOCOM+96                                                 03645000
IOCUCBBM EQU   IOCOM+120                                                03646000
IOCX     EQU   0                                                        03647000
IOX      EQU   IOCX                                                     03648000
IOXHICH  EQU   IOCX+4                                                   03649000
IOXCRHA  EQU   IOCX+12                                                  03650000
LCCA     EQU   0                                                        03651000
LCCAIHRC EQU   LCCA+520                                                 03652000
LCCAIHR1 EQU   LCCAIHRC                                                 03653000
LCCAIHR2 EQU   LCCAIHRC+1                                               03654000
LCCAIHR3 EQU   LCCAIHRC+2                                               03655000
LCCAIHR4 EQU   LCCAIHRC+3                                               03656000
LCCASPIN EQU   LCCA+524                                                 03657000
LCCASPN1 EQU   LCCASPIN                                                 03658000
LCCASPN2 EQU   LCCASPIN+1                                               03659000
LCCASPN3 EQU   LCCASPIN+2                                               03660000
LCCASPN4 EQU   LCCASPIN+3                                               03661000
LCCACPUS EQU   LCCA+536                                                 03662000
LCCADSF1 EQU   LCCA+540                                                 03663000
LCCADSF2 EQU   LCCA+541                                                 03664000
LCCASPSA EQU   LCCA+544                                                 03665000
LCCACRFL EQU   LCCA+692                                                 03666000
LCCACREX EQU   LCCA+693                                                 03667000
LCCALKFG EQU   LCCA+694                                                 03668000
LCCASRBF EQU   LCCA+720                                                 03669000
LCCAIRT  EQU   LCCA+736                                                 03670000
PCCA     EQU   0                                                        03671000
PCCACPID EQU   PCCA+4                                                   03672000
PCCACPUA EQU   PCCA+16                                                  03673000
PCCATMST EQU   PCCA+128                                                 03674000
PCCATMFL EQU   PCCATMST                                                 03675000
PCCATODE EQU   PCCATMST+1                                               03676000
PCCACCE  EQU   PCCATMST+2                                               03677000
PCCAINTE EQU   PCCATMST+3                                               03678000
PCCAEMSB EQU   PCCA+136                                                 03679000
PCCAEMSI EQU   PCCAEMSB                                                 03680000
PCCARISP EQU   PCCAEMSI                                                 03681000
PCCAEMS2 EQU   PCCAEMSI+1                                               03682000
PCCAEMS3 EQU   PCCAEMSI+2                                               03683000
PCCARMSB EQU   PCCAEMSI+3                                               03684000
PCCAPWAV EQU   PCCA+152                                                 03685000
PCCAELAD EQU   PCCA+168                                                 03686000
PCCACHAN EQU   PCCA+224                                                 03687000
PCCAWERP EQU   PCCA+280                                                 03688000
PCCACHUB EQU   PCCAWERP                                                 03689000
PCCACHPF EQU   PCCAWERP+4                                               03690000
PCCACNOR EQU   PCCACHPF                                                 03691000
PCCACHBL EQU   PCCAWERP+5                                               03692000
PCCACCPU EQU   PCCACHBL                                                 03693000
PCCACCHA EQU   PCCACHBL                                                 03694000
PCCACHVA EQU   PCCAWERP+6                                               03695000
PCCACHTS EQU   PCCAWERP+7                                               03696000
PCCACHS1 EQU   PCCA+288                                                 03697000
PCCACHS2 EQU   PCCA+289                                                 03698000
PCCACHRB EQU   PCCA+290                                                 03699000
PCCACHF1 EQU   PCCA+308                                                 03700000
PCCACHF2 EQU   PCCA+309                                                 03701000
PCCACHF3 EQU   PCCA+310                                                 03702000
PCCACHF4 EQU   PCCA+311                                                 03703000
PCCAATTR EQU   PCCA+376                                                 03704000
PCCACAT  EQU   PCCA+384                                                 03705000
IRT      EQU   0                                                        03706000
IRTENTRY EQU   IRT                                                      03707000
IRTFLA   EQU   IRTENTRY                                                 03708000
IRTFLB   EQU   IRTENTRY+1                                               03709000
IRTENVR  EQU   IRTENTRY+2                                               03710000
WSAC     EQU   0                                                        03711000
WSACRSTI EQU   WSAC+40                                                  03712000
FRRS     EQU   0                                                        03713000
FRRSHEAD EQU   FRRS                                                     03714000
FRRSENTR EQU   0                                                        03715000
FRRSFLGS EQU   FRRSENTR+4                                               03716000
FRRSFLG1 EQU   FRRSFLGS                                                 03717000
CSD      EQU   0                                                        03718000
CSDCPUAL EQU   CSD+8                                                    03719000
CSDSCWRD EQU   CSD+12                                                   03720000
CSDSCFL1 EQU   CSDSCWRD                                                 03721000
CSDSCFL2 EQU   CSDSCWRD+1                                               03722000
CSDSCFL3 EQU   CSDSCWRD+2                                               03723000
CSDSCFL4 EQU   CSDSCWRD+3                                               03724000
CSDFLAGS EQU   CSD+23                                                   03725000
CAT      EQU   0                                                        03726000
CATENTRY EQU   CAT                                                      03727000
CATFLG   EQU   CATENTRY                                                 03728000
CATFLA   EQU   CAT+1                                                    03729000
CATIORST EQU   CATFLA                                                   03730000
LCH      EQU   0                                                        03731000
LCHENTRY EQU   LCH                                                      03732000
LCHFLA   EQU   LCH+21                                                   03733000
PWA      EQU   0                                                        03734000
PWAFRR   EQU   PWA+384                                                  03735000
PWAFLAGS EQU   PWA+778                                                  03736000
PWAEDSRB EQU   PWA+779                                                  03737000
IORWORK  EQU   0                                                        03738000
BLKCHAIN EQU   IORWORK                                                  03739000
TBLPTR   EQU   IORWORK+4                                                03740000
MESSPTR  EQU   IORWORK+8                                                03741000
RSVTBLPT EQU   IORWORK+12                                               03742000
IONEWSAV EQU   IORWORK+20                                               03743000
RSPSW1   EQU   IORWORK+24                                               03744000
RSPSW2   EQU   IORWORK+32                                               03745000
MSGAD    EQU   IORWORK+40                                               03746000
ERPIBPTR EQU   IORWORK+44                                               03747000
IORSIOCM EQU   IORWORK+48                                               03748000
RETURNAD EQU   IORWORK+52                                               03749000
UCBACTRT EQU   IORWORK+56                                               03750000
CATPTR   EQU   IORWORK+60                                               03751000
PWAPTR   EQU   IORWORK+64                                               03752000
SDWAADDR EQU   IORWORK+68                                               03753000
LOCKADDR EQU   IORWORK+72                                               03754000
TMCTL    EQU   IORWORK+80                                               03755000
INPARM   EQU   IORWORK+84                                               03756000
INDICAT  EQU   INPARM                                                   03757000
UCBP     EQU   INPARM+1                                                 03758000
CHANID   EQU   UCBP                                                     03759000
CPUADDR  EQU   UCBP+1                                                   03760000
LCCRHFLG EQU   CPUADDR                                                  03761000
CRHCHSW  EQU   LCCRHFLG                                                 03762000
CPUID    EQU   CPUADDR+1                                                03763000
IORCSW   EQU   IORWORK+88                                               03764000
IORSTAT  EQU   IORCSW+4                                                 03765000
FLAGS    EQU   IORWORK+96                                               03766000
FLAG1    EQU   FLAGS                                                    03767000
PASSIND  EQU   FLAG1                                                    03768000
NODEVCLR EQU   FLAG1                                                    03769000
LOGOUT   EQU   FLAG1                                                    03770000
PATHAVIL EQU   FLAG1                                                    03771000
OFFIND   EQU   FLAG1                                                    03772000
RESETCPU EQU   FLAG1                                                    03773000
IORCC3   EQU   FLAG1                                                    03774000
FLAG2    EQU   FLAGS+1                                                  03775000
LOCKUCB  EQU   FLAG2                                                    03776000
IONEWPSW EQU   FLAG2                                                    03777000
CTLREG   EQU   FLAG2                                                    03778000
IOSGTABL EQU   IORWORK+100                                              03779000
PATH1    EQU   IOSGTABL                                                 03780000
PSTAT1   EQU   IOSGTABL+2                                               03781000
PATH2    EQU   IOSGTABL+4                                               03782000
PSTAT2   EQU   IOSGTABL+6                                               03783000
RSTRTWRD EQU   IORWORK+108                                              03784000
RCPU     EQU   RSTRTWRD                                                 03785000
RHLDR    EQU   RSTRTWRD+2                                               03786000
TIOCNTR  EQU   IORWORK+112                                              03787000
DEVINDEX EQU   IORWORK+114                                              03788000
FIRSTDEV EQU   IORWORK+116                                              03789000
FIRSTCHN EQU   FIRSTDEV                                                 03790000
FIRSTUNT EQU   FIRSTDEV+1                                               03791000
CATINDEX EQU   IORWORK+118                                              03792000
RSVTBL   EQU   0                                                        03793000
RCHAIN   EQU   RSVTBL                                                   03794000
ENTCNT   EQU   RSVTBL+4                                                 03795000
ENTRIES  EQU   RSVTBL+8                                                 03796000
ENT      EQU   ENTRIES                                                  03797000
ROFFLINE EQU   ENT                                                      03798000
ENTUCB   EQU   ENT+4                                                    03799000
MSGBLOCK EQU   0                                                        03800000
MBLKCHN  EQU   MSGBLOCK                                                 03801000
MSGENT   EQU   MSGBLOCK+4                                               03802000
MESSBUF  EQU   MSGBLOCK+8                                               03803000
MSG003   EQU   0                                                        03804000
DEV3     EQU   MSG003+38                                                03805000
MSG004   EQU   0                                                        03806000
INTMSG   EQU   MSG004+19                                                03807000
MSG005   EQU   0                                                        03808000
DEV5     EQU   MSG005+19                                                03809000
PATH5    EQU   MSG005+48                                                03810000
CPU5     EQU   MSG005+59                                                03811000
MSG969   EQU   0                                                        03812000
MSG410   EQU   0                                                        03813000
TXTCHAN  EQU   MSG410+21                                                03814000
TXTCPU   EQU   MSG410+23                                                03815000
RSTILOGB EQU   0                                                        03816000
LOGHDR   EQU   RSTILOGB                                                 03817000
LOGPTR   EQU   RSTILOGB+4                                               03818000
LOGDA    EQU   RSTILOGB+8                                               03819000
LOGWAIT  EQU   RSTILOGB+12                                              03820000
LOGTIME  EQU   RSTILOGB+16                                              03821000
LOGREGS  EQU   RSTILOGB+24                                              03822000
LOGMSC   EQU   RSTILOGB+88                                              03823000
UCBPT    EQU   0                                                        03824000
WKAREA1  EQU   0                                                        03825000
WKAREA2  EQU   0                                                        03826000
IORFRRA  EQU   0                                                        03827000
FRRSAV   EQU   IORFRRA                                                  03828000
FRRIORWA EQU   IORFRRA+4                                                03829000
FRRFLGS  EQU   IORFRRA+8                                                03830000
FRRIOSUP EQU   FRRFLGS                                                  03831000
FRRLCSRB EQU   FRRFLGS                                                  03832000
FRRLCRSV EQU   FRRFLGS                                                  03833000
RSTIERP  EQU   0                                                        03834000
RSTICHPF EQU   RSTIERP+4                                                03835000
RSTINOR  EQU   RSTICHPF                                                 03836000
CRHA     EQU   0                                                        03837000
SMGRGB   EQU   0                                                        03838000
IEESTPRS EQU   0                                                        03839000
I001C    EQU   0                                                        03840000
I008P    EQU   0                                                        03841000
I015F    EQU   0                                                        03842000
I015P    EQU   0                                                        03843000
I031F    EQU   0                                                        03844000
I031P    EQU   0                                                        03845000
I256C    EQU   0                                                        03846000
UCBBGN   EQU   0                                                        03847000
CVTS01   EQU   CVTPGSIA                                                 03848000
CVTLPDIA EQU   CVTS01+12                                                03849000
CVTDIRST EQU   CVTLPDIA                                                 03850000
CVTSLIDA EQU   CVTS01+24                                                03851000
CVTCTLFG EQU   CVTS01+50                                                03852000
CVTSRBRT EQU   CVTS01+100                                               03853000
CVTCSD   EQU   CVTS01+312                                               03854000
CVTRSTWD EQU   CVTS01+368                                               03855000
CVTRV210 EQU   CVTS01+424                                               03856000
CVTRV219 EQU   CVTS01+425                                               03857000
CVTRV228 EQU   CVTS01+426                                               03858000
CVTRV237 EQU   CVTS01+427                                               03859000
CVTMFRTR EQU   CVTS01+452                                               03860000
CVTRV262 EQU   CVTS01+468                                               03861000
CVTRV271 EQU   CVTS01+469                                               03862000
CVTRV280 EQU   CVTS01+470                                               03863000
CVTRV289 EQU   CVTS01+471                                               03864000
CVTSTPRS EQU   CVTS01+536                                               03865000
CVTGSDA  EQU   CVTS01+600                                               03866000
CVTCRCA  EQU   CVTS01+612                                               03867000
CRCAPTR  EQU   CVTCRCA                                                  03868000
UCBOBS01 EQU   UCBDEV                                                   03869000
UCBSTAB  EQU   UCBOBS01+10                                              03870000
UCBBSVL  EQU   UCBSTAB                                                  03871000
UCBPRSRS EQU   UCBSTAB                                                  03872000
UCBDMCT  EQU   UCBOBS01+11                                              03873000
UCBSQC   EQU   UCBOBS01+12                                              03874000
UCBFL4   EQU   UCBOBS01+13                                              03875000
UCBBASE  EQU   UCBOBS01+16                                              03876000
UCBOBS02 EQU   UCBDEV                                                   03877000
UCBTFL1  EQU   UCBOBS02+19                                              03878000
UCBXTN   EQU   UCBOBS02+20                                              03879000
UCBVOPT  EQU   UCBXTN                                                   03880000
UCBOBS03 EQU   UCBDEV                                                   03881000
UCBXTADR EQU   UCBOBS03                                                 03882000
UCBOBS04 EQU   UCBDEV                                                   03883000
UCBBTA   EQU   UCBOBS04+12                                              03884000
UCBOBS06 EQU   UCBDEV                                                   03885000
UCBAOF   EQU   UCBOBS06                                                 03886000
UCBAOF1  EQU   UCBAOF                                                   03887000
UCBAOF2  EQU   UCBAOF+1                                                 03888000
@NM00013 EQU   UCBOBS06+3                                               03889000
UCBIRB   EQU   UCBOBS06+4                                               03890000
UCBGRAF  EQU   UCBIRB                                                   03891000
UCBLDNCA EQU   UCBOBS06+8                                               03892000
UCBRDYQ  EQU   UCBLDNCA                                                 03893000
UCBIRLN  EQU   UCBRDYQ                                                  03894000
UCBLDNCB EQU   UCBRDYQ+1                                                03895000
UCBCTLNK EQU   UCBOBS06+12                                              03896000
UCBOBS07 EQU   UCBDEV                                                   03897000
UCBOBS08 EQU   UCBDEV                                                   03898000
UCBCTCAD EQU   UCBOBS08                                                 03899000
UCBCTCF1 EQU   UCBOBS08+4                                               03900000
UCBOBS09 EQU   UCBDEV                                                   03901000
IOSATTSC EQU   IOSIPIB                                                  03902000
IOSWTOWA EQU   IOSIPIB                                                  03903000
IOSPCISC EQU   IOSIPIB                                                  03904000
PSARSVTE EQU   PSARSVT                                                  03905000
IORSTATU EQU   UCBSTAT                                                  03906000
IORONLI  EQU   IORSTATU                                                 03907000
IORWGT   EQU   UCBWGT                                                   03908000
IORVHRSN EQU   IORWGT                                                   03909000
CHANLOG  EQU   PSA+304                                                  03910000
RSTIIOAA EQU   FLCIOAA                                                  03911000
PHYSCPU  EQU   PSACPUSA                                                 03912000
CPUPADDR EQU   PCCACPUA                                                 03913000
OFFCPUID EQU   CPUPADDR+1                                               03914000
FLC      EQU   PSA                                                      03915000
*                                      START UNREFERENCED COMPONENTS    03916000
@NM00132 EQU   CPUPADDR                                                 03917000
@NM00131 EQU   IORWGT                                                   03918000
@NM00130 EQU   IORWGT                                                   03919000
@NM00129 EQU   IORSTATU                                                 03920000
PSARSAV  EQU   PSARSVTE+60                                              03921000
PSARSTK  EQU   PSARSVTE+56                                              03922000
PSAESAV3 EQU   PSARSVTE+52                                              03923000
PSAESTK3 EQU   PSARSVTE+48                                              03924000
PSAESAV2 EQU   PSARSVTE+44                                              03925000
PSAESTK2 EQU   PSARSVTE+40                                              03926000
PSAESAV1 EQU   PSARSVTE+36                                              03927000
PSAESTK1 EQU   PSARSVTE+32                                              03928000
PSAPSAV  EQU   PSARSVTE+28                                              03929000
PSAPSTK  EQU   PSARSVTE+24                                              03930000
PSAMSAV  EQU   PSARSVTE+20                                              03931000
PSAMSTK  EQU   PSARSVTE+16                                              03932000
PSASSAV  EQU   PSARSVTE+12                                              03933000
PSASSTK  EQU   PSARSVTE+8                                               03934000
PSANSTK  EQU   PSARSVTE+4                                               03935000
PSACSTK  EQU   PSARSVTE                                                 03936000
IOSPCIWA EQU   IOSPCISC+44                                              03937000
IOSPCIRS EQU   IOSPCISC+8                                               03938000
@NM00070 EQU   IOSPCISC+4                                               03939000
@NM00069 EQU   IOSPCISC                                                 03940000
IOSWRNDR EQU   IOSWTOWA+4                                               03941000
IOSWTOPT EQU   IOSWTOWA+3                                               03942000
IOSWTOCP EQU   IOSWTOWA+2                                               03943000
IOSWTOCH EQU   IOSWTOWA                                                 03944000
IOSATTWA EQU   IOSATTSC+40                                              03945000
@NM00068 EQU   IOSATTSC+24                                              03946000
IOSATTSN EQU   IOSATTSC                                                 03947000
UCBRV066 EQU   UCBOBS09+4                                               03948000
UCBIOSBA EQU   UCBOBS09                                                 03949000
UCBRV042 EQU   UCBOBS08+5                                               03950000
UCBRV082 EQU   UCBCTCF1                                                 03951000
UCBRV081 EQU   UCBCTCF1                                                 03952000
UCBRV080 EQU   UCBCTCF1                                                 03953000
UCBRV079 EQU   UCBCTCF1                                                 03954000
UCBRV078 EQU   UCBCTCF1                                                 03955000
UCBRV077 EQU   UCBCTCF1                                                 03956000
UCBRV076 EQU   UCBCTCF1                                                 03957000
UCBCTC80 EQU   UCBCTCF1                                                 03958000
UCBCTCAL EQU   UCBCTCAD                                                 03959000
UCBICNCB EQU   UCBOBS07+4                                               03960000
UCBRV040 EQU   UCBOBS07                                                 03961000
UCBCTLNA EQU   UCBCTLNK+1                                               03962000
UCBRLN   EQU   UCBCTLNK                                                 03963000
UCBRDYQA EQU   UCBLDNCB                                                 03964000
UCBINRLN EQU   UCBIRLN                                                  03965000
UCBIRBA  EQU   UCBIRB+1                                                 03966000
UCBRV039 EQU   UCBGRAF                                                  03967000
UCBDWNR  EQU   UCBGRAF                                                  03968000
UCBRPND  EQU   UCBGRAF                                                  03969000
UCBUPM   EQU   UCBGRAF                                                  03970000
UCBBTAM  EQU   UCBGRAF                                                  03971000
UCBDRNO  EQU   UCBGRAF                                                  03972000
UCBDRO   EQU   UCBGRAF                                                  03973000
UCBOIP   EQU   UCBGRAF                                                  03974000
UCBATRCD EQU   @NM00013                                                 03975000
UCBSKPFG EQU   @NM00013                                                 03976000
UCBRIPND EQU   @NM00013                                                 03977000
UCBRTIAC EQU   @NM00013                                                 03978000
UCBRSV79 EQU   @NM00013                                                 03979000
UCBRSV78 EQU   @NM00013                                                 03980000
UCBRSV77 EQU   @NM00013                                                 03981000
UCBOLTEP EQU   @NM00013                                                 03982000
UCBATNCT EQU   UCBOBS06+2                                               03983000
UCBRSV76 EQU   UCBAOF2                                                  03984000
UCBRSV75 EQU   UCBAOF2                                                  03985000
UCBRSV74 EQU   UCBAOF2                                                  03986000
UCBRSV73 EQU   UCBAOF2                                                  03987000
UCBRSV72 EQU   UCBAOF2                                                  03988000
UCBRSV71 EQU   UCBAOF2                                                  03989000
UCBRSV70 EQU   UCBAOF2                                                  03990000
UCBRSV69 EQU   UCBAOF2                                                  03991000
UCBRSV68 EQU   UCBAOF1                                                  03992000
UCBRSV67 EQU   UCBAOF1                                                  03993000
UCBRSV66 EQU   UCBAOF1                                                  03994000
UCBRSV65 EQU   UCBAOF1                                                  03995000
UCBRSV64 EQU   UCBAOF1                                                  03996000
UCBOFNL  EQU   UCBAOF1                                                  03997000
UCBOFSP  EQU   UCBAOF1                                                  03998000
UCBOFMCR EQU   UCBAOF1                                                  03999000
UCBBTB   EQU   UCBBTA+1                                                 04000000
UCBDI    EQU   UCBBTA                                                   04001000
UCBSNS   EQU   UCBOBS04+8                                               04002000
UCBTEB   EQU   UCBOBS04+4                                               04003000
UCBGCB   EQU   UCBOBS04+3                                               04004000
UCBOPEN  EQU   UCBOBS04+2                                               04005000
UCBSTART EQU   UCBOBS04                                                 04006000
UCBXTNB  EQU   UCBXTN+1                                                 04007000
UCBRSV22 EQU   UCBVOPT                                                  04008000
UCBRSV21 EQU   UCBVOPT                                                  04009000
UCBRSV20 EQU   UCBVOPT                                                  04010000
UCBESVE  EQU   UCBVOPT                                                  04011000
UCBERPC  EQU   UCBVOPT                                                  04012000
UCBESVC  EQU   UCBVOPT                                                  04013000
UCBEVA   EQU   UCBVOPT                                                  04014000
UCBESV   EQU   UCBVOPT                                                  04015000
UCBRV009 EQU   UCBTFL1                                                  04016000
UCBRV008 EQU   UCBTFL1                                                  04017000
UCBRV007 EQU   UCBTFL1                                                  04018000
UCBRV006 EQU   UCBTFL1                                                  04019000
UCBRV005 EQU   UCBTFL1                                                  04020000
UCBDQDSP EQU   UCBTFL1                                                  04021000
UCBNSLTP EQU   UCBTFL1                                                  04022000
UCBNLTP  EQU   UCBTFL1                                                  04023000
UCBRES1B EQU   UCBOBS02+18                                              04024000
UCBFSER  EQU   UCBOBS02+12                                              04025000
@NM00012 EQU   UCBOBS02+4                                               04026000
UCBFSEQ  EQU   UCBOBS02+2                                               04027000
UCBFSCT  EQU   UCBOBS02                                                 04028000
UCBNEXP  EQU   UCBOBS01+20                                              04029000
UCBRES1A EQU   UCBOBS01+15                                              04030000
UCBUSER  EQU   UCBOBS01+14                                              04031000
UCBFL47  EQU   UCBFL4                                                   04032000
UCBMAT   EQU   UCBFL4                                                   04033000
UCBHOLD  EQU   UCBFL4                                                   04034000
UCBATTN  EQU   UCBFL4                                                   04035000
UCBDSS   EQU   UCBFL4                                                   04036000
UCBRESVP EQU   UCBFL4                                                   04037000
UCBWDAV  EQU   UCBFL4                                                   04038000
UCBDAVV  EQU   UCBFL4                                                   04039000
UCBDATP  EQU   UCBOBS01+12                                              04040000
UCBDMC   EQU   UCBDMCT                                                  04041000
UCBMOUNT EQU   UCBDMCT                                                  04042000
UCBBNUL  EQU   UCBSTAB                                                  04043000
UCBSHAR  EQU   UCBSTAB                                                  04044000
UCBBSTR  EQU   UCBSTAB                                                  04045000
UCBBPUB  EQU   UCBSTAB                                                  04046000
UCBBPRV  EQU   UCBSTAB                                                  04047000
UCBBALB  EQU   UCBPRSRS                                                 04048000
UCBPGFL  EQU   UCBSTAB                                                  04049000
UCBDVSHR EQU   UCBBSVL                                                  04050000
UCBVOLI  EQU   UCBOBS01+4                                               04051000
UCBVTOC  EQU   UCBOBS01                                                 04052000
CVTRV628 EQU   CVTS01+728                                               04053000
CVTRV627 EQU   CVTS01+724                                               04054000
CVTRV626 EQU   CVTS01+720                                               04055000
CVTRV625 EQU   CVTS01+716                                               04056000
CVTRV624 EQU   CVTS01+712                                               04057000
CVTRV623 EQU   CVTS01+708                                               04058000
CVTRV622 EQU   CVTS01+704                                               04059000
CVTRV621 EQU   CVTS01+700                                               04060000
CVTIHASU EQU   CVTS01+696                                               04061000
CVTSUSP  EQU   CVTS01+692                                               04062000
CVTT6SVC EQU   CVTS01+688                                               04063000
CVTCDAL  EQU   CVTS01+684                                               04064000
CVTTCTL  EQU   CVTS01+680                                               04065000
CVTRSUME EQU   CVTS01+676                                               04066000
CVTJTERM EQU   CVTS01+672                                               04067000
CVTASMRM EQU   CVTS01+668                                               04068000
CVTTCASP EQU   CVTS01+664                                               04069000
CVT0PT03 EQU   CVTS01+660                                               04070000
CVT0PT0E EQU   CVTS01+656                                               04071000
CVTRV609 EQU   CVTS01+652                                               04072000
CVTCGK   EQU   CVTS01+648                                               04073000
CVTRAC   EQU   CVTS01+644                                               04074000
CVTRV606 EQU   CVTS01+640                                               04075000
CVTRV605 EQU   CVTS01+636                                               04076000
CVTRV604 EQU   CVTS01+632                                               04077000
CVTEFF02 EQU   CVTS01+628                                               04078000
CVTCBBR  EQU   CVTS01+624                                               04079000
CVTSSCR  EQU   CVTS01+620                                               04080000
CVTEVENT EQU   CVTS01+616                                               04081000
CVTTPIO  EQU   CVTS01+608                                               04082000
CVTADV   EQU   CVTS01+604                                               04083000
CVTGSDAB EQU   CVTGSDA                                                  04084000
CVTQV3   EQU   CVTS01+596                                               04085000
CVTQV2   EQU   CVTS01+592                                               04086000
CVTQV1   EQU   CVTS01+588                                               04087000
CVTRPT   EQU   CVTS01+584                                               04088000
CVTSSRB  EQU   CVTS01+580                                               04089000
CVTCSDRL EQU   CVTS01+576                                               04090000
CVTEXP1  EQU   CVTS01+572                                               04091000
CVTRMPMT EQU   CVTS01+568                                               04092000
CVTRMPTT EQU   CVTS01+564                                               04093000
CVTVPSA  EQU   CVTS01+560                                               04094000
CVTVSTOP EQU   CVTS01+556                                               04095000
CVTGTFR8 EQU   CVTS01+552                                               04096000
CVTQUIT  EQU   CVTS01+548                                               04097000
CVTVACR  EQU   CVTS01+544                                               04098000
CVTWTCB  EQU   CVTS01+540                                               04099000
CVT0PT02 EQU   CVTS01+532                                               04100000
CVTDARCM EQU   CVTS01+528                                               04101000
CVTIRECM EQU   CVTS01+524                                               04102000
CVTJRECM EQU   CVTS01+520                                               04103000
CVTVEMS0 EQU   CVTS01+516                                               04104000
CVTSPFRR EQU   CVTS01+512                                               04105000
CVTRLSTG EQU   CVTS01+508                                               04106000
CVT0TC0A EQU   CVTS01+504                                               04107000
CVTGMBR  EQU   CVTS01+500                                               04108000
CVTLFRM  EQU   CVTS01+496                                               04109000
CVTRMBR  EQU   CVTS01+492                                               04110000
CVTVIOP  EQU   CVTS01+488                                               04111000
CVTRV307 EQU   CVTS01+486                                               04112000
CVTRV306 EQU   CVTS01+484                                               04113000
CVTRV305 EQU   CVTS01+482                                               04114000
CVTRV304 EQU   CVTS01+480                                               04115000
CVTRV303 EQU   CVTS01+478                                               04116000
CVTRV302 EQU   CVTS01+476                                               04117000
CVTTRCA  EQU   CVTS01+472                                               04118000
CVTRV297 EQU   CVTRV289                                                 04119000
CVTRV296 EQU   CVTRV289                                                 04120000
CVTRV295 EQU   CVTRV289                                                 04121000
CVTRV294 EQU   CVTRV289                                                 04122000
CVTRV293 EQU   CVTRV289                                                 04123000
CVTRV292 EQU   CVTRV289                                                 04124000
CVTRV291 EQU   CVTRV289                                                 04125000
CVTRV290 EQU   CVTRV289                                                 04126000
CVTRV288 EQU   CVTRV280                                                 04127000
CVTRV287 EQU   CVTRV280                                                 04128000
CVTRV286 EQU   CVTRV280                                                 04129000
CVTRV285 EQU   CVTRV280                                                 04130000
CVTRV284 EQU   CVTRV280                                                 04131000
CVTRV283 EQU   CVTRV280                                                 04132000
CVTRV282 EQU   CVTRV280                                                 04133000
CVTRV281 EQU   CVTRV280                                                 04134000
CVTRV279 EQU   CVTRV271                                                 04135000
CVTRV278 EQU   CVTRV271                                                 04136000
CVTRV277 EQU   CVTRV271                                                 04137000
CVTRV276 EQU   CVTRV271                                                 04138000
CVTRV275 EQU   CVTRV271                                                 04139000
CVTRV274 EQU   CVTRV271                                                 04140000
CVTRV273 EQU   CVTRV271                                                 04141000
CVTRV272 EQU   CVTRV271                                                 04142000
CVTRV270 EQU   CVTRV262                                                 04143000
CVTRV269 EQU   CVTRV262                                                 04144000
CVTRV268 EQU   CVTRV262                                                 04145000
CVTRV267 EQU   CVTRV262                                                 04146000
CVTRV266 EQU   CVTRV262                                                 04147000
CVTRV265 EQU   CVTRV262                                                 04148000
CVTRV264 EQU   CVTRV262                                                 04149000
CVTRV263 EQU   CVTRV262                                                 04150000
CVTVFP   EQU   CVTS01+464                                               04151000
CVTVSI   EQU   CVTS01+460                                               04152000
CVTVPSIB EQU   CVTS01+456                                               04153000
CVTMFACT EQU   CVTMFRTR                                                 04154000
CVTMFCTL EQU   CVTS01+448                                               04155000
CVTPVBP  EQU   CVTS01+444                                               04156000
CVTPWI   EQU   CVTS01+440                                               04157000
CVTRV254 EQU   CVTS01+438                                               04158000
CVTRV253 EQU   CVTS01+436                                               04159000
CVTRV252 EQU   CVTS01+434                                               04160000
CVTRV251 EQU   CVTS01+433                                               04161000
CVTRV250 EQU   CVTS01+432                                               04162000
CVTRV249 EQU   CVTS01+431                                               04163000
CVTRV248 EQU   CVTS01+430                                               04164000
CVTRV247 EQU   CVTS01+429                                               04165000
CVTRV246 EQU   CVTS01+428                                               04166000
CVTRV245 EQU   CVTRV237                                                 04167000
CVTRV244 EQU   CVTRV237                                                 04168000
CVTRV243 EQU   CVTRV237                                                 04169000
CVTRV242 EQU   CVTRV237                                                 04170000
CVTRV241 EQU   CVTRV237                                                 04171000
CVTRV240 EQU   CVTRV237                                                 04172000
CVTRV239 EQU   CVTRV237                                                 04173000
CVTRV238 EQU   CVTRV237                                                 04174000
CVTRV236 EQU   CVTRV228                                                 04175000
CVTRV235 EQU   CVTRV228                                                 04176000
CVTRV234 EQU   CVTRV228                                                 04177000
CVTRV233 EQU   CVTRV228                                                 04178000
CVTRV232 EQU   CVTRV228                                                 04179000
CVTRV231 EQU   CVTRV228                                                 04180000
CVTRV230 EQU   CVTRV228                                                 04181000
CVTRV229 EQU   CVTRV228                                                 04182000
CVTRV227 EQU   CVTRV219                                                 04183000
CVTRV226 EQU   CVTRV219                                                 04184000
CVTRV225 EQU   CVTRV219                                                 04185000
CVTRV224 EQU   CVTRV219                                                 04186000
CVTRV223 EQU   CVTRV219                                                 04187000
CVTRV222 EQU   CVTRV219                                                 04188000
CVTRV221 EQU   CVTRV219                                                 04189000
CVTRV220 EQU   CVTRV219                                                 04190000
CVTRV218 EQU   CVTRV210                                                 04191000
CVTRV217 EQU   CVTRV210                                                 04192000
CVTRV216 EQU   CVTRV210                                                 04193000
CVTRV215 EQU   CVTRV210                                                 04194000
CVTRV214 EQU   CVTRV210                                                 04195000
CVTRV213 EQU   CVTRV210                                                 04196000
CVTRV212 EQU   CVTRV210                                                 04197000
CVTRV211 EQU   CVTRV210                                                 04198000
CVTLCCAT EQU   CVTS01+420                                               04199000
CVTPCCAT EQU   CVTS01+416                                               04200000
CVTIPCRP EQU   CVTS01+412                                               04201000
CVTIPCRI EQU   CVTS01+408                                               04202000
CVTIPCDS EQU   CVTS01+404                                               04203000
CVTAIDVT EQU   CVTS01+400                                               04204000
CVTSSAP  EQU   CVTS01+396                                               04205000
CVTEHCIR EQU   CVTS01+392                                               04206000
CVTEHDEF EQU   CVTS01+388                                               04207000
CVTDAIR  EQU   CVTS01+384                                               04208000
CVTPERFM EQU   CVTS01+380                                               04209000
CVT044R2 EQU   CVTS01+376                                               04210000
CVTFETCH EQU   CVTS01+372                                               04211000
CVTSPOST EQU   CVTS01+364                                               04212000
CVTIOBP  EQU   CVTS01+360                                               04213000
CVTASMVT EQU   CVTS01+356                                               04214000
CVTRECRQ EQU   CVTS01+352                                               04215000
CVTWSAC  EQU   CVTS01+348                                               04216000
CVTRV149 EQU   CVTS01+344                                               04217000
CVTWSAL  EQU   CVTS01+340                                               04218000
CVTSPSA  EQU   CVTS01+336                                               04219000
CVTGLMN  EQU   CVTS01+332                                               04220000
CVTVEAC0 EQU   CVTS01+328                                               04221000
CVT062R1 EQU   CVTS01+324                                               04222000
CVTRPOST EQU   CVTS01+320                                               04223000
CVTDQIQE EQU   CVTS01+316                                               04224000
CVTLKRMA EQU   CVTS01+308                                               04225000
CVTRSPIE EQU   CVTS01+304                                               04226000
CVTRENQ  EQU   CVTS01+300                                               04227000
CVTLQCB  EQU   CVTS01+296                                               04228000
CVTFQCB  EQU   CVTS01+292                                               04229000
CVTQCS01 EQU   CVTS01+288                                               04230000
CVTAPFT  EQU   CVTS01+284                                               04231000
CVTPARRL EQU   CVTS01+280                                               04232000
CVTVWAIT EQU   CVTS01+276                                               04233000
CVTGSPL  EQU   CVTS01+272                                               04234000
CVTLSMQ  EQU   CVTS01+268                                               04235000
CVTGSMQ  EQU   CVTS01+264                                               04236000
CVTEXPRO EQU   CVTS01+260                                               04237000
CVTOPCTP EQU   CVTS01+256                                               04238000
CVTSIC   EQU   CVTS01+252                                               04239000
CVTTPIOS EQU   CVTS01+248                                               04240000
CVTRTMS  EQU   CVTS01+244                                               04241000
CVTSDBF  EQU   CVTS01+240                                               04242000
CVTSCBP  EQU   CVTS01+236                                               04243000
CVTSDMP  EQU   CVTS01+232                                               04244000
CVTSV60  EQU   CVTS01+228                                               04245000
CVTRTMCT EQU   CVTS01+224                                               04246000
CVTASCBL EQU   CVTS01+220                                               04247000
CVTASCBH EQU   CVTS01+216                                               04248000
CVTGDA   EQU   CVTS01+212                                               04249000
CVTASVT  EQU   CVTS01+208                                               04250000
CVTVVMDI EQU   CVTS01+204                                               04251000
CVTAQTOP EQU   CVTS01+200                                               04252000
CVTIOSCS EQU   CVTS01+196                                               04253000
CVTSDRM  EQU   CVTS01+192                                               04254000
CVTOPTE  EQU   CVTS01+188                                               04255000
CVTSTXU  EQU   CVTS01+184                                               04256000
CVTQUIS  EQU   CVTS01+180                                               04257000
CVTPARS  EQU   CVTS01+176                                               04258000
CVTS1EE  EQU   CVTS01+172                                               04259000
CVTFRAS  EQU   CVTS01+168                                               04260000
CVTQSAS  EQU   CVTS01+164                                               04261000
CVTCRAS  EQU   CVTS01+160                                               04262000
CVTCRMN  EQU   CVTS01+156                                               04263000
CVTDELCP EQU   CVTS01+152                                               04264000
CVTFRECL EQU   CVTS01+148                                               04265000
CVTGETCL EQU   CVTS01+144                                               04266000
CVTBLDCP EQU   CVTS01+140                                               04267000
CVTAUTHL EQU   CVTS01+136                                               04268000
CVTSCAN  EQU   CVTS01+132                                               04269000
CVTRV144 EQU   CVTS01+130                                               04270000
CVTMAXMP EQU   CVTS01+128                                               04271000
CVTSTCK  EQU   CVTS01+124                                               04272000
CVTRV139 EQU   CVTS01+123                                               04273000
CVTDSSAC EQU   CVTS01+122                                               04274000
CVTRV513 EQU   CVTS01+121                                               04275000
CVTIOSPL EQU   CVTS01+120                                               04276000
CVTPTGT  EQU   CVTS01+116                                               04277000
CVTCSPIE EQU   CVTS01+112                                               04278000
CVTSMFEX EQU   CVTS01+108                                               04279000
CVTOLT0A EQU   CVTS01+104                                               04280000
CVTPUTL  EQU   CVTS01+96                                                04281000
CVTASCRL EQU   CVTS01+92                                                04282000
CVTASCRF EQU   CVTS01+88                                                04283000
CVTRV326 EQU   CVTS01+84                                                04284000
CVTRV325 EQU   CVTS01+80                                                04285000
CVTRV324 EQU   CVTS01+76                                                04286000
CVT0VL01 EQU   CVTS01+72                                                04287000
CVTSHRVM EQU   CVTS01+68                                                04288000
CVTRV332 EQU   CVTS01+64                                                04289000
CVTTAS   EQU   CVTS01+60                                                04290000
CVTRSCN  EQU   CVTS01+56                                                04291000
CVTTRAC2 EQU   CVTS01+54                                                04292000
CVTTRACE EQU   CVTS01+52                                                04293000
CVTAPG   EQU   CVTS01+51                                                04294000
CVTSDTRC EQU   CVTCTLFG                                                 04295000
CVTGTRCE EQU   CVTCTLFG                                                 04296000
CVTNOMP  EQU   CVTCTLFG                                                 04297000
CVTRSV79 EQU   CVTCTLFG                                                 04298000
CVTDSTAT EQU   CVTCTLFG                                                 04299000
CVTRSV78 EQU   CVTCTLFG                                                 04300000
CVTRV333 EQU   CVTCTLFG                                                 04301000
CVTRV323 EQU   CVTCTLFG                                                 04302000
CVTSPVLK EQU   CVTS01+49                                                04303000
CVTRSV77 EQU   CVTS01+48                                                04304000
CVTRV331 EQU   CVTS01+44                                                04305000
CVTRV330 EQU   CVTS01+40                                                04306000
CVTRV329 EQU   CVTS01+36                                                04307000
CVTRV328 EQU   CVTS01+32                                                04308000
CVTRV322 EQU   CVTS01+28                                                04309000
CVTSLID  EQU   CVTSLIDA+1                                               04310000
CVTSYLK  EQU   CVTSLIDA                                                 04311000
CVTRV321 EQU   CVTS01+20                                                04312000
CVTRV320 EQU   CVTS01+16                                                04313000
CVTLPDIR EQU   CVTLPDIA+1                                               04314000
CVTRSV69 EQU   CVTDIRST                                                 04315000
CVTRSV68 EQU   CVTDIRST                                                 04316000
CVTRSV67 EQU   CVTDIRST                                                 04317000
CVTRSV66 EQU   CVTDIRST                                                 04318000
CVTRSV65 EQU   CVTDIRST                                                 04319000
CVTRSV64 EQU   CVTDIRST                                                 04320000
CVTRSV63 EQU   CVTDIRST                                                 04321000
CVTDICOM EQU   CVTDIRST                                                 04322000
CVTPVTP  EQU   CVTS01+8                                                 04323000
CVTLPDSR EQU   CVTS01+4                                                 04324000
CVTGETL  EQU   CVTS01                                                   04325000
@NM00140 EQU   RSTIERP+5                                                04326000
@NM00139 EQU   RSTICHPF                                                 04327000
RSTIUCB  EQU   RSTIERP                                                  04328000
@NM00138 EQU   IORFRRA+10                                               04329000
FRRLCSYS EQU   IORFRRA+9                                                04330000
@NM00137 EQU   FRRFLGS                                                  04331000
@NM00128 EQU   MSG410+40                                                04332000
TXT4102  EQU   MSG410+24                                                04333000
TXTCOMMA EQU   MSG410+22                                                04334000
TXT4101  EQU   MSG410+4                                                 04335000
@NM00127 EQU   MSG410                                                   04336000
@NM00126 EQU   MSG969+75                                                04337000
TXT969   EQU   MSG969+4                                                 04338000
@NM00125 EQU   MSG969                                                   04339000
@NM00124 EQU   MSG005+61                                                04340000
TXT14    EQU   MSG005+60                                                04341000
TXT13    EQU   MSG005+49                                                04342000
TXT12    EQU   MSG005+22                                                04343000
TXT11    EQU   MSG005+4                                                 04344000
@NM00123 EQU   MSG005                                                   04345000
@NM00122 EQU   MSG004+84                                                04346000
TXT2     EQU   MSG004+51                                                04347000
TXT1     EQU   MSG004+4                                                 04348000
@NM00121 EQU   MSG004                                                   04349000
@NM00120 EQU   MSG003+58                                                04350000
TXT22    EQU   MSG003+41                                                04351000
TXT21    EQU   MSG003+4                                                 04352000
@NM00119 EQU   MSG003                                                   04353000
@NM00118 EQU   MSGBLOCK+6                                               04354000
@NM00117 EQU   ENT                                                      04355000
SYSMASK  EQU   IORWORK+119                                              04356000
@NM00116 EQU   FLAGS+2                                                  04357000
@NM00115 EQU   FLAG2                                                    04358000
IOSGENNG EQU   FLAG2                                                    04359000
SMGRBLCK EQU   FLAG2                                                    04360000
@NM00114 EQU   FLAG2                                                    04361000
@NM00113 EQU   FLAG1                                                    04362000
IORESID  EQU   IORCSW+6                                                 04363000
IORCSTAT EQU   IORSTAT+1                                                04364000
IORDSTAT EQU   IORSTAT                                                  04365000
IORCMD   EQU   IORCSW+1                                                 04366000
@NM00112 EQU   IORCSW                                                   04367000
@NM00111 EQU   LCCRHFLG                                                 04368000
CRHCHLST EQU   LCCRHFLG                                                 04369000
CNTRLSAV EQU   IORWORK+76                                               04370000
@NM00110 EQU   IORWORK+16                                               04371000
PWACCTHB EQU   PWA+992                                                  04372000
PWAPTTHB EQU   PWA+976                                                  04373000
PWATCTHB EQU   PWA+960                                                  04374000
PWAIVTHB EQU   PWA+944                                                  04375000
PWASDTHB EQU   PWA+928                                                  04376000
PWAPDTHB EQU   PWA+912                                                  04377000
PWANRSRB EQU   PWA+868                                                  04378000
PWACCSRB EQU   PWA+824                                                  04379000
PWAWRK   EQU   PWA+792                                                  04380000
PWATEST  EQU   PWA+784                                                  04381000
PWACPUAD EQU   PWA+782                                                  04382000
@NM00109 EQU   PWA+781                                                  04383000
PWACNTR  EQU   PWA+780                                                  04384000
@NM00108 EQU   PWAFLAGS                                                 04385000
PWAENABL EQU   PWAFLAGS                                                 04386000
PWANRHED EQU   PWAFLAGS                                                 04387000
PWACCHED EQU   PWAFLAGS                                                 04388000
PWAREST  EQU   PWAFLAGS                                                 04389000
PWAINIT  EQU   PWA+777                                                  04390000
PWAMFAFL EQU   PWA+776                                                  04391000
PWARPSW  EQU   PWA+768                                                  04392000
PWARGPR  EQU   PWA+704                                                  04393000
PWACR15  EQU   PWA+700                                                  04394000
PWACR14  EQU   PWA+696                                                  04395000
PWASFLC  EQU   PWA+464                                                  04396000
PWAINTC  EQU   PWA+456                                                  04397000
PWASOSW  EQU   PWA+448                                                  04398000
PWAFRR00 EQU   PWAFRR+12                                                04399000
PWAFRR15 EQU   PWAFRR+8                                                 04400000
PWAFRR13 EQU   PWAFRR+4                                                 04401000
PWAFRR12 EQU   PWAFRR                                                   04402000
PWAFRRCT EQU   PWA+380                                                  04403000
PWAFRRCD EQU   PWA+376                                                  04404000
PWADGTHB EQU   PWA+368                                                  04405000
PWASRTHB EQU   PWA+360                                                  04406000
PWAESA   EQU   PWA+288                                                  04407000
PWASA4   EQU   PWA+216                                                  04408000
PWASA3   EQU   PWA+144                                                  04409000
PWASA2   EQU   PWA+72                                                   04410000
PWASA1   EQU   PWA                                                      04411000
LCHEND   EQU   LCH+32                                                   04412000
LCHPYBSY EQU   LCH+30                                                   04413000
LCHLGBSY EQU   LCH+28                                                   04414000
LCHRSV03 EQU   LCH+26                                                   04415000
LCHTOTAL EQU   LCH+24                                                   04416000
LCHRSV02 EQU   LCH+22                                                   04417000
@NM00107 EQU   LCHFLA                                                   04418000
LCHLKHLD EQU   LCHFLA                                                   04419000
LCHCHCNT EQU   LCH+20                                                   04420000
LCHTCH   EQU   LCH+16                                                   04421000
LCHRSV01 EQU   LCH+12                                                   04422000
LCHLOCK  EQU   LCH+8                                                    04423000
LCHLST   EQU   LCH+4                                                    04424000
LCHFST   EQU   LCHENTRY                                                 04425000
CATEND   EQU   CAT+8                                                    04426000
CATCHID  EQU   CAT+4                                                    04427000
CATSIOCT EQU   CAT+2                                                    04428000
CATFLARS EQU   CATFLA                                                   04429000
CATMCRST EQU   CATFLA                                                   04430000
CATCCRST EQU   CATFLA                                                   04431000
CATBSY   EQU   CATFLA                                                   04432000
CATFLG7  EQU   CATFLG                                                   04433000
CATFLG6  EQU   CATFLG                                                   04434000
CATFLG5  EQU   CATFLG                                                   04435000
CATNID   EQU   CATFLG                                                   04436000
CATNCPU  EQU   CATFLG                                                   04437000
CATNGEN  EQU   CATFLG                                                   04438000
CATNOP   EQU   CATFLG                                                   04439000
CATRES1  EQU   CATFLG                                                   04440000
@NM00106 EQU   CSD+160                                                  04441000
CSDMASK  EQU   CSD+128                                                  04442000
CSDUCNT  EQU   CSD+124                                                  04443000
CSDTCNT  EQU   CSD+120                                                  04444000
CSDGDTOD EQU   CSD+116                                                  04445000
CSDGDINT EQU   CSD+112                                                  04446000
CSDGDCC  EQU   CSD+108                                                  04447000
CSDDDRCT EQU   CSD+106                                                  04448000
CSDRV044 EQU   CSD+104                                                  04449000
CSDMAFF  EQU   CSD+24                                                   04450000
CSDRV038 EQU   CSDFLAGS                                                 04451000
CSDRV037 EQU   CSDFLAGS                                                 04452000
CSDRV036 EQU   CSDFLAGS                                                 04453000
CSDRV035 EQU   CSDFLAGS                                                 04454000
CSDRV034 EQU   CSDFLAGS                                                 04455000
CSDRV033 EQU   CSDFLAGS                                                 04456000
CSDRV032 EQU   CSDFLAGS                                                 04457000
CSDMP    EQU   CSDFLAGS                                                 04458000
CSDACR   EQU   CSD+22                                                   04459000
CSDMF1CP EQU   CSD+20                                                   04460000
CSDRV043 EQU   CSD+16                                                   04461000
CSDRV030 EQU   CSDSCFL4                                                 04462000
CSDRV029 EQU   CSDSCFL4                                                 04463000
CSDRV028 EQU   CSDSCFL4                                                 04464000
CSDRV027 EQU   CSDSCFL4                                                 04465000
CSDRV026 EQU   CSDSCFL4                                                 04466000
CSDRV025 EQU   CSDSCFL4                                                 04467000
CSDRV024 EQU   CSDSCFL4                                                 04468000
CSDRV023 EQU   CSDSCFL4                                                 04469000
CSDRV022 EQU   CSDSCFL3                                                 04470000
CSDRV021 EQU   CSDSCFL3                                                 04471000
CSDRV020 EQU   CSDSCFL3                                                 04472000
CSDRV019 EQU   CSDSCFL3                                                 04473000
CSDRV018 EQU   CSDSCFL3                                                 04474000
CSDRV017 EQU   CSDSCFL3                                                 04475000
CSDRV016 EQU   CSDSCFL3                                                 04476000
CSDRV015 EQU   CSDSCFL3                                                 04477000
CSDRV014 EQU   CSDSCFL2                                                 04478000
CSDRV013 EQU   CSDSCFL2                                                 04479000
CSDRV012 EQU   CSDSCFL2                                                 04480000
CSDRV011 EQU   CSDSCFL2                                                 04481000
CSDRV010 EQU   CSDSCFL2                                                 04482000
CSDRV009 EQU   CSDSCFL2                                                 04483000
CSDRV008 EQU   CSDSCFL2                                                 04484000
CSDRV007 EQU   CSDSCFL2                                                 04485000
CSDRV006 EQU   CSDSCFL1                                                 04486000
CSDRV005 EQU   CSDSCFL1                                                 04487000
CSDRV004 EQU   CSDSCFL1                                                 04488000
CSDRV003 EQU   CSDSCFL1                                                 04489000
CSDRV002 EQU   CSDSCFL1                                                 04490000
CSDRV001 EQU   CSDSCFL1                                                 04491000
CSDSYSND EQU   CSDSCFL1                                                 04492000
CSDRV042 EQU   CSDSCFL1                                                 04493000
CSDCPUOL EQU   CSD+10                                                   04494000
CSDSAFF  EQU   CSDCPUAL                                                 04495000
CSDCHAD  EQU   CSD+6                                                    04496000
CSDCPUJS EQU   CSD+4                                                    04497000
CSDCSD   EQU   CSD                                                      04498000
FRRSPARM EQU   FRRSENTR+8                                               04499000
@NM00105 EQU   FRRSFLGS+1                                               04500000
@NM00104 EQU   FRRSFLG1                                                 04501000
FRRSNEST EQU   FRRSFLG1                                                 04502000
FRRSRCUR EQU   FRRSFLG1                                                 04503000
FRRSFRRA EQU   FRRSENTR                                                 04504000
FRRSENTS EQU   FRRS+84                                                  04505000
FRRSRTMW EQU   FRRS+16                                                  04506000
FRRSCURR EQU   FRRSHEAD+12                                              04507000
FRRSELEN EQU   FRRSHEAD+8                                               04508000
FRRSLAST EQU   FRRSHEAD+4                                               04509000
FRRSEMP  EQU   FRRSHEAD                                                 04510000
WSACASMS EQU   WSAC+60                                                  04511000
WSACASMD EQU   WSAC+56                                                  04512000
WSACCCH  EQU   WSAC+52                                                  04513000
WSACRRSA EQU   WSAC+48                                                  04514000
WSACREST EQU   WSAC+44                                                  04515000
WSACABTM EQU   WSAC+36                                                  04516000
WSACMF1  EQU   WSAC+32                                                  04517000
WSACEDS0 EQU   WSAC+28                                                  04518000
WSACIOS  EQU   WSAC+24                                                  04519000
WSACRTMK EQU   WSAC+20                                                  04520000
WSACACR  EQU   WSAC+16                                                  04521000
WSACTIME EQU   WSAC+12                                                  04522000
WSACOPTM EQU   WSAC+8                                                   04523000
WSACGTF  EQU   WSAC+4                                                   04524000
WSACCWSA EQU   WSAC                                                     04525000
IRTEND   EQU   IRT+124                                                  04526000
IRTRSV0B EQU   IRT+120                                                  04527000
IRTRSV0A EQU   IRT+116                                                  04528000
IRTSNSCT EQU   IRT+112                                                  04529000
IRTLCHAD EQU   IRT+108                                                  04530000
IRTSTSSV EQU   IRT+104                                                  04531000
IRTINTSV EQU   IRT+100                                                  04532000
IRTCCHSV EQU   IRT+96                                                   04533000
IRTATTSV EQU   IRT+92                                                   04534000
IRTFRRWA EQU   IRT+88                                                   04535000
IRTNSRB  EQU   IRT+84                                                   04536000
IRTCSME  EQU   IRT+80                                                   04537000
IRTPRGSV EQU   IRT+76                                                   04538000
IRTPCISV EQU   IRT+72                                                   04539000
IRTSENSV EQU   IRT+68                                                   04540000
IRTDIESV EQU   IRT+64                                                   04541000
IRTRSTSV EQU   IRT+60                                                   04542000
IRTSTASV EQU   IRT+56                                                   04543000
IRTSIOSV EQU   IRT+52                                                   04544000
IRTDDSV  EQU   IRT+48                                                   04545000
IRTTCHSV EQU   IRT+44                                                   04546000
IRTRTNSV EQU   IRT+36                                                   04547000
IRTCHMSK EQU   IRT+32                                                   04548000
IRTPSTSV EQU   IRT+28                                                   04549000
IRTNIOQ  EQU   IRT+24                                                   04550000
IRTCHNL  EQU   IRT+20                                                   04551000
IRTIOQ   EQU   IRT+16                                                   04552000
IRTLCH   EQU   IRT+12                                                   04553000
IRTUCB   EQU   IRT+8                                                    04554000
@NM00103 EQU   IRT+7                                                    04555000
IRTCMRST EQU   IRT+6                                                    04556000
IRTCCH   EQU   IRT+5                                                    04557000
IRTSYMSK EQU   IRT+4                                                    04558000
@NM00102 EQU   IRTENTRY+3                                               04559000
IRTCSINT EQU   IRTENVR                                                  04560000
IRTPINT  EQU   IRTENVR                                                  04561000
IRTHIO   EQU   IRTENVR                                                  04562000
IRTRSTI  EQU   IRTENVR                                                  04563000
@NM00101 EQU   IRTENVR                                                  04564000
IRTSHTP  EQU   IRTENVR                                                  04565000
IRTSLIHA EQU   IRTENVR                                                  04566000
IRTCHENT EQU   IRTENVR                                                  04567000
@NM00100 EQU   IRTFLB                                                   04568000
IRTCCHWA EQU   IRTFLB                                                   04569000
IRT12GT  EQU   IRTFLB                                                   04570000
IRTSMGR  EQU   IRTFLB                                                   04571000
IRTCHBSY EQU   IRTFLB                                                   04572000
IRTPCISW EQU   IRTFLB                                                   04573000
IRTSKRST EQU   IRTFLB                                                   04574000
IRTNRST  EQU   IRTFLB                                                   04575000
@NM00099 EQU   IRTFLA                                                   04576000
IRTSLISN EQU   IRTFLA                                                   04577000
IRTIOQA  EQU   IRTFLA                                                   04578000
IRTALCK  EQU   IRTFLA                                                   04579000
IRTCLCK  EQU   IRTFLA                                                   04580000
IRTSLCK  EQU   IRTFLA                                                   04581000
IRTLLCK  EQU   IRTFLA                                                   04582000
IRTULCK  EQU   IRTFLA                                                   04583000
@NM00098 EQU   PCCA+512                                                 04584000
PCCARV36 EQU   PCCA+380                                                 04585000
PCCARV35 EQU   PCCA+378                                                 04586000
PCCARV01 EQU   PCCA+377                                                 04587000
PCCAR105 EQU   PCCAATTR                                                 04588000
PCCAR104 EQU   PCCAATTR                                                 04589000
PCCAR103 EQU   PCCAATTR                                                 04590000
PCCAR102 EQU   PCCAATTR                                                 04591000
PCCAR101 EQU   PCCAATTR                                                 04592000
PCCAR100 EQU   PCCAATTR                                                 04593000
PCCAIO   EQU   PCCAATTR                                                 04594000
PCCACPUM EQU   PCCAATTR                                                 04595000
PCCARV63 EQU   PCCA+372                                                 04596000
PCCARV62 EQU   PCCA+368                                                 04597000
PCCARV61 EQU   PCCA+364                                                 04598000
PCCARV60 EQU   PCCA+360                                                 04599000
PCCARV59 EQU   PCCA+356                                                 04600000
PCCARV58 EQU   PCCA+352                                                 04601000
PCCARV57 EQU   PCCA+348                                                 04602000
PCCARV56 EQU   PCCA+344                                                 04603000
PCCARV55 EQU   PCCA+340                                                 04604000
PCCARV54 EQU   PCCA+336                                                 04605000
PCCALOGA EQU   PCCA+332                                                 04606000
PCCACHID EQU   PCCA+324                                                 04607000
PCCACHSV EQU   PCCA+312                                                 04608000
PCCARV79 EQU   PCCACHF4                                                 04609000
PCCARV78 EQU   PCCACHF4                                                 04610000
PCCARV77 EQU   PCCACHF4                                                 04611000
PCCARV76 EQU   PCCACHF4                                                 04612000
PCCARV75 EQU   PCCACHF4                                                 04613000
PCCARV74 EQU   PCCACHF4                                                 04614000
PCCARV73 EQU   PCCACHF4                                                 04615000
PCCARV72 EQU   PCCACHF4                                                 04616000
PCCARV71 EQU   PCCACHF3                                                 04617000
PCCARV70 EQU   PCCACHF3                                                 04618000
PCCARV69 EQU   PCCACHF3                                                 04619000
PCCARV68 EQU   PCCACHF3                                                 04620000
PCCARV67 EQU   PCCACHF3                                                 04621000
PCCARV66 EQU   PCCACHF3                                                 04622000
PCCASLCK EQU   PCCACHF3                                                 04623000
PCCAISRB EQU   PCCACHF3                                                 04624000
PCCACF28 EQU   PCCACHF2                                                 04625000
PCCACF27 EQU   PCCACHF2                                                 04626000
PCCACF26 EQU   PCCACHF2                                                 04627000
PCCACF25 EQU   PCCACHF2                                                 04628000
PCCACF24 EQU   PCCACHF2                                                 04629000
PCCACF23 EQU   PCCACHF2                                                 04630000
PCCACF22 EQU   PCCACHF2                                                 04631000
PCCACF21 EQU   PCCACHF2                                                 04632000
PCCACF18 EQU   PCCACHF1                                                 04633000
PCCACF17 EQU   PCCACHF1                                                 04634000
PCCACF16 EQU   PCCACHF1                                                 04635000
PCCACF15 EQU   PCCACHF1                                                 04636000
PCCACF14 EQU   PCCACHF1                                                 04637000
PCCACF13 EQU   PCCACHF1                                                 04638000
PCCACF12 EQU   PCCACHF1                                                 04639000
PCCACF11 EQU   PCCACHF1                                                 04640000
PCCARV05 EQU   PCCA+307                                                 04641000
PCCACHPB EQU   PCCA+306                                                 04642000
PCCALGP2 EQU   PCCA+305                                                 04643000
PCCALGP1 EQU   PCCA+304                                                 04644000
PCCACELL EQU   PCCA+302                                                 04645000
PCCALOGL EQU   PCCA+300                                                 04646000
PCCACHW2 EQU   PCCA+296                                                 04647000
PCCACHW1 EQU   PCCA+292                                                 04648000
PCCAIOSI EQU   PCCA+291                                                 04649000
PCCACNRB EQU   PCCACHRB                                                 04650000
PCCACCVB EQU   PCCACHRB                                                 04651000
PCCACSNB EQU   PCCACHRB                                                 04652000
PCCARV52 EQU   PCCACHRB                                                 04653000
PCCACHIB EQU   PCCACHRB                                                 04654000
PCCACTIB EQU   PCCACHRB                                                 04655000
PCCACINB EQU   PCCACHRB                                                 04656000
PCCACSIB EQU   PCCACHRB                                                 04657000
PCCARV51 EQU   PCCACHS2                                                 04658000
PCCARV50 EQU   PCCACHS2                                                 04659000
PCCACCRA EQU   PCCACHS2                                                 04660000
PCCACURC EQU   PCCACHS2                                                 04661000
PCCACNLG EQU   PCCACHS2                                                 04662000
PCCACMOD EQU   PCCACHS2                                                 04663000
PCCACALT EQU   PCCACHS2                                                 04664000
PCCACIOR EQU   PCCACHS2                                                 04665000
PCCARV47 EQU   PCCACHS1                                                 04666000
PCCACUCB EQU   PCCACHS1                                                 04667000
PCCACIBC EQU   PCCACHS1                                                 04668000
PCCACAND EQU   PCCACHS1                                                 04669000
PCCACNLS EQU   PCCACHS1                                                 04670000
PCCACFRR EQU   PCCACHS1                                                 04671000
PCCACNRE EQU   PCCACHS1                                                 04672000
PCCACCMP EQU   PCCACHS1                                                 04673000
PCCACSEQ EQU   PCCACHTS                                                 04674000
PCCACDIN EQU   PCCACHTS                                                 04675000
PCCARV44 EQU   PCCACHTS                                                 04676000
PCCARV43 EQU   PCCACHTS                                                 04677000
PCCACTEC EQU   PCCACHTS                                                 04678000
PCCACDAV EQU   PCCACHVA                                                 04679000
PCCACCHV EQU   PCCACHVA                                                 04680000
PCCACCMD EQU   PCCACHVA                                                 04681000
PCCACUNS EQU   PCCACHVA                                                 04682000
PCCACSQV EQU   PCCACHVA                                                 04683000
PCCARV42 EQU   PCCACHVA                                                 04684000
PCCARV41 EQU   PCCACHVA                                                 04685000
PCCACITF EQU   PCCACHVA                                                 04686000
PCCARV40 EQU   PCCACHBL                                                 04687000
PCCARV39 EQU   PCCACHBL                                                 04688000
PCCARV38 EQU   PCCACHBL                                                 04689000
PCCACCUE EQU   PCCACHBL                                                 04690000
PCCACSTG EQU   PCCACHBL                                                 04691000
PCCACSCU EQU   PCCACHBL                                                 04692000
PCCACCNT EQU   PCCACHPF                                                 04693000
PCCACSNS EQU   PCCACHPF                                                 04694000
PCCARV37 EQU   PCCACHPF                                                 04695000
PCCACHIO EQU   PCCACHPF                                                 04696000
PCCACTIO EQU   PCCACHPF                                                 04697000
PCCACINT EQU   PCCACHPF                                                 04698000
PCCACSIO EQU   PCCACHPF                                                 04699000
PCCAR106 EQU   PCCA+228                                                 04700000
PCCAR113 EQU   PCCA+226                                                 04701000
PCCASRBL EQU   PCCA+225                                                 04702000
PCCAR112 EQU   PCCACHAN                                                 04703000
PCCAR111 EQU   PCCACHAN                                                 04704000
PCCAR110 EQU   PCCACHAN                                                 04705000
PCCAR109 EQU   PCCACHAN                                                 04706000
PCCAR108 EQU   PCCACHAN                                                 04707000
PCCAR107 EQU   PCCACHAN                                                 04708000
PCCAEXDM EQU   PCCACHAN                                                 04709000
PCCAIRST EQU   PCCACHAN                                                 04710000
PCCASRB  EQU   PCCA+180                                                 04711000
PCCACCHM EQU   PCCA+176                                                 04712000
PCCAELBA EQU   PCCA+172                                                 04713000
PCCALRBR EQU   PCCA+164                                                 04714000
PCCALRBV EQU   PCCA+160                                                 04715000
PCCAPWAR EQU   PCCA+156                                                 04716000
PCCAEMSA EQU   PCCAEMSB+12                                              04717000
PCCAEMSE EQU   PCCAEMSB+8                                               04718000
PCCAEMSP EQU   PCCAEMSB+4                                               04719000
PCCARMS  EQU   PCCARMSB                                                 04720000
PCCARV34 EQU   PCCARMSB                                                 04721000
PCCARV33 EQU   PCCARMSB                                                 04722000
PCCARV32 EQU   PCCARMSB                                                 04723000
PCCARV31 EQU   PCCARMSB                                                 04724000
PCCARV30 EQU   PCCARMSB                                                 04725000
PCCARV29 EQU   PCCARMSB                                                 04726000
PCCARV28 EQU   PCCARMSB                                                 04727000
PCCARV27 EQU   PCCAEMS3                                                 04728000
PCCARV26 EQU   PCCAEMS3                                                 04729000
PCCARV25 EQU   PCCAEMS3                                                 04730000
PCCARV24 EQU   PCCAEMS3                                                 04731000
PCCARV23 EQU   PCCAEMS3                                                 04732000
PCCARV22 EQU   PCCAEMS3                                                 04733000
PCCARV21 EQU   PCCAEMS3                                                 04734000
PCCARV20 EQU   PCCAEMS3                                                 04735000
PCCARV19 EQU   PCCAEMS2                                                 04736000
PCCARV18 EQU   PCCAEMS2                                                 04737000
PCCARV17 EQU   PCCAEMS2                                                 04738000
PCCARV16 EQU   PCCAEMS2                                                 04739000
PCCARV15 EQU   PCCAEMS2                                                 04740000
PCCARV14 EQU   PCCAEMS2                                                 04741000
PCCARV13 EQU   PCCAEMS2                                                 04742000
PCCARV12 EQU   PCCAEMS2                                                 04743000
PCCARV11 EQU   PCCARISP                                                 04744000
PCCARV10 EQU   PCCARISP                                                 04745000
PCCARV09 EQU   PCCARISP                                                 04746000
PCCARV08 EQU   PCCARISP                                                 04747000
PCCARV07 EQU   PCCARISP                                                 04748000
PCCARV06 EQU   PCCARISP                                                 04749000
PCCASERL EQU   PCCARISP                                                 04750000
PCCAPARL EQU   PCCARISP                                                 04751000
PCCARPB  EQU   PCCA+132                                                 04752000
PCCACTIN EQU   PCCAINTE                                                 04753000
PCCANFIN EQU   PCCAINTE                                                 04754000
PCCANUIN EQU   PCCAINTE                                                 04755000
PCCACTCC EQU   PCCACCE                                                  04756000
PCCANFCC EQU   PCCACCE                                                  04757000
PCCANUCC EQU   PCCACCE                                                  04758000
PCCACTTD EQU   PCCATODE                                                 04759000
PCCANFTD EQU   PCCATODE                                                 04760000
PCCANUTD EQU   PCCATODE                                                 04761000
PCCARV04 EQU   PCCATMFL                                                 04762000
PCCARV03 EQU   PCCATMFL                                                 04763000
PCCARV02 EQU   PCCATMFL                                                 04764000
PCCAMINT EQU   PCCATMFL                                                 04765000
PCCAMCC  EQU   PCCATMFL                                                 04766000
PCCAVKIL EQU   PCCATMFL                                                 04767000
PCCASYNC EQU   PCCATMFL                                                 04768000
PCCAINIT EQU   PCCATMFL                                                 04769000
PCCARV9E EQU   PCCA+124                                                 04770000
PCCARV9D EQU   PCCA+120                                                 04771000
PCCARV9C EQU   PCCA+116                                                 04772000
PCCARV9B EQU   PCCA+112                                                 04773000
PCCARV9A EQU   PCCA+108                                                 04774000
PCCARV99 EQU   PCCA+104                                                 04775000
PCCARV98 EQU   PCCA+100                                                 04776000
PCCARV97 EQU   PCCA+96                                                  04777000
PCCARV96 EQU   PCCA+92                                                  04778000
PCCARV95 EQU   PCCA+88                                                  04779000
PCCARV94 EQU   PCCA+84                                                  04780000
PCCARV93 EQU   PCCA+80                                                  04781000
PCCARV92 EQU   PCCA+76                                                  04782000
PCCARV91 EQU   PCCA+72                                                  04783000
PCCARV90 EQU   PCCA+68                                                  04784000
PCCARV89 EQU   PCCA+64                                                  04785000
PCCARV88 EQU   PCCA+60                                                  04786000
PCCARV87 EQU   PCCA+56                                                  04787000
PCCARV86 EQU   PCCA+52                                                  04788000
PCCARV85 EQU   PCCA+48                                                  04789000
PCCARV84 EQU   PCCA+44                                                  04790000
PCCARV83 EQU   PCCA+40                                                  04791000
PCCARV82 EQU   PCCA+36                                                  04792000
PCCARV81 EQU   PCCA+32                                                  04793000
PCCAPSAR EQU   PCCA+28                                                  04794000
PCCAPSAV EQU   PCCA+24                                                  04795000
PCCATQEP EQU   PCCA+20                                                  04796000
PCCACAFM EQU   PCCA+18                                                  04797000
PCCAPCCA EQU   PCCA                                                     04798000
LCCAR125 EQU   LCCA+964                                                 04799000
LCCAR124 EQU   LCCA+960                                                 04800000
LCCASGPR EQU   LCCA+896                                                 04801000
LCCADRT2 EQU   LCCA+888                                                 04802000
LCCADRT1 EQU   LCCA+880                                                 04803000
LCCAR103 EQU   LCCA+876                                                 04804000
LCCAESS2 EQU   LCCA+872                                                 04805000
LCCASPLJ EQU   LCCA+868                                                 04806000
LCCASMQJ EQU   LCCA+864                                                 04807000
LCCAASID EQU   LCCA+732                                                 04808000
LCCARV89 EQU   LCCA+728                                                 04809000
LCCAPGTA EQU   LCCASRBF+2                                               04810000
LCCASAFN EQU   LCCASRBF                                                 04811000
LCCAECSA EQU   LCCA+716                                                 04812000
LCCAICR0 EQU   LCCA+712                                                 04813000
LCCALWTM EQU   LCCA+704                                                 04814000
LCCARV78 EQU   LCCA+700                                                 04815000
LCCAPINV EQU   LCCA+696                                                 04816000
LCCARV88 EQU   LCCA+695                                                 04817000
LCCARV87 EQU   LCCALKFG                                                 04818000
LCCARV86 EQU   LCCALKFG                                                 04819000
LCCARV85 EQU   LCCALKFG                                                 04820000
LCCARV84 EQU   LCCALKFG                                                 04821000
LCCALKRD EQU   LCCALKFG                                                 04822000
LCCALKAQ EQU   LCCALKFG                                                 04823000
LCCALKSA EQU   LCCALKFG                                                 04824000
LCCALKDP EQU   LCCALKFG                                                 04825000
LCCACRST EQU   LCCACREX                                                 04826000
LCCACRDP EQU   LCCACREX                                                 04827000
LCCACRLM EQU   LCCACREX                                                 04828000
LCCACRIN EQU   LCCACREX                                                 04829000
LCCACRRT EQU   LCCACREX                                                 04830000
LCCACRLE EQU   LCCACREX                                                 04831000
LCCACRRM EQU   LCCACREX                                                 04832000
LCCACREF EQU   LCCACREX                                                 04833000
LCCAVARY EQU   LCCACRFL                                                 04834000
LCCARV73 EQU   LCCACRFL                                                 04835000
LCCARV72 EQU   LCCACRFL                                                 04836000
LCCARV71 EQU   LCCACRFL                                                 04837000
LCCARV70 EQU   LCCACRFL                                                 04838000
LCCARV69 EQU   LCCACRFL                                                 04839000
LCCACLMS EQU   LCCACRFL                                                 04840000
LCCACRTM EQU   LCCACRFL                                                 04841000
LCCALCR0 EQU   LCCA+688                                                 04842000
LCCACRLC EQU   LCCA+684                                                 04843000
LCCARCPU EQU   LCCA+680                                                 04844000
LCCADCPU EQU   LCCA+676                                                 04845000
LCCASRBJ EQU   LCCA+672                                                 04846000
LCCADSSR EQU   LCCA+668                                                 04847000
LCCADSSC EQU   LCCA+660                                                 04848000
LCCADSS3 EQU   LCCA+648                                                 04849000
LCCADSS2 EQU   LCCA+636                                                 04850000
LCCADSS1 EQU   LCCA+624                                                 04851000
LCCAWTIM EQU   LCCA+616                                                 04852000
LCCAITOD EQU   LCCA+608                                                 04853000
LCCADTOD EQU   LCCA+600                                                 04854000
LCCASTOD EQU   LCCA+592                                                 04855000
LCCARIR5 EQU   LCCASPSA+44                                              04856000
LCCARIR4 EQU   LCCASPSA+40                                              04857000
LCCARIR3 EQU   LCCASPSA+36                                              04858000
LCCARIR2 EQU   LCCASPSA+32                                              04859000
LCCARPR5 EQU   LCCASPSA+28                                              04860000
LCCARPR4 EQU   LCCASPSA+24                                              04861000
LCCARPR3 EQU   LCCASPSA+20                                              04862000
LCCARPR2 EQU   LCCASPSA+16                                              04863000
LCCADSR5 EQU   LCCASPSA+12                                              04864000
LCCADSR4 EQU   LCCASPSA+8                                               04865000
LCCADSR3 EQU   LCCASPSA+4                                               04866000
LCCADSR2 EQU   LCCASPSA                                                 04867000
LCCARV68 EQU   LCCA+543                                                 04868000
LCCAPSMK EQU   LCCA+542                                                 04869000
LCCARV67 EQU   LCCADSF2                                                 04870000
LCCARV66 EQU   LCCADSF2                                                 04871000
LCCARV65 EQU   LCCADSF2                                                 04872000
LCCARV64 EQU   LCCADSF2                                                 04873000
LCCADSRW EQU   LCCADSF2                                                 04874000
LCCADSPL EQU   LCCADSF2                                                 04875000
LCCAGSRB EQU   LCCADSF2                                                 04876000
LCCASRBM EQU   LCCADSF2                                                 04877000
LCCARV61 EQU   LCCADSF1                                                 04878000
LCCARV60 EQU   LCCADSF1                                                 04879000
LCCARV59 EQU   LCCADSF1                                                 04880000
LCCARV58 EQU   LCCADSF1                                                 04881000
LCCATIMR EQU   LCCADSF1                                                 04882000
LCCADSS  EQU   LCCADSF1                                                 04883000
LCCAVCPU EQU   LCCADSF1                                                 04884000
LCCAACR  EQU   LCCADSF1                                                 04885000
LCCAASCP EQU   LCCA+532                                                 04886000
LCCAESSA EQU   LCCA+528                                                 04887000
LCCARV55 EQU   LCCASPN4                                                 04888000
LCCARV54 EQU   LCCASPN4                                                 04889000
LCCARV53 EQU   LCCASPN4                                                 04890000
LCCARV52 EQU   LCCASPN4                                                 04891000
LCCARV51 EQU   LCCASPN4                                                 04892000
LCCARV50 EQU   LCCASPN4                                                 04893000
LCCARV49 EQU   LCCASPN4                                                 04894000
LCCARV48 EQU   LCCASPN4                                                 04895000
LCCARV47 EQU   LCCASPN3                                                 04896000
LCCARV46 EQU   LCCASPN3                                                 04897000
LCCARV45 EQU   LCCASPN3                                                 04898000
LCCARV44 EQU   LCCASPN3                                                 04899000
LCCARV43 EQU   LCCASPN3                                                 04900000
LCCARV42 EQU   LCCASPN3                                                 04901000
LCCARV41 EQU   LCCASPN3                                                 04902000
LCCARV40 EQU   LCCASPN3                                                 04903000
LCCARV39 EQU   LCCASPN2                                                 04904000
LCCARV38 EQU   LCCASPN2                                                 04905000
LCCARV37 EQU   LCCASPN2                                                 04906000
LCCARV36 EQU   LCCASPN2                                                 04907000
LCCARV35 EQU   LCCASPN2                                                 04908000
LCCARV34 EQU   LCCASPN2                                                 04909000
LCCARV33 EQU   LCCASPN2                                                 04910000
LCCARV32 EQU   LCCASPN2                                                 04911000
LCCARV31 EQU   LCCASPN1                                                 04912000
LCCARV30 EQU   LCCASPN1                                                 04913000
LCCAMFIO EQU   LCCASPN1                                                 04914000
LCCARSTR EQU   LCCASPN1                                                 04915000
LCCATSPN EQU   LCCASPN1                                                 04916000
LCCALOCK EQU   LCCASPN1                                                 04917000
LCCASIGP EQU   LCCASPN1                                                 04918000
LCCAPTLB EQU   LCCASPN1                                                 04919000
LCCARV27 EQU   LCCAIHR4                                                 04920000
LCCARV26 EQU   LCCAIHR4                                                 04921000
LCCARV25 EQU   LCCAIHR4                                                 04922000
LCCARV24 EQU   LCCAIHR4                                                 04923000
LCCARV23 EQU   LCCAIHR4                                                 04924000
LCCARV22 EQU   LCCAIHR4                                                 04925000
LCCARV21 EQU   LCCAIHR4                                                 04926000
LCCARV20 EQU   LCCAIHR4                                                 04927000
LCCARV19 EQU   LCCAIHR3                                                 04928000
LCCARV18 EQU   LCCAIHR3                                                 04929000
LCCARV17 EQU   LCCAIHR3                                                 04930000
LCCARV16 EQU   LCCAIHR3                                                 04931000
LCCARV15 EQU   LCCAIHR3                                                 04932000
LCCARV14 EQU   LCCAIHR3                                                 04933000
LCCARV13 EQU   LCCAIHR3                                                 04934000
LCCARV12 EQU   LCCAIHR3                                                 04935000
LCCARV11 EQU   LCCAIHR2                                                 04936000
LCCARV10 EQU   LCCAIHR2                                                 04937000
LCCARV09 EQU   LCCAIHR2                                                 04938000
LCCARV08 EQU   LCCAIHR2                                                 04939000
LCCARV07 EQU   LCCAIHR2                                                 04940000
LCCARV06 EQU   LCCAIHR2                                                 04941000
LCCARV05 EQU   LCCAIHR2                                                 04942000
LCCARV04 EQU   LCCAIHR2                                                 04943000
LCCARV03 EQU   LCCAIHR1                                                 04944000
LCCARV02 EQU   LCCAIHR1                                                 04945000
LCCARV01 EQU   LCCAIHR1                                                 04946000
LCCAPPIE EQU   LCCAIHR1                                                 04947000
LCCAPSG1 EQU   LCCAIHR1                                                 04948000
LCCAPDAT EQU   LCCAIHR1                                                 04949000
LCCAXRC2 EQU   LCCAIHR1                                                 04950000
LCCAXRC1 EQU   LCCAIHR1                                                 04951000
LCCAIOPS EQU   LCCA+512                                                 04952000
LCCAGPGR EQU   LCCA+448                                                 04953000
LCCAR133 EQU   LCCA+444                                                 04954000
LCCAR132 EQU   LCCA+440                                                 04955000
LCCAR131 EQU   LCCA+436                                                 04956000
LCCAR130 EQU   LCCA+432                                                 04957000
LCCAR129 EQU   LCCA+428                                                 04958000
LCCAR128 EQU   LCCA+424                                                 04959000
LCCAR127 EQU   LCCA+420                                                 04960000
LCCAR126 EQU   LCCA+416                                                 04961000
LCCARSGR EQU   LCCA+352                                                 04962000
LCCAXGR3 EQU   LCCA+288                                                 04963000
LCCAXGR2 EQU   LCCA+224                                                 04964000
LCCAXGR1 EQU   LCCA+160                                                 04965000
LCCACR0  EQU   LCCA+156                                                 04966000
LCCAMCR1 EQU   LCCA+152                                                 04967000
LCCAPVAD EQU   LCCA+148                                                 04968000
LCCAPINT EQU   LCCA+144                                                 04969000
LCCAPPSW EQU   LCCA+136                                                 04970000
LCCAPGR2 EQU   LCCA+72                                                  04971000
LCCAPGR1 EQU   LCCA+8                                                   04972000
LCCARV77 EQU   LCCA+6                                                   04973000
LCCACPUA EQU   LCCA+4                                                   04974000
LCCALCCA EQU   LCCA                                                     04975000
IOXEND   EQU   IOCX+32                                                  04976000
IOXPSIF  EQU   IOCX+28                                                  04977000
IOXPSIX  EQU   IOCX+24                                                  04978000
IOXSTIDC EQU   IOCX+20                                                  04979000
IOXCRHD  EQU   IOCX+16                                                  04980000
IOXTCQSC EQU   IOCX+8                                                   04981000
@NM00071 EQU   IOCX+6                                                   04982000
IOXLCHCT EQU   IOCX+5                                                   04983000
IOXCHMSK EQU   IOCX+2                                                   04984000
IOXOFSET EQU   IOX                                                      04985000
IOCOEND  EQU   IOCOM+128                                                04986000
IOCPATCH EQU   IOCOM+124                                                04987000
IOCQCNT  EQU   IOCOM+116                                                04988000
IOCIOSDQ EQU   IOCOM+112                                                04989000
IOCIOSEQ EQU   IOCOM+108                                                04990000
IOCSVCF  EQU   IOCOM+104                                                04991000
IOCTCCW  EQU   IOCOM+100                                                04992000
IOCMFCNT EQU   IOCOM+92                                                 04993000
IOCMFHK  EQU   IOCOM+88                                                 04994000
IOCGENA  EQU   IOCOM+84                                                 04995000
IOCCCH   EQU   IOCOM+80                                                 04996000
IOCASYNQ EQU   IOCOM+76                                                 04997000
IOCLCHTB EQU   IOCOM+72                                                 04998000
IOCATTBL EQU   IOCOM+68                                                 04999000
IOCSYNCH EQU   IOCOM+56                                                 05000000
IOCCATLK EQU   IOCOM+48                                                 05001000
IOCPRGID EQU   IOCOM+44                                                 05002000
IOCVOID  EQU   IOCOM+32                                                 05003000
IOCSTIO  EQU   IOCOM+28                                                 05004000
IOCSCOMP EQU   IOCOM+24                                                 05005000
IOCHD160 EQU   IOCOM+20                                                 05006000
IOCINT   EQU   IOCOM+16                                                 05007000
IOCCTBL  EQU   IOCOM+12                                                 05008000
IOCHIO   EQU   IOCOM+8                                                  05009000
IOCPST   EQU   IOCOM+4                                                  05010000
IOCPGCT  EQU   IOCOM+2                                                  05011000
IOCVOICT EQU   IOCOM                                                    05012000
IOSEND   EQU   IOSB+108                                                 05013000
IOSSKR   EQU   IOSEEKA+7                                                05014000
IOSSKH2  EQU   IOSSKHH+1                                                05015000
IOSSKH1  EQU   IOSSKHH                                                  05016000
IOSSKCC  EQU   IOSCCHH                                                  05017000
IOSSKBB  EQU   IOSEEKA+1                                                05018000
IOSSKM   EQU   IOSEEKA                                                  05019000
IOSEEK   EQU   IOSB+92                                                  05020000
IOSMDM   EQU   IOSB+91                                                  05021000
IOSMDB   EQU   IOSB+90                                                  05022000
IOSCKEY7 EQU   IOSCKEY                                                  05023000
IOSCKEY6 EQU   IOSCKEY                                                  05024000
IOSCKEY5 EQU   IOSCKEY                                                  05025000
IOSCKEY4 EQU   IOSCKEY                                                  05026000
@NM00067 EQU   IOSCKEY                                                  05027000
IOSFMSK  EQU   IOSB+88                                                  05028000
IOSCUDEV EQU   IOSPATH+1                                                05029000
@NM00066 EQU   IOSCHN                                                   05030000
IOSPATH3 EQU   IOSCHN                                                   05031000
IOSPATH2 EQU   IOSCHN                                                   05032000
IOSEXP   EQU   IOSCHN                                                   05033000
IOSGDP   EQU   IOSCHN                                                   05034000
IOSAFF   EQU   IOSB+85                                                  05035000
IOSRSS1B EQU   IOSB+84                                                  05036000
IOSDSID  EQU   IOSB+80                                                  05037000
IOSVST   EQU   IOSB+76                                                  05038000
IOSRST   EQU   IOSB+72                                                  05039000
IOSNOTRS EQU   IOSDIEFG                                                 05040000
IOSABN   EQU   IOSB+64                                                  05041000
IOSNRM   EQU   IOSB+60                                                  05042000
IOSPCI   EQU   IOSB+56                                                  05043000
IOSERP   EQU   IOSB+52                                                  05044000
IOSPCHN  EQU   IOSB+48                                                  05045000
IOSSNS   EQU   IOSB+42                                                  05046000
IOSAPMSK EQU   IOSB+40                                                  05047000
IOSRES4A EQU   IOSB+36                                                  05048000
IOSUSE   EQU   IOSB+32                                                  05049000
IOSCSWRC EQU   IOSCSW+5                                                 05050000
IOSTSB   EQU   IOSTATUS+1                                               05051000
IOSTSA   EQU   IOSTATUS                                                 05052000
IOSCSWCA EQU   IOSCSW                                                   05053000
IOSCC    EQU   @NM00065                                                 05054000
IOSUCB   EQU   IOSB+16                                                  05055000
IOSOPT2X EQU   IOSOPT2                                                  05056000
IOSHTP   EQU   IOSOPT2                                                  05057000
IOSRELSE EQU   IOSOPT                                                   05058000
IOSAPR   EQU   IOSOPT                                                   05059000
IOSTSLL  EQU   IOSOPT                                                   05060000
IOSNERP  EQU   IOSOPT                                                   05061000
IOSPSLL  EQU   IOSOPT                                                   05062000
IOSQISCE EQU   IOSOPT                                                   05063000
IOSDEP   EQU   IOSOPT                                                   05064000
IOSBYP   EQU   IOSOPT                                                   05065000
IOSCOD   EQU   IOSB+13                                                  05066000
IOSPKY7  EQU   IOSPKEY                                                  05067000
IOSPGDPX EQU   IOSPKEY                                                  05068000
IOSIDR   EQU   IOSPKEY                                                  05069000
IOSLCL   EQU   IOSPKEY                                                  05070000
@NM00064 EQU   IOSPKEY                                                  05071000
IOSPGAD  EQU   IOSB+8                                                   05072000
IOSASID  EQU   IOSB+6                                                   05073000
IOSPRLVL EQU   IOSB+5                                                   05074000
IOSDVRID EQU   IOSB+4                                                   05075000
IOSPROC  EQU   IOSB+3                                                   05076000
IOSFLC7  EQU   IOSFLC                                                   05077000
IOSCTCNR EQU   IOSFLC                                                   05078000
IOSRWAIT EQU   IOSFLC                                                   05079000
IOSTP    EQU   IOSFLC                                                   05080000
IOSCC3WE EQU   IOSFLC                                                   05081000
IOSVERIF EQU   IOSDVALT                                                 05082000
IOSDVMNT EQU   IOSFLC                                                   05083000
IOSLOG   EQU   IOSFLB                                                   05084000
IOSBDCST EQU   IOSFLB                                                   05085000
IOSMSG   EQU   IOSFLB                                                   05086000
IOSFLB4  EQU   IOSFLB                                                   05087000
IOSFLB3  EQU   IOSFLB                                                   05088000
IOSFLB2  EQU   IOSFLB                                                   05089000
IOSSDR   EQU   IOSFLB                                                   05090000
IOSDIESE EQU   IOSFLB                                                   05091000
IOSIOSB  EQU   IOSFLA                                                   05092000
IOSDOM   EQU   IOSFLA                                                   05093000
IOSEX    EQU   IOSFLA                                                   05094000
IOSSMDB  EQU   IOSFLA                                                   05095000
IOSSMDA  EQU   IOSFLA                                                   05096000
IOSERR   EQU   IOSFLA                                                   05097000
IOSCCHN  EQU   IOSACHN                                                  05098000
IOSDCHN  EQU   IOSACHN                                                  05099000
IOQEND   EQU   IOQ+12                                                   05100000
IOQPTH   EQU   IOQFLAGS+3                                               05101000
IOQPRI   EQU   IOQFLAGS+2                                               05102000
IOQALOC  EQU   IOQFLB                                                   05103000
IOQRLSE  EQU   IOQFLB                                                   05104000
IOQRESV  EQU   IOQFLB                                                   05105000
@NM00063 EQU   IOQFLA                                                   05106000
IOQPBSY  EQU   IOQFLA                                                   05107000
IOQLBSY  EQU   IOQFLA                                                   05108000
IOQENQ   EQU   IOQFLA                                                   05109000
IOQSLCH  EQU   IOQFLA                                                   05110000
IOQLNK   EQU   IOQ                                                      05111000
@NM00062 EQU   SDWA+512                                                 05112000
SDWAVRA  EQU   SDWARA+4                                                 05113000
SDWAURAL EQU   SDWARA+3                                                 05114000
@NM00061 EQU   SDWADPVA                                                 05115000
SDWAEBC  EQU   SDWADPVA                                                 05116000
SDWAHEX  EQU   SDWADPVA                                                 05117000
SDWAVRAL EQU   SDWARA                                                   05118000
@NM00060 EQU   SDWA+396                                                 05119000
SDWACOMP EQU   SDWA+392                                                 05120000
SDWARCPL EQU   SDWA+364                                                 05121000
@NM00059 EQU   SDWADPSA+32                                              05122000
SDWATO4  EQU   SDWADPSL+28                                              05123000
SDWAFRM4 EQU   SDWADPSL+24                                              05124000
SDWATO3  EQU   SDWADPSL+20                                              05125000
SDWAFRM3 EQU   SDWADPSL+16                                              05126000
SDWATO2  EQU   SDWADPSL+12                                              05127000
SDWAFRM2 EQU   SDWADPSL+8                                               05128000
SDWATO1  EQU   SDWADPSL+4                                               05129000
SDWAFRM1 EQU   SDWADPSL                                                 05130000
@NM00058 EQU   SDWADDAT+3                                               05131000
@NM00057 EQU   SDWAPDAT                                                 05132000
SDWAUSPL EQU   SDWAPDAT                                                 05133000
SDWADPSW EQU   SDWAPDAT                                                 05134000
SDWATJPA EQU   SDWAPDAT                                                 05135000
SDWATLPA EQU   SDWAPDAT                                                 05136000
SDWADREG EQU   SDWAPDAT                                                 05137000
SDWADSAH EQU   SDWAPDAT                                                 05138000
SDWADSAS EQU   SDWAPDAT                                                 05139000
@NM00056 EQU   SDWADDAT+1                                               05140000
@NM00055 EQU   SDWASDAT                                                 05141000
SDWAQQS  EQU   SDWASDAT                                                 05142000
SDWACBS  EQU   SDWASDAT                                                 05143000
SDWAGTF  EQU   SDWASDAT                                                 05144000
SDWASWA  EQU   SDWASDAT                                                 05145000
SDWALSQA EQU   SDWASDAT                                                 05146000
SDWASQA  EQU   SDWASDAT                                                 05147000
SDWANUC  EQU   SDWASDAT                                                 05148000
@NM00054 EQU   SDWADUMP+2                                               05149000
@NM00053 EQU   SDWADPFS                                                 05150000
SDWASLST EQU   SDWADPFS                                                 05151000
@NM00052 EQU   SDWADPFS                                                 05152000
SDWADLST EQU   SDWADPFS                                                 05153000
SDWADPT  EQU   SDWADPFS                                                 05154000
SDWADPID EQU   SDWADUMP                                                 05155000
SDWADPLA EQU   SDWA+316                                                 05156000
@NM00051 EQU   SDWA+290                                                 05157000
SDWAASID EQU   SDWA+288                                                 05158000
SDWATALW EQU   SDWALKWS+28                                              05159000
SDWATDLW EQU   SDWALKWS+24                                              05160000
SDWATNLW EQU   SDWALKWS+20                                              05161000
SDWAAPLW EQU   SDWALKWS+16                                              05162000
SDWAIPLW EQU   SDWALKWS+12                                              05163000
SDWAILLW EQU   SDWALKWS+8                                               05164000
SDWAICLW EQU   SDWALKWS                                                 05165000
SDWAFLLK EQU   SDWAACF4                                                 05166000
SDWACMS  EQU   SDWAACF4                                                 05167000
SDWAOPTM EQU   SDWAACF4                                                 05168000
SDWATADB EQU   SDWAACF4                                                 05169000
SDWATDNB EQU   SDWAACF4                                                 05170000
SDWATNCB EQU   SDWAACF4                                                 05171000
SDWAILCH EQU   SDWAACF4                                                 05172000
SDWAICAT EQU   SDWAACF3                                                 05173000
SDWAIPRG EQU   SDWAACF3                                                 05174000
SDWASALL EQU   SDWAACF3                                                 05175000
SDWAASMP EQU   SDWAACF3                                                 05176000
SDWADISP EQU   SDWAACF3                                                 05177000
@NM00050 EQU   SDWAACF3                                                 05178000
@NM00049 EQU   SDWAACF2                                                 05179000
SDWAFREE EQU   SDWAACF2                                                 05180000
SDWAUPRG EQU   SDWAACF2                                                 05181000
@NM00048 EQU   SDWAACF2                                                 05182000
SDWASPIN EQU   SDWAACF2                                                 05183000
@NM00047 EQU   SDWAACF2                                                 05184000
SDWALCPU EQU   SDWACPUA+2                                               05185000
@NM00046 EQU   SDWACPUA                                                 05186000
SDWARECA EQU   SDWA+244                                                 05187000
SDWARTYA EQU   SDWA+240                                                 05188000
@NM00045 EQU   SDWA+239                                                 05189000
@NM00044 EQU   SDWAIOFS                                                 05190000
SDWANIOP EQU   SDWAIOFS                                                 05191000
SDWANOIO EQU   SDWAIOFS                                                 05192000
SDWAIOHT EQU   SDWAIOFS                                                 05193000
SDWAIOQR EQU   SDWAIOFS                                                 05194000
SDWAFMID EQU   SDWA+236                                                 05195000
@NM00043 EQU   SDWAERRD                                                 05196000
SDWAMCIV EQU   SDWAERRD                                                 05197000
SDWARPIV EQU   SDWAERRD                                                 05198000
SDWAMABD EQU   SDWAERRD                                                 05199000
SDWACTS  EQU   SDWAERRD                                                 05200000
SDWASTAE EQU   SDWAERRD                                                 05201000
SDWANRBE EQU   SDWAERRD                                                 05202000
SDWACLUP EQU   SDWAERRD                                                 05203000
@NM00042 EQU   SDWAERRC                                                 05204000
SDWAEAS  EQU   SDWAERRC                                                 05205000
SDWAPERC EQU   SDWAERRC                                                 05206000
SDWAIRB  EQU   SDWAERRC                                                 05207000
SDWASTAI EQU   SDWAERRC                                                 05208000
SDWASTAF EQU   SDWAERRC                                                 05209000
SDWASRBM EQU   SDWAERRB                                                 05210000
SDWALDIS EQU   SDWAERRB                                                 05211000
SDWAENRB EQU   SDWAERRB                                                 05212000
SDWATYP1 EQU   SDWAERRB                                                 05213000
@NM00041 EQU   SDWAERRB                                                 05214000
SDWAPGIO EQU   SDWAERRA                                                 05215000
SDWATEXC EQU   SDWAERRA                                                 05216000
SDWASVCE EQU   SDWAERRA                                                 05217000
SDWAABTM EQU   SDWAERRA                                                 05218000
SDWASVCD EQU   SDWAERRA                                                 05219000
SDWARKEY EQU   SDWAERRA                                                 05220000
SDWAPCHK EQU   SDWAERRA                                                 05221000
SDWAMCHK EQU   SDWAERRA                                                 05222000
SDWATIME EQU   SDWAMCH+20                                               05223000
SDWARFSA EQU   SDWAMCH+16                                               05224000
@NM00040 EQU   SDWAMCH+14                                               05225000
SDWAVEQR EQU   SDWARSR2                                                 05226000
SDWAPGFX EQU   SDWARSR2                                                 05227000
SDWAFLSQ EQU   SDWARSR2                                                 05228000
SDWAFSQA EQU   SDWARSR2                                                 05229000
SDWANUCL EQU   SDWARSR2                                                 05230000
SDWASPER EQU   SDWARSR2                                                 05231000
SDWAINTC EQU   SDWARSR2                                                 05232000
SDWAOFLN EQU   SDWARSR2                                                 05233000
SDWACHNG EQU   SDWARSR1                                                 05234000
SDWAMSER EQU   SDWARSR1                                                 05235000
@NM00039 EQU   SDWARSR1                                                 05236000
SDWACPID EQU   SDWAMCH+10                                               05237000
SDWATERR EQU   SDWAMCHD                                                 05238000
SDWAFPRX EQU   SDWAMCHD                                                 05239000
SDWAINSF EQU   SDWAMCHD                                                 05240000
SDWAACR  EQU   SDWAMCHD                                                 05241000
SDWASCK  EQU   SDWAMCHD                                                 05242000
SDWAPSWU EQU   SDWAMCHD                                                 05243000
SDWAREGU EQU   SDWAMCHD                                                 05244000
SDWASKYF EQU   SDWAMCHD                                                 05245000
@NM00038 EQU   SDWAMCHS                                                 05246000
SDWARSRF EQU   SDWAMCHS                                                 05247000
SDWARSRC EQU   SDWAMCHS                                                 05248000
SDWAINVP EQU   SDWAMCHS                                                 05249000
SDWATSVL EQU   SDWAMCHS                                                 05250000
SDWARCDF EQU   SDWAMCHS                                                 05251000
SDWASRVL EQU   SDWAMCHS                                                 05252000
SDWASCKE EQU   SDWASTCK+4                                               05253000
SDWASCKB EQU   SDWASTCK                                                 05254000
SDWALNTH EQU   SDWAIDNT+1                                               05255000
SDWASPID EQU   SDWAIDNT                                                 05256000
SDWASR15 EQU   SDWASRSV+60                                              05257000
SDWASR14 EQU   SDWASRSV+56                                              05258000
SDWASR13 EQU   SDWASRSV+52                                              05259000
SDWASR12 EQU   SDWASRSV+48                                              05260000
SDWASR11 EQU   SDWASRSV+44                                              05261000
SDWASR10 EQU   SDWASRSV+40                                              05262000
SDWASR09 EQU   SDWASRSV+36                                              05263000
SDWASR08 EQU   SDWASRSV+32                                              05264000
SDWASR07 EQU   SDWASRSV+28                                              05265000
SDWASR06 EQU   SDWASRSV+24                                              05266000
SDWASR05 EQU   SDWASRSV+20                                              05267000
SDWASR04 EQU   SDWASRSV+16                                              05268000
SDWASR03 EQU   SDWASRSV+12                                              05269000
SDWASR02 EQU   SDWASRSV+8                                               05270000
SDWASR01 EQU   SDWASRSV+4                                               05271000
SDWASR00 EQU   SDWASRSV                                                 05272000
SDWATRN2 EQU   SDWAAEC2+4                                               05273000
SDWAIPC2 EQU   SDWAICD2                                                 05274000
SDWAIMC2 EQU   SDWAICD2                                                 05275000
SDWAIPR2 EQU   SDWAICD2                                                 05276000
@NM00037 EQU   SDWAINC2                                                 05277000
@NM00036 EQU   SDWAILC2                                                 05278000
SDWAIL2  EQU   SDWAILC2                                                 05279000
@NM00035 EQU   SDWAILC2                                                 05280000
@NM00034 EQU   SDWAAEC2                                                 05281000
SDWAADD2 EQU   SDWANXT2+1                                               05282000
@NM00033 EQU   SDWANXT2                                                 05283000
@NM00032 EQU   SDWAEC2+3                                                05284000
SDWASGN2 EQU   SDWAINT2                                                 05285000
SDWAEXP2 EQU   SDWAINT2                                                 05286000
SDWADEC2 EQU   SDWAINT2                                                 05287000
SDWAFPO2 EQU   SDWAINT2                                                 05288000
SDWACC2  EQU   SDWAINT2                                                 05289000
@NM00031 EQU   SDWAINT2                                                 05290000
SDWAPGM2 EQU   SDWAMWP2                                                 05291000
SDWAWAT2 EQU   SDWAMWP2                                                 05292000
SDWAMCK2 EQU   SDWAMWP2                                                 05293000
SDWAECT2 EQU   SDWAMWP2                                                 05294000
SDWAKEY2 EQU   SDWAMWP2                                                 05295000
SDWAEXT2 EQU   SDWAEMK2                                                 05296000
SDWAIO2  EQU   SDWAEMK2                                                 05297000
SDWATRM2 EQU   SDWAEMK2                                                 05298000
@NM00030 EQU   SDWAEMK2                                                 05299000
SDWAPER2 EQU   SDWAEMK2                                                 05300000
@NM00029 EQU   SDWAEMK2                                                 05301000
SDWATRAN EQU   SDWAAEC1+4                                               05302000
SDWAIPC1 EQU   SDWAICD1                                                 05303000
SDWAIMC1 EQU   SDWAICD1                                                 05304000
SDWAIPR1 EQU   SDWAICD1                                                 05305000
@NM00028 EQU   SDWAINC1                                                 05306000
@NM00027 EQU   SDWAILC1                                                 05307000
SDWAIL1  EQU   SDWAILC1                                                 05308000
@NM00026 EQU   SDWAILC1                                                 05309000
@NM00025 EQU   SDWAAEC1                                                 05310000
SDWAADD1 EQU   SDWANXT1+1                                               05311000
@NM00024 EQU   SDWANXT1                                                 05312000
@NM00023 EQU   SDWAEC1+3                                                05313000
SDWASGN1 EQU   SDWAINT1                                                 05314000
SDWAEXP1 EQU   SDWAINT1                                                 05315000
SDWADEC1 EQU   SDWAINT1                                                 05316000
SDWAFPO1 EQU   SDWAINT1                                                 05317000
SDWACC1  EQU   SDWAINT1                                                 05318000
@NM00022 EQU   SDWAINT1                                                 05319000
SDWAPGM1 EQU   SDWAMWP1                                                 05320000
SDWAWAT1 EQU   SDWAMWP1                                                 05321000
SDWAMCK1 EQU   SDWAMWP1                                                 05322000
SDWAECT1 EQU   SDWAMWP1                                                 05323000
SDWAKEY1 EQU   SDWAMWP1                                                 05324000
SDWAEXT1 EQU   SDWAEMK1                                                 05325000
SDWAIO1  EQU   SDWAEMK1                                                 05326000
SDWATRM1 EQU   SDWAEMK1                                                 05327000
@NM00021 EQU   SDWAEMK1                                                 05328000
SDWAPER1 EQU   SDWAEMK1                                                 05329000
@NM00020 EQU   SDWAEMK1                                                 05330000
SDWAIOBR EQU   SDWA+100                                                 05331000
SDWAEPA  EQU   SDWA+96                                                  05332000
@NM00019 EQU   SDWANAME+4                                               05333000
SDWARBAD EQU   SDWANAME                                                 05334000
SDWAGR15 EQU   SDWAGRSV+60                                              05335000
SDWAGR14 EQU   SDWAGRSV+56                                              05336000
SDWAGR13 EQU   SDWAGRSV+52                                              05337000
SDWAGR12 EQU   SDWAGRSV+48                                              05338000
SDWAGR11 EQU   SDWAGRSV+44                                              05339000
SDWAGR10 EQU   SDWAGRSV+40                                              05340000
SDWAGR09 EQU   SDWAGRSV+36                                              05341000
SDWAGR08 EQU   SDWAGRSV+32                                              05342000
SDWAGR07 EQU   SDWAGRSV+28                                              05343000
SDWAGR06 EQU   SDWAGRSV+24                                              05344000
SDWAGR05 EQU   SDWAGRSV+20                                              05345000
SDWAGR04 EQU   SDWAGRSV+16                                              05346000
SDWAGR03 EQU   SDWAGRSV+12                                              05347000
SDWAGR02 EQU   SDWAGRSV+8                                               05348000
SDWAGR01 EQU   SDWAGRSV+4                                               05349000
SDWAGR00 EQU   SDWAGRSV                                                 05350000
SDWANXTP EQU   SDWACTL2+5                                               05351000
SDWASGP  EQU   SDWAPMKP                                                 05352000
SDWAEUP  EQU   SDWAPMKP                                                 05353000
SDWADOP  EQU   SDWAPMKP                                                 05354000
SDWAFPP  EQU   SDWAPMKP                                                 05355000
SDWACCP  EQU   SDWAPMKP                                                 05356000
SDWAILP  EQU   SDWAPMKP                                                 05357000
SDWAINTP EQU   SDWACTL2+2                                               05358000
SDWASPVP EQU   SDWAMWPP                                                 05359000
SDWAWATP EQU   SDWAMWPP                                                 05360000
SDWAMCKP EQU   SDWAMWPP                                                 05361000
@NM00018 EQU   SDWAMWPP                                                 05362000
SDWAKEYP EQU   SDWAMWPP                                                 05363000
SDWAEXTP EQU   SDWACMKP                                                 05364000
SDWAIOP  EQU   SDWACMKP                                                 05365000
SDWANXTA EQU   SDWACTL1+5                                               05366000
SDWASGA  EQU   SDWAPMKA                                                 05367000
SDWAEUA  EQU   SDWAPMKA                                                 05368000
SDWADOA  EQU   SDWAPMKA                                                 05369000
SDWAFPA  EQU   SDWAPMKA                                                 05370000
SDWACCA  EQU   SDWAPMKA                                                 05371000
SDWAILA  EQU   SDWAPMKA                                                 05372000
SDWAINTA EQU   SDWACTL1+2                                               05373000
SDWASPVA EQU   SDWAMWPA                                                 05374000
SDWAWATA EQU   SDWAMWPA                                                 05375000
SDWAMCKA EQU   SDWAMWPA                                                 05376000
@NM00017 EQU   SDWAMWPA                                                 05377000
SDWAKEYA EQU   SDWAMWPA                                                 05378000
SDWAEXTA EQU   SDWACMKA                                                 05379000
SDWAIOA  EQU   SDWACMKA                                                 05380000
SDWACMPC EQU   SDWAABCC+1                                               05381000
@NM00016 EQU   SDWACMPF                                                 05382000
SDWASTCC EQU   SDWACMPF                                                 05383000
@NM00015 EQU   SDWACMPF                                                 05384000
SDWASTEP EQU   SDWACMPF                                                 05385000
SDWAREQ  EQU   SDWACMPF                                                 05386000
UCBERADR EQU   UCBUCS+12                                                05387000
UCBFCBID EQU   UCBUCS+8                                                 05388000
UCBERCNT EQU   UCBUCS+7                                                 05389000
UCBRSV51 EQU   UCBUCS+6                                                 05390000
UCBRSV50 EQU   UCBFCBOP                                                 05391000
UCBRSV49 EQU   UCBFCBOP                                                 05392000
UCBRSV48 EQU   UCBFCBOP                                                 05393000
UCBRSV47 EQU   UCBFCBOP                                                 05394000
UCBRSV46 EQU   UCBFCBOP                                                 05395000
UCBRSV45 EQU   UCBFCBOP                                                 05396000
UCBRSV44 EQU   UCBFCBOP                                                 05397000
UCBFCBO1 EQU   UCBFCBOP                                                 05398000
UCBUCSPE EQU   UCBUCSOP                                                 05399000
UCBRSV43 EQU   UCBUCSOP                                                 05400000
UCBRSV42 EQU   UCBUCSOP                                                 05401000
UCBRSV41 EQU   UCBUCSOP                                                 05402000
UCBRSV40 EQU   UCBUCSOP                                                 05403000
UCBRSV39 EQU   UCBUCSOP                                                 05404000
UCBUCSO2 EQU   UCBUCSOP                                                 05405000
UCBUCSO1 EQU   UCBUCSOP                                                 05406000
UCBUCSID EQU   UCBUCS                                                   05407000
UCBMDRBA EQU   UCBMDRBF+1                                               05408000
UCBRV075 EQU   UCBMDRBF                                                 05409000
UCBRV074 EQU   UCB3800X+32                                              05410000
UCBIMAGE EQU   UCB3800X+28                                              05411000
UCBFCBNM EQU   UCB3800X+24                                              05412000
UCBCHAR4 EQU   UCB3800X+20                                              05413000
UCBCHAR3 EQU   UCB3800X+16                                              05414000
UCBCHAR2 EQU   UCB3800X+12                                              05415000
UCBCHAR1 EQU   UCB3800X+8                                               05416000
UCBCGMID EQU   UCB3800X+4                                               05417000
UCBBRSTA EQU   UCBACTIV                                                 05418000
UCBRV063 EQU   UCBACTIV                                                 05419000
UCBRV062 EQU   UCBACTIV                                                 05420000
UCBRV061 EQU   UCBACTIV                                                 05421000
UCBRV060 EQU   UCBACTIV                                                 05422000
UCBRV059 EQU   UCBACTIV                                                 05423000
UCBRV058 EQU   UCBACTIV                                                 05424000
UCBRV057 EQU   UCBACTIV                                                 05425000
UCBRV050 EQU   UCB3800X+2                                               05426000
UCBCGMNO EQU   UCB3800X+1                                               05427000
UCBRV083 EQU   UCBOPTNS                                                 05428000
UCBBRSTR EQU   UCBOPTNS                                                 05429000
UCBRV056 EQU   UCBOPTNS                                                 05430000
UCBRV055 EQU   UCBOPTNS                                                 05431000
UCBRV054 EQU   UCBOPTNS                                                 05432000
UCBRV053 EQU   UCBOPTNS                                                 05433000
UCBRV052 EQU   UCBOPTNS                                                 05434000
UCBRV051 EQU   UCBOPTNS                                                 05435000
UCBRV073 EQU   UCB3540X+7                                               05436000
UCBRV072 EQU   UCBDKBYT                                                 05437000
UCBRV071 EQU   UCBDKBYT                                                 05438000
UCBRV070 EQU   UCBDKBYT                                                 05439000
UCBRV069 EQU   UCBDKBYT                                                 05440000
UCBRV068 EQU   UCBDKBYT                                                 05441000
UCBRV067 EQU   UCBDKBYT                                                 05442000
UCBVLVER EQU   UCBDKBYT                                                 05443000
UCBDKAMX EQU   UCBDKBYT                                                 05444000
UCBVLSER EQU   UCB3540X                                                 05445000
UCBRDATA EQU   UCBOCR+4                                                 05446000
UCBFRID  EQU   UCBOCR                                                   05447000
UCBCLN   EQU   UCBMT+14                                                 05448000
UCBERG   EQU   UCBMT+12                                                 05449000
UCBMS    EQU   UCBMT+11                                                 05450000
UCBNB    EQU   UCBMT+10                                                 05451000
UCBPW    EQU   UCBMT+9                                                  05452000
UCBPR    EQU   UCBMT+8                                                  05453000
UCBSIO   EQU   UCBMT+6                                                  05454000
UCBTW    EQU   UCBMT+5                                                  05455000
UCBTR    EQU   UCBMT+4                                                  05456000
UCBTWT   EQU   UCBMT+3                                                  05457000
UCBTRT   EQU   UCBMT+2                                                  05458000
UCBCTD   EQU   UCBMT                                                    05459000
UCBWTOID EQU   UCBCMEXT+17                                              05460000
UCBMIHTI EQU   UCBCMEXT+16                                              05461000
UCBASID  EQU   UCBCMEXT+14                                              05462000
UCBMFCNT EQU   UCBCMEXT+12                                              05463000
UCBPMSK  EQU   UCBCMEXT+10                                              05464000
UCBRV041 EQU   UCBCMEXT+6                                               05465000
UCBRV036 EQU   UCBFLP1                                                  05466000
UCBRV035 EQU   UCBFLP1                                                  05467000
UCBERLOG EQU   UCBFLP1                                                  05468000
UCBRV033 EQU   UCBFLP1                                                  05469000
UCBINHIO EQU   UCBFLP1                                                  05470000
UCBNSWAP EQU   UCBFLP1                                                  05471000
UCBSHRUP EQU   UCBFLP1                                                  05472000
UCBNSRCH EQU   UCBFLP1                                                  05473000
UCBSNSCT EQU   UCBCMEXT+4                                               05474000
UCBHPDV  EQU   @NM00014                                                 05475000
UCBHALI  EQU   @NM00014                                                 05476000
UCBRSV09 EQU   @NM00014                                                 05477000
UCBRSV08 EQU   @NM00014                                                 05478000
UCBRSV07 EQU   @NM00014                                                 05479000
UCBRSV06 EQU   @NM00014                                                 05480000
UCBRSV05 EQU   @NM00014                                                 05481000
UCBRSV04 EQU   @NM00014                                                 05482000
UCBDTI   EQU   UCBCMEXT+2                                               05483000
UCBSTI   EQU   UCBCMEXT+1                                               05484000
UCBETI   EQU   UCBCMEXT                                                 05485000
UCBEXTP  EQU   UCBEXTPT+1                                               05486000
UCBDDRSW EQU   UCBFLC                                                   05487000
UCBTICBT EQU   UCBFLC                                                   05488000
UCBIVRR  EQU   UCBFLC                                                   05489000
UCBIVRS  EQU   UCBFLC                                                   05490000
UCBITF   EQU   UCBFLC                                                   05491000
UCBUDE   EQU   UCBFLC                                                   05492000
UCBWAA   EQU   UCBFLC                                                   05493000
UCBATTP  EQU   UCBFLC                                                   05494000
UCBUNTYP EQU   UCBTBYT4                                                 05495000
UCBRSV11 EQU   UCBDVCLS                                                 05496000
UCBRSV10 EQU   UCBDVCLS                                                 05497000
UCB3CHAR EQU   UCBDVCLS                                                 05498000
UCB3UREC EQU   UCBDVCLS                                                 05499000
UCB3DISP EQU   UCBDVCLS                                                 05500000
UCB3COMM EQU   UCBDVCLS                                                 05501000
UCB3TAPE EQU   UCBDVCLS                                                 05502000
UCBDVPWR EQU   UCB2OPT7                                                 05503000
UCBVLPWR EQU   UCB2OPT6                                                 05504000
UCB2OPT5 EQU   UCBTBYT2                                                 05505000
UCBRVDEV EQU   UCBRWTAU                                                 05506000
UCBRPS   EQU   UCBDUDN2                                                 05507000
UCB2OPT1 EQU   UCBTBYT2                                                 05508000
UCB2OPT0 EQU   UCBTBYT2                                                 05509000
UCB1FEA7 EQU   UCBTBYT1                                                 05510000
UCBD6250 EQU   UCB1FEA6                                                 05511000
UCBD1600 EQU   UCB1FEA5                                                 05512000
UCB1FEA4 EQU   UCBTBYT1                                                 05513000
UCB1FEA3 EQU   UCBTBYT1                                                 05514000
UCB1FEA2 EQU   UCBTBYT1                                                 05515000
UCB1FEA1 EQU   UCBTBYT1                                                 05516000
UCB1FEA0 EQU   UCBTBYT1                                                 05517000
UCBRV029 EQU   UCBWGT                                                   05518000
UCBVHRSN EQU   UCBWGT                                                   05519000
UCBVORSN EQU   UCBWGT                                                   05520000
UCBREW   EQU   UCBWGT                                                   05521000
UCBPUB   EQU   UCBWGT                                                   05522000
UCBOUT   EQU   UCBWGT                                                   05523000
UCBIN    EQU   UCBWGT                                                   05524000
UCBLCI   EQU   UCBOB+10                                                 05525000
UCBCNT   EQU   UCBOB+9                                                  05526000
UCBRV017 EQU   UCBCHM1                                                  05527000
UCBRV016 EQU   UCBCHM1                                                  05528000
UCBRV015 EQU   UCBCHM1                                                  05529000
UCBRV014 EQU   UCBCHM1                                                  05530000
UCBSPB   EQU   UCBPTH1                                                  05531000
UCBPPB   EQU   UCBPTH1                                                  05532000
UCBSPA   EQU   UCBPTH0                                                  05533000
UCBPPA   EQU   UCBPTH0                                                  05534000
UCBSIGP  EQU   UCBFLB                                                   05535000
UCBVALPH EQU   UCBFLB                                                   05536000
UCBCRHSN EQU   UCBFLB                                                   05537000
UCBCRHRV EQU   UCBFLB                                                   05538000
UCBSPST  EQU   UCBFLB                                                   05539000
UCBQISCE EQU   UCBFL1                                                   05540000
UCBACTV  EQU   UCBFL1                                                   05541000
UCBSAP   EQU   UCBFL1                                                   05542000
UCBNOTRC EQU   UCBCUB                                                   05543000
UCBUSING EQU   UCBPST                                                   05544000
UCBNOTRD EQU   UCBNRY                                                   05545000
UCBBUSYD EQU   UCBBSY                                                   05546000
UCBUA    EQU   UCBCHAN+1                                                05547000
UCBDADI  EQU   UCBSTAT                                                  05548000
UCBSYSR  EQU   UCBSTAT                                                  05549000
UCBPRES  EQU   UCBSTAT                                                  05550000
UCBALOC  EQU   UCBSTAT                                                  05551000
UCBUNLD  EQU   UCBSTAT                                                  05552000
UCBRESV  EQU   UCBSTAT                                                  05553000
UCBCHGS  EQU   UCBSTAT                                                  05554000
UCBONLI  EQU   UCBSTAT                                                  05555000
UCBID    EQU   UCBOB+2                                                  05556000
UCBALTPH EQU   UCBFL5                                                   05557000
UCBALTCU EQU   UCBFL5                                                   05558000
UCBNALOC EQU   UCBFL5                                                   05559000
UCBENVRD EQU   UCBFL5                                                   05560000
UCBVSDR  EQU   UCBFL5                                                   05561000
UCBSASK  EQU   UCBFL5                                                   05562000
UCBAMV   EQU   UCBAF                                                    05563000
UCBDCC   EQU   UCBFL5                                                   05564000
UCBMONT  EQU   UCBJBNR                                                  05565000
UCBRV011 EQU   UCBJBNR                                                  05566000
UCBMMSGP EQU   UCBJBNR                                                  05567000
UCBOLDSM EQU   UCBJBNR                                                  05568000
UCBRV003 EQU   UCBJBNR                                                  05569000
UCBDUC   EQU   UCBJBNR                                                  05570000
UCBJES3  EQU   UCBJBNR                                                  05571000
UCBVRDEV EQU   UCBJBNR                                                  05572000
UCBCMSEG EQU   UCBOB                                                    05573000
UCBPFXND EQU   UCB+512                                                  05574000
UCBPXST  EQU   UCB+504                                                  05575000
@NM00011 EQU   UCB                                                      05576000
@NM00010 EQU   SRB+40                                                   05577000
@NM00009 EQU   SRB+38                                                   05578000
SRBPKF   EQU   SRB+36                                                   05579000
SRBSAVE  EQU   SRB+32                                                   05580000
SRBPARM  EQU   SRB+28                                                   05581000
SRBRMTR  EQU   SRB+24                                                   05582000
SRBPTCB  EQU   SRBFLC+4                                                 05583000
SRBPASID EQU   SRBFLC+2                                                 05584000
SRBCPAFF EQU   SRBFLC                                                   05585000
SRBFLNK  EQU   SRB+4                                                    05586000
SRBID    EQU   SRB                                                      05587000
ICBCPUID EQU   ICB2SSCB+496                                             05588000
ICBLORD  EQU   ICBTRACE+256                                             05589000
ICBOTRC  EQU   ICBTRACE                                                 05590000
ICBFAB   EQU   ICB2SSCB+108                                             05591000
ICBMSSC  EQU   ICB2SSCB+104                                             05592000
ICBRSVP  EQU   ICB2SSCB+100                                             05593000
ICBAEAP  EQU   ICB2SSCB+96                                              05594000
ICBSIOBP EQU   ICB2SSCB+92                                              05595000
ICBIATNA EQU   ICB2SSCB+88                                              05596000
ICBIPRGA EQU   ICB2SSCB+84                                              05597000
ICBVVICB EQU   ICB2SSCB+76                                              05598000
ICBVVIC  EQU   ICB2SSCB+72                                              05599000
ICBSIOP  EQU   ICB2SSCB+68                                              05600000
ICBMEP   EQU   ICB2SSCB+64                                              05601000
ICB2ACTP EQU   ICB2SSCB+56                                              05602000
ICBSAMP  EQU   ICBFLG+2                                                 05603000
ICBFG2   EQU   ICBFLG+1                                                 05604000
@NM00008 EQU   ICBFG1                                                   05605000
ICBMSCA  EQU   ICBFG1                                                   05606000
ICBMSCMP EQU   ICBFG1                                                   05607000
ICBS     EQU   ICBFG1                                                   05608000
ICBB     EQU   ICBFG1                                                   05609000
ICBV     EQU   ICBFG1                                                   05610000
ICBR     EQU   ICBFG1                                                   05611000
ICBI     EQU   ICBFG1                                                   05612000
ICBNVT   EQU   ICBOPT                                                   05613000
ICBVN02P EQU   ICB2SSCB+44                                              05614000
ICBTCB   EQU   ICB2SSCB+40                                              05615000
ICBQHEAD EQU   ICB2SSCB+36                                              05616000
ICBAUCB  EQU   ICB2SSCB+32                                              05617000
ICBPUCB  EQU   ICB2SSCB+28                                              05618000
ICBCOMQ  EQU   ICB2SSCB+24                                              05619000
ICBIOR   EQU   ICB2SSCB+20                                              05620000
ICBCOM   EQU   ICB2SSCB+16                                              05621000
ICBACTV  EQU   ICB2SSCB+12                                              05622000
ICBECB   EQU   ICB2SSCB+8                                               05623000
ICBSSNAM EQU   ICB2SSCB                                                 05624000
CVTLEVL  EQU   CVTRELNO+2                                               05625000
CVTNUMB  EQU   CVTRELNO                                                 05626000
CVTMDL   EQU   CVTFIX+250                                               05627000
@NM00007 EQU   CVTFIX+248                                               05628000
@NM00006 EQU   CVTFIX                                                   05629000
CVTRV482 EQU   CVTXTNT2+128                                             05630000
CVTRV481 EQU   CVTXTNT2+124                                             05631000
CVTRV480 EQU   CVTXTNT2+120                                             05632000
CVTRV479 EQU   CVTXTNT2+118                                             05633000
CVTRV478 EQU   CVTXTNT2+117                                             05634000
CVTRV477 EQU   CVTXTNT2+116                                             05635000
CVTRV476 EQU   CVTXTNT2+115                                             05636000
CVTRV475 EQU   CVTXTNT2+114                                             05637000
CVTRV474 EQU   CVTRV466                                                 05638000
CVTRV473 EQU   CVTRV466                                                 05639000
CVTRV472 EQU   CVTRV466                                                 05640000
CVTRV471 EQU   CVTRV466                                                 05641000
CVTRV470 EQU   CVTRV466                                                 05642000
CVTRV469 EQU   CVTRV466                                                 05643000
CVTRV468 EQU   CVTRV466                                                 05644000
CVTRV467 EQU   CVTRV466                                                 05645000
CVTRV465 EQU   CVTRV457                                                 05646000
CVTRV464 EQU   CVTRV457                                                 05647000
CVTRV463 EQU   CVTRV457                                                 05648000
CVTRV462 EQU   CVTRV457                                                 05649000
CVTRV461 EQU   CVTRV457                                                 05650000
CVTRV460 EQU   CVTRV457                                                 05651000
CVTRV459 EQU   CVTRV457                                                 05652000
CVTRV458 EQU   CVTRV457                                                 05653000
CVTRV456 EQU   CVTXTNT2+108                                             05654000
CVTRV455 EQU   CVTXTNT2+104                                             05655000
CVTRV454 EQU   CVTXTNT2+100                                             05656000
CVTRV453 EQU   CVTXTNT2+96                                              05657000
CVTRV452 EQU   CVTXTNT2+94                                              05658000
CVTRV451 EQU   CVTXTNT2+92                                              05659000
CVTRV450 EQU   CVTXTNT2+90                                              05660000
CVTRV449 EQU   CVTXTNT2+88                                              05661000
CVTRV448 EQU   CVTXTNT2+87                                              05662000
CVTRV447 EQU   CVTXTNT2+86                                              05663000
CVTRV446 EQU   CVTRV438                                                 05664000
CVTRV445 EQU   CVTRV438                                                 05665000
CVTRV444 EQU   CVTRV438                                                 05666000
CVTRV443 EQU   CVTRV438                                                 05667000
CVTRV442 EQU   CVTRV438                                                 05668000
CVTRV441 EQU   CVTRV438                                                 05669000
CVTRV440 EQU   CVTRV438                                                 05670000
CVTRV439 EQU   CVTRV438                                                 05671000
CVTRV437 EQU   CVTRV429                                                 05672000
CVTRV436 EQU   CVTRV429                                                 05673000
CVTRV435 EQU   CVTRV429                                                 05674000
CVTRV434 EQU   CVTRV429                                                 05675000
CVTRV433 EQU   CVTRV429                                                 05676000
CVTRV432 EQU   CVTRV429                                                 05677000
CVTRV431 EQU   CVTRV429                                                 05678000
CVTRV430 EQU   CVTRV429                                                 05679000
CVTRV428 EQU   CVTXTNT2+80                                              05680000
CVTRV427 EQU   CVTXTNT2+76                                              05681000
CVTRV426 EQU   CVTXTNT2+72                                              05682000
CVTRV425 EQU   CVTXTNT2+68                                              05683000
CVTATACT EQU   CVTATCVT                                                 05684000
CVTRV423 EQU   CVTXTNT2+62                                              05685000
CVTRV422 EQU   CVTXTNT2+60                                              05686000
CVTRV421 EQU   CVTXTNT2+58                                              05687000
CVTRV420 EQU   CVTXTNT2+56                                              05688000
CVTRV419 EQU   CVTXTNT2+55                                              05689000
CVTRV418 EQU   CVTXTNT2+54                                              05690000
CVTRV417 EQU   CVTRV409                                                 05691000
CVTRV416 EQU   CVTRV409                                                 05692000
CVTRV415 EQU   CVTRV409                                                 05693000
CVTRV414 EQU   CVTRV409                                                 05694000
CVTRV413 EQU   CVTRV409                                                 05695000
CVTRV412 EQU   CVTRV409                                                 05696000
CVTRV411 EQU   CVTRV409                                                 05697000
CVTRV410 EQU   CVTRV409                                                 05698000
CVTRV408 EQU   CVTRV400                                                 05699000
CVTRV407 EQU   CVTRV400                                                 05700000
CVTRV406 EQU   CVTRV400                                                 05701000
CVTRV405 EQU   CVTRV400                                                 05702000
CVTRV404 EQU   CVTRV400                                                 05703000
CVTRV403 EQU   CVTRV400                                                 05704000
CVTRV402 EQU   CVTRV400                                                 05705000
CVTRV401 EQU   CVTRV400                                                 05706000
CVTSKTA  EQU   CVTXTNT2+44                                              05707000
CVTRSV99 EQU   CVTXTNT2+40                                              05708000
CVTRSV98 EQU   CVTXTNT2+36                                              05709000
CVTRSV97 EQU   CVTXTNT2+34                                              05710000
CVTRSV96 EQU   CVTXTNT2+32                                              05711000
CVTOLTEP EQU   CVTXTNT2+28                                              05712000
CVTQIDA  EQU   CVTQID+1                                                 05713000
CVTRSV95 EQU   CVTQID                                                   05714000
CVTRSV94 EQU   CVTXTNT2+20                                              05715000
CVTRSV93 EQU   CVTXTNT2+16                                              05716000
CVTRSV92 EQU   CVTXTNT2+12                                              05717000
CVTDEBVR EQU   CVTXTNT2+8                                               05718000
CVTRSV91 EQU   CVTXTNT2+6                                               05719000
CVTRSV9H EQU   CVTFLGBT                                                 05720000
CVTRSV9G EQU   CVTFLGBT                                                 05721000
CVTRSV9F EQU   CVTFLGBT                                                 05722000
CVTRSV9E EQU   CVTFLGBT                                                 05723000
CVTRSV9D EQU   CVTFLGBT                                                 05724000
CVTRSV9C EQU   CVTFLGBT                                                 05725000
CVTVME   EQU   CVTFLGBT                                                 05726000
CVTNPE   EQU   CVTFLGBT                                                 05727000
CVTNUCLS EQU   CVTXTNT2+4                                               05728000
CVTDSSVA EQU   CVTDSSV+1                                                05729000
CVTRSV89 EQU   CVTDSSV                                                  05730000
CVTRSV88 EQU   CVTXTNT1+8                                               05731000
CVTRSV87 EQU   CVTXTNT1+4                                               05732000
CVTFACHN EQU   CVTXTNT1                                                 05733000
CVTRV488 EQU   CVTMAP+412                                               05734000
CVTRV487 EQU   CVTMAP+408                                               05735000
CVTRV486 EQU   CVTMAP+404                                               05736000
CVTRV485 EQU   CVTMAP+400                                               05737000
CVTACTAP EQU   CVTMAP+396                                               05738000
CVTAUTH  EQU   CVTMAP+392                                               05739000
CVTATMCA EQU   CVTATMCT+1                                               05740000
CVTATMST EQU   CVTATMCT                                                 05741000
CVTRSV61 EQU   CVTMAP+384                                               05742000
CVTVOLT1 EQU   CVTVOLM1+1                                               05743000
CVTVOLI1 EQU   CVTVOLF1                                                 05744000
CVTSTOA  EQU   CVTMAP+376                                               05745000
CVTRSV58 EQU   CVTMAP+374                                               05746000
CVTRSV57 EQU   CVTMAP+372                                               05747000
CVTDDCE  EQU   CVTMAP+368                                               05748000
CVTPNWFR EQU   CVTMAP+364                                               05749000
CVTSMF   EQU   CVTMAP+360                                               05750000
CVTSULK  EQU   CVTMAP+358                                               05751000
CVTSLKO  EQU   CVTSYSK                                                  05752000
CVTSLKP  EQU   CVTSYSK                                                  05753000
CVTSLKQ  EQU   CVTSYSK                                                  05754000
CVTSLKR  EQU   CVTSYSK                                                  05755000
CVTRSV56 EQU   CVTSYSK                                                  05756000
CVTRSV55 EQU   CVTSYSK                                                  05757000
CVTRSV54 EQU   CVTSYSK                                                  05758000
CVTRSV53 EQU   CVTSYSK                                                  05759000
CVTRSV52 EQU   CVTA1F1                                                  05760000
CVTRSV51 EQU   CVTA1F1                                                  05761000
CVTRSV50 EQU   CVTA1F1                                                  05762000
CVTRSV49 EQU   CVTA1F1                                                  05763000
CVTRSV48 EQU   CVTA1F1                                                  05764000
CVTRSV47 EQU   CVTA1F1                                                  05765000
CVTSRSW  EQU   CVTA1F1                                                  05766000
CVTPFSW  EQU   CVTA1F1                                                  05767000
CVTPCVT  EQU   CVTMAP+352                                               05768000
CVTRSV46 EQU   CVTMAP+344                                               05769000
CVTRSV45 EQU   CVTMAP+340                                               05770000
CVTRSV44 EQU   CVTMAP+338                                               05771000
CVTRSV43 EQU   CVTMAP+336                                               05772000
CVTHJESA EQU   CVTHJES+1                                                05773000
CVTRSV42 EQU   CVTHJES                                                  05774000
CVTEXT2A EQU   CVTEXT2+1                                                05775000
CVTRSV41 EQU   CVTEXT2                                                  05776000
CVTAPFA  EQU   CVTAPF+1                                                 05777000
CVTRSV40 EQU   CVTAPF                                                   05778000
CVTRV518 EQU   CVTINTLA                                                 05779000
CVTRV517 EQU   CVTERPV                                                  05780000
CVTEORM  EQU   CVTMAP+312                                               05781000
CVTMCHPR EQU   CVTMAP+308                                               05782000
CVTTZ    EQU   CVTMAP+304                                               05783000
CVTJEPS  EQU   CVTMAP+300                                               05784000
CVTJESCT EQU   CVTMAP+296                                               05785000
CVTMODE  EQU   CVTMAP+292                                               05786000
CVTPTRV  EQU   CVTMAP+288                                               05787000
CVTREAL  EQU   CVTMAP+284                                               05788000
CVTRSV39 EQU   CVTMAP+280                                               05789000
CVTRSV38 EQU   CVTMAP+276                                               05790000
CVTDMSRA EQU   CVTDMSR+1                                                05791000
CVTRV634 EQU   CVTDMSRF                                                 05792000
CVTRV633 EQU   CVTDMSRF                                                 05793000
CVTRV632 EQU   CVTDMSRF                                                 05794000
CVTRV631 EQU   CVTDMSRF                                                 05795000
CVTRV630 EQU   CVTDMSRF                                                 05796000
CVTRV629 EQU   CVTDMSRF                                                 05797000
CVTUDUMP EQU   CVTDMSRF                                                 05798000
CVTSDUMP EQU   CVTDMSRF                                                 05799000
CVTQMSGA EQU   CVTQMSG+1                                                05800000
CVTRSV36 EQU   CVTQMSG                                                  05801000
CVTAMFF  EQU   CVTMAP+264                                               05802000
CVTPURGA EQU   CVTPURG+1                                                05803000
CVTRSV35 EQU   CVTPURG                                                  05804000
CVTCBSP  EQU   CVTMAP+256                                               05805000
CVTATERA EQU   CVTATER+1                                                05806000
CVTSYST  EQU   CVTATER                                                  05807000
CVTVOLT2 EQU   CVTTAT                                                   05808000
CVTVOLI2 EQU   CVTVOLF2                                                 05809000
CVTAQAVB EQU   CVTAQAVT+1                                               05810000
CVTRSV34 EQU   CVTTCMFG                                                 05811000
CVTRSV33 EQU   CVTTCMFG                                                 05812000
CVTRSV32 EQU   CVTTCMFG                                                 05813000
CVTRSV31 EQU   CVTTCMFG                                                 05814000
CVTRSV30 EQU   CVTTCMFG                                                 05815000
CVTRSV29 EQU   CVTTCMFG                                                 05816000
CVTLDEV  EQU   CVTTCMFG                                                 05817000
CVTTCRDY EQU   CVTTCMFG                                                 05818000
CVTGTFA  EQU   CVTGTF+1                                                 05819000
CVTRSV27 EQU   CVTGTFST                                                 05820000
CVTRNIO  EQU   CVTGTFST                                                 05821000
CVTUSR   EQU   CVTGTFST                                                 05822000
CVTRV318 EQU   CVTFORM                                                  05823000
CVTRV317 EQU   CVTTMODE                                                 05824000
CVTRV316 EQU   CVTSTATE                                                 05825000
CVTRV315 EQU   CVTGTFS                                                  05826000
CVTGTFAV EQU   CVTGTFS                                                  05827000
CVT0SCR1 EQU   CVTMAP+232                                               05828000
CVTRV515 EQU   CVTMAP+228                                               05829000
CVTRMS   EQU   CVTMAP+224                                               05830000
CVTPATCH EQU   CVTMAP+220                                               05831000
CVTTSCE  EQU   CVTMAP+216                                               05832000
CVTLNKSC EQU   CVTMAP+214                                               05833000
CVTQABST EQU   CVTMAP+212                                               05834000
CVTMDLDS EQU   CVTMAP+208                                               05835000
CVTUSER  EQU   CVTMAP+204                                               05836000
CVTABEND EQU   CVTMAP+200                                               05837000
CVTSMCA  EQU   CVTMAP+196                                               05838000
CVTRSV18 EQU   CVTMAP+192                                               05839000
CVTQLPAQ EQU   CVTMAP+188                                               05840000
CVTQCDSR EQU   CVTMAP+184                                               05841000
CVTRSV17 EQU   CVTOPTB                                                  05842000
CVTRSV16 EQU   CVTOPTB                                                  05843000
CVTFP    EQU   CVTOPTB                                                  05844000
CVTAPTHR EQU   CVTOPTB                                                  05845000
CVTNLOG  EQU   CVTOPTB                                                  05846000
CVTTOD   EQU   CVTOPTB                                                  05847000
CVTCTIMS EQU   CVTOPTB                                                  05848000
CVTPROT  EQU   CVTOPTB                                                  05849000
CVTXPFP  EQU   CVTOPTA                                                  05850000
CVTASCII EQU   CVTOPTA                                                  05851000
CVTRSV13 EQU   CVTOPTA                                                  05852000
CVTRSV12 EQU   CVTOPTA                                                  05853000
CVTNIP   EQU   CVTOPTA                                                  05854000
CVTDDR   EQU   CVTOPTA                                                  05855000
CVTAPR   EQU   CVTOPTA                                                  05856000
CVTCCH   EQU   CVTOPTA                                                  05857000
CVTSNCTR EQU   CVTMAP+180                                               05858000
CVTQMWR  EQU   CVTMAP+176                                               05859000
CVTQOCR  EQU   CVTMAP+172                                               05860000
CVT1EF00 EQU   CVTMAP+168                                               05861000
CVTMZ00  EQU   CVTMAP+164                                               05862000
CVTSV76Q EQU   CVTSV76C                                                 05863000
CVTRSV11 EQU   CVTMAP+156                                               05864000
CVT0PT01 EQU   CVTMAP+152                                               05865000
CVTMSER  EQU   CVTMAP+148                                               05866000
CVTRV516 EQU   CVTIERLC                                                 05867000
CVTILCH  EQU   CVTMAP+140                                               05868000
CVT0DS   EQU   CVTMAP+136                                               05869000
CVTFBOSV EQU   CVTMAP+132                                               05870000
CVTNUCB  EQU   CVTMAP+128                                               05871000
CVTSV76M EQU   CVTIOQET                                                 05872000
CVTDCBA  EQU   CVTMAP+117                                               05873000
CVTMVS2  EQU   CVTDCB                                                   05874000
CVT6DAT  EQU   CVTDCB                                                   05875000
CVT4MPS  EQU   CVTDCB                                                   05876000
CVTRSV09 EQU   CVTDCB                                                   05877000
CVT4MS1  EQU   CVTDCB                                                   05878000
CVT2SPS  EQU   CVTDCB                                                   05879000
CVT1SSS  EQU   CVTDCB                                                   05880000
CVTRSV08 EQU   CVTDCB                                                   05881000
CVTSTB   EQU   CVTMAP+112                                               05882000
CVTQTD00 EQU   CVTMAP+108                                               05883000
CVTQTE00 EQU   CVTMAP+104                                               05884000
CVTCUCB  EQU   CVTMAP+100                                               05885000
CVTSJQ   EQU   CVTMAP+96                                                05886000
CVTPBLDL EQU   CVTMAP+92                                                05887000
CVTTPC   EQU   CVTMAP+88                                                05888000
CVTSVDCB EQU   CVTMAP+84                                                05889000
CVTBRET  EQU   CVTMAP+82                                                05890000
CVTEXIT  EQU   CVTMAP+80                                                05891000
CVT0FN00 EQU   CVTMAP+76                                                05892000
CVTDARA  EQU   CVTDAR+1                                                 05893000
CVTRSV07 EQU   CVTFLGS1                                                 05894000
CVTRSV06 EQU   CVTFLGS1                                                 05895000
CVTRSV05 EQU   CVTFLGS1                                                 05896000
CVTRSV04 EQU   CVTFLGS1                                                 05897000
CVTRSV03 EQU   CVTFLGS1                                                 05898000
CVTRSV02 EQU   CVTFLGS1                                                 05899000
CVTRSV01 EQU   CVTFLGS1                                                 05900000
CVTDMPLK EQU   CVTFLGS1                                                 05901000
CVTXITP  EQU   CVTMAP+68                                                05902000
CVTZDTAB EQU   CVTMAP+64                                                05903000
CVTMSLT  EQU   CVTMAP+60                                                05904000
CVTDATE  EQU   CVTMAP+56                                                05905000
CVTBTERM EQU   CVTMAP+52                                                05906000
CVTSYSAD EQU   CVTMAP+48                                                05907000
CVTXTLER EQU   CVTMAP+44                                                05908000
CVTPRLTV EQU   CVTMAP+32                                                05909000
CVTPCNVT EQU   CVTMAP+28                                                05910000
CVT0VL00 EQU   CVTMAP+24                                                05911000
CVTXAPG  EQU   CVTMAP+20                                                05912000
CVTBUF   EQU   CVTMAP+16                                                05913000
CVTJOB   EQU   CVTMAP+12                                                05914000
CVTLINK  EQU   CVTMAP+8                                                 05915000
CVT0EF00 EQU   CVTMAP+4                                                 05916000
CVTTCBP  EQU   CVTMAP                                                   05917000
CVT      EQU   CVTMAP                                                   05918000
CRCAEND  EQU   CRCA+80                                                  05919000
CRCARSV3 EQU   CRCA+72                                                  05920000
CRCAITIM EQU   CRCA+64                                                  05921000
CRCACTIM EQU   CRCA+56                                                  05922000
CRCARSV2 EQU   CRCA+54                                                  05923000
CRCARSV1 EQU   CRCA+44                                                  05924000
CRCACINT EQU   CRCA+32                                                  05925000
CRCACRH3 EQU   CRCA+28                                                  05926000
CRCACRH2 EQU   CRCA+24                                                  05927000
CRCACRH1 EQU   CRCA+20                                                  05928000
CRCACRHT EQU   CRCA+16                                                  05929000
@NM00005 EQU   CRCAMCW+4                                                05930000
CRCAMCWC EQU   CRCAMCWF                                                 05931000
@NM00004 EQU   CRCAMCWF                                                 05932000
@NM00003 EQU   CRCAMCW+1                                                05933000
CRCAMCWY EQU   CRCAMCWZ                                                 05934000
@NM00002 EQU   CRCAMCWZ                                                 05935000
CRCAFLG4 EQU   CRCAFLGS+3                                               05936000
CRCAFLG3 EQU   CRCAFLGS+2                                               05937000
CRCAFLG2 EQU   CRCAFLGS+1                                               05938000
@NM00001 EQU   CRCAFLG1                                                 05939000
CRCAFTIM EQU   CRCAFLG1                                                 05940000
CRCAHIO  EQU   CRCAFLG1                                                 05941000
CRCADINT EQU   CRCAFLG1                                                 05942000
CRCAID   EQU   CRCA                                                     05943000
RESIDCT  EQU   CSW+6                                                    05944000
@NM00136 EQU   CHANSTAT                                                 05945000
@NM00135 EQU   CHANSTAT                                                 05946000
DEVSTAT  EQU   STATUS                                                   05947000
@NM00134 EQU   KEY0000                                                  05948000
@NM00133 EQU   KEY0000                                                  05949000
@NM00097 EQU   PSA+3668                                                 05950000
PSASTAK  EQU   PSA+3072                                                 05951000
@NM00096 EQU   PSA+1048                                                 05952000
PSAUSEND EQU   PSA+1048                                                 05953000
PSARV062 EQU   PSA+1044                                                 05954000
PSACDAL  EQU   PSA+1040                                                 05955000
PSAWTCOD EQU   PSA+1036                                                 05956000
PSAATCVT EQU   PSA+1032                                                 05957000
PSAPCPSW EQU   PSA+1024                                                 05958000
PSAPIR2  EQU   PSA+1020                                                 05959000
PSARV059 EQU   PSA+1018                                                 05960000
PSASVC13 EQU   PSA+1016                                                 05961000
PSALSFCC EQU   PSA+1012                                                 05962000
PSASFACC EQU   PSA+1008                                                 05963000
PSASTOP  EQU   PSA+992                                                  05964000
PSASTART EQU   PSA+976                                                  05965000
PSARSPSW EQU   PSA+968                                                  05966000
PSASRPSW EQU   PSA+960                                                  05967000
PSARV045 EQU   PSA+892                                                  05968000
PSARV044 EQU   PSA+888                                                  05969000
PSARV043 EQU   PSA+884                                                  05970000
PSARV042 EQU   PSA+880                                                  05971000
PSARV041 EQU   PSA+876                                                  05972000
PSARV040 EQU   PSA+872                                                  05973000
PSARV025 EQU   PSA+868                                                  05974000
PSADSSED EQU   PSA+868                                                  05975000
PSADSSPR EQU   PSA+864                                                  05976000
PSADSSFW EQU   PSA+860                                                  05977000
PSADSS14 EQU   PSA+856                                                  05978000
PSADSSPP EQU   PSA+848                                                  05979000
PSADSSRP EQU   PSA+840                                                  05980000
PSADSS05 EQU   PSADSSF4                                                 05981000
PSADSS10 EQU   PSADSSF4                                                 05982000
PSADSSVE EQU   PSADSSF4                                                 05983000
PSADSSDE EQU   PSADSSF4                                                 05984000
PSADSSC0 EQU   PSADSSF4                                                 05985000
PSADSSIE EQU   PSADSSF4                                                 05986000
PSADSS12 EQU   PSADSSF4                                                 05987000
PSADSSRC EQU   PSADSSF4                                                 05988000
PSARV057 EQU   PSADSSF3                                                 05989000
PSARV056 EQU   PSADSSF3                                                 05990000
PSARV055 EQU   PSADSSF3                                                 05991000
PSADSSMC EQU   PSADSSF3                                                 05992000
PSADSSRW EQU   PSADSSF3                                                 05993000
PSADSSNM EQU   PSADSSF3                                                 05994000
PSADSSES EQU   PSADSSF3                                                 05995000
PSADSSGP EQU   PSADSSF3                                                 05996000
PSADSSF2 EQU   PSADSSFL+1                                               05997000
PSADSSPI EQU   PSADSSF1                                                 05998000
PSADSSOI EQU   PSADSSF1                                                 05999000
PSADSSSP EQU   PSADSSF1                                                 06000000
PSADSSTP EQU   PSADSSF1                                                 06001000
PSADSSDW EQU   PSADSSF1                                                 06002000
PSADSSDD EQU   PSADSSF1                                                 06003000
PSADSSDM EQU   PSADSSF1                                                 06004000
PSADSSMV EQU   PSADSSF1                                                 06005000
PSADSSTS EQU   PSA+816                                                  06006000
PSADSSWK EQU   PSA+812                                                  06007000
PSADSSR3 EQU   PSA+808                                                  06008000
PSADSSR2 EQU   PSA+804                                                  06009000
PSADSSRS EQU   PSA+800                                                  06010000
PSASTOR  EQU   PSA+796                                                  06011000
PSAVSTAP EQU   PSA+792                                                  06012000
PSAWKVAP EQU   PSA+788                                                  06013000
PSAWKRAP EQU   PSA+784                                                  06014000
PSAMCHIC EQU   PSA+783                                                  06015000
PSAACTCD EQU   PSA+782                                                  06016000
PSASYMSK EQU   PSA+781                                                  06017000
PSAMCHFL EQU   PSA+780                                                  06018000
PSACR0   EQU   PSA+776                                                  06019000
PSAPSWSV EQU   PSA+768                                                  06020000
PSALITA  EQU   PSA+764                                                  06021000
PSACLHS  EQU   PSAHLHI                                                  06022000
PSALKR15 EQU   PSALKSA+60                                               06023000
PSALKR14 EQU   PSALKSA+56                                               06024000
PSALKR13 EQU   PSALKSA+52                                               06025000
PSALKR12 EQU   PSALKSA+48                                               06026000
PSALKR11 EQU   PSALKSA+44                                               06027000
PSALKR10 EQU   PSALKSA+40                                               06028000
PSALKR9  EQU   PSALKSA+36                                               06029000
PSALKR8  EQU   PSALKSA+32                                               06030000
PSALKR7  EQU   PSALKSA+28                                               06031000
PSALKR6  EQU   PSALKSA+24                                               06032000
PSALKR5  EQU   PSALKSA+20                                               06033000
PSALKR4  EQU   PSALKSA+16                                               06034000
PSALKR3  EQU   PSALKSA+12                                               06035000
PSALKR2  EQU   PSALKSA+8                                                06036000
PSALKR1  EQU   PSALKSA+4                                                06037000
PSALKR0  EQU   PSALKSA                                                  06038000
PSARV023 EQU   PSACLHT+52                                               06039000
PSALOCAL EQU   PSACLHT+48                                               06040000
PSACMSL  EQU   PSACLHT+44                                               06041000
PSAOPTL  EQU   PSACLHT+40                                               06042000
PSATPACL EQU   PSACLHT+36                                               06043000
PSATPDNL EQU   PSACLHT+32                                               06044000
PSATPNCL EQU   PSACLHT+28                                               06045000
PSAIOSLL EQU   PSACLHT+24                                               06046000
PSAIOSUL EQU   PSACLHT+20                                               06047000
PSAIOSCL EQU   PSACLHT+16                                               06048000
PSAIOSSL EQU   PSACLHT+12                                               06049000
PSASALCL EQU   PSACLHT+8                                                06050000
PSAASML  EQU   PSACLHT+4                                                06051000
PSADISPL EQU   PSACLHT                                                  06052000
PSASRSA  EQU   PSA+636                                                  06053000
PSARV050 EQU   PSA+634                                                  06054000
PSADSSGO EQU   PSA+633                                                  06055000
PSARECUR EQU   PSA+632                                                  06056000
PSAHLHIS EQU   PSA+628                                                  06057000
PSAIPCSA EQU   PSA+624                                                  06058000
@NM00095 EQU   PSA+621                                                  06059000
PSAIPCDM EQU   PSA+620                                                  06060000
PSAIPCD  EQU   PSA+616                                                  06061000
@NM00094 EQU   PSA+613                                                  06062000
PSAIPCRM EQU   PSA+612                                                  06063000
PSAIPCR  EQU   PSA+608                                                  06064000
PSAMCHEX EQU   PSA+600                                                  06065000
PSAMPSW  EQU   PSA+592                                                  06066000
PSAEXPS2 EQU   PSA+584                                                  06067000
PSAEXPS1 EQU   PSA+576                                                  06068000
PSAPIREG EQU   PSA+572                                                  06069000
PSARSREG EQU   PSA+568                                                  06070000
PSAGPREG EQU   PSA+556                                                  06071000
PSARV022 EQU   PSASUP4                                                  06072000
PSARV021 EQU   PSASUP4                                                  06073000
PSARV020 EQU   PSASUP4                                                  06074000
PSARV019 EQU   PSASUP4                                                  06075000
PSARV018 EQU   PSASUP4                                                  06076000
PSARV017 EQU   PSASUP4                                                  06077000
PSARV016 EQU   PSASUP4                                                  06078000
PSARV015 EQU   PSASUP4                                                  06079000
PSARV014 EQU   PSASUP3                                                  06080000
PSARV013 EQU   PSASUP3                                                  06081000
PSARV012 EQU   PSASUP3                                                  06082000
PSAESTA  EQU   PSASUP3                                                  06083000
PSASPR   EQU   PSASUP3                                                  06084000
PSAPSREG EQU   PSASUP3                                                  06085000
PSAPI2   EQU   PSASUP3                                                  06086000
PSALCR   EQU   PSASUP2                                                  06087000
PSARTM   EQU   PSASUP2                                                  06088000
PSAACR   EQU   PSASUP2                                                  06089000
PSAIPCE2 EQU   PSASUP2                                                  06090000
PSAIPCES EQU   PSASUP2                                                  06091000
PSAIPCEC EQU   PSASUP2                                                  06092000
PSAGTF   EQU   PSASUP2                                                  06093000
PSAIPCRI EQU   PSASUP2                                                  06094000
PSATYPE6 EQU   PSASUP1                                                  06095000
PSATCTL  EQU   PSASUP1                                                  06096000
PSADISP  EQU   PSASUP1                                                  06097000
PSALOCK  EQU   PSASUP1                                                  06098000
PSAPI    EQU   PSASUP1                                                  06099000
PSAEXT   EQU   PSASUP1                                                  06100000
PSASVC   EQU   PSASUP1                                                  06101000
PSAIO    EQU   PSASUP1                                                  06102000
PSAAOLD  EQU   PSA+548                                                  06103000
PSAANEW  EQU   PSA+544                                                  06104000
PSATOLD  EQU   PSA+540                                                  06105000
PSATNEW  EQU   PSA+536                                                  06106000
PSALCCAR EQU   PSA+532                                                  06107000
PSAPCCAR EQU   PSA+524                                                  06108000
PSACPUPA EQU   PSA+516                                                  06109000
PSAPSA   EQU   PSA+512                                                  06110000
FLCHDEND EQU   PSA+512                                                  06111000
FLCCRSAV EQU   FLCMCLA+280                                              06112000
FLCGRSAV EQU   FLCMCLA+216                                              06113000
FLCFPSAV EQU   FLCMCLA+184                                              06114000
FLCFLA   EQU   FLCMCLA+88                                               06115000
FLCRGNCD EQU   FLCMCLA+84                                               06116000
FLCFSAA  EQU   FLCFSA+1                                                 06117000
@NM00093 EQU   FLCFSA                                                   06118000
@NM00092 EQU   FLCMCLA+77                                               06119000
PSAMDISC EQU   PSAMEDC                                                  06120000
PSAMINTR EQU   PSAMEDC                                                  06121000
PSAMINST EQU   PSAMEDC                                                  06122000
PSAMCCF  EQU   PSAMEDC                                                  06123000
PSAMCNOP EQU   PSAMEDC                                                  06124000
PSAMEXSR EQU   PSAMEDC                                                  06125000
PSAMCOPR EQU   PSAMEDC                                                  06126000
@NM00091 EQU   PSAMEDC                                                  06127000
@NM00090 EQU   FLCMCLA+72                                               06128000
FLCMCIC  EQU   FLCMCLA+64                                               06129000
@NM00089 EQU   FLCMCLA+20                                               06130000
@NM00088 EQU   FLCIOA                                                   06131000
@NM00087 EQU   FLCMCLA+15                                               06132000
@NM00086 EQU   FLCMCLA+14                                               06133000
@NM00085 EQU   FLCMCLA+12                                               06134000
FLCIOELA EQU   FLCIOEL+1                                                06135000
@NM00084 EQU   FLCIOEL                                                  06136000
FLCCHIL  EQU   FLCCHNID+2                                               06137000
FLCCHMOD EQU   FLCCHTM                                                  06138000
FLCCHTYP EQU   FLCCHTM                                                  06139000
@NM00083 EQU   PSA+160                                                  06140000
FLCMTRCD EQU   PSA+157                                                  06141000
@NM00082 EQU   PSA+156                                                  06142000
FLCPERA  EQU   FLCPER+1                                                 06143000
@NM00081 EQU   FLCPER                                                   06144000
@NM00080 EQU   PSA+151                                                  06145000
FLCPERCD EQU   PSA+150                                                  06146000
FLCMCNUM EQU   PSA+149                                                  06147000
@NM00079 EQU   PSA+148                                                  06148000
FLCTEAA  EQU   FLCTEA+1                                                 06149000
@NM00078 EQU   FLCTEA                                                   06150000
PSAPIPC  EQU   PSAPICOD                                                 06151000
PSAPIMC  EQU   PSAPICOD                                                 06152000
PSAPIPER EQU   PSAPICOD                                                 06153000
PSARV049 EQU   FLCPICOD                                                 06154000
FLCPILCB EQU   FLCPIILC                                                 06155000
@NM00077 EQU   FLCPIILC                                                 06156000
@NM00076 EQU   PSAEPPSW                                                 06157000
FLCSVCN  EQU   PSAESPSW+2                                               06158000
FLCSILCB EQU   FLCSVILC                                                 06159000
@NM00075 EQU   FLCSVILC                                                 06160000
@NM00074 EQU   PSAESPSW                                                 06161000
FLCEICOD EQU   PSAEEPSW+2                                               06162000
PSASPAD  EQU   PSAEEPSW                                                 06163000
@NM00073 EQU   PSA+128                                                  06164000
FLCMNPSW EQU   PSA+112                                                  06165000
FLCPNPSW EQU   PSA+104                                                  06166000
FLCSNPSW EQU   PSA+96                                                   06167000
FLCENPSW EQU   PSA+88                                                   06168000
FLCTRACE EQU   PSA+84                                                   06169000
FLCTIMER EQU   PSA+80                                                   06170000
FLCCVT2  EQU   PSA+76                                                   06171000
FLCCSW   EQU   PSA+64                                                   06172000
FLCIOPSW EQU   PSA+56                                                   06173000
FLCMOPSW EQU   PSA+48                                                   06174000
FLCPOPSW EQU   PSA+40                                                   06175000
FLCSOPSW EQU   PSA+32                                                   06176000
FLCEOPSW EQU   PSA+24                                                   06177000
@NM00072 EQU   FLCICCW2+4                                               06178000
FLCCVT   EQU   FLCICCW2                                                 06179000
FLCICCW1 EQU   FLCROPSW                                                 06180000
FLCIPPSW EQU   FLCRNPSW                                                 06181000
*                                      END UNREFERENCED COMPONENTS      06182000
@RT00300 EQU   ACRPROC                                                  06183000
@RT00302 EQU   LOSTCHCD                                                 06184000
@RC00336 EQU   @RC00335                                                 06185000
@RC00305 EQU   IORSEND                                                  06186000
@RF00430 EQU   IORSEND                                                  06187000
@RT00449 EQU   RSTSIGPF                                                 06188000
@RT00453 EQU   IORSEND                                                  06189000
@RT00512 EQU   UPNXT1                                                   06190000
@RT00528 EQU   TBLCK0                                                   06191000
@RT00543 EQU   IORSEND                                                  06192000
@RF00543 EQU   TBLCK                                                    06193000
@RF00540 EQU   HARDWAIT                                                 06194000
@RF00522 EQU   CKOFF                                                    06195000
@RT00579 EQU   TESTIT                                                   06196000
@RT00588 EQU   RESVSIO                                                  06197000
@RF00588 EQU   HARDWAIT                                                 06198000
@RT00615 EQU   HARDWAIT                                                 06199000
@RT00621 EQU   HARDWAIT                                                 06200000
@RT00684 EQU   FCLEAR2                                                  06201000
@RT00691 EQU   DOCLR                                                    06202000
@RT00701 EQU   SINDCK                                                   06203000
@RT00938 EQU   LOSTCHWT                                                 06204000
@RT00983 EQU   CKACTV                                                   06205000
@RT00988 EQU   @RC00981                                                 06206000
@RC00991 EQU   @RC00981                                                 06207000
@RF00997 EQU   FREELOCK                                                 06208000
@RT01008 EQU   ADACK                                                    06209000
@ENDDATA EQU   *                                                        06210000
         END   IECVRSTI,(C'PLS1852',0701,77229)                         06211000
