         TITLE 'I F C E T 0 0 C --- ARGONAUT MDR RECORD SUPPORT'        00060002
* THIS MODULE SUPPORTS ARGONAUT DEVICE --- SUPPORT CODE =               55800002
         GBLC  &DSECT,&CSECT                                            55860002
&DSECT   SETC  'RECORD'                                                 55920002
&CSECT   SETC  'IFCET00C'                                               55980002
IFCET00C CSECT                                                          56040002
*****       D S E C T   G E N E R A T I O N  E N T R I E S        ***** 56100002
RECORD   DSECT                                                          56160002
         DS    0F                                                       56220002
         DSGEN (CLASRC,8),              RECORD TYPE                    X56280002
               (SYSREL,8),              SYSTEM & RELEASE LEVEL         X56340002
               (SWITCH,8,0,3),          SWITCHES (4 BYTES OF EM)       X56400002
               (RCDCNT,8),              COUNT & MULTI PART INDICATION  X56460002
               (SPARE1,8),              SPACE (1 BYTE)                 X56520002
               (DATE,32),               DATE                           X56580002
               (TIME,32),               TIME                           X56640002
               (VERNO,8),               MACHINE VERSION                X56700002
               (CPUSER,24),             C P U SERIAL NO.               X56760002
               (CPUID,16),              C P U IDENTIFICATION           X56820002
               (SPACE2,16),             SPARE (2 BYTES)                X56880002
               (DEVCUA,16),             DEVICE CHANNEL UNIT ADDR       X56940002
               (CNT,8),                 COUNT                          X57000002
               (SPARE,8),               SPACE (1 BYTE)                 X57060002
               (SENSE01,64),            SENSE AREA  1                  X57120002
               (SENSE02,64),            SENSE AREA  2                  X57180002
               (SENSE03,64),            SENSE AREA  3                  X57240002
               (SENSE04,64),            SENSE AREA  4                  X57300002
               (SENSE05,64),            SENSE AREA  5                  X57360002
               (SENSE06,64),            SENSE AREA  6                  X57420002
               (SENSE07,64),            SENSE AREA  7                  X57480002
               (SENSE08,64),            SENSE AREA  8                  X57540002
               (SENSE09,64),            SENSE AREA  9                  X57600002
               (SENSE10,64),            SENSE AREA 10                  X57660002
               (SENSE11,64),            SENSE AREA 11                  X57720002
               (SENSE12,64),            SENSE AREA 12                  X57780002
               (SENSE13,64),            SENSE AREA 13                  X57840002
               (SENSE14,64),            SENSE AREA 14                  X57900002
               (SENSE15,64),            SENSE AREA 15                  X57960002
               (SENSE16,64)             SENSE AREA 16                   58020002
         DSGEN (BTSSHTS,16),            BTSS SHEETS                    X58080002
               (CFSFOLDS,16),           CFS FOLDS                      X58140002
               (PAPERPRS,16),           PAPER PROCESSED                X58200002
               (SERIALNO,16),           SERIAL NUMBER          @Y17CSWTX58260002
               (RECORDWK,72)            RECORD WORK AREA                58320002
         ORG   RECORDWK                                                 58380002
         DSGEN (ERRCODE,8)              SENSE BYTE 4                    58440002
         DSGEN (SNS05,1,0,7),           SENSE BYTE 5                   X58500002
               (SNS06,1,0,7),           SENSE BYTE 6                   X58560002
               (SNS07,1,0,7),           SENSE BYTE 7                   X58620002
               (SNS08,1,0,7),           SENSE BYTE 8                   X58680002
               (SNS09,1,0,7),           SENSE BYTE 9                   X58740002
               (SNS10,1,0,7),           SENSE BYTE 10                  X58800002
               (SNS11,1,0,7),           SENSE BYTE 11                  X58860002
               (SENSECNT,8)             COUNT OF SENSE AREAS            58920002
         DSGEN (SNS05,8,EQU,SNS050),                                   X58980002
               (SNS06,8,EQU,SNS060),                                   X59040002
               (SNS07,8,EQU,SNS070),                                   X59100002
               (SNS08,8,EQU,SNS080),                                   X59160002
               (SNS09,8,EQU,SNS090),                                   X59220002
               (SNS10,8,EQU,SNS100),                                   X59280002
               (SNS11,8,EQU,SNS110)                                     59340002
IFCET00C CSECT                                                          59400002
         USING *,R9                     SET UP BASE REG                 59460002
         USING RECORD,R2                SET UP DSECT PTR                59520002
         DC    A(ENTRY)                 LINE/LABEL SET ADDR             59580002
         DC    CL8'IFCET00C'            MODULE NAME                     59640002
R9PTR    DC    F'0'                                                     59700002
LABELPTR DC    F'0'                                                     59760002
         DS    0F                                                       59820002
CNTSAVE  DC    F'0'                     ENTRY COUNT SAVE AREA           59880002
ENTRYNO  DC    F'0'                     COUNTER SAVE                    59940002
WORK     DC    D'0'                     WORK SPACE                      60000002
ENTRYCNT DC    F'0'                                                     60060002
REGSAVE  DC    4F'0'                                                    60120002
LOOP21   DC    A(LOOP2-4)               LINE                            60180002
ENTRYLB2 DC    A(ENTRYLB-1)             LABEL                           60240002
LINEXIT1 DC    A(LINEXIT-4)             LINE FOR EXIT                   60300002
LBLEXIT1 DC    A(LBLEXIT-1)             LABEL FOR EXIT                  60360002
FMT5ALN1 DC    A(FMT5ALN-4)             LINE FOR FORMAT 5A              60420002
FMT6ALN1 DC    A(FMT6ALN-4)             LINE FOR FORMAT 6A              60480002
FMT3ALN1 DC    A(FMT3ALN-4)             LINE FOR FORMAT 3A              60540002
FMT7ALN1 DC    A(FMT7ALN-4)             LINE FOR FORMAT 7A              60600002
FMT5ALB1 DC    A(FMT5ALB-1)             LABEL FOR FORMAT 5A             60660002
FMT6ALB1 DC    A(FMT6ALB-1)             LABEL FOR FORMAT 6A             60720002
FMT3ALB1 DC    A(FMT3ALB-1)             LABEL FOR FORMAT 3A             60780002
FMT7ALB1 DC    A(FMT7ALB-1)             LABEL FOR FORMAT 7A             60840002
GETOUTLN DC    A(EXITLN-4)              TO MDR MODULE                   60900002
GETOUTLB DC    A(EXITLB-1)              TO MDR MODULE                   60960002
DEVTYPE  EQU   SWITCH2                                                  61020002
SUPPORT  EQU   1                        COUNT OF XDEVTBL ENTRIES        61080002
XDEVTBL  EQU   *                                                        61140002
         DC    X'0C',C'3800'       ARGONAUT CLASS/TYPE CVT              61200002
R0       EQU   0                                                        61680002
R1       EQU   1                                                        61740002
R2       EQU   2                        DSECT PTR                       61800002
R3       EQU   3                        PRINT BUFFR PTR                 61860002
R4       EQU   4                        RECORD POINTER                  61920002
R5       EQU   5                                                        61980002
R6       EQU   6                                                        62040002
R7       EQU   7                                                        62100002
R8       EQU   8                                                        62160002
R9       EQU   9                        MODULE BASE REG                 62220002
R10      EQU   10                                                       62280002
R11      EQU   11                                                       62340002
R12      EQU   12                                                       62400002
R13      EQU   13                                                       62460002
R14      EQU   14                                                       62520002
R15      EQU   15                                                       62580002
L0       EQU   0                        ZERO                            62640002
L1       EQU   1                        ONE                             62700002
L2       EQU   2                        TWO                             62760002
L3       EQU   3                        THREE                           62820002
L4       EQU   4                        FOUR                            62880002
L5       EQU   5                        FIVE                            62940002
L6       EQU   6                        SIX                             63000002
L7       EQU   7                        SEVEN                           63060002
L8       EQU   8                        EIGHT                           63120002
L9       EQU   9                                                        63180002
L23      EQU   23                       TWENTY THREE                    63240002
L46      EQU   46                       FOURTY SIX                      63300002
ZERO     EQU   0                                                        63360002
HW01     DC    H'1'                                                     63420002
EIGHT    DC    H'8'                     EIGHT                           63480002
HW16     DC    H'16'                                                    63540002
NONE     DC    C'NONE  '                                                63600002
UNIV     DC    C'UNIVERSAL'                                             63660002
F3       DC    C'FORMAT 3A'                                             63720002
F5       DC    C'FORMAT 5A'                                             63780002
F6       DC    C'FORMAT 6A'                                             63840002
F7       DC    C'FORMAT 7A'                                             63900002
X80      EQU   X'80'                                                    63960002
X81      EQU   X'81'                                                    64020002
X89      EQU   X'89'                                                    64080002
X8A      EQU   X'8A'                                                    64140002
X8B      EQU   X'8B'                                                    64200002
X8C      EQU   X'8C'                                                    64260002
X90      EQU   X'90'                                                    64320002
X9F      EQU   X'9F'                                                    64380002
X50      EQU   X'50'                                                    64440002
ENTRYNO1 EQU   ENTRYNO+2                                                64500002
         EJECT                                                          64560002
         DS    0F                                                       64620002
COUNTEM  EQU   *                                                        64680002
         STM   R5,R8,REGSAVE            SAVE REGS                       64740002
         XC    ENTRYNO(4),ENTRYNO       INITIALIZE ENTRY NO.            64800002
         XC    SENSECNT(L8),SENSECNT    INTLZE SENSE COUNT AREA         64860002
         LR    R6,R4                    GET RECORD POINTER              64920002
         SR    R5,R5                    ZERO R5                         64980002
COUNTEM1 EQU   *                                                        65040002
         OC    L0(L8,R6),L0(R6)         ANY SENSE INFO?                 65100002
         BZ    RETURN                   NO, BRANCH                      65160002
         LA    R5,L1(R5)                YES, BUMP COUNTER               65220002
         STC   R5,SENSECNT              STORE COUNTER                   65280002
         CH    R5,HW16                  REACHED MAX ?                   65340002
         BE    RETURN                   YES, BRANCH                     65400002
         LA    R6,L8(R6)                NO, BUMP POINTER                65460002
         B     COUNTEM1                 AND GO BACK TO TOP              65520002
SETCPUNO EQU   *                                                        65580002
         STM   R5,R8,REGSAVE            SAVE REGS                       65640002
         SR    R5,R5                    CLEAR R5                        65700002
         IC    R5,L0(R4)                GET CPU TYPE                    65760002
         SLL   R5,L8                                                    65820002
         IC    R5,L1(R4)                                                65880002
         LTR   R5,R5                    IS IT ZERO ?                    65940002
         BNZ   RETURN                   NO, RETURN                      66000002
         LA    R6,L46                   BACK UP POINTER 46 BYTES        66060002
         SR    R3,R6                                                    66120002
         MVC   L0(L9,R3),UNIV           SAY MODEL=UNIVERSAL             66180002
         MVC   L23(L6,R3),NONE          SAY SERIAL=NONE                 66240002
         B     RETURN                                                   66300002
NEXT     EQU   *                                                        66360002
         STM   R5,R8,REGSAVE            SAVE REGS                       66420002
         L     R5,LOOP21                SET UP POINTERS                 66480002
         ST    R5,R9PTR                  V                              66540002
         L     R5,ENTRYLB2               V                              66600002
         ST    R5,LABELPTR               V                              66660002
         B     RETURN                   RETURN                          66720002
SKIP     SR    R15,R15                  SUPRESS PRINT OF LINE           66780002
RETURN   LM    R5,R8,REGSAVE            RESTORE REGS                    66840002
SKIPIT   BR    R14                      RETURN                          66900002
TOPOLOOP EQU   *                                                        66960002
         STM   R5,R8,REGSAVE            SAVE REGS                       67020002
         L     R6,ENTRYNO               GET ENTRY NO.                   67080002
         LA    R6,L1(R6)                INCREMENT BY 1                  67140002
         ST    R6,ENTRYNO               SAVE ENTRY NO.                  67200002
         CH    R6,HW16                  FINISHED W/SENSE INFO ?         67260002
         BH    EXIT                     YES, BRANCH                     67320002
         MH    R6,EIGHT                 CALC OFFSET(ENTRYNO X 8)        67380002
         SH    R6,EIGHT                 AND BACK-UP EIGHT               67440002
         AR    R6,R4                    ADD RECORD POINTER TO IT        67500002
         MVC   RECORDWK(L8),L0(R6)      MOVE SENSE INFO TO WORK         67560002
         OC    RECORDWK(L8),RECORDWK    ANY SENSE INFO ?                67620002
         BZ    EXIT                     NO, BRANCH                      67680002
         L     R6,ENTRYNO               GET ENTRY NO.                   67740002
         CVD   R6,WORK                  CONVERT ENTRYNO TO DEC          67800002
         UNPK  WORK(L4),WORK+6(L2)      UNPACK IT                       67860002
         MVZ   WORK+3(L1),WORK+2         FIX ZONE BITS                  67920002
         MVC   ENTRYLB1(L2),WORK+2      MOVE TO PRINT LINE              67980002
         B     RETURN                                                   68040002
EXIT     EQU   *                                                        68100002
         L     R5,LINEXIT1              NO, SET UP POINTERS             68160002
         ST    R5,R9PTR                  V                              68220002
         L     R5,LBLEXIT1                   V                          68280002
         ST    R5,LABELPTR               V                              68340002
         B     RETURN                   BRANCH                          68400002
TYPE1    EQU   *                                                        68460002
         SR    R15,R15                  INDICATE NO PRINT               68520002
         STM   R5,R8,REGSAVE            SAVE REGISTERS                  68580002
         TM    L0(R2),X90               RECORD TYPE = MDR ?             68640002
         BO    RETURN                   YES, BRANCH                     68700002
*                                       NO                              68760002
         L     R5,GETOUTLN              SET UP POINTERS                 68820002
         ST    R5,R9PTR                      V                          68880002
         L     R5,GETOUTLB               V                              68940002
         ST    R5,LABELPTR                   V                          69000002
         B     RETURN                                                   69060002
TYPELBL  EQU   *                                                        69120002
         STM   R5,R8,REGSAVE            SAVE REGS                       69180002
         L     R6,ENTRYNO               ENTRY NUMBER IN R6              69240002
         MH    R6,EIGHT                 MULT ENTRY NO BY 8              69300002
         AR    R6,R4                    ADD DSECT PTR TO R6             69360002
         SH    R6,EIGHT                 R6 NOW POINTS TO CURRENT SNS    69420002
         CLI   L0(R6),X81               FMT 5 REQD ?                    69480002
         BL    TLBL2                    NO, GO TO NEXT CHECK            69540002
         CLI   L0(R6),X8A               FMT 6A REQD ?                   69600002
         BE    MVCLBL6                  YES, BRANCH                     69660002
         CLI   L0(R6),X89               FMT 5A REQD ?                   69720002
         BNH   MVCLBL5                  YES, BRANCH                     69780002
TLBL2    EQU   *                                                        69840002
         CLI   L0(R6),X50               FMT 3A REQD ?                   69900002
         BL    MVCLBL7                  NO, BRANCH                      69960002
         CLI   L0(R6),X9F               FMT 3A REQD ?                   70020002
         BH    MVCLBL7                  NO, BRANCH                      70080002
         MVC   ERRLBL+33(L8),F3         YES, MOVE IN FORMAT 3           70140002
         B     RETURN                   RETURN                          70200002
MVCLBL6  EQU   *                                                        70260002
         MVC   ERRLBL+33(L8),F6         MOVE IN FORMAT 6                70320002
         B     RETURN                   RETURN                          70380002
MVCLBL5  EQU   *                                                        70440002
         MVC   ERRLBL+33(L8),F5         MOVE IN FORMAT 5                70500002
         B     RETURN                   RETURN                          70560002
MVCLBL7  EQU   *                                                        70620002
         MVC   ERRLBL+33(L8),F7         MOVE IN UNKNOWN(FORMAT 7A)      70680002
         B     RETURN                   RETURN                          70740002
*        THE FOLLOWING CHECKS ARE MADE TO DETERMINE THE FORMATS         70800002
*          TO USE WHEN PRINTING MDR RECORDS. THE FOLLOWING LIST         70860002
*          GIVES THE FORMAT USED FOR SPECIFIC ERROR CODES:              70920002
*                                                                       70980002
*              FORMAT    ERROR CODES                                    71040002
*                                                                       71100002
*                3A        5X-7F WHERE X = 0-F                          71160002
*                3A        8B                                           71220002
*                3A        9X                                           71280002
*                5A        81-89                                        71340002
*                6A        8A                                           71400002
********                                                                71460002
TYPE     EQU   *                                                        71520002
         STM   R5,R8,REGSAVE            SAVE REGISTERS                  71580002
         L     R6,ENTRYNO               ENTRY NUM IN R6                 71640002
         MH    R6,EIGHT                 MULT ENTRY NUM BY 8             71700002
         AR    R6,R4                    ADD DSECT PTR TO R6             71760002
         SH    R6,EIGHT                 R6 NOW POINTS TO CURRENT SNS    71820002
         CLI   L0(R6),X81               FMT 5A REQD ?                   71880002
         BL    TYPE2                    NO, BRANCH TO NEXT CHECK        71940002
         CLI   L0(R6),X8A               FMT 6A REQD ?                   72000002
         BE    FMT6A                    YES, BRANCH TO SET-UP           72060002
         CLI   L0(R6),X89               FMT 5A REQD ?                   72120002
         BNH   FMT5A                    YES, BRANCH TO SET-UP           72180002
TYPE2    EQU   *                                                        72240002
         CLI   L0(R6),X50               FMT 3A REQD ?                   72300002
         BL    FMT7A                    NO, UNKNOWN ERR CODE, BR        72360002
         CLI   L0(R6),X9F               FMT 3A REQD ?                   72420002
         BH    FMT7A                    NO, UNKNOWN ERR CODE, BR        72480002
*                                       YES, DROP THRU & GO             72540002
FMT3A    EQU   *                                                        72600002
         L     R5,FMT3ALN1              SET UP POINTERS                 72660002
         ST    R5,R9PTR                   V                             72720002
         L     R5,FMT3ALB1               V                              72780002
         ST    R5,LABELPTR                V                             72840002
         B     RETURN                    RETURN                         72900002
FMT5A    EQU   *                        ASSUME FORMAT 5A REQD           72960002
         L     R5,FMT5ALN1              SET UP POINTERS                 73020002
         ST    R5,R9PTR                   V                             73080002
         L     R5,FMT5ALB1               V                              73140002
         ST    R5,LABELPTR                V                             73200002
         B     RETURN                    RETURN                         73260002
FMT6A    EQU   *                                                        73320002
         L     R5,FMT6ALN1              SET UP POINTERS                 73380002
         ST    R5,R9PTR                   V                             73440002
         L     R5,FMT6ALB1               V                              73500002
         ST    R5,LABELPTR                V                             73560002
         B     RETURN                    RETURN                         73620002
FMT7A    EQU   *                                                        73680002
         L     R5,FMT7ALN1              SET UP POINTERS                 73740002
         ST    R5,R9PTR                  V                              73800002
         L     R5,FMT7ALB1               V                              73860002
         ST    R5,LABELPTR               V                              73920002
         B     RETURN                   RETURN                          73980002
CONVTYPE EQU   *                                                        74040002
         STM   R5,R8,REGSAVE            SAVE REGS                       74100002
         LA    R5,SUPPORT               BCT COUNT, CONV DEV TYPE TBL    74160002
*        LA    R4,L2(R4)                R4 POINTS TO CLASS/TYPE 2 BYTES 74220002
         LA    R6,XDEVTBL               ADDR OF CLASS/TYPE XLATE TABLE  74280002
NEXT2     EQU   *                                                       74340002
         CLC   L0(L1,R4),L0(R6)         IS THIS CLASS/TYPE WE LOOKIN FO 74400002
         BNE   BUMP                     NO, BRANCH                      74460002
         MVC   L0(L4,R3),L1(R6)         YES, MOVE CLASS/TYPE TO BUFF    74520002
         B     RETURN                   RETURN                          74580002
BUMP     DS    0H                                                       74640002
         LA    R6,L5(R6)                BUMP CONVERT TBL PTR            74700002
         BCT   R5,NEXT2                KEEP LOOKING                     74760002
         MVC   L0(L7,R3),F7                                             74820002
         B     RETURN                  RETURN FROM WENCE YOU CAME       74880002
DATESET  EQU   *                                                        76140002
         UNPK  WORK(L8),L1(L3,R4)       UNPACK THE DATE                 76200002
         MVC   L0(L3,R3),WORK+L5        MOVE DAY                        76260002
         MVC   L5(L2,R3),WORK+L3        MOVE YEAR                       76320002
         B     RETURN                   RETURN                          76380002
         EJECT                                                          76440002
         DS    0F                                                       76500002
ENTRY    EQU   *                                                        76560002
         DC    XL4'0'                                                   76620002
         DC    XL4'0'                                                   76680002
         DC    A(LABELS)                                                76740002
         DC    H'0'                                                     76800002
         LINE  (1,1),(1,1),SKIP=1                                       76860002
         ROUTINE SPARE1,TYPE1                                           76920002
         LABEL ''                                                       76980002
         LINE  SKIP=E                   EJECT                           77040002
         LABEL ''                                                       77100002
         LINE  (78,23),(1,89),SKIP=1                                    77160002
         HEX   CPUID,0,2B                                               77220002
         HEX   CPUSER,0,3B                                              77280002
         ROUTINE CPUID,SETCPUNO                                         77340002
         LABEL '---RECORD ENTRY TYPE - MDR              SOURCE - MISC  X77400002
                         CPU MODEL','SERIAL NO.'                        77460002
         LINE  (17,1),(4,1),SKIP=1                                      77520002
         SYSRELN SYSREL,4                                      @D35UGFD 77580000
         LABEL ''                                              @D35UGFD 77610000
         LINE  ,(25,23),SKIP=1                                          77700002
         LABEL 'DAY YEAR','HH.MM.SS.TH'                                 77760002
         LINE  (25,23),(18,23),SKIP=2                                   77820002
         ROUTINE DATE,DATESET                                           77880002
         HEX   TIME,1,4B                                                77940002
         LABEL 'DATE -','TIME -'                                        78000002
         LINE  (24),(2),SKIP=1                                          78060002
         ROUTINE DEVTYPE,CONVTYPE                                       78120002
         LABEL 'DEVICE TYPE'                                            78180002
         LINE  (24),(2),SKIP=2                                          78240002
         HEX   DEVCUA,0,2B                                              78300002
         LABEL 'CHANNEL UNIT ADDRESS'                                   78360002
         LINE  (45,1),(1),SKIP=1                                        78600002
         ROUTINE SENSE01,COUNTEM                                        78660002
         CONVT SENSECNT,1,2                                             78720002
         LABEL 'NUMBER OF ENTRIES IN THIS RECORD (DECIMAL) -'           78780002
         LINE  (45,1),(1),SKIP=2                                        78800002
         LABEL 'INTERNAL LOG ENTRY BYTES 0-7 ARE SAME AS SENSE BYTES 4-X78820002
               11'                                                      78830002
LOOP2    LINE  (11),(1),SKIP=1                                          78840002
         ROUTINE SENSE01,TOPOLOOP                                       78900002
ENTRYLB  LABEL 'ENTRY NO.    '                                          78960002
         LINE  ,(1),SKIP=1                                              79020002
         LABEL '|---------------------------------------|'              79080002
         LINE  (31),(1,40),SKIP=1                                       79140002
         HEX   ERRCODE,0,1B                                             79200002
         ROUTINE SENSE01,TYPELBL                                        79260002
ERRLBL   LABEL '| STATUS CODE (SENSE BYTE 4) -','| XXXXXXXX'            79320002
         LINE  ,(1),SKIP=2                                              79380002
         LABEL '|---------------------------------------|'              79440002
         LINE  ,(3,17),SKIP=1                                           79680002
         LABEL 'SENSE','SENSE','SENSE','SENSE','SENSE','SENSE','SENSE'  79740002
         LINE  (12,17),(3,17),SKIP=0                                    79800002
         HEX   SNS05,0,1B                                               79860002
         HEX   SNS06,0,1B                                               79920002
         HEX   SNS07,0,1B                                               79980002
         HEX   SNS08,0,1B                                               80040002
         HEX   SNS09,0,1B                                               80100002
         HEX   SNS10,0,1B                                               80160002
         HEX   SNS11,0,1B                                               80220002
         LABEL 'BYTE 5 -','BYTE 6 -','BYTE 7 -','BYTE 8 -','BYTE 9 -','X80280002
               BYTE 10 -','BYTE 11 -'                                   80340002
         LINE  (14,17),(1),SKIP=1                                       80400002
         ROUTINE SENSE01,TYPE                                           80460002
         LABEL ''                                                       80520002
FMT3ALN  LINE  ,(2,17),SKIP=2                                           80580002
FMT3ALB  LABEL 'RETRY COUNT','FO STAT(6-3)','CORNA STAT(6-8)','PRCS STAX80640002
               T(6-9)','CGEN STAT1(4-0)','CGEN STAT2(4-1)','CGEN STAT3(X80700002
               4-2)'                                                    80760002
         LINE  (14,17),(1,17),SKIP=1                                    80820002
         BIN   (SNS050,0,1),                                           X80880002
               (SNS060,0,1),                                           X80940002
               (SNS070,0,1),                                           X81000002
               (SNS080,0,1),                                           X81060002
               (SNS090,0,1),                                           X81120002
               (SNS100,0,1),                                           X81180002
               (SNS110,0,1)                                             81240002
         LABEL 'RETRY CT 8','FOF OCCURRED','ERAS LMP OFF',             X81300002
               'CONTR BIT 4','DRUM/MIRR TH','SSYS CLK ER','UPGM AHEAD'  81360002
         LINE                                                           81420002
         BIN   (SNS051,0,1),                                           X81480002
               (SNS061,0,1),                                           X81540002
               (SNS071,0,1),                                           X81600002
               (SNS081,0,1),                                           X81660002
               (SNS091,0,1),                                           X81720002
               (SNS101,0,1),                                           X81780002
               (SNS111,0,1)                                             81840002
         LABEL 'RETRY CT 4','FO INT HI','CLNR NOT RUN','CONTR BIT 2',  X81900002
               'MIRR MTR TH','BIT TIME CLK','PRT LIN SYNC'              81960002
         LINE                                                           82020002
         BIN   (SNS052,0,1),                                           X82080002
               (SNS062,0,1),                                           X82140002
               (SNS072,0,1),                                           X82200002
               (SNS082,0,1),                                           X82260002
               (SNS092,0,1),                                           X82320002
               (SNS102,0,1),                                           X82380002
               (SNS112,0,1)                                             82440002
         LABEL 'RETRY CT 2','FO INT LO','PRECLN COR','CONTR BIT 1',    X82500002
               'MIRR DRV AMP','WCGM INP PE','LIN BUF INTF'              82560002
         LINE                                                           82620002
         BIN   (SNS053,0,1),                                           X82680002
               (SNS063,0,1),                                           X82740002
               (SNS073,0,1),                                           X82800002
               (SNS083,0,1),                                           X82860002
               (SNS093,0,1),                                           X82920002
               (SNS103,0,1),                                           X82980002
               (SNS113,0,1)                                             83040002
         LABEL 'RETRY CT 1','FO HLD INTLK','CHG COR CK','DVLPR INTLK', X83100002
               'MIRR CURR HI','LIN BUF PE','LIN BUF ORUN'               83160002
         LINE                                                           83220002
         BIN   (SNS054,0,1),                                           X83280002
               (SNS064,0,1),                                           X83340002
               (SNS074,0,1),                                           X83400002
               (SNS084,0,1),                                           X83460002
               (SNS094,0,1),                                           X83520002
               (SNS104,0,1),                                           X83580002
               (SNS114,0,1)                                             83640002
         LABEL 'RESERVED','RESERVED','XFR COR CK','TNR HPR EMPT',      X83700002
               'MIRR SYNC','SERIALZR PE','UNDSCORE PE'                  83760002
         LINE                                                           83820002
         BIN   (SNS055,0,1),                                           X83880002
               (SNS065,0,1),                                           X83940002
               (SNS075,0,1),                                           X84000002
               (SNS085,0,1),                                           X84060002
               (SNS095,0,1),                                           X84120002
               (SNS105,0,1),                                           X84180002
               (SNS115,0,1)                                             84240002
         LABEL 'RESERVED','RESERVED','POSXFR COR ','TNR COL FULL','LASRX84300002
                SYNC','ANY WCGM PE','UNDSCORE BIT'                      84360002
         LINE                                                           84420002
         BIN   (SNS056,0,1),                                           X84480002
               (SNS066,0,1),                                           X84540002
               (SNS076,0,1),                                           X84600002
               (SNS086,0,1),                                           X84660002
               (SNS096,0,1),                                           X84720002
               (SNS106,0,1),                                           X84780002
               (SNS116,0,1)                                             84840002
         LABEL 'RESERVED','RESERVED','DRUM SVO ER','CYCLONE VAC','LASR X84900002
               LOW PWR','CAR BIT 0','BIT CTR OFLO'                      84960002
         LINE                                                           85020002
         BIN   (SNS057,0,1),                                           X85080002
               (SNS067,0,1),                                           X85140002
               (SNS077,0,1),                                           X85200002
               (SNS087,0,1),                                           X85260002
               (SNS097,0,1),                                           X85320002
               (SNS107,0,1),                                           X85380002
               (SNS117,0,1)                                             85440002
         LABEL 'RESERVED','RESERVED','DVLPR BIAS','COL HANDL CK',      X85500002
               'RESERVED','CAR BIT 1','PRT/HOR CT=0'                    85560002
******                                  FORMAT 3A COMPLETE ******       85620002
FMT3AEND LINE  (11),(1),SKIP=1                                          85680002
         ROUTINE SPARE1,NEXT                                            85740002
         LABEL ''                                                       85800002
FMT5ALN  LINE  (14,17),(2,17),SKIP=2                                    85860002
FMT5ALB  LABEL 'INTRPT REQ','MAR HI','MAR LO','IEU REG 1(0-2)','IEU REGX85920002
                2(0-3)','INST/SOREG HI','INST/SOREG LO'                 85980002
         LINE  (14,17),(1,17),SKIP=1                                    86040002
         BIN   (SNS050,0,1)                                             86100002
         ROUTINE SPARE1,SKIPIT                                          86160002
         ROUTINE SPARE1,SKIPIT                                          86220002
         BIN   (SNS080,0,1),                                           X86280002
               (SNS090,0,1)                                             86340002
         LABEL 'SO REG',' ',' ','MIRH PE','SAR PE'                      86400002
         LINE                                                           86460002
         BIN   (SNS051,0,1)                                             86520002
         ROUTINE SPARE1,SKIPIT                                          86580002
         ROUTINE SPARE1,SKIPIT                                          86640002
         BIN   (SNS081,0,1),                                           X86700002
               (SNS091,0,1)                                             86760002
         LABEL 'LEVEL 1',' ',' ','MIRL PE','LSR PE'                     86820002
         LINE                                                           86880002
         BIN   (SNS052,0,1)                                             86940002
         ROUTINE SPARE1,SKIPIT                                          87000002
         ROUTINE SPARE1,SKIPIT                                          87060002
         BIN   (SNS082,0,1),                                           X87120002
               (SNS092,0,1)                                             87180002
         LABEL 'LEVEL 2',' ',' ','MDR PE','INBUS PE'                    87240002
               LINE                                                     87300002
         BIN   (SNS053,0,1)                                             87360002
         ROUTINE SPARE1,SKIPIT                                          87420002
         ROUTINE SPARE1,SKIPIT                                          87480002
         BIN   (SNS083,0,1),                                           X87540002
               (SNS093,0,1)                                             87600002
         LABEL 'LEVEL 3',' ',' ','WCS DBL BIT','NO DEV RSP'             87660002
         LINE                                                           87720002
         BIN   (SNS054,0,1)                                             87780002
         ROUTINE SPARE1,SKIPIT                                          87840002
         ROUTINE SPARE1,SKIPIT                                          87900002
         BIN   (SNS084,0,1),                                           X87960002
               (SNS094,0,1)                                             88020002
         LABEL 'LEVEL 4',' ',' ','ALUA PE','I-CYCLE'                    88080002
         LINE                                                           88140002
         BIN   (SNS055,0,1)                                             88200002
         ROUTINE SPARE1,SKIPIT                                          88260002
         ROUTINE SPARE1,SKIPIT                                          88320002
         BIN   (SNS085,0,1),                                           X88380002
               (SNS095,0,1)                                             88440002
         LABEL 'LEVEL 5',' ',' ','ALUB PE','E-CYCLE'                    88500002
         LINE                                                           88560002
         BIN   (SNS056,0,1)                                             88620002
         ROUTINE SPARE1,SKIPIT                                          88680002
         ROUTINE SPARE1,SKIPIT                                          88740002
         BIN   (SNS086,0,1),                                           X88800002
               (SNS096,0,1)                                             88860002
         LABEL 'LEVEL 6',' ',' ','SDRH PE','ROS HSL'                    88920002
         LINE                                                           88980002
         BIN   (SNS057,0,1)                                             89040002
         ROUTINE SPARE1,SKIPIT                                          89100002
         ROUTINE SPARE1,SKIPIT                                          89160002
         BIN   (SNS087,0,1),                                           X89220002
               (SNS097,0,1)                                             89280002
         LABEL 'RESERVED',' ',' ','SDRL PE','ANY ERROR'                 89340002
******                                  FORMAT 5A COMPLETE ******       89400002
FMT5AEND LINE                                                           89460002
         ROUTINE SPARE1,NEXT                                            89520002
         LABEL ''                                                       89580002
FMT6ALN  LINE  ,(2,17),SKIP=2                                           89640002
FMT6ALB  LABEL 'RETRY COUNT','CNTRL FLAGS','TRACK ADDR','RESERVED','RESX89700002
               ERVED','RESERVED','RESERVED'                             89760002
         LINE  (31),(18),SKIP=1                                         89820002
         BIN   (SNS070,0,1)                                             89880002
         LABEL 'INTF RTN RQD'                                           89940002
         LINE                                                           90000002
         BIN   (SNS071,0,1)                                             90060002
         LABEL 'RESERVED'                                               90120002
         LINE                                                           90180002
         BIN   (SNS072,0,1)                                             90240002
         LABEL 'ALT TRK USED'                                           90300002
         LINE                                                           90360002
         BIN   (SNS073,0,1)                                             90420002
         LABEL 'PERMANENT'                                              90480002
         LINE                                                           90540002
         BIN   (SNS074,0,1)                                             90600002
         LABEL 'NO ALT AVAIL'                                           90660002
         LINE                                                           90720002
         BIN   (SNS075,0,1)                                             90780002
         LABEL 'RETAIN PWR'                                             90840002
         LINE                                                           90900002
         BIN   (SNS076,0,1)                                             90960002
         LABEL 'DIAG LD MODE'                                           91020002
         LINE                                                           91080002
         BIN   (SNS077,0,1)                                             91140002
         LABEL 'IMPL MODE'                                              91200002
******                                  FORMAT 6A COMPLETE ******       91260002
FMT6AEND LINE  (11),(1),SKIP=1                                          91320002
         ROUTINE SPARE1,NEXT                                            91380002
         LABEL ''                                                       91440002
FMT7ALN  LINE  (14,17),(2,17),SKIP=2                                    91500002
FMT7ALB  LABEL 'RESERVED','RESERVED','RESERVED','RESERVED','RESERVED','X91560002
               RESERVED','RESERVED'                                     91620002
FMT7AEND LINE  (11),(1),SKIP=1                                          91680002
         ROUTINE SPARE1,NEXT                                            91740002
         LABEL ''                                                       91800002
LINEXIT  LINE  (40,1),(1,45),SKIP=1                                     91860002
         CONVT BTSSHTS,2,6                                              91920002
LBLEXIT  LABEL 'BTS COUNT                    (DECIMAL)','00'            91980002
         LINE  (40,1),(1,45),SKIP=1                                     92040002
         CONVT CFSFOLDS,2,6                                             92100002
         LABEL 'CFS COUNT                    (DECIMAL)','00'            92160002
         LINE  (40,1),(1,45),SKIP=2                                     92220002
         CONVT PAPERPRS,2,6                                             92280002
         LABEL 'PAPER COUNT                  (DECIMAL)','00'            92340002
         LINE  (40,1),(1,1),SKIP=3                                      92350002
         CONVT SERIALNO,2,4                                             92360002
         LABEL 'DEVICE SERIAL NO.'                                      92370002
         LINE  SKIP=1                                                   92400002
         LABEL ''                                                       92460002
         DC    X'FF'                    BAIL OUT                        92520002
         DC    X'00A4'                                                  92580002
         DC    X'0018'                  OFFSET IN THE RECORD            92640002
         DC    X'0018'                                                  92700002
EXITLN   LINE                                                           92760002
EXITLB   LABEL ''                                                       92820002
         DC    X'FE'                                                    92880002
         DC    C'IFCEXXXF'                                              92940002
LABELS   DS    0F                                                       93000002
         LSTART                                                         93060002
ENTRYLB1 EQU   ENTRYLB+10               LABEL FOR MOVE (MVC)            93120002
         END                                                            93180002
