         TITLE 'IFCEXXXH - 3895 EDIT TABLE - ALIAS IFCE3895'            00050002
* ** THIS MODULE IS ENTIRELY IN SUPPORT OF CODE G30HIMD  ****           00100002
**** IT IS APPLICABLE FOR VS1 W/ SU01, MVS W/ SU27 AND AS SVS ICR ****  00150002
         SPACE 2                                                        00200002
         GBLC  &DSECT,&CSECT                                            46650002
IFCEXXXH CSECT                                                          46700002
&DSECT   SETC  'XXXH'                                                   46750002
&CSECT   SETC  'IFCEXXXH'                                               46800002
*                                                                       46850002
*                                                                       46900002
*                                                                       46950002
XXXH     DSECT                                                          47000002
         DSGEN (CLASS,8),(XRELN,8),(XDUM1,8),                    S21021X47050002
               (SW2B0,1),(SW2B1,1),(SW2B2,1),(SW2B3,1),          S21021X47100002
               (SW2B4,1),(SW2B5,1),(SW2B6,1),(SW2B7,1)           S21021 47150002
         DSGEN (XDUM3,32)                         SPARES                47200002
         DSGEN (XDATE,32)                         DATE                  47250002
         DSGEN (XTIME,32)                         TIME                  47300002
         DSGEN (XDUM4,8),(XSER,24)           SERIAL NO                  47350002
         DSGEN (XMODEL,16),(XDUM5,16)        MODEL NUMBER & MCLEN       47400002
         DSGEN (XPGN1,32)                    PROGRAM                    47450002
         DSGEN (XPGN2,32)                            NAME               47500002
         DSGEN (XFCCWCC,8),(XFCCWDA,24)  FAILING CCW                    47550002
         DSGEN (XFCCWFL,8),(XZERO,8),(XFCCWCT,16)                       47600002
         DSGEN (XCSWK,8),(XCSWCA,24)         CHAN  STATUS               47650002
         DSGEN (XCSWATTN,1),(XCSWSM,1),(XCSWCUE,1),      WORD  CSW     C47700002
               (XCSWBSY,1),(XCSWCE,1),(XCSWDE,1),(XCSWUC,1),(XCSWUE,1),C47750002
               (XCSWPCI,1),(XCSWSILI,1),(XCSWPC,1),(XCSWPCHK,1),       C47800002
               (XCSWCDC,1),(XCSWCCC,1),(XCSWICC,1),(XCSWCH,1),         C47850002
               (XCSWCT,16)                                              47900002
         DSGEN (XDUMA,16),(XCUA2,16)                             S21021 47950000
         DSGEN (XDEVT1,16),(XDEVT2,16)       DEVICE TYPE                48000002
         DSGEN (XDUM6,8),(XCUA,24)           DUMMY AND CUA              48050002
         DSGEN (XRETRY,16),(XNUMSNS,16) RTRY AND NO.SENSE BYTES         48100002
         DSGEN (SNS00,1,0,7)       SENSE                                48150002
         DSGEN (SNS01,1,0,7)       BYTES                                48200002
         DSGEN (SNS02,1,0,7)                                            48250002
         DSGEN (SNS03,1,0,7)                                            48300002
         DSGEN (SNS04,1,0,7)                                            48350002
         DSGEN (SNS05,1,0,7)                                            48400002
         DSGEN (SNS06,1,0,7)                                            48450002
         DSGEN (SNS07,1,0,7)                                            48500002
         DSGEN (SNS08,1,0,7)                                   @M04AE95 48501002
         DSGEN (SNS09,1,0,7)                                   @M04AE95 48502002
         DSGEN (SNS10,1,0,7)                                   @M04AE95 48503002
         DSGEN (SNS11,1,0,7)                                   @M04AE95 48504002
         DSGEN (SNS12,1,0,7)                                   @M04AE95 48505002
         DSGEN (SNS13,1,0,7)                                   @M04AE95 48506002
         DSGEN (SNS14,1,0,7)                                   @M04AE95 48507002
         DSGEN (SNS15,1,0,7)                                   @M04AE95 48508002
         DSGEN (SNS16,1,0,7)                                   @M04AE95 48509002
         DSGEN (SNS17,1,0,7)                                   @M04AE95 48510002
         DSGEN (SNS18,1,0,7)                                   @M04AE95 48511002
         DSGEN (SNS19,1,0,7)                                   @M04AE95 48512002
         DSGEN (SNS20,1,0,7)                                   @M04AE95 48513002
         DSGEN (SNS21,1,0,7)                                   @M04AE95 48514002
         DSGEN (SNS22,1,0,7)                                   @M04AE95 48515002
         DSGEN (SNS23,1,0,7)                                   @M04AE95 48516002
         DSGEN (SNS24,1,0,7)                                   @M04AE95 48517002
         DSGEN (SNS25,1,0,7)                                   @M04AE95 48518002
         DSGEN (SNS26,1,0,7)                                   @M04AE95 48519002
         DSGEN (SNS27,1,0,7)                                   @M04AE95 48520002
         DSGEN (SNS28,1,0,7)                                   @M04AE95 48521002
         DSGEN (SNS29,1,0,7)                                   @M04AE95 48522002
         DSGEN (SNS30,1,0,7)                                   @M04AE95 48523002
         DSGEN (SNS31,1,0,7)                                   @M04AE95 48524002
         ORG   SNS000                                          @M04AE95 48525002
         DSGEN (SNS,16,1,8,1,2)                                @M04AE95 48526002
         ORG   SNS000                                          @ZA24284 48527000
         DSGEN (SNSRSV1,72)                                    @ZA24284 48530000
         DSGEN (SNSMCS,16)                                     @ZA24284 48533000
         DSGEN (SNSRSV2,168)                                   @ZA24284 48536000
         DSGEN (SNSRSV,56)                                     @M04AE95 48539000
         DSGEN (SNSSTAT,1,0,7)                                 @ZA24284 48542000
         DSGEN (BASC1,1,0,7)                                            48550002
         DSGEN (BASC2,1,0,7)                                            48570002
         DSGEN (XDUMZ,8),(XSIOCNT,24)        START I/O COUNT            48650002
*                                                                       48700002
*        END OF DSECT                                                   48750002
*                                                                       48800002
IFCEXXXH CSECT                                                          48850002
         USING *,R9                                                     48900002
R0       EQU   0                                                        48950002
R1       EQU   1                                                        49000002
R2       EQU   2                                                        49050002
R3       EQU   3                                                        49100002
R4       EQU   4                                                        49150002
R5       EQU   5                                                        49200002
R6       EQU   6                                                        49250002
R7       EQU   7                                                        49300002
R8       EQU   8                                                        49350002
R9       EQU   9                                                        49400002
R10      EQU   10                                                       49450002
R11      EQU   11                                                       49500002
R12      EQU   12                                                       49550002
R13      EQU   13                                                       49600002
R14      EQU   14                                                       49650002
R15      EQU   15                                                       49700002
L0       EQU   0                                                        49750002
L1       EQU   1                                                        49800002
L2       EQU   2                                                        49850002
L3       EQU   3                                                        49900002
L4       EQU   4                                                        49950002
L5       EQU   5                                                        50000002
L6       EQU   6                                                        50050002
L7       EQU   7                                                        50100002
L8       EQU   8                                                        50150002
L9       EQU   9                                                        50200002
L10      EQU   10                                                       50250002
L11      EQU   11                                                       50300002
L12      EQU   12                                                       50350002
L13      EQU   13                                                       50400002
L14      EQU   14                                                       50450002
L15      EQU   15                                                       50500002
L16      EQU   16                                                       50550002
L17      EQU   17                                                       50600002
L18      EQU   18                                                       50650002
L19      EQU   19                                                       50700002
L20      EQU   20                                                       50750002
L21      EQU   21                                                S21021 50800002
L24      EQU   24                                                       50850002
L28      EQU   28                                                       50900002
L29      EQU   29                                                S21021 50950002
L31      EQU   31                                                S21021 51000002
L34      EQU   34                                                S21021 51050002
L36      EQU   36                                                S21021 51100002
L40      EQU   40                                                S21021 51150002
L44      EQU   44                                                S21021 51200002
L46      EQU   46                                                S21021 51250002
L64      EQU   64                                                S21021 51300002
L104     EQU   104                                               S21021 51350002
L120     EQU   120                                               S21021 51400002
HEX01    EQU   X'01'                                           @M04AE95 51420002
HEX04    EQU  X'04'                                            @ZA35369 51430000
HEX08    EQU   X'08'                                             S21021 51450002
HEX10    EQU   X'10'                                             S21021 51500002
HEX20    EQU   X'20'                                             S21021 51550002
HEX30    EQU   X'30'                                                    51600002
HEX40    EQU   X'40'                                           @ZA24284 51650000
HEX44    EQU   X'44'                                             S21021 51670000
HEX46    EQU   X'46'                                             S21021 51690000
HEX50    EQU   X'50'                                             S21021 51710000
HEX60    EQU   X'60'                                           @ZA24284 51730000
HEX80    EQU   X'80'                                                    51750000
HEXA0    EQU   X'A0'                                           @ZA24284 51770000
HEXC0    EQU   X'C0'                                           @ZA24284 51790000
HEXE0    EQU   X'E0'                                           @ZA24284 51810000
XFF      EQU   X'FF'                                             S21021 51850002
A        EQU   C'A'                                              S21021 51900002
B        EQU   C'B'                                              S21021 51950002
         USING XXXH,R2                                           S21021 52000002
*                                                                       52050002
HEX05    EQU   X'05'                                                    52100002
         DC    A(ENTRIES)               PTR TO EDIT ENTRIES             52150002
         DC    CL8'IFCEXXXH'                                   @ZA24284 52200000
XR9PTR   DC    F'0'                     PTR TO NXT EDIT-4        S21021 52250002
XLABELP  DC    F'0'                                                     52300002
*        SPECIAL ROUTINE SECTION                                        52350002
*                                                                       52400002
SKIPPER  BR    R14                      NOOP RTRN                       52450002
*                                                                       52500002
*                                                                       52550002
SPACER1  LA    R3,L1(R3)                SPACE ONE BLANK          S21021 52600002
         BR    R14                      RETURN                          52650002
*                                                                       52700002
SPACER16 LA    R3,L16(R3)          SPACE 16 BLANKS                      52750002
         BR    14                  RETURN                               52800002
*                                                                       52850002
*        SET BINARY                                                     52900002
*              R4 HAS PTR TO CHAR                                       52950002
*                                                                       53000002
SETBIN   STM   R5,R8,XSAVE              SAVE REGS                       53050002
         IC    R7,L0(R4)                PICK UP CHAR TO PRINT           53100002
         SLL   R7,L24                   MOVE IT TO HI OF R7             53150002
         LR    R8,R3                    PRINT POS POINTER               53200002
         LA    R5,L8                    LOOP COUNT                      53250002
SETBINA  SR    R6,R6                    CLEAR REG 6                     53300002
         SLDL  R6,L1                    MOVE BIT TO R6                  53350002
         STC   R6,L0(R8)                PUT IT INTO PTINT LINE          53400002
         MVZ   L0(L1,R8),CHAR0          MOVE ON PRORPER ZONE            53450002
         LA    R8,L1(R8)                BUMP POINTER TO NEXT POS        53500002
         BCT   R5,SETBINA               LOOP TILL 8 PRINTED             53550002
         B     RETURN                   RETURN                          53600002
*                                                                       53650002
*                                                                       53700002
*        SET PROGRAM NAME  R4 POINTS TO NAME FIELD                      53750002
*                                                                       53800002
SETPGMN  DS    0H                                                S21021 53850002
         TM    SW2B0,HEX20              SHORT RECORD             S21021 53900002
         BCR   1,R14                    YES, NO JOB ID           S21021 53950002
         MVC   0(L12,R3),JOBID          MOVE IN LABEL            S21021 54000002
         MVC   L13(L8,R3),XPGN1         MOVE IN NAME             S21021 54050002
         BR    R14                                               S21021 54100002
NONAME   TM    L0(R4),HEX20             SHORT RECORD?            S21021 54150002
         BCR   14,R14                   NO, LET HEX JOBNAME PRNT S21021 54200002
         ST    R5,XSAVE                 SAVE REG                 S21021 54250002
         LA    R5,L44                   BACK UP BUFFER PNTR      S21021 54300002
         SR    R3,R5                                             S21021 54350002
         MVC   0(L17,R3),BLANKS         CLEAR OUT HEX JOBNAME    S21021 54400002
         L     R5,XSAVE                 RESTORE REG              S21021 54450002
         BR    R14                                               S21021 54500002
*                                                                       54550002
*                                                                       54600002
*        SET HEX  SAME AS BIN EXCPT PRINTS 1 CHAR HEX                   54650002
*                                                                       54700002
SETHEX   STM   R5,R8,XSAVE              SAVE REGS                       54750002
         LA    R8,CHARS                 CHAR TABLE POINTER              54800002
         IC    R7,L0(R4)                PICK UP CHAR                    54850002
         SLL   R7,L24                   MOVE IT TO HI OF R7             54900002
         SR    R6,R6                    CLEAR REGS                      54950002
         SLDL  R6,L4                    MOVE FOUR BITS                  55000002
         AR    R6,R8                    ADD OFFSET & PTR                55050002
         MVC   L0(L1,R3),L0(R6)         MOVE CHAR TO LINE               55100002
         SR    R6,R6                    CLEAR AGAIN                     55150002
         SLDL  R6,L4                    MOVE LAST 4 BOTS                55200002
         AR    R6,R8                    COMPUTE OFFSET                  55250002
         MVC   L1(L1,R3),L0(R6)         MOVE LAST CHAR                  55300002
         B     RETURN                                                   55350002
*                                                                       55400002
*                                                                       55450002
*                                                                       55500002
SETCONV  TM    L0(R4),HEX02             HAS RECORD BEEN CONVERTED KEY32 55550002
         BCR   ON,R14                   YES RETURN                      55600002
         SR    R15,R15                  NO CLEAR R15 FOR NO PRINT OF    55650002
         BR    R14                      LINE BR-14                      55700002
ON       EQU   1                                                        55750002
HEX02    EQU   X'02'                                                    55800002
*                                       SET DEVICE TYPE FIELD           55850002
*                                                                       55900002
*                                                                       55950002
*                                                                       56000002
*                             CHECK ON CPU AND SERIAL NO                56050002
SETCPUNO STM   R5,R8,XSAVE                                              56100002
         SR    R5,R5               CLEAR R5                             56150002
         IC    R5,L0(R4)           PICK UP MODEL NO                     56200002
         SLL   R5,L8               IN TO                                56250002
         IC    R5,L1(R4)           R5                                   56300002
         LTR   R5,R5                    TEST FOR ZERO MODEL      S21021 56350002
         LR    R5,R3                    POINT TO DATA FIELD      S21021 56400002
         BNZ   SETSER                   BRANCH IF MODEL NOT 0    S21021 56450002
         LA    R6,L46                   BACK UP TO SAY 'NONE'    S21021 56500002
         SR    R5,R6                    BACKUP BUFFER            S21021 56550002
         MVC   L0(L29,R5),UNIVERS       SAY NONE, MODEL UNIVERSALS21021 56600002
         B     RETURN                   RETURN  CONTROL                 56650002
SETSER   LA    R6,L36                   SET UP TO ADD 'SERIAL NO.S21021 56700002
         SR    R5,R6                                             S21021 56750002
         MVC   0(L10,R5),SERNO                                   S21021 56800002
         B     RETURN                                            S21021 56850002
*                                                                       56900002
*        SET DATE                                                       56950002
*                                                                       57000002
SETDATE  CLC   L1(L3,R4),ZERO           IS DATE ZERO                    57050002
         BE    SETDTE                   BR-YES                          57100002
         UNPK  XSAVE(L8),L1(L3,R4)      UNPACK DATE                     57150002
         MVC  L5(L2,R3),XSAVE+L3  MOVE YEAR                             57200002
         MVC   L0(L3,R3),XSAVE+L5       MOVE DAY                        57250002
         BR    R14                      RETURN                          57300002
SETDTE   MVC   L0(L4,R3),NONE           SET DATE TO NONE                57350002
         BR    R14                                                      57400002
ZERO     DC    XL4'00'                                                  57450002
*                                                                       57500002
*                                                                       57550002
*                                                                       57600002
RETURN   LM    R5,R8,XSAVE              RESTORE REG                     57650002
         BR    R14                      RETURN                          57700002
HEX03    EQU   X'03'                                                    57750002
HEX18    EQU   X'18'                                                    57800002
*                                                                       57850002
CHKPROC  STM   R5,R8,XSAVE                                              58850002
         TM    L0(R4),HEX10        PRINT JUST SENSE DATA                58900002
         BZ    CHKPROC2            BRANCH IF YES                        58950002
         LR    R5,R4               SAVE R4                              59000002
         LA    R5,L1(R5)           GET TO BASIC SENSE BYT 2    @M04AE95 59050002
         TM    L0(R5),HEX01        PROCESSOR OR EXTENDED       @M04AE95 59070002
         BO    RETURN              BRANCH IF PROCESSOR                  59150002
         L     R5,EXTEND           RESET LABELS AND                     59200002
         ST    R5,XR9PTR           LINE POINTERS FOR                    59250002
         L     R5,EXTEND1          EXTENDED SENSE DATA                  59300002
         ST    R5,XLABELP                                               59350002
         B     RETURN                                                   59400002
CHKPROC2 L     R5,FINISH           BYPASS PROCESSOR AND                 59450002
         ST    R5,XR9PTR           EXTENDED SENSE DATA                  59500002
         L     R5,FINISH1                                               59550002
         ST    R5,XLABELP                                               59600002
         B     RETURN                                                   59650002
*                                                                       59700002
CKTYPE   STM   R5,R8,XSAVE         SAVE REGISTERS                       59750002
         TM    CLASS,HEX30         IS IT REALLY OBR?                    59800002
         BO    RETURN              RETURN IF YES                        59850002
         LA    R5,ET00D-4          SET UP TO CALL IFCET00D              59900002
         ST    R5,XR9PTR           FOR MDR PROCESSING                   59950002
         B     RETURN                                                   60000002
CCTYPE   STM   R5,R8,XSAVE       SAVE REGISTERS                @ZA35362 60001000
         L     R8,XLABELP        GET ADDR OF LABEL             @ZA35362 60002000
         CLI   0(R4),HEX01        IS IT GENERAL                @ZA35362 60003000
         BNE   CCTYPE0            NO,CONTINUE CHECK            @ZA35362 60004000
         MVC   L0(L12,R8),GEN     SET UP LABEL                 @ZA35362 60005000
         B     RETURN             RETURN                       @ZA35362 60006000
CCTYPE0  CLI   0(R4),HEX02        IS IT MICROFILM              @ZA35362 60007000
         BNE   CCTYPE1            NO,CONTINUE CHECK            @ZA35362 60008000
         MVC   L0(L12,R8),MICRFILM  SET UP LABEL               @ZA35362 60009000
         B     RETURN             RETURN                       @ZA35362 60010000
CCTYPE1  CLI   0(R4),HEX20        IS IT MICR                   @ZA35362 60011000
         BNE   CCTYPE2            NO,CONTINUE CHECK            @ZA35362 60012000
         MVC   L0(L12,R8),MICR    SET UP LABEL                 @ZA35362 60013000
         B     RETURN             RETURN                       @ZA35362 60014000
CCTYPE2  CLI   0(R4),HEX40        IS IT RUN CTL                @ZA35362 60015000
         BNE   CCTYPE3            NO,CONTINUE CHECK            @ZA35362 60016000
         MVC   L0(L12,R8),RUNCTL  SET UP LABEL                 @ZA35362 60017000
         B     RETURN             RETURN                       @ZA35362 60018000
CCTYPE3  CLI   0(R4),HEX08        IS IT INSCRIBER/PRINTER      @ZA35362 60019000
         BNE   CCTYPE4            NO,CONTINUE CHECK            @ZA35362 60020000
         MVC   L0(L12,R8),INSPRT  SET UP LABEL                 @ZA35362 60021000
         B     RETURN             RETURN                       @ZA35362 60022000
CCTYPE4  CLI   0(R4),HEX10        IS IT DIH                    @ZA35362 60023000
         BNE   CCTYPE5            NO,CONTINUE CHECK            @ZA35362 60024000
         MVC   L0(L12,R8),DIH     SET UP LABEL                 @ZA35362 60025000
         B     RETURN             RETURN                       @ZA35362 60026000
CCTYPE5  CLI   0(R4),HEX80        IS IT CHANNEL ADAPT          @ZA35362 60027000
         BNE   CCTYPE6            NO,CONTINUE CHECK            @ZA35362 60028000
         MVC   L0(L12,R8),CHANADPT  SET UP LABEL               @ZA35362 60029000
         B     RETURN             RETURN                       @ZA35362 60030000
CCTYPE6  CLI   0(R4),HEX04        IS IT OCR                    @ZA35362 60031000
         BNE   CCTYPE7            NO,CONTINUE CHECK            @ZA35362 60032000
         MVC   L0(L12,R8),OCR     SET UP LABEL                 @ZA35362 60033000
         B     RETURN             RETURN                       @ZA35362 60034000
CCTYPE7  MVC   L0(L12,R8),UNDEF   SET UP LABEL                 @ZA35362 60035000
         B     RETURN           RETURN                                  60036000
CHKERROR STM   R5,R8,XSAVE                                     @M04AE95 60037000
         L     R8,XLABELP          GET ADDR OF LABEL           @M04AE95 60038000
         TM    0(R4),HEX80         ANY ERRORS                  @M04AE95 60039000
         BZ    NOERROR             NO,BRANCH                   @M04AE95 60040000
         MVC   L0(L13,R8),ERRORMSG YES,PUT ERROR IN LABEL      @M04AE95 60041000
         B     RETURN                                          @M04AE95 60042000
NOERROR  MVC   L0(L13,R8),BLANKS  ZERO LABEL,NO ERROR          @M04AE95 60043000
         B     RETURN                                          @M04AE95 60044000
*                                                                S21021 60050002
RECTYPE  STM   R5,R8,XSAVE                                       S21021 60100002
         LR    R5,R3                    SET UP DATA SLOT FOR TYPES21021 60150002
         LA    R6,L31                                            S21021 60200002
         SR     R5,R6                                            S21021 60250002
         TM    0(R4),HEX20              SHORT RECORD?            S21021 60300002
         BO    RECSHORT                                          S21021 60350002
         MVC   0(L10,R5),UNITCK         INSERT DATA 'UNIT CHECK' S21021 60400002
         B     RETURN                                            S21021 60450002
RECSHORT MVC   0(L10,R5),OVFL           DATA = 'OVERFLOW'        S21021 60500002
         B     RETURN                                            S21021 60550002
STLBLEND DC    F'0'                                              S21088 60600002
WORK     DS    D                                                 S21021 60650002
SAVE2    DS    F                                                 S21021 60700002
OBRAREA  DS    CL104                                             S21021 60750002
BLANKS   DC    CL25' '                                           S21021 60800002
ET00D    DC    X'FE'                                                    60850002
         DC    CL8'IFCET00D'                                            60900002
HW21     DC    H'21'                                             S21021 60950002
HW13     DC    H'13'                                             S21021 61000002
ERRORMSG DC    C'/// ERROR ///'                                @M04AE95 61020000
UNITCK   DC    C'UNIT CHECK'                                     S21021 61050002
OVFL     DC    C'OVERFLOW  '                                     S21021 61100002
SERNO    DC    C'SERIAL NO.'                                     S21021 61150002
MPCPU    DC    C'MULTIPROCESSOR - CPU'                           S21021 61200002
UNIVERS  DC    C'UNIVERSAL   SERIAL NO. NONE  '                  S21021 61250002
JOBID    DC    C'JOB IDENTITY'                                   S21021 61300002
UNDEF    DC    C'UNDEFINED   '                                 @ZA35362 61304000
MICR     DC    C'MICR        '                                 @ZA35362 61308000
RUNCTL   DC    C'RUN CTL     '                                 @ZA35362 61312000
INSPRT   DC    C'INS/PRT     '                                 @ZA35362 61316000
DIH      DC    C'DIH         '                                 @ZA35362 61320000
CHANADPT DC    C'CHAN ADAPT  '                                 @ZA35362 61324000
RECO     DC    C'RECO        '                                 @ZA35362 61328000
MICRFILM DC    C'MICROFILM   '                                 @ZA35362 61332000
GEN      DC    C'GENERAL     '                                 @ZA35362 61336000
OCR      DC    C'OCR         '                                 @ZA35362 61340000
         DS    0F                                                       61350002
XSAVE    DC    5F'0'                                                    61400002
NONE     DC    CL6'NONE  '                                              61450002
CHARS    DC    C'0123456789ABCDEF'                                      61500002
CHAR0    DC    C'0'                                                     61550002
EXTEND   DC    A(EXTSNS-4)                                              62050002
EXTEND1  DC    A(EXTSNS1-1)                                             62100002
FINISH   DC    A(FINIS-4)                                               62150002
FINISH1  DC    A(FINIS1-1)                                              62200002
*                                                                       62250002
HEX0F    EQU   X'0F'                                                    62300002
*                       TABLE CONSTANTS                                 62350002
ENTRIES  DS    0F                                                       62400002
         DC    XL4'00000000'       FORMAT1                              62450002
         DC    XL4'00000000'       FORMAT2                              62500002
         DC    A(LABELS)                LABEL PTR                       62550002
         DC    H'0'                     DISP                            62600002
         LINE                                                           62650002
         ROUTINE CLASS,CKTYPE                                           62700002
         LABEL ''                                                       62750002
         LINE  SKIP=E                                                   62800002
         LABEL ''                                                       62850002
         LINE  (55,22),(1,35),SKIP=1                             S21021 62900000
         ROUTINE  SW2B0,RECTYPE                                  S21021 62950002
         HEX   XMODEL,0,2B                                       S21021 63000002
         HEX   XSER,0,3B                                         S21021 63050002
         ROUTINE XMODEL,SETCPUNO                                 S21021 63100002
         LABEL '---RECORD ENTRY TYPE -','   SOURCE - OUTBOARD',        X63150002
               'MODEL '                                          S21021 63200000
         LINE  (13,1),(4,1)                                      S21021 63240000
         SYSRELN    XRELN,4                                    @D35UGFD 63280000
         LABEL      ''                                         @D35UGFD 63310000
         LINE  (69,1),(31,19)                                    S21021 63400002
         ROUTINE XPGN1,SETPGMN                                   S21021 63450002
         LABEL 'DAY YEAR','HH MM SS.TH'                          S21021 63500002
         LINE  (31,19),(25,19),SKIP=2                                   63550002
         ROUTINE XDATE,SETDATE                                   S21021 63600002
         HEX   XTIME,1,4B                                        S21021 63650002
         ROUTINE  XDUM1,SKIPPER                                  S21021 63700002
         HEX   XPGN1,B6,4B                                       S21021 63750002
         HEX   XPGN2,B16,4B                                      S21021 63800002
         ROUTINE  SW2B0,NONAME                                   S21021 63850002
         LABEL 'DATE ','TIME '                                   S21021 63900000
         LINE  ,(1,1),SKIP=2                                     S21021 63950000
         ROUTINE XDUM1,SETCONV                                   S21021 64000000
         LABEL 'OBR RECORD CONVERTED TO THE STANDARD FORMAT'     S21021 64050000
         LINE  (32,1),(2,41),SKIP=1                            @ZA35369 64100000
         HEX   XCUA2,0,2B                                        S21021 64150000
         ROUTINE XDUM1,SKIPPER                                          64200000
         LABEL 'FAILING CHANNEL/UNIT ADDRESS','DEVICE TYPE  3895'       64250000
         LINE                                                           64450002
         ROUTINE XDUM1,SKIPPER                                          64500002
         LABEL ' '                                               S21021 64550002
         LINE  (1,1),(23,38)                                     S21021 64600002
         ROUTINE XDUM1,SKIPPER                                          64650002
         LABEL 'CC   DA   FL     CT','K    CA   US CS  CT'       S21021 64700000
         LINE  (23,3),(5,46),SKIP=2                              S21021 64730000
         HEX   XFCCWCC,0,1B                                      S21021 64800002
         HEX   XFCCWDA,0,3B                                      S21021 64850002
         ROUTINE  XDUM1,SPACER1                                  S21021 64900002
         HEX   XFCCWFL,0,1B                                      S21021 64950002
         HEX   XZERO,0,1B                                        S21021 65000002
         HEX   XFCCWCT,0,2B                                      S21021 65050002
         ROUTINE  XDUM1,SPACER16                                 S21021 65100002
         HEX   XCSWK,0,1B                                        S21021 65150002
         HEX   XCSWCA,0,3B                                       S21021 65200002
         ROUTINE  XDUM1,SPACER1                                  S21021 65250002
         ROUTINE XCSWATTN,SETHEX                                        65300002
         ROUTINE XCSWPCI,SETHEX                                         65350002
         HEX   XCSWCT,0,2B                                       S21021 65400002
         LABEL 'FAILING CCW','CSW'                               S21021 65450002
         LINE  ,(16,55),SKIP=1                                 @ZA35369 65500000
         ROUTINE XDUM1,SKIPPER                                          65550002
         LABEL '--- UNIT STATUS ---','--- CHANNEL STATUS ---'           65600002
         LINE  (20,28),(3,28),SKIP=1                                    65650002
         BIN   XCSWATTN                                                 65700002
         BIN   XCSWCE                                                   65750002
         BIN   XCSWPCI                                                  65800002
         BIN   XCSWCDC                                                  65850002
         LABEL 'ATTENTION','CHANNEL END','PRGM-CTLD IRPT',             *65900002
               'CHAN DATA CHECK'                                        65950002
         LINE                                                           66000002
         BIN   XCSWSM                                                   66050002
         BIN   XCSWDE                                                   66100002
         BIN   XCSWSILI                                                 66150002
         BIN   XCSWCCC                                                  66200002
         LABEL 'STATUS MODIFIER','DEVICE END','INCORRECT LENGTH',      *66250002
               'CHAN CTL CHECK'                                         66300002
         LINE                                                           66350002
         BIN   XCSWCUE                                                  66400002
         BIN   XCSWUC                                                   66450002
         BIN   XCSWPC                                                   66500002
         BIN   XCSWICC                                                  66550002
         LABEL 'CONTROL UNIT END','UNIT CHECK','PROGRAM CHECK',        *66600002
               'I/F CTL CHECK'                                          66650002
         LINE  ,,SKIP=2                                                 66700002
         BIN   XCSWBSY                                                  66750002
         BIN   XCSWUE                                                   66800002
         BIN   XCSWPCHK                                                 66850002
         BIN   XCSWCH                                                   66900002
         LABEL 'BUSY','UNIT EXCEPTION','PROTECTION CHECK',     @M04AE95*66950002
               'CHAINING CHECK'                                         67000002
*                                                                       67200002
         LINE  (24,1),(1,28),SKIP=2                                     67250002
         ROUTINE    XDUM1,SKIPPER                                       67300002
         LABEL      'SENSE BYTE DATA'                                   67350002
*                                                                       67400002
         LINE  (19,40),(4,41),SKIP=1                           @ZA35369 67450000
         ROUTINE  BASC10,SETHEX                                         67490000
         ROUTINE  BASC20,SETHEX                                         67530000
         LABEL 'BYTE 0','BYTE 1'                               @ZA35367 67570000
         LINE  (20,17),(5,18),SKIP=0                           @ZA35369 67610000
         BIN   BASC10                                          @ZA35369 67650000
         BIN   BASC14                                          @ZA35369 67690000
         LABEL  'COMMAND REJ','DATA CHK'                       @ZA35369 67730000
         LINE  (60,18),(46,18),SKIP=1                          @ZA35369 67770000
         BIN   BASC20                                          @ZA35369 67810000
         BIN   BASC24                                          @ZA35369 67850000
         LABEL 'PREDICTOR REQ','INVALID CMD'                   @ZA35369 67890000
         LINE  (20,17),(5,18),SKIP=0                           @ZA35369 67930000
         BIN   BASC11                                          @ZA35369 67970000
         BIN   BASC15                                          @ZA35369 68010000
         LABEL 'INTRVN REQD','BIT 5'                           @ZA35369 68050000
         LINE  (60,18),(46,18),SKIP=1                          @ZA35369 68090000
         BIN   BASC21                                          @ZA35369 68130000
         BIN   BASC25                                          @ZA35369 68170000
         LABEL 'FEATURE CHK','INCOMP PROC'                     @ZA35369 68210000
         LINE  (20,17),(5,18),SKIP=0                           @ZA35369 68250000
         BIN   BASC12                                          @ZA35369 68290000
         BIN   BASC16                                          @ZA35369 68330000
         LABEL 'BUS OUT CHK','NOT INIT'                        @ZA35369 68370000
         LINE  (60,18),(46,18),SKIP=1                          @ZA35369 68410000
         BIN   BASC22                                          @ZA35369 68450000
         BIN   BASC26                                          @ZA35369 68490000
         LABEL 'FEED CMD REQD','MERGE FEED'                    @ZA35369 68530000
         LINE  (20,17),(5,18),SKIP=0                           @ZA35369 68570000
         BIN   BASC13                                          @ZA35369 68610000
         BIN   BASC17                                          @ZA35369 68650000
         LABEL 'EQUIP CHK','RUNNING'                           @ZA35369 68690000
         LINE  (60,18),(46,18),SKIP=2                          @ZA35369 68730000
         BIN   BASC23                                          @ZA35369 68770000
         BIN   BASC27                                          @ZA35369 68810000
         LABEL 'BIT 3','PROC NOT FUNC'                         @ZA35369 68850000
         LINE                                                           68890000
         ROUTINE BASC13,CHKPROC                                @M04AE95 68930000
         LABEL ' '                                             @M04AE95 68970000
         LINE  (29,9),(1),SKIP=0                               @M04AE95 69010000
         HEX   (SNS11,0,4B)                                    @M04AE95 69315002
         HEX   (SNS21,0,4B)                                    @M04AE95 69320002
         HEX   (SNS31,0,4B)                                    @M04AE95 69325002
         HEX   (SNS41,0,4B)                                    @M04AE95 69330002
         LABEL ' '                                             @ZA35369 69331000
         LINE  (66,9),(1),SKIP=0                               @ZA35369 69332000
         HEX   (SNS51,0,4B)                                    @M04AE95 69335002
         HEX   (SNS61,0,4B)                                    @M04AE95 69340002
         HEX   (SNS71,0,4B)                                    @M04AE95 69345002
         HEX   (SNS81,0,4B)                                    @M04AE95 69350002
         LABEL 'PROCESSOR SENSE BYTE DATA -'                   @M04AE95 69360002
         LINE  ,(103),SKIP=2                                   @ZA24284 69370000
         ROUTINE SNSSTAT0,CHKERROR                             @ZA24284 69377000
         LABEL '             '                                 @ZA24284 69384000
         LINE  (33),(4),SKIP=2                                 @ZA35369 69391000
         HEX   (SNS11,0,3B)                                    @M04AE95 69398000
         LABEL  'CURRENT INSTRUCTION -0,1,2-'                  @ZA35367 69405000
         LINE  (22,18),(4,22),SKIP=0                           @ZA35367 69412000
         ROUTINE SNS040,SETHEX                                 @M04AE95 69419000
         ROUTINE SNS050,SETHEX                                 @M04AE95 69426000
         LABEL 'ERR REG -4-','ERR REG -5-'                     @ZA35369 69433000
         LINE  (62,21),(44,22),SKIP=1                          @ZA35369 69440000
         ROUTINE SNS060,SETHEX                                 @M04AE95 69447000
         ROUTINE SNS070,SETHEX                                 @M04AE95 69454000
         LABEL 'CTL LATCHES -6-','CTL LATCHES -7-'             @ZA35367 69461000
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69480002
         BIN   SNS040                                          @M04AE95 69490002
         BIN   SNS050                                          @M04AE95 69500002
         LABEL 'PROG SET HARD ERR','A-PRTY CHK'                @M04AE95 69510002
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 69520002
         BIN   SNS060                                          @M04AE95 69530002
         BIN   SNS070                                          @M04AE95 69540002
         LABEL 'WAIT STATE','DELAYED STOP'                     @M04AE95 69550002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69560002
         BIN   SNS041                                          @M04AE95 69570002
         BIN   SNS051                                          @M04AE95 69580002
         LABEL 'CS DATA CHK','B-PRTY CHK'                      @M04AE95 69590002
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 69600002
         BIN   SNS061                                          @M04AE95 69610002
         BIN   SNS071                                          @M04AE95 69620002
         LABEL 'PRIORITY RUN MODE','BUSY'                      @M04AE95 69630002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69640002
         BIN   SNS042                                          @M04AE95 69650002
         BIN   SNS052                                          @M04AE95 69660002
         LABEL 'CS ADDR CHK','SCAN BUFR CHK'                   @M04AE95 69670002
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 69680002
         BIN   SNS062                                          @M04AE95 69690002
         BIN   SNS072                                          @M04AE95 69700002
         LABEL 'INTRPT RUN MODE','RUN'                         @M04AE95 69710002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69720002
         BIN   SNS043                                          @M04AE95 69730002
         BIN   SNS053                                          @M04AE95 69740002
         LABEL 'CYCLE CTL CHK','CHAN TIME-OUT'                          69750000
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 69760002
         BIN   SNS063                                          @M04AE95 69770002
         BIN   SNS073                                          @M04AE95 69780002
         LABEL 'INTRPT LATCH','BIT 3'                          @M04AE95 69790002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69800002
         BIN   SNS044                                          @M04AE95 69810002
         BIN   SNS054                                          @M04AE95 69820002
         LABEL 'BIT 4','BIT 4'                                 @M04AE95 69830000
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 69840002
         BIN   SNS064                                          @M04AE95 69850002
         BIN   SNS074                                          @M04AE95 69860002
         LABEL 'BIT 4','REGS FULL'                             @M04AE95 69870002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69880002
         BIN   SNS045                                          @M04AE95 69890002
         BIN   SNS055                                          @M04AE95 69900002
         LABEL 'BIT 5','BIT 5'                                 @M04AE95 69910000
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 69920002
         BIN   SNS065                                          @M04AE95 69930002
         BIN   SNS075                                          @M04AE95 69940002
         LABEL 'BIT 5','PRE-FETCH INHBT'                       @M04AE95 69950002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69960002
         BIN   SNS046                                          @M04AE95 69970002
         BIN   SNS056                                          @M04AE95 69980002
         LABEL 'BIT 6','BIT 6'                                 @M04AE95 69990000
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 70000002
         BIN   SNS066                                          @M04AE95 70010002
         BIN   SNS076                                          @M04AE95 70020002
         LABEL 'BIT 6','FETCH 1'                               @M04AE95 70030002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 70040002
         BIN   SNS047                                          @M04AE95 70050002
         BIN   SNS057                                          @M04AE95 70060002
         LABEL 'BIT 7','BIT 7'                                 @M04AE95 70070000
         LINE  (63,21),(45,22),SKIP=2                          @M04AE95 70080002
         BIN   SNS067                                          @M04AE95 70090002
         BIN   SNS077                                          @M04AE95 70100002
         LABEL 'BIT 7','USE 1'                                 @M04AE95 70110002
         LINE  (31),(4),SKIP=1                                 @ZA35369 70120000
         HEX   (SNS41,0,2B)                                    @M04AE95 70130000
         LABEL 'C-ADDRESS COUNTER -12,13-'                     @ZA35367 70140000
         LINE  (20,29),(4,26),SKIP=1                           @ZA35367 70150000
         HEX   (SNS42,0,2B)                                    @M04AE95 70160000
         HEX   (SNS51,0,2B)                                    @M04AE95 70170000
         LABEL 'CSAR 1 -14,15-','BAL REG 1 -16,17-'            @ZA35367 70180000
         LINE  (20,29),(4,26),SKIP=2                           @ZA35367 70190000
         HEX   (SNS52,0,2B)                                    @M04AE95 70200000
         HEX   (SNS61,0,2B)                                    @M04AE95 70210000
         LABEL 'CSAR 2 -18,19-','BAL REG 2 -20,21-'            @ZA35367 70220000
         LINE  ,(4,28),SKIP=1                                  @ZA35367 70230000
         LABEL 'PRIORITY -    REQ REG -8-',                    @ZA35367*70240000
               'MASK REG -9-   REG 1 -10-    REG 2 -11-'       @ZA35367 70250000
         LINE  (23,14),(5),SKIP=1                              @ZA35367 70260000
         BIN   SNS080                                          @M04AE95 70350002
         BIN   SNS090                                          @M04AE95 70370002
         BIN   SNS100                                          @M04AE95 70400002
         BIN   SNS110                                          @M04AE95 70410002
         LABEL 'MACH CHK'                                      @M04AE95 70420002
         LINE  (23,14),(5),SKIP=1                              @ZA35369 70450000
         BIN   SNS081                                          @M04AE95 70470002
         BIN   SNS091                                          @M04AE95 70500002
         BIN   SNS101                                          @M04AE95 70510002
         BIN   SNS111                                          @M04AE95 70520002
         LABEL 'TIMER'                                         @M04AE95 70550002
         LINE  (23,14),(5),SKIP=1                              @ZA35369 70570000
         BIN   SNS082                                          @M04AE95 70600002
         BIN   SNS092                                          @M04AE95 70610002
         BIN   SNS102                                          @M04AE95 70620002
         BIN   SNS112                                          @M04AE95 70650002
         LABEL 'MICR'                                          @M04AE95 70670002
         LINE  (23,14),(5),SKIP=1                              @ZA35369 70700000
         BIN   SNS083                                          @M04AE95 70710002
         BIN   SNS093                                          @M04AE95 70720002
         BIN   SNS103                                          @M04AE95 70750002
         BIN   SNS113                                          @M04AE95 70770002
         LABEL 'CHAN ADAPT'                                    @M04AE95 70800002
         LINE  (23,14),(5),SKIP=1                              @ZA35369 70810000
         BIN   SNS084                                          @M04AE95 70820002
         BIN   SNS094                                          @M04AE95 70850002
         BIN   SNS104                                          @M04AE95 70870002
         BIN   SNS114                                          @M04AE95 70900002
         LABEL 'CE PANEL'                                      @M04AE95 70910002
         LINE  (23,14),(5),SKIP=1                              @ZA35369 70920000
         BIN   SNS085                                          @M04AE95 70950002
         BIN   SNS095                                          @M04AE95 70970002
         BIN   SNS105                                          @M04AE95 71000002
         BIN   SNS115                                          @M04AE95 71010002
         LABEL 'DIH'                                           @M04AE95 71020002
         LINE  (23,14),(5),SKIP=1                              @ZA35369 71050000
         BIN   SNS086                                          @M04AE95 71070002
         BIN   SNS096                                          @M04AE95 71100002
         BIN   SNS106                                          @M04AE95 71110002
         BIN   SNS116                                          @M04AE95 71120002
         LABEL 'TRANSPORT'                                     @M04AE95 71150002
         LINE  (23,14),(5),SKIP=1                              @ZA35369 71170000
         BIN   SNS087                                          @M04AE95 71200002
         BIN   SNS097                                          @M04AE95 71210002
         BIN   SNS107                                          @M04AE95 71220002
         BIN   SNS117                                          @M04AE95 71250002
         LABEL 'OCR'                                           @M04AE95 71270002
FINIS    LINE  ,,SKIP=1                                                 71350002
         ROUTINE XDUM1,SKIPPER                                          71400002
FINIS1   LABEL ''                                                       71450002
         DC    X'FF'                                                    71500002
         DC    X'006E'                                         @M04AE95 71550002
         DC    X'0018'                                                  71600002
         DC    X'0000'                                                  71650002
*                                                                       71700002
EXTSNS   LINE  (28,9),(1),SKIP=0                               @M04AE95 71750000
         HEX   (SNS11,0,4B)                                    @M04AE95 71757002
         HEX   (SNS21,0,4B)                                    @M04AE95 71764002
         HEX   (SNS31,0,4B)                                    @M04AE95 71771002
         HEX   (SNS41,0,4B)                                    @M04AE95 71778002
         HEX   (SNS51,0,4B)                                    @M04AE95 71785002
         HEX   (SNS61,0,4B)                                    @M04AE95 71792002
         HEX   (SNS71,0,4B)                                    @M04AE95 71800002
         HEX   (SNS81,0,4B)                                    @M04AE95 71810002
EXTSNS1  LABEL 'EXTENDED SENSE BYTE DATA - '                   @M04AE95 71820000
         LINE  ,(103),SKIP=2                                   @ZA24284 71840000
         ROUTINE SNSSTAT0,CHKERROR                             @ZA24284 71860000
         LABEL '             '                                 @ZA24284 71880000
         LINE  (18,20),(2,20),SKIP=1                           @ZA35369 71900000
         ROUTINE   SNS000,SETHEX                                        71950002
         ROUTINE   SNS010,SETHEX                                        72000002
         ROUTINE   SNS020,SETHEX                                        72050002
         ROUTINE   SNS030,SETHEX                                        72100002
         ROUTINE   SNS040,SETHEX                                        72150002
         ROUTINE   SNS050,SETHEX                                        72200002
         LABEL 'INS/PRT -0-','MICR 1 -1-','DIH -2-',           @ZA35367*72250000
               'VIDEO -3-','RUN CTL -4-','RECO -5-'            @ZA35367 72260000
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 72300002
         BIN   SNS000                                                   72400002
         BIN   SNS010                                                   72450002
         BIN   SNS020                                                   72500002
         BIN   SNS030                                                   72550002
         BIN   SNS040                                                   72600002
         BIN   SNS050                                                   72650002
         LABEL 'CTL ERR','BIT 0','M-BUFR PRTY CHK',            @M04AE95*72700002
               'BEAM NOT MVNG','ENDORSER CHK','MCS PRTY CHK'   @M04AE95 72720002
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 72750002
         BIN   SNS001                                                   72850002
         BIN   SNS011                                                   72900002
         BIN   SNS021                                                   72950002
         BIN   SNS031                                                   73000002
         BIN   SNS041                                                   73050002
         BIN   SNS051                                                   73100002
         LABEL 'PRT COIL ERR','BUFR PRTY CHK',                 @M04AE95*73150002
               'CMP ST PRTY CHK','RTS, NO TRACE','BIT 1',      @M04AE95*73160000
               'MCS HANG CHK'                                  @M04AE95 73170002
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 73200002
         BIN   SNS002                                                   73300002
         BIN   SNS012                                                   73350002
         BIN   SNS022                                                   73400002
         BIN   SNS032                                                   73450002
         BIN   SNS042                                                   73500002
         BIN   SNS052                                                   73550002
         LABEL 'INS COIL ERR','BIT 2','M-BUFR ADDR CHK',       @M04AE95*73600002
               'WINDOW OVRSCN','BIT 2','INVLD OP CODE'         @M04AE95 73620002
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 73650002
         BIN   SNS003                                                   73750002
         BIN   SNS013                                                   73800002
         BIN   SNS023                                                   73850002
         BIN   SNS033                                                   73900002
         BIN   SNS043                                                   73950002
         BIN   SNS053                                                   74000002
         LABEL 'BUFR PRTY CHK','BIT 3','CMP ST ADDR CHK',      @M04AE95*74050000
               'ROTATION ERR','BIT 3','VIS ADDR CHK'           @M04AE95 74070002
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 74100002
         BIN   SNS004                                                   74200002
         BIN   SNS014                                                   74250002
         BIN   SNS024                                                   74300002
         BIN   SNS034                                                   74350002
         BIN   SNS044                                                   74400002
         BIN   SNS054                                                   74450002
         LABEL 'BUFR ADDR CHK','BUFR CHR OVRN','PROG CHK',     @M04AE95*74500002
               'READ DATA CHK','BIT 4','BIT 4'                 @M04AE95 74520000
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 74550002
         BIN   SNS005                                                   74650002
         BIN   SNS015                                                   74700002
         BIN   SNS025                                                   74750002
         BIN   SNS035                                                   74800002
         BIN   SNS045                                                   74850002
         BIN   SNS055                                                   74900002
         LABEL 'BIT 5','BIT 5','TIME-OUT ERR',                 @M04AE95*74950000
               'WRITE DATA CHK','BIT 5','BIT 5'                @M04AE95 74960002
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 74970002
         BIN   SNS006                                                   75050002
         BIN   SNS016                                                   75100002
         BIN   SNS026                                                   75150002
         BIN   SNS036                                                   75200002
         BIN   SNS046                                                   75250002
         BIN   SNS056                                                   75300002
         LABEL 'BIT 6','BIT 6','DCS SPEC ERR','LOW CRT PMT I',         *75350000
               'BIT 6','BIT 6'                                 @ZA35365 75360000
         LINE  (19,20),(3,20),SKIP=2                           @M04AE95 75400002
         BIN   SNS007                                                   75450002
         BIN   SNS017                                                   75500002
         BIN   SNS027                                                   75550002
         BIN   SNS037                                                   75600002
         BIN   SNS047                                                   75650002
         BIN   SNS057                                                   75700002
         LABEL 'BIT 7','BIT 7','BIT 7','LOW DOC PMT I','BIT 7','BIT 7'  75750000
         LINE  (23,91),(2,94),SKIP=0                           @ZA35369 75751000
         ROUTINE SNS170,SETHEX                                 @ZA35369 75752000
         HEX   (SNS22,0,3B)                                    @ZA35369 75753000
         LABEL 'CC ADDRESS REG -17-','MCS DATA -6,7,8-'        @ZA35367 75754000
         LINE  ,(28),SKIP=1                                    @ZA35367 75755000
         ROUTINE SNS170,CCTYPE                                 @ZA35367 75756000
         LABEL '            '                                  @ZA35367 75757000
         LINE  (22,94),(2,94),SKIP=0                           @ZA35369 75758000
         HEX   (SNS61,0,2B)                                    @M04AE95 75759000
         HEX   (SNSMCS,0,2B)                                   @M04AE95 75760000
         LABEL 'ERROR CODE -20,21-','MCS ADDRESS -9,10-'       @ZA35362 75761000
         LINE  ,(28),SKIP=2                                    @ZA35367 75762000
         ROUTINE SNS200,CCTYPE                                 @ZA35367 75763000
         LABEL '            '                                  @ZA35367 75764000
         LINE  (22,24),(2,24),SKIP=1                           @ZA35367 75765000
         ROUTINE SNS160,SETHEX                                 @M04AE95 75766000
         ROUTINE SNS180,SETHEX                                 @M04AE95 75767000
         ROUTINE SNS190,SETHEX                                 @M04AE95 75768000
         ROUTINE SNS220,SETHEX                                 @ZA35369 75769000
         ROUTINE SNS230,SETHEX                                 @ZA35369 75770000
         LABEL 'CC ERR REG -16-','UNIT STAT REG -18-',         @ZA35367*75771000
               'CC STAT REG -19-',                             @ZA35367*75772000
               'MICROFILM -22-','OCR PROC -23-'                @ZA35367 75773000
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75782002
         BIN   SNS160                                          @M04AE95 75784002
         BIN   SNS180                                          @M04AE95 75786002
         BIN   SNS190                                          @M04AE95 75788002
         BIN   SNS220                                          @ZA35369 75790000
         BIN   SNS230                                          @ZA35369 75790800
         LABEL 'BIT 0','BIT 0','ANY CHAN CHK','LAMP CHK FRT',  @ZA35369*75791600
               'A-PRTY CHK'                                    @ZA35369 75792400
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75794002
         BIN   SNS161                                          @M04AE95 75796002
         BIN   SNS181                                          @M04AE95 75798002
         BIN   SNS191                                          @M04AE95 75800002
         BIN   SNS221                                          @ZA35369 75802000
         BIN   SNS231                                          @ZA35369 75802800
         LABEL 'BIT 1','BIT 1','UNIT RESP TAG','LAMP CHK RR',  @ZA35369*75803600
               'B-PRTY CHK'                                    @ZA35369 75804400
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75806002
         BIN   SNS162                                          @M04AE95 75808002
         BIN   SNS182                                          @M04AE95 75810002
         BIN   SNS192                                          @M04AE95 75812002
         BIN   SNS222                                          @ZA35369 75814000
         BIN   SNS232                                          @ZA35369 75814800
         LABEL 'NON-SELECT CHK','BIT 2','ACTIVE','CAPSTAN CHK',        *75815600
               'FE ADDR CHK'                                   @ZA35369 75816400
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75818002
         BIN   SNS163                                          @M04AE95 75820002
         BIN   SNS183                                          @M04AE95 75822002
         BIN   SNS193                                          @M04AE95 75824002
         BIN   SNS223                                          @ZA35369 75826000
         BIN   SNS233                                          @ZA35369 75826800
         LABEL 'GET DATA CHK','BIT 3','GET DATA TAG',          @ZA35369*75827600
               'SHUTTER CHK','VB ADDR CHK'                     @ZA35369 75828400
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75830002
         BIN   SNS164                                          @M04AE95 75832002
         BIN   SNS184                                          @M04AE95 75834002
         BIN   SNS194                                          @M04AE95 75836002
         BIN   SNS224                                          @ZA35369 75838000
         BIN   SNS234                                          @ZA35369 75839000
         LABEL 'PUT DATA CHK','UNIT SELECTED','PUT DATA TAG',  @ZA35369*75840000
               'BIT 4','FB PRTY CHK'                           @ZA35367 75841000
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75844002
         BIN   SNS165                                          @M04AE95 75846002
         BIN   SNS185                                          @M04AE95 75848002
         BIN   SNS195                                          @M04AE95 75850002
         BIN   SNS225                                          @ZA35369 75853000
         BIN   SNS235                                          @ZA35369 75854000
         LABEL 'TAG CHK','PREDICTOR DATA','SET TAG','BIT 5',   @ZA35367*75855000
               'VB PRTY CHK'                                   @ZA35369 75856000
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75859002
         BIN   SNS166                                          @M04AE95 75862002
         BIN   SNS186                                          @M04AE95 75865002
         BIN   SNS196                                          @M04AE95 75868002
         BIN   SNS226                                          @ZA35369 75871000
         BIN   SNS236                                          @ZA35369 75872000
         LABEL 'SELECT CHK','UNIT ERR','CHAN BUSY','BIT 6',    @ZA35367*75873000
               'CHAN TIME-OUT'                                 @ZA35367 75874000
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75877002
         BIN   SNS167                                          @M04AE95 75880002
         BIN   SNS187                                          @M04AE95 75883002
         BIN   SNS197                                          @M04AE95 75886002
         BIN   SNS227                                          @ZA35369 75889000
         BIN   SNS237                                          @ZA35369 75890000
         LABEL 'ADDR CHK','BIT 7','BURST MODE','BIT 7','BIT 7' @ZA35367 75891000
         LINE  ,(1,1)                                          @M04AE95 75895002
         LABEL ''                                                       75900002
         DC    X'FF'                                                    75950002
         DC    X'006E'                                         @M04AE95 76000002
         DC    X'0018'                                                  76050002
         DC    X'0000'                                                  76100002
LABELS   DS    0F                                                       76150002
         LSTART                                                         76200002
         END                                                            76250002
