         TITLE 'IFCEXXX7 - EDIT TABLE - LINKNAME=IFCE1015,ALIASES=IFCE3X00080002
               277,IFCE3284,IFCE3286,IFCE2245'                          00160002
         SPACE 2                                                        00240002
         GBLC  &DSECT,&CSECT                                            39120002
IFCEXXX7 CSECT                                                          39200002
&DSECT   SETC  'XXX7'                                                   39280002
&CSECT   SETC  'IFCEXXX7'                                               39360002
*                                                                       39440002
*              EDIT TABLE FOR OBR REC                                   39520002
*                                                                       39600002
*                                                                       39680002
XXX7     DSECT                                                          39760002
*                                                                       39840002
         DSGEN (XDUM1,8),(XRELN,8),(XDUM2,8),                    S21021X39920002
               (SW2B0,1),(SW2B1,1),(SW2B2,1),(SW2B3,1),          S21021X40000002
               (SW2B4,1),(SW2B5,1),(SW2B6,1),(SW2B7,1)           S21021 40080002
         DSGEN (XDUM3,32)                         SPARES                40160002
         DSGEN (XDATE,32)                         DATE                  40240002
         DSGEN (XTIME,32)                         TIME                  40320002
         DSGEN (XDUM4,8),(XSER,24)           SERIAL NO                  40400002
         DSGEN (XMODEL,16),(XDUM5,16)        MODEL NUMBER & MCLEN       40480002
         DSGEN (XPGN1,32)                    PROGRAM                    40560002
         DSGEN (XPGN2,32)                            NAME               40640002
         DSGEN (XFCCWCC,8),(XFCCWDA,24)  FAILING CCW                    40720002
         DSGEN (XFCCWFL,8),(XZERO,8),(XFCCWCT,16)    CCW                40800002
         DSGEN (XCSWK,8),(XCSWCA,24)         CHAN  STATUS               40880002
         DSGEN (XCSWATTN,1),(XCSWSM,1),(XCSWCUE,1),      WORD  CSW     C40960002
               (XCSWBSY,1),(XCSWCE,1),(XCSWDE,1),(XCSWUC,1),(XCSWUE,1),C41040002
               (XCSWPCI,1),(XCSWSILI,1),(XCSWPC,1),(XCSWPCHK,1),       C41120002
               (XCSWCDC,1),(XCSWCCC,1),(XCSWICC,1),(XCSWCH,1),         C41200002
               (XCSWCT,16)                                              41280002
         DSGEN (XDUMA,8),(XCUA2,24)                              S21021 41360002
         DSGEN (XDEVT1,16),(XDEVT2,16)       DEVICE TYPE                41440002
         DSGEN (XDUM6,8),(XCUA,24)           DUMMY AND CUA              41520002
         DSGEN (XDUM7,16),(XDUM8,16)         RTRY AND SPARE             41600002
         DSGEN (XDUM9,32)                    VOLUME                     41680002
         DSGEN (XDUM10,32)                          SER                 41760002
         DSGEN (XDUM11,32)                   LAST                       41840002
         DSGEN (XDUM12,32)                        SEEK                  41920002
         DSGEN (XDUM13,32)                   HOME                       42000002
         DSGEN (XDUM14,32)                        ADDRESS               42080002
         DSGEN (SDR1,8),(SDR2,8),(SDR3,8),(SDR4,8),(SDR5,8),     S21021X42160002
               (SDR6,8),(SDR7,8),(SDR8,8)                        S21021 42240002
         DSGEN (SDR9,8),(SDRA,8),(XB0CMDR,1),(XB0BIT1,1),        S21021C42320002
               (XB0BUSC,1),(XB0ECHK,1),(XB0DCHK,1),                    C42400002
               (XB0TIMEO,1),(XB0OFLO,1),(XB0CRT,1),                    C42480002
               (XDUM18,8)                                               42560002
         DSGEN (XDUM19,32)                                              42640002
EXPNOBR  DSECT                                                   S21021 42720002
EXPNHDRA DS CL52                                                 S21021 42800002
EXPNDEVA DS CL36                                                 S21021 42880002
EXPNSDRA DS CL10                                                 S21021 42960002
EXPNSNSA DS CL6                                                  S21021 43040002
*                                                                S21021 43120002
NORMOBR DSECT                                                    S21021 43200002
NORMHDRA DS CL64                                                 S21021 43280002
NORMSDRA DS CL10                                                 S21021 43360002
NORMSNSA DS CL6                                                  S21021 43440002
*                                                                S21021 43520002
SHRTOBR DSECT                                                    S21021 43600002
SHRTHDRA DS CL24                                                 S21021 43680002
SHRTDEVA DS CL8                                                  S21021 43760002
SHRTSDRA DS CL10                                                 S21021 43840002
*                                                                S21021 43920002
*                                                                       44000002
*        END OF DSECT    104 BYTES TOTAL                                44080002
*                                                                       44160002
IFCEXXX7 CSECT                                                          44240002
         USING *,R9                                                     44320002
R0       EQU   0                                                        44400002
R1       EQU   1                                                        44480002
R2       EQU   2                                                        44560002
R3       EQU   3                                                        44640002
R4       EQU   4                                                        44720002
R5       EQU   5                                                        44800002
R6       EQU   6                                                        44880002
R7       EQU   7                                                        44960002
R8       EQU   8                                                        45040002
R9       EQU   9                                                        45120002
R10      EQU   10                                                       45200002
R11      EQU   11                                                       45280002
R12      EQU   12                                                       45360002
R13      EQU   13                                                       45440002
R14      EQU   14                                                       45520002
R15      EQU   15                                                       45600002
L0       EQU   0                                                        45680002
L1       EQU   1                                                        45760002
L2       EQU   2                                                        45840002
L3       EQU   3                                                        45920002
L4       EQU   4                                                        46000002
L5       EQU   5                                                        46080002
L6       EQU   6                                                        46160002
L7       EQU   7                                                        46240002
L8       EQU   8                                                        46320002
L9       EQU   9                                                        46400002
L10      EQU   10                                                       46480002
L11      EQU   11                                                       46560002
L12      EQU   12                                                       46640002
L13      EQU   13                                                       46720002
L14      EQU   14                                                       46800002
L15      EQU   15                                                       46880002
L16      EQU   16                                                       46960002
L17      EQU   17                                                       47040002
L18      EQU   18                                                       47120002
L19      EQU   19                                                       47200002
L20      EQU   20                                                       47280002
L21      EQU   21                                                S21021 47360002
L24      EQU   24                                                       47440002
L28      EQU   28                                                       47520002
L29      EQU   29                                                S21021 47600002
L31      EQU   31                                                S21021 47680002
L34      EQU   34                                                S21021 47760002
L36      EQU   36                                                S21021 47840002
L44      EQU   44                                                S21021 47920002
L46      EQU   46                                                S21021 48000002
L64      EQU   64                                                S21021 48080002
L104     EQU   104                                               S21021 48160002
L120     EQU   120                                               S21021 48240002
DMP76    EQU   76                       DUMP LENGTH FOR NORMAL OBR      48320002
DMP104   EQU   104                      DUMP LENGTH CONVERTED           48400002
HEX08    EQU   X'08'                                             S21021 48480002
HEX10    EQU   X'10'                                             S21021 48560002
HEX20    EQU   X'20'                                             S21021 48640002
XFF      EQU   X'FF'                                             S21021 48720002
EQ       EQU   8                                                 S21021 48800002
A        EQU   C'A'                                              S21021 48880002
B        EQU   C'B'                                              S21021 48960002
         USING XXX7,R2                                           S21021 49040002
*                                                                       49120002
         DC    A(ENTRIES)               PTR TO EDIT ENTRIES             49200002
         DC    CL8'IFCEXXX7'                                            49280002
XR9PTR   DC    F'0'                     PNTR TO NEXT EDIT-4      S21021 49360002
XLABELP  DC    F'0'                                                     49440002
*        SPECIAL ROUTINE SECTION                                        49520002
*                                                                       49600002
SKIPPER  BR    R14                      NOOP RTRN                       49680002
*                                                                       49760002
*                                                                       49840002
SPACER1  LA    R3,L1(R3)                SPACE ONE BLANK          S21021 49920002
         BR    R14                      RETURN                          50000002
*                                                                       50080002
*                                                                       50160002
*        SET BINARY                                                     50240002
*              R4 HAS PTR TO CHAR                                       50320002
*                                                                       50400002
SETBIN   STM   R5,R8,XSAVE              SAVE REGS                       50480002
         IC    R7,L0(R4)                PICK UP CHAR TO PRINT           50560002
         SLL   R7,L24                   MOVE IT TO HI OF R7             50640002
         LR    R8,R3                    PRINT POS POINTER               50720002
         LA    R5,L8                    LOOP COUNT                      50800002
SETBINA  SR      R6,R6   CLEAR REG SIX                                  50880002
         SLDL  R6,L1                                                    50960002
         STC   R6,L0(R8)                PUT IT INTO PTINT LINE          51040002
         MVZ   L0(L1,R8),CHAR0          MOVE ON PRORPER ZONE            51120002
         LA    R8,L1(R8)                BUMP POINTER TO NEXT POS        51200002
         BCT   R5,SETBINA               LOOP TILL 8 PRINTED             51280002
         B     RETURN                   RETURN                          51360002
*                                                                       51440002
*                                                                       51520002
*        SET PROGRAM NAME  R4 POINTS TO NAME FIELD                      51600002
*                                                                       51680002
SETPGMN  DS    0H                                                S21021 51760002
         TM    SW2B0,HEX20              SHORT RECORD             S21021 51840002
         BCR   1,R14                    YES, NO JOB ID           S21021 51920002
         MVC   0(L12,R3),JOBID          MOVE IN LABEL            S21021 52000002
         MVC   L13(L8,R3),XPGN1         MOVE IN NAME             S21021 52080002
         BR    R14                                               S21021 52160002
NONAME   TM    L0(R4),HEX20             SHORT RECORD?            S21021 52240002
         BCR   14,R14                   NO, LET HEX JOBNAME PRNT S21021 52320002
         ST    R5,XSAVE                 SAVE REG                 S21021 52400002
         LA    R5,L44                   BACK UP BUFFER PNTR      S21021 52480002
         SR    R3,R5                                             S21021 52560002
         MVC   0(L17,R3),BLANKS         CLEAR OUT HEX JOBNAME    S21021 52640002
         L     R5,XSAVE                 RESTORE REG              S21021 52720002
         BR    R14                                               S21021 52800002
*                                                                       52880002
*                                                                       52960002
*                                                                       53040002
SETCONV  TM    L0(R4),HEX02             HAS RECORD BEEN CONVERTED KEY32 53120002
         BCR   ON,R14                   YES RETURN                      53200002
         SR    R15,R15                  NO CLEAR R15 FOR NO PRINT OF    53280002
         BR    R14                      LINE BR-14                      53360002
ON       EQU   1                                                        53440002
HEX02    EQU   X'02'                                                    53520002
*                                                                       53600002
*                             CHECK ON CPU AND SERIAL NO                53680002
SETCPUNO STM   R5,R8,XSAVE                                              53760002
         SR    R5,R5               CLEAR R5                             53840002
         IC    R5,L0(R4)           PICK UP MODEL NO                     53920002
         SLL   R5,L8               IN TO                                54000002
         IC    R5,L1(R4)           R5                                   54080002
         LTR   R5,R5                    TEST FOR ZERO MODEL      S21021 54160002
         LR    R5,R3                    POINT TO DATA FIELD      S21021 54240002
         BNZ   SETSER                   BRANCH IF MODEL NOT 0    S21021 54320002
         LA    R6,L46                   BACK UP TO SAY 'NONE'    S21021 54400002
         SR    R5,R6                    BACKUP BUFFER            S21021 54480002
         MVC   L0(L29,R5),UNIVERS       SAY NONE, MODEL UNIVERSALS21021 54560002
         B     RETURN                   RETURN  CONTROL                 54640002
SETSER   LA    R6,L36                   SET UP TO ADD 'SERIAL NO.S21021 54720002
         SR    R5,R6                                             S21021 54800002
         MVC   0(L10,R5),SERNO                                   S21021 54880002
         B     RETURN                                            S21021 54960002
*                                                                       55040002
*        SET DATE                                                       55120002
*                                                                       55200002
SETDATE  CLC   L1(L3,R4),ZERO           IS DATE ZERO                    55280002
         BE    SETDTE                   BR-YES                          55360002
         UNPK  XSAVE(L8),L1(L3,R4)      UNPACK DATE                     55440002
         MVC  L5(L2,R3),XSAVE+L3  MOVE YEAR                             55520002
         MVC   L0(L3,R3),XSAVE+L5       MOVE DAY                        55600002
         BR    R14                      RETURN                          55680002
SETDTE   MVC   L0(L4,R3),NONE           SET DATE TO NONE                55760002
         BR    R14                                                      55840002
ZERO     DC    XL4'00'                                                  55920002
*                                                                       56000002
SETHEX   STM   R5,R8,XSAVE              SAVE REGS                       56080002
         LA    R8,CHARS                 CHAR TABLE ADRR                 56160002
         IC    R7,L0(R4)                 PICK UP BYTE FROM REC          56240002
         SLL   R7,L24                   SHIFT TI TO HI BYTE             56320002
         SR    R6,R6                                                    56400002
         SLDL  R6,L4                    MOVE FOUR BITS TO R6            56480002
         AR    R6,R8                    COMPUTE OFFSET                  56560002
         MVC   L0(L1,R3),L0(R6)         MOVE CHAR TO BUFFER             56640002
         SR    R6,R6                                                    56720002
         SLDL  R6,L4                    MOVE FOUR BITS TO R6            56800002
         AR    R6,R8                    COMPUTE OFFSET                  56880002
         MVC   L1(L1,R3),L0(R6)         MOVE CHAR TO BUFFER             56960002
         B     RETURN                                                   57040002
RETURN   LM    R5,R8,XSAVE              RESET REGS                      57120002
         BR    R14                                                      57200002
SPACER16 LA    R3,L16(R3)                                        S21021 57280002
         BR    R14                                               S21021 57360002
SDRCONVL STM   R5,R8,XSAVE              SAVE REGS                S21021 57440002
         SR    R6,R6                    CLEAR REG                S21021 57520002
         IC    R6,L0(R4)                PICK UP COUNTER IN QUEST S21021 57600002
         SRL   R6,L4                    DROP OFF 4 LOW BITS      S21021 57680002
         B     SDRCONVT                                          S21021 57760002
SDRCONVR STM   R5,R8,XSAVE              SAVE REGS                S21021 57840002
         IC    R6,L0(R4)                PICK UP CHAR             S21021 57920002
         SLL   R6,L28                                            S21021 58000002
         SRL   R6,L28                   DROP OFF HI ORDER BITS   S21021 58080002
SDRCONVT CVD   R6,WORK                  CONVERT IT               S21021 58160002
         UNPK  L0(L3,R3),WORK+L5(L3)    TO DECIMAL               S21021 58240002
         MVZ   L2(L1,R3),L0(R3)         PUT ON ZONE              S21021 58320002
         B     RETURN                                            S21021 58400002
*                                                                S21021 58480002
RESETR2  L     R2,SAVE2                 PICK UP SAVED REC POINTERS21021 58560002
         BR    R14                                               S21021 58640002
*                                                                S21021 58720002
TESTMP   TM    L0(R4),HEX10             IS IT A MP RECODR        S21021 58800002
         BZ    NOMP                                              S21021 58880002
         MVC   0(L20,R3),MPCPU          SHOW MULTIPROC           S21021 58960002
         TM    L0(R4),HEX08             IS IT CPUA / CPUB        S21021 59040002
         BO    MPB                      BR IT IS B               S21021 59120002
         MVI   L21(R3),A                MOVE 'A' TO PRINT LINE   S21021 59200002
NOMP     BR    R14                                               S21021 59280002
MPB      MVI   L21(R3),B                MOVE 'B' TO PRINT LINE   S21021 59360002
         BR    R14                                               S21021 59440002
NOPRT    SR    R15,R15                  STOP PRINTING            S21021 59520002
         BR    R14                                               S21021 59600002
*                                                                S21021 61120002
TESTSHRT TM    SW2B0,HEX20              IS IT A SHORT REC        S21021 61200002
         BZ    SKIPPER                  BR-NO                    S21021 61280002
         BCTR  R3,R0                    BACKUP ONE DATA SPACE    S21021 61360002
         MVC   0(L6,R3),BLANKS          CLEAR OUT HEX 2NDARY CUA S21021 61440002
         MVC   XR9PTR(L8),SHRTADCN      MOVE IN NEW A POINTERS   S21021 61520002
         BR    R14                                               S21021 61600002
*                                                                S21021 61680002
EXPNDRTN STM   R5,R8,XSAVE                                       S21021 61760002
         ST    R2,SAVE2                 SAVE R2 FOR LATER        S21021 61840002
         LA    R5,OBRAREA               PICK UP EXPANDED AREA    S21021 61920002
         USING EXPNOBR,R5                                        S21021 62000002
         USING NORMOBR,R4                                        S21021 62080002
         XC    EXPNOBR(L104),EXPNOBR    CLEAR AREA               S21021 62160002
         TM    SW2B0,HEX20              IS IT A SHORT REC        S21021 62240002
         BO    MOVESHRT                 BR-YES                   S21021 62320002
         TM    XDUM1,HEX02              IS IT A CONVERTED REC    S21021 62400002
         BO    MOVEALL                                           S21021 62480002
         MVC   EXPNHDRA(L64),NORMHDRA   EXPAND RECORD TO CONVERTES21021 62560002
         MVC   EXPNSDRA(L10),NORMSDRA                            S21021 62640002
         MVC   EXPNSNSA(L6),NORMSNSA                             S21021 62720002
         MVI   DMPSIZE+L1,DMP76         DUMP 76 BYTES                   62800002
EXPNDRET LR    R2,R5                    SWAP POINTERS            S21021 62880002
         B     RETURN                                            S21021 62960002
MOVEALL  MVC   EXPNOBR(L104),NORMOBR    MOVE ENTIRE RECORD       S21021 63040002
         MVI   DMPSIZE+L1,DMP104        DUMP 104 BYTES                  63120002
         B     EXPNDRET                                          S21021 63200002
         USING SHRTOBR,R4                                        S21021 63280002
MOVESHRT MVC   EXPNHDRA(L24),SHRTHDRA   MOVE HEADER              S21021 63360002
         MVC   EXPNDEVA(L8),SHRTDEVA                             S21021 63440002
         MVC   EXPNSDRA(L10),SHRTSDRA                            S21021 63520002
         B     EXPNDRET                                          S21021 63600002
         DROP  R4,R5                                             S21021 63680002
*                                                                S21021 63760002
RECTYPE  STM   R5,R8,XSAVE                                       S21021 63840002
         LR    R5,R3                    SET UP DATA SLOT FOR TYPES21021 63920002
         LA    R6,L31                                            S21021 64000002
         SR     R5,R6                                            S21021 64080002
         TM    0(R4),HEX20              SHORT RECORD?            S21021 64160002
         BO    RECSHORT                                          S21021 64240002
         MVC   0(L10,R5),UNITCK         INSERT DATA 'UNIT CHECK' S21021 64320002
         B     RETURN                                            S21021 64400002
RECSHORT MVC   0(L10,R5),OVFL           DATA = 'OVERFLOW'        S21021 64480002
         B     RETURN                                            S21021 64560002
SETDEVTY STM   R5,R8,XSAVE                                       S21003 64640002
         LA    R5,L9               NUMBER OF DEVICES                    64720045
         LA    R7,DEVTLIST              LIST OF TYPES            S21003 64800002
DEVTLOOP CLC   0(L2,R4),0(R7)           IS THIS TYPE             S21003 64880002
         BE    DEVTFND                  YES, GO SET TYPE FIELD   S21003 64960002
         LA    R7,L6(R7)                ELSE, BUMP               S21003 65040002
         BCT   R5,DEVTLOOP              TRY NEXT TILL COUNT      S21003 65120002
         MVC   0(L4,R3),NONE            TELL 'NONE'              S21003 65200002
         B     RETURN                                            S21003 65280002
DEVTFND  MVC   0(L4,R3),L2(R7)          TELL DEVICE TYPE         S21003 65360002
         B     RETURN                                            S21003 65440002
SETSENSE CLC   0(L2,R4),TYPE1015        IS THIS 1015?            S21003 65520002
         BCR   EQ,R14                   YES, SENSE LABELS OK     S21003 65600002
         ST    R5,XSAVE                 SAVE REG                 S21003 65680002
         CLC   0(L2,R4),TYPE2245        IS THIS 2245?            S21092 65760002
         BE    SET2245                                           S21092 65840002
         LA    R5,SENS3270              POINT TO 3270 LABELS     S21003 65920002
RETSENS  DS    0H                                                S21003 66000002
         ST    R5,XLABELP               SET FOR EREP             S21003 66080002
         L     R5,XSAVE                 RESTORE REG              S21003 66160002
         BR    R14                      RETURN                   S21003 66240002
SET2245  LA    R5,C2245LAB              GET 2245 LABELS          S21092 66320002
         B     RETSENS                                           S21092 66400002
SETSTLBL DS    0H                       SET LABELS FOR STAT COUNTS21003 66480002
         STM   R5,R8,XSAVE              SAVE REGS                S21003 66560002
         LA    R6,L2                    SET BCT COUNT            S21003 66640002
         L     R5,XLABELP               GET CURRENT LABEL PNTR   S21003 66720002
         LA    R7,L5                    NUMBER OF LABEL LISTS    S21003 66800002
         LA    R8,STLBLIST              POINT TO FIRST LABEL ENTRS21021 66880002
STLBCOMP CLC   XDEVT2(L2),0(R8)         IS THIS THE DEVICE TYPE? S21003 66960002
         BE    STLBLTFD                 YES, GO MOVE LABELS      S21021 67040002
         LA    R8,L18(R8)          NO, BUMP POINTER              S21021 67120002
         BCT   R7,STLBCOMP              REPEAT NUMBER OF LISTS   S21021 67200002
         LA    R8,STLBDFLT              NOT FOUND, USE DEFAULT   S21021 67280002
STLBLTFD DS    0H                  LABELS FOUND                  S21003 67360002
         LA    R8,L2(R8)                USE LABELS               S21021 67440002
         LA    R7,L16(R8)               DETERMINE END POINT      S21021 67520002
         ST    R7,STLBLEND              SAVE FOR COMPARE         S21021 67600002
STLABLP  DS    0H                                                S21003 67680002
         LA    R6,L2                    RESET BCT                S21021 67760002
         TM    SW2B0,HEX20              IS THIS A SHORT RECORD   S21021 67840002
         BO    STLBSHRT                 YES, NO UNIT STATUS      S21021 67920002
         LA    R5,L34(R5)               SKIP UNIT STATUS LABELS  S21021 68000002
STLBSHRT DS    0H                                                S21021 68080002
         CLI   0(R8),XFF                IS THIS 'NOT USED'       S21021 68160002
         BE    STLBLNUS                 YES, LABEL = 'NOT USED'  S21021 68240002
         SR    R7,R7                    CLEAR R7                 S21021 68320002
         IC    R7,0(R8)                 GET INDEX TO LABEL       S21021 68400002
         MH    R7,HW13                  MULTIPLY TO GET LABEL    S21021 68480002
         A     R7,SLTABAD               PT TO LABEL IN TABLE     S21021 68560002
         MVC   L0(L13,R5),L0(R7)        MOVE IN LABEL            S21021 68640002
         B     STLBL001                                          S21021 68720002
STLBLNUS DS    0H                                                S21003 68800002
         MVC   L0(L13,R5),STLBNTUS      'NOT USED' LABEL         S21021 68880002
STLBL001 DS    0H                                                S21003 68960002
         LA    R5,L14(R5)               BUMP R5                  S21021 69040002
         LA    R8,L1(R8)                POINT TO NEXT INDEX      S21021 69120002
         BCT   R6,STLBSHRT              DO AGAIN                 S21021 69200002
         C     R8,STLBLEND              AT END OF LIST?          S21021 69280002
         BNE   STLABLP                  NO, CONTINUE             S21021 69360002
         B     RETURN                                            S21021 69440002
*                                                                S21021 69520002
SLTABAD  DC    A(SLTABL)                                         S21021 69600002
SLTABL   DS    0C                                                S21003 69680002
         DC    C'TEMPY READS  '         00                       S21021 69760002
         DC    C'TEMPY WRITES '         01                       S21021 69840002
         DC    C'INTRVN REQD  '         02                       S21021 69920002
         DC    C'BUS OUT CHK  '         03                       S21021 70000002
         DC    C'EQUIP CHK    '         04                       S21021 70080002
         DC    C'OVERRUN      '         05                       S21021 70160002
         DC    C'OVERFLOW     '         06                       S21021 70240002
         DC    C'CRT PROTECT  '         07                       S21021 70320002
         DC    C'CHAN DATA CHK'         08                       S21021 70400002
         DC    C'DATA CHECK   '         09                       S21003 70480002
         DC    C'CNTRL CHECK  '         0A                       S21021 70560002
         DC    C'DC,OC        '         0B                              70640002
         DC    C'DC,US        '         0C                       S21021 70720002
         DC    C'IR,US        '         0D                       S21021 70800002
         DC    C'IR,EC,US     '         0E                       S21021 70880002
         DC    C'EC,US        '         0F                       S21021 70960002
         DC    C'LOAD CHECK   '         10                       S21092 71040002
         DC    C'CMND RETRY   '         11                       S21092 71120002
         DC    C'PRINT CHECK  '         12                       S21092 71200002
         DC    C'PRINT QUALITY'         13                       S21092 71280002
         DC    C'LINE POSITION'         14                       S21092 71360002
         DC    C'CMND SUPPRESS'         15                       S21092 71440002
         DC    C'BUFF PTY CHK '         16                       S21092 71520002
         DC    C'CC,OC        '         17                              71520102
DEVTLIST DC    X'1001'                                           S21021 71600002
         DC        C'1015'                                       S21021 71680002
         DC    X'1009'                                           S21003 71760002
         DC        C'3277'                                       S21003 71840002
         DC    X'100A'                                           S21003 71920002
         DC        C'3284'                                       S21003 72000002
         DC    X'100B'                                           S21003 72080002
         DC        C'3286'                                       S21003 72160002
TYPE2245 DC    X'080B'                  DEVICE TYPE FOR 2245     S21092 72240002
         DC        C'2245'                                       S21092 72320002
         DC    X'100C'                                        YA01491   72340002
         DC       C'3158'                                               72360002
         DC    X'100D'                                                  72370045
         DC    C'3036'                                                  72380045
         DC    X'100E',C'3138'                                          72386045
         DC    X'100F',C'3148'                                          72392045
STLBNTUS DC    C'NOT USED     '                                  S21003 72400002
STLBLIST DS    0C                                                S21003 72480002
         DC    X'080B'                  2245                     S21092 72560002
         DC    X'0001FF03041610FF11121314FF15FF08'               S21092 72640002
         DC    X'1001'                  1015                     S21003 72720002
         DC    X'0001020304050607FFFFFFFFFFFFFF08'               S21003 72800002
         DC    X'1009'                  3277                     S21003 72880002
         DC    X'0001020304FF0AFFFFFFFF0C0D0E0F08'      XA01892/YA01526 72960002
         DC    X'100A'                  3284                     S21003 73040002
         DC    X'0001020304FF0AFFFFFFFF0C0D0E0F08'      XA01892/YA01526 73120002
STLBDFLT DS    0C                                                S21021 73200002
         DC    X'100B'                  3286                     S21003 73280002
         DC    X'0001020304FF0AFFFFFFFF0C0D0E0F08'      XA01892/YA01526 73360002
STLBTABL DS    0C                                                S21021 73440002
TYPE1015 DC    X'1001'                                           S21021 73520002
SENS3270 DC    C'INTVN REQ$'                                     S21003 73600002
         DC    C'BUS O CHK$'                                     S21021 73680002
         DC    C'EQUIP CHK$'                                     S21021 73760002
         DC    C'DATA CHK$'                                      S21021 73840002
         DC    C'UNIT SPCFY$'                                    S21021 73920002
         DC    C'CNTRL CHK$'                                     S21021 74000002
         DC    C'OPRTN CHK$'                                     S21021 74080002
         DC    C'$$$'                                            S21021 74160002
C2245LAB DC    CL10'INTV REQD$'                                         74240002
         DC    CL10'BUS O CHK$'                                  S21021 74320002
         DC    CL10'EQUIP CHK$'                                  S21021 74400002
         DC    CL10'DATA CHK $'                                  S21021 74480002
         DC    CL10'CC BFR CK$'                                  S21021 74560002
         DC    CL10'LOAD CHK $'                                  S21021 74640002
         DC    CL10'CHAN 9   $'                                  S21021 74720002
         DC    C'$$'                                                    74800002
STLBLEND DC    F'0'                                                     74880002
WORK     DS    D                                                        74960002
SAVE2    DS    F                                                 S21021 75040002
SHRTADCN DC    A(SHRTOBRS-L4)                                    S21021 75120002
         DC    A(SHRTOBRL)                                       S21021 75200002
OBRAREA  DS    CL104                                             S21021 75280002
BLANKS   DC    CL25' '                                           S21021 75360002
HW21     DC    H'21'                                             S21021 75440002
HW13     DC    H'13'                                             S21021 75520002
UNITCK   DC    C'UNIT CHECK'                                     S21021 75600002
OVFL     DC    C'OVERFLOW  '                                     S21021 75680002
SERNO    DC    C'SERIAL NO.'                                     S21021 75760002
MPCPU    DC    C'MULTIPROCESSOR - CPU'                           S21021 75840002
UNIVERS  DC    C'UNIVERSAL   SERIAL NO. NONE  '                  S21021 75920002
JOBID    DC    C'JOB IDENTITY'                                   S21021 76000002
*                                                                       76080002
HEX03    EQU   X'03'                                                    76160002
HEX18    EQU   X'18'                                                    76240002
         DS    0F                                                       76320002
XSAVE    DC    5F'0'                                                    76400002
NONE     DC    CL6'NONE  '                                              76480002
CHARS    DC    C'0123456789ABCDEF'                                      76560002
CHAR0    DC    C'0'                                                     76640002
*                                                                       76720002
*                       TABLE CONSTANTS                                 77280002
ENTRIES  DS    0F                                                       77360002
         DC    XL4'00010001'            FORMAT1                         77440002
         DC    XL4'00010001'            FORMAT2                         77520002
         DC    A(LABELS)                LABEL PTR                       77600002
         DC    H'0'                     DISP                            77680002
*                                                                       77760002
*        SKIP TO CHANNEL 1                                              77840002
*                                                                       77920002
         DC    X'02'                                             S21021 78000002
         DC         X'000B8B00'                                         78080002
         DC    AL.12(XDUM1-XXX7),XL.4'D'    = ROUTINE XDUM1,     S21021 78160002
         DC    AL.4(0),AL.12(EXPNDRTN-IFCEXXX7)   EXPNDRTN       S21021 78240002
*                                                                       78320002
*                                                                       78400002
         LINE  (55,23),(1,35),SKIP=1                             S21021 78480002
         ROUTINE  SW2B0,RECTYPE                                  S21021 78560002
         HEX   XMODEL,0,2B                                       S21021 78640002
         HEX   XSER,0,3B                                         S21021 78720002
         ROUTINE XMODEL,SETCPUNO                                 S21021 78800002
         LABEL '---RECORD ENTRY TYPE -','   SOURCE - OUTBOARD',  S21021X78880002
               'MODEL-'                                          S21021 78960002
         LINE  (16,1),(4,1)                                      S21021 79040002
         SYSRELN    XRELN,4                                    @D35UGFD 79120000
         LABEL      ''                                         @D35UGFD 79160000
         LINE  (69,1),(31,19)                                    S21021 79280002
         ROUTINE XPGN1,SETPGMN                                   S21021 79360002
         LABEL 'DAY YEAR','HH MM SS.TH'                          S21021 79440002
         LINE  (31,19),(25,19)                                   S21021 79520002
         ROUTINE XDATE,SETDATE                                   S21021 79600002
         HEX   XTIME,1,4B                                        S21021 79680002
         ROUTINE  XDUM1,SKIPPER                                  S21021 79760002
         HEX   XPGN1,B6,4B                                       S21021 79840002
         HEX   XPGN2,B16,4B                                      S21021 79920002
         ROUTINE  SW2B0,NONAME                                   S21021 80000002
         LABEL 'DATE-','TIME-'                                   S21021 80080002
         LINE  (1,1),(1,1)                                       S21021 80160002
         ROUTINE SW2B0,TESTMP                                    S21021 80240002
         LABEL ''                                                S21021 80320002
         LINE  ,(1,1),SKIP=2                                     S21021 80400002
         ROUTINE XDUM1,SETCONV                                   S21021 80480002
         LABEL 'OBR RECORD CONVERTED TO THE STANDARD FORMAT'     S21021 80560002
         LINE  (34,1),(2,32),SKIP=1                              S21021 80640002
         ROUTINE  XDEVT2,SETDEVTY                                S21021 80720002
         LABEL 'DEVICE TYPE'                                     S21021 80800002
         LINE                                                           80880000
         HEX   XCUA,B0,3B                                        S21021 80930000
         LABEL 'PRIMARY   CHANNEL UNIT ADDRESS  '                S21021 80980000
         LINE                                                           81030000
         HEX   XCUA2,B0,3B                                       S21021 81080000
         ROUTINE  XDUM1,TESTSHRT                                 S21021 81130000
         LABEL 'ALTERNATE CHANNEL UNIT ADDRESS  '                S21021 81180000
         LINE                                                           81230000
         LABEL ' '                                               S21021 81520002
         LINE  (1,1),(23,38)                                     S21021 81600002
         LABEL 'CC   CA   FL     CT','K    CA   US CS  CT'       S21021 81680002
         LINE  (23,3),(5,51),SKIP=2                              S21021 81760002
         HEX   XFCCWCC,0,1B                                      S21021 81840002
         HEX   XFCCWDA,0,3B                                      S21021 81920002
         ROUTINE  XDUM1,SPACER1                                  S21021 82000002
         HEX   XFCCWFL,0,1B                                      S21021 82080002
         HEX   XZERO,0,1B                                        S21021 82160002
         HEX   XFCCWCT,0,2B                                      S21021 82240002
         ROUTINE  XDUM1,SPACER16                                 S21021 82320002
         HEX   XCSWK,0,1B                                        S21021 82400002
         HEX   XCSWCA,0,3B                                       S21021 82480002
         ROUTINE  XDUM1,SPACER1                                  S21021 82560002
         ROUTINE XCSWATTN,SETHEX                                 S21021 82640002
         ROUTINE XCSWPCI,SETHEX                                  S21021 82720002
         HEX   XCSWCT,0,2B                                       S21021 82800002
         LABEL 'FAILING CCW','CSW'                               S21021 82880002
*                                                                       82960002
         LINE  ,(5,28)                                           S21021 83040002
         ROUTINE    XDUM1,SKIPPER                                       83120002
         LABEL 'UNIT STATUS','CHANNEL STATUS',                   S21021X83200002
               'STATISTICAL DATA','STATISTICAL DATA'             S21021 83280002
*                                                                       83360002
*                     CSW DETAIL  OF US & CS FIELDS                     83440002
*                                                                       83520002
         LINE  (20,28),(3,28),SKIP=1                             S21021 83600002
         BIN        XCSWATTN                                            83680002
         BIN        XCSWPCI                                             83760002
         ROUTINE    SDR1,SDRCONVL                                S21021 83840002
         ROUTINE    SDR1,SDRCONVR                                S21021 83920002
         ROUTINE  XDUM1,SETSTLBL                                 S21003 84000002
         LABEL 'ATTENTION       ','PRGM-CTLD TRPT  ',            S21021X84080002
               '             ','             '                   S21021 84160002
         LINE                                                           84240002
         BIN        XCSWSM                                              84320002
         BIN        XCSWSILI                                            84400002
         ROUTINE    SDR2,SDRCONVL                                S21021 84480002
         ROUTINE    SDR2,SDRCONVR                                S21021 84560002
         LABEL 'STATUS MODIFIER ','INCORRECT LENGTH',            S21021X84640002
               '             ','             '                   S21021 84720002
         LINE                                                           84800002
         BIN        XCSWCUE                                             84880002
         BIN        XCSWPC                                              84960002
         ROUTINE    SDR3,SDRCONVL                                S21021 85040002
         ROUTINE SDR3,SDRCONVR                                   S21021 85120002
         LABEL 'CONTROL UNIT END','PROGRAM CHECK   ',            S21021X85200002
               '             ','             '                   S21021 85280002
         LINE                                                           85360002
         BIN        XCSWBSY                                             85440002
         BIN        XCSWPCHK                                            85520002
         ROUTINE SDR4,SDRCONVL                                   S21021 85600002
         ROUTINE SDR4,SDRCONVR                                   S21021 85680002
         LABEL 'BUSY            ','PROTECTION CHECK',            S21021X85760002
               '             ','             '                   S21021 85840002
         LINE                                                           85920002
         BIN        XCSWCE                                              86000002
         BIN        XCSWCDC                                             86080002
         ROUTINE SDR5,SDRCONVL                                   S21021 86160002
         ROUTINE SDR5,SDRCONVR                                   S21021 86240002
         LABEL 'CHANNEL END     ','CHAN DATA CHECK ',            S21021X86320002
               '             ','             '                   S21021 86400002
         LINE                                                           86480002
         BIN        XCSWDE                                              86560002
         BIN        XCSWCCC                                             86640002
         ROUTINE SDR6,SDRCONVL                                   S21021 86720002
         ROUTINE SDR6,SDRCONVR                                   S21021 86800002
         LABEL 'DEVICE END      ','CHAN CTL CHECK  ',            S21021X86880002
               '             ','             '                   S21021 86960002
         LINE                                                           87040002
         BIN        XCSWUC                                              87120002
         BIN        XCSWICC                                             87200002
         ROUTINE SDR7,SDRCONVL                                   S21021 87280002
         ROUTINE SDR7,SDRCONVR                                   S21021 87360002
         LABEL 'UNIT CHECK      ','I/F CTL CHECK   ',            S21021X87440002
               '             ','             '                   S21021 87520002
         LINE       ,,SKIP=2                                            87600002
         BIN        XCSWUE                                              87680002
         BIN        XCSWCH                                              87760002
         ROUTINE SDR8,SDRCONVL                                   S21021 87840002
         ROUTINE SDR8,SDRCONVR                                   S21021 87920002
         LABEL 'UNIT EXCEPTION  ','CHAINING CHECK  ',            S21021X88000002
               '             ','             '                   S21021 88080002
*                                                                       88160002
         LINE  ,,SKIP=2                                          S21021 88240002
         ROUTINE    XDUM1,SKIPPER                                       88320002
         LABEL      'SENSE BYTE DATA'                                   88400002
*                                                                       88480002
         LINE  (11,19),(1,19),SKIP=2                             S21021 88560002
         ROUTINE  XB0CMDR,SETHEX                                 S21021 88640002
         LABEL      'BYTE 0'                                            88720002
*                                       STATUS BYTE                     88800002
         LINE  ,,SKIP=1                                          S21021 88880002
         BIN        XB0CMDR                                             88960002
         LABEL      'CMND REJ'                                          89040002
         LINE                                                           89120002
         BIN        XB0BIT1                                             89200002
         ROUTINE  XDEVT2,SETSENSE                                S21003 89280002
         LABEL      'BIT 1 '                                            89360002
         LINE                                                           89440002
         BIN        XB0BUSC                                             89520002
         LABEL      'BUS O CHK'                                         89600002
         LINE                                                           89680002
         BIN        XB0ECHK                                             89760002
         LABEL      'EQUIP CHK'                                         89840002
         LINE                                                           89920002
         BIN        XB0DCHK                                             90000002
         LABEL      'DATA CHK'                                          90080002
         LINE                                                           90160002
         BIN        XB0TIMEO                                            90240002
         LABEL      'TIME OUT'                                          90320002
         LINE                                                           90400002
         BIN        XB0OFLO                                             90480002
         LABEL      'OVERFLOW'                                          90560002
         LINE  ,,SKIP=2                                          S21021 90640002
         BIN        XB0CRT                                              90720002
         ROUTINE    XDUM1,RESETR2                                S21021 90800002
         LABEL      'CRT PROTC'                                         90880002
         LINE  ,,SKIP=1                                          S21021 90960002
         LABEL ''                                                S21021 91040002
         DC    X'FF'                    END OF TABLE                    91120002
DMPSIZE  DC    XL2'0000'                SIZE TO DUMP, VARIES            91200002
         DC    XL2'0018'                                                91280002
         DC    XL2'0018'                                                91360002
SHRTOBRL LABEL      ''                                           S21021 91440002
SHRTOBRS LINE  ,(1,1),SKIP=2                                     S21021 91520002
         ROUTINE    XDUM1,SKIPPER                                S21021 91600002
         LABEL      'STATISTICAL DATA'                           S21021 91680002
*                                                                S21021 91760002
         LINE       (21,30),(1,30),SKIP=1                        S21021 91840002
         ROUTINE    SDR1,SDRCONVL                                S21021 91920002
         ROUTINE    SDR1,SDRCONVR                                S21021 92000002
         ROUTINE  XDUM1,SETSTLBL                                 S21021 92080002
         LABEL '             ','             '                   S21021 92160002
*                                                                S21021 92240002
         LINE                                                           92320000
         ROUTINE    SDR2,SDRCONVL                                S21021 92370000
         ROUTINE    SDR2,SDRCONVR                                S21021 92420000
         LABEL '             ','             '                   S21021 92470000
         LINE                                                           92520000
         ROUTINE    SDR3,SDRCONVL                                S21021 92570000
         ROUTINE SDR3,SDRCONVR                                   S21021 92620000
         LABEL '             ','             '                   S21021 92670000
         LINE                                                           92720000
*                                                                S21021 93040002
         ROUTINE SDR4,SDRCONVL                                   S21021 93120002
         ROUTINE SDR4,SDRCONVR                                   S21021 93200002
         LABEL '             ','             '                   S21021 93280002
         LINE                                                           93360000
         ROUTINE SDR5,SDRCONVL                                   S21021 93410000
         ROUTINE SDR5,SDRCONVR                                   S21021 93460000
         LABEL '             ','             '                   S21021 93510000
         LINE                                                           93560000
         ROUTINE SDR6,SDRCONVL                                   S21021 93610000
         ROUTINE SDR6,SDRCONVR                                   S21021 93660000
         LABEL '             ','             '                   S21021 93710000
         LINE                                                           93760000
         ROUTINE SDR7,SDRCONVL                                   S21021 93810000
         ROUTINE SDR7,SDRCONVR                                   S21021 93860000
         LABEL '             ','             '                   S21021 93910000
         LINE                                                           93960000
         ROUTINE SDR8,SDRCONVL                                   S21021 94010000
         ROUTINE SDR8,SDRCONVR                                   S21021 94060000
         LABEL '             ','             '                   S21021 94110000
         LINE                                                           94160000
         ROUTINE    XDUM1,RESETR2                                S21021 94720002
         LABEL      ''                                           S21021 94800002
*                                                                S21021 94880002
         DC         X'FF'                                        S21021 94960002
         DC    X'002A'                                                  95040002
         DC         X'0018'                                      S21021 95120002
         DC         X'0018'                                      S21021 95200002
*                                                                S21021 95280002
LABELS   DS    0F                                                       95360002
         DC    C'$'                                                     95440002
         LSTART                                                         95520002
         END                                                            95600002
