       TITLE   'IFCS0165 MODEL 165/168 CPU SUMMARY TABLE'               00060002
*  DSGEN MACRO     DSGEN MACRO     DSGEN MACRO     DSGEN MACRO        * 00120002
         SPACE 2                                                        00180002
         MACRO                                                          00240002
&NAME    DSGEN                                                          00300002
.*                            THIS MACRO GENERATES ONE DSECT WORD       00360002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 00420002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  00480002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    00540002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 00600002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   00660002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 00720002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      00780002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  00840002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    00900002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   00960002
         GBLC &ITEM(2000)                                               01020002
         GBLA &ITEMNBR,&BITS(2000),&SHIFT(2000)                         01080002
         LCLB  &ONLY1,&CTIND                                            01140002
         LCLA  &START1,&START2,&END1,&END2                              01200002
         LCLC  &SYMBOL,&EQUSYM                                          01260002
         LCLA  &OP,&COUNT,&BYTE,&EQUCNT                                 01320002
         ACTR  100000                                                   01380002
.START   AIF   (N'&SYSLIST(&OP+1) LT 3).LOOP                            01440002
         AIF   ('&SYSLIST(&OP+1,3)' EQ 'EQU').LOOP     TEST FOR EQU     01500002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' OR '&SYSLIST(&OP+1,4)' EQ '').ERR1   01560002
         AIF   ('&SYSLIST(&OP+1,3)' GT '&SYSLIST(&OP+1,4)').ERR3        01620002
&START1  SETA  &SYSLIST(&OP+1,3)        GET START COUNT OF 1            01680002
&START2  SETA  &SYSLIST(&OP+1,4)        GET FIRST END COUNT             01740002
         AGO   .SET2A                   BRANCH AROUND                   01800002
.ERR1    MNOTE '**FIRST SYMBOL CONCATENATION INCOMPLETE**'              01860002
         MEXIT                                                          01920002
.SET2A   AIF   ('&SYSLIST(&OP+1,5)' EQ ''AND '&SYSLIST(&OP+1,6)' EQ '' X01980002
               ).SET2                   TEST FOR NO SECOND              02040002
  AIF   ('&SYSLIST(&OP+1,5)' EQ '' OR '&SYSLIST(&OP+1,6)' EQ '').ERR2   02100002
         AIF   ('&SYSLIST(&OP+1,5)' GT '&SYSLIST(&OP+1,6)').ERR3        02160002
&END1    SETA  &SYSLIST(&OP+1,5)        GET START COUNT OF 2            02220002
&END2    SETA  &SYSLIST(&OP+1,6)        GET END COUNT OF 2              02280002
         AGO   .LOOP                                                    02340002
.SET2    ANOP                                                           02400002
&ONLY1   SETB  1                        INDICATE ONLY ONE CONCATENATION 02460002
         AGO   .LOOP                                                    02520002
.ERR2    MNOTE '**SECOND SYMBOL CONCATENATION INCOMPLETE**'             02580002
         MEXIT                                                          02640002
.ERR3    MNOTE '**START GREATER THAN END CONCATENATION**'               02700002
         MEXIT                                                          02760002
.LOOP    ANOP                                                           02820002
&OP      SETA  &OP+1                                                    02880002
         AIF   (&OP GT N'&SYSLIST).DONE      TEST IF ALL DONE           02940002
&ITEMNBR SETA  &ITEMNBR+1                                               03000002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            03060002
         MNOTE '**NULL BIT COUNT FIELD**'                               03120002
         MEXIT                                                          03180002
.OK1     ANOP                                                           03240002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        03300002
         AIF   ('&SYMBOL' NE '').OK                                     03360002
*              *****     LOG ITEM SYMBOL NOT PROVIDED     *****         03420002
         AIF   ('&SYSLIST(&OP,3)' NE 'EQU').CNT                         03480002
         AGO   .START                   GET NEXT                        03540002
.OK      AIF   (N'&SYSLIST(&OP) LT 3).NO3    TEST FOR OLD FORMAT        03600002
         AIF   ('&SYSLIST(&OP,3)' EQ 'EQU').EQU   TEST FOR EQU          03660002
         AIF   (&ONLY1).OK2             TEST FOR ONLY ONE CONCAT        03720002
&SYMBOL  SETC  '&SYMBOL.&START1.&END1'       GET 1 AND 2 CONCAT         03780002
         AGO   .NO3                     BRANCH AROUND                   03840002
.OK2     ANOP                                                           03900002
&SYMBOL  SETC  '&SYMBOL.&START1'        GET 1 CONCATENATED              03960002
.NO3     ANOP                                                           04020002
&SYMBOL  EQU   *+&BYTE                                                  04080002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL IN GLOBAL             04140002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    04200002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    04260002
.CNT     ANOP                                                           04320002
&CTIND   SETB  1                        SET COUNT INDICATOR             04380002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   04440002
&BYTE    SETA  &COUNT/8                                                 04500002
         AIF   (N'&SYSLIST(&OP) LT 3).START  TEST FOR OLD FORMAT        04560002
         AIF   (&ONLY1).TSTST           TEST FOR ONLY ONE CONCAT        04620002
         AIF   (&END1 EQ &END2).TSTST   TEST FOR SECOND END             04680002
&END1    SETA  &END1+1                  INCREMENT COUNT                 04740002
&OP      SETA  &OP-1                    DECREMENT INCREMENT             04800002
         AGO   .LOOP                    GENERATE NEXT                   04860002
.TSTST   ANOP                                                           04920002
         AIF   (&START1 EQ &START2).LPDONE   TEST FOR END               04980002
         AIF   (&ONLY1).NSET1           TEST FOR ONLY ONE CONCAT        05040002
&END1    SETA  &SYSLIST(&OP,5)          RE-INIT SECOND START COUNT      05100002
.NSET1   ANOP                                                           05160002
&OP      SETA  &OP-1                    DECREMENT INDEX                 05220002
&START1  SETA  &START1+1                INCREMENT FIRST COUNT           05280002
         AGO   .LOOP                    GO DO NEXT                      05340002
.LPDONE  ANOP                                                           05400002
&ONLY1   SETB  0                        CLEAR INDICATOR                 05460002
         AGO   .START                   GO TEST FOR MORE SUB-LISTS      05520002
.DONE    AIF   (&COUNT-&COUNT/8*8 NE 0).ERR  TEST FOR MULTIPLE OF EIGHT 05580002
         AIF   (&CTIND EQ 0).END        NO DS IF NO COUNT               05640002
&COUNT   SETA  &COUNT/8                 GET NUMBER OF BYTES             05700002
&NAME    DS    &COUNT.C                                                 05760002
.END     MEXIT                                                          05820002
.ERR     MNOTE '**BIT COUNT FLDS DO NOT TOTAL MULTIPLE OF 8**'          05880002
         MEXIT                                                          05940002
.EQU     AIF   ('&SYSLIST(&OP,4)' NE '').EQU1     TEST FOR NULL LABEL   06000002
.ERR4    MNOTE '**EQU OPERAND OMITTED OR NOT FOUND**'                   06060002
         MEXIT                                                          06120002
.EQU1    AIF   (&SYSLIST(&OP,2) LT 16).EQU2  COUNT OVER FIFTEEN         06180002
*****               THE FOLLOWING STATEMENT                *****        06240002
*****     NUMBER OF BITS EXCEED 15 - DO NOT USE AS BIN     *****        06300002
.EQU2    ANOP                                                           06360002
&EQUCNT  SETA  0                        CLEAR COUNTER                   06420002
&EQUSYM  SETC  '&SYSLIST(&OP,4)'        GET EQU OPERAND                 06480002
.EQULOP  ANOP                                                           06540002
&EQUCNT  SETA  &EQUCNT+1                INCREMENT INDEX                 06600002
         AIF   ('&ITEM(&EQUCNT)' EQ '&EQUSYM').EQUOUT  LABEL FOUND?     06660002
         AIF   (&EQUCNT EQ &ITEMNBR).ERR4    ALL TESTED?                06720002
         AGO   .EQULOP                  NO-GET NEXT                     06780002
.EQUOUT  ANOP                                                           06840002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL NAME                  06900002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)    GET NUMBER OF BITS              06960002
&SHIFT(&ITEMNBR) SETA &SHIFT(&EQUCNT)   GET SHIFT COUNT                 07020002
&SYMBOL  EQU   &EQUSYM                  THIS SYMBOL EQUATED             07080002
         AGO   .START                   RETURN FOR NEXT                 07140002
         MEND                                                           07200002
         MACRO                                                          07260002
         LINEND                                                         07320002
.*                            THIS MACRO IS USED ONLY BY THE LINE       07380002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   07440002
.*                                 ASSOCIATED WITH EACH LINE.           07500002
         GBLA  &NRENTS                                                  07560002
         GBLC &NRENTSX                                                  07620002
         AIF   (&NRENTS EQ 0).NORENTS   TEST FOR NO COUNT               07680002
         ORG   &NRENTSX                                                 07740002
         DC    FL1'&NRENTS'                                             07800002
         ORG                                                            07860002
&NRENTS  SETA  0                                                        07920002
.NORENTS ANOP                                                           07980002
B&SYSNDX EQU   *                                                        08040002
&NRENTSX SETC  'B&SYSNDX'                                               08100002
         MEND                                                           08160002
*                                                                       08220002
         MACRO                                                          08280002
         BIN                                                            08340002
.*                                 &SYSLIST(&OP,1) - NAME OF LOG ITEM   08400002
.*                                      RECORD DSECT                    08460002
.*                                 $SYSLIST(&OP,2) - NBR OF SPACES      08520002
.*                                      TO SKIP ON MULTIPLE             08580002
.*                                      PRINT OR NBR OF SPACES          08640002
.*                                      TO BACK UP FROM COLUMN FOR      08700002
.*                                      START OF PRINTING. THE LETTER   08760002
.*                                      B PRECEEDS THE NUMBER (B5) IF   08820002
.*                                      THE LATTER IS DESIRED. OMISSION 08880002
.*                                      OF THIS OPERAND FORCES OPTION 2 08940002
.*                                      WITH BACKUP SPACING EQUAL TO    09000002
.*                                 THE NUMBER OF BITS IN THE ITEM       09060002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      09120002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     09180002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       09240002
         GBLA  &INITIAL                                                 09300002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               09360002
         GBLC &ITEM(2000)                                               09420002
         GBLA &ITEMNBR,&BITS(2000),&SHIFT(2000),&NRENTS                 09480002
         GBLC  &DSECT                                                   09540002
         LCLB  &B,&SUB                                                  09600002
         LCLA  &IBITS,&NDX,&ISHIFT,&K                                   09660002
         LCLA  &TEMP,&T,&OP                                             09720002
         LCLC  &S                                                       09780002
         AIF   (&DIAGTST EQ 0).NOMSG                                    09840002
         AIF   (&INITIAL EQ 0).NOMSG                                    09900002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    09960002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  10020002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     10080002
*        LINE                                                           10140002
         LINE                                                           10200002
.NOMSG   ANOP                                                           10260002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  10320002
&SUB     SETB  1                                                        10380002
.LOOP    ANOP                                                           10440002
&OP      SETA  &OP+1                                                    10500002
.LOOP1   ANOP                                                           10560002
&NDX     SETA  &NDX+1                                                   10620002
         AIF   ('&ITEM(&NDX)' EQ '&SYSLIST(&OP,1)').FOUND               10680002
         AIF   (&NDX LT &ITEMNBR).LOOP1                                 10740002
         MNOTE '**LOG ITEM NOT DEFINED**'                               10800002
         MEXIT                                                          10860002
.FOUND   ANOP                                                           10920002
&ISHIFT  SETA  &SHIFT(&NDX)                                             10980002
&IBITS   SETA  &BITS(&NDX)                                              11040002
&T       SETA  &IBITS-1                                                 11100002
&B       SETB  0                                                        11160002
         AIF   (&IBITS GT 0 AND &IBITS LT 16).SUB0                      11220002
         MNOTE '**NO. OF BITS OUTSIDE RANGE OF 1-15**'                  11280002
         MEXIT                                                          11340002
.SUB0    AIF   (&SUB EQ 1).SUBA                                         11400002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             11460002
&K       SETA  K'&SYSLIST(2)                                            11520002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              11580002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                11640002
         AGO   .SUBB                                                    11700002
.SUBA    ANOP                                                           11760002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         11820002
&K       SETA  K'&SYSLIST(&OP,2)                                        11880002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          11940002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            12000002
.SUBB    ANOP                                                           12060002
&T       SETA  &S                                                       12120002
.BACKUP  ANOP                                                           12180002
&NRENTS  SETA  &NRENTS+1                                                12240002
&TEMP    SETA  &ISHIFT                                                  12300002
         AIF   (&IBITS NE 1 OR &B NE 0).BIN2                            12360002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'&TEMP'                12420002
         AGO   .OUT                                                     12480002
.BIN2    AIF   ('&SYSLIST(&OP,2)' NE '').BIN3                           12540002
&B       SETB  1                                                        12600002
.BIN3    ANOP                                                           12660002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'C'                    12720002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             12780002
.OUT     ANOP                                                           12840002
&NDX     SETA  0                                                        12900002
         AIF   (&SUB EQ 0).OUTA                                         12960002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 13020002
.OUTA    ANOP                                                           13080002
         MEND                                                           13140002
         MACRO                                                          13200002
         HEX                                                            13260002
.*                            THIS MACRO FACILITATES GENERATION OF THE  13320002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    13380002
.*                                 CONVERSIONS.                         13440002
.*                            &SYSLIST(&OP,1) - NAME OF DATA ITEM TO BE 13500002
.*                                 CONVERTED                            13560002
.*                            &SYSLIST(&OP,2) - # OF SPACES TO SKIP ON  13620002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   13680002
.*                                 BACK UP FROM COLUMN FOR START OF     13740002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  13800002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  13860002
.*                                 DESIRED. OMISSION OF THIS OPERAND    13920002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  13980002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  14040002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 14100002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    14160002
.*                                 IMPLICITLY B).                       14220002
.*                            &SYSLIST(&OP,3) - NUMBER OF BYTES TO      14280002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     14340002
.*                                 WITH AN L,R, OR B TO STIPULATE       14400002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     14460002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     14520002
.*                                 RESPECTIVELY. OMISSION OF THIS       14580002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  14640002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 14700002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 14760002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   14820002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     14880002
.*                                 SUBJECT LINE(S).                     14940002
         GBLC &ITEM(2000),&DSECT                                        15000002
         GBLA &ITEMNBR,&BITS(2000),&SHIFT(2000),&NRENTS                 15060002
         GBLA  &INITIAL                                                 15120002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               15180002
         LCLB  &B,&SUB                                                  15240002
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP,&OP              15300002
         LCLC  &S,&LETTER                                               15360002
         AIF   (&DIAGTST EQ 0).NOMSG                                    15420002
         AIF   (&INITIAL EQ 0).NOMSG                                    15480002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    15540002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  15600002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     15660002
*        LINE                                                           15720002
         LINE                                                           15780002
.NOMSG   ANOP                                                           15840002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  15900002
&SUB     SETB  1                                                        15960002
.LOOP    ANOP                                                           16020002
&OP      SETA  &OP+1                                                    16080002
.LOOP1   ANOP                                                           16140002
&NDX     SETA  &NDX+1                                                   16200002
         AIF   ('&ITEM(&NDX)' EQ '&SYSLIST(&OP,1)').FOUND               16260002
         AIF   (&NDX LT &ITEMNBR).LOOP1                                 16320002
         MNOTE '**LOG ITEM NOT DEFINED**'                               16380002
         MEXIT                                                          16440002
.FOUND   ANOP                                                           16500002
&ISHIFT  SETA  &SHIFT(&NDX)                                             16560002
&IBITS   SETA  &BITS(&NDX)                                              16620002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).ALIGN                     16680002
.ERR     MNOTE '**DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY**'          16740002
         MEXIT                                                          16800002
.ALIGN   ANOP                                                           16860002
&CODE    SETA  1                                                        16920002
         AIF   (&SUB EQ 1).SUBA                                         16980002
&K       SETA  K'&SYSLIST(3)                                            17040002
         AGO   .SUBB                                                    17100002
.SUBA    ANOP                                                           17160002
&K       SETA  K'&SYSLIST(&OP,3)                                        17220002
.SUBB    ANOP                                                           17280002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            17340002
         MNOTE '**BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL**' 17400002
         MEXIT                                                          17460002
.OK      AIF   (&SUB EQ 1).SUBC                                         17520002
         AIF   ('&SYSLIST(3)' EQ '').USEDEFN                            17580002
&LETTER  SETC  '&SYSLIST(3)'(&K,1)                                      17640002
&S       SETC  '&SYSLIST(3)'(1,&K-1)                                    17700002
         AGO   .SUBD                                                    17760002
.SUBC    ANOP                                                           17820002
         AIF   ('&SYSLIST(&OP,3)' EQ '').USEDEFN                        17880002
&LETTER  SETC  '&SYSLIST(&OP,3)'(&K,1)                                  17940002
&S       SETC  '&SYSLIST(&OP,3)'(1,&K-1)                                18000002
.SUBD    ANOP                                                           18060002
&BYTESP  SETA  &S                                                       18120002
         AIF   ('&LETTER' EQ 'B').BOTH                                  18180002
         AIF   ('&LETTER' EQ 'L').LEFT                                  18240002
&CODE    SETA  2                                                        18300002
         AGO   .L                                                       18360002
.LEFT    ANOP                                                           18420002
&CODE    SETA  1                                                        18480002
         AGO   .L                                                       18540002
.USEDEFN ANOP                                                           18600002
&BYTESP  SETA  &IBITS/8                                                 18660002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       18720002
&CODE    SETA  3                                                        18780002
&T       SETA  &BYTESP*2-1                                              18840002
&S       SETC  '&T'                                                     18900002
.OK2     AIF   (&ISHIFT EQ 0).L                                         18960002
&CODE    SETA  2                                                        19020002
.L       ANOP                                                           19080002
&B       SETB  1                                                        19140002
         AIF   (&SUB EQ 1).SUBE                                         19200002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             19260002
&K       SETA  K'&SYSLIST(2)                                            19320002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              19380002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                19440002
         AGO   .SUBF                                                    19500002
.SUBE    ANOP                                                           19560002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         19620002
&K       SETA  K'&SYSLIST(&OP,2)                                        19680002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          19740002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            19800002
.SUBF    ANOP                                                           19860002
.BACKUP  ANOP                                                           19920002
&NRENTS  SETA  &NRENTS+1                                                19980002
         AIF   (&BYTESP GT 0 AND &BYTESP LT 16).SUB0                    20040002
         MNOTE '**NO. OF BYTES OUTSIDE RANGE OF 1-15**'                 20100002
         MEXIT                                                          20160002
.SUB0    AIF   (&SUB EQ 1).SUBG                                         20220002
         DC    AL.12(&SYSLIST(1)-&DSECT),XL.4'A'                        20280002
         AGO   .SUBH                                                    20340002
.SUBG    ANOP                                                           20400002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'A'                    20460002
.SUBH    ANOP                                                           20520002
         DC    BL.1'&B',FL.7'&S',AL.4(&BYTESP),FL.4'&CODE'              20580002
.OUT     ANOP                                                           20640002
&NDX     SETA  0                                                        20700002
         AIF   (&SUB EQ 0).OUTA                                         20760002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 20820002
.OUTA    ANOP                                                           20880002
         MEND                                                           20940002
         MACRO                                                          21000002
         LSTART                                                         21060002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  21120002
.*                                 OF THE TABLE IS TO BEGIN.            21180002
         GBLA  &LABELNR                                                 21240002
         GBLC  &LBL(100)                                                21300002
         GBLC &LABELS(2000)                                             21360002
         GBLA  &LBLCTR(100)                                             21420002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               21480002
         LCLA  &NDX,&CTR                                                21540002
         AIF   (&DIAGTST EQ 0).NODIAG                                   21600002
         AIF   (&DIAGSET EQ 0).NODIAG                                   21660002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  21720002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   21780002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       21840002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 21900002
.NODIAG  ANOP                                                           21960002
         LINEND                                                         22020002
&CTR     SETA  1                                                        22080002
.LOOP    ANOP                                                           22140002
&NDX     SETA  &NDX+1                                                   22200002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            22260002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         22320002
&CTR     SETA  &CTR+1                                                   22380002
         AGO   .LOOPCTL                                                 22440002
.NOLBL   ANOP                                                           22500002
         DC    C'&LABELS(&NDX)'                                         22560002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  22620002
         MEND                                                           22680002
         MACRO                                                          22740002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C22800002
               &LABEL7,&LABEL8                                          22860002
.*                                 THIS MACRO ALLOWS LABELS TO          22920002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   22980002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  23040002
.*                                 TION MARKS. THE COLUMN AND LINE END  23100002
.*                                 CONTROLS WILL BE INSERTED BY THE     23160002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      23220002
.*                                 LABEL REQUIRED FOR RESPECTIVE        23280002
.*                                 COLUMN.                              23340002
         GBLC &LABELS(2000)                                             23400002
         GBLC  &LBL(100)                                                23460002
         GBLA  &LBLCTR(100)                                             23520002
         GBLA  &LABELNR                                                 23580002
         GBLA  &NRENTS,&LPTR,&INITIAL                                   23640002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               23700002
         LCLC  &MARGIN,&TACK                                            23760002
         LCLC  &TEXT                                                    23820002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            23880002
         AIF   (&INITIAL EQ 0).DIAGCLR                                  23940002
         AIF   (&DIAGTST EQ 0).DIAGCLR                                  24000002
         AIF   (&DIAGLIN EQ 1).DIAGCLR                                  24060002
         MNOTE '**NO LINE ASSOCIATED WITH PREVIOUS LABEL**'             24120002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   24180002
*        LINE                                                           24240002
         LINE                                                           24300002
.DIAGCLR ANOP                                                           24360002
&DIAGSET SETB  0                                                        24420002
&DIAGLIN SETB  0                                                        24480002
&MARGIN  SETC  '*'                                                      24540002
         AIF   ('&NAME' EQ '').LOOPOUT                                  24600002
&LPTR    SETA  &LPTR+1                                                  24660002
&LBL(&LPTR) SETC '&NAME'                                                24720002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          24780002
.LOOPOUT ANOP                                                           24840002
&OP      SETA  &OP+1                                                    24900002
&K       SETA  K'&SYSLIST(&OP)                                          24960002
         AIF (&K GE 2).NORM                                             25020002
&K       SETA  2                                                        25080002
.NORM    ANOP                                                           25140002
&START   SETA  2                                                        25200002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                25260002
&MARGIN  SETC  '$'                                                      25320002
.NOTLAST ANOP                                                           25380002
&NRCHAR  SETA  8                                                        25440002
&TACK    SETC  ''                                                       25500002
.LOOPIN  ANOP                                                           25560002
&REMAIN  SETA  &K-&START                                                25620002
         AIF (&REMAIN GE 8).MORE                                        25680002
&TACK    SETC  '&MARGIN'                                                25740002
&NRCHAR  SETA  &REMAIN                                                  25800002
.MORE    ANOP                                                           25860002
&TEXT    SETC  ''                                                       25920002
         AIF (&REMAIN EQ 0).ENDTEXT                                     25980002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          26040002
.ENDTEXT ANOP                                                           26100002
&LABELNR SETA  &LABELNR+1                                               26160002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  26220002
&START   SETA  &START+8                                                 26280002
         AIF ('&TACK' EQ '').LOOPIN                                     26340002
         AIF ('&TACK' EQ '*').LOOPOUT                                   26400002
         MEND                                                           26460002
         MACRO                                                          26520002
&NAME    ROUTINE &LOGITEM,&RNAME                                        26580002
         GBLA  &NRENTS                                                  26640002
         GBLC  &DSECT,&CSECT                                            26700002
         GBLA  &INITIAL                                                 26760002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               26820002
         AIF   (&DIAGTST EQ 0).NOMSG                                    26880002
         AIF   (&INITIAL EQ 0).NOMSG                                    26940002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    27000002
         MNOTE '**NO LINE ASSOCIATED WITH THIS ROUTINE**'               27060002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     27120002
*        LINE                                                           27180002
         LINE                                                           27240002
.NOMSG   ANOP                                                           27300002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           27360002
         DC    AL2(&RNAME-&CSECT)                                       27420002
&NRENTS  SETA  &NRENTS+1                                                27480002
         MEND                                                           27540002
         MACRO                                                          27600002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      27660002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     27720002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    27780002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 27840002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    27900002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    27960002
.*                                 THE PREVIOUS LINE AND STORES THAT #  28020002
.*                                 INTO THE APPROPRIATE BYTE.           28080002
.*                            &DATA(1) - CHARACTER POSITION TO BEGIN    28140002
.*                                 DATA.                                28200002
.*                            &DATA(2) - # OF SPACES BETWEEN SUCCESSIVE 28260002
.*                                 DATA COLUMN STARTING CHARACTERS.     28320002
.*                            &LABEL(1) - CHAR. POS. TO BEGIN LABELS.   28380002
.*                            &LABEL(2) - # SPACES BETWEEN LINE'S LABEL 28440002
.*                                 STARTING CHARACTERS.                 28500002
.*                            &SKIP= - # OF LINES TO ADVANCE CARRIAGE   28560002
.*                                 TO BEGIN NEXT PRINTED LINE.          28620002
.*                            NEW ENTRIES ARE GENERATED ONLY WHEN       28680002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   28740002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 28800002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   28860002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 28920002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    28980002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   29040002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   29100002
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  29160002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   29220002
.*                                 THE SUBJECT LINE                     29280002
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  29340002
         GBLA  &LASTCC,&INITIAL                                         29400002
         GBLC  &NRENTSX                                                 29460002
         GBLC  &CARRCON                                                 29520002
         GBLB  &TEST                                                    29580002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               29640002
         LCLA  &S                                                       29700002
         AIF   (&INITIAL EQ 0 OR &DIAGTST EQ 0).DIAGSET                 29760002
         AIF   (&DIAGSET EQ 0).DIAGSET                                  29820002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  29880002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   29940002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       30000002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 30060002
.DIAGSET ANOP                                                           30120002
&DIAGSET SETB  1                                                        30180002
&DIAGLIN SETB  1                                                        30240002
&NAME    DS    0C                                                       30300002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  30360002
         LINEND                                                         30420002
         AGO   .NTFIRST                                                 30480002
.FIRSTLN ANOP                                                           30540002
&NRENTSX SETC  'N&SYSNDX'                                               30600002
&INITIAL SETA  1                                                        30660002
N&SYSNDX EQU   *                                                        30720002
.NTFIRST ANOP                                                           30780002
         DC    AL1(0)                                                   30840002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               30900002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                30960002
&DB      SETA  &DATA(1)                                                 31020002
         AGO   .AA                                                      31080002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                31140002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 31200002
         AGO   .CC                                                      31260002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    31320002
         AIF   (&DATA(2) EQ &DT).BB                                     31380002
.CC      ANOP                                                           31440002
&DT      SETA  &DATA(2)                                                 31500002
.BB      DC    XL2'FFFE'                                                31560002
         DC    FL1'&DB'                                                 31620002
         DC    FL1'&DT'                                                 31680002
&NRENTS  SETA  &NRENTS+1                                                31740002
.NCDATA  ANOP                                                           31800002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              31860002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               31920002
&LB      SETA  &LABEL(1)                                                31980002
         AGO   .AAA                                                     32040002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              32100002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               32160002
         AGO   .CCC                                                     32220002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  32280002
         AIF   (&LABEL(2) EQ &LT).BBB                                   32340002
.CCC     ANOP                                                           32400002
&LT      SETA  &LABEL(2)                                                32460002
.BBB     DC    XL2'FFFF'                                                32520002
         DC    FL1'&LB'                                                 32580002
         DC    FL1'&LT'                                                 32640002
&NRENTS  SETA  &NRENTS+1                                                32700002
.NCLABEL ANOP                                                           32760002
         AIF   ('&SKIP' NE '').CONT                                     32820002
         AIF   (&TEST EQ 0).NOCHANG                                     32880002
         AGO   .DEFALTA                                                 32940002
.CONT    ANOP                                                           33000002
         AIF   (&TEST EQ 0).AB                                          33060002
         AIF   ('&SKIP' EQ 'E').AB                                      33120002
&S       SETA  &SKIP                                                    33180002
.DEFAULT ANOP                                                           33240002
         AIF   (&SKIP EQ &LASTCC).DEFALTA                               33300002
         ORG   &CARRCON+3                                               33360002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 33420002
         ORG                                                            33480002
&LASTCC  SETA  &S                                                       33540002
.DEFALTA ANOP                                                           33600002
&TEST    SETB  0                                                        33660002
         AGO   .DD                                                      33720002
.AB      AIF   ('&SKIP' NE 'E').ABB                                     33780002
A&SYSNDX DC    X'FFFB8B00'              EJECT                           33840002
         AGO   .ABC                                                     33900002
.ABB     AIF   (&SKIP EQ &LASTCC).NOCHANG                               33960002
A&SYSNDX DC    XL2'FFFB'                                                34020002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              34080002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              34140002
&LASTCC  SETA  &SKIP                                                    34200002
&TEST    SETB  1                                                        34260002
.ABC     ANOP                                                           34320002
&CARRCON SETC  'A&SYSNDX'                                               34380002
&NRENTS  SETA  &NRENTS+1                                                34440002
.DD      ANOP                                                           34500002
.NOCHANG ANOP                                                           34560002
         MEND                                                           34620002
         EJECT                                                          34680002
         MACRO                                                          34740002
         SUM   &LOGITEM,&MASK                                           34800002
.*                            THIS MACRO GENERATES A NORMAL EDIT ENTRY  34860002
.*                                 FOR PROCESSING BY THE SUMMARY MODULE 34920002
.*                            &LOGITEM - NAME OF DATA ITEM TO BE SUMMED 34980002
.*                            &MASK - BYTE MASK FOR BITS TO BE TESTED.  35040002
.*                                 THIS OPERAND SHOULD BE OMITTED FOR   35100002
.*                                 SINGLE BIT ITEMS IN WHICH CASE THE   35160002
.*                                 MASK WILL BE SET ACCORDING TO THE    35220002
.*                                 OFF BYTE BIT DISPLACEMENT OF THE     35280002
.*                                 ITEM AS DEFINED BY THE MACRO 'DSGEN' 35340002
         GBLA  &COUNTR,&ITEMNBR,&BITS(2000),&SHIFT(2000)                35400002
         GBLC  &ITEM(2000),&DSECT                                       35460002
         LCLA  &IBITS,&NDX,&ISHIFT,&M,&BITNBR                           35520002
.LOOP    ANOP                                                           35580002
&NDX     SETA  &NDX+1                                                   35640002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      35700002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  35760002
         MNOTE *,'LOGITEM NOT FOUND'                                    35820002
         MEXIT                                                          35880002
.FOUND   ANOP                                                           35940002
         DC    AL1(0)                                                   36000002
&ISHIFT  SETA  &SHIFT(&NDX)                                             36060002
&IBITS   SETA  &BITS(&NDX)                                              36120002
         AIF   ('&MASK' EQ '').FORM                                     36180002
         DC    B'&MASK'                                                 36240002
         AGO   .ITEM                                                    36300002
.FORM    ANOP                                                           36360002
&BITNBR  SETA  &ISHIFT-7                                                36420002
&BITNBR  SETA  0-&BITNBR                                                36480002
&M       SETA  1                                                        36540002
.LOOP2   ANOP                                                           36600002
         AIF   (&BITNBR EQ 0).GOTIT                                     36660002
&M       SETA  &M*2                                                     36720002
&BITNBR  SETA  &BITNBR-1                                                36780002
         AGO   .LOOP2                                                   36840002
.GOTIT   ANOP                                                           36900002
         DC    AL1(&M)                                                  36960002
.ITEM    DC    AL2(&LOGITEM-&DSECT)                                     37020002
         DC    AL2(&COUNTR)                                             37080002
&COUNTR  SETA  &COUNTR+1                                                37140002
         MEND                                                           37200002
         EJECT                                                          37260002
         MACRO                                                          37320002
         SPECIAL &ROUTINE,&PARAM,&SPACE=                                37380002
.*                            THIS MACRO GENERATES A SPECIAL ROUTINE    37440002
.*                                 ENTRY TO BE PROCESSED BY THE SUM. M. 37500002
.*                            &ROUTINE - SYMBOL ON SPECIAL ROUTINE EWT. 37560002
.*                            &PARAM - AN 8 BIT BINARY REPRESENTATION   37620002
.*                                 TO OCCUPY THE 'MASK' FIELD BUT TO BE 37680002
.*                                 INTERPRETED AS AN ARGUMENT OF THE    37740002
.*                                 SPECIAL ROUTINE.                     37800002
.*                            &SPACE - THE NUMBER OF 2BYTE COUNTERS TO  37860002
.*                                 ALLOCATE FOR REQUIRED PROCESSING.    37920002
         GBLC  &CSECT                                                   37980002
         GBLA  &COUNTR                                                  38040002
         LCLA  &ADD                                                     38100002
         DC    AL1(128)                                                 38160002
         DC    BL.8'&PARAM'                                             38220002
         DC    AL2(&ROUTINE-&CSECT)                                     38280002
         DC    AL2(&COUNTR)                                             38340002
&ADD     SETA  1                                                        38400002
         AIF   ('&SPACE' EQ '').NORM                                    38460002
&ADD     SETA  &SPACE                                                   38520002
.NORM    ANOP                                                           38580002
&COUNTR  SETA  &COUNTR+&ADD                                             38640002
         MEND                                                           38700002
         EJECT                                                          38760002
         GBLC  &DSECT                                                   38820002
         GBLC  &CSECT                                                   38880002
&CSECT   SETC  'IFCS0165'                                               38940002
&DSECT   SETC  'INDEPEND'                                               39000002
IFCS0165 CSECT                                                          39060002
         USING *,R9                                                     39120002
INDEPEND DSECT                                                          39180002
         DS    0F                                                       39240002
         DSGEN (XKEY,16),(XSWS8,9),(XSWS9,1),(XSWS10,1),(XSWS11,1),    C39300002
               (XSWS12,1),(XSWS13,1),(XSWS14,1),(XSWS15,1)              39360002
         DSGEN (XDUM1,32)                                               39420002
         DSGEN (XDATE,32)                                               39480002
         DSGEN (XTIME,32)                                               39540002
         DSGEN (XDUM2,8),(XSER,24)                                      39600002
         DSGEN (XCPUMOD,16),(XDUM3,16)                                  39660002
         DSGEN (XPGMID,64)                                              39720002
         DSGEN (XJOBID,64)                                              39780002
         DSGEN (XMCKPSW,64)                                             39840002
         DSGEN (DUM1,32)                                          P0415 39900002
         DSGEN (DUM2,16),(EXTDLOG,16)                             P0415 39960002
M165     DS    212F                                                     40020002
         DSGEN (A1LB,32)                                                40080002
         DSGEN (A1LC,32)                                                40140002
         DSGEN (A1LD,32)                                                40200002
         DSGEN (A1LE,32)                                                40260002
         DSGEN (A1LF,32)                                                40320002
         DSGEN (A1LG,32)                                                40380002
         DSGEN (A1LH,32)                                                40440002
         DSGEN (A1LJ,32)                                                40500002
A1LK     DSGEN (A1LK00,1),(A1LK01,1),(DUM45,1),(A1LK03,1),(A1LK04,1),  C40560002
               (DUM46,3),(A1LK08,1),(DUM47,1),(A1LK10,1),(DUM48,1),    C40600002
               (A1LK12,1),(DUM49,3),(A1LK16,1),(A1LK17,1),(A1LK18,1),  C40640002
               (DM49,1),(A1LK20,1),(DUM50,3),(A1LK24,1),               C40680002
               (DUM51,1),(A1LK26,1),(DUM52,5)                           40740002
A1LL     DSGEN (DUM53,11),(A1LL43,1),(DUM54,1),(A1LL45,1),             C40800002
               (DUM55,4),(A1LL50,1),(DM55,13)                           40860002
         DSGEN (A2LB,32)                                                40920002
         DSGEN (A2LC,32)                                                40980002
         DSGEN (A2LD,32)                                                41040002
         DSGEN (A2LE,32)                                                41100002
         DSGEN (A2LF,32)                                                41160002
         DSGEN (A2LG,32)                                                41220002
         DSGEN (A2LH,32)                                                41280002
         DSGEN (A2LJ,32)                                                41340002
A2LK     DSGEN (DUM56,1),(A2LK01,1),(A2LK02,1),(A2LK03,1),             C41400002
               (A2LK04,1),(A2LK05,1),(DUM57,2),(A2LK08,1),             C41460002
               (A2LK09,1),(DUM58,1),(A2LK11,1),(A2LK12,1),             C41520002
               (A2LK13,1),(DUM59,4),(A2LK18,1),(A2LK19,1),             C41580002
               (A2LK20,1),(A2LK21,1),(DUM60,2),(A2LK24,1),             C41640002
               (A2LK25,1),(A2LK26,1),(A2LK27,1),(DUM61,4)               41700002
A2LL     DSGEN (DUM62,2),(A2LL34,1),(DUM63,6),(A2LL41,1),              C41760002
               (DUM64,1),(A2LL43,1),(A2LL44,1),(A2LL45,1),             C41820002
               (DUM65,18)                                               41880002
         DSGEN (A3LB,32)                                                41940002
         DSGEN (A3LC,32)                                                42000002
         DSGEN (A3LD,32)                                                42060002
         DSGEN (A3LE,32)                                                42120002
         DSGEN (A3LF,32)                                                42180002
         DSGEN (A3LG,32)                                                42240002
         DSGEN (A3LH,32)                                                42300002
         DSGEN (A3LJ,32)                                                42360002
         DSGEN (A3LK,32)                                                42420002
         DSGEN (A3LL,32)                                                42480002
         DSGEN (A4LB,32)                                                42540002
         DSGEN (A4LC,32)                                                42600002
         DSGEN (A4LD,32)                                                42660002
         DSGEN (A4LE,32)                                                42720002
         DSGEN (A4LF,32)                                                42780002
         DSGEN (A4LG,32)                                                42840002
         DSGEN (A4LH,32)                                                42900002
         DSGEN (A4LJ,32)                                                42960002
A4LK     DSGEN (DUM66,25),(A4LK25,1),(A4LK26,1),(A4LK27,1),            C43020002
               (A4LK28,1),(DUM67,3)                                     43080002
         DSGEN (A4LL,32)                                                43140002
         DSGEN (A5LB,32)                                                43200002
         DSGEN (A5LC,32)                                                43260002
         DSGEN (A5LD,32)                                                43320002
         DSGEN (A5LE,32)                                                43380002
         DSGEN (A5LF,32)                                                43440002
         DSGEN (A5LG,32)                                                43500002
         DSGEN (A5LH,32)                                                43560002
         DSGEN (A5LJ,32)                                                43620002
A5LK     DSGEN (A5LK00,1),(A5LK01,1),(A5LK02,1),(A5LK03,1),            C43680002
               (A5LK04,1),(A5LK05,1),(DUM68,2),(A5LK08,1),             C43740002
               (A5LK09,1),(A5LK10,1),(A5LK11,1),(A5LK12,1),            C43800002
               (A5LK13,1),(DUM69,2),(A5LK16,1),(DUM70,1),              C43860002
               (A5LK18,1),(A5LK19,1),(A5LK20,1),(A5LK21,1),            C43920002
               (DUM71,2),(A5LK24,1),(A5LK25,1),                        C43980002
               (A5LK26,1),(A5LK27,1),(A5LK28,1),(DUM72,3)               44040002
A5LL     DSGEN (A5LL32,1),(A5LL33,1),(A5LL34,1),(A5LL35,1),            C44100002
               (A5LL36,1),(A5LL37,1),(DUM73,2),(A5LL40,1),             C44160002
               (A5LL41,1),(A5LL42,1),(A5LL43,1),(A5LL44,1),            C44220002
               (A5LL45,1),(DUM74,2),(A5LL48,1),(A5LL49,1),             C44280002
               (A5LL50,1),(A5LL51,1),(A5LL52,1),(A5LL53,1),            C44340002
               (DUM75,2),(A5LL56,1),(DUM76,7)                           44400002
         DSGEN (A6LB,32)                                                44460002
         DSGEN (A6LC,32)                                                44520002
         DSGEN (A6LD,32)                                                44580002
         DSGEN (A6LE,32)                                                44640002
         DSGEN (A6LF,32)                                                44700002
         DSGEN (A6LG,32)                                                44760002
         DSGEN (A6LH,32)                                                44820002
         DSGEN (A6LJ,32)                                                44880002
         DSGEN (A6LK,32)                                                44940002
A6LL     DSGEN (A6LL32,1),(A6LL33,1),(A6LL34,1),(A6LL35,1),            C45000002
               (DUM77,4),(A6LL40,1),(A6LL41,1),(A6LL42,1),             C45060002
               (DUM78,1),(A6LL44,1),(A6LL45,1),(DUM79,3),(A6LL49,1),   C45120002
               (A6LL50,1),(A6LL51,1),(DUM80,1),(A6LL53,1),             C45180002
               (DUM81,2),(A6LL56,1),(A6LL57,1),(DUM82,6)                45240002
         DSGEN (A7LB,32)                                                45300002
         DSGEN (A7LC,32)                                                45360002
         DSGEN (A7LD,32)                                                45420002
         DSGEN (A7LE,32)                                                45480002
         DSGEN (A7LF,32)                                                45540002
         DSGEN (A7LG,32)                                                45600002
         DSGEN (A7LH,32)                                                45660002
         DSGEN (A7LJ,32)                                                45720002
         DSGEN (A7LK,32)                                                45780002
         DSGEN (A7LL,32)                                                45840002
         DSGEN (B0LB,32)                                                45900002
         DSGEN (B0LC,32)                                                45960002
         DSGEN (B0LD,32)                                                46020002
         DSGEN (B0LE,32)                                                46080002
         DSGEN (B0LF,32)                                                46140002
         DSGEN (B0LG,32)                                                46200002
         DSGEN (B0LH,32)                                                46260002
         DSGEN (B0LJ,32)                                                46320002
         DSGEN (B0LK,32)                                                46380002
         DSGEN (B0LL,32)                                                46440002
         DSGEN (B1LB,32)                                                46500002
         DSGEN (B1LC,32)                                                46560002
         DSGEN (B1LD,32)                                                46620002
         DSGEN (B1LE,32)                                                46680002
         DSGEN (B1LF,32)                                                46740002
         DSGEN (B1LG,32)                                                46800002
         DSGEN (B1LH,32)                                                46860002
         DSGEN (B1LJ,32)                                                46920002
         DSGEN (DM82,9),(B1LK09,1),(B1LK10,1),(B1LK11,1),(DM83,20)      46980002
         DSGEN (B1LL,32)                                                47040002
         DSGEN (B2LB,32)                                                47100002
         DSGEN (B2LC,32)                                                47160002
         DSGEN (B2LD,32)                                                47220002
         DSGEN (B2LE,32)                                                47280002
         DSGEN (B2LF,32)                                                47340002
         DSGEN (B2LG,32)                                                47400002
         DSGEN (B2LH,32)                                                47460002
         DSGEN (B2LJ,32)                                                47520002
         DSGEN (B2LK,32)                                                47580002
         DSGEN (B2LL,32)                                                47640002
         DSGEN (B3LB,32)                                                47700002
         DSGEN (B3LC,32)                                                47760002
         DSGEN (B3LD,32)                                                47820002
         DSGEN (B3LE,32)                                                47880002
         DSGEN (B3LF,32)                                                47940002
         DSGEN (B3LG,32)                                                48000002
         DSGEN (B3LH,32)                                                48060002
         DSGEN (B3LJ,32)                                                48120002
B3LK     DSGEN (B3LK00,1),(B3LK01,1),(B3LK02,1),(B3LK03,1),            C48180002
               (B3LK04,1),(B3LK05,1),(DUM83,2),(B3LK08,1),             C48240002
               (B3LK09,1),(B3LK10,1),(B3LK11,1),(DUM84,20)              48300002
         DSGEN (B3LL,32)                                                48360002
         DSGEN (B4LB,32)                                                48420002
         DSGEN (B4LC,32)                                                48480002
         DSGEN (B4LD,32)                                                48540002
         DSGEN (B4LE,32)                                                48600002
         DSGEN (B4LF,32)                                                48660002
         DSGEN (B4LG,32)                                                48720002
         DSGEN (B4LH,32)                                                48780002
         DSGEN (B4LJ,32)                                                48840002
         DSGEN (B4LK,32)                                                48900002
         DSGEN (B4LL,32)                                                48960002
         DSGEN (B5LB,32)                                                49020002
         DSGEN (B5LC,32)                                                49080002
         DSGEN (B5LD,32)                                                49140002
         DSGEN (B5LE,32)                                                49200002
         DSGEN (B5LF,32)                                                49260002
         DSGEN (B5LG,32)                                                49320002
         DSGEN (B5LH,32)                                                49380002
         DSGEN (B5LJ,32)                                                49440002
B5LK     DSGEN (DUM85,12),(B5LK12,1),(B5LK13,1),(DUM86,18)              49500002
         DSGEN (B5LL,32)                                                49560002
         DSGEN (B6LB,32)                                                49620002
         DSGEN (B6LC,32)                                                49680002
         DSGEN (B6LD,32)                                                49740002
         DSGEN (B6LE,32)                                                49800002
         DSGEN (B6LF,32)                                                49860002
         DSGEN (B6LG,32)                                                49920002
         DSGEN (B6LH,32)                                                49980002
         DSGEN (B6LJ,32)                                                50040002
         DSGEN (DUM91,13),(B6LK13,1),(DUM92,4),(B6LK18,1),(B6LK19,1),  C50100002
               (B6LK20,1),(DUM93,11)                           @YA07735 50130002
         DSGEN (B6LL,32)                                                50160002
         DSGEN (COLB,32)                                                50220002
         DSGEN (COLC,32)                                                50280002
         DSGEN (COLD,32)                                                50340002
         DSGEN (COLE,32)                                                50400002
         DSGEN (COLF,32)                                                50460002
         DSGEN (COLG,32)                                                50520002
         DSGEN (COLH,32)                                                50580002
         DSGEN (COLJ,32)                                                50640002
C0LK     DSGEN (C0LK00,1),(C0LK01,1),(C0LK02,1),(C0LK03,1),            C50700002
               (C0LK04,1),(C0LK05,1),(DUMC001,2),(C0LK08,1),(C0LK09,1),*50760002
               (DUMC002,19),(C0LK29,1),(DUMC003,2)                      50820002
C0LL    DSGEN  (C0LL32,1),(C0LL33,1),(C0LL34,1),(C0LL35,1),            C50880002
               (C0LL36,1),(DUMC004,2),(C0LL41,1),(DUMC005,24)           50940002
         DSGEN (C1LB,32)                                                51000002
         DSGEN (C1LC,32)                                                51060002
         DSGEN (C1LD,32)                                                51120002
         DSGEN (C1LE,32)                                                51180002
         DSGEN (C1LF,32)                                                51240002
         DSGEN (C1LG,32)                                                51300002
         DSGEN (C1LH,32)                                                51360002
         DSGEN (C1LJ,32)                                                51420002
C1LK     DSGEN (DUMC100,9),(C1LK09,1),(C1LK10,1),(C1LK11,1),           C51480002
               (C1LK12,1),(DUMC101,7),(C1LK20,1),(C1LK21,1),           C51540002
               (DUMC102,2),(C1LK24,1),(C1LK25,1),(DUMC103,6)            51600002
C1LL     DSGEN (DUMC104,9),(C1LL41,1),(C1LL42,1),(C1LL43,1),           C51660002
               (C1LL44,1),(C1LL45,1),(DUMC105,6),(C1LL52,1),           C51720002
               (C1LL53,1),(DUMC106,2),(C1LL56,1),(C1LL57,1),(DUMC107,6) 51780002
         DSGEN (C2LB,32)                                                51840002
         DSGEN (C2LC,32)                                                51900002
         DSGEN (C2LD,32)                                                51960002
         DSGEN (C2LE,32)                                                52020002
         DSGEN (C2LF,32)                                                52080002
         DSGEN (C2LG,32)                                                52140002
         DSGEN (C2LH,32)                                                52200002
         DSGEN (C2LJ,32)                                                52260002
         DSGEN (C2LK,32)                                                52320002
         DSGEN (C2LL,32)                                                52380002
         DSGEN (C3LB,32)                                                52440002
         DSGEN (C3LC,32)                                                52500002
         DSGEN (C3LD,32)                                                52560002
         DSGEN (C3LE,32)                                                52620002
         DSGEN (C3LF,32)                                                52680002
         DSGEN (C3LG,32)                                                52740002
         DSGEN (C3LH,32)                                                52800002
         DSGEN (C3LJ,32)                                                52860002
         DSGEN (C3LK,32)                                                52920002
         DSGEN (C3LL,32)                                                52980002
         DSGEN (C4LB,32)                                                53040002
         DSGEN (C4LC,32)                                                53100002
         DSGEN (C4LD,32)                                                53160002
         DSGEN (C4LE,32)                                                53220002
         DSGEN (C4LF,32)                                                53280002
         DSGEN (C4LG,32)                                                53340002
         DSGEN (C4LH,32)                                                53400002
         DSGEN (C4LJ,32)                                                53460002
         DSGEN (C4LK,32)                                                53520002
         DSGEN (C4LL,32)                                                53580002
         DSGEN (C5LB,32)                                                53640002
         DSGEN (C5LC,32)                                                53700002
         DSGEN (C5LD,32)                                                53760002
         DSGEN (C5LE,32)                                                53820002
         DSGEN (C5LF,32)                                                53880002
         DSGEN (C5LG,32)                                                53940002
         DSGEN (C5LH,32)                                                54000002
         DSGEN (C5LJ,32)                                                54060002
         DSGEN (C5LK,32)                                                54120002
         DSGEN (C5LL,32)                                                54180002
         DSGEN (C6LB,32)                                                54240002
         DSGEN (C6LC,32)                                                54300002
         DSGEN (C6LD,32)                                                54360002
         DSGEN (C6LE,32)                                                54420002
         DSGEN (C6LF,32)                                                54480002
         DSGEN (C6LG,32)                                                54540002
         DSGEN (C6LH,32)                                                54600002
         DSGEN (C6LJ,32)                                                54660002
         DSGEN (C6LK,32)                                                54720002
         DSGEN (C6LL,32)                                                54780002
IFCS0165 CSECT                                                          54840002
         USING INDEPEND,R2                                              54900002
         DC    A(ENTRIES)                                               54960002
         DC    A(PEDIT)                                                 55020002
REG8     DC    F'0'                                                     55080002
SCSIZE   DC    H'156'                                          @YA07735 55140002
R0       EQU   0                                                        55200002
R1       EQU   1                                                        55260002
R2       EQU   2                                                        55320002
R3       EQU   3                                                        55380002
R4       EQU   4                                                        55440002
R5       EQU   5                                                        55500002
R6       EQU   6                                                        55560002
R7       EQU   7                                                        55620002
R8       EQU   8                                                        55680002
R9       EQU   9                                                        55740002
R10      EQU   10                                                       55800002
R11      EQU   11                                                       55860002
R12      EQU   12                                                       55920002
R13      EQU   13                                                       55980002
R14      EQU   14                                                       56040002
R15      EQU   15                                                       56100002
C0       EQU   0                                                        56160002
C1       EQU   1                                                        56220002
*********                                                               56280002
*                                                                       56340002
* SPECIAL ROUTINES                                                      56400002
XDATE1   STM   R14,R12,L12(R13)         SAVE REGS                       56460002
         CLC   XDATE(L4),HEX00          IS DATE 0                       56520002
         BE    RETURN                   BRANCH IF DATE 0                56580002
         CLC   L0(L4,R3),HEX00          IS LOW DATE ZERO          P0415 56640002
         BNE   XDATE2                   BR-NO                     P0415 56700002
         MVC   L0(L4,R3),XDATE          MOVE IN DATE              P0415 56760002
XDATE2   EQU   *                                                  P0415 56820002
         CLC   XDATE(L4),L0(R3)         CHECK FOR LOW DATE              56880002
         BL    SAVELOW                  BRANCH IF LOW                   56940002
         CLC   XDATE(L4),L4(R3)         CHECK FOR HIGH DATE             57000002
         BNH   RETURN                   BRANCH IF NOT HIGH              57060002
SAVEHI   MVC   L4(L4,R3),XDATE          MOVE HIGH DATE                  57120002
         B     RETURN                   RETURN                          57180002
SAVELOW  MVC   L0(L4,R3),XDATE          MOVE LOW DATE                   57240002
RETURN   LM    R14,R12,L12(R13)         RESTORE REGS                    57300002
         BR    R14                      RETURN                          57360002
ROUT0    STM   R14,R12,L12(R13)         SAVE ROUTINE REGISTERS    P0415 57420002
         CLC   EXTDLOG(L2),HEX00        TEST FOR 0 LOGOUT LENGTH  P0415 57480002
         BNE   ROUT0A                   BRANCH IF LOGOUT RECORDED P0415 57540002
         CLC   XCPUMOD(L2),C168    IS IT A 168                          57550002
         BE    ROUT0A                                                   57560002
         CLC   XCPUMOD(L2),C3062   IS IT A 3062                         57570002
         BE    ROUT0A                                                   57580002
         LA    R0,ENDTBL-L6             LOAD ADDRESS OF LAST ENTRYP0415 57600002
         ST    R0,REG8                  STORE INTO CURRENT ENTRY  P0415 57660002
ROUT0A   LM    R14,R12,L12(R13)         RESTORE REGISTERS         P0415 57720002
         CLC   XCPUMOD(L2),C168    MOD 168?                    @YA07735 57727002
         BER   R14                 BRANCH IF YES               @YA07735 57734002
         TM    XDUM2,V2            MOD 165-M2?                 @YA07735 57741002
         BOR   R14                 BRANCH IF YES               @YA07735 57748002
         MVI   Y165,X1             SET M165 FLAG               @YA07735 57755002
         ST    R2,SAVE2            SAVE REG 2                  @YA07735 57762002
         SH    R2,X90              SET R2 TO START OF 165 REC  @YA07735 57769002
         BR    R14                      RETURN                    P0415 57780002
HEX00    DC    XL4'00'                                                  57840002
X90      DC    X'0090'                                         @YA07735 57870002
*********************************************************************** 57900002
*        THIS ROUTINE TESTS FOR VERSION OF M165                       * 57960002
*********************************************************************** 58020002
V2       EQU   X'01'                                                    58080002
CHKMOD   STM   R6,R7,XSAVE         SAVE R6 AND R7                       58140002
         CLI   Y165,X1             MOD 165?                    @YA07735 58148002
         BNE   CHKMOD2             BRANCH IF NO                @YA07735 58156002
         OI    L0(R3),C0           SET MOD 165 FLAG            @YA07735 58164002
         L     R2,SAVE2            RESTORE REG 2               @YA07735 58172002
         B     CHKMOD1             GO FOR RETURN               @YA07735 58180002
CHKMOD2  OI    L0(R3),C1           SET 165R/168 FLAG           @YA07735 58188002
V2EXIT   LA    R7,MFC-L6               CHANGE                           58560002
         ST    R7,REG8                   POINTER                        58620002
         TM    A4LJ,X10             7094 EMULATOR?             @YA07735 58624002
         BZ    TRY7080              BRANCH IF NO               @YA07735 58628002
         OI    L0(R3),X1           INDICATE 7094               @YA07735 58632002
         B     CHKMOD1                                         @YA07735 58636002
TRY7080  TM    A4LJ,X08             7080 EMULATOR?             @YA07735 58640002
         BZ    TRY7074              BRANCH IF NO               @YA07735 58644002
         OI    L0(R3),X8           INDICATE 7080               @YA07735 58648002
         B     CHKMOD1                                         @YA07735 58652002
TRY7074  TM    A4LJ,X04             7074 EMULATOR?             @YA07735 58656002
         BZ    CHKMOD1              BRANCH IF NO               @YA07735 58660002
         OI    L0(R3),X4           INDICATE 7074               @YA07735 58664002
CHKMOD1  LM    R6,R7,XSAVE         RESTORE REGS                @YA07735 58668002
         BR    R14                 EXIT                                 58800002
SAVE2    DC    F'0'                                            @YA07735 58830002
C168     DC    X'0168'                                                  58860002
Y165     DC    X'00'                                           @YA07735 58890002
C3062    DC    X'3062'                                                  58890102
L0       EQU   0                                                        58920002
L1       EQU   1                                                        58980002
L2       EQU   2                                                        59040002
L3       EQU   3                                                        59100002
L4       EQU   4                                                        59160002
L5       EQU   5                                                        59220002
L6       EQU   6                                                        59280002
L7       EQU   7                                                        59340002
L8       EQU   8                                                        59400002
L9       EQU   9                                                        59460002
L10      EQU   10                                                       59520002
L11      EQU   11                                                       59580002
L12      EQU   12                                                       59640002
X10      EQU   X'10'                                           @YA07735 59648002
X08      EQU   X'08'                                           @YA07735 59656002
X04      EQU   X'04'                                           @YA07735 59664002
X1       EQU   16                                              @YA07735 59672002
X8       EQU   8                                               @YA07735 59680002
X4       EQU   4                                               @YA07735 59688002
ENTRIES  DS    0F                                                       59700002
         SPECIAL    XDATE1,00000000,SPACE=4                             59760002
         SPECIAL    ROUT0,00000000,SPACE=0                        P0415 59820002
         SUM   A1LK00                                                   59880002
         SUM   A1LK01                                                   59940002
         SUM   A1LK03                                                   59950002
         SUM   A1LK04                                                   59970002
         SUM   A1LK08                                                   60000002
         SUM   A1LK10                                                   60060002
         SUM   A1LK12                                                   60120002
         SUM   A1LK16                                                   60130002
         SUM   A1LK17                                                   60140002
         SUM   A1LK18                                                   60150002
         SUM   A1LK20                                                   60180002
         SUM   A1LK24                                                   60240002
         SUM   A1LK26                                                   60300002
         SUM   A1LL43                                                   60360002
         SUM   A1LL45                                                   60420002
         SUM   A1LL50                                                   60450002
         SUM   A2LK01                                                   60480002
         SUM   A2LK02                                                   60540002
         SUM   A2LK03                                                   60600002
         SUM   A2LK04                                                   60660002
         SUM   A2LK05                                                   60720002
         SUM   A2LK08                                                   60780002
         SUM   A2LK09                                                   60840002
         SUM   A2LK11                                                   60900002
         SUM   A2LK12                                                   60960002
         SUM   A2LK13                                                   61020002
         SUM   A2LK18                                                   61080002
         SUM   A2LK19                                                   61140002
         SUM   A2LK20                                                   61200002
         SUM   A2LK21                                                   61260002
         SUM   A2LK24                                                   61320002
         SUM   A2LK25                                                   61380002
         SUM   A2LK26                                                   61440002
         SUM   A2LK27                                                   61500002
         SUM   A2LL34                                                   61560002
         SUM   A2LL41                                                   61620002
         SUM   A2LL43                                                   61680002
         SUM   A2LL44                                                   61740002
         SUM   A2LL45                                                   61800002
         SUM   A4LK25                                                   61860002
         SUM   A4LK26                                                   61920002
         SUM   A4LK27                                                   61980002
         SUM   A4LK28                                                   62040002
         SUM   A5LK00                                                   62100002
         SUM   A5LK01                                                   62160002
         SUM   A5LK02                                                   62220002
         SUM   A5LK03                                                   62280002
         SUM   A5LK04                                                   62340002
         SUM   A5LK05                                                   62400002
         SUM   A5LK08                                                   62460002
         SUM   A5LK09                                                   62520002
         SUM   A5LK10                                                   62580002
         SUM   A5LK11                                                   62640002
         SUM   A5LK12                                                   62700002
         SUM   A5LK13                                                   62760002
         SUM   A5LK16                                                   62820002
         SUM   A5LK18                                                   62880002
         SUM   A5LK19                                                   62940002
         SUM   A5LK20                                                   63000002
         SUM   A5LK21                                                   63060002
         SUM   A5LK24                                                   63120002
         SUM   A5LK25                                                   63180002
         SUM   A5LK26                                                   63240002
         SUM   A5LK27                                                   63300002
         SUM   A5LK28                                                   63360002
         SUM   A5LL32                                                   63420002
         SUM   A5LL33                                                   63480002
         SUM   A5LL34                                                   63540002
         SUM   A5LL35                                                   63600002
         SUM   A5LL36                                                   63660002
         SUM   A5LL37                                                   63720002
         SUM   A5LL40                                                   63780002
         SUM   A5LL41                                                   63840002
         SUM   A5LL42                                                   63900002
         SUM   A5LL43                                                   63960002
         SUM   A5LL44                                                   64020002
         SUM   A5LL45                                                   64080002
         SUM   A5LL48                                                   64140002
         SUM   A5LL49                                                   64200002
         SUM   A5LL50                                                   64260002
         SUM   A5LL51                                                   64320002
         SUM   A5LL52                                                   64380002
         SUM   A5LL53                                                   64440002
         SUM   A5LL56                                                   64500002
         SUM   A6LL32                                                   64560002
         SUM   A6LL33                                                   64620002
         SUM   A6LL34                                                   64680002
         SUM   A6LL35                                                   64740002
         SUM   A6LL40                                                   64800002
         SUM   A6LL41                                                   64860002
         SUM   A6LL42                                                   64920002
         SUM   A6LL44                                                   64980002
         SUM   A6LL45                                                   65010002
         SUM   A6LL49                                                   65040002
         SUM   A6LL50                                                   65100002
         SUM   A6LL51                                                   65160002
         SUM   A6LL53                                                   65220002
         SUM   A6LL56                                                   65280002
         SUM   A6LL57                                                   65340002
         SUM   B1LK09                                                   65350002
         SUM   B1LK10                                                   65360002
         SUM   B1LK11                                                   65370002
         SUM   B3LK00                                                   65400002
         SUM   B3LK01                                                   65460002
         SUM   B3LK02                                                   65520002
         SUM   B3LK03                                                   65580002
         SUM   B3LK04                                                   65640002
         SUM   B3LK05                                                   65700002
         SUM   B3LK08                                                   65760002
         SUM   B3LK09                                                   65820002
         SUM   B3LK10                                                   65880002
         SUM   B3LK11                                                   65940002
         SUM   B5LK12                                                   66060002
         SUM   B5LK13                                                   66120002
         SUM   B6LK13                                          @YA07735 66126002
         SUM   B6LK18                                          @YA07735 66132002
         SUM   B6LK19                                          @YA07735 66138002
         SUM   B6LK20                                          @YA07735 66144002
         SPECIAL    CHKMOD,00000000,SPACE=1                             66150002
ENDTBL1  DC    X'FFFF'                                                  66180002
MFC      EQU   *                                                        66240002
         SUM   C0LK00                                                   66300002
         SUM   C0LK01                                                   66360002
         SUM   C0LK02                                                   66420002
         SUM   C0LK03                                                   66480002
         SUM   C0LK04                                                   66540002
         SUM   C0LK05                                                   66570002
         SUM   C0LK08                                                   66600002
         SUM   C0LK09                                                   66660002
         SUM   C0LK29                                                   66720002
         SUM   C0LL32                                                   66840002
         SUM   C0LL33                                                   66900002
         SUM   C0LL34                                                   66960002
         SUM   C0LL35                                                   67020002
         SUM   C0LL36                                                   67080002
         SUM   C0LL41                                                   67140002
         SUM   C1LK09                                                   67200002
* (UNSUPPORTED ITEM C1LK10 DELETED)                            @ZA34990 67260000
         SUM   C1LK11                                                   67320002
         SUM   C1LK12                                                   67380002
         SUM   C1LK20                                                   67440002
         SUM   C1LK21                                                   67500002
         SUM   C1LK24                                                   67560002
         SUM   C1LK25                                                   67620002
         SUM   C1LL41                                                   67680002
         SUM   C1LL42                                                   67740002
* (REPETITION OF C1LL42 DELETED)                               @ZA34990 67800000
         SUM   C1LL43                                                   67850000
         SUM   C1LL44                                                   67900000
         SUM   C1LL45                                                   67950000
* (UNSUPPORTED ITEM C1LL52 DELETED)                            @ZA34990 68000000
         SUM   C1LL53                                                   68100002
         SUM   C1LL56                                                   68160002
         SUM   C1LL57                                                   68220002
ENDTBL   DC    X'FF'                                              P0415 68280002
PEDIT    DS    0F                                                       68340002
&CSECT   SETC  'PEDIT'                                                  68400002
&DSECT   SETC  'YYYA'                                                   68460002
         USING *,R9                                                     68520002
         DC    A(PENTRY)                                                68580002
         DC    CL8'IFCS0165'                                            68640002
YR9PTR   DS    1F                                                       68700002
YLABELP  DS    1F                                                       68760002
YYYA     DSECT                                                          68820002
         DS    3H                                                       68880002
         DSGEN (YDUMA,16),(YNOREC,16)                                   68940002
         DSGEN (YTYPE,8),(YCHAN,8),(YCUA,24),(YSER,24)                  69000002
         DSGEN (YCPU,16),(YSMSW,16)                                     69060002
         DSGEN (YLOWD,32)                                               69120002
         DSGEN (YHID,32)                                                69180002
         DSGEN (CTA1LK00,16),(CTA1LK01,16)                              69240002
         DSGEN (CTA1LK03,16),(CTA1LK04,16)                              69270002
         DSGEN (CTA1LK08,16),(CTA1LK10,16)                              69300002
         DSGEN (CTA1LK12,16),(CTA1LK16,16)                              69360002
         DSGEN (CTA1LK17,16),(CTA1LK18,16)                              69390002
         DSGEN (CTA1LK20,16),(CTA1LK24,16)                              69420002
         DSGEN (CTA1LK26,16),(CTA1LL43,16)                              69480002
         DSGEN (CTA1LL45,16),(CTA1LL50,16)                              69510002
         DSGEN (CTA2LK01,16),(CTA2LK02,16)                              69540002
         DSGEN (CTA2LK03,16),(CTA2LK04,16)                              69600002
         DSGEN (CTA2LK05,16),(CTA2LK08,16)                              69660002
         DSGEN (CTA2LK09,16),(CTA2LK11,16)                              69720002
         DSGEN (CTA2LK12,16),(CTA2LK13,16)                              69780002
         DSGEN (CTA2LK18,16),(CTA2LK19,16)                              69840002
         DSGEN (CTA2LK20,16),(CTA2LK21,16)                              69900002
         DSGEN (CTA2LK24,16),(CTA2LK25,16)                              69960002
         DSGEN (CTA2LK26,16),(CTA2LK27,16)                              70020002
         DSGEN (CTA2LL34,16),(CTA2LL41,16)                              70080002
         DSGEN (CTA2LL43,16),(CTA2LL44,16)                              70140002
         DSGEN (CTA2LL45,16),(CTA4LK25,16)                              70200002
         DSGEN (CTA4LK26,16),(CTA4LK27,16)                              70260002
         DSGEN (CTA4LK28,16),(CTA5LK00,16)                              70320002
         DSGEN (CTA5LK01,16),(CTA5LK02,16)                              70380002
         DSGEN (CTA5LK03,16),(CTA5LK04,16)                              70440002
         DSGEN (CTA5LK05,16),(CTA5LK08,16)                              70500002
         DSGEN (CTA5LK09,16),(CTA5LK10,16)                              70560002
         DSGEN (CTA5LK11,16),(CTA5LK12,16)                              70620002
         DSGEN (CTA5LK13,16),(CTA5LK16,16)                              70680002
         DSGEN (CTA5LK18,16),(CTA5LK19,16)                              70740002
         DSGEN (CTA5LK20,16),(CTA5LK21,16)                              70800002
         DSGEN (CTA5LK24,16),(CTA5LK25,16)                              70860002
         DSGEN (CTA5LK26,16),(CTA5LK27,16)                              70920002
         DSGEN (CTA5LK28,16),(CTA5LL32,16)                              70980002
         DSGEN (CTA5LL33,16),(CTA5LL34,16)                              71040002
         DSGEN (CTA5LL35,16),(CTA5LL36,16)                              71100002
         DSGEN (CTA5LL37,16),(CTA5LL40,16)                              71160002
         DSGEN (CTA5LL41,16),(CTA5LL42,16)                              71220002
         DSGEN (CTA5LL43,16),(CTA5LL44,16)                              71280002
         DSGEN (CTA5LL45,16),(CTA5LL48,16)                              71340002
         DSGEN (CTA5LL49,16),(CTA5LL50,16)                              71400002
         DSGEN (CTA5LL51,16),(CTA5LL52,16)                              71460002
         DSGEN (CTA5LL53,16),(CTA5LL56,16)                              71520002
         DSGEN (CTA6LL32,16),(CTA6LL33,16)                              71580002
         DSGEN (CTA6LL34,16),(CTA6LL35,16)                              71640002
         DSGEN (CTA6LL40,16),(CTA6LL41,16)                              71700002
         DSGEN (CTA6LL42,16),(CTA6LL44,16)                              71760002
         DSGEN (CTA6LL45,16)                                            71790002
         DSGEN (CTA6LL49,16),(CTA6LL50,16)                              71820002
         DSGEN (CTA6LL51,16),(CTA6LL53,16)                              71880002
         DSGEN (CTA6LL56,16),(CTA6LL57,16)                              71940002
         DSGEN (CTB1LK09,16),(CTB1LK10,16),(CTB1LK11,16)                71970002
         DSGEN (CTB3LK00,16),(CTB3LK01,16)                              72000002
         DSGEN (CTB3LK02,16),(CTB3LK03,16)                              72060002
         DSGEN (CTB3LK04,16),(CTB3LK05,16)                              72120002
         DSGEN (CTB3LK08,16),(CTB3LK09,16)                              72180002
         DSGEN (CTB3LK10,16),(CTB3LK11,16)                              72240002
         DSGEN (CTB5LK12,16),(CTB5LK13,16)                              72360002
         DSGEN (CTB6LK13,16),(CTB6LK18,16)                     @YA07735 72370002
         DSGEN (CTB6LK19,16),(CTB6LK20,16)                     @YA07735 72380002
         DSGEN (NEWVER,16)                                              72390002
         DSGEN (CTC0LK00,16),(CTC0LK01,16)                              72420002
         DSGEN (CTC0LK02,16),(CTC0LK03,16)                              72480002
         DSGEN (CTC0LK04,16),(CTC0LK05,16)                              72540002
         DSGEN (CTC0LK08,16),(CTC0LK09,16)                              72600002
         DSGEN (CTC0LK29,16),(CTC0LL32,16)                              72660002
         DSGEN (CTC0LL33,16),(CTC0LL34,16)                              72720002
         DSGEN (CTC0LL35,16),(CTC0LL36,16)                              72780002
         DSGEN (CTC0LL41,16)                                            72840002
         DSGEN (CTC1LK09,16)     (C1LK10 DELETED)              @ZA34990 72900000
         DSGEN (CTC1LK11,16),(CTC1LK12,16)                              72960002
         DSGEN (CTC1LK20,16),(CTC1LK21,16)                              73020002
         DSGEN (CTC1LK24,16),(CTC1LK25,16)                              73080002
         DSGEN (CTC1LL41,16),(CTC1LL42,16)                              73140002
         DSGEN (CTC1LL43,16),(CTC1LL44,16)                              73200002
         DSGEN (CTC1LL45,16)     (C1LL52 DELETED)              @ZA34990 73260000
         DSGEN (CTC1LL53,16),(CTC1LL56,16)                              73320002
         DSGEN (CTC1LL57,16)                                            73380002
YDUM1    EQU   *                                                        73440002
IFCS0165 CSECT                                                          73500002
         DROP  R2                                                       73560002
         USING YYYA,R2                                                  73620002
*********                                                               73680002
*                                                                       73740002
* SPECIAL ROUTINES                                                      73800002
M2       EQU   X'01'                                                    73860002
LL2      EQU   2                                                        73920002
CONVERT  STM   R5,R8,XSAVE              SAVE REGS                       73980002
         LH    R5,L0(R4)                PICK UP COUNT                   74040002
CONV1    CVD   R5,WORK                  CONVERT IT TO DEVIMALP          74100002
         UNPK  L0(L3,R3),WORK+L5(L3)    UNPACK IT TO PRINT BUFF         74160002
         MVZ   L2(L1,R3),L0(R3)         PUT ON PRINTABLE ZONE           74220002
RETURNA  LM    R5,R8,XSAVE              RESTORE REGS                    74280002
         BR    R14                                                      74340002
CHKEMU   ST    R5,RSAVE                                        @YA07735 74340302
         TM    L0(R4),C1           165R/168?                   @YA07735 74340602
         BZR   R14                 BRANCH IF NO                @YA07735 74340902
         TM    L0(R4),C10           7094 EMULATOR?             @YA07735 74341202
         BOR   R14                 BRANCH IF YES               @YA07735 74341502
         TM    L0(R4),C08          7080 EMULATOR?              @YA07735 74341802
         BNO   T7074               BRANCH IF NO                @YA07735 74342102
         L     R5,A7080            SET LINE AND LABEL          @YA07735 74342402
         ST    R5,YR9PTR           POINTERS FOR 7080           @YA07735 74342702
         L     R5,B7080                                        @YA07735 74343002
         ST    R5,YLABELP                                      @YA07735 74343302
         B     RETURN9                                         @YA07735 74343602
T7074    TM    L0(R4),C04          7074 EMULATOR?              @YA07735 74343902
         BNO   JUMP1               BRANCH IF NO                @YA07735 74344202
         L     R5,A7074            SET LINE AND LABEL          @YA07735 74344502
         ST    R5,YR9PTR           POINTERS FOR 7074           @YA07735 74344802
         L     R5,B7074                                        @YA07735 74345102
         ST    R5,YLABELP                                      @YA07735 74345402
         B     RETURN9                                         @YA07735 74345702
JUMP     ST    R5,RSAVE                                        @YA07735 74346002
         TM    NEWVER,C1           165R/168?                   @YA07735 74346302
         BZR   R14                 BRANCH IF NO                @YA07735 74346602
JUMP1    L     R5,AJUMP            SKIP EMULATOR PRINTOUTS     @YA07735 74346902
         ST    R5,YR9PTR                                       @YA07735 74347202
         L     R5,BJUMP                                        @YA07735 74347502
         ST    R5,YLABELP                                      @YA07735 74347802
RETURN9  L     R5,RSAVE                                        @YA07735 74348102
         BR    R14                                             @YA07735 74348402
*                                                                       74400002
SKIPPER  BR    R14                      RETURN                          74460002
*                                                                       74520002
SETDATE  UNPK  WORK(L8),L0(L4,R4)       PACK DATE                       74580002
         MVZ   WORK+L7(L1),WORK         MOVE ON ZONE                    74640002
         MVC   L0(L3,R3),WORK+L5        MOVE DATE TO PRINT LINE         74700002
         MVC   L5(L2,R3),WORK+L3        MOVE YEAR TO PRINT LINE         74760002
         BR    R14                                                      74820002
TESTMOD  STM   R6,R7,RSAVE              SAVE REGS                       74880002
         TM    NEWVER,C1                Q/IS IT NEW VER                 74940002
         BO    BEXIT                    YES-BR                          75000002
         BR    R14                      RETURN                          75060002
BEXIT    LA    R6,C0LINE-4              SET                             75120002
         LA    R7,C0LAB-1                TO                             75180002
         ST    R6,YR9PTR                  GO TO                         75240002
         ST    R7,YLABELP                  C0 PRINT                     75300002
         LM    R6,R7,RSAVE              RESTORE REGS                    75360002
         BR    R14                      RETURN                          75420002
RSAVE    DS    2F                                                       75480002
M168     DC    X'0168'                                                  75540002
MODCHK   STM   R6,R7,RSAVE              SAVE REGS                       75542002
         CLC   YCPU(L2),M168            Q/ IS THIS A 168                75544002
         BE    EXIT8                    YES-BR                          75546002
         BR    R14                      RETURN                          75548002
EXIT8    LA    R6,LIN168-L4            SET TO                           75550002
         L     R7,LAB1                                                  75552002
         ST    R6,YR9PTR                    TO                          75554002
         ST    R7,YLABELP                    168 PRINT                  75556002
         LM    R6,R7,RSAVE              RESTORE REGS                    75558002
         BR    R14                      RETURN                          75560002
C1BR     STM   R6,R7,RSAVE              SAVE REGS                       75562002
         LA    R6,C1LINE-L4             SET TO                          75564002
         L     R7,LAB2                                                  75566002
         ST    R6,YR9PTR                    TO                          75568002
         ST    R7,YLABELP                     C1 PRINT                  75570002
         LM    R6,R7,RSAVE              RESTIRE REGS                    75572002
         SR    R15,R15                  CLEAR 15                        75574002
         BR    R14                      RETURN                          75576002
LAB1     DC    A(LAB168-1)                                              75578002
LAB2     DC    A(C1LAB-1)                                               75580002
A7074    DC    A(LN7074-4)                                     @YA07735 75582002
B7074    DC    A(LB7074-1)                                     @YA07735 75584002
A7080    DC    A(LN7080-4)                                     @YA07735 75586002
B7080    DC    A(LB7080-1)                                     @YA07735 75588002
AJUMP    DC    A(LNJUMP-4)                                     @YA07735 75590002
BJUMP    DC    A(LBJUMP-1)                                     @YA07735 75592002
C10      EQU   X'10'                                           @YA07735 75594002
C08      EQU   X'08'                                           @YA07735 75596002
C04      EQU   X'04'                                           @YA07735 75598002
*                                                                       75600002
*        FREEE COUNTERS AREA LAST THING DONE                            75660002
*                                                                       75720002
FREECTR  STM   R14,R12,L12(R13)         SAVE ALL REGS                   75780002
         LR    R12,R13                  SAVE SAVE AREA ADDR             75840002
         LA    R13,FSAVE                POINT TO MY SAVE                75900002
         ST    R12,L4(R13)              SET CHAINING POINTERS           75960002
         ST    R13,L8(R12)                                              76020002
         L     R3,L4(R2)                PICK UP POINTER TO NEXT COUNTER 76080002
         ST    R3,L28(R12)              SAVE POINTER IN REG SAVE        76140002
         LH    R0,SIZE                  PICK UP SIZE OF AREA            76200002
         LR    R1,R2                    SET ADDRESS                     76260002
         FREEMAIN R,LV=(0),A=(1)                                        76320002
         LTR   R3,R3                    ANY MORE COUNTERS               76380002
         BZ    RETURN0                  NO  RETURN                      76440002
         LA    R5,PENTRY+L10            POINT TO TOP ENTRY - 4          76500002
         ST    R5,YR9PTR                                                76560002
         LA    R5,LABELS-L1               POINT TO FIRST LABEL - 1      76620002
         ST    R5,YLABELP               STORE IT IN TABLE               76680002
RETURN0  L    R13,L4(R13)               PICK UP &                       76740002
         LM    R14,R12,L12(R13)         RESTOR E REGS                   76800002
         BR    R14                                                      76860002
         LTORG                                                          76890000
*                                                                       76920002
HEX02    EQU   X'02'                                                    76980002
L14      EQU   14                                                       77040002
L28      EQU   28                                                       77100002
*                                                                       77160002
WORK     DS    D                                                        77220002
FSAVE    DS    18F                                                      77280002
XSAVE    DS    4F                                                       77340002
SIZE     DC    H'334'                                          @YA07735 77400002
PENTRY   DS    0F                                                       77460002
         DC    X'00010001'                                              77520002
         DC    X'00010001'                                              77580002
         DC    A(LABELS)                                                77640002
         DC    H'0'                                                     77700002
*              *****     EDIT ENTRIES AREA     *****                    77760002
         DC    X'01'                                                    77820002
         DC    X'000B8B00'                                              77880002
         LABEL ' '                                                      77940002
         LINE  ,(23,1)                                                  78000002
         ROUTINE    YDUM1,SKIPPER                                       78060002
         LABEL 'DAY YEAR   DAY YEAR'                                    78120002
         LINE  (23,11),(12,19),SKIP=2                             P0415 78180002
         ROUTINE    YLOWD,SETDATE                                       78240002
         ROUTINE    YHID,SETDATE                                        78300002
         LABEL 'DATE RANGE-','TO'                                       78360002
         LINE  (21,1),(12,11),SKIP=2                           @ZM43110 78420002
         HEX   YCPU                                                     78480002
         LABEL 'MODEL ','MACHINE CHECK SUMMARY'                         78540002
         LINE  (23,1),(12,1)                                            78600002
         HEX        YSER,0,3B                                    S21021 78660002
         LABEL      'SERIAL NO'                                  S21021 78720002
         LINE  (38,1),(12,1),SKIP=2                               P0415 78780002
         ROUTINE    YNOREC,CONVERT                                P0415 78840002
         LABEL 'TOTAL NUMBER OF RECORDS'                          P0415 78900002
         LINE  ,(19,1),SKIP=1                                           78960002
         ROUTINE    YCPU,TESTMOD                                        78990002
         LABEL 'M/F FRAME A1 STORAGE STATUS'                            79020002
         LINE  (22,26),(1,26)                                           79080002
         ROUTINE    CTA1LK00,CONVERT                                    79140002
         ROUTINE    CTA1LK01,CONVERT                                    79200002
         ROUTINE    CTA1LK08,CONVERT                                    79260002
         ROUTINE    CTA1LK10,CONVERT                                    79320002
         LABEL 'RIPPLE CE','RIPPLE UE','ECC CHK CE','ECC CHK UE'        79380002
         LINE  (22,26),(1,26)                                           79440002
         ROUTINE    CTA1LK12,CONVERT                                    79500002
         ROUTINE    CTA1LK20,CONVERT                                    79560002
         ROUTINE    CTA1LK24,CONVERT                                    79620002
         ROUTINE    CTA1LK26,CONVERT                                    79680002
         LABEL 'S/S CHK','STG CHK SDB1','STG CHK MRK','STG CHK ADR'     79740002
         LINE  (22,26),(1,26)                                           79800002
         ROUTINE    CTA1LL43,CONVERT                                    79860002
         ROUTINE    CTA1LL45,CONVERT                                    79920002
         LABEL 'STG CHK','UNRETRY STG CHK'                              79980002
         LINE  ,(19,1)                                                  80040002
         LABEL 'M/F FRAME A2 STORAGE CONTROL UNIT'                      80100002
         LINE  (22,26),(1,26)                                           80160002
         ROUTINE    CTA2LK01,CONVERT                                    80220002
         ROUTINE    CTA2LK02,CONVERT                                    80280002
         ROUTINE    CTA2LK03,CONVERT                                    80340002
         ROUTINE    CTA2LK04,CONVERT                                    80400002
         LABEL 'SCU INKEY','SCU SNK','SCU STG ADR','SCU STG ADR 8-15'   80460002
         ROUTINE    CTA2LK05,CONVERT                                    80520002
         LINE  (22,26),(1,26)                                           80580002
         ROUTINE    CTA2LK08,CONVERT                                    80640002
         ROUTINE    CTA2LK08,CONVERT                                    80700002
         ROUTINE    CTA2LK09,CONVERT                                    80760002
         ROUTINE    CTA2LK11,CONVERT                                    80820002
         LABEL 'SCU STG ADR 16-23','SCU STG ADR 24-28','INKEY CHK','BFRX80880002
               CTL SCU ADR'                                             80940002
         LINE  (22,26),(1,26)                                           81000002
         ROUTINE    CTA2LK12,CONVERT                                    81060002
         ROUTINE    CTA2LK13,CONVERT                                    81120002
         ROUTINE    CTA2LK18,CONVERT                                    81180002
         ROUTINE    CTA2LK19,CONVERT                                    81240002
         LABEL 'BFR CTL C40 ADR','BFR CTL C40 MRK','BFR DBO BYTE 0','BFX81300002
               R DBO BYTE 1'                                            81360002
         LINE  (22,26),(1,26)                                           81420002
         ROUTINE    CTA2LK20,CONVERT                                    81480002
         ROUTINE    CTA2LK21,CONVERT                                    81540002
         ROUTINE    CTA2LK24,CONVERT                                    81600002
         ROUTINE    CTA2LK25,CONVERT                                    81660002
         LABEL 'BFR DBO BYTE 2','BFR DBO BYTE 3','BFR DBO BYTE 4','BFR X81720002
               DBO BYTE 5'                                              81780002
         LINE  (22,26),(1,26)                                           81840002
         ROUTINE    CTA2LK26,CONVERT                                    81900002
         ROUTINE    CTA2LK27,CONVERT                                    81960002
         ROUTINE    CTA2LL34,CONVERT                                    82020002
         ROUTINE    CTA2LL41,CONVERT                                    82080002
         LABEL 'BFR DBO BYTE 6','BFR DBO BYTE 7','HANG DETECT','OUTKEY X82140002
               CHK'                                                     82200002
         LINE  (22,26),(1,26)                                           82260002
         ROUTINE    CTA2LL43,CONVERT                                    82320002
         ROUTINE    CTA2LL44,CONVERT                                    82380002
         ROUTINE    CTA2LL45,CONVERT                                    82440002
         LABEL 'BFR ARY BLK CMPR','BFR ARY MPLE CMPR','BFR ARY RPLCE ARX82500002
               Y'                                                       82560002
         LINE  ,(19,1)                                                  82620002
         LABEL 'M/F FRAME A4 CONTROL STORAGE'                           82680002
         LINE  (22,26),(1,26)                                           82740002
         ROUTINE    CTA4LK25,CONVERT                                    82800002
         ROUTINE    CTA4LK26,CONVERT                                    82860002
         ROUTINE    CTA4LK27,CONVERT                                    82920002
         ROUTINE    CTA4LK28,CONVERT                                    82980002
         LABEL 'CTL STG INVLD WD','CTL STG PTY 0-35','CTL STG PTY 36-71X83040002
               ','CTL STG PTY 72-107'                                   83100002
         LINE  ,(19,1)                                                  83160002
         LABEL 'M/F FRAME A5 ADDERS AND CHECKS'                         83220002
         LINE  (22,26),(1,26)                                           83280002
         ROUTINE    CTA5LK00,CONVERT                                    83340002
         ROUTINE    CTA5LK01,CONVERT                                    83400002
         ROUTINE    CTA5LK02,CONVERT                                    83460002
         ROUTINE    CTA5LK03,CONVERT                                    83520002
         LABEL 'PAR ADDR HS BYTE 0','PAR ADDR HS BYTE 1','PAR ADDR HS BX83580002
               YTE 2','PAR ADDR HS BYTE 3'                              83640002
         LINE  (22,26),(1,26)                                           83700002
         ROUTINE    CTA5LK04,CONVERT                                    83760002
         ROUTINE    CTA5LK05,CONVERT                                    83820002
         ROUTINE    CTA5LK08,CONVERT                                    83880002
         ROUTINE    CTA5LK09,CONVERT                                    83940002
         LABEL 'PAR ADDR HS BYTE 4','PAR ADDR HS BYTE 5','PAR ADDR HS BX84000002
               YTE 6','PAR ADDR HS BYTE 7'                              84060002
         LINE  (22,26),(1,26)                                           84120002
         ROUTINE    CTA5LK10,CONVERT                                    84180002
         ROUTINE    CTA5LK11,CONVERT                                    84240002
         ROUTINE    CTA5LK12,CONVERT                                    84300002
         ROUTINE    CTA5LK13,CONVERT                                    84360002
         LABEL 'PAR ADDR HS WD','E REG BYTE 0','E REG BYTE 1','SER ADDRX84420002
                HS'                                                     84480002
         LINE  (22,26),(1,26)                                           84540002
         ROUTINE    CTA5LK16,CONVERT                                    84600002
         ROUTINE    CTA5LK18,CONVERT                                    84660002
         ROUTINE    CTA5LK19,CONVERT                                    84720002
         ROUTINE    CTA5LK20,CONVERT                                    84780002
         LABEL 'SER ADDR FS','BYTES 0+4','BYTES 1+5','BYTES 2+6'        84840002
         LINE  (22,26),(1,26)                                           84900002
         ROUTINE    CTA5LK21,CONVERT                                    84960002
         ROUTINE    CTA5LK24,CONVERT                                    85020002
         ROUTINE    CTA5LK25,CONVERT                                    85080002
         ROUTINE    CTA5LK26,CONVERT                                    85140002
         LABEL 'BYTE 3','ENTER ERR','CTL STG INVLD WD','CTL STG PTY 0-3X85200002
               5'                                                       85260002
         LINE  (22,26),(1,26)                                           85320002
         ROUTINE    CTA5LK27,CONVERT                                    85380002
         ROUTINE    CTA5LK28,CONVERT                                    85440002
         ROUTINE    CTA5LL32,CONVERT                                    85500002
         ROUTINE    CTA5LL33,CONVERT                                    85560002
         LABEL 'CTL STG PTY 36-71','CTL STG PTY 72-107','PAR ADDR FS BYX85620002
               TE 0','PAR ADDR FS BYTE 1'                               85680002
         LINE  (22,26),(1,26)                                           85740002
         ROUTINE    CTA5LL34,CONVERT                                    85800002
         ROUTINE    CTA5LL35,CONVERT                                    85860002
         ROUTINE    CTA5LL36,CONVERT                                    85920002
         ROUTINE    CTA5LL37,CONVERT                                    85980002
         LABEL 'PAR ADDR FS BYTE 2','PAR ADDR FS BYTE 3','PAR ADDR FS BX86040002
               YTE 4','PAR ADDR FS BYTE 5'                              86100002
         LINE  (22,26),(1,26)                                           86160002
         ROUTINE    CTA5LL40,CONVERT                                    86220002
         ROUTINE    CTA5LL41,CONVERT                                    86280002
         ROUTINE    CTA5LL42,CONVERT                                    86340002
         ROUTINE    CTA5LL43,CONVERT                                    86400002
         LABEL 'PAR ADDR FS BYTE 6','PAR ADDR FS BYTE 7','PAR ADDR CARRX86460002
               Y','SHFTR OUT BYTE 0'                                    86520002
         LINE  (22,26),(1,26)                                           86580002
         ROUTINE    CTA5LL44,CONVERT                                    86640002
         ROUTINE    CTA5LL45,CONVERT                                    86700002
         ROUTINE    CTA5LL48,CONVERT                                    86760002
         ROUTINE    CTA5LL49,CONVERT                                    86820002
         LABEL 'SHFTR OUT BYTE 1','SHFTR OUT BYTE 2','SHFTR OUT BYTE 3'X86880002
               ,'SHFTR OUT BYTE 4'                                      86940002
         LINE  (22,26),(1,26)                                           87000002
         ROUTINE    CTA5LL50,CONVERT                                    87060002
         ROUTINE    CTA5LL51,CONVERT                                    87120002
         ROUTINE    CTA5LL52,CONVERT                                    87180002
         ROUTINE    CTA5LL53,CONVERT                                    87240002
         LABEL 'SHFTR OUT BYTE 5','SHFTR OUT BYTE 6','SHFTR OUT BYTE 7'X87300002
               ,'SHFTR INPUT'                                           87360002
         LINE  (22,26),(1,26)                                           87420002
         ROUTINE    CTA5LL56,CONVERT                                    87480002
         LABEL 'SHFTR CTL'                                              87540002
         LINE  ,(19,1)                                                  87600002
         LABEL 'M/F FRAME A6 I-UNIT AND 74/94 EMUL'                     87660002
         LINE  (22,26),(1,26)                                           87720002
         ROUTINE    CTA6LL32,CONVERT                                    87780002
         ROUTINE    CTA6LL33,CONVERT                                    87840002
         ROUTINE    CTA6LL34,CONVERT                                    87900002
         ROUTINE    CTA6LL35,CONVERT                                    87960002
         LABEL 'INST REG 0-7','INST REG 8-15','INST REG 16-23','INST REX88020002
               G 24-31'                                                 88080002
         LINE  (22,26),(1,26)                                           88140002
         ROUTINE    CTA6LL40,CONVERT                                    88200002
         ROUTINE    CTA6LL41,CONVERT                                    88260002
         ROUTINE    CTA6LL42,CONVERT                                    88320002
         ROUTINE    CTA6LL44,CONVERT                                    88380002
         LABEL 'ADR INCR LTH 8-15','ADR INCR LTH 16-23','ADR INCR LTH 2X88440002
               4-31','DIF CHK'                                          88500002
         LINE  (22,26),(1,26)                                           88560002
         ROUTINE    CTA6LL49,CONVERT                                    88620002
         ROUTINE    CTA6LL50,CONVERT                                    88680002
         ROUTINE    CTA6LL51,CONVERT                                    88740002
         ROUTINE    CTA6LL53,CONVERT                                    88800002
         LABEL 'ADR ADDR HS 8-15','ADR ADDR HS 16-23','ADR ADDR HS 24-3X88860002
               1','ADR ADDR FS 8-15'                                    88920002
         LINE  (22,26),(1,26)                                           88980002
         ROUTINE    CTA6LL56,CONVERT                                    89040002
         ROUTINE    CTA6LL57,CONVERT                                    89100002
         LABEL 'ADR ADDR FS 16-23','ADR ADDR FS 24-31'                  89160002
         LINE  ,(19,1)                                                  89220002
         LABEL 'M/F FRAME B3 HSM AND/OR EXTD CHN'                       89280002
         LINE  (22,26),(1,26)                                           89340002
         ROUTINE    CTB3LK00,CONVERT                                    89400002
         ROUTINE    CTB3LK01,CONVERT                                    89460002
         ROUTINE    CTB3LK02,CONVERT                                    89520002
         ROUTINE    CTB3LK03,CONVERT                                    89580002
         LABEL 'RESIDUE CHK','PTY MPLR CHK','PTY MPCD CHK','RSDUE CTL CX89640002
               HK MPCD'                                                 89700002
         LINE  (22,26),(1,26)                                           89760002
         ROUTINE    CTB3LK04,CONVERT                                    89820002
         ROUTINE    CTB3LK05,CONVERT                                    89880002
         ROUTINE    CTB3LK08,CONVERT                                    89940002
         ROUTINE    CTB3LK09,CONVERT                                    90000002
         LABEL 'RSDUE CTL CHK SUM','RSDUE CTL CHK CARRY','RSDUE CTL CHKX90010002
                MPLR','RSDUE CTL CHK SPAR'                              90020002
         LINE  (22,26),(1,26)                                           90030002
         ROUTINE    CTB3LK10,CONVERT                                    90040002
         ROUTINE    CTB3LK11,CONVERT                                    90050002
         LABEL 'RSD CTL CK CMPT RSLT','RSD CTL CK ACTL RSLT'            90060002
         LINE  ,(19,1)                                                  90070002
         LABEL ' '                                                      90080002
         LINE  ,(19,1)                                                  90090002
         LABEL 'M/F FRAME B5 7094 EMULATOR FEATURE'                     90100002
         LINE  (22,26),(1,26)                                           90110002
         ROUTINE    CTB5LK12,CONVERT                                    90120002
         ROUTINE    CTB5LK13,CONVERT                                    90130002
         LABEL 'TSLTR INPUT','WCS 108-125'                              90140002
         LINE  ,(19,1)                                         @YA07735 90140602
         LABEL 'M/F FRAME B6  7080 EMULATOR FEATURE'           @YA07735 90141202
         LINE  (22,26),(1,26)                                  @YA07735 90141802
         ROUTINE CTB6LK18,CONVERT                              @YA07735 90142402
         ROUTINE CTB6LK19,CONVERT                              @YA07735 90143002
         ROUTINE CTB6LK20,CONVERT                              @YA07735 90143602
         LABEL 'WCS 108-125','A SIDE ERR','B SIDE ERR'         @YA07735 90144202
         LINE   ,                                              @YA07735 90144802
         ROUTINE NEWVER,JUMP                                   @YA07735 90145402
         LABEL '  '                                            @YA07735 90146002
         LINE  ,(19,1)                                         @YA07735 90146602
         LABEL 'M/F FRAME B6  7074 EMULATOR FEATURE'           @YA07735 90147202
         LINE  (22,26),(1,26)                                  @YA07735 90147802
         ROUTINE CTB6LK13,CONVERT                              @YA07735 90148402
         LABEL 'WCS ERROR'                                     @YA07735 90149002
         LINE                                                           90150002
         ROUTINE    YDUM1,FREECTR                                       90160002
         LABEL ' '                                                      90170002
         DC    X'FF'                                                    90180002
         DC    XL6'00'                                                  90190002
         DC    C'$'                                                     90200002
         LINE  (23,25),(2,25)                                           90210002
         LABEL ' '                                                      90220002
C0LINE   LINE  ,(19,1)                                                  90230002
C0LAB    LABEL 'M/F FRAME A1 STORAGE STATUS'                            90240002
         LINE  (22,26),(1,26)                                           90250002
         ROUTINE    CTA1LK04,CONVERT                                    90260002
         ROUTINE    CTA1LK08,CONVERT                                    90270002
         ROUTINE    CTA1LK10,CONVERT                                    90280002
         ROUTINE    CTA1LK12,CONVERT                                    90290002
         LABEL 'SP MACH CK','ECC CHK CE','ECC CHK UE','S/S CHK'         90300002
         LINE  (22,26),(1,26)                                           90310002
         ROUTINE    CTA1LK16,CONVERT                                    90320002
         ROUTINE    CTA1LK17,CONVERT                                    90330002
         ROUTINE    CTA1LK18,CONVERT                                    90340002
         ROUTINE    CTA1LK20,CONVERT                                    90350002
         LABEL 'S/S ADV LOST CHK','S/S SYNC CHK','S/S OVERRUN CHK','STGC90360002
                CHK SDBI'                                               90365002
         LINE  (22,26),(1,26)                                           90370002
         ROUTINE    CTA1LK24,CONVERT                                    90380002
         ROUTINE    CTA1LK26,CONVERT                                    90390002
         ROUTINE    CTA1LL43,CONVERT                                    90393002
         ROUTINE    CTA1LL45,CONVERT                                    90396002
         LABEL 'STG CHKMRK','STG CHK ADR','STG CHK','UNRETRY STG CHK'   90400002
         LINE  (22,26),(1,26)                                           90410002
         ROUTINE    CTA1LL50,CONVERT                                    90412002
         LABEL 'MULT SEG CMPR'                                          90414002
         LINE  (22,26),(19,1)                                           90416002
         LABEL 'M/F FRAME A2 STORAGE CONTROL UNIT'                      90420002
         LINE  (22,26),(1,26)                                           90430002
         ROUTINE    CTA2LK02,CONVERT                                    90440002
         ROUTINE    CTA2LK03,CONVERT                                    90450002
         ROUTINE    CTA2LK04,CONVERT                                    90460002
         ROUTINE    CTA2LK05,CONVERT                                    90470002
         LABEL 'SCU SNK','SCU STG ADR','SCU STG ADR 8-15','SCU STG ADR C90480002
               16-23'                                                   90490002
         LINE  (22,26),(1,26)                                           90500002
         ROUTINE    CTA2LK08,CONVERT                                    90510002
         ROUTINE    CTA2LK11,CONVERT                                    90520002
         ROUTINE    CTA2LK12,CONVERT                                    90530002
         ROUTINE    CTA2LK13,CONVERT                                    90540002
         LABEL 'SCU STG ADR 24-28','BFR CTL SCU ADDR','BFR CTL C40 ADR'C90550002
               ,'BFR CTL C40 MARK'                                      90560002
         LINE  (22,26),(1,26)                                           90570002
         ROUTINE    CTA2LK18,CONVERT                                    90580002
         ROUTINE    CTA2LK19,CONVERT                                    90590002
         ROUTINE    CTA2LK20,CONVERT                                    90600002
         ROUTINE    CTA2LK21,CONVERT                                    90610002
         LABEL 'BDBO CHK TGR BYTE 0','BDBO CHK TGR BYTE 1','BDBO CHK TGC90620002
               R BYTE 2','BDBO CHK TGR BYTE 3'                          90630002
         LINE  (22,26),(1,26)                                           90640002
         ROUTINE    CTA2LK24,CONVERT                                    90650002
         ROUTINE    CTA2LK25,CONVERT                                    90660002
         ROUTINE    CTA2LK26,CONVERT                                    90670002
         ROUTINE    CTA2LK27,CONVERT                                    90680002
         LABEL 'BDBO CHK TGR BYTE 4','BDBO CHK TGR BYTE 5','BDBO CHK TGC90690002
               R BYTE 6','BDBO CHK TGR BYTE 7'                          90700002
         LINE  (22,26),(1,26)                                           90710002
         ROUTINE    CTA2LL34,CONVERT                                    90720002
         ROUTINE    CTA2LL43,CONVERT                                    90730002
         ROUTINE    CTA2LL44,CONVERT                                    90740002
         ROUTINE    CTA2LL45,CONVERT                                    90750002
         LABEL 'HANG DETECT','BFR ARY BLK CMPR','BFR ARY MPLE CMPR','BFC90760002
               R ARY RPLCE ARY'                                         90770002
         LINE  (22,26),(19,1)                                           90780002
         LABEL 'M/F FRAME A4 CONTROL STORAGE'                           90790002
         LINE  (22,26),(1,26)                                           90800002
         ROUTINE    CTA4LK25,CONVERT                                    90810002
         ROUTINE    CTA4LK26,CONVERT                                    90820002
         ROUTINE    CTA4LK27,CONVERT                                    90830002
         ROUTINE    CTA4LK28,CONVERT                                    90840002
         LABEL 'CTL STG INVLD WD','CTL STG PTY 0-35','CTL STG PTY 36-71C90850002
               ','CTL STG PTY 72-107'                                   90860002
         LINE  (22,26),(19,1)                                           90870002
         LABEL 'M/F FRAME A5 ADDERS AND CHECKS'                         90880002
         LINE  (22,26),(1,26)                                           90890002
         ROUTINE    CTA5LK00,CONVERT                                    90900002
         ROUTINE    CTA5LK01,CONVERT                                    90910002
         ROUTINE    CTA5LK02,CONVERT                                    90920002
         ROUTINE    CTA5LK03,CONVERT                                    90930002
         LABEL 'PAR ADDR HS BYTE 0','PAR ADDR HS BYTE 1','PAR ADDR HS BC90940002
               YTE 2','PAR ADDR HS BYTE 3'                              90950002
         LINE  (22,26),(1,26)                                           90960002
         ROUTINE    CTA5LK04,CONVERT                                    90970002
         ROUTINE    CTA5LK05,CONVERT                                    90980002
         ROUTINE    CTA5LK08,CONVERT                                    90990002
         ROUTINE    CTA5LK09,CONVERT                                    91000002
         LABEL 'PAR ADDR HS BYTE 4','PAR ADDR HS BYTE 5','PAR ADDR HS BC91010002
               YTE 6','PAR ADDR HS BYTE 7'                              91020002
         LINE  (22,26),(1,26)                                           91030002
         ROUTINE    CTA5LK10,CONVERT                                    91040002
         ROUTINE    CTA5LK11,CONVERT                                    91050002
         ROUTINE    CTA5LK12,CONVERT                                    91060002
         ROUTINE    CTA5LK13,CONVERT                                    91070002
         LABEL 'PAR ADDR HS WD','E REG BYTE 0','E REG BYTE 1','SER ADDRC91080002
                HS'                                                     91090002
         LINE  (22,26),(1,26)                                           91100002
         ROUTINE    CTA5LK16,CONVERT                                    91110002
         ROUTINE    CTA5LK18,CONVERT                                    91120002
         ROUTINE    CTA5LK19,CONVERT                                    91130002
         ROUTINE    CTA5LK20,CONVERT                                    91140002
         LABEL 'SER ADDR FS','TF ADDR CK','TOD CK','CPU TMR CK'         91150002
         LINE  (22,26),(1,26)                                           91160002
         ROUTINE    CTA5LK21,CONVERT                                    91170002
         ROUTINE    CTA5LK24,CONVERT                                    91180002
         ROUTINE    CTA5LK25,CONVERT                                    91190002
         ROUTINE    CTA5LK26,CONVERT                                    91200002
         LABEL 'CMPR CK','ENTER ERR','CTL STG INVLD WD','CTL STG PTY 0-C91210002
               35'                                                      91220002
         LINE  (22,26),(1,26)                                           91230002
         ROUTINE    CTA5LK27,CONVERT                                    91240002
         ROUTINE    CTA5LK28,CONVERT                                    91250002
         ROUTINE    CTA5LL32,CONVERT                                    91260002
         ROUTINE    CTA5LL33,CONVERT                                    91270002
         LABEL 'CTL STG PTY 36-71','CTL STG PTY 72-107','PAR ADDR FS BYC91280002
               TE 0','PAR ADDR FS BYTE 1'                               91290002
         LINE  (22,26),(1,26)                                           91300002
         ROUTINE    CTA5LL34,CONVERT                                    91310002
         ROUTINE    CTA5LL35,CONVERT                                    91320002
         ROUTINE    CTA5LL36,CONVERT                                    91330002
         ROUTINE    CTA5LL37,CONVERT                                    91340002
         LABEL 'PAR ADDR FS BYTE 2','PAR ADDR FS BYTE 3','PAR ADDR FS BC91350002
               YTE 4','PAR ADDR FS BYTE 5'                              91360002
         LINE  (22,26),(1,26)                                           91370002
         ROUTINE    CTA5LL40,CONVERT                                    91380002
         ROUTINE    CTA5LL41,CONVERT                                    91390002
         ROUTINE    CTA5LL42,CONVERT                                    91400002
         ROUTINE    CTA5LL43,CONVERT                                    91410002
         LABEL 'PAR ADDR FS BYTE 6','PAR ADDR FS BYTE 7','PAR ADDR CARRC91420002
               Y','SHFTR OUT BYTE 0'                                    91430002
         LINE  (22,26),(1,26)                                           91440002
         ROUTINE    CTA5LL44,CONVERT                                    91450002
         ROUTINE    CTA5LL45,CONVERT                                    91460002
         ROUTINE    CTA5LL48,CONVERT                                    91470002
         ROUTINE    CTA5LL49,CONVERT                                    91480002
         LABEL 'SHFTR OUT BYTE 1','SHFTR OUT BYTE 2','SHFTR OUT BYTE 3'C91490002
               ,'SHFTR OUT BYTE 4'                                      91500002
         LINE  (22,26),(1,26)                                           91510002
         ROUTINE    CTA5LL50,CONVERT                                    91520002
         ROUTINE    CTA5LL51,CONVERT                                    91530002
         ROUTINE    CTA5LL52,CONVERT                                    91540002
         ROUTINE    CTA5LL53,CONVERT                                    91550002
         LABEL 'SHFTR OUT BYTE 5','SHFTR OUT BYTE 6','SHFTR OUT BYTE 7'C91560002
               ,'SHFTR INPUT'                                           91570002
         LINE  (22,26),(1,26)                                           91580002
         ROUTINE    CTA5LL56,CONVERT                                    91590002
         LABEL 'SHFTR CTL'                                              91600002
         LINE  ,(19,1)                                                  91610002
         LABEL 'M/F FRAME A6 I-UNIT'                                    91620002
         LINE  (22,26),(1,26)                                           91630002
         ROUTINE    CTA6LL32,CONVERT                                    91640002
         ROUTINE    CTA6LL33,CONVERT                                    91650002
         ROUTINE    CTA6LL34,CONVERT                                    91660002
         ROUTINE    CTA6LL35,CONVERT                                    91670002
         LABEL 'INST REG 0-7','INST REG 8-15','INST REG 16-23','INST REC91680002
               G 24-31'                                                 91690002
         LINE  (22,26),(1,26)                                           91700002
         ROUTINE    CTA6LL40,CONVERT                                    91710002
         ROUTINE    CTA6LL41,CONVERT                                    91720002
         ROUTINE    CTA6LL42,CONVERT                                    91730002
         ROUTINE    CTA6LL44,CONVERT                                    91740002
         LABEL 'ADR INCR LTH 8-15','ADR INCR LTH 16-23','ADR INCR LTH 2C91750002
               4-31','DIF A CHK'                                        91760002
         LINE  (22,26),(1,26)                                           91770002
         ROUTINE    CTA6LL45,CONVERT                                    91780002
         ROUTINE    CTA6LL49,CONVERT                                    91790002
         ROUTINE    CTA6LL50,CONVERT                                    91800002
         ROUTINE    CTA6LL51,CONVERT                                    91810002
         LABEL 'DIF B CHK','ADR ADDR HS 8-15','ADR ADDR HS 16-23','ADR C91820002
               ADDR HS 24-31'                                           91830002
         LINE  (22,26),(1,26)                                           91840002
         ROUTINE    CTA6LL53,CONVERT                                    91850002
         ROUTINE    CTA6LL56,CONVERT                                    91860002
         ROUTINE    CTA6LL57,CONVERT                                    91870002
         LABEL 'ADR ADDR FS 8-15','ADR ADDR FS 16-23','ADR ADDR HS 24-3C91880002
               1'                                                       91890002
         LINE  ,(19,1)                                                  91900002
         LABEL 'M/F FRAME B1 CHANNEL AND STORAGE STATUS'                91910002
         LINE  (22,26),(1,26)                                           91920002
         ROUTINE    CTB1LK09,CONVERT                                    91930002
         ROUTINE    CTB1LK10,CONVERT                                    91940002
         ROUTINE    CTB1LK11,CONVERT                                    91950002
         LABEL 'BFR INV LOC PTY CK','BFR INV REM PTY CK','BFR INV OVRUNC91960002
                CK'                                                     91970002
         LINE  ,(19,1)                                                  91980002
         LABEL 'M/F FRAME B3 HSM AND/OR EXTD CHAN'                      91990002
         LINE  (22,26),(1,26)                                           92000002
         ROUTINE    CTB3LK00,CONVERT                                    92010002
         ROUTINE    CTB3LK01,CONVERT                                    92020002
         ROUTINE    CTB3LK02,CONVERT                                    92030002
         ROUTINE    CTB3LK03,CONVERT                                    92040002
         LABEL 'RESIDUE CHK','PTY MPLR CHK','PTY MPCD CHK','RSDUE CTL CC92050002
               HK MPCD'                                                 92060002
         LINE  (22,26),(1,26)                                           92070002
         ROUTINE    CTB3LK04,CONVERT                                    92080002
         ROUTINE    CTB3LK05,CONVERT                                    92090002
         ROUTINE    CTB3LK08,CONVERT                                    92100002
         ROUTINE    CTB3LK09,CONVERT                                    92110002
         LABEL 'RSDUE CTL CHK SUM','RSDUE CTL CHK CARRY','RSDUE CTL CHKC92120002
               MPLR','RSDUE CTL CHK SPAR'                               92130002
         LINE  (22,26),(1,26)                                           92140002
         ROUTINE    CTB3LK11,CONVERT                                    92150002
         LABEL 'RSD CTL CK ACT RSLT'                                    92160002
         LINE  ,(1,1),SKIP=1                                   @YA07735 92162002
         ROUTINE NEWVER,CHKEMU                                 @YA07735 92164002
         LABEL '  '                                            @YA07735 92166002
         LINE  ,(19,1)                                                  92170002
         LABEL 'M/F FRAME B5 7094 EMULATOR FEATURE'                     92180002
         LINE  (22,26),(1,26)                                           92190002
         ROUTINE    CTB5LK12,CONVERT                                    92200002
         ROUTINE    CTB5LK13,CONVERT                                    92210002
         LABEL 'TSLTR INPUT','WCS 108-125'                              92220002
         LINE   ,                                              @YA07735 92220502
         ROUTINE NEWVER,JUMP                                   @YA07735 92221002
         LABEL '  '                                            @YA07735 92221502
LN7080   LINE  ,(19,1)                                         @YA07735 92222002
LB7080   LABEL 'M/F FRAME B6  7080 EMULATOR FEATURE'           @YA07735 92222502
         LINE  (22,26),(1,26)                                  @YA07735 92223002
         ROUTINE CTB6LK18,CONVERT                              @YA07735 92223502
         ROUTINE CTB6LK19,CONVERT                              @YA07735 92224002
         ROUTINE CTB6LK20,CONVERT                              @YA07735 92224502
         LABEL 'WCS 108-125','A SIDE ERR','B SIDE ERR'         @YA07735 92225002
         LINE   ,                                              @YA07735 92225502
         ROUTINE NEWVER,JUMP                                   @YA07735 92226002
         LABEL '  '                                            @YA07735 92226502
LN7074   LINE  ,(19,1)                                         @YA07735 92227002
LB7074   LABEL 'M/F FRAME B6  7074 EMULATOR FEATURE'           @YA07735 92227502
         LINE  (22,26),(1,26)                                  @YA07735 92228002
         ROUTINE CTB6LK13,CONVERT                              @YA07735 92228502
         LABEL 'WCS ERROR'                                     @YA07735 92229002
LNJUMP   LINE  ,(19,1)                                         @YA07735 92230002
LBJUMP   LABEL 'M/F FRAME C0 FLT ADDR REGS AND SPF'            @YA07735 92240002
         LINE  (22,26),(1,26)                                           92250002
         ROUTINE    YCPU,MODCHK                                         92260002
         LABEL ' '                                                      92270002
         LINE                                                           92280002
         ROUTINE    CTC0LK00,CONVERT                                    92290002
         ROUTINE    CTC0LK01,CONVERT                                    92300002
         ROUTINE    CTC0LK02,CONVERT                                    92310002
         ROUTINE    CTC0LK03,CONVERT                                    92320002
         LABEL 'ST PROT CK ADR','ST PROT CK IN-KEY','ST PROT CK INBUF',C92330002
               'ST PROT CK OUT-KEY'                                     92340002
         LINE  (22,26),(1,26)                                           92350002
         ROUTINE    CTC0LK08,CONVERT                                    92360002
         LABEL 'ST PROT CK R/C'                                         92370002
         LINE                                                           92380002
         ROUTINE    YCPU,C1BR                                           92390002
         LABEL ' '                                                      92400002
LIN168   LINE  (22,26),(1,26)                                           92410002
         ROUTINE    CTC0LK01,CONVERT                                    92420002
         ROUTINE    CTC0LK03,CONVERT                                    92430002
         ROUTINE    CTC0LK04,CONVERT                                    92440002
         ROUTINE    CTC0LK05,CONVERT                                    92450002
LAB168   LABEL 'ST PROT CK IN-KEY','ST PROT CK OUT-KEY','ST PROT CK REFC92460002
               ','ST PROT CK CHNG'                                      92470002
         LINE  (22,26),(1,26)                                           92480002
         ROUTINE    CTC0LK29,CONVERT                                    92490002
         LABEL 'SCU PREFIX CK'                                          92500002
C1LINE   LINE  (22,26),(19,1)                                           92510002
C1LAB    LABEL 'M/F FRAME C1 STORAGE STATUS'                            92520002
         LINE  (22,26),(1,26)                                           92540002
         ROUTINE    CTC1LK09,CONVERT                                    92550002
* (UNSUPPORTED ITEM C1LK10 DELETED)                            @ZA34990 92560000
         ROUTINE    CTC1LK11,CONVERT                                    92570000
         ROUTINE    CTC1LK12,CONVERT                                    92580000
         LABEL 'STOK CK BFR','STOK CK STO PTY','STOK CK ID'    @ZA34990 92590000
         LINE  (22,26),(1,26)                                           92610002
         ROUTINE    CTC1LK20,CONVERT                                    92620002
         ROUTINE    CTC1LK21,CONVERT                                    92630002
         ROUTINE    CTC1LK24,CONVERT                                    92640002
         ROUTINE    CTC1LK25,CONVERT                                    92650002
         LABEL 'TIR PTY,CK','TAL HS CK 8-15','TAL HS CK 16-23','TAL AS C92660002
               CK 24-30'                                                92670002
         LINE  (22,26),(1,26)                                           92680002
         ROUTINE    CTC1LL41,CONVERT                                    92690002
         ROUTINE    CTC1LL42,CONVERT                                    92700002
         ROUTINE    CTC1LL43,CONVERT                                    92710002
         ROUTINE    CTC1LL44,CONVERT                                    92720002
         LABEL 'DLAT CK MULTI CMPR','DLAT CK CMPR','DLAT CK INKEY','DLAC92730002
               T CK OUTKEY'                                             92740002
         LINE  (22,26),(1,26)                                           92750002
         ROUTINE    CTC1LL45,CONVERT                                    92760002
* (UNSUPPORTED ITEM C1LL52 DELETED)                            @ZA34990 92770000
         ROUTINE    CTC1LL53,CONVERT                                    92780000
         ROUTINE    CTC1LL56,CONVERT                                    92790000
         LABEL 'DLAT CK RA','TAL FS CK 8-15','TAL FS CK 16-23' @ZA34990 92800000
         LINE  (22,26),(1,26)                                           92820002
         ROUTINE    CTC1LL57,CONVERT                                    92830002
         LABEL 'TAL FS CK 24-30'                                        92840002
         LINE                                                           92850002
         ROUTINE    YDUM1,FREECTR                                       92860002
         LABEL ' '                                                      92870002
         DC    X'FF'                                                    92880002
         DC    XL6'00'                                                  92890002
         DC    C'$'                                                     92900002
LABELS   EQU   *                                                        92910002
         LSTART                                                         92920002
         END                                                            92930002
