         TITLE 'ISTAPC66 FRR FOR APC55,APC59,&& AUTH ENTRY/EXIT        *00001000
                         '                                              00002000
ISTAPC66 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTAPC66  75.310'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @07,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@07                                         0001 00012000
*                                                                  0155 00013000
*   /*****************************************************************/ 00014000
*   /*                                                               */ 00015000
*   /* START OF CODE                                                 */ 00016000
*   /*                                                               */ 00017000
*   /*****************************************************************/ 00018000
*                                                                  0155 00019000
*   REG10=REG14;                    /* SAVE RETURN ADDRESS           */ 00020000
         LR    REG10,REG14                                         0155 00021000
*   SDWAPTR=REG1;                   /* GET SDWA POINTER FROM REG 1   */ 00022000
         LR    SDWAPTR,REG1                                        0156 00023000
*   REG8=REG0;                      /* GET WORK AREA ADDRESS         */ 00024000
*                                                                  0157 00025000
         LR    REG8,REG0                                           0157 00026000
*   /*****************************************************************/ 00027000
*   /*                                                               */ 00028000
*   /* SETFRR TO PROTECT THIS FRR PROCESSING                         */ 00029000
*   /*                                                               */ 00030000
*   /*****************************************************************/ 00031000
*                                                                  0158 00032000
*   RFY                                                            0158 00033000
*    (GPR02P,                                                      0158 00034000
*     GPR03P,                                                      0158 00035000
*     GPR04P) RSTD;                                                0158 00036000
*   DO;                             /* LISATCVT                    0159 00037000
*                                      CVTBASE(PAGEABLE,(GPR02P))    */ 00038000
*     GPR02P=ATCLCPTR;              /* SET UP ATCVT POINTER          */ 00039000
         L     GPR02P,ATCLCPTR                                     0160 00040000
*   END;                            /* LISATCVT                      */ 00041000
*   GPR04P=GPR02P->ATCAP69;         /* ADDR OF NEW FRR               */ 00042000
         L     GPR04P,ATCAP69(,GPR02P)                             0162 00043000
*   GEN REFS(GPR02P,GPR03P,GPR04P,PSACSTK,PSA,FRRSPARM,FRRS,FRRSLAST,   00044000
*       PSALSFCC,FRRSELEN,FRRSCURR,FRRSENTR) SETS(GPR02P,GPR03P,GPR04P, 00045000
*       FRRSCURR,FRRSFRRA,FRRSPARM);                               0163 00046000
       SETFRR A,FRRAD=(GPR04P),PARMAD=(GPR04P),WRKREGS=(GPR02P,GPR03P)  00047000
*   RFY                                                            0164 00048000
*     PARMLIST BASED(GPR04P);                                      0164 00049000
*   DWORD0=FRRID;                   /* SAVE THIS FRR ID              */ 00050000
         MVC   DWORD0(8,GPR04P),@CC02808                           0165 00051000
*   RFY                                                            0166 00052000
*     SDWA BASED(SDWAPTR);                                         0166 00053000
*   RFY                                                            0167 00054000
*     R66M BASED(SDWAPARM);                                        0167 00055000
*   RFY                                                            0168 00056000
*     ISTMPST BASED(R66MPST);                                      0168 00057000
*   RFY                                                            0169 00058000
*     ISTACDEB BASED(DCEDBPTR);                                    0169 00059000
*   RFY                                                            0170 00060000
*     ISTPST BASED(ACDTSKID);                                      0170 00061000
*   RFY                                                            0171 00062000
*     ISTPAB BASED(FRPABA);         /* DEFINE BASE FOR PAB   @ZM31509*/ 00063000
*   RFY                                                            0172 00064000
*     ISTDCE BASED(DCEPTR);                                        0172 00065000
*   RFY                                                            0173 00066000
*     IFGRPL BASED(R66RPL);                                        0173 00067000
*                                                                  0173 00068000
*   /*****************************************************************/ 00069000
*   /*                                                               */ 00070000
*   /* OBTAIN THE LOCAL LOCK                                         */ 00071000
*   /*                                                               */ 00072000
*   /*****************************************************************/ 00073000
*                                                                  0174 00074000
*LOCK66:                                                           0174 00075000
*   DO;                             /* SETLOCK (OBTAIN) MODE(UNCOND)    00076000
*                                      TYPE(LOCAL) RELATED(FRRLOCK,IS   00077000
*                                      TAPC66(UNLOCK66))             */ 00078000
LOCK66   DS    0H                                                  0175 00079000
*     RFY                                                          0175 00080000
*      (GPR11P,                                                    0175 00081000
*       GPR12P,                                                    0175 00082000
*       GPR13P,                                                    0175 00083000
*       GPR14P) RSTD;                                              0175 00084000
*     GPR13P=PSALITA;               /* ADDRESS OF LOCK INTERFACE   0176 00085000
*                                      TABLE.                        */ 00086000
         L     GPR13P,PSALITA                                      0176 00087000
*     GEN(LM GPR11P,GPR13P,576(GPR13P));/* LOAD LOCKWORD, CLHT AND 0177 00088000
*                                      ENTRY ADRS.                   */ 00089000
         LM GPR11P,GPR13P,576(GPR13P)                                   00090000
*     GEN(BALR GPR14P,GPR13P);      /* BALR TO SETLOCK RTN.          */ 00091000
         BALR GPR14P,GPR13P                                             00092000
*     RFY                                                          0179 00093000
*      (GPR11P,                                                    0179 00094000
*       GPR12P,                                                    0179 00095000
*       GPR13P,                                                    0179 00096000
*       GPR14P) UNRSTD;                                            0179 00097000
*   END;                            /* SETLOCK (OBTAIN) MODE(UNCOND)    00098000
*                                      TYPE(LOCAL) RELATED(FRRLOCK,IS   00099000
*                                      TAPC66(UNLOCK66)) OBTAIN LOCAL   00100000
*                                      LOCK                          */ 00101000
*   SDWAREXN=FRRID;                 /* STORE FRR ID IN SDWA RECORDING   00102000
*                                      AREA                          */ 00103000
         MVC   SDWAREXN(8,SDWAPTR),@CC02808                        0181 00104000
*   SDWAVRA(1:24)=R66M;             /* INIT VARIABLE RECORDING AREA     00105000
*                                      WITH ISTAPC66 FRR PARMLIST    */ 00106000
         MVI   SDWAVRA+16(SDWAPTR),C' '                            0182 00107000
         MVC   SDWAVRA+17(7,SDWAPTR),SDWAVRA+16(SDWAPTR)           0182 00108000
         L     @15,SDWAPARM(,SDWAPTR)                              0182 00109000
         MVC   SDWAVRA(16,SDWAPTR),R66M(@15)                       0182 00110000
*   SDWAHEX=ON;                                                    0183 00111000
         OI    SDWAHEX(SDWAPTR),B'10000000'                        0183 00112000
*   SDWAURAL=24;                                                   0184 00113000
         MVI   SDWAURAL(SDWAPTR),X'18'                             0184 00114000
*   IF R66MPST=0 THEN                                              0185 00115000
         L     @15,R66MPST-1(,@15)                                 0185 00116000
         LA    @15,0(,@15)                                         0185 00117000
         LTR   @15,@15                                             0185 00118000
         BZ    @RT00185                                            0185 00119000
*     ;                             /* IF NO MPST PTR WAS GIVEN    0186 00120000
*                                                            @ZM42041*/ 00121000
*   ELSE                                                           0187 00122000
*     DO;                           /* ELSE PROCESS ABEND    @ZM42041*/ 00123000
*       IF SDWAFMID^='0000'X        /* DID ABEND OCCUR IN ANOTHER  0188 00124000
*                                      MEMORY ?              @Z40GKD1*/ 00125000
*         THEN                      /* YES, DUMP WAS TAKEN ON 1ST  0188 00126000
*                                      PASS OR WILL BE TAKEN BY    0188 00127000
*                                      MEM.TERM.             @Z40GKD1*/ 00128000
         CLC   SDWAFMID(2,SDWAPTR),@CB02850                        0188 00129000
         BE    @RF00188                                            0188 00130000
*         DO;                       /*                       @Z40GKD1*/ 00131000
*           IF FRPABA>0 THEN        /* AND THERE IS A PAB PTR, THEN     00132000
*                                      QUEUE THE PAB TO THE MPST   0190 00133000
*                                      READY QUEUE WITH GATE BIT ON     00134000
*                                                            @Z40GKD1*/ 00135000
         L     @15,SDWAPARM(,SDWAPTR)                              0190 00136000
         L     @12,FRPABA-1(,@15)                                  0190 00137000
         LA    @12,0(,@12)                                         0190 00138000
         LTR   @12,@12                                             0190 00139000
         BNP   @RF00190                                            0190 00140000
*             DO;                   /*                       @Z40GKD1*/ 00141000
*               RFY                                                0192 00142000
*                (OLD,                                             0192 00143000
*                 NEW) RSTD;        /*                       @Z40GKD1*/ 00144000
*               RFY                                                0193 00145000
*                 ISTMPST BASED(R66MPST);/*                  @Z40GKD1*/ 00146000
*               RFY                                                0194 00147000
*                 ISTPAB BASED(FRPABA);/*                    @Z40GKD1*/ 00148000
*               OLD=MPSRQUE;        /* ADDR OF MPST READY Q TO CHAIN    00149000
*                                      PAB TO                @Z40GKD1*/ 00150000
         L     @15,R66MPST-1(,@15)                                 0195 00151000
         LA    @15,0(,@15)                                         0195 00152000
         L     OLD,MPSRQUE(,@15)                                   0195 00153000
*QPAB:                                                             0196 00154000
*               PABCHNGP=OLD;       /* SET PSS CHAIN PTR IN PAB    0196 00155000
*                                                            @Z40GKD1*/ 00156000
QPAB     L     @15,SDWAPARM(,SDWAPTR)                              0196 00157000
         L     @15,FRPABA-1(,@15)                                  0196 00158000
         LA    @15,0(,@15)                                         0196 00159000
         STCM  OLD,7,PABCHNGP(@15)                                 0196 00160000
*               NEW=(OLD&KPFLGS)|(FRPABA|MPSGATE1);/* GET ADDR TO PUT   00161000
*                                      AT HEAD OF QUEUE, WITH GATE 0197 00162000
*                                      BIT ON                @Z40GKD1*/ 00163000
         LR    NEW,OLD                                             0197 00164000
         N     NEW,@CF02171                                        0197 00165000
         O     @15,@CF02065                                        0197 00166000
         OR    NEW,@15                                             0197 00167000
*               CS(OLD,NEW,MPSRQUE);/* PUT PAB AT HEAD OF QUEUE    0198 00168000
*                                                            @Z40GKD1*/ 00169000
         L     @15,SDWAPARM(,SDWAPTR)                              0198 00170000
         L     @15,R66MPST-1(,@15)                                 0198 00171000
         LA    @15,0(,@15)                                         0198 00172000
         CS    OLD,@06,MPSRQUE(@15)                                0198 00173000
*               BC(4,QPAB);         /* IF WASN'T PUT ON QUEUE, TRY 0199 00174000
*                                      AGAIN                 @Z40GKD1*/ 00175000
         BC    4,QPAB                                              0199 00176000
*             END;                  /*                       @Z40GKD1*/ 00177000
*           ELSE                                                   0201 00178000
*             DO;                                                  0201 00179000
*                                                                  0201 00180000
         B     @RC00190                                            0201 00181000
@RF00190 DS    0H                                                  0202 00182000
*               /*****************************************************/ 00183000
*               /*                                                   */ 00184000
*               /* JUST GATE THE READY QUEUE                 @Z40GKD1*/ 00185000
*               /*                                                   */ 00186000
*               /*****************************************************/ 00187000
*                                                                  0202 00188000
*               OLD=R66MPST->MPSRQUE;/* SET UP COMPARE REG   @Z40GKD1*/ 00189000
         L     @15,SDWAPARM(,SDWAPTR)                              0202 00190000
         L     @15,R66MPST-1(,@15)                                 0202 00191000
         LA    @15,0(,@15)                                         0202 00192000
         L     OLD,MPSRQUE(,@15)                                   0202 00193000
*GATE:                                                             0203 00194000
*               NEW=OLD|MPSGATE1;   /* SWAP GATE BIT ON      @Z40GKD1*/ 00195000
GATE     LR    NEW,OLD                                             0203 00196000
         O     NEW,@CF02065                                        0203 00197000
*               CS(OLD,NEW,R66MPST->MPSRQUE);/* USE CS LOGIC @Z40GKD1*/ 00198000
         L     @15,SDWAPARM(,SDWAPTR)                              0204 00199000
         L     @15,R66MPST-1(,@15)                                 0204 00200000
         LA    @15,0(,@15)                                         0204 00201000
         CS    OLD,@06,MPSRQUE(@15)                                0204 00202000
*               BC(7,GATE);         /* IF FAIL, TRY AGAIN    @Z40GKD1*/ 00203000
         BC    7,GATE                                              0205 00204000
*             END;                  /* END JUST GATE THE READY QUE 0206 00205000
*                                                            @Z40GKD1*/ 00206000
*           RFY                                                    0207 00207000
*            (OLD,                                                 0207 00208000
*             NEW) UNRSTD;          /*                       @Z40GKD1*/ 00209000
@RC00190 DS    0H                                                  0208 00210000
*         END;                      /* END ABEND IN ANOTHER MEM.   0208 00211000
*                                                            @Z40GKD1*/ 00212000
*       ELSE                                                       0209 00213000
*         DO;                       /* ELSE NOT ABEND IN ANOTHER MEM.   00214000
*                                                            @Z40GKD1*/ 00215000
         B     @RC00188                                            0209 00216000
@RF00188 DS    0H                                                  0210 00217000
*           IF R66RTYON=ON THEN                                    0210 00218000
         L     @15,SDWAPARM(,SDWAPTR)                              0210 00219000
         TM    R66RTYON(@15),B'10000000'                           0210 00220000
         BO    @RT00210                                            0210 00221000
*             ;                                                    0211 00222000
*           ELSE                                                   0212 00223000
*             DO;                   /* NO, 1ST TIME, TAKE DUMP     0212 00224000
*                                                            @Z40GKD1*/ 00225000
*                                                                  0212 00226000
*               /*****************************************************/ 00227000
*               /*                                                   */ 00228000
*               /* TAKE AN SDUMP OF THIS MEMORY                      */ 00229000
*               /*                                                   */ 00230000
*               /*****************************************************/ 00231000
*                                                                  0213 00232000
*               REG13=REG8;         /* SET UP WORK AREA AS SAVE AREA    00233000
*                                      FOR SDUMP,TPMSG               */ 00234000
         LR    REG13,REG8                                          0213 00235000
*               REG5=REG13;         /* 1ST 16 BYTES = VARIABLE DATA     00236000
*                                      AREA                  @Z40GKD1*/ 00237000
         LR    REG5,REG13                                          0214 00238000
*               REG1=REG13+16;      /* NEXT 4 = PARAMETER LIST AREA     00239000
*                                                            @Z40GKD1*/ 00240000
         LA    REG1,16                                             0215 00241000
         ALR   REG1,REG13                                          0215 00242000
*               JOBN=BLANKS;        /* JOBNAME NOT AVAILABLE IF NO 0216 00243000
*                                      PST->TCB              @Z40GKD1*/ 00244000
         MVC   JOBN(8,REG5),@CC02835                               0216 00245000
*               STEPN=BLANKS;       /* SAME FOR STEPNAME     @Z40GKD1*/ 00246000
         MVC   STEPN(8,REG5),@CC02835                              0217 00247000
*               REG13=REG13+20;     /* SET SAVEAREA PTR PAST INPUT 0218 00248000
*                                      PARAMETERS            @Z40GKD1*/ 00249000
         AL    REG13,@CF02642                                      0218 00250000
*/*TPMSG MSGID('413I')MSG((REG5))PLAREA((REG1))                      */ 00251000
*                                                                  0219 00252000
*               DO;                                                0219 00253000
*                 DCL                                              0220 00254000
*                   REG1011 REG(1) PTR;                            0220 00255000
*                 RFY                                              0221 00256000
*                  (REG1011) RSTD;                                 0221 00257000
*                 RFY                                              0222 00258000
*                  (EMCR13) RSTD;                                  0222 00259000
*                 DCL                                              0223 00260000
*                   1 * BASED(REG1011),                            0223 00261000
*                    2 CMZID011 PTR(31),                           0223 00262000
*                    2 *,                                          0223 00263000
*                     3 CMZRL011 PTR(8),                           0223 00264000
*                     3 CMZRA011 PTR(24) BDY(BYTE),                0223 00265000
*                    2 CMZEA011 PTR(31),                           0223 00266000
*                    2 CMZVP011 PTR(31);                           0223 00267000
*                                                                  0223 00268000
*/*XREGSET  PID('PLAREA')PPARM((REG1))RREG(,REG1011)                 */ 00269000
*                                                                  0224 00270000
*                 DO;                                              0224 00271000
*                   REG1011=REG1;   /* SET RREG SYMBOL TO VALUE OF 0225 00272000
*                                      PPARM OPERAND                 */ 00273000
*                 END;              /* XREGSET                       */ 00274000
*                 CMZID011=0;                                      0227 00275000
         SLR   @15,@15                                             0227 00276000
         ST    @15,CMZID011(,REG1011)                              0227 00277000
*                 CMZRL011=0;                                      0228 00278000
         MVI   CMZRL011(REG1011),X'00'                             0228 00279000
*                 CMZRA011=0;                                      0229 00280000
         STCM  @15,7,CMZRA011(REG1011)                             0229 00281000
*                 CMZEA011=0;                                      0230 00282000
         ST    @15,CMZEA011(,REG1011)                              0230 00283000
*                 CMZVP011=0;                                      0231 00284000
         ST    @15,CMZVP011(,REG1011)                              0231 00285000
*                 DCL                                              0232 00286000
*                   CMZAA011 CHAR(4) INIT('413I');                 0232 00287000
*                 CMZID011=ADDR(CMZAA011);                         0233 00288000
         LA    @15,CMZAA011                                        0233 00289000
         ST    @15,CMZID011(,REG1011)                              0233 00290000
*                 CMZVP011=REG5;                                   0234 00291000
         ST    REG5,CMZVP011(,REG1011)                             0234 00292000
*                 DCL                                              0235 00293000
*                   CMZSA011(18) PTR(31) BASED(EMCR13);            0235 00294000
*                 DCL                                              0236 00295000
*                   CMZZO011(1) FIXED(31) INIT(0);                 0236 00296000
*                 CMZSA011(5)=CMZZO011;                            0237 00297000
         L     @15,CMZZO011                                        0237 00298000
         ST    @15,CMZSA011+16(,EMCR13)                            0237 00299000
*                 DCL                                              0238 00300000
*                   REG15011 REG(15) PTR;                          0238 00301000
*                 RFY                                              0239 00302000
*                   REG15011 RSTD;                                 0239 00303000
*                 DO;               /* LISATCVT                    0240 00304000
*                                      CVTBASE(PAGEABLE,(REG15011))  */ 00305000
*                   REG15011=ATCLCPTR;/* SET UP ATCVT POINTER        */ 00306000
         L     REG15011,ATCLCPTR                                   0241 00307000
*                 END;              /* LISATCVT                      */ 00308000
*                 DCL                                              0243 00309000
*                   CMTA011 BASED(REG15011) ENTRY VALUERANGE(*);   0243 00310000
*                 REG15011=REG15011->ATCMSGP;                      0244 00311000
         L     REG15011,ATCMSGP(,REG15011)                         0244 00312000
*                 CALL CMTA011;                                    0245 00313000
         BALR  @14,@15                                             0245 00314000
*                 RESPECIFY                                        0246 00315000
*                  (REG1011,                                       0246 00316000
*                   REG15011) UNRESTRICTED;                        0246 00317000
*                 RFY                                              0247 00318000
*                  (EMCR13) UNRSTD;                                0247 00319000
*               END;                /*                       @Z40GKD1*/ 00320000
*               REG13=REG13-20;     /* RESET SAVEAREA POINTER      0249 00321000
*                                                            @Z40GKD1*/ 00322000
         SL    REG13,@CF02642                                      0249 00323000
*               REG1=REG13+100;     /* BUMP UP TO 2ND 1/2 OF WK AREA */ 00324000
         LA    REG1,100                                            0250 00325000
         ALR   REG1,REG13                                          0250 00326000
*               SDMPAREA=SDUMP66;   /* SET UP MAP OF PARAMETER LIST     00327000
*                                      FOR SDUMP                     */ 00328000
         MVC   SDMPAREA(24,REG1),SDUMP66                           0251 00329000
*               REG5=0;             /* DUMP CURRENT ADDRESS SPACE    */ 00330000
         SLR   REG5,REG5                                           0252 00331000
*               GEN REFS(CVTMAP,CVTSDMP,CVTPTR);                   0253 00332000
   SDUMP BRANCH=YES,ASID=(REG5),MF=(E,(1)) /*TAKE SDUMP*/               00333000
*             END;                                                 0254 00334000
*                                                                  0254 00335000
*           /*********************************************************/ 00336000
*           /*                                                       */ 00337000
*           /* WAS ISTAPC55 RUNNING                          @Z40GKD1*/ 00338000
*           /* YES, ENQUE PAB TO MPST READY Q                @Z40GKD1*/ 00339000
*           /*                                                       */ 00340000
*           /*********************************************************/ 00341000
*                                                                  0255 00342000
*           IF R6655R=ON THEN                                      0255 00343000
@RT00210 L     @15,SDWAPARM(,SDWAPTR)                              0255 00344000
         TM    R6655R(@15),B'10000000'                             0255 00345000
         BNO   @RF00255                                            0255 00346000
*             DO;                                                  0256 00347000
*               SDWAMODN=APC55NAM;  /* FIRST STORE MODULE NAME IN  0257 00348000
*                                      SDWA                          */ 00349000
         MVC   SDWAMODN(8,SDWAPTR),@CC02810                        0257 00350000
*               SDWACSCT=APC55NAM;  /* STORE CSECT NAME IN SDWA      */ 00351000
         MVC   SDWACSCT(8,SDWAPTR),@CC02810                        0258 00352000
*               IF FRPABA>0 THEN    /* IS PAB PTR IN FRR PARM LIST?     00353000
*                                                            @Z40GKD1*/ 00354000
         L     @12,FRPABA-1(,@15)                                  0259 00355000
         LA    @12,0(,@12)                                         0259 00356000
         LTR   @12,@12                                             0259 00357000
         BNP   @RF00259                                            0259 00358000
*                 DO;               /* YES, QUE THE PAB TO THE MPST     00359000
*                                      READY Q               @Z40GKD1*/ 00360000
*                   RFY                                            0261 00361000
*                    (OLD,                                         0261 00362000
*                     NEW) RSTD;    /*                       @Z40GKD1*/ 00363000
*                   OLD=MPSRQUE;    /* ADDR OF MPST READY Q TO CHAIN    00364000
*                                      PAB TO                @Z40GKD1*/ 00365000
         L     @15,R66MPST-1(,@15)                                 0262 00366000
         LA    @15,0(,@15)                                         0262 00367000
         L     OLD,MPSRQUE(,@15)                                   0262 00368000
*QPAB1:                                                            0263 00369000
*                   PABCHNGP=OLD;   /* SET PSS CHAIN PTR IN PAB    0263 00370000
*                                                            @Z40GKD1*/ 00371000
QPAB1    L     @15,SDWAPARM(,SDWAPTR)                              0263 00372000
         L     @15,FRPABA-1(,@15)                                  0263 00373000
         LA    @15,0(,@15)                                         0263 00374000
         STCM  OLD,7,PABCHNGP(@15)                                 0263 00375000
*                   NEW=(OLD&KPFLGS)|(FRPABA&CLRFLGS);/* GET ADDR TO    00376000
*                                      PUT AT HEAD OF QUEUE  @Z40GKD1*/ 00377000
         LR    NEW,OLD                                             0264 00378000
         N     NEW,@CF02171                                        0264 00379000
         N     @15,@CF02063                                        0264 00380000
         OR    NEW,@15                                             0264 00381000
*                   CS(OLD,NEW,MPSRQUE);/* PUT PAB AT HEAD OF MPST 0265 00382000
*                                      READY Q               @Z40GKD1*/ 00383000
         L     @15,SDWAPARM(,SDWAPTR)                              0265 00384000
         L     @15,R66MPST-1(,@15)                                 0265 00385000
         LA    @15,0(,@15)                                         0265 00386000
         CS    OLD,@06,MPSRQUE(@15)                                0265 00387000
*                   BC(4,QPAB1);    /* IF WASN'T PUT ON QUEUE,TRY  0266 00388000
*                                      AGAIN                 @Z40GKD1*/ 00389000
         BC    4,QPAB1                                             0266 00390000
*                   RFY                                            0267 00391000
*                    (OLD,                                         0267 00392000
*                     NEW) UNRSTD;  /*                       @Z40GKD1*/ 00393000
*                 END;              /* END QUE THE PAB TO THE MPST 0268 00394000
*                                      READY Q               @Z40GKD1*/ 00395000
*               ELSE                                               0269 00396000
*                 ;                 /* ELSE NO PAB PTR       @Z40GKD1*/ 00397000
@RF00259 DS    0H                                                  0270 00398000
*             END;                  /* END APM55 WAS RUNNING @Z40GKD1*/ 00399000
*           ELSE                    /* IF ISTAPC55 WAS NOT RUNNING 0271 00400000
*                                      BUT YET PAB PTR WAS STORED, 0271 00401000
*                                      THEN ISTAPC59 WAS RUNNING   0271 00402000
*                                                            @Z40GKD1*/ 00403000
*             IF FRPABA>0 THEN                                     0271 00404000
         B     @RC00255                                            0271 00405000
@RF00255 L     @15,SDWAPARM(,SDWAPTR)                              0271 00406000
         L     @15,FRPABA-1(,@15)                                  0271 00407000
         LA    @15,0(,@15)                                         0271 00408000
         LTR   @15,@15                                             0271 00409000
         BNP   @RF00271                                            0271 00410000
*               DO;                 /*                       @Z40GKD1*/ 00411000
*                 SDWAMODN=APC59NAM;/* STORE MODULE NAME IN SDWA     */ 00412000
         MVC   SDWAMODN(8,SDWAPTR),@CC02812                        0273 00413000
*                 SDWACSCT=APC59NAM;/* STORE CSECT NAME IN SDWA      */ 00414000
         MVC   SDWACSCT(8,SDWAPTR),@CC02812                        0274 00415000
*                 RFY                                              0275 00416000
*                  (GPR15P) RSTD;                                  0275 00417000
*                 GPR05P=FRPABA;    /* REG 5 POINTS TO PAB TO      0276 00418000
*                                      RE-SCHEDULE           @ZM31509*/ 00419000
         L     @12,SDWAPARM(,SDWAPTR)                              0276 00420000
         L     @12,FRPABA-1(,@12)                                  0276 00421000
         LA    @12,0(,@12)                                         0276 00422000
         LR    GPR05P,@12                                          0276 00423000
*                 DO;               /* LISATCVT                    0277 00424000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00425000
*                   GPR15P=ATCLCPTR;/* SET UP ATCVT POINTER          */ 00426000
         L     GPR15P,ATCLCPTR                                     0278 00427000
*                 END;              /* LISATCVT                      */ 00428000
*                 CALL GPR15P->ATCAP32->ISTAPC32;/* SCHED PAB TO MPST   00429000
*                                                            @Z40GKD1*/ 00430000
         L     @12,ATCAP32(,GPR15P)                                0280 00431000
         LR    @15,@12                                             0280 00432000
         BALR  @14,@15                                             0280 00433000
*                 RFY                                              0281 00434000
*                  (GPR15P) UNRSTD;                                0281 00435000
*                 GO TO RECORD;     /* BRANCH TO SETRP FOR CONTINUE     00436000
*                                      TERMINATION                   */ 00437000
         B     RECORD                                              0282 00438000
*               END;                /* END APC59 ABENDED     @Z40GKD1*/ 00439000
*             ELSE                                                 0284 00440000
*               DO;                 /* SEE IF RETRY ATTEMPT NEEDED 0284 00441000
*                                                            @Z40GKD1*/ 00442000
@RF00271 DS    0H                                                  0285 00443000
*                 IF R66RPL>0&R66RTYON^=ON&R66RTRY>0 THEN/* IF A WORK   00444000
*                                      ELEM. PTR HAS BEEN STORED, IF    00445000
*                                      A RETRY WAS NOT ALREADY     0285 00446000
*                                      ATTEMPTED,AND IF A RETRY ADDR    00447000
*                                      WAS STORED, A RETRY WILL BE 0285 00448000
*                                      ATTEMPTED HERE.       @ZM41335*/ 00449000
         L     @15,SDWAPARM(,SDWAPTR)                              0285 00450000
         L     @12,R66RPL(,@15)                                    0285 00451000
         LTR   @12,@12                                             0285 00452000
         BNP   @RF00285                                            0285 00453000
         TM    R66RTYON(@15),B'10000000'                           0285 00454000
         BO    @RF00285                                            0285 00455000
         L     @11,R66RTRY-1(,@15)                                 0285 00456000
         LA    @11,0(,@11)                                         0285 00457000
         LTR   @11,@11                                             0285 00458000
         BNP   @RF00285                                            0285 00459000
*                   DO;                                            0286 00460000
*                     R66RTYON=ON;  /* SET RETRY ATTEMPTED BIT       */ 00461000
         OI    R66RTYON(@15),B'10000000'                           0287 00462000
*                     IF RPLID='00'X THEN/* IS WORK ELEMENT AN RPL?     00463000
*                                                            @ZM41335*/ 00464000
         CLI   RPLID(@12),X'00'                                    0288 00465000
         BNE   @RF00288                                            0288 00466000
*                       DO;         /* YES...                @ZM41335*/ 00467000
*                         SDWAVRA(25)=RPLSTAT;/* RECORD RPL STATUS 0290 00468000
*                                                            @ZM31201*/ 00469000
         MVC   SDWAVRA+24(1,SDWAPTR),RPLSTAT(@12)                  0290 00470000
*                         SDWAVRA(26:28)=RPLFDBK;/* RECORD RPL     0291 00471000
*                                      FEEDBACK              @ZM31201*/ 00472000
         MVC   SDWAVRA+25(3,SDWAPTR),RPLFDBK(@12)                  0291 00473000
*                         RPLRTNCD=USABL24;/* SET FEEDBACK CODE IN 0292 00474000
*                                      RPL                           */ 00475000
         MVI   RPLRTNCD(@12),X'10'                                 0292 00476000
*                         RPLFDB2=USABLAL;/* SET REASON CODE IN RPL  */ 00477000
         MVI   RPLFDB2(@12),X'0A'                                  0293 00478000
*                       END;        /* END WORK ELEMENT AN RPL     0294 00479000
*                                                            @ZM41335*/ 00480000
*                     ELSE          /* ELSE MUST BE LCPB - NO      0295 00481000
*                                      FEEDBACK              @ZM41335*/ 00482000
*                       DO;         /*                       @ZM41335*/ 00483000
         B     @RC00288                                            0295 00484000
@RF00288 DS    0H                                                  0296 00485000
*                         SDWAVRA(25:28)=CLRFLD;/* CLEAR FEEDBACK  0296 00486000
*                                      FIELDS                @ZM41335*/ 00487000
         MVC   SDWAVRA+24(4,SDWAPTR),@CB02826                      0296 00488000
*                       END;        /* END LCPB              @ZM41335*/ 00489000
*                     SDWAURAL=28;  /* CHANGE LENGTH OF USER DATA  0298 00490000
*                                                            @ZM31201*/ 00491000
@RC00288 MVI   SDWAURAL(SDWAPTR),X'1C'                             0298 00492000
*                     SDWASR01=R66RPL;/* INIT REG 1 FOR ENTRY TO   0299 00493000
*                                      RETRY WITH RPL ADDR           */ 00494000
         L     @15,SDWAPARM(,SDWAPTR)                              0299 00495000
         L     @12,R66RPL(,@15)                                    0299 00496000
         ST    @12,SDWASR01(,SDWAPTR)                              0299 00497000
*                     SDWASR14=R66RTRY;/* INIT REG 14 FOR ENTRY TO 0300 00498000
*                                      RETRY WITH RETRY ADDR         */ 00499000
         L     @15,R66RTRY-1(,@15)                                 0300 00500000
         LA    @15,0(,@15)                                         0300 00501000
         ST    @15,SDWASR14(,SDWAPTR)                              0300 00502000
*                     GPR05P=R66RTRY;                              0301 00503000
         LR    GPR05P,@15                                          0301 00504000
*                     DO;           /* SETRP RETADDR(GPR05P->RETRYAD)   00505000
*                                      RETREGS(YES)RECORD(YES)WKAREA(   00506000
*                                      (SDWAPTR))RC(4)               */ 00507000
*                       RESPECIFY                                  0303 00508000
*                        (GPR00P,                                  0303 00509000
*                         GPR01P,                                  0303 00510000
*                         GPR14P,                                  0303 00511000
*                         GPR15P) RSTD;                            0303 00512000
*                       GPR01P=(SDWAPTR);                          0304 00513000
         LR    GPR01P,SDWAPTR                                      0304 00514000
*                       GPR01P->SDWARCDE=4;/* STORE RC INTO SDWA     */ 00515000
         MVI   SDWARCDE(GPR01P),X'04'                              0305 00516000
*                       GPR01P->SDWARTYA=ADDR(GPR05P->RETRYAD);/*  0306 00517000
*                                      SAVE RETRY ADDRESS            */ 00518000
         ST    GPR05P,SDWARTYA(,GPR01P)                            0306 00519000
*                       GPR01P->SDWARCRD='1'B;/* TURN ON RECORD    0307 00520000
*                                      INDICATOR                     */ 00521000
*                       GPR01P->SDWAUPRG='1'B;/* TURN ON RETREGS   0308 00522000
*                                      INDICATOR                     */ 00523000
         OI    SDWARCRD(GPR01P),B'10001000'                        0308 00524000
*                       RESPECIFY                                  0309 00525000
*                        (GPR00P,                                  0309 00526000
*                         GPR01P,                                  0309 00527000
*                         GPR14P,                                  0309 00528000
*                         GPR15P) UNRSTD;                          0309 00529000
*                     END;          /* ATTEMPT RETRY TYPE SETRP      */ 00530000
*                     GO TO UNLOCK66;/* BRANCH TO CLEANUP            */ 00531000
         B     UNLOCK66                                            0311 00532000
*                   END;            /* END RETRY ATTEMPT     @Z40GKD1*/ 00533000
*               END;                /* END SEE IF RETRY ATTEMPT    0313 00534000
*                                      NEEDED                @Z40GKD1*/ 00535000
@RF00285 DS    0H                                                  0314 00536000
*         END;                      /* END NOT ABENDING IN ANOTHER 0314 00537000
*                                      MEMORY                @Z40GKD1*/ 00538000
@RC00255 DS    0H                                                  0315 00539000
*       DCEPTR=MPSDBTBL;            /* PICK UP DCE POINTER FROM MPST */ 00540000
@RC00188 L     @15,SDWAPARM(,SDWAPTR)                              0315 00541000
         L     @15,R66MPST-1(,@15)                                 0315 00542000
         LA    @15,0(,@15)                                         0315 00543000
         L     DCEPTR,MPSDBTBL(,@15)                               0315 00544000
*/*IF THE ABENDING TASK IS THE VTAM JOBSTEP TASK, OR A SUBTASK     0316 00545000
*  OF THE VTAM JOBSTEP TASK, THE JOBSTEP TCB WILL BE ABTERMED      0316 00546000
*  AND THE DCEPTR WILL BE SET TO ZERO, CAUSING IMMEDIATE EXIT      0316 00547000
*  FROM THE DCE SEARCH LOOP, AND AVOIDING CALLING RTM MORE THAN    0316 00548000
*  ONCE FOR THE SAME TASK.                                   @OZ04697*/ 00549000
*                                                                  0316 00550000
*       DO WHILE DCEPTR>0;          /* DO FOR EACH DCE OR APPLICATION*/ 00551000
         B     @DE00316                                            0316 00552000
@DL00316 DS    0H                                                  0317 00553000
*         RFY                                                      0317 00554000
*           REG5 RSTD;              /*                       @OZ04697*/ 00555000
*         DO;                       /* LISATCVT                    0318 00556000
*                                      CVTBASE(PAGEABLE,(REG5))      */ 00557000
*           REG5=ATCLCPTR;          /* SET UP ATCVT POINTER          */ 00558000
         L     REG5,ATCLCPTR                                       0319 00559000
*         END;                      /* LISATCVT GET ADDR OF ATCVT  0320 00560000
*                                                            @OZ04697*/ 00561000
*         IF((ACDTCB=REG5->ATCCDTCB)|/* IF DEB TASK=VTAM JOBSTEP TASK   00562000
*                                      OR A SUBTASK OF THE VTAM    0321 00563000
*                                      JOBSTEP TASK          @OZ04697*/ 00564000
*             (ACDTCB->TCBJSTCB=REG5->ATCCDTCB))&/*          @OZ04697*/ 00565000
*             (SDWAFMID=0)          /* AND NOT MEMORY TERM.  @OZ04697*/ 00566000
*           THEN                                                   0321 00567000
         L     @15,DCEDBPTR(,DCEPTR)                               0321 00568000
         L     @15,ACDTCB-1(,@15)                                  0321 00569000
         LA    @15,0(,@15)                                         0321 00570000
         L     @12,ATCCDTCB(,REG5)                                 0321 00571000
         CR    @15,@12                                             0321 00572000
         BE    @GL00003                                            0321 00573000
         C     @12,TCBJSTCB(,@15)                                  0321 00574000
         BNE   @RF00321                                            0321 00575000
@GL00003 LH    @15,SDWAFMID(,SDWAPTR)                              0321 00576000
         N     @15,@CF02910                                        0321 00577000
         LTR   @15,@15                                             0321 00578000
         BNZ   @RF00321                                            0321 00579000
*           DO;                     /*                       @OZ04697*/ 00580000
*             REG5->ATCVTMAB=ON;    /* SET FLAG TO SHOW VTAM JOBSTEP    00581000
*                                      TASK ABEND            @OZ04697*/ 00582000
         L     @15,ATCVTMAB-3(,REG5)                               0323 00583000
@GL00005 LR    @12,@15                                             0323 00584000
         O     @12,@CF02911                                        0323 00585000
         CS    @15,@12,ATCVTMAB-3(REG5)                            0323 00586000
         BNE   @GL00005                                            0323 00587000
*             TCBPTR=ACDTCB->TCBJSTCB;/* GET JOBSTEP TCB ADDRESS FROM   00588000
*                                      ACDEB AND ABTERM IT   @OZ04697*/ 00589000
         L     @15,DCEDBPTR(,DCEPTR)                               0324 00590000
         L     @15,ACDTCB-1(,@15)                                  0324 00591000
         LA    @15,0(,@15)                                         0324 00592000
         L     TCBPTR,TCBJSTCB(,@15)                               0324 00593000
*             GEN REFS(TCBPTR,CVTBTERM,CVTMAP);                    0325 00594000
         CALLRTM TYPE=ABTERM,COMPCOD=X'0AA',TCB=(TCBPTR)                00595000
*             DCEPTR=0;             /* SET DCEPTR TO EXIT LOOP     0326 00596000
*                                                            @OZ04697*/ 00597000
         SLR   DCEPTR,DCEPTR                                       0326 00598000
*           END;                    /* END VTAM JOBSTEP TASK ABEND 0327 00599000
*                                                            @OZ04697*/ 00600000
*         ELSE                                                     0328 00601000
*           DO;                     /* ELSE NOT VTAM ABEND   @OZ04697*/ 00602000
         B     @RC00321                                            0328 00603000
@RF00321 DS    0H                                                  0329 00604000
*/* INDICATE ABEND IN PROGRESS FOR ACDEB                     @Z40GKD1*/ 00605000
*                                                                  0329 00606000
*             RFY                                                  0329 00607000
*              (OLD,                                               0329 00608000
*               NEW) RSTD;          /*                       @Z40GKD1*/ 00609000
*             OLD=ACDSSFLG(1:4);    /* ACDEB FLAGS           @Z40GKD1*/ 00610000
         L     @15,DCEDBPTR(,DCEPTR)                               0330 00611000
         ICM   OLD,15,ACDSSFLG(@15)                                0330 00612000
*SETAB:                                                            0331 00613000
*             NEW=OLD|'40000000'X;  /* TURN ON ACDABEND FOR SWAP   0331 00614000
*                                                            @Z40GKD1*/ 00615000
SETAB    LR    NEW,OLD                                             0331 00616000
         O     NEW,@CF02071                                        0331 00617000
*             CS(OLD,NEW,ACDSSFLG(1:4));/* TURN ON           @Z40GKD1*/ 00618000
         L     @15,DCEDBPTR(,DCEPTR)                               0332 00619000
         CS    OLD,@06,ACDSSFLG(@15)                               0332 00620000
*             BC(4,SETAB);          /* IF FAIL, TRY AGAIN    @Z40GKD1*/ 00621000
         BC    4,SETAB                                             0333 00622000
*CSLOOP:                                                           0334 00623000
*             IF PSTABINP=ON THEN                                  0334 00624000
CSLOOP   L     @15,DCEDBPTR(,DCEPTR)                               0334 00625000
         L     @15,ACDTSKID(,@15)                                  0334 00626000
         TM    PSTABINP(@15),B'00000001'                           0334 00627000
         BO    @RT00334                                            0334 00628000
*               ;                   /* IF ABEND IN PROCESS   @Z40GKD1*/ 00629000
*             ELSE                                                 0336 00630000
*               DO;                 /* SET ABEND IN PROCESS IN PST   */ 00631000
*                 OLD=PSTFLGA;      /* SET UP OLD FIELD FOR CS       */ 00632000
         L     @15,DCEDBPTR(,DCEPTR)                               0337 00633000
         L     @15,ACDTSKID(,@15)                                  0337 00634000
         L     @15,PSTFLGA(,@15)                                   0337 00635000
         LR    OLD,@15                                             0337 00636000
*                 NEW=PSTFLGA|PSTABIP1;/* SET UP NEW FIELD FOR CS    */ 00637000
         O     @15,@CF02169                                        0338 00638000
         LR    NEW,@15                                             0338 00639000
*                 NEW=NEW|PSTDMPC1; /* SET DUMP TAKEN FLAG IN PST  0339 00640000
*                                                            @ZM32232*/ 00641000
         O     NEW,@CF02824                                        0339 00642000
*                 CS(OLD,NEW,PSTFLGA);/* CS TO SET ABEND IN PROCESS     00643000
*                                      FLAG                          */ 00644000
         L     @15,DCEDBPTR(,DCEPTR)                               0340 00645000
         L     @15,ACDTSKID(,@15)                                  0340 00646000
         CS    OLD,@06,PSTFLGA(@15)                                0340 00647000
*                 BC(4,CSLOOP);                                    0341 00648000
         BC    4,CSLOOP                                            0341 00649000
*                 RFY                                              0342 00650000
*                  (OLD,                                           0342 00651000
*                   NEW) UNRSTD;    /*                       @Z40GKD1*/ 00652000
*                 IF SDWAFMID^='0000'X THEN                        0343 00653000
         CLC   SDWAFMID(2,SDWAPTR),@CB02850                        0343 00654000
         BNE   @RT00343                                            0343 00655000
*                   ;               /* MEM TERM,DON'T ABEND DEB TASK    00656000
*                                                            @Z40GKD1*/ 00657000
*                 ELSE                                             0345 00658000
*                   DO;             /*                       @Z40GKD1*/ 00659000
*                     TCBPTR=ACDTCB;/* GET TCB ADDRESS FROM ACDEB AND   00660000
*                                      ABTERM IT                     */ 00661000
         L     @15,DCEDBPTR(,DCEPTR)                               0346 00662000
         L     TCBPTR,ACDTCB-1(,@15)                               0346 00663000
         LA    TCBPTR,0(,TCBPTR)                                   0346 00664000
*                     GEN REFS(TCBPTR,CVTBTERM,CVTMAP);            0347 00665000
         CALLRTM TYPE=ABTERM,COMPCOD=X'0AA',TCB=(TCBPTR)                00666000
*                   END;            /* END ABTERM TCB        @Z40GKD1*/ 00667000
*               END;                /* END PST NOT ABENDED   @Z40GKD1*/ 00668000
@RT00343 DS    0H                                                  0350 00669000
*             DCEPTR=DCEPTR->DCECHN;/* PICK UP NEXT DCE ON CHAIN   0350 00670000
*                                                            @Z40GKD1*/ 00671000
@RT00334 L     DCEPTR,DCECHN(,DCEPTR)                              0350 00672000
*           END;                    /* END NOT VTAM ABEND    @OZ04697*/ 00673000
*       END;                        /* END DO WHILE          @Z40GKD1*/ 00674000
@RC00321 DS    0H                                                  0352 00675000
@DE00316 LTR   DCEPTR,DCEPTR                                       0352 00676000
         BP    @DL00316                                            0352 00677000
*       IF(R6655R=ON)&(SDWAFMID='0000'X)/* IF APC55 ABENDED AND NOT     00678000
*                                      MEMORY TERMINATION    @Z40GKD1*/ 00679000
*         THEN                                                     0353 00680000
         L     @15,SDWAPARM(,SDWAPTR)                              0353 00681000
         TM    R6655R(@15),B'10000000'                             0353 00682000
         BNO   @RF00353                                            0353 00683000
         CLC   SDWAFMID(2,SDWAPTR),@CB02850                        0353 00684000
         BNE   @RF00353                                            0353 00685000
*         DO;                       /* THEN UNGATE THE MPST READY  0354 00686000
*                                      QUEUE                 @Z40GKD1*/ 00687000
*           OLD=R66MPST->MPSRQUE;   /* SET UP COMPARE REG    @Z40GKD1*/ 00688000
         L     @15,R66MPST-1(,@15)                                 0355 00689000
         LA    @15,0(,@15)                                         0355 00690000
         L     OLD,MPSRQUE(,@15)                                   0355 00691000
*UNGT:                                                             0356 00692000
*           NEW=OLD&MPSGATE0;       /* SWAP GATE BIT OFF     @Z40GKD1*/ 00693000
UNGT     LR    NEW,OLD                                             0356 00694000
         N     NEW,@CF02063                                        0356 00695000
*           CS(OLD,NEW,R66MPST->MPSRQUE);/* USE CS LOGIC     @Z40GKD1*/ 00696000
         L     @15,SDWAPARM(,SDWAPTR)                              0357 00697000
         L     @15,R66MPST-1(,@15)                                 0357 00698000
         LA    @15,0(,@15)                                         0357 00699000
         CS    OLD,@06,MPSRQUE(@15)                                0357 00700000
*           BC(7,UNGT);             /* IF FAIL, TRY AGAIN    @Z40GKD1*/ 00701000
         BC    7,UNGT                                              0358 00702000
*         END;                      /* END OF UNGATE THE READY QUEUE    00703000
*                                                            @Z40GKD1*/ 00704000
*     END;                          /* END OF MPST POINTER GIVEN   0360 00705000
*                                                            @ZM42041*/ 00706000
@RF00353 DS    0H                                                  0361 00707000
*RECORD:                                                           0361 00708000
*   DO;                             /* SETRP RECORD(YES)WKAREA(SDWAPT   00709000
*                                      R)RC(0)                       */ 00710000
@RT00185 DS    0H                                                  0361 00711000
RECORD   DS    0H                                                  0362 00712000
*     RESPECIFY                                                    0362 00713000
*      (GPR00P,                                                    0362 00714000
*       GPR01P,                                                    0362 00715000
*       GPR14P,                                                    0362 00716000
*       GPR15P) RSTD;                                              0362 00717000
*     GPR01P=SDWAPTR;                                              0363 00718000
         LR    GPR01P,SDWAPTR                                      0363 00719000
*     GPR01P->SDWARCDE=0;           /* SAVE RC VALUE                 */ 00720000
         MVI   SDWARCDE(GPR01P),X'00'                              0364 00721000
*     GPR01P->SDWARCRD='1'B;        /* TURN ON RECORD INDICATOR      */ 00722000
         OI    SDWARCRD(GPR01P),B'10000000'                        0365 00723000
*     RESPECIFY                                                    0366 00724000
*      (GPR00P,                                                    0366 00725000
*       GPR01P,                                                    0366 00726000
*       GPR14P,                                                    0366 00727000
*       GPR15P) UNRSTD;                                            0366 00728000
*   END;                            /* CONTINUE TERMINATION/PERCOLATE   00729000
*                                      TYPE RETRY                    */ 00730000
*                                                                  0367 00731000
*   /*****************************************************************/ 00732000
*   /*                                                               */ 00733000
*   /* RELEASE LOCAL LOCK                                            */ 00734000
*   /*                                                               */ 00735000
*   /*****************************************************************/ 00736000
*                                                                  0368 00737000
*UNLOCK66:                                                         0368 00738000
*   DO;                             /* SETLOCK (RELEASE) TYPE(LOCAL)    00739000
*                                      RELATED(FRRLOCK,ISTAPC66(LOCK6   00740000
*                                      6))                           */ 00741000
UNLOCK66 DS    0H                                                  0369 00742000
*     RFY                                                          0369 00743000
*      (GPR11P,                                                    0369 00744000
*       GPR12P,                                                    0369 00745000
*       GPR13P,                                                    0369 00746000
*       GPR14P) RSTD;                                              0369 00747000
*     GPR13P=PSALITA;               /* ADDRESS OF LOCK INTERFACE   0370 00748000
*                                      TABLE.                        */ 00749000
         L     GPR13P,PSALITA                                      0370 00750000
*     GEN(LM GPR11P,GPR13P,588(GPR13P));/* LOAD LOCKWORD, CLHT AND 0371 00751000
*                                      ENTRY ADRS.                   */ 00752000
         LM GPR11P,GPR13P,588(GPR13P)                                   00753000
*     GEN(BALR GPR14P,GPR13P);      /* BALR TO SETLOCK RTN.          */ 00754000
         BALR GPR14P,GPR13P                                             00755000
*     RFY                                                          0373 00756000
*      (GPR11P,                                                    0373 00757000
*       GPR12P,                                                    0373 00758000
*       GPR13P,                                                    0373 00759000
*       GPR14P) UNRSTD;                                            0373 00760000
*   END;                            /* SETLOCK (RELEASE) TYPE(LOCAL)    00761000
*                                      RELATED(FRRLOCK,ISTAPC66(LOCK6   00762000
*                                      6))                           */ 00763000
*FRRDEL:                                                           0375 00764000
*   GEN REFS(GPR02P,GPR03P,PSACSTK,PSA,FRRSCURR,FRRS,FRRSEMP,FRRSELEN)  00765000
*       SETS(GPR02P,GPR03P,FRRSCURR);                              0375 00766000
FRRDEL   DS    0H                                                  0375 00767000
         SETFRR D,WRKREGS=(GPR02P,GPR03P)                               00768000
*   REG1=SDWAPTR;                   /* RESTORE REG 1         @OZ04697*/ 00769000
         LR    REG1,SDWAPTR                                        0376 00770000
*   REG14=REG10;                    /* RESTORE REG 14                */ 00771000
         LR    REG14,REG10                                         0377 00772000
*/* TPEPILOG                                                         */ 00773000
*                                                                  0378 00774000
*   GEN(PRINT OFF);                                                0378 00775000
         PRINT OFF                                                      00776000
*   DECLARE                                                        0379 00777000
*     EMCR0 PTR REG(0),                                            0379 00778000
*     EMCR1 PTR REG(1),                                            0379 00779000
*     EMCR2 PTR REG(2),                                            0379 00780000
*     EMCR3 PTR REG(3),                                            0379 00781000
*     EMCR4 PTR REG(4),                                            0379 00782000
*     EMCR5 PTR REG(5),                                            0379 00783000
*     EMCR6 PTR REG(6),                                            0379 00784000
*     EMCR7 PTR REG(7),                                            0379 00785000
*     EMCR8 PTR REG(8),                                            0379 00786000
*     EMCR9 PTR REG(9),                                            0379 00787000
*     EMCR10 PTR REG(10),                                          0379 00788000
*     EMCR11 PTR REG(11),                                          0379 00789000
*     EMCR12 PTR REG(12),                                          0379 00790000
*     EMCR13 PTR REG(13),                                          0379 00791000
*     EMCR14 PTR REG(14),                                          0379 00792000
*     EMCR15 PTR REG(15);                                          0379 00793000
*   GEN(PRINT ON);                                                 0380 00794000
*                                                                  0380 00795000
         PRINT ON                                                       00796000
*/* END OF TPEPILOG                                                  */ 00797000
*                                                                  0381 00798000
*   END ISTAPC66                                                   0381 00799000
*                                                                  0381 00800000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00801000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 00802000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00803000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00804000
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */ 00805000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 00806000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00807000
*/*%INCLUDE SYSLIB  (ISTR66M )                                       */ 00808000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00809000
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                       */ 00810000
*                                                                  0381 00811000
*       ;                                                          0381 00812000
@EL00001 DS    0H                                                  0381 00813000
@EF00001 DS    0H                                                  0381 00814000
@ER00001 BR    @14                                                 0381 00815000
@DATA    DS    0H                                                       00816000
@DATD    DSECT                                                          00817000
         DS    0F                                                       00818000
ISTAPC66 CSECT                                                          00819000
         DS    0F                                                       00820000
@CF02642 DC    F'20'                                                    00821000
@CF02063 DC    XL4'7FFFFFFF'                                            00822000
@CF02065 DC    XL4'80000000'                                            00823000
@CF02071 DC    XL4'40000000'                                            00824000
@CF02169 DC    XL4'01000000'                                            00825000
@CF02171 DC    XL4'FF000000'                                            00826000
@CF02824 DC    XL4'00400000'                                            00827000
@CF02910 DC    XL4'0000FFFF'                                            00828000
@CF02911 DC    BL4'00000000000000000000000010000000'                    00829000
@DATD    DSECT                                                          00830000
         DS    0D                                                       00831000
ISTAPC66 CSECT                                                          00832000
         NOPR  ((@ENDDATD-@DATD)*16)                                    00833000
         DS    0F                                                       00834000
@SIZDATD DC    AL1(0)                                                   00835000
         DC    AL3(@ENDDATD-@DATD)                                      00836000
         DS    0D                                                       00837000
@CC02808 DC    C'ISTAPC66'                                              00838000
@CC02810 DC    C'ISTAPC55'                                              00839000
@CC02812 DC    C'ISTAPC59'                                              00840000
@CC02835 DC    C'        '                                              00841000
@CB02826 DC    X'00000000'                                              00842000
@CB02850 EQU   @CB02826                                                 00843000
CMZAA011 DC    CL4'413I'                                                00844000
CMZZO011 DC    F'0'                                                     00845000
ISTAPC66 CSECT                                                          00846000
SDUMP66 SDUMP SDATA=(SQA,NUC,RGN,LSQA,LPA,TRT,ALLPSA,CSA,SWA),MF=L      00847000
@DATD    DSECT                                                          00848000
@ENDDATD EQU   *                                                        00849000
ISTAPC66 CSECT                                                          00850000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00851000
@01      EQU   01                                                       00852000
@02      EQU   02                                                       00853000
@03      EQU   03                                                       00854000
@04      EQU   04                                                       00855000
@05      EQU   05                                                       00856000
@06      EQU   06                                                       00857000
@07      EQU   07                                                       00858000
@08      EQU   08                                                       00859000
@09      EQU   09                                                       00860000
@10      EQU   10                                                       00861000
@11      EQU   11                                                       00862000
@12      EQU   12                                                       00863000
@13      EQU   13                                                       00864000
@14      EQU   14                                                       00865000
@15      EQU   15                                                       00866000
SDWAPTR  EQU   @09                                                      00867000
TCBPTR   EQU   @03                                                      00868000
RPHPTR   EQU   @01                                                      00869000
GPR00P   EQU   @00                                                      00870000
GPR01P   EQU   @01                                                      00871000
GPR02P   EQU   @02                                                      00872000
GPR03P   EQU   @03                                                      00873000
GPR04P   EQU   @04                                                      00874000
GPR05P   EQU   @05                                                      00875000
GPR11P   EQU   @11                                                      00876000
GPR12P   EQU   @12                                                      00877000
GPR13P   EQU   @13                                                      00878000
GPR14P   EQU   @14                                                      00879000
GPR15P   EQU   @15                                                      00880000
REG0     EQU   @00                                                      00881000
REG1     EQU   @01                                                      00882000
DCEPTR   EQU   @04                                                      00883000
REG5     EQU   @05                                                      00884000
OLD      EQU   @05                                                      00885000
NEW      EQU   @06                                                      00886000
REG6     EQU   @06                                                      00887000
REG8     EQU   @08                                                      00888000
REG10    EQU   @10                                                      00889000
REG13    EQU   @13                                                      00890000
REG14    EQU   @14                                                      00891000
REG1011  EQU   @01                                                      00892000
EMCR13   EQU   @13                                                      00893000
REG15011 EQU   @15                                                      00894000
EMCR0    EQU   @00                                                      00895000
EMCR1    EQU   @01                                                      00896000
EMCR10   EQU   @10                                                      00897000
EMCR11   EQU   @11                                                      00898000
EMCR12   EQU   @12                                                      00899000
EMCR14   EQU   @14                                                      00900000
EMCR15   EQU   @15                                                      00901000
EMCR2    EQU   @02                                                      00902000
EMCR3    EQU   @03                                                      00903000
EMCR4    EQU   @04                                                      00904000
EMCR5    EQU   @05                                                      00905000
EMCR6    EQU   @06                                                      00906000
EMCR7    EQU   @07                                                      00907000
EMCR8    EQU   @08                                                      00908000
EMCR9    EQU   @09                                                      00909000
GPR00F   EQU   @00                                                      00910000
GPR01F   EQU   @01                                                      00911000
GPR02F   EQU   @02                                                      00912000
GPR03F   EQU   @03                                                      00913000
GPR04F   EQU   @04                                                      00914000
GPR05F   EQU   @05                                                      00915000
GPR11F   EQU   @11                                                      00916000
GPR12F   EQU   @12                                                      00917000
GPR13F   EQU   @13                                                      00918000
GPR14F   EQU   @14                                                      00919000
GPR15F   EQU   @15                                                      00920000
PSA      EQU   0                                                        00921000
FLCRNPSW EQU   PSA                                                      00922000
FLCROPSW EQU   PSA+8                                                    00923000
FLCICCW2 EQU   PSA+16                                                   00924000
PSAEEPSW EQU   PSA+132                                                  00925000
PSAESPSW EQU   PSA+136                                                  00926000
FLCSVILC EQU   PSAESPSW+1                                               00927000
PSAEPPSW EQU   PSA+140                                                  00928000
FLCPIILC EQU   PSAEPPSW+1                                               00929000
FLCPICOD EQU   PSAEPPSW+2                                               00930000
PSAPICOD EQU   FLCPICOD+1                                               00931000
FLCTEA   EQU   PSAEPPSW+4                                               00932000
FLCPER   EQU   PSA+152                                                  00933000
FLCMCLA  EQU   PSA+168                                                  00934000
FLCIOEL  EQU   FLCMCLA+4                                                00935000
FLCIOA   EQU   FLCMCLA+16                                               00936000
FLCFSA   EQU   FLCMCLA+80                                               00937000
PSASUPER EQU   PSA+552                                                  00938000
PSASUP1  EQU   PSASUPER                                                 00939000
PSASUP2  EQU   PSASUPER+1                                               00940000
PSASUP3  EQU   PSASUPER+2                                               00941000
PSASUP4  EQU   PSASUPER+3                                               00942000
PSACLHT  EQU   PSA+640                                                  00943000
PSALKSA  EQU   PSA+696                                                  00944000
PSAHLHI  EQU   PSA+760                                                  00945000
PSALITA  EQU   PSA+764                                                  00946000
PSADSSFL EQU   PSA+836                                                  00947000
PSADSSF1 EQU   PSADSSFL                                                 00948000
PSADSSF3 EQU   PSADSSFL+2                                               00949000
PSADSSF4 EQU   PSADSSFL+3                                               00950000
PSARSVT  EQU   PSA+896                                                  00951000
PSALSFCC EQU   PSA+1012                                                 00952000
CVTPTR   EQU   16                                                       00953000
ATCLCPTR EQU   1032                                                     00954000
SDWA     EQU   0                                                        00955000
SDWAPARM EQU   SDWA                                                     00956000
SDWAFIOB EQU   SDWA+4                                                   00957000
SDWAABCC EQU   SDWAFIOB                                                 00958000
SDWACMPF EQU   SDWAABCC                                                 00959000
SDWACTL1 EQU   SDWA+8                                                   00960000
SDWACMKA EQU   SDWACTL1                                                 00961000
SDWAMWPA EQU   SDWACTL1+1                                               00962000
SDWAPMKA EQU   SDWACTL1+4                                               00963000
SDWACTL2 EQU   SDWA+16                                                  00964000
SDWACMKP EQU   SDWACTL2                                                 00965000
SDWAMWPP EQU   SDWACTL2+1                                               00966000
SDWAPMKP EQU   SDWACTL2+4                                               00967000
SDWAGRSV EQU   SDWA+24                                                  00968000
SDWANAME EQU   SDWA+88                                                  00969000
SDWAEC1  EQU   SDWA+104                                                 00970000
SDWAEMK1 EQU   SDWAEC1                                                  00971000
SDWAMWP1 EQU   SDWAEC1+1                                                00972000
SDWAINT1 EQU   SDWAEC1+2                                                00973000
SDWANXT1 EQU   SDWAEC1+4                                                00974000
SDWAAEC1 EQU   SDWA+112                                                 00975000
SDWAILC1 EQU   SDWAAEC1+1                                               00976000
SDWAINC1 EQU   SDWAAEC1+2                                               00977000
SDWAICD1 EQU   SDWAINC1+1                                               00978000
SDWAEC2  EQU   SDWA+120                                                 00979000
SDWAEMK2 EQU   SDWAEC2                                                  00980000
SDWAMWP2 EQU   SDWAEC2+1                                                00981000
SDWAINT2 EQU   SDWAEC2+2                                                00982000
SDWANXT2 EQU   SDWAEC2+4                                                00983000
SDWAAEC2 EQU   SDWA+128                                                 00984000
SDWAILC2 EQU   SDWAAEC2+1                                               00985000
SDWAINC2 EQU   SDWAAEC2+2                                               00986000
SDWAICD2 EQU   SDWAINC2+1                                               00987000
SDWASRSV EQU   SDWA+136                                                 00988000
SDWASR01 EQU   SDWASRSV+4                                               00989000
SDWASR14 EQU   SDWASRSV+56                                              00990000
SDWAIDNT EQU   SDWA+200                                                 00991000
SDWAMCH  EQU   SDWA+204                                                 00992000
SDWASTCK EQU   SDWAMCH                                                  00993000
SDWAMCHI EQU   SDWAMCH+8                                                00994000
SDWAMCHS EQU   SDWAMCHI                                                 00995000
SDWAMCHD EQU   SDWAMCHI+1                                               00996000
SDWARSR1 EQU   SDWAMCH+12                                               00997000
SDWARSR2 EQU   SDWAMCH+13                                               00998000
SDWAFLGS EQU   SDWA+232                                                 00999000
SDWAERRA EQU   SDWAFLGS                                                 01000000
SDWAERRB EQU   SDWAFLGS+1                                               01001000
SDWAERRC EQU   SDWAFLGS+2                                               01002000
SDWAERRD EQU   SDWAFLGS+3                                               01003000
SDWAFMID EQU   SDWA+236                                                 01004000
SDWAIOFS EQU   SDWA+238                                                 01005000
SDWARTYA EQU   SDWA+240                                                 01006000
SDWACPUA EQU   SDWA+248                                                 01007000
SDWAPARQ EQU   SDWA+252                                                 01008000
SDWARCDE EQU   SDWAPARQ                                                 01009000
SDWAACF2 EQU   SDWAPARQ+1                                               01010000
SDWARCRD EQU   SDWAACF2                                                 01011000
SDWAUPRG EQU   SDWAACF2                                                 01012000
SDWAACF3 EQU   SDWAPARQ+2                                               01013000
SDWAACF4 EQU   SDWAPARQ+3                                               01014000
SDWALKWA EQU   SDWA+256                                                 01015000
SDWALKWS EQU   SDWALKWA                                                 01016000
SDWARECP EQU   SDWA+292                                                 01017000
SDWAMODN EQU   SDWARECP                                                 01018000
SDWACSCT EQU   SDWARECP+8                                               01019000
SDWAREXN EQU   SDWARECP+16                                              01020000
SDWASNPA EQU   SDWA+320                                                 01021000
SDWADUMP EQU   SDWASNPA                                                 01022000
SDWADPFS EQU   SDWADUMP+1                                               01023000
SDWADDAT EQU   SDWASNPA+4                                               01024000
SDWASDAT EQU   SDWADDAT                                                 01025000
SDWAPDAT EQU   SDWADDAT+2                                               01026000
SDWADPSA EQU   SDWA+328                                                 01027000
SDWADPSL EQU   SDWADPSA                                                 01028000
SDWARA   EQU   SDWA+400                                                 01029000
SDWADPVA EQU   SDWARA+2                                                 01030000
SDWAHEX  EQU   SDWADPVA                                                 01031000
SDWAURAL EQU   SDWARA+3                                                 01032000
SDWAVRA  EQU   SDWARA+4                                                 01033000
CVTMAP   EQU   0                                                        01034000
CVTBTERM EQU   CVTMAP+52                                                01035000
CVTDAR   EQU   CVTMAP+72                                                01036000
CVTFLGS1 EQU   CVTDAR                                                   01037000
CVTDCB   EQU   CVTMAP+116                                               01038000
CVTIERLC EQU   CVTMAP+144                                               01039000
CVTOPTA  EQU   CVTMAP+182                                               01040000
CVTOPTB  EQU   CVTMAP+183                                               01041000
CVTGTF   EQU   CVTMAP+236                                               01042000
CVTGTFST EQU   CVTGTF                                                   01043000
CVTGTFS  EQU   CVTGTFST                                                 01044000
CVTSTATE EQU   CVTGTFST                                                 01045000
CVTTMODE EQU   CVTGTFST                                                 01046000
CVTFORM  EQU   CVTGTFST                                                 01047000
CVTAQAVT EQU   CVTMAP+240                                               01048000
CVTTCMFG EQU   CVTAQAVT                                                 01049000
CVTVOLM2 EQU   CVTMAP+244                                               01050000
CVTTATA  EQU   CVTVOLM2                                                 01051000
CVTTSKS  EQU   CVTTATA                                                  01052000
CVTVOLF2 EQU   CVTTSKS                                                  01053000
CVTTAT   EQU   CVTTATA+1                                                01054000
CVTATER  EQU   CVTMAP+248                                               01055000
CVTEXT1  EQU   CVTMAP+252                                               01056000
CVTPURG  EQU   CVTMAP+260                                               01057000
CVTQMSG  EQU   CVTMAP+268                                               01058000
CVTDMSR  EQU   CVTMAP+272                                               01059000
CVTERPV  EQU   CVTMAP+316                                               01060000
CVTINTLA EQU   CVTMAP+320                                               01061000
CVTAPF   EQU   CVTMAP+324                                               01062000
CVTEXT2  EQU   CVTMAP+328                                               01063000
CVTHJES  EQU   CVTMAP+332                                               01064000
CVTPGSIA EQU   CVTMAP+348                                               01065000
CVTA1F1  EQU   CVTMAP+356                                               01066000
CVTSYSK  EQU   CVTMAP+357                                               01067000
CVTVOLM1 EQU   CVTMAP+380                                               01068000
CVTVOLF1 EQU   CVTVOLM1                                                 01069000
CVTATMCT EQU   CVTMAP+388                                               01070000
CVTXTNT1 EQU   0                                                        01071000
CVTXTNT2 EQU   0                                                        01072000
CVTDSSV  EQU   CVTXTNT2                                                 01073000
CVTFLGBT EQU   CVTXTNT2+5                                               01074000
CVTQID   EQU   CVTXTNT2+24                                              01075000
CVTSHS   EQU   CVTXTNT2+40                                              01076000
CVTRV400 EQU   CVTXTNT2+52                                              01077000
CVTRV409 EQU   CVTXTNT2+53                                              01078000
CVTATCVT EQU   CVTXTNT2+64                                              01079000
CVTRV429 EQU   CVTXTNT2+84                                              01080000
CVTRV438 EQU   CVTXTNT2+85                                              01081000
CVTRV457 EQU   CVTXTNT2+112                                             01082000
CVTRV466 EQU   CVTXTNT2+113                                             01083000
CVTFIX   EQU   0                                                        01084000
CVTRELNO EQU   CVTFIX+252                                               01085000
FRRS     EQU   0                                                        01086000
FRRSHEAD EQU   FRRS                                                     01087000
FRRSEMP  EQU   FRRSHEAD                                                 01088000
FRRSLAST EQU   FRRSHEAD+4                                               01089000
FRRSELEN EQU   FRRSHEAD+8                                               01090000
FRRSCURR EQU   FRRSHEAD+12                                              01091000
FRRSENTR EQU   0                                                        01092000
FRRSFRRA EQU   FRRSENTR                                                 01093000
FRRSFLGS EQU   FRRSENTR+4                                               01094000
FRRSFLG1 EQU   FRRSFLGS                                                 01095000
FRRSPARM EQU   FRRSENTR+8                                               01096000
IFGRPL   EQU   0                                                        01097000
RPLCOMN  EQU   IFGRPL                                                   01098000
RPLIDWD  EQU   RPLCOMN                                                  01099000
RPLID    EQU   RPLIDWD                                                  01100000
RPLLEN   EQU   RPLIDWD+3                                                01101000
RPLECB   EQU   RPLCOMN+8                                                01102000
RPLFDBWD EQU   RPLCOMN+12                                               01103000
RPLSTAT  EQU   RPLFDBWD                                                 01104000
RPLFDBK  EQU   RPLFDBWD+1                                               01105000
RPLRTNCD EQU   RPLFDBK                                                  01106000
RPLCNDCD EQU   RPLFDBK+1                                                01107000
RPLCMPON EQU   RPLCNDCD                                                 01108000
RPLFDB2  EQU   RPLCMPON                                                 01109000
RPLERRCD EQU   RPLCNDCD+1                                               01110000
RPLFDB3  EQU   RPLERRCD                                                 01111000
RPLKEYLE EQU   RPLCOMN+16                                               01112000
RPLARG   EQU   RPLCOMN+36                                               01113000
RPLOPTCD EQU   RPLCOMN+40                                               01114000
RPLOPT1  EQU   RPLOPTCD                                                 01115000
RPLECBSW EQU   RPLOPT1                                                  01116000
RPLOPT2  EQU   RPLOPTCD+1                                               01117000
RPLADR   EQU   RPLOPT2                                                  01118000
RPLOPT3  EQU   RPLOPTCD+2                                               01119000
RPLOPT4  EQU   RPLOPTCD+3                                               01120000
RPLNXTRP EQU   RPLCOMN+44                                               01121000
RPLOPTC2 EQU   RPLCOMN+56                                               01122000
RPLOPT5  EQU   RPLOPTC2                                                 01123000
RPLWRTYP EQU   RPLOPT5                                                  01124000
RPLOPT6  EQU   RPLOPTC2+1                                               01125000
RPLUNTYP EQU   RPLOPT6                                                  01126000
RPLOPT7  EQU   RPLOPTC2+2                                               01127000
RPLCNOPT EQU   RPLOPT7                                                  01128000
RPLOPT8  EQU   RPLOPTC2+3                                               01129000
RPLRBAR  EQU   RPLCOMN+60                                               01130000
RPLAIXID EQU   RPLRBAR+2                                                01131000
RPLEXTDS EQU   RPLCOMN+68                                               01132000
RPLEXTD1 EQU   RPLEXTDS                                                 01133000
SRBSECT  EQU   0                                                        01134000
SRBFLC   EQU   SRBSECT+12                                               01135000
SRBPTR   EQU   0                                                        01136000
R66M     EQU   0                                                        01137000
R66MPSTW EQU   R66M                                                     01138000
R6655R   EQU   R66MPSTW                                                 01139000
R66MPST  EQU   R66MPSTW+1                                               01140000
R66PAB   EQU   R66M+4                                                   01141000
R66RPL   EQU   R66M+8                                                   01142000
R66RTRYW EQU   R66M+12                                                  01143000
R66RTYON EQU   R66RTRYW                                                 01144000
R66RTRY  EQU   R66RTRYW+1                                               01145000
TCBFIX   EQU   0                                                        01146000
TCBFRS   EQU   TCBFIX                                                   01147000
TCB      EQU   0                                                        01148000
TCBPIE   EQU   TCB+4                                                    01149000
TCBPMASK EQU   TCBPIE                                                   01150000
TCBTIO   EQU   TCB+12                                                   01151000
TCBCMP   EQU   TCB+16                                                   01152000
TCBCMPF  EQU   TCBCMP                                                   01153000
TCBCPP   EQU   TCBCMPF                                                  01154000
TCBSTCC  EQU   TCBCMPF                                                  01155000
TCBCDBL  EQU   TCBCMPF                                                  01156000
TCBCWTO  EQU   TCBCMPF                                                  01157000
TCBCIND  EQU   TCBCMPF                                                  01158000
TCBCMSG  EQU   TCBCMPF                                                  01159000
TCBTRN   EQU   TCB+20                                                   01160000
TCBABF   EQU   TCBTRN                                                   01161000
TCBMSS   EQU   TCB+24                                                   01162000
TCBPKF   EQU   TCB+28                                                   01163000
TCBFLGS  EQU   TCB+29                                                   01164000
TCBFLGS1 EQU   TCBFLGS                                                  01165000
TCBFLGS2 EQU   TCBFLGS+1                                                01166000
TCBFLGS3 EQU   TCBFLGS+2                                                01167000
TCBFLGS4 EQU   TCBFLGS+3                                                01168000
TCBFLGS5 EQU   TCBFLGS+4                                                01169000
TCBABWF  EQU   TCBFLGS5                                                 01170000
TCBJPQ   EQU   TCB+44                                                   01171000
TCBPURGE EQU   TCBJPQ                                                   01172000
TCBGRS   EQU   TCB+48                                                   01173000
TCBFSA   EQU   TCB+112                                                  01174000
TCBTME   EQU   TCB+120                                                  01175000
TCBJSTCB EQU   TCB+124                                                  01176000
TCBTSFLG EQU   TCB+148                                                  01177000
TCBTSTSK EQU   TCBTSFLG                                                 01178000
TCBSTAB  EQU   TCB+160                                                  01179000
TCBNSTAE EQU   TCBSTAB                                                  01180000
TCBTCT   EQU   TCB+164                                                  01181000
TCBTCTGF EQU   TCBTCT                                                   01182000
TCBSCNDY EQU   TCB+172                                                  01183000
TCBNDSP  EQU   TCBSCNDY                                                 01184000
TCBNDSP1 EQU   TCBNDSP+1                                                01185000
TCBNDSP2 EQU   TCBNDSP+2                                                01186000
TCBNDSP3 EQU   TCBNDSP+3                                                01187000
TCBJSCB  EQU   TCB+180                                                  01188000
TCBRECDE EQU   TCBJSCB                                                  01189000
TCBEXT1  EQU   TCB+196                                                  01190000
TCBBITS  EQU   TCB+200                                                  01191000
TCBNDSP4 EQU   TCBBITS                                                  01192000
TCBNDSP5 EQU   TCBBITS+1                                                01193000
TCBFLGS6 EQU   TCBBITS+2                                                01194000
TCBFLGS7 EQU   TCBBITS+3                                                01195000
TCBDAR   EQU   TCB+204                                                  01196000
TCBDARC  EQU   TCBDAR                                                   01197000
TCBEXT2  EQU   TCB+208                                                  01198000
TCBXSCT  EQU   TCB+240                                                  01199000
TCBXSCT1 EQU   TCBXSCT                                                  01200000
TCBFOE   EQU   TCB+244                                                  01201000
TCBESTAE EQU   TCB+264                                                  01202000
TCBESTRM EQU   TCBESTAE+1                                               01203000
TCBFBYT1 EQU   TCB+276                                                  01204000
TCBFBYT2 EQU   TCB+277                                                  01205000
TCBRV124 EQU   TCB+278                                                  01206000
TCBRV133 EQU   TCB+279                                                  01207000
TCBXTNT2 EQU   0                                                        01208000
TCBGTF   EQU   TCBXTNT2                                                 01209000
TCBTFLG  EQU   TCBGTF                                                   01210000
TCBRV146 EQU   TCBXTNT2+28                                              01211000
TCBRV155 EQU   TCBXTNT2+29                                              01212000
TCBRV164 EQU   TCBXTNT2+30                                              01213000
TCBRV173 EQU   TCBXTNT2+31                                              01214000
TIOT1    EQU   0                                                        01215000
ISTPAB   EQU   0                                                        01216000
PABWQCHN EQU   ISTPAB                                                   01217000
PABWEQA  EQU   PABWQCHN                                                 01218000
PABCHAIN EQU   PABWQCHN+4                                               01219000
PABCHNGP EQU   PABCHAIN+1                                               01220000
PABRPHFG EQU   ISTPAB+12                                                01221000
PABFLAGS EQU   PABRPHFG                                                 01222000
PABERLCK EQU   PABFLAGS                                                 01223000
PABERRLK EQU   PABERLCK                                                 01224000
ISTDYPAB EQU   0                                                        01225000
ISTMPST  EQU   0                                                        01226000
MPSRQUE  EQU   ISTMPST+8                                                01227000
MPSFLGA  EQU   ISTMPST+12                                               01228000
MPSCRA   EQU   ISTMPST+24                                               01229000
MPSCRACT EQU   MPSCRA+4                                                 01230000
MPSSRB   EQU   ISTMPST+32                                               01231000
MPSSRBCT EQU   MPSSRB+4                                                 01232000
MPSCRPL  EQU   ISTMPST+40                                               01233000
MPSRPLCT EQU   MPSCRPL+4                                                01234000
MPSDBTBL EQU   ISTMPST+124                                              01235000
ISTLOK   EQU   0                                                        01236000
LOKCHN   EQU   ISTLOK+1                                                 01237000
LOKCHNG  EQU   LOKCHN                                                   01238000
@NM00092 EQU   LOKCHNG+2                                                01239000
ISTACDEB EQU   0                                                        01240000
ACDVTPRX EQU   ISTACDEB                                                 01241000
ACDTSKID EQU   ACDVTPRX+8                                               01242000
ACDDBPFX EQU   ISTACDEB+16                                              01243000
ACDTBLOF EQU   ACDDBPFX+6                                               01244000
ACDBASIC EQU   ISTACDEB+24                                              01245000
ACDTCBAD EQU   ACDBASIC                                                 01246000
ACDNMSUB EQU   ACDTCBAD                                                 01247000
ACDTCB   EQU   ACDTCBAD+1                                               01248000
ACDDEBAD EQU   ACDBASIC+4                                               01249000
ACDUSRPG EQU   ACDBASIC+16                                              01250000
ACDACBAD EQU   ACDBASIC+24                                              01251000
ACDAPPAD EQU   ACDBASIC+28                                              01252000
ACDVTAM  EQU   ISTACDEB+56                                              01253000
ACDSSFLG EQU   ACDVTAM+80                                               01254000
ACDAPDAT EQU   ACDVTAM+83                                               01255000
ISTRPH   EQU   0                                                        01256000
RPHCNTL  EQU   ISTRPH                                                   01257000
RPHFLAGS EQU   RPHCNTL+2                                                01258000
RPHAPTYP EQU   RPHFLAGS                                                 01259000
RPHFSTLC EQU   RPHFLAGS                                                 01260000
RPHFLGB  EQU   RPHCNTL+3                                                01261000
RPHRPHA  EQU   ISTRPH+4                                                 01262000
RPHTSKID EQU   ISTRPH+8                                                 01263000
RPHRESMA EQU   ISTRPH+16                                                01264000
RPHWPFLG EQU   RPHRESMA                                                 01265000
RPHWEA   EQU   ISTRPH+24                                                01266000
RPHCSPA  EQU   RPHWEA                                                   01267000
RPHSRPRM EQU   ISTRPH+28                                                01268000
RPHPABQA EQU   ISTRPH+36                                                01269000
RPHWORK  EQU   ISTRPH+40                                                01270000
RPHSAVE1 EQU   RPHWORK                                                  01271000
RPHSBITS EQU   RPHSAVE1+1                                               01272000
ISTPST   EQU   0                                                        01273000
PSTRQFGA EQU   ISTPST+8                                                 01274000
PSTRQUE  EQU   PSTRQFGA                                                 01275000
PSTFLGA  EQU   PSTRQFGA+4                                               01276000
PSTABINP EQU   PSTFLGA                                                  01277000
PSTDMPS  EQU   ISTPST+132                                               01278000
ISTDCE   EQU   0                                                        01279000
DCEDBPTR EQU   ISTDCE                                                   01280000
DCECHN   EQU   ISTDCE+4                                                 01281000
ISTATCVT EQU   0                                                        01282000
ATCCOM   EQU   ISTATCVT                                                 01283000
ATCSTAT  EQU   ATCCOM                                                   01284000
ATCSTAT1 EQU   ATCSTAT                                                  01285000
ATCSTFLG EQU   ATCSTAT+1                                                01286000
ATCPOFLG EQU   ATCSTAT+2                                                01287000
ATCSTAT4 EQU   ATCSTAT+3                                                01288000
ATCIOTRC EQU   ATCCOM+140                                               01289000
ATCTHTRC EQU   ATCIOTRC                                                 01290000
ATCCSMR  EQU   ISTATCVT+296                                             01291000
ATCSHRFG EQU   ISTATCVT+316                                             01292000
ATCMSGP  EQU   ISTATCVT+344                                             01293000
ATCHPGM  EQU   ISTATCVT+384                                             01294000
ATCVLCNT EQU   ISTATCVT+772                                             01295000
ATCRNO   EQU   ISTATCVT+788                                             01296000
ATCSOPD  EQU   ISTATCVT+792                                             01297000
ATCSIPD  EQU   ISTATCVT+800                                             01298000
ATCSECST EQU   ISTATCVT+812                                             01299000
ATCSTAT2 EQU   ISTATCVT+818                                             01300000
ATCVTBAM EQU   ISTATCVT+908                                             01301000
@NM00105 EQU   ATCVTBAM+3                                               01302000
ATCVTMAB EQU   @NM00105                                                 01303000
ATCAOSM  EQU   ISTATCVT+912                                             01304000
ATCGSRBQ EQU   ATCAOSM+4                                                01305000
ATCGSRBG EQU   ATCGSRBQ                                                 01306000
ATCAP32  EQU   ATCAOSM+28                                               01307000
ATCICAPP EQU   ATCAOSM+100                                              01308000
ATCCDTCB EQU   ATCICAPP+8                                               01309000
ATCLDAPP EQU   ATCAOSM+120                                              01310000
ATCDAPVT EQU   ATCAOSM+140                                              01311000
ATCVTFLG EQU   ATCAOSM+392                                              01312000
ATCAP69  EQU   ATCAOSM+540                                              01313000
ATCZFLAG EQU   ATCAOSM+588                                              01314000
ISTAVT   EQU   0                                                        01315000
ISTAS49  EQU   ISTAVT+4                                                 01316000
PARMLIST EQU   0                                                        01317000
DWORD0   EQU   PARMLIST                                                 01318000
SDMPAREA EQU   0                                                        01319000
RETRYAD  EQU   0                                                        01320000
ISTAPC32 EQU   0                                                        01321000
VARBLFLD EQU   0                                                        01322000
JOBN     EQU   VARBLFLD                                                 01323000
STEPN    EQU   VARBLFLD+8                                               01324000
@NM00109 EQU   0                                                        01325000
CMZID011 EQU   @NM00109                                                 01326000
@NM00110 EQU   @NM00109+4                                               01327000
CMZRL011 EQU   @NM00110                                                 01328000
CMZRA011 EQU   @NM00110+1                                               01329000
CMZEA011 EQU   @NM00109+8                                               01330000
CMZVP011 EQU   @NM00109+12                                              01331000
CMZSA011 EQU   0                                                        01332000
CMTA011  EQU   0                                                        01333000
LCPBPTR  EQU   0                                                        01334000
PSARSVTE EQU   PSARSVT                                                  01335000
PSACSTK  EQU   PSARSVTE                                                 01336000
CVTS01   EQU   CVTPGSIA                                                 01337000
CVTLPDIA EQU   CVTS01+12                                                01338000
CVTDIRST EQU   CVTLPDIA                                                 01339000
CVTSLIDA EQU   CVTS01+24                                                01340000
CVTCTLFG EQU   CVTS01+50                                                01341000
CVTSDMP  EQU   CVTS01+232                                               01342000
CVTRV210 EQU   CVTS01+424                                               01343000
CVTRV219 EQU   CVTS01+425                                               01344000
CVTRV228 EQU   CVTS01+426                                               01345000
CVTRV237 EQU   CVTS01+427                                               01346000
CVTMFRTR EQU   CVTS01+452                                               01347000
CVTRV262 EQU   CVTS01+468                                               01348000
CVTRV271 EQU   CVTS01+469                                               01349000
CVTRV280 EQU   CVTS01+470                                               01350000
CVTRV289 EQU   CVTS01+471                                               01351000
CVTGSDA  EQU   CVTS01+600                                               01352000
TIOTPTR  EQU   TCBTIO                                                   01353000
TIOENTRY EQU   TIOT1+24                                                 01354000
TIOESTTA EQU   TIOENTRY+1                                               01355000
TIOERLOC EQU   TIOENTRY+2                                               01356000
TIOELINK EQU   TIOERLOC+1                                               01357000
TIOESYOT EQU   TIOELINK                                                 01358000
TIOESTTC EQU   TIOENTRY+15                                              01359000
TIOESTTB EQU   TIOENTRY+16                                              01360000
POOLSTAR EQU   TIOENTRY+20                                              01361000
TIOEDEVE EQU   TIOESTTB                                                 01362000
TIOSTTB  EQU   TIOEDEVE                                                 01363000
PABP     EQU   R66PAB                                                   01364000
FRPABA   EQU   PABP+1                                                   01365000
FLC      EQU   PSA                                                      01366000
SRB      EQU   SRBSECT                                                  01367000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01368000
@NM00108 EQU   PABP                                                     01369000
TIOUCBP  EQU   TIOEDEVE+1                                               01370000
TIOVERF  EQU   TIOSTTB                                                  01371000
TIOUNLD  EQU   TIOSTTB                                                  01372000
TIOMNTD  EQU   TIOSTTB                                                  01373000
TIOSETU  EQU   TIOSTTB                                                  01374000
TIOVLSR  EQU   TIOSTTB                                                  01375000
TIOPVIO  EQU   TIOSTTB                                                  01376000
TIOREQD  EQU   TIOSTTB                                                  01377000
TIOUSED  EQU   TIOSTTB                                                  01378000
TIOTFEND EQU   POOLSTAR+16                                              01379000
TIOPSLOT EQU   POOLSTAR+13                                              01380000
TIOPSTTB EQU   POOLSTAR+12                                              01381000
TIOPPOOL EQU   POOLSTAR+4                                               01382000
TIOPNSRT EQU   POOLSTAR+3                                               01383000
@NM00090 EQU   POOLSTAR+2                                               01384000
TIOPNSLT EQU   POOLSTAR+1                                               01385000
@NM00089 EQU   POOLSTAR                                                 01386000
TIOEFSRT EQU   TIOENTRY+17                                              01387000
TIOSVERF EQU   TIOESTTB                                                 01388000
TIOSUNLD EQU   TIOESTTB                                                 01389000
TIOSMNTD EQU   TIOESTTB                                                 01390000
TIOSSETU EQU   TIOESTTB                                                 01391000
TIOSVLSR EQU   TIOESTTB                                                 01392000
TIOSPVIO EQU   TIOESTTB                                                 01393000
TIOSREQD EQU   TIOESTTB                                                 01394000
TIOSUSED EQU   TIOESTTB                                                 01395000
TIOSBALS EQU   TIOESTTC                                                 01396000
TIOSBALP EQU   TIOESTTC                                                 01397000
TIOSVOLS EQU   TIOESTTC                                                 01398000
TIOSVOLP EQU   TIOESTTC                                                 01399000
TIOSAFFS EQU   TIOESTTC                                                 01400000
TIOSAFFP EQU   TIOESTTC                                                 01401000
TIOSDEFR EQU   TIOESTTC                                                 01402000
TIOSDKCR EQU   TIOESTTC                                                 01403000
TIOEJFCB EQU   TIOENTRY+12                                              01404000
TIOEDDNM EQU   TIOENTRY+4                                               01405000
TIOTREM  EQU   TIOELINK                                                 01406000
TIOESSDS EQU   TIOESYOT                                                 01407000
TIOESYIN EQU   TIOELINK                                                 01408000
TIOEQNAM EQU   TIOELINK                                                 01409000
TIOEDYNM EQU   TIOELINK                                                 01410000
TIOTTERM EQU   TIOELINK                                                 01411000
TIOTRV01 EQU   TIOELINK                                                 01412000
TIOSYOUT EQU   TIOELINK                                                 01413000
TIOEWTCT EQU   TIOERLOC                                                 01414000
TIOSDSP2 EQU   TIOESTTA                                                 01415000
TIOSDSP1 EQU   TIOESTTA                                                 01416000
TIOSLABL EQU   TIOESTTA                                                 01417000
TIOSDADS EQU   TIOESTTA                                                 01418000
TIOSJBLB EQU   TIOESTTA                                                 01419000
TIOSPLTS EQU   TIOESTTA                                                 01420000
TIOSPLTP EQU   TIOESTTA                                                 01421000
TIOSLTYP EQU   TIOESTTA                                                 01422000
TIOELNGH EQU   TIOENTRY                                                 01423000
CVTRV628 EQU   CVTS01+728                                               01424000
CVTRV627 EQU   CVTS01+724                                               01425000
CVTRV626 EQU   CVTS01+720                                               01426000
CVTRV625 EQU   CVTS01+716                                               01427000
CVTRV624 EQU   CVTS01+712                                               01428000
CVTRV623 EQU   CVTS01+708                                               01429000
CVTRV622 EQU   CVTS01+704                                               01430000
CVTRV621 EQU   CVTS01+700                                               01431000
CVTRV620 EQU   CVTS01+696                                               01432000
CVTSUSP  EQU   CVTS01+692                                               01433000
CVTT6SVC EQU   CVTS01+688                                               01434000
CVTCDAL  EQU   CVTS01+684                                               01435000
CVTTCTL  EQU   CVTS01+680                                               01436000
CVTRSUME EQU   CVTS01+676                                               01437000
CVTJTERM EQU   CVTS01+672                                               01438000
CVTASMRM EQU   CVTS01+668                                               01439000
CVTTCASP EQU   CVTS01+664                                               01440000
CVT0PT03 EQU   CVTS01+660                                               01441000
CVT0PT0E EQU   CVTS01+656                                               01442000
CVTIRM   EQU   CVTS01+652                                               01443000
CVTCGK   EQU   CVTS01+648                                               01444000
CVTRAC   EQU   CVTS01+644                                               01445000
CVTRV606 EQU   CVTS01+640                                               01446000
CVTRV605 EQU   CVTS01+636                                               01447000
CVTRV604 EQU   CVTS01+632                                               01448000
CVTEFF02 EQU   CVTS01+628                                               01449000
CVTCBBR  EQU   CVTS01+624                                               01450000
CVTSSCR  EQU   CVTS01+620                                               01451000
CVTEVENT EQU   CVTS01+616                                               01452000
CVTCRCA  EQU   CVTS01+612                                               01453000
CVTTPIO  EQU   CVTS01+608                                               01454000
CVTADV   EQU   CVTS01+604                                               01455000
CVTGSDAB EQU   CVTGSDA                                                  01456000
CVTQV3   EQU   CVTS01+596                                               01457000
CVTQV2   EQU   CVTS01+592                                               01458000
CVTQV1   EQU   CVTS01+588                                               01459000
CVTRPT   EQU   CVTS01+584                                               01460000
CVTSSRB  EQU   CVTS01+580                                               01461000
CVTCSDRL EQU   CVTS01+576                                               01462000
CVTEXP1  EQU   CVTS01+572                                               01463000
CVTRMPMT EQU   CVTS01+568                                               01464000
CVTRMPTT EQU   CVTS01+564                                               01465000
CVTVPSA  EQU   CVTS01+560                                               01466000
CVTVSTOP EQU   CVTS01+556                                               01467000
CVTGTFR8 EQU   CVTS01+552                                               01468000
CVTQUIT  EQU   CVTS01+548                                               01469000
CVTVACR  EQU   CVTS01+544                                               01470000
CVTWTCB  EQU   CVTS01+540                                               01471000
CVTSTPRS EQU   CVTS01+536                                               01472000
CVT0PT02 EQU   CVTS01+532                                               01473000
CVTDARCM EQU   CVTS01+528                                               01474000
CVTIRECM EQU   CVTS01+524                                               01475000
CVTJRECM EQU   CVTS01+520                                               01476000
CVTVEMS0 EQU   CVTS01+516                                               01477000
CVTSPFRR EQU   CVTS01+512                                               01478000
CVTRLSTG EQU   CVTS01+508                                               01479000
CVT0TC0A EQU   CVTS01+504                                               01480000
CVTGMBR  EQU   CVTS01+500                                               01481000
CVTLFRM  EQU   CVTS01+496                                               01482000
CVTRMBR  EQU   CVTS01+492                                               01483000
CVTVIOP  EQU   CVTS01+488                                               01484000
CVTRV307 EQU   CVTS01+486                                               01485000
CVTRV306 EQU   CVTS01+484                                               01486000
CVTRV305 EQU   CVTS01+482                                               01487000
CVTRV304 EQU   CVTS01+480                                               01488000
CVTRV303 EQU   CVTS01+478                                               01489000
CVTRV302 EQU   CVTS01+476                                               01490000
CVTTRCA  EQU   CVTS01+472                                               01491000
CVTRV297 EQU   CVTRV289                                                 01492000
CVTRV296 EQU   CVTRV289                                                 01493000
CVTRV295 EQU   CVTRV289                                                 01494000
CVTRV294 EQU   CVTRV289                                                 01495000
CVTRV293 EQU   CVTRV289                                                 01496000
CVTRV292 EQU   CVTRV289                                                 01497000
CVTRV291 EQU   CVTRV289                                                 01498000
CVTRV290 EQU   CVTRV289                                                 01499000
CVTRV288 EQU   CVTRV280                                                 01500000
CVTRV287 EQU   CVTRV280                                                 01501000
CVTRV286 EQU   CVTRV280                                                 01502000
CVTRV285 EQU   CVTRV280                                                 01503000
CVTRV284 EQU   CVTRV280                                                 01504000
CVTRV283 EQU   CVTRV280                                                 01505000
CVTRV282 EQU   CVTRV280                                                 01506000
CVTRV281 EQU   CVTRV280                                                 01507000
CVTRV279 EQU   CVTRV271                                                 01508000
CVTRV278 EQU   CVTRV271                                                 01509000
CVTRV277 EQU   CVTRV271                                                 01510000
CVTRV276 EQU   CVTRV271                                                 01511000
CVTRV275 EQU   CVTRV271                                                 01512000
CVTRV274 EQU   CVTRV271                                                 01513000
CVTRV273 EQU   CVTRV271                                                 01514000
CVTRV272 EQU   CVTRV271                                                 01515000
CVTRV270 EQU   CVTRV262                                                 01516000
CVTRV269 EQU   CVTRV262                                                 01517000
CVTRV268 EQU   CVTRV262                                                 01518000
CVTRV267 EQU   CVTRV262                                                 01519000
CVTRV266 EQU   CVTRV262                                                 01520000
CVTRV265 EQU   CVTRV262                                                 01521000
CVTRV264 EQU   CVTRV262                                                 01522000
CVTRV263 EQU   CVTRV262                                                 01523000
CVTVFP   EQU   CVTS01+464                                               01524000
CVTVSI   EQU   CVTS01+460                                               01525000
CVTVPSIB EQU   CVTS01+456                                               01526000
CVTMFACT EQU   CVTMFRTR                                                 01527000
CVTMFCTL EQU   CVTS01+448                                               01528000
CVTPVBP  EQU   CVTS01+444                                               01529000
CVTPWI   EQU   CVTS01+440                                               01530000
CVTRV254 EQU   CVTS01+438                                               01531000
CVTRV253 EQU   CVTS01+436                                               01532000
CVTRV252 EQU   CVTS01+434                                               01533000
CVTRV251 EQU   CVTS01+433                                               01534000
CVTRV250 EQU   CVTS01+432                                               01535000
CVTRV249 EQU   CVTS01+431                                               01536000
CVTRV248 EQU   CVTS01+430                                               01537000
CVTRV247 EQU   CVTS01+429                                               01538000
CVTRV246 EQU   CVTS01+428                                               01539000
CVTRV245 EQU   CVTRV237                                                 01540000
CVTRV244 EQU   CVTRV237                                                 01541000
CVTRV243 EQU   CVTRV237                                                 01542000
CVTRV242 EQU   CVTRV237                                                 01543000
CVTRV241 EQU   CVTRV237                                                 01544000
CVTRV240 EQU   CVTRV237                                                 01545000
CVTRV239 EQU   CVTRV237                                                 01546000
CVTRV238 EQU   CVTRV237                                                 01547000
CVTRV236 EQU   CVTRV228                                                 01548000
CVTRV235 EQU   CVTRV228                                                 01549000
CVTRV234 EQU   CVTRV228                                                 01550000
CVTRV233 EQU   CVTRV228                                                 01551000
CVTRV232 EQU   CVTRV228                                                 01552000
CVTRV231 EQU   CVTRV228                                                 01553000
CVTRV230 EQU   CVTRV228                                                 01554000
CVTRV229 EQU   CVTRV228                                                 01555000
CVTRV227 EQU   CVTRV219                                                 01556000
CVTRV226 EQU   CVTRV219                                                 01557000
CVTRV225 EQU   CVTRV219                                                 01558000
CVTRV224 EQU   CVTRV219                                                 01559000
CVTRV223 EQU   CVTRV219                                                 01560000
CVTRV222 EQU   CVTRV219                                                 01561000
CVTRV221 EQU   CVTRV219                                                 01562000
CVTRV220 EQU   CVTRV219                                                 01563000
CVTRV218 EQU   CVTRV210                                                 01564000
CVTRV217 EQU   CVTRV210                                                 01565000
CVTRV216 EQU   CVTRV210                                                 01566000
CVTRV215 EQU   CVTRV210                                                 01567000
CVTRV214 EQU   CVTRV210                                                 01568000
CVTRV213 EQU   CVTRV210                                                 01569000
CVTRV212 EQU   CVTRV210                                                 01570000
CVTRV211 EQU   CVTRV210                                                 01571000
CVTLCCAT EQU   CVTS01+420                                               01572000
CVTPCCAT EQU   CVTS01+416                                               01573000
CVTIPCRP EQU   CVTS01+412                                               01574000
CVTIPCRI EQU   CVTS01+408                                               01575000
CVTIPCDS EQU   CVTS01+404                                               01576000
CVTAIDVT EQU   CVTS01+400                                               01577000
CVTSSAP  EQU   CVTS01+396                                               01578000
CVTEHCIR EQU   CVTS01+392                                               01579000
CVTEHDEF EQU   CVTS01+388                                               01580000
CVTDAIR  EQU   CVTS01+384                                               01581000
CVTPERFM EQU   CVTS01+380                                               01582000
CVT044R2 EQU   CVTS01+376                                               01583000
CVTFETCH EQU   CVTS01+372                                               01584000
CVTRSTWD EQU   CVTS01+368                                               01585000
CVTSPOST EQU   CVTS01+364                                               01586000
CVTIOBP  EQU   CVTS01+360                                               01587000
CVTASMVT EQU   CVTS01+356                                               01588000
CVTRECRQ EQU   CVTS01+352                                               01589000
CVTWSAC  EQU   CVTS01+348                                               01590000
CVTRV149 EQU   CVTS01+344                                               01591000
CVTWSAL  EQU   CVTS01+340                                               01592000
CVTSPSA  EQU   CVTS01+336                                               01593000
CVTGLMN  EQU   CVTS01+332                                               01594000
CVTVEAC0 EQU   CVTS01+328                                               01595000
CVT062R1 EQU   CVTS01+324                                               01596000
CVTRPOST EQU   CVTS01+320                                               01597000
CVTDQIQE EQU   CVTS01+316                                               01598000
CVTCSD   EQU   CVTS01+312                                               01599000
CVTLKRMA EQU   CVTS01+308                                               01600000
CVTRSPIE EQU   CVTS01+304                                               01601000
CVTRENQ  EQU   CVTS01+300                                               01602000
CVTLQCB  EQU   CVTS01+296                                               01603000
CVTFQCB  EQU   CVTS01+292                                               01604000
CVTQCS01 EQU   CVTS01+288                                               01605000
CVTAPFT  EQU   CVTS01+284                                               01606000
CVTPARRL EQU   CVTS01+280                                               01607000
CVTVWAIT EQU   CVTS01+276                                               01608000
CVTGSPL  EQU   CVTS01+272                                               01609000
CVTLSMQ  EQU   CVTS01+268                                               01610000
CVTGSMQ  EQU   CVTS01+264                                               01611000
CVTEXPRO EQU   CVTS01+260                                               01612000
CVTOPCTP EQU   CVTS01+256                                               01613000
CVTSIC   EQU   CVTS01+252                                               01614000
CVTTPIOS EQU   CVTS01+248                                               01615000
CVTRTMS  EQU   CVTS01+244                                               01616000
CVTSDBF  EQU   CVTS01+240                                               01617000
CVTSCBP  EQU   CVTS01+236                                               01618000
CVTSV60  EQU   CVTS01+228                                               01619000
CVTRTMCT EQU   CVTS01+224                                               01620000
CVTASCBL EQU   CVTS01+220                                               01621000
CVTASCBH EQU   CVTS01+216                                               01622000
CVTGDA   EQU   CVTS01+212                                               01623000
CVTASVT  EQU   CVTS01+208                                               01624000
CVTVVMDI EQU   CVTS01+204                                               01625000
CVTAQTOP EQU   CVTS01+200                                               01626000
CVTIOSCS EQU   CVTS01+196                                               01627000
CVTSDRM  EQU   CVTS01+192                                               01628000
CVTOPTE  EQU   CVTS01+188                                               01629000
CVTSTXU  EQU   CVTS01+184                                               01630000
CVTQUIS  EQU   CVTS01+180                                               01631000
CVTPARS  EQU   CVTS01+176                                               01632000
CVTS1EE  EQU   CVTS01+172                                               01633000
CVTFRAS  EQU   CVTS01+168                                               01634000
CVTQSAS  EQU   CVTS01+164                                               01635000
CVTCRAS  EQU   CVTS01+160                                               01636000
CVTCRMN  EQU   CVTS01+156                                               01637000
CVTDELCP EQU   CVTS01+152                                               01638000
CVTFRECL EQU   CVTS01+148                                               01639000
CVTGETCL EQU   CVTS01+144                                               01640000
CVTBLDCP EQU   CVTS01+140                                               01641000
CVTAUTHL EQU   CVTS01+136                                               01642000
CVTSCAN  EQU   CVTS01+132                                               01643000
CVTRV144 EQU   CVTS01+130                                               01644000
CVTMAXMP EQU   CVTS01+128                                               01645000
CVTSTCK  EQU   CVTS01+124                                               01646000
CVTRV139 EQU   CVTS01+123                                               01647000
CVTDSSAC EQU   CVTS01+122                                               01648000
CVTRV513 EQU   CVTS01+121                                               01649000
CVTIOSPL EQU   CVTS01+120                                               01650000
CVTPTGT  EQU   CVTS01+116                                               01651000
CVTCSPIE EQU   CVTS01+112                                               01652000
CVTSMFEX EQU   CVTS01+108                                               01653000
CVTOLT0A EQU   CVTS01+104                                               01654000
CVTSRBRT EQU   CVTS01+100                                               01655000
CVTPUTL  EQU   CVTS01+96                                                01656000
CVTASCRL EQU   CVTS01+92                                                01657000
CVTASCRF EQU   CVTS01+88                                                01658000
CVTRV326 EQU   CVTS01+84                                                01659000
CVTRV325 EQU   CVTS01+80                                                01660000
CVTRV324 EQU   CVTS01+76                                                01661000
CVT0VL01 EQU   CVTS01+72                                                01662000
CVTSHRVM EQU   CVTS01+68                                                01663000
CVTRV332 EQU   CVTS01+64                                                01664000
CVTTAS   EQU   CVTS01+60                                                01665000
CVTRSCN  EQU   CVTS01+56                                                01666000
CVTTRAC2 EQU   CVTS01+54                                                01667000
CVTTRACE EQU   CVTS01+52                                                01668000
CVTAPG   EQU   CVTS01+51                                                01669000
CVTSDTRC EQU   CVTCTLFG                                                 01670000
CVTGTRCE EQU   CVTCTLFG                                                 01671000
CVTNOMP  EQU   CVTCTLFG                                                 01672000
CVTRSV79 EQU   CVTCTLFG                                                 01673000
CVTDSTAT EQU   CVTCTLFG                                                 01674000
CVTRSV78 EQU   CVTCTLFG                                                 01675000
CVTRV333 EQU   CVTCTLFG                                                 01676000
CVTRV323 EQU   CVTCTLFG                                                 01677000
CVTSPVLK EQU   CVTS01+49                                                01678000
CVTRSV77 EQU   CVTS01+48                                                01679000
CVTRV331 EQU   CVTS01+44                                                01680000
CVTRV330 EQU   CVTS01+40                                                01681000
CVTRV329 EQU   CVTS01+36                                                01682000
CVTRV328 EQU   CVTS01+32                                                01683000
CVTRV322 EQU   CVTS01+28                                                01684000
CVTSLID  EQU   CVTSLIDA+1                                               01685000
CVTSYLK  EQU   CVTSLIDA                                                 01686000
CVTRV321 EQU   CVTS01+20                                                01687000
CVTRV320 EQU   CVTS01+16                                                01688000
CVTLPDIR EQU   CVTLPDIA+1                                               01689000
CVTRSV69 EQU   CVTDIRST                                                 01690000
CVTRSV68 EQU   CVTDIRST                                                 01691000
CVTRSV67 EQU   CVTDIRST                                                 01692000
CVTRSV66 EQU   CVTDIRST                                                 01693000
CVTRSV65 EQU   CVTDIRST                                                 01694000
CVTRSV64 EQU   CVTDIRST                                                 01695000
CVTRSV63 EQU   CVTDIRST                                                 01696000
CVTDICOM EQU   CVTDIRST                                                 01697000
CVTPVTP  EQU   CVTS01+8                                                 01698000
CVTLPDSR EQU   CVTS01+4                                                 01699000
CVTGETL  EQU   CVTS01                                                   01700000
PSARSAV  EQU   PSARSVTE+60                                              01701000
PSARSTK  EQU   PSARSVTE+56                                              01702000
PSAESAV3 EQU   PSARSVTE+52                                              01703000
PSAESTK3 EQU   PSARSVTE+48                                              01704000
PSAESAV2 EQU   PSARSVTE+44                                              01705000
PSAESTK2 EQU   PSARSVTE+40                                              01706000
PSAESAV1 EQU   PSARSVTE+36                                              01707000
PSAESTK1 EQU   PSARSVTE+32                                              01708000
PSAPSAV  EQU   PSARSVTE+28                                              01709000
PSAPSTK  EQU   PSARSVTE+24                                              01710000
PSAMSAV  EQU   PSARSVTE+20                                              01711000
PSAMSTK  EQU   PSARSVTE+16                                              01712000
PSASSAV  EQU   PSARSVTE+12                                              01713000
PSASSTK  EQU   PSARSVTE+8                                               01714000
PSANSTK  EQU   PSARSVTE+4                                               01715000
ISTPDAVP EQU   ISTAVT+40                                                01716000
ISTAVR01 EQU   ISTAVT+38                                                01717000
ISTVTTP  EQU   ISTAVT+36                                                01718000
ISTAGTWT EQU   ISTAVT+34                                                01719000
ISTATRT  EQU   ISTAVT+32                                                01720000
ISTARID  EQU   ISTAVT+30                                                01721000
ISTX1    EQU   ISTAVT+29                                                01722000
ISTPHNM  EQU   ISTAVT+24                                                01723000
ISTAPSEX EQU   ISTAVT+20                                                01724000
ISTVTTIK EQU   ISTAVT+18                                                01725000
AVTASID  EQU   ISTAVT+16                                                01726000
ISTAPSTA EQU   ISTAVT+12                                                01727000
ISTAS53  EQU   ISTAVT+8                                                 01728000
ISTAHIP  EQU   ISTAS49                                                  01729000
ISTACVT  EQU   ISTAVT                                                   01730000
ATCAOS   EQU   ISTATCVT+1584                                            01731000
ATCPOPAB EQU   ATCAOSM+640                                              01732000
ATCVIOPM EQU   ATCAOSM+636                                              01733000
ATCTPMMI EQU   ATCAOSM+632                                              01734000
ATCTPMPB EQU   ATCAOSM+600                                              01735000
ATCRSV88 EQU   ATCAOSM+596                                              01736000
ATCRPLCT EQU   ATCAOSM+594                                              01737000
ATCCRACT EQU   ATCAOSM+592                                              01738000
ATCSRBCT EQU   ATCAOSM+590                                              01739000
ATCRSV75 EQU   ATCAOSM+589                                              01740000
ATCRSV66 EQU   ATCZFLAG                                                 01741000
ATCZF001 EQU   ATCZFLAG                                                 01742000
ATCTPCP1 EQU   ATCAOSM+584                                              01743000
ATCTPCP0 EQU   ATCAOSM+580                                              01744000
ATCAICTN EQU   ATCAOSM+576                                              01745000
ATCZR01  EQU   ATCAOSM+572                                              01746000
ATCMPLTA EQU   ATCAOSM+568                                              01747000
ATCASCB  EQU   ATCAOSM+564                                              01748000
ATCAP86  EQU   ATCAOSM+560                                              01749000
ATCAP85  EQU   ATCAOSM+556                                              01750000
ATCAP84  EQU   ATCAOSM+552                                              01751000
ATCAP83  EQU   ATCAOSM+548                                              01752000
ATCAP82  EQU   ATCAOSM+544                                              01753000
ATCAP66  EQU   ATCAOSM+536                                              01754000
ATCAP62  EQU   ATCAOSM+532                                              01755000
ATCAPC59 EQU   ATCAOSM+528                                              01756000
ATCAP56  EQU   ATCAOSM+524                                              01757000
ATCAP55  EQU   ATCAOSM+520                                              01758000
ATCRCFY0 EQU   ATCAOSM+516                                              01759000
ATCAP41  EQU   ATCAOSM+512                                              01760000
ATCAPC25 EQU   ATCAOSM+508                                              01761000
ATCAP23  EQU   ATCAOSM+504                                              01762000
ATCTPSPB EQU   ATCAOSM+472                                              01763000
ATCTRMPB EQU   ATCAOSM+440                                              01764000
ATCAPBE  EQU   ATCAOSM+436                                              01765000
ATCPSTA  EQU   ATCAOSM+432                                              01766000
ATCSMABF EQU   ATCAOSM+428                                              01767000
ATCSMAPR EQU   ATCAOSM+424                                              01768000
ATCTPWQA EQU   ATCAOSM+420                                              01769000
ATCSMAID EQU   ATCAOSM+416                                              01770000
ATCSMARA EQU   ATCAOSM+412                                              01771000
ATCCACXA EQU   ATCAOSM+408                                              01772000
ATCZLAAB EQU   ATCAOSM+404                                              01773000
ATCATA10 EQU   ATCAOSM+400                                              01774000
ATCHLTCB EQU   ATCAOSM+396                                              01775000
@NM00107 EQU   ATCVTFLG                                                 01776000
ATCVTACT EQU   ATCVTFLG                                                 01777000
ATCRPT40 EQU   ATCAOSM+388                                              01778000
ATCRPT39 EQU   ATCAOSM+384                                              01779000
ATCRPT38 EQU   ATCAOSM+380                                              01780000
ATCRPT37 EQU   ATCAOSM+376                                              01781000
ATCRPT36 EQU   ATCAOSM+372                                              01782000
ATCRPT35 EQU   ATCAOSM+368                                              01783000
ATCRPT34 EQU   ATCAOSM+364                                              01784000
ATCRPT33 EQU   ATCAOSM+360                                              01785000
ATCRPT32 EQU   ATCAOSM+356                                              01786000
ATCRPT31 EQU   ATCAOSM+352                                              01787000
ATCRPT30 EQU   ATCAOSM+348                                              01788000
ATCRPT29 EQU   ATCAOSM+344                                              01789000
ATCRPT28 EQU   ATCAOSM+340                                              01790000
ATCRPT27 EQU   ATCAOSM+336                                              01791000
ATCRPT26 EQU   ATCAOSM+332                                              01792000
ATCRPT25 EQU   ATCAOSM+328                                              01793000
ATCRPT24 EQU   ATCAOSM+324                                              01794000
ATCRPT23 EQU   ATCAOSM+320                                              01795000
ATCRPT22 EQU   ATCAOSM+316                                              01796000
ATCRPT21 EQU   ATCAOSM+312                                              01797000
ATCRPT20 EQU   ATCAOSM+308                                              01798000
ATCRPT19 EQU   ATCAOSM+304                                              01799000
ATCRPT18 EQU   ATCAOSM+300                                              01800000
ATCRPT17 EQU   ATCAOSM+296                                              01801000
ATCRPT16 EQU   ATCAOSM+292                                              01802000
ATCRPT15 EQU   ATCAOSM+288                                              01803000
ATCRPT14 EQU   ATCAOSM+284                                              01804000
ATCRPT13 EQU   ATCAOSM+280                                              01805000
ATCRPT12 EQU   ATCAOSM+276                                              01806000
ATCDMAPP EQU   ATCAOSM+272                                              01807000
ATCAP38  EQU   ATCAOSM+268                                              01808000
ATCAP37  EQU   ATCAOSM+264                                              01809000
ATCZDFJ0 EQU   ATCAOSM+260                                              01810000
ATCAP51  EQU   ATCAOSM+256                                              01811000
ATCZPAB2 EQU   ATCAOSM+224                                              01812000
ATCZPAB1 EQU   ATCAOSM+192                                              01813000
ATCZLFVT EQU   ATCAOSM+188                                              01814000
ATCZLPVT EQU   ATCAOSM+184                                              01815000
ATCZDVTX EQU   ATCAOSM+180                                              01816000
ATCZDVTA EQU   ATCAOSM+176                                              01817000
ATCZDVT9 EQU   ATCAOSM+172                                              01818000
ATCZDVT8 EQU   ATCAOSM+168                                              01819000
ATCZDVT7 EQU   ATCAOSM+164                                              01820000
ATCRSV56 EQU   ATCDAPVT+22                                              01821000
ATCDAPDG EQU   ATCDAPVT+20                                              01822000
ATCDXCEA EQU   ATCDAPVT+16                                              01823000
ATCDCEA  EQU   ATCDAPVT+12                                              01824000
ATCDPCIA EQU   ATCDAPVT+8                                               01825000
ATCDSIOA EQU   ATCDAPVT+4                                               01826000
ATCDEOEA EQU   ATCDAPVT                                                 01827000
ATCZLAEA EQU   ATCLDAPP+16                                              01828000
ATCZLCEA EQU   ATCLDAPP+12                                              01829000
ATCRSV17 EQU   ATCLDAPP+8                                               01830000
ATCSMFRR EQU   ATCLDAPP+4                                               01831000
ATCCDTID EQU   ATCLDAPP                                                 01832000
ATCZAEA  EQU   ATCICAPP+16                                              01833000
ATCZCEA  EQU   ATCICAPP+12                                              01834000
ATCZSIOA EQU   ATCICAPP+4                                               01835000
ATCCDRPH EQU   ATCICAPP                                                 01836000
ATCAP65  EQU   ATCAOSM+96                                               01837000
ATCZDVT6 EQU   ATCAOSM+92                                               01838000
ATCZDVT4 EQU   ATCAOSM+88                                               01839000
ATCZDVT3 EQU   ATCAOSM+84                                               01840000
ATCZDVT1 EQU   ATCAOSM+80                                               01841000
ATCICNCB EQU   ATCAOSM+76                                               01842000
ATCZPSVT EQU   ATCAOSM+72                                               01843000
ATCZFSVT EQU   ATCAOSM+68                                               01844000
ATCAP64  EQU   ATCAOSM+64                                               01845000
ATCAP63  EQU   ATCAOSM+60                                               01846000
ATCAP61  EQU   ATCAOSM+56                                               01847000
ATCAP58  EQU   ATCAOSM+52                                               01848000
ATCAP57  EQU   ATCAOSM+48                                               01849000
ATCAP54  EQU   ATCAOSM+44                                               01850000
ATCAP53  EQU   ATCAOSM+40                                               01851000
ATCAP52  EQU   ATCAOSM+36                                               01852000
ATCAP34  EQU   ATCAOSM+32                                               01853000
ATCAP31  EQU   ATCAOSM+24                                               01854000
ATCAP12  EQU   ATCAOSM+20                                               01855000
ATCAP11  EQU   ATCAOSM+16                                               01856000
ATCCMTCB EQU   ATCAOSM+12                                               01857000
ATCPRPH  EQU   ATCAOSM+8                                                01858000
ATCGSRBF EQU   ATCGSRBG                                                 01859000
ATCSRBRT EQU   ATCAOSM                                                  01860000
@NM00106 EQU   @NM00105                                                 01861000
@NM00104 EQU   ATCVTBAM                                                 01862000
ATCVDLOK EQU   ISTATCVT+904                                             01863000
ATCVFPAB EQU   ISTATCVT+872                                             01864000
ATCVDPAB EQU   ISTATCVT+840                                             01865000
ATCIOECB EQU   ISTATCVT+836                                             01866000
ATCINCW3 EQU   ISTATCVT+832                                             01867000
ATCMODTB EQU   ISTATCVT+828                                             01868000
ATCUSSPT EQU   ISTATCVT+824                                             01869000
ATCSRTAB EQU   ISTATCVT+820                                             01870000
@NM00103 EQU   ISTATCVT+819                                             01871000
@NM00102 EQU   ATCSTAT2                                                 01872000
ATCTRSMS EQU   ATCSTAT2                                                 01873000
ATCTRLOK EQU   ATCSTAT2                                                 01874000
ATCTRPSS EQU   ATCSTAT2                                                 01875000
ATCTRESC EQU   ATCSTAT2                                                 01876000
ATCTRAPI EQU   ATCSTAT2                                                 01877000
ATCNMCTR EQU   ISTATCVT+816                                             01878000
ATCSEC51 EQU   ATCSECST                                                 01879000
ATCSEC40 EQU   ATCSIPD+8                                                01880000
ATCSEC30 EQU   ATCSIPD+4                                                01881000
ATCSEC21 EQU   ATCSIPD                                                  01882000
ATCSEC10 EQU   ATCSOPD+4                                                01883000
ATCSEC01 EQU   ATCSOPD                                                  01884000
ATCPOIA  EQU   ATCRNO+1                                                 01885000
@NM00101 EQU   ATCRNO                                                   01886000
ATCPODVT EQU   ISTATCVT+784                                             01887000
ATCS49XL EQU   ISTATCVT+780                                             01888000
ATCS49XI EQU   ISTATCVT+776                                             01889000
ATCLCLCT EQU   ATCVLCNT+2                                               01890000
ATCRNCNT EQU   ATCVLCNT                                                 01891000
ATCCFEAD EQU   ISTATCVT+768                                             01892000
ATCPTR00 EQU   ISTATCVT+736                                             01893000
ATCRSV10 EQU   ISTATCVT+704                                             01894000
ATCTACB  EQU   ISTATCVT+700                                             01895000
ATCVTINM EQU   ISTATCVT+696                                             01896000
ATCTCLIM EQU   ISTATCVT+692                                             01897000
ATCTCLOM EQU   ISTATCVT+688                                             01898000
ATCVTIPB EQU   ISTATCVT+656                                             01899000
ATCTCIPB EQU   ISTATCVT+624                                             01900000
ATCTIPAB EQU   ISTATCVT+592                                             01901000
ATCOCCCB EQU   ISTATCVT+588                                             01902000
ATCOCCOB EQU   ISTATCVT+584                                             01903000
ATCCDLAD EQU   ISTATCVT+580                                             01904000
ATCCCLAD EQU   ISTATCVT+576                                             01905000
ATCDLRPB EQU   ISTATCVT+544                                             01906000
ATCPGPAB EQU   ISTATCVT+512                                             01907000
ATCVPAB1 EQU   ISTATCVT+480                                             01908000
ATCRSV97 EQU   ISTATCVT+476                                             01909000
ATCRDTLK EQU   ISTATCVT+472                                             01910000
ATCVOCLK EQU   ISTATCVT+468                                             01911000
ATCCDFDN EQU   ISTATCVT+464                                             01912000
ATCCDFIN EQU   ISTATCVT+460                                             01913000
ATCDVTLK EQU   ISTATCVT+456                                             01914000
ATCAP36  EQU   ISTATCVT+452                                             01915000
ATCAP35  EQU   ISTATCVT+448                                             01916000
ATCAP33  EQU   ISTATCVT+444                                             01917000
ATCRSV99 EQU   ISTATCVT+440                                             01918000
ATCONFIG EQU   ISTATCVT+432                                             01919000
ATCNODDS EQU   ISTATCVT+428                                             01920000
ATCNODEL EQU   ISTATCVT+420                                             01921000
ATCRSV69 EQU   ISTATCVT+416                                             01922000
ATCAPCR5 EQU   ISTATCVT+412                                             01923000
ATCLDECB EQU   ISTATCVT+408                                             01924000
ATCLDNCS EQU   ISTATCVT+404                                             01925000
ATCCDPTR EQU   ISTATCVT+400                                             01926000
ATCADEL  EQU   ISTATCVT+396                                             01927000
ATCTODVT EQU   ISTATCVT+392                                             01928000
ATCDEBCH EQU   ISTATCVT+388                                             01929000
ATCHBSIZ EQU   ATCHPGM+2                                                01930000
ATCHBFNO EQU   ATCHPGM                                                  01931000
ATCCRME  EQU   ISTATCVT+380                                             01932000
ATCRVCHS EQU   ISTATCVT+372                                             01933000
ATCECTLP EQU   ISTATCVT+368                                             01934000
ATCZDVTB EQU   ISTATCVT+364                                             01935000
ATCECPRT EQU   ISTATCVT+360                                             01936000
ATCVTLOD EQU   ISTATCVT+356                                             01937000
ATCTRPAB EQU   ISTATCVT+352                                             01938000
ATCMSGM  EQU   ISTATCVT+348                                             01939000
ATCEPT   EQU   ISTATCVT+340                                             01940000
ATCDVT   EQU   ISTATCVT+336                                             01941000
ATCTRCPT EQU   ISTATCVT+332                                             01942000
ATCDVLOD EQU   ISTATCVT+328                                             01943000
ATCALERT EQU   ISTATCVT+324                                             01944000
ATCEPA   EQU   ISTATCVT+320                                             01945000
ATCSAF   EQU   ISTATCVT+318                                             01946000
ATCXRANG EQU   ISTATCVT+317                                             01947000
ATCLAST  EQU   ATCSHRFG                                                 01948000
ATCSHRTN EQU   ISTATCVT+308                                             01949000
ATCUEP   EQU   ISTATCVT+304                                             01950000
ATCOCRT  EQU   ISTATCVT+300                                             01951000
ATCCSMA  EQU   ATCCSMR                                                  01952000
ATCESC02 EQU   ISTATCVT+292                                             01953000
ATCESC01 EQU   ISTATCVT+288                                             01954000
ATCCDFND EQU   ISTATCVT+284                                             01955000
ATCCDDEL EQU   ISTATCVT+280                                             01956000
ATCCDADD EQU   ISTATCVT+276                                             01957000
ATCMNT   EQU   ISTATCVT+272                                             01958000
ATCRSV16 EQU   ISTATCVT+270                                             01959000
ATCMAXID EQU   ISTATCVT+269                                             01960000
ATCMSGSP EQU   ATCCOM+268                                               01961000
ATCCIDM  EQU   ATCCOM+266                                               01962000
ATCACTRM EQU   ATCCOM+264                                               01963000
ATCNERAP EQU   ATCCOM+260                                               01964000
ATCNESAL EQU   ATCCOM+256                                               01965000
ATCRCC65 EQU   ATCCOM+252                                               01966000
ATCRCC26 EQU   ATCCOM+248                                               01967000
ATCRCC63 EQU   ATCCOM+244                                               01968000
ATCRSV11 EQU   ATCCOM+242                                               01969000
ATCVTMID EQU   ATCCOM+240                                               01970000
ATCAPOST EQU   ATCCOM+236                                               01971000
ATCNERFN EQU   ATCCOM+232                                               01972000
ATCNERNE EQU   ATCCOM+228                                               01973000
ATCNERCV EQU   ATCCOM+224                                               01974000
ATCNERST EQU   ATCCOM+220                                               01975000
ATCDCC61 EQU   ATCCOM+216                                               01976000
ATCDCC60 EQU   ATCCOM+212                                               01977000
ATCSRTDF EQU   ATCCOM+208                                               01978000
ATCSRTAD EQU   ATCCOM+204                                               01979000
ATCFIRA  EQU   ATCCOM+200                                               01980000
ATCSMBQ  EQU   ATCCOM+196                                               01981000
ATCSMRC  EQU   ATCCOM+192                                               01982000
ATCSMRS  EQU   ATCCOM+188                                               01983000
ATCSMQU  EQU   ATCCOM+184                                               01984000
ATCSMRQ  EQU   ATCCOM+180                                               01985000
ATCACDA  EQU   ATCCOM+176                                               01986000
ATCSTMA  EQU   ATCCOM+172                                               01987000
ATCFRSTR EQU   ATCCOM+168                                               01988000
ATCGTSTR EQU   ATCCOM+164                                               01989000
ATCREADA EQU   ATCCOM+160                                               01990000
ATCALOAD EQU   ATCCOM+156                                               01991000
ATCBLDLA EQU   ATCCOM+152                                               01992000
ATCFBRPH EQU   ATCCOM+148                                               01993000
ATCBFTRC EQU   ATCCOM+144                                               01994000
ATCTPBUF EQU   ATCTHTRC                                                 01995000
ATCREMOV EQU   ATCCOM+136                                               01996000
ATCADD   EQU   ATCCOM+132                                               01997000
ATCBPDA  EQU   ATCCOM+128                                               01998000
ATCDVTPT EQU   ATCCOM+124                                               01999000
ATCFEPT  EQU   ATCCOM+120                                               02000000
ATCFDVT  EQU   ATCCOM+116                                               02001000
ATCCONFT EQU   ATCCOM+112                                               02002000
ATCPTCHA EQU   ATCCOM+108                                               02003000
ATCAUTHA EQU   ATCCOM+104                                               02004000
ATCACCTA EQU   ATCCOM+100                                               02005000
ATCRDTH  EQU   ATCCOM+96                                                02006000
ATCFRSCH EQU   ATCCOM+92                                                02007000
ATCFSB   EQU   ATCCOM+88                                                02008000
ATCHLTMS EQU   ATCCOM+84                                                02009000
ATCECPRM EQU   ATCCOM+80                                                02010000
ATCECNET EQU   ATCCOM+76                                                02011000
ATCECOPC EQU   ATCCOM+72                                                02012000
ATCVPARM EQU   ATCCOM+68                                                02013000
ATCECVRQ EQU   ATCCOM+64                                                02014000
ATCECSES EQU   ATCCOM+60                                                02015000
ATCOCHA  EQU   ATCCOM+56                                                02016000
ATCDSPLQ EQU   ATCCOM+52                                                02017000
ATCECDSP EQU   ATCCOM+48                                                02018000
ATCVARYQ EQU   ATCCOM+44                                                02019000
ATCECVRY EQU   ATCCOM+40                                                02020000
ATCHALTQ EQU   ATCCOM+36                                                02021000
ATCECHLT EQU   ATCCOM+32                                                02022000
ATCMODQ  EQU   ATCCOM+28                                                02023000
ATCECMOD EQU   ATCCOM+24                                                02024000
ATCASCHD EQU   ATCCOM+20                                                02025000
ATCSRT   EQU   ATCCOM+16                                                02026000
ATCRDT   EQU   ATCCOM+12                                                02027000
ATCDCFRR EQU   ATCCOM+8                                                 02028000
ATCAPI   EQU   ATCCOM+4                                                 02029000
ATCRSV04 EQU   ATCSTAT4                                                 02030000
ATCVTTRC EQU   ATCSTAT4                                                 02031000
ATCNCSD  EQU   ATCSTAT4                                                 02032000
ATCMTST  EQU   ATCSTAT4                                                 02033000
ATCTPRT  EQU   ATCSTAT4                                                 02034000
ATCPRTAT EQU   ATCSTAT4                                                 02035000
@NM00100 EQU   ATCPOFLG                                                 02036000
ATCPOUNS EQU   ATCPOFLG                                                 02037000
ATCHSDMF EQU   ATCSTFLG                                                 02038000
@NM00099 EQU   ATCSTAT1                                                 02039000
ATCMDHLT EQU   ATCSTAT1                                                 02040000
ATCINHLT EQU   ATCSTAT1                                                 02041000
ATCNETSL EQU   ATCSTAT1                                                 02042000
ATCQKHLT EQU   ATCSTAT1                                                 02043000
ATCSNHLT EQU   ATCSTAT1                                                 02044000
ATCACTIV EQU   ATCSTAT1                                                 02045000
ATCSTART EQU   ATCSTAT1                                                 02046000
DCERSV01 EQU   ISTDCE+12                                                02047000
DCETERM  EQU   ISTDCE+8                                                 02048000
PSTDRDYQ EQU   PSTDMPS+1                                                02049000
@NM00098 EQU   PSTDMPS                                                  02050000
PSTDGATE EQU   PSTDMPS                                                  02051000
PSTDEBP  EQU   ISTPST+128                                               02052000
PSTSAVE  EQU   ISTPST+96                                                02053000
PSTSMDYP EQU   ISTPST+64                                                02054000
PSTCRRS  EQU   ISTPST+60                                                02055000
PSTCRR1  EQU   ISTPST+56                                                02056000
PSTIQE22 EQU   ISTPST+52                                                02057000
PSTIQE21 EQU   ISTPST+48                                                02058000
PSTIQE12 EQU   ISTPST+44                                                02059000
PSTIQE11 EQU   ISTPST+40                                                02060000
PSTUEQ   EQU   ISTPST+36                                                02061000
PSTNSSQ  EQU   ISTPST+32                                                02062000
PSTPSSQ  EQU   ISTPST+28                                                02063000
PSTACBCT EQU   ISTPST+24                                                02064000
PSTMPSTP EQU   ISTPST+20                                                02065000
PSTTCBA  EQU   ISTPST+16                                                02066000
PSTRSV08 EQU   PSTFLGA+1                                                02067000
PSTDMPC  EQU   PSTFLGA+1                                                02068000
PSTABEND EQU   PSTABINP                                                 02069000
PSTAUTH  EQU   PSTFLGA                                                  02070000
PSTSMCU  EQU   PSTFLGA                                                  02071000
PSTSMQR  EQU   PSTFLGA                                                  02072000
PSTIRBU2 EQU   PSTFLGA                                                  02073000
PSTIRBU1 EQU   PSTFLGA                                                  02074000
PSTUERN  EQU   PSTFLGA                                                  02075000
PSTSSRN  EQU   PSTFLGA                                                  02076000
PSTRQUEA EQU   PSTRQUE+1                                                02077000
PSTRSV07 EQU   PSTRQUE                                                  02078000
PSTRSV06 EQU   PSTRQUE                                                  02079000
PSTRSV05 EQU   PSTRQUE                                                  02080000
PSTRSV04 EQU   PSTRQUE                                                  02081000
PSTRSV03 EQU   PSTRQUE                                                  02082000
PSTRSV02 EQU   PSTRQUE                                                  02083000
PSTRSV01 EQU   PSTRQUE                                                  02084000
PSTRQFLG EQU   PSTRQUE                                                  02085000
PSTCHAIN EQU   ISTPST+4                                                 02086000
@NM00097 EQU   ISTPST+2                                                 02087000
PSTLNGTH EQU   ISTPST+1                                                 02088000
PSTTYPE  EQU   ISTPST                                                   02089000
RPHNEXPO EQU   ISTRPH+104                                               02090000
RPHSAV16 EQU   RPHWORK+60                                               02091000
RPHSAV15 EQU   RPHWORK+56                                               02092000
RPHSAV14 EQU   RPHWORK+52                                               02093000
RPHSAV13 EQU   RPHWORK+48                                               02094000
RPHSAV12 EQU   RPHWORK+44                                               02095000
RPHSAV11 EQU   RPHWORK+40                                               02096000
RPHSAV10 EQU   RPHWORK+36                                               02097000
RPHSAVE9 EQU   RPHWORK+32                                               02098000
RPHSAVE8 EQU   RPHWORK+28                                               02099000
RPHSAVE7 EQU   RPHWORK+24                                               02100000
RPHSAVE6 EQU   RPHWORK+20                                               02101000
RPHSAVE5 EQU   RPHWORK+16                                               02102000
RPHSAVE4 EQU   RPHWORK+12                                               02103000
RPHSAVE3 EQU   RPHWORK+8                                                02104000
RPHSAVE2 EQU   RPHWORK+4                                                02105000
RPHSHALF EQU   RPHSAVE1+2                                               02106000
RPHSBIT8 EQU   RPHSBITS                                                 02107000
RPHSBIT7 EQU   RPHSBITS                                                 02108000
RPHSBIT6 EQU   RPHSBITS                                                 02109000
RPHSBIT5 EQU   RPHSBITS                                                 02110000
RPHSBIT4 EQU   RPHSBITS                                                 02111000
RPHSBIT3 EQU   RPHSBITS                                                 02112000
RPHSBIT2 EQU   RPHSBITS                                                 02113000
RPHSBIT1 EQU   RPHSBITS                                                 02114000
RPHSBYTE EQU   RPHSAVE1                                                 02115000
RPHPABQP EQU   RPHPABQA+1                                               02116000
RPHPABFG EQU   RPHPABQA                                                 02117000
RPHCRR   EQU   ISTRPH+32                                                02118000
RPHSRP34 EQU   RPHSRPRM+2                                               02119000
RPHSRP12 EQU   RPHSRPRM                                                 02120000
RPHWEGT  EQU   RPHCSPA                                                  02121000
RPHMAJCB EQU   ISTRPH+21                                                02122000
RPHPABOF EQU   ISTRPH+20                                                02123000
RPHRESUM EQU   RPHRESMA+1                                               02124000
RPHRSV01 EQU   RPHWPFLG                                                 02125000
RPHPURGE EQU   RPHWPFLG                                                 02126000
RPHPT    EQU   RPHWPFLG                                                 02127000
RPHWT    EQU   RPHWPFLG                                                 02128000
RPHRSKEY EQU   RPHWPFLG                                                 02129000
RPHDVTA  EQU   ISTRPH+12                                                02130000
RPHTIK   EQU   RPHTSKID+3                                               02131000
@NM00096 EQU   RPHTSKID                                                 02132000
RPHRPHAP EQU   RPHRPHA+1                                                02133000
@NM00095 EQU   RPHRPHA                                                  02134000
RPHGATE  EQU   RPHRPHA                                                  02135000
@NM00094 EQU   RPHFLGB                                                  02136000
RPHRLCRA EQU   RPHFLGB                                                  02137000
RPHNRSAV EQU   RPHFLGB                                                  02138000
RPHPGCMP EQU   RPHFLGB                                                  02139000
RPHFBAPS EQU   RPHFLGB                                                  02140000
RPHBSSP  EQU   RPHFLGB                                                  02141000
RPHLOCK  EQU   RPHFLGB                                                  02142000
RPHFNFLG EQU   RPHFSTLC                                                 02143000
RPHMLTCP EQU   RPHFLAGS                                                 02144000
RPHSMCLR EQU   RPHFLAGS                                                 02145000
RPHSMTYP EQU   RPHFLAGS                                                 02146000
RPHSMQ   EQU   RPHFLAGS                                                 02147000
RPHAUTEX EQU   RPHAPTYP                                                 02148000
RPHSPGIN EQU   RPHFLAGS                                                 02149000
RPHOGIND EQU   RPHFLAGS                                                 02150000
RPHLNGTH EQU   RPHCNTL+1                                                02151000
RPHTYPE  EQU   RPHCNTL                                                  02152000
ACDREFQ  EQU   ISTACDEB+204                                             02153000
ACDASFQ  EQU   ISTACDEB+200                                             02154000
ACDSOP   EQU   ISTACDEB+184                                             02155000
ACDSIP   EQU   ISTACDEB+168                                             02156000
ACDRSV24 EQU   ACDVTAM+108                                              02157000
ACDRSV23 EQU   ACDVTAM+104                                              02158000
ACDRSV22 EQU   ACDVTAM+100                                              02159000
ACDOCWAD EQU   ACDVTAM+96                                               02160000
ACDRSV10 EQU   ACDVTAM+92                                               02161000
ACDAPDDT EQU   ACDAPDAT+1                                               02162000
ACDAPDLN EQU   ACDAPDAT                                                 02163000
ACDRSV07 EQU   ACDVTAM+82                                               02164000
ACDRSV06 EQU   ACDVTAM+81                                               02165000
ACDRSV09 EQU   ACDSSFLG                                                 02166000
ACDAICLS EQU   ACDSSFLG                                                 02167000
ACDABEND EQU   ACDSSFLG                                                 02168000
ACDCACB  EQU   ACDSSFLG                                                 02169000
ACDRSV21 EQU   ACDVTAM+64                                               02170000
ACDSSPAB EQU   ACDVTAM+48                                               02171000
ACDNEPAB EQU   ACDVTAM+32                                               02172000
ACDRSV20 EQU   ACDVTAM+20                                               02173000
ACDRARQ  EQU   ACDVTAM+16                                               02174000
ACDRAFQ  EQU   ACDVTAM+12                                               02175000
ACDFMCB  EQU   ACDVTAM+8                                                02176000
ACDRDTE  EQU   ACDVTAM+4                                                02177000
ACDLOCK  EQU   ACDVTAM                                                  02178000
ACDAPP   EQU   ACDAPPAD+1                                               02179000
ACDEXSCL EQU   ACDAPPAD                                                 02180000
ACDACB   EQU   ACDACBAD+1                                               02181000
ACDDEBID EQU   ACDACBAD                                                 02182000
ACDPROTG EQU   ACDACBAD                                                 02183000
ACDECBAD EQU   ACDBASIC+20                                              02184000
ACDUSRPB EQU   ACDUSRPG+1                                               02185000
ACDNMEXT EQU   ACDUSRPG                                                 02186000
ACDPRLEN EQU   ACDBASIC+15                                              02187000
ACDFLGS1 EQU   ACDBASIC+14                                              02188000
ACDQSCNT EQU   ACDBASIC+13                                              02189000
ACDOPATB EQU   ACDBASIC+12                                              02190000
ACDIRBAD EQU   ACDBASIC+8                                               02191000
ACDDEB   EQU   ACDDEBAD+1                                               02192000
ACDAMLNG EQU   ACDDEBAD                                                 02193000
ACDOPNAD EQU   ACDNMSUB                                                 02194000
ACDRSV03 EQU   ACDTBLOF+1                                               02195000
ACDRSV02 EQU   ACDTBLOF                                                 02196000
ACDAMTYP EQU   ACDDBPFX+5                                               02197000
ACDLENG  EQU   ACDDBPFX+4                                               02198000
ACDDEBX  EQU   ACDDBPFX                                                 02199000
ACDRSV08 EQU   ACDVTPRX+12                                              02200000
ACDCHN   EQU   ACDVTPRX+4                                               02201000
ACDSAF   EQU   ACDVTPRX+2                                               02202000
ACDLNGTH EQU   ACDVTPRX+1                                               02203000
ACDTYPE  EQU   ACDVTPRX                                                 02204000
LOKXCL   EQU   @NM00092                                                 02205000
LOKPRY   EQU   @NM00092                                                 02206000
@NM00093 EQU   @NM00092                                                 02207000
@NM00091 EQU   LOKCHNG                                                  02208000
LOKCT    EQU   ISTLOK                                                   02209000
MPSSRB1  EQU   ISTMPST+172                                              02210000
MPSSAVE  EQU   ISTMPST+140                                              02211000
MPSMQLBP EQU   ISTMPST+136                                              02212000
MPSSYSRT EQU   ISTMPST+132                                              02213000
MPSQEL   EQU   ISTMPST+128                                              02214000
MPSASCB  EQU   ISTMPST+120                                              02215000
MPSTPPAB EQU   ISTMPST+88                                               02216000
MPSSMPAB EQU   ISTMPST+56                                               02217000
MPSSMRPH EQU   ISTMPST+52                                               02218000
MPSSRB55 EQU   ISTMPST+48                                               02219000
MPSRPLAC EQU   MPSRPLCT+2                                               02220000
MPSRPLRC EQU   MPSRPLCT                                                 02221000
MPSCRPLQ EQU   MPSCRPL                                                  02222000
MPSSRBAC EQU   MPSSRBCT+2                                               02223000
MPSSRBRC EQU   MPSSRBCT                                                 02224000
MPSSRBQ  EQU   MPSSRB                                                   02225000
MPSCRAAC EQU   MPSCRACT+2                                               02226000
MPSCRARC EQU   MPSCRACT                                                 02227000
MPSCRAQ  EQU   MPSCRA                                                   02228000
MPSMPSTP EQU   ISTMPST+20                                               02229000
MPSPSTCT EQU   ISTMPST+16                                               02230000
MPSASID  EQU   MPSFLGA+2                                                02231000
MPSRSV02 EQU   MPSFLGA+1                                                02232000
MPSPSTAB EQU   MPSFLGA                                                  02233000
MPSRSV01 EQU   MPSFLGA                                                  02234000
MPSTPBU  EQU   MPSFLGA                                                  02235000
MPMEMTRM EQU   MPSFLGA                                                  02236000
MPSAUTH  EQU   MPSFLGA                                                  02237000
MPSCRAO  EQU   MPSFLGA                                                  02238000
MPSSRBO  EQU   MPSFLGA                                                  02239000
MPSRQUEG EQU   MPSRQUE                                                  02240000
MPSRSV07 EQU   ISTMPST+4                                                02241000
MPSID    EQU   ISTMPST                                                  02242000
DYPPAB   EQU   ISTDYPAB+16                                              02243000
DYPRSV01 EQU   ISTDYPAB+12                                              02244000
DYPTSKID EQU   ISTDYPAB+8                                               02245000
DYPCHAIN EQU   ISTDYPAB+4                                               02246000
DYPFLGS  EQU   ISTDYPAB+2                                               02247000
DYPLNGTH EQU   ISTDYPAB+1                                               02248000
DYPTYPE  EQU   ISTDYPAB                                                 02249000
PABRPHA  EQU   PABRPHFG+1                                               02250000
PABNODQ  EQU   PABFLAGS                                                 02251000
PABINHBT EQU   PABFLAGS                                                 02252000
PABERLOK EQU   PABERRLK                                                 02253000
PABSSN   EQU   PABFLAGS                                                 02254000
PABDYNAM EQU   PABFLAGS                                                 02255000
PABNORPR EQU   PABFLAGS                                                 02256000
PABPRIOR EQU   PABFLAGS                                                 02257000
PABAPYP  EQU   PABFLAGS                                                 02258000
PABDVTA  EQU   ISTPAB+9                                                 02259000
PABOFFST EQU   ISTPAB+8                                                 02260000
PABRSV02 EQU   PABCHAIN                                                 02261000
PABRUNNG EQU   PABCHAIN                                                 02262000
PABRESET EQU   PABCHAIN                                                 02263000
PABUNCON EQU   PABCHAIN                                                 02264000
PABCDP   EQU   PABCHAIN                                                 02265000
PABRESCH EQU   PABCHAIN                                                 02266000
PABCHNG  EQU   PABCHAIN                                                 02267000
PABWEQP  EQU   PABWEQA+1                                                02268000
PABRSV01 EQU   PABWEQA                                                  02269000
PABWEQG  EQU   PABWEQA                                                  02270000
TIOCSTEP EQU   TIOT1+8                                                  02271000
TIOCNJOB EQU   TIOT1                                                    02272000
@NM00088 EQU   TCBXTNT2+32                                              02273000
TCBRV181 EQU   TCBRV173                                                 02274000
TCBRV180 EQU   TCBRV173                                                 02275000
TCBRV179 EQU   TCBRV173                                                 02276000
TCBRV178 EQU   TCBRV173                                                 02277000
TCBRV177 EQU   TCBRV173                                                 02278000
TCBRV176 EQU   TCBRV173                                                 02279000
TCBRV175 EQU   TCBRV173                                                 02280000
TCBRV174 EQU   TCBRV173                                                 02281000
TCBRV172 EQU   TCBRV164                                                 02282000
TCBRV171 EQU   TCBRV164                                                 02283000
TCBRV170 EQU   TCBRV164                                                 02284000
TCBRV169 EQU   TCBRV164                                                 02285000
TCBRV168 EQU   TCBRV164                                                 02286000
TCBRV167 EQU   TCBRV164                                                 02287000
TCBRV166 EQU   TCBRV164                                                 02288000
TCBRV165 EQU   TCBRV164                                                 02289000
TCBRV163 EQU   TCBRV155                                                 02290000
TCBRV162 EQU   TCBRV155                                                 02291000
TCBRV161 EQU   TCBRV155                                                 02292000
TCBRV160 EQU   TCBRV155                                                 02293000
TCBRV159 EQU   TCBRV155                                                 02294000
TCBRV158 EQU   TCBRV155                                                 02295000
TCBRV157 EQU   TCBRV155                                                 02296000
TCBRV156 EQU   TCBRV155                                                 02297000
TCBRV154 EQU   TCBRV146                                                 02298000
TCBRV153 EQU   TCBRV146                                                 02299000
TCBRV152 EQU   TCBRV146                                                 02300000
TCBRV151 EQU   TCBRV146                                                 02301000
TCBRV150 EQU   TCBRV146                                                 02302000
TCBRV149 EQU   TCBRV146                                                 02303000
TCBRV148 EQU   TCBRV146                                                 02304000
TCBRV147 EQU   TCBRV146                                                 02305000
TCBRV145 EQU   TCBXTNT2+26                                              02306000
TCBRV144 EQU   TCBXTNT2+24                                              02307000
TCBRV143 EQU   TCBXTNT2+20                                              02308000
TCBRV142 EQU   TCBXTNT2+16                                              02309000
TCBRSV49 EQU   TCBXTNT2+12                                              02310000
TCBEVENT EQU   TCBXTNT2+8                                               02311000
TCBRCMP  EQU   TCBXTNT2+5                                               02312000
TCBRSVAB EQU   TCBXTNT2+4                                               02313000
TCBGTFA  EQU   TCBGTF+1                                                 02314000
TCBRSV47 EQU   TCBTFLG                                                  02315000
TCBRSV46 EQU   TCBTFLG                                                  02316000
TCBRSV45 EQU   TCBTFLG                                                  02317000
TCBRSV44 EQU   TCBTFLG                                                  02318000
TCBRSV43 EQU   TCBTFLG                                                  02319000
TCBDSPIT EQU   TCBTFLG                                                  02320000
TCBERRTN EQU   TCBTFLG                                                  02321000
TCBASYNC EQU   TCBTFLG                                                  02322000
@NM00087 EQU   TCB+296                                                  02323000
TCBSVCA2 EQU   TCB+292                                                  02324000
TCBSWASA EQU   TCB+288                                                  02325000
TCBDBTB  EQU   TCB+284                                                  02326000
TCBRPT   EQU   TCB+280                                                  02327000
TCBRV141 EQU   TCBRV133                                                 02328000
TCBRV140 EQU   TCBRV133                                                 02329000
TCBRV139 EQU   TCBRV133                                                 02330000
TCBRV138 EQU   TCBRV133                                                 02331000
TCBRV137 EQU   TCBRV133                                                 02332000
TCBRV136 EQU   TCBRV133                                                 02333000
TCBRV135 EQU   TCBRV133                                                 02334000
TCBRV134 EQU   TCBRV133                                                 02335000
TCBRV132 EQU   TCBRV124                                                 02336000
TCBRV131 EQU   TCBRV124                                                 02337000
TCBRV130 EQU   TCBRV124                                                 02338000
TCBRV129 EQU   TCBRV124                                                 02339000
TCBRV128 EQU   TCBRV124                                                 02340000
TCBRV127 EQU   TCBRV124                                                 02341000
TCBRV126 EQU   TCBRV124                                                 02342000
TCBRV125 EQU   TCBRV124                                                 02343000
TCBRV123 EQU   TCBFBYT2                                                 02344000
TCBRV122 EQU   TCBFBYT2                                                 02345000
TCBECBNV EQU   TCBFBYT2                                                 02346000
TCBSSSYN EQU   TCBFBYT2                                                 02347000
TCBFPRAP EQU   TCBFBYT2                                                 02348000
TCBFDW   EQU   TCBFBYT2                                                 02349000
TCBFMW   EQU   TCBFBYT2                                                 02350000
TCBCNCB  EQU   TCBFBYT2                                                 02351000
TCBLLH   EQU   TCBFBYT1                                                 02352000
TCBRV113 EQU   TCBFBYT1                                                 02353000
TCBEOT   EQU   TCBFBYT1                                                 02354000
TCBRTM2  EQU   TCBFBYT1                                                 02355000
TCBPGNLY EQU   TCBFBYT1                                                 02356000
TCBNDIOS EQU   TCBFBYT1                                                 02357000
TCBRV327 EQU   TCBFBYT1                                                 02358000
TCBEOTFM EQU   TCBFBYT1                                                 02359000
TCBAFFN  EQU   TCB+274                                                  02360000
TCBRV326 EQU   TCB+272                                                  02361000
TCBUKYSP EQU   TCB+268                                                  02362000
TCBMODE  EQU   TCBESTAE+3                                               02363000
TCBERTYP EQU   TCBESTAE+2                                               02364000
TCBRV314 EQU   TCBESTRM                                                 02365000
TCBRV313 EQU   TCBESTRM                                                 02366000
TCBRV312 EQU   TCBESTRM                                                 02367000
TCBRV311 EQU   TCBESTRM                                                 02368000
TCBRV310 EQU   TCBESTRM                                                 02369000
TCBRV309 EQU   TCBESTRM                                                 02370000
TCBRV308 EQU   TCBESTRM                                                 02371000
TCBETERM EQU   TCBESTRM                                                 02372000
TCBSCBKY EQU   TCBESTAE                                                 02373000
TCBRTM12 EQU   TCB+260                                                  02374000
TCBTCBID EQU   TCB+256                                                  02375000
TCBRSV96 EQU   TCB+252                                                  02376000
TCBSWA   EQU   TCB+248                                                  02377000
TCBFOEA  EQU   TCBFOE+1                                                 02378000
TCBRSV42 EQU   TCBFOE                                                   02379000
TCBCCPVI EQU   TCBXSCT+2                                                02380000
TCBRV325 EQU   TCBXSCT+1                                                02381000
TCBRV324 EQU   TCBXSCT1                                                 02382000
TCBRV323 EQU   TCBXSCT1                                                 02383000
TCBRV322 EQU   TCBXSCT1                                                 02384000
TCBRV321 EQU   TCBXSCT1                                                 02385000
TCBRV320 EQU   TCBXSCT1                                                 02386000
TCBRV319 EQU   TCBXSCT1                                                 02387000
TCBS3A   EQU   TCBXSCT1                                                 02388000
TCBACTIV EQU   TCBXSCT1                                                 02389000
TCBRSV41 EQU   TCB+239                                                  02390000
TCBTID   EQU   TCB+238                                                  02391000
TCBRSVAA EQU   TCB+237                                                  02392000
TCBABCUR EQU   TCB+236                                                  02393000
TCBTMSAV EQU   TCB+232                                                  02394000
TCBIOTIM EQU   TCB+228                                                  02395000
TCBRTWA  EQU   TCB+224                                                  02396000
TCBBACK  EQU   TCB+220                                                  02397000
TCBTIRB  EQU   TCB+216                                                  02398000
TCBAECB  EQU   TCB+212                                                  02399000
TCBEXT2A EQU   TCBEXT2+1                                                02400000
TCBRSV39 EQU   TCBEXT2                                                  02401000
TCBSTMCT EQU   TCB+207                                                  02402000
TCBSYSCT EQU   TCB+206                                                  02403000
TCBRSV37 EQU   TCB+205                                                  02404000
TCBEXSVC EQU   TCBDAR                                                   02405000
TCBDARMS EQU   TCBDAR                                                   02406000
TCBDARWT EQU   TCBDAR                                                   02407000
TCBDARO  EQU   TCBDAR                                                   02408000
TCBDARMC EQU   TCBDARC                                                  02409000
TCBDARD  EQU   TCBDAR                                                   02410000
TCBDARS  EQU   TCBDAR                                                   02411000
TCBDARP  EQU   TCBDAR                                                   02412000
TCBGTOFM EQU   TCBFLGS7                                                 02413000
TCBADMP  EQU   TCBFLGS7                                                 02414000
TCBRSTSK EQU   TCBFLGS7                                                 02415000
TCBSVCS  EQU   TCBFLGS7                                                 02416000
TCBSTACK EQU   TCBFLGS7                                                 02417000
TCBRSV34 EQU   TCBFLGS7                                                 02418000
TCBRSV33 EQU   TCBFLGS7                                                 02419000
TCBGPECB EQU   TCBFLGS7                                                 02420000
TCBNTJS  EQU   TCBFLGS6                                                 02421000
TCBAPG   EQU   TCBFLGS6                                                 02422000
TCBMIGR  EQU   TCBFLGS6                                                 02423000
TCBRV303 EQU   TCBFLGS6                                                 02424000
TCBSPVLK EQU   TCBFLGS6                                                 02425000
TCBCPU   EQU   TCBFLGS6                                                 02426000
TCBPIE17 EQU   TCBFLGS6                                                 02427000
TCBRV    EQU   TCBFLGS6                                                 02428000
TCBRSV79 EQU   TCBNDSP5                                                 02429000
TCBRSV78 EQU   TCBNDSP5                                                 02430000
TCBRSV77 EQU   TCBNDSP5                                                 02431000
TCBRSV76 EQU   TCBNDSP5                                                 02432000
TCBRSV75 EQU   TCBNDSP5                                                 02433000
TCBRSV74 EQU   TCBNDSP5                                                 02434000
TCBRSV95 EQU   TCBNDSP5                                                 02435000
TCBRSV94 EQU   TCBNDSP5                                                 02436000
TCBRSV93 EQU   TCBNDSP4                                                 02437000
TCBRSV92 EQU   TCBNDSP4                                                 02438000
TCBRSV91 EQU   TCBNDSP4                                                 02439000
TCBRSV90 EQU   TCBNDSP4                                                 02440000
TCBRSV89 EQU   TCBNDSP4                                                 02441000
TCBRSV88 EQU   TCBNDSP4                                                 02442000
TCBRSV87 EQU   TCBNDSP4                                                 02443000
TCBRSV86 EQU   TCBNDSP4                                                 02444000
TCBEXT1A EQU   TCBEXT1+1                                                02445000
TCBRSV32 EQU   TCBEXT1                                                  02446000
TCBEXCPD EQU   TCB+192                                                  02447000
TCBIOBRC EQU   TCB+188                                                  02448000
TCBDDWTC EQU   TCB+186                                                  02449000
TCBDDEXC EQU   TCB+184                                                  02450000
TCBJSCBB EQU   TCBJSCB+1                                                02451000
@NM00086 EQU   TCBRECDE                                                 02452000
TCBREC   EQU   TCBRECDE                                                 02453000
TCBMDIDS EQU   TCB+176                                                  02454000
TCBNDINT EQU   TCBNDSP3                                                 02455000
TCBRSV27 EQU   TCBNDSP3                                                 02456000
TCBRSV26 EQU   TCBNDSP3                                                 02457000
TCBRSV25 EQU   TCBNDSP3                                                 02458000
TCBRSV24 EQU   TCBNDSP3                                                 02459000
TCBSRBND EQU   TCBNDSP3                                                 02460000
TCBRV302 EQU   TCBNDSP3                                                 02461000
TCBLJSND EQU   TCBNDSP3                                                 02462000
TCBABE   EQU   TCBNDSP2                                                 02463000
TCBDSS   EQU   TCBNDSP2                                                 02464000
TCBOWAIT EQU   TCBNDSP2                                                 02465000
TCBIWAIT EQU   TCBNDSP2                                                 02466000
TCBNDTS  EQU   TCBNDSP2                                                 02467000
TCBNDSVC EQU   TCBNDSP2                                                 02468000
TCBSTPP  EQU   TCBNDSP2                                                 02469000
TCBABD   EQU   TCBNDSP2                                                 02470000
TCBRSV22 EQU   TCBNDSP1                                                 02471000
TCBPIEND EQU   TCBNDSP1                                                 02472000
TCBTPSP  EQU   TCBNDSP1                                                 02473000
TCBDDRND EQU   TCBNDSP1                                                 02474000
TCBRSPND EQU   TCBNDSP1                                                 02475000
TCBRSTND EQU   TCBNDSP1                                                 02476000
TCBDARPN EQU   TCBNDSP1                                                 02477000
TCBDARTN EQU   TCBNDSP1                                                 02478000
TCBNDSP0 EQU   TCBNDSP                                                  02479000
TCBUSER  EQU   TCB+168                                                  02480000
TCBTCTB  EQU   TCBTCT+1                                                 02481000
TCBRSV9C EQU   TCBTCTGF                                                 02482000
TCBRSV9B EQU   TCBTCTGF                                                 02483000
TCBRSV9A EQU   TCBTCTGF                                                 02484000
TCBRSV99 EQU   TCBTCTGF                                                 02485000
TCBRSV98 EQU   TCBTCTGF                                                 02486000
TCBRSV97 EQU   TCBTCTGF                                                 02487000
TCBRSV20 EQU   TCBTCTGF                                                 02488000
TCBSMFGF EQU   TCBTCTGF                                                 02489000
TCBSTABB EQU   TCBSTAB+1                                                02490000
TCBSTCUR EQU   TCBNSTAE                                                 02491000
TCBRV301 EQU   TCBNSTAE                                                 02492000
TCBSYNCH EQU   TCBNSTAE                                                 02493000
TCBHALT  EQU   TCBNSTAE                                                 02494000
TCBPPSUP EQU   TCBNSTAE                                                 02495000
TCB33E   EQU   TCBNSTAE                                                 02496000
TCBQUIES EQU   TCBNSTAE                                                 02497000
TCBSTABE EQU   TCBNSTAE                                                 02498000
TCBAQE   EQU   TCB+156                                                  02499000
TCBPQE   EQU   TCB+152                                                  02500000
TCBTSDP  EQU   TCB+151                                                  02501000
TCBTSLP  EQU   TCB+150                                                  02502000
TCBSTPCT EQU   TCB+149                                                  02503000
TCBCPUBN EQU   TCBTSFLG                                                 02504000
TCBDYDSP EQU   TCBTSFLG                                                 02505000
TCBRSV18 EQU   TCBTSFLG                                                 02506000
TCBRSV17 EQU   TCBTSFLG                                                 02507000
TCBTIOTG EQU   TCBTSFLG                                                 02508000
TCBATT   EQU   TCBTSFLG                                                 02509000
TCBSTPPR EQU   TCBTSFLG                                                 02510000
TCBRV300 EQU   TCBTSTSK                                                 02511000
TCBECB   EQU   TCB+144                                                  02512000
TCBIQE   EQU   TCB+140                                                  02513000
TCBLTC   EQU   TCB+136                                                  02514000
TCBOTC   EQU   TCB+132                                                  02515000
TCBNTC   EQU   TCB+128                                                  02516000
TCBJSTCA EQU   TCBJSTCB+1                                               02517000
TCBRSV16 EQU   TCBJSTCB                                                 02518000
TCBTQET  EQU   TCBTME                                                   02519000
TCBTCB   EQU   TCB+116                                                  02520000
TCBFSAB  EQU   TCBFSA+1                                                 02521000
TCBQEL   EQU   TCBFSA                                                   02522000
TCBGRS15 EQU   TCBGRS+60                                                02523000
TCBGRS14 EQU   TCBGRS+56                                                02524000
TCBGRS13 EQU   TCBGRS+52                                                02525000
TCBGRS12 EQU   TCBGRS+48                                                02526000
TCBGRS11 EQU   TCBGRS+44                                                02527000
TCBGRS10 EQU   TCBGRS+40                                                02528000
TCBGRS9  EQU   TCBGRS+36                                                02529000
TCBGRS8  EQU   TCBGRS+32                                                02530000
TCBGRS7  EQU   TCBGRS+28                                                02531000
TCBGRS6  EQU   TCBGRS+24                                                02532000
TCBGRS5  EQU   TCBGRS+20                                                02533000
TCBGRS4  EQU   TCBGRS+16                                                02534000
TCBGRS3  EQU   TCBGRS+12                                                02535000
TCBGRS2  EQU   TCBGRS+8                                                 02536000
TCBGRS1  EQU   TCBGRS+4                                                 02537000
TCBGRS0  EQU   TCBGRS                                                   02538000
TCBJPQB  EQU   TCBJPQ+1                                                 02539000
TCBRSV15 EQU   TCBPURGE                                                 02540000
TCBRSV14 EQU   TCBPURGE                                                 02541000
TCBRSV13 EQU   TCBPURGE                                                 02542000
TCBRSV12 EQU   TCBPURGE                                                 02543000
TCBRSV11 EQU   TCBPURGE                                                 02544000
TCBRSV10 EQU   TCBPURGE                                                 02545000
TCBRSV09 EQU   TCBPURGE                                                 02546000
TCBJPQF  EQU   TCBPURGE                                                 02547000
TCBJLB   EQU   TCB+40                                                   02548000
TCBLLS   EQU   TCB+36                                                   02549000
TCBDSP   EQU   TCB+35                                                   02550000
TCBLMP   EQU   TCB+34                                                   02551000
TCBPNDSP EQU   TCBFLGS5                                                 02552000
TCBFCD1  EQU   TCBFLGS5                                                 02553000
TCBSTP   EQU   TCBFLGS5                                                 02554000
TCBSYS   EQU   TCBFLGS5                                                 02555000
TCBANDSP EQU   TCBFLGS5                                                 02556000
TCBPAGE  EQU   TCBFLGS5                                                 02557000
TCBUXNDF EQU   TCBABWF                                                  02558000
TCBFC    EQU   TCBFLGS5                                                 02559000
TCBONDSP EQU   TCBFLGS4                                                 02560000
TCBMPCND EQU   TCBFLGS4                                                 02561000
TCBMPCVQ EQU   TCBFLGS4                                                 02562000
TCBUXNDV EQU   TCBFLGS4                                                 02563000
TCBHNDSP EQU   TCBFLGS4                                                 02564000
TCBRQENA EQU   TCBFLGS4                                                 02565000
TCBSER   EQU   TCBFLGS4                                                 02566000
TCBNDUMP EQU   TCBFLGS4                                                 02567000
TCBDWSTA EQU   TCBFLGS3                                                 02568000
TCBRSV08 EQU   TCBFLGS3                                                 02569000
TCBRSV07 EQU   TCBFLGS3                                                 02570000
TCBRSV06 EQU   TCBFLGS3                                                 02571000
TCBABGM  EQU   TCBFLGS3                                                 02572000
TCBABTRM EQU   TCBFLGS3                                                 02573000
TCBADINP EQU   TCBFLGS3                                                 02574000
TCBFSM   EQU   TCBFLGS3                                                 02575000
TCBFTS   EQU   TCBFLGS2                                                 02576000
TCBFETXR EQU   TCBFLGS2                                                 02577000
TCBFDSOP EQU   TCBFLGS2                                                 02578000
TCBFJMC  EQU   TCBFLGS2                                                 02579000
TCBFSMC  EQU   TCBFLGS2                                                 02580000
TCBFABOP EQU   TCBFLGS2                                                 02581000
TCBFSTI  EQU   TCBFLGS2                                                 02582000
TCBFOINP EQU   TCBFLGS2                                                 02583000
TCBFX    EQU   TCBFLGS1                                                 02584000
TCBFS    EQU   TCBFLGS1                                                 02585000
TCBFT    EQU   TCBFLGS1                                                 02586000
TCBPDUMP EQU   TCBFLGS1                                                 02587000
TCBNONPR EQU   TCBFLGS1                                                 02588000
TCBFERA  EQU   TCBFLGS1                                                 02589000
TCBFE    EQU   TCBFLGS1                                                 02590000
TCBFA    EQU   TCBFLGS1                                                 02591000
TCBZERO  EQU   TCBPKF                                                   02592000
TCBFLAG  EQU   TCBPKF                                                   02593000
TCBMSSB  EQU   TCBMSS+1                                                 02594000
TCBRSV03 EQU   TCBMSS                                                   02595000
TCBTRNB  EQU   TCBTRN+1                                                 02596000
TCBRSV02 EQU   TCBABF                                                   02597000
TCBOLTEP EQU   TCBABF                                                   02598000
TCBTCP   EQU   TCBABF                                                   02599000
TCBTCPP  EQU   TCBABF                                                   02600000
TCBRSV01 EQU   TCBABF                                                   02601000
TCBGRPH  EQU   TCBABF                                                   02602000
TCBNOCHK EQU   TCBABF                                                   02603000
TCBMOD91 EQU   TCBABF                                                   02604000
TCBCMPC  EQU   TCBCMP+1                                                 02605000
TCBRV318 EQU   TCBCMSG                                                  02606000
TCBRV317 EQU   TCBCIND                                                  02607000
TCBRV316 EQU   TCBCWTO                                                  02608000
TCBCASID EQU   TCBCDBL                                                  02609000
TCBNOCC  EQU   TCBSTCC                                                  02610000
TCBDMPO  EQU   TCBCPP                                                   02611000
TCBCSTEP EQU   TCBCMPF                                                  02612000
TCBCREQ  EQU   TCBCMPF                                                  02613000
TCBDEB   EQU   TCB+8                                                    02614000
TCBPIEA  EQU   TCBPIE+1                                                 02615000
TCBPM    EQU   TCBPMASK                                                 02616000
@NM00085 EQU   TCBPMASK                                                 02617000
TCBRBP   EQU   TCB                                                      02618000
TCBFRS6  EQU   TCBFRS+24                                                02619000
TCBFRS4  EQU   TCBFRS+16                                                02620000
TCBFRS2  EQU   TCBFRS+8                                                 02621000
TCBFRS0  EQU   TCBFRS                                                   02622000
R66RSV03 EQU   R66RTRYW                                                 02623000
R66RSV00 EQU   R66MPSTW                                                 02624000
@NM00084 EQU   SRBSECT+40                                               02625000
@NM00083 EQU   SRBSECT+38                                               02626000
SRBPRIOR EQU   SRBSECT+37                                               02627000
SRBPKF   EQU   SRBSECT+36                                               02628000
SRBSAVE  EQU   SRBSECT+32                                               02629000
SRBPARM  EQU   SRBSECT+28                                               02630000
SRBRMTR  EQU   SRBSECT+24                                               02631000
SRBEP    EQU   SRBSECT+20                                               02632000
SRBPTCB  EQU   SRBFLC+4                                                 02633000
SRBPASID EQU   SRBFLC+2                                                 02634000
SRBCPAFF EQU   SRBFLC                                                   02635000
SRBASCB  EQU   SRBSECT+8                                                02636000
SRBFLNK  EQU   SRBSECT+4                                                02637000
SRBID    EQU   SRBSECT                                                  02638000
RPLERMSA EQU   RPLCOMN+72                                               02639000
RPLEMLEN EQU   RPLCOMN+70                                               02640000
RPLACTIV EQU   RPLCOMN+69                                               02641000
RPLBRANC EQU   RPLEXTD1                                                 02642000
RPLNIB   EQU   RPLEXTD1                                                 02643000
@NM00082 EQU   RPLEXTD1                                                 02644000
RPLEXIT  EQU   RPLEXTD1                                                 02645000
RPLNEXIT EQU   RPLEXTD1                                                 02646000
RPLEXSCH EQU   RPLEXTD1                                                 02647000
RPLDDDD  EQU   RPLRBAR+4                                                02648000
@NM00081 EQU   RPLRBAR+3                                                02649000
@NM00080 EQU   RPLAIXID                                                 02650000
RPLAXPKP EQU   RPLAIXID                                                 02651000
RPLAIXPC EQU   RPLRBAR                                                  02652000
RPLRSV88 EQU   RPLOPT8                                                  02653000
RPLUNCON EQU   RPLOPT8                                                  02654000
RPLACTV  EQU   RPLOPT8                                                  02655000
RPLSESS  EQU   RPLOPT8                                                  02656000
RPLPEND  EQU   RPLOPT8                                                  02657000
RPLODPRM EQU   RPLOPT8                                                  02658000
RPLODACP EQU   RPLOPT8                                                  02659000
RPLODACQ EQU   RPLOPT8                                                  02660000
RPLRSV78 EQU   RPLOPT7                                                  02661000
RPLTCRNO EQU   RPLOPT7                                                  02662000
RPLRLSOP EQU   RPLOPT7                                                  02663000
RPLTPOST EQU   RPLOPT7                                                  02664000
RPLQOPT  EQU   RPLOPT7                                                  02665000
RPLCNIMM EQU   RPLCNOPT                                                 02666000
RPLCNANY EQU   RPLCNOPT                                                 02667000
RPLCNALL EQU   RPLCNOPT                                                 02668000
RPLRSV68 EQU   RPLOPT6                                                  02669000
RPLRSV67 EQU   RPLOPT6                                                  02670000
RPLLOCK  EQU   RPLOPT6                                                  02671000
RPLNCOND EQU   RPLOPT6                                                  02672000
RPLCOND  EQU   RPLOPT6                                                  02673000
RPLEOT   EQU   RPLUNTYP                                                 02674000
RPLEOM   EQU   RPLUNTYP                                                 02675000
RPLEOB   EQU   RPLUNTYP                                                 02676000
RPLWROPT EQU   RPLOPT5                                                  02677000
RPLNODE  EQU   RPLOPT5                                                  02678000
RPLERACE EQU   RPLWRTYP                                                 02679000
RPLEAU   EQU   RPLWRTYP                                                 02680000
RPLNERAS EQU   RPLWRTYP                                                 02681000
RPLPSOPT EQU   RPLOPT5                                                  02682000
@NM00079 EQU   RPLOPT5                                                  02683000
RPLDLGIN EQU   RPLOPT5                                                  02684000
RPLBUFL  EQU   RPLCOMN+52                                               02685000
RPLRLEN  EQU   RPLCOMN+48                                               02686000
RPLCHAIN EQU   RPLNXTRP                                                 02687000
RPLBOP   EQU   RPLOPT4                                                  02688000
@NM00078 EQU   RPLOPT4                                                  02689000
RPLMKFRM EQU   RPLOPT4                                                  02690000
RPLENDTR EQU   RPLOPT4                                                  02691000
RPLALIGN EQU   RPLOPT3                                                  02692000
RPLFMT   EQU   RPLOPT3                                                  02693000
RPLFLD   EQU   RPLOPT3                                                  02694000
RPLVFY   EQU   RPLOPT3                                                  02695000
RPLBLK   EQU   RPLOPT3                                                  02696000
RPLSFORM EQU   RPLOPT3                                                  02697000
RPLEODS  EQU   RPLOPT3                                                  02698000
RPLNSP   EQU   RPLOPT2                                                  02699000
RPLUPD   EQU   RPLOPT2                                                  02700000
@NM00077 EQU   RPLOPT2                                                  02701000
RPLLRD   EQU   RPLOPT2                                                  02702000
RPLBWD   EQU   RPLOPT2                                                  02703000
RPLCNV   EQU   RPLOPT2                                                  02704000
RPLADD   EQU   RPLADR                                                   02705000
RPLKEY   EQU   RPLOPT2                                                  02706000
RPLECBIN EQU   RPLECBSW                                                 02707000
RPLGEN   EQU   RPLOPT1                                                  02708000
RPLKGE   EQU   RPLOPT1                                                  02709000
RPLASY   EQU   RPLOPT1                                                  02710000
RPLSKP   EQU   RPLOPT1                                                  02711000
RPLSEQ   EQU   RPLOPT1                                                  02712000
RPLDIR   EQU   RPLOPT1                                                  02713000
RPLLOC   EQU   RPLOPT1                                                  02714000
RPLDAF   EQU   RPLARG+2                                                 02715000
RPLSAF   EQU   RPLARG                                                   02716000
RPLAREA  EQU   RPLCOMN+32                                               02717000
RPLTCBPT EQU   RPLCOMN+28                                               02718000
RPLDACB  EQU   RPLCOMN+24                                               02719000
RPLCCHAR EQU   RPLCOMN+20                                               02720000
RPLSTRID EQU   RPLCOMN+18                                               02721000
RPLKEYL  EQU   RPLKEYLE                                                 02722000
RPLRDSOH EQU   RPLFDB3                                                  02723000
RPLRLG   EQU   RPLFDB3                                                  02724000
RPLLGFRC EQU   RPLFDB3                                                  02725000
RPLREOT  EQU   RPLFDB3                                                  02726000
RPLREOM  EQU   RPLFDB3                                                  02727000
RPLREOB  EQU   RPLFDB3                                                  02728000
RPLSV32  EQU   RPLFDB3                                                  02729000
RPLUINPT EQU   RPLFDB3                                                  02730000
RPLSTSAV EQU   RPLFDB2                                                  02731000
RPLCUERR EQU   RPLFDB2                                                  02732000
RPLDLGFL EQU   RPLFDB2                                                  02733000
RPLIOERR EQU   RPLFDB2                                                  02734000
RPLDVUNS EQU   RPLFDB2                                                  02735000
RPLATND  EQU   RPLFDB2                                                  02736000
RPLRVID  EQU   RPLFDB2                                                  02737000
RPLERLK  EQU   RPLFDB2                                                  02738000
RPLERREG EQU   RPLRTNCD                                                 02739000
RPLPOST  EQU   RPLECB                                                   02740000
RPLWAIT  EQU   RPLECB                                                   02741000
RPLPLHPT EQU   RPLCOMN+4                                                02742000
RPLLEN2  EQU   RPLLEN                                                   02743000
RPLREQ   EQU   RPLIDWD+2                                                02744000
RPLSTYP  EQU   RPLIDWD+1                                                02745000
@NM00076 EQU   FRRSFLGS+1                                               02746000
@NM00075 EQU   FRRSFLG1                                                 02747000
FRRSRCUR EQU   FRRSFLG1                                                 02748000
FRRSENTS EQU   FRRS+84                                                  02749000
FRRSRTMW EQU   FRRS+16                                                  02750000
CVTLEVL  EQU   CVTRELNO+2                                               02751000
CVTNUMB  EQU   CVTRELNO                                                 02752000
CVTMDL   EQU   CVTFIX+250                                               02753000
@NM00074 EQU   CVTFIX+248                                               02754000
@NM00073 EQU   CVTFIX                                                   02755000
CVTRV482 EQU   CVTXTNT2+128                                             02756000
CVTRV481 EQU   CVTXTNT2+124                                             02757000
CVTRV480 EQU   CVTXTNT2+120                                             02758000
CVTRV479 EQU   CVTXTNT2+118                                             02759000
CVTRV478 EQU   CVTXTNT2+117                                             02760000
CVTRV477 EQU   CVTXTNT2+116                                             02761000
CVTRV476 EQU   CVTXTNT2+115                                             02762000
CVTRV475 EQU   CVTXTNT2+114                                             02763000
CVTRV474 EQU   CVTRV466                                                 02764000
CVTRV473 EQU   CVTRV466                                                 02765000
CVTRV472 EQU   CVTRV466                                                 02766000
CVTRV471 EQU   CVTRV466                                                 02767000
CVTRV470 EQU   CVTRV466                                                 02768000
CVTRV469 EQU   CVTRV466                                                 02769000
CVTRV468 EQU   CVTRV466                                                 02770000
CVTRV467 EQU   CVTRV466                                                 02771000
CVTRV465 EQU   CVTRV457                                                 02772000
CVTRV464 EQU   CVTRV457                                                 02773000
CVTRV463 EQU   CVTRV457                                                 02774000
CVTRV462 EQU   CVTRV457                                                 02775000
CVTRV461 EQU   CVTRV457                                                 02776000
CVTRV460 EQU   CVTRV457                                                 02777000
CVTRV459 EQU   CVTRV457                                                 02778000
CVTRV458 EQU   CVTRV457                                                 02779000
CVTRV456 EQU   CVTXTNT2+108                                             02780000
CVTRV455 EQU   CVTXTNT2+104                                             02781000
CVTRV454 EQU   CVTXTNT2+100                                             02782000
CVTRV453 EQU   CVTXTNT2+96                                              02783000
CVTRV452 EQU   CVTXTNT2+94                                              02784000
CVTRV451 EQU   CVTXTNT2+92                                              02785000
CVTRV450 EQU   CVTXTNT2+90                                              02786000
CVTRV449 EQU   CVTXTNT2+88                                              02787000
CVTRV448 EQU   CVTXTNT2+87                                              02788000
CVTRV447 EQU   CVTXTNT2+86                                              02789000
CVTRV446 EQU   CVTRV438                                                 02790000
CVTRV445 EQU   CVTRV438                                                 02791000
CVTRV444 EQU   CVTRV438                                                 02792000
CVTRV443 EQU   CVTRV438                                                 02793000
CVTRV442 EQU   CVTRV438                                                 02794000
CVTRV441 EQU   CVTRV438                                                 02795000
CVTRV440 EQU   CVTRV438                                                 02796000
CVTRV439 EQU   CVTRV438                                                 02797000
CVTRV437 EQU   CVTRV429                                                 02798000
CVTRV436 EQU   CVTRV429                                                 02799000
CVTRV435 EQU   CVTRV429                                                 02800000
CVTRV434 EQU   CVTRV429                                                 02801000
CVTRV433 EQU   CVTRV429                                                 02802000
CVTRV432 EQU   CVTRV429                                                 02803000
CVTRV431 EQU   CVTRV429                                                 02804000
CVTRV430 EQU   CVTRV429                                                 02805000
CVTRV428 EQU   CVTXTNT2+80                                              02806000
CVTRV427 EQU   CVTXTNT2+76                                              02807000
CVTRV426 EQU   CVTXTNT2+72                                              02808000
CVTRV425 EQU   CVTXTNT2+68                                              02809000
CVTATACT EQU   CVTATCVT                                                 02810000
CVTRV423 EQU   CVTXTNT2+62                                              02811000
CVTRV422 EQU   CVTXTNT2+60                                              02812000
CVTRV421 EQU   CVTXTNT2+58                                              02813000
CVTRV420 EQU   CVTXTNT2+56                                              02814000
CVTRV419 EQU   CVTXTNT2+55                                              02815000
CVTRV418 EQU   CVTXTNT2+54                                              02816000
CVTRV417 EQU   CVTRV409                                                 02817000
CVTRV416 EQU   CVTRV409                                                 02818000
CVTRV415 EQU   CVTRV409                                                 02819000
CVTRV414 EQU   CVTRV409                                                 02820000
CVTRV413 EQU   CVTRV409                                                 02821000
CVTRV412 EQU   CVTRV409                                                 02822000
CVTRV411 EQU   CVTRV409                                                 02823000
CVTRV410 EQU   CVTRV409                                                 02824000
CVTRV408 EQU   CVTRV400                                                 02825000
CVTRV407 EQU   CVTRV400                                                 02826000
CVTRV406 EQU   CVTRV400                                                 02827000
CVTRV405 EQU   CVTRV400                                                 02828000
CVTRV404 EQU   CVTRV400                                                 02829000
CVTRV403 EQU   CVTRV400                                                 02830000
CVTRV402 EQU   CVTRV400                                                 02831000
CVTRV401 EQU   CVTRV400                                                 02832000
CVTICB   EQU   CVTXTNT2+48                                              02833000
CVTSKTA  EQU   CVTXTNT2+44                                              02834000
CVTSHSB  EQU   CVTSHS                                                   02835000
CVTRSV98 EQU   CVTXTNT2+36                                              02836000
CVTRSV97 EQU   CVTXTNT2+34                                              02837000
CVTRSV96 EQU   CVTXTNT2+32                                              02838000
CVTOLTEP EQU   CVTXTNT2+28                                              02839000
CVTQIDA  EQU   CVTQID+1                                                 02840000
CVTRSV95 EQU   CVTQID                                                   02841000
CVTRSV94 EQU   CVTXTNT2+20                                              02842000
CVTRSV93 EQU   CVTXTNT2+16                                              02843000
CVTRSV92 EQU   CVTXTNT2+12                                              02844000
CVTDEBVR EQU   CVTXTNT2+8                                               02845000
CVTRSV91 EQU   CVTXTNT2+6                                               02846000
CVTRSV9H EQU   CVTFLGBT                                                 02847000
CVTRSV9G EQU   CVTFLGBT                                                 02848000
CVTRSV9F EQU   CVTFLGBT                                                 02849000
CVTRSV9E EQU   CVTFLGBT                                                 02850000
CVTRSV9D EQU   CVTFLGBT                                                 02851000
CVTRSV9C EQU   CVTFLGBT                                                 02852000
CVTVME   EQU   CVTFLGBT                                                 02853000
CVTNPE   EQU   CVTFLGBT                                                 02854000
CVTNUCLS EQU   CVTXTNT2+4                                               02855000
CVTDSSVA EQU   CVTDSSV+1                                                02856000
CVTRSV89 EQU   CVTDSSV                                                  02857000
CVTRSV88 EQU   CVTXTNT1+8                                               02858000
CVTRSV87 EQU   CVTXTNT1+4                                               02859000
CVTFACHN EQU   CVTXTNT1                                                 02860000
CVTRV488 EQU   CVTMAP+412                                               02861000
CVTRV487 EQU   CVTMAP+408                                               02862000
CVTRV486 EQU   CVTMAP+404                                               02863000
CVTRV485 EQU   CVTMAP+400                                               02864000
CVTACTAP EQU   CVTMAP+396                                               02865000
CVTAUTH  EQU   CVTMAP+392                                               02866000
CVTATMCA EQU   CVTATMCT+1                                               02867000
CVTATMST EQU   CVTATMCT                                                 02868000
CVTRSV61 EQU   CVTMAP+384                                               02869000
CVTVOLT1 EQU   CVTVOLM1+1                                               02870000
CVTVOLI1 EQU   CVTVOLF1                                                 02871000
CVTSTOA  EQU   CVTMAP+376                                               02872000
CVTRSV58 EQU   CVTMAP+374                                               02873000
CVTRSV57 EQU   CVTMAP+372                                               02874000
CVTDDCE  EQU   CVTMAP+368                                               02875000
CVTPNWFR EQU   CVTMAP+364                                               02876000
CVTSMF   EQU   CVTMAP+360                                               02877000
CVTSULK  EQU   CVTMAP+358                                               02878000
CVTSLKO  EQU   CVTSYSK                                                  02879000
CVTSLKP  EQU   CVTSYSK                                                  02880000
CVTSLKQ  EQU   CVTSYSK                                                  02881000
CVTSLKR  EQU   CVTSYSK                                                  02882000
CVTRSV56 EQU   CVTSYSK                                                  02883000
CVTRSV55 EQU   CVTSYSK                                                  02884000
CVTRSV54 EQU   CVTSYSK                                                  02885000
CVTRSV53 EQU   CVTSYSK                                                  02886000
CVTRSV52 EQU   CVTA1F1                                                  02887000
CVTRSV51 EQU   CVTA1F1                                                  02888000
CVTRSV50 EQU   CVTA1F1                                                  02889000
CVTRSV49 EQU   CVTA1F1                                                  02890000
CVTRSV48 EQU   CVTA1F1                                                  02891000
CVTRSV47 EQU   CVTA1F1                                                  02892000
CVTSRSW  EQU   CVTA1F1                                                  02893000
CVTPFSW  EQU   CVTA1F1                                                  02894000
CVTPCVT  EQU   CVTMAP+352                                               02895000
CVTRSV46 EQU   CVTMAP+344                                               02896000
CVTRSV45 EQU   CVTMAP+340                                               02897000
CVTRSV44 EQU   CVTMAP+338                                               02898000
CVTRSV43 EQU   CVTMAP+336                                               02899000
CVTHJESA EQU   CVTHJES+1                                                02900000
CVTRSV42 EQU   CVTHJES                                                  02901000
CVTEXT2A EQU   CVTEXT2+1                                                02902000
CVTRSV41 EQU   CVTEXT2                                                  02903000
CVTAPFA  EQU   CVTAPF+1                                                 02904000
CVTRSV40 EQU   CVTAPF                                                   02905000
CVTRV518 EQU   CVTINTLA                                                 02906000
CVTRV517 EQU   CVTERPV                                                  02907000
CVTEORM  EQU   CVTMAP+312                                               02908000
CVTMCHPR EQU   CVTMAP+308                                               02909000
CVTTZ    EQU   CVTMAP+304                                               02910000
CVTJEPS  EQU   CVTMAP+300                                               02911000
CVTJESCT EQU   CVTMAP+296                                               02912000
CVTMODE  EQU   CVTMAP+292                                               02913000
CVTPTRV  EQU   CVTMAP+288                                               02914000
CVTREAL  EQU   CVTMAP+284                                               02915000
CVTRSV39 EQU   CVTMAP+280                                               02916000
CVTRSV38 EQU   CVTMAP+276                                               02917000
CVTDMSRA EQU   CVTDMSR+1                                                02918000
CVTRSV37 EQU   CVTDMSR                                                  02919000
CVTQMSGA EQU   CVTQMSG+1                                                02920000
CVTRSV36 EQU   CVTQMSG                                                  02921000
CVTAMFF  EQU   CVTMAP+264                                               02922000
CVTPURGA EQU   CVTPURG+1                                                02923000
CVTRSV35 EQU   CVTPURG                                                  02924000
CVTCBSP  EQU   CVTMAP+256                                               02925000
CVTATERA EQU   CVTATER+1                                                02926000
CVTSYST  EQU   CVTATER                                                  02927000
CVTVOLT2 EQU   CVTTAT                                                   02928000
CVTVOLI2 EQU   CVTVOLF2                                                 02929000
CVTAQAVB EQU   CVTAQAVT+1                                               02930000
CVTRSV34 EQU   CVTTCMFG                                                 02931000
CVTRSV33 EQU   CVTTCMFG                                                 02932000
CVTRSV32 EQU   CVTTCMFG                                                 02933000
CVTRSV31 EQU   CVTTCMFG                                                 02934000
CVTRSV30 EQU   CVTTCMFG                                                 02935000
CVTRSV29 EQU   CVTTCMFG                                                 02936000
CVTRSV28 EQU   CVTTCMFG                                                 02937000
CVTTCRDY EQU   CVTTCMFG                                                 02938000
CVTGTFA  EQU   CVTGTF+1                                                 02939000
CVTRSV27 EQU   CVTGTFST                                                 02940000
CVTRNIO  EQU   CVTGTFST                                                 02941000
CVTUSR   EQU   CVTGTFST                                                 02942000
CVTRV318 EQU   CVTFORM                                                  02943000
CVTRV317 EQU   CVTTMODE                                                 02944000
CVTRV316 EQU   CVTSTATE                                                 02945000
CVTRV315 EQU   CVTGTFS                                                  02946000
CVTGTFAV EQU   CVTGTFS                                                  02947000
CVT0SCR1 EQU   CVTMAP+232                                               02948000
CVTRV515 EQU   CVTMAP+228                                               02949000
CVTRMS   EQU   CVTMAP+224                                               02950000
CVTPATCH EQU   CVTMAP+220                                               02951000
CVTTSCE  EQU   CVTMAP+216                                               02952000
CVTLNKSC EQU   CVTMAP+214                                               02953000
CVTQABST EQU   CVTMAP+212                                               02954000
CVTMDLDS EQU   CVTMAP+208                                               02955000
CVTUSER  EQU   CVTMAP+204                                               02956000
CVTABEND EQU   CVTMAP+200                                               02957000
CVTSMCA  EQU   CVTMAP+196                                               02958000
CVTRSV18 EQU   CVTMAP+192                                               02959000
CVTQLPAQ EQU   CVTMAP+188                                               02960000
CVTQCDSR EQU   CVTMAP+184                                               02961000
CVTRSV17 EQU   CVTOPTB                                                  02962000
CVTRSV16 EQU   CVTOPTB                                                  02963000
CVTFP    EQU   CVTOPTB                                                  02964000
CVTAPTHR EQU   CVTOPTB                                                  02965000
CVTNLOG  EQU   CVTOPTB                                                  02966000
CVTTOD   EQU   CVTOPTB                                                  02967000
CVTCTIMS EQU   CVTOPTB                                                  02968000
CVTPROT  EQU   CVTOPTB                                                  02969000
CVTXPFP  EQU   CVTOPTA                                                  02970000
CVTASCII EQU   CVTOPTA                                                  02971000
CVTRSV13 EQU   CVTOPTA                                                  02972000
CVTRSV12 EQU   CVTOPTA                                                  02973000
CVTNIP   EQU   CVTOPTA                                                  02974000
CVTDDR   EQU   CVTOPTA                                                  02975000
CVTAPR   EQU   CVTOPTA                                                  02976000
CVTCCH   EQU   CVTOPTA                                                  02977000
CVTSNCTR EQU   CVTMAP+180                                               02978000
CVTQMWR  EQU   CVTMAP+176                                               02979000
CVTQOCR  EQU   CVTMAP+172                                               02980000
CVT1EF00 EQU   CVTMAP+168                                               02981000
CVTMZ00  EQU   CVTMAP+164                                               02982000
CVTHEAD  EQU   CVTMAP+160                                               02983000
CVTRSV11 EQU   CVTMAP+156                                               02984000
CVT0PT01 EQU   CVTMAP+152                                               02985000
CVTMSER  EQU   CVTMAP+148                                               02986000
CVTRV516 EQU   CVTIERLC                                                 02987000
CVTILCH  EQU   CVTMAP+140                                               02988000
CVT0DS   EQU   CVTMAP+136                                               02989000
CVTFBOSV EQU   CVTMAP+132                                               02990000
CVTNUCB  EQU   CVTMAP+128                                               02991000
CVTIXAVL EQU   CVTMAP+124                                               02992000
CVTIOQET EQU   CVTMAP+120                                               02993000
CVTDCBA  EQU   CVTMAP+117                                               02994000
CVTMVS2  EQU   CVTDCB                                                   02995000
CVT6DAT  EQU   CVTDCB                                                   02996000
CVT4MPS  EQU   CVTDCB                                                   02997000
CVTRSV09 EQU   CVTDCB                                                   02998000
CVT4MS1  EQU   CVTDCB                                                   02999000
CVT2SPS  EQU   CVTDCB                                                   03000000
CVT1SSS  EQU   CVTDCB                                                   03001000
CVTRSV08 EQU   CVTDCB                                                   03002000
CVTSTB   EQU   CVTMAP+112                                               03003000
CVTQTD00 EQU   CVTMAP+108                                               03004000
CVTQTE00 EQU   CVTMAP+104                                               03005000
CVTCUCB  EQU   CVTMAP+100                                               03006000
CVTSJQ   EQU   CVTMAP+96                                                03007000
CVTPBLDL EQU   CVTMAP+92                                                03008000
CVTTPC   EQU   CVTMAP+88                                                03009000
CVTSVDCB EQU   CVTMAP+84                                                03010000
CVTBRET  EQU   CVTMAP+82                                                03011000
CVTEXIT  EQU   CVTMAP+80                                                03012000
CVT0FN00 EQU   CVTMAP+76                                                03013000
CVTDARA  EQU   CVTDAR+1                                                 03014000
CVTRSV07 EQU   CVTFLGS1                                                 03015000
CVTRSV06 EQU   CVTFLGS1                                                 03016000
CVTRSV05 EQU   CVTFLGS1                                                 03017000
CVTRSV04 EQU   CVTFLGS1                                                 03018000
CVTRSV03 EQU   CVTFLGS1                                                 03019000
CVTRSV02 EQU   CVTFLGS1                                                 03020000
CVTRSV01 EQU   CVTFLGS1                                                 03021000
CVTDMPLK EQU   CVTFLGS1                                                 03022000
CVTXITP  EQU   CVTMAP+68                                                03023000
CVTZDTAB EQU   CVTMAP+64                                                03024000
CVTMSLT  EQU   CVTMAP+60                                                03025000
CVTDATE  EQU   CVTMAP+56                                                03026000
CVTSYSAD EQU   CVTMAP+48                                                03027000
CVTXTLER EQU   CVTMAP+44                                                03028000
CVTILK2  EQU   CVTMAP+40                                                03029000
CVTILK1  EQU   CVTMAP+36                                                03030000
CVTPRLTV EQU   CVTMAP+32                                                03031000
CVTPCNVT EQU   CVTMAP+28                                                03032000
CVT0VL00 EQU   CVTMAP+24                                                03033000
CVTXAPG  EQU   CVTMAP+20                                                03034000
CVTBUF   EQU   CVTMAP+16                                                03035000
CVTJOB   EQU   CVTMAP+12                                                03036000
CVTLINK  EQU   CVTMAP+8                                                 03037000
CVT0EF00 EQU   CVTMAP+4                                                 03038000
CVTTCBP  EQU   CVTMAP                                                   03039000
CVT      EQU   CVTMAP                                                   03040000
@NM00048 EQU   SDWA+512                                                 03041000
@NM00047 EQU   SDWADPVA                                                 03042000
SDWAEBC  EQU   SDWADPVA                                                 03043000
SDWAVRAL EQU   SDWARA                                                   03044000
@NM00046 EQU   SDWA+396                                                 03045000
SDWACOMP EQU   SDWA+392                                                 03046000
SDWARCPL EQU   SDWA+364                                                 03047000
@NM00045 EQU   SDWADPSA+32                                              03048000
SDWATO4  EQU   SDWADPSL+28                                              03049000
SDWAFRM4 EQU   SDWADPSL+24                                              03050000
SDWATO3  EQU   SDWADPSL+20                                              03051000
SDWAFRM3 EQU   SDWADPSL+16                                              03052000
SDWATO2  EQU   SDWADPSL+12                                              03053000
SDWAFRM2 EQU   SDWADPSL+8                                               03054000
SDWATO1  EQU   SDWADPSL+4                                               03055000
SDWAFRM1 EQU   SDWADPSL                                                 03056000
@NM00044 EQU   SDWADDAT+3                                               03057000
@NM00043 EQU   SDWAPDAT                                                 03058000
SDWAUSPL EQU   SDWAPDAT                                                 03059000
SDWADPSW EQU   SDWAPDAT                                                 03060000
SDWATJPA EQU   SDWAPDAT                                                 03061000
SDWATLPA EQU   SDWAPDAT                                                 03062000
SDWADREG EQU   SDWAPDAT                                                 03063000
SDWADSAH EQU   SDWAPDAT                                                 03064000
SDWADSAS EQU   SDWAPDAT                                                 03065000
@NM00042 EQU   SDWADDAT+1                                               03066000
@NM00041 EQU   SDWASDAT                                                 03067000
SDWAQQS  EQU   SDWASDAT                                                 03068000
SDWACBS  EQU   SDWASDAT                                                 03069000
SDWAGTF  EQU   SDWASDAT                                                 03070000
SDWASWA  EQU   SDWASDAT                                                 03071000
SDWALSQA EQU   SDWASDAT                                                 03072000
SDWASQA  EQU   SDWASDAT                                                 03073000
SDWANUC  EQU   SDWASDAT                                                 03074000
@NM00040 EQU   SDWADUMP+2                                               03075000
@NM00039 EQU   SDWADPFS                                                 03076000
SDWASLST EQU   SDWADPFS                                                 03077000
@NM00038 EQU   SDWADPFS                                                 03078000
SDWADLST EQU   SDWADPFS                                                 03079000
SDWADPT  EQU   SDWADPFS                                                 03080000
SDWADPID EQU   SDWADUMP                                                 03081000
SDWADPLA EQU   SDWA+316                                                 03082000
@NM00037 EQU   SDWALKWA+32                                              03083000
SDWATALW EQU   SDWALKWS+28                                              03084000
SDWATDLW EQU   SDWALKWS+24                                              03085000
SDWATNLW EQU   SDWALKWS+20                                              03086000
SDWAAPLW EQU   SDWALKWS+16                                              03087000
SDWAIPLW EQU   SDWALKWS+12                                              03088000
SDWAILLW EQU   SDWALKWS+8                                               03089000
SDWAIULW EQU   SDWALKWS+4                                               03090000
SDWAICLW EQU   SDWALKWS                                                 03091000
SDWAFLLK EQU   SDWAACF4                                                 03092000
SDWACMS  EQU   SDWAACF4                                                 03093000
SDWAOPTM EQU   SDWAACF4                                                 03094000
SDWATADB EQU   SDWAACF4                                                 03095000
SDWATDNB EQU   SDWAACF4                                                 03096000
SDWATNCB EQU   SDWAACF4                                                 03097000
SDWAILCH EQU   SDWAACF4                                                 03098000
SDWAIUCB EQU   SDWAACF4                                                 03099000
SDWAICAT EQU   SDWAACF3                                                 03100000
SDWAIPRG EQU   SDWAACF3                                                 03101000
SDWASALL EQU   SDWAACF3                                                 03102000
SDWAASMP EQU   SDWAACF3                                                 03103000
SDWADISP EQU   SDWAACF3                                                 03104000
@NM00036 EQU   SDWAACF3                                                 03105000
@NM00035 EQU   SDWAACF2                                                 03106000
SDWAFREE EQU   SDWAACF2                                                 03107000
@NM00034 EQU   SDWAACF2                                                 03108000
SDWASPIN EQU   SDWAACF2                                                 03109000
@NM00033 EQU   SDWAACF2                                                 03110000
SDWALCPU EQU   SDWACPUA+2                                               03111000
@NM00032 EQU   SDWACPUA                                                 03112000
SDWARECA EQU   SDWA+244                                                 03113000
@NM00031 EQU   SDWA+239                                                 03114000
@NM00030 EQU   SDWAIOFS                                                 03115000
SDWANIOP EQU   SDWAIOFS                                                 03116000
SDWANOIO EQU   SDWAIOFS                                                 03117000
SDWAIOHT EQU   SDWAIOFS                                                 03118000
SDWAIOQR EQU   SDWAIOFS                                                 03119000
@NM00029 EQU   SDWAERRD                                                 03120000
SDWAMCIV EQU   SDWAERRD                                                 03121000
SDWARPIV EQU   SDWAERRD                                                 03122000
SDWAMABD EQU   SDWAERRD                                                 03123000
SDWACTS  EQU   SDWAERRD                                                 03124000
SDWASTAE EQU   SDWAERRD                                                 03125000
SDWANRBE EQU   SDWAERRD                                                 03126000
SDWACLUP EQU   SDWAERRD                                                 03127000
@NM00028 EQU   SDWAERRC                                                 03128000
SDWAEAS  EQU   SDWAERRC                                                 03129000
SDWAPERC EQU   SDWAERRC                                                 03130000
SDWAIRB  EQU   SDWAERRC                                                 03131000
SDWASTAI EQU   SDWAERRC                                                 03132000
SDWASTAF EQU   SDWAERRC                                                 03133000
SDWASRBM EQU   SDWAERRB                                                 03134000
SDWALDIS EQU   SDWAERRB                                                 03135000
SDWAENRB EQU   SDWAERRB                                                 03136000
SDWATYP1 EQU   SDWAERRB                                                 03137000
@NM00027 EQU   SDWAERRB                                                 03138000
SDWAPGIO EQU   SDWAERRA                                                 03139000
SDWATEXC EQU   SDWAERRA                                                 03140000
SDWASVCE EQU   SDWAERRA                                                 03141000
SDWAABTM EQU   SDWAERRA                                                 03142000
SDWASVCD EQU   SDWAERRA                                                 03143000
SDWARKEY EQU   SDWAERRA                                                 03144000
SDWAPCHK EQU   SDWAERRA                                                 03145000
SDWAMCHK EQU   SDWAERRA                                                 03146000
SDWATIME EQU   SDWAMCH+20                                               03147000
SDWARFSA EQU   SDWAMCH+16                                               03148000
@NM00026 EQU   SDWAMCH+14                                               03149000
SDWAVEQR EQU   SDWARSR2                                                 03150000
SDWAPGFX EQU   SDWARSR2                                                 03151000
SDWAFLSQ EQU   SDWARSR2                                                 03152000
SDWAFSQA EQU   SDWARSR2                                                 03153000
SDWANUCL EQU   SDWARSR2                                                 03154000
SDWASPER EQU   SDWARSR2                                                 03155000
SDWAINTC EQU   SDWARSR2                                                 03156000
SDWAOFLN EQU   SDWARSR2                                                 03157000
SDWACHNG EQU   SDWARSR1                                                 03158000
SDWAMSER EQU   SDWARSR1                                                 03159000
@NM00025 EQU   SDWARSR1                                                 03160000
SDWACPID EQU   SDWAMCH+10                                               03161000
SDWATERR EQU   SDWAMCHD                                                 03162000
SDWAFPRX EQU   SDWAMCHD                                                 03163000
SDWAINSF EQU   SDWAMCHD                                                 03164000
SDWAACR  EQU   SDWAMCHD                                                 03165000
SDWASCK  EQU   SDWAMCHD                                                 03166000
SDWAPSWU EQU   SDWAMCHD                                                 03167000
SDWAREGU EQU   SDWAMCHD                                                 03168000
SDWASKYF EQU   SDWAMCHD                                                 03169000
@NM00024 EQU   SDWAMCHS                                                 03170000
SDWARSRF EQU   SDWAMCHS                                                 03171000
SDWARSRC EQU   SDWAMCHS                                                 03172000
SDWAINVP EQU   SDWAMCHS                                                 03173000
SDWATSVL EQU   SDWAMCHS                                                 03174000
SDWARCDF EQU   SDWAMCHS                                                 03175000
SDWASRVL EQU   SDWAMCHS                                                 03176000
SDWASCKE EQU   SDWASTCK+4                                               03177000
SDWASCKB EQU   SDWASTCK                                                 03178000
SDWALNTH EQU   SDWAIDNT+1                                               03179000
SDWASPID EQU   SDWAIDNT                                                 03180000
SDWASR15 EQU   SDWASRSV+60                                              03181000
SDWASR13 EQU   SDWASRSV+52                                              03182000
SDWASR12 EQU   SDWASRSV+48                                              03183000
SDWASR11 EQU   SDWASRSV+44                                              03184000
SDWASR10 EQU   SDWASRSV+40                                              03185000
SDWASR09 EQU   SDWASRSV+36                                              03186000
SDWASR08 EQU   SDWASRSV+32                                              03187000
SDWASR07 EQU   SDWASRSV+28                                              03188000
SDWASR06 EQU   SDWASRSV+24                                              03189000
SDWASR05 EQU   SDWASRSV+20                                              03190000
SDWASR04 EQU   SDWASRSV+16                                              03191000
SDWASR03 EQU   SDWASRSV+12                                              03192000
SDWASR02 EQU   SDWASRSV+8                                               03193000
SDWASR00 EQU   SDWASRSV                                                 03194000
SDWATRN2 EQU   SDWAAEC2+4                                               03195000
SDWAIPC2 EQU   SDWAICD2                                                 03196000
SDWAIMC2 EQU   SDWAICD2                                                 03197000
SDWAIPR2 EQU   SDWAICD2                                                 03198000
@NM00023 EQU   SDWAINC2                                                 03199000
@NM00022 EQU   SDWAILC2                                                 03200000
SDWAIL2  EQU   SDWAILC2                                                 03201000
@NM00021 EQU   SDWAILC2                                                 03202000
@NM00020 EQU   SDWAAEC2                                                 03203000
SDWAADD2 EQU   SDWANXT2+1                                               03204000
@NM00019 EQU   SDWANXT2                                                 03205000
@NM00018 EQU   SDWAEC2+3                                                03206000
SDWASGN2 EQU   SDWAINT2                                                 03207000
SDWAEXP2 EQU   SDWAINT2                                                 03208000
SDWADEC2 EQU   SDWAINT2                                                 03209000
SDWAFPO2 EQU   SDWAINT2                                                 03210000
SDWACC2  EQU   SDWAINT2                                                 03211000
@NM00017 EQU   SDWAINT2                                                 03212000
SDWAPGM2 EQU   SDWAMWP2                                                 03213000
SDWAWAT2 EQU   SDWAMWP2                                                 03214000
SDWAMCK2 EQU   SDWAMWP2                                                 03215000
SDWAECT2 EQU   SDWAMWP2                                                 03216000
SDWAKEY2 EQU   SDWAMWP2                                                 03217000
SDWAEXT2 EQU   SDWAEMK2                                                 03218000
SDWAIO2  EQU   SDWAEMK2                                                 03219000
SDWATRM2 EQU   SDWAEMK2                                                 03220000
@NM00016 EQU   SDWAEMK2                                                 03221000
SDWAPER2 EQU   SDWAEMK2                                                 03222000
@NM00015 EQU   SDWAEMK2                                                 03223000
SDWATRAN EQU   SDWAAEC1+4                                               03224000
SDWAIPC1 EQU   SDWAICD1                                                 03225000
SDWAIMC1 EQU   SDWAICD1                                                 03226000
SDWAIPR1 EQU   SDWAICD1                                                 03227000
@NM00014 EQU   SDWAINC1                                                 03228000
@NM00013 EQU   SDWAILC1                                                 03229000
SDWAIL1  EQU   SDWAILC1                                                 03230000
@NM00012 EQU   SDWAILC1                                                 03231000
@NM00011 EQU   SDWAAEC1                                                 03232000
SDWAADD1 EQU   SDWANXT1+1                                               03233000
@NM00010 EQU   SDWANXT1                                                 03234000
@NM00009 EQU   SDWAEC1+3                                                03235000
SDWASGN1 EQU   SDWAINT1                                                 03236000
SDWAEXP1 EQU   SDWAINT1                                                 03237000
SDWADEC1 EQU   SDWAINT1                                                 03238000
SDWAFPO1 EQU   SDWAINT1                                                 03239000
SDWACC1  EQU   SDWAINT1                                                 03240000
@NM00008 EQU   SDWAINT1                                                 03241000
SDWAPGM1 EQU   SDWAMWP1                                                 03242000
SDWAWAT1 EQU   SDWAMWP1                                                 03243000
SDWAMCK1 EQU   SDWAMWP1                                                 03244000
SDWAECT1 EQU   SDWAMWP1                                                 03245000
SDWAKEY1 EQU   SDWAMWP1                                                 03246000
SDWAEXT1 EQU   SDWAEMK1                                                 03247000
SDWAIO1  EQU   SDWAEMK1                                                 03248000
SDWATRM1 EQU   SDWAEMK1                                                 03249000
@NM00007 EQU   SDWAEMK1                                                 03250000
SDWAPER1 EQU   SDWAEMK1                                                 03251000
@NM00006 EQU   SDWAEMK1                                                 03252000
SDWAIOBR EQU   SDWA+100                                                 03253000
SDWAEPA  EQU   SDWA+96                                                  03254000
@NM00005 EQU   SDWANAME+4                                               03255000
SDWARBAD EQU   SDWANAME                                                 03256000
SDWAGR15 EQU   SDWAGRSV+60                                              03257000
SDWAGR14 EQU   SDWAGRSV+56                                              03258000
SDWAGR13 EQU   SDWAGRSV+52                                              03259000
SDWAGR12 EQU   SDWAGRSV+48                                              03260000
SDWAGR11 EQU   SDWAGRSV+44                                              03261000
SDWAGR10 EQU   SDWAGRSV+40                                              03262000
SDWAGR09 EQU   SDWAGRSV+36                                              03263000
SDWAGR08 EQU   SDWAGRSV+32                                              03264000
SDWAGR07 EQU   SDWAGRSV+28                                              03265000
SDWAGR06 EQU   SDWAGRSV+24                                              03266000
SDWAGR05 EQU   SDWAGRSV+20                                              03267000
SDWAGR04 EQU   SDWAGRSV+16                                              03268000
SDWAGR03 EQU   SDWAGRSV+12                                              03269000
SDWAGR02 EQU   SDWAGRSV+8                                               03270000
SDWAGR01 EQU   SDWAGRSV+4                                               03271000
SDWAGR00 EQU   SDWAGRSV                                                 03272000
SDWANXTP EQU   SDWACTL2+5                                               03273000
SDWASGP  EQU   SDWAPMKP                                                 03274000
SDWAEUP  EQU   SDWAPMKP                                                 03275000
SDWADOP  EQU   SDWAPMKP                                                 03276000
SDWAFPP  EQU   SDWAPMKP                                                 03277000
SDWACCP  EQU   SDWAPMKP                                                 03278000
SDWAILP  EQU   SDWAPMKP                                                 03279000
SDWAINTP EQU   SDWACTL2+2                                               03280000
SDWASPVP EQU   SDWAMWPP                                                 03281000
SDWAWATP EQU   SDWAMWPP                                                 03282000
SDWAMCKP EQU   SDWAMWPP                                                 03283000
@NM00004 EQU   SDWAMWPP                                                 03284000
SDWAKEYP EQU   SDWAMWPP                                                 03285000
SDWAEXTP EQU   SDWACMKP                                                 03286000
SDWAIOP  EQU   SDWACMKP                                                 03287000
SDWANXTA EQU   SDWACTL1+5                                               03288000
SDWASGA  EQU   SDWAPMKA                                                 03289000
SDWAEUA  EQU   SDWAPMKA                                                 03290000
SDWADOA  EQU   SDWAPMKA                                                 03291000
SDWAFPA  EQU   SDWAPMKA                                                 03292000
SDWACCA  EQU   SDWAPMKA                                                 03293000
SDWAILA  EQU   SDWAPMKA                                                 03294000
SDWAINTA EQU   SDWACTL1+2                                               03295000
SDWASPVA EQU   SDWAMWPA                                                 03296000
SDWAWATA EQU   SDWAMWPA                                                 03297000
SDWAMCKA EQU   SDWAMWPA                                                 03298000
@NM00003 EQU   SDWAMWPA                                                 03299000
SDWAKEYA EQU   SDWAMWPA                                                 03300000
SDWAEXTA EQU   SDWACMKA                                                 03301000
SDWAIOA  EQU   SDWACMKA                                                 03302000
SDWACMPC EQU   SDWAABCC+1                                               03303000
@NM00002 EQU   SDWACMPF                                                 03304000
SDWASTCC EQU   SDWACMPF                                                 03305000
@NM00001 EQU   SDWACMPF                                                 03306000
SDWASTEP EQU   SDWACMPF                                                 03307000
SDWAREQ  EQU   SDWACMPF                                                 03308000
@NM00072 EQU   PSA+3668                                                 03309000
PSASTAK  EQU   PSA+3072                                                 03310000
@NM00071 EQU   PSA+1048                                                 03311000
PSAUSEND EQU   PSA+1048                                                 03312000
PSARV062 EQU   PSA+1044                                                 03313000
PSACDAL  EQU   PSA+1040                                                 03314000
PSAWTCOD EQU   PSA+1036                                                 03315000
PSAATCVT EQU   PSA+1032                                                 03316000
PSAPCPSW EQU   PSA+1024                                                 03317000
PSAPIR2  EQU   PSA+1020                                                 03318000
PSARV059 EQU   PSA+1018                                                 03319000
PSASVC13 EQU   PSA+1016                                                 03320000
PSASFACC EQU   PSA+1008                                                 03321000
PSASTOP  EQU   PSA+992                                                  03322000
PSASTART EQU   PSA+976                                                  03323000
PSARSPSW EQU   PSA+968                                                  03324000
PSASRPSW EQU   PSA+960                                                  03325000
PSARV045 EQU   PSA+892                                                  03326000
PSARV044 EQU   PSA+888                                                  03327000
PSARV043 EQU   PSA+884                                                  03328000
PSARV042 EQU   PSA+880                                                  03329000
PSARV041 EQU   PSA+876                                                  03330000
PSARV040 EQU   PSA+872                                                  03331000
PSARV025 EQU   PSA+868                                                  03332000
PSADSSED EQU   PSA+868                                                  03333000
PSADSSPR EQU   PSA+864                                                  03334000
PSADSSFW EQU   PSA+860                                                  03335000
PSADSS14 EQU   PSA+856                                                  03336000
PSADSSPP EQU   PSA+848                                                  03337000
PSADSSRP EQU   PSA+840                                                  03338000
PSADSS05 EQU   PSADSSF4                                                 03339000
PSADSS10 EQU   PSADSSF4                                                 03340000
PSADSSVE EQU   PSADSSF4                                                 03341000
PSADSSDE EQU   PSADSSF4                                                 03342000
PSADSSC0 EQU   PSADSSF4                                                 03343000
PSADSSIE EQU   PSADSSF4                                                 03344000
PSADSS12 EQU   PSADSSF4                                                 03345000
PSADSSRC EQU   PSADSSF4                                                 03346000
PSARV057 EQU   PSADSSF3                                                 03347000
PSARV056 EQU   PSADSSF3                                                 03348000
PSARV055 EQU   PSADSSF3                                                 03349000
PSADSSMC EQU   PSADSSF3                                                 03350000
PSADSSRW EQU   PSADSSF3                                                 03351000
PSADSSNM EQU   PSADSSF3                                                 03352000
PSADSSES EQU   PSADSSF3                                                 03353000
PSADSSGP EQU   PSADSSF3                                                 03354000
PSADSSF2 EQU   PSADSSFL+1                                               03355000
PSADSSPI EQU   PSADSSF1                                                 03356000
PSADSSOI EQU   PSADSSF1                                                 03357000
PSADSSSP EQU   PSADSSF1                                                 03358000
PSADSSTP EQU   PSADSSF1                                                 03359000
PSADSSDW EQU   PSADSSF1                                                 03360000
PSADSSDD EQU   PSADSSF1                                                 03361000
PSADSSDM EQU   PSADSSF1                                                 03362000
PSADSSMV EQU   PSADSSF1                                                 03363000
PSADSSTS EQU   PSA+816                                                  03364000
PSADSSWK EQU   PSA+812                                                  03365000
PSADSSR3 EQU   PSA+808                                                  03366000
PSADSSR2 EQU   PSA+804                                                  03367000
PSADSSRS EQU   PSA+800                                                  03368000
PSASTOR  EQU   PSA+796                                                  03369000
PSACPUSA EQU   PSA+794                                                  03370000
PSAVSTAP EQU   PSA+792                                                  03371000
PSAWKVAP EQU   PSA+788                                                  03372000
PSAWKRAP EQU   PSA+784                                                  03373000
PSAMCHIC EQU   PSA+783                                                  03374000
PSARV061 EQU   PSA+782                                                  03375000
PSASYMSK EQU   PSA+781                                                  03376000
PSAMCHFL EQU   PSA+780                                                  03377000
PSACR0   EQU   PSA+776                                                  03378000
PSAPSWSV EQU   PSA+768                                                  03379000
PSACLHS  EQU   PSAHLHI                                                  03380000
PSALKR15 EQU   PSALKSA+60                                               03381000
PSALKR14 EQU   PSALKSA+56                                               03382000
PSALKR13 EQU   PSALKSA+52                                               03383000
PSALKR12 EQU   PSALKSA+48                                               03384000
PSALKR11 EQU   PSALKSA+44                                               03385000
PSALKR10 EQU   PSALKSA+40                                               03386000
PSALKR9  EQU   PSALKSA+36                                               03387000
PSALKR8  EQU   PSALKSA+32                                               03388000
PSALKR7  EQU   PSALKSA+28                                               03389000
PSALKR6  EQU   PSALKSA+24                                               03390000
PSALKR5  EQU   PSALKSA+20                                               03391000
PSALKR4  EQU   PSALKSA+16                                               03392000
PSALKR3  EQU   PSALKSA+12                                               03393000
PSALKR2  EQU   PSALKSA+8                                                03394000
PSALKR1  EQU   PSALKSA+4                                                03395000
PSALKR0  EQU   PSALKSA                                                  03396000
PSARV023 EQU   PSACLHT+52                                               03397000
PSALOCAL EQU   PSACLHT+48                                               03398000
PSACMSL  EQU   PSACLHT+44                                               03399000
PSAOPTL  EQU   PSACLHT+40                                               03400000
PSATPACL EQU   PSACLHT+36                                               03401000
PSATPDNL EQU   PSACLHT+32                                               03402000
PSATPNCL EQU   PSACLHT+28                                               03403000
PSAIOSLL EQU   PSACLHT+24                                               03404000
PSAIOSUL EQU   PSACLHT+20                                               03405000
PSAIOSCL EQU   PSACLHT+16                                               03406000
PSAIOSSL EQU   PSACLHT+12                                               03407000
PSASALCL EQU   PSACLHT+8                                                03408000
PSAASML  EQU   PSACLHT+4                                                03409000
PSADISPL EQU   PSACLHT                                                  03410000
PSASRSA  EQU   PSA+636                                                  03411000
PSARV050 EQU   PSA+634                                                  03412000
PSADSSGO EQU   PSA+633                                                  03413000
PSARECUR EQU   PSA+632                                                  03414000
PSAHLHIS EQU   PSA+628                                                  03415000
PSAIPCSA EQU   PSA+624                                                  03416000
@NM00070 EQU   PSA+621                                                  03417000
PSAIPCDM EQU   PSA+620                                                  03418000
PSAIPCD  EQU   PSA+616                                                  03419000
@NM00069 EQU   PSA+613                                                  03420000
PSAIPCRM EQU   PSA+612                                                  03421000
PSAIPCR  EQU   PSA+608                                                  03422000
PSAMCHEX EQU   PSA+600                                                  03423000
PSAMPSW  EQU   PSA+592                                                  03424000
PSAEXPS2 EQU   PSA+584                                                  03425000
PSAEXPS1 EQU   PSA+576                                                  03426000
PSAPIREG EQU   PSA+572                                                  03427000
PSARSREG EQU   PSA+568                                                  03428000
PSAGPREG EQU   PSA+556                                                  03429000
PSARV022 EQU   PSASUP4                                                  03430000
PSARV021 EQU   PSASUP4                                                  03431000
PSARV020 EQU   PSASUP4                                                  03432000
PSARV019 EQU   PSASUP4                                                  03433000
PSARV018 EQU   PSASUP4                                                  03434000
PSARV017 EQU   PSASUP4                                                  03435000
PSARV016 EQU   PSASUP4                                                  03436000
PSARV015 EQU   PSASUP4                                                  03437000
PSARV014 EQU   PSASUP3                                                  03438000
PSARV013 EQU   PSASUP3                                                  03439000
PSARV012 EQU   PSASUP3                                                  03440000
PSARV011 EQU   PSASUP3                                                  03441000
PSASPR   EQU   PSASUP3                                                  03442000
PSAPSREG EQU   PSASUP3                                                  03443000
PSAPI2   EQU   PSASUP3                                                  03444000
PSAIOSUP EQU   PSASUP3                                                  03445000
PSALCR   EQU   PSASUP2                                                  03446000
PSARTM   EQU   PSASUP2                                                  03447000
PSAACR   EQU   PSASUP2                                                  03448000
PSAIPCE2 EQU   PSASUP2                                                  03449000
PSAIPCES EQU   PSASUP2                                                  03450000
PSAIPCEC EQU   PSASUP2                                                  03451000
PSAGTF   EQU   PSASUP2                                                  03452000
PSAIPCRI EQU   PSASUP2                                                  03453000
PSARV063 EQU   PSASUP1                                                  03454000
PSATCTL  EQU   PSASUP1                                                  03455000
PSADISP  EQU   PSASUP1                                                  03456000
PSALOCK  EQU   PSASUP1                                                  03457000
PSAPI    EQU   PSASUP1                                                  03458000
PSAEXT   EQU   PSASUP1                                                  03459000
PSASVC   EQU   PSASUP1                                                  03460000
PSAIO    EQU   PSASUP1                                                  03461000
PSAAOLD  EQU   PSA+548                                                  03462000
PSAANEW  EQU   PSA+544                                                  03463000
PSATOLD  EQU   PSA+540                                                  03464000
PSATNEW  EQU   PSA+536                                                  03465000
PSALCCAR EQU   PSA+532                                                  03466000
PSALCCAV EQU   PSA+528                                                  03467000
PSAPCCAR EQU   PSA+524                                                  03468000
PSAPCCAV EQU   PSA+520                                                  03469000
PSACPULA EQU   PSA+518                                                  03470000
PSACPUPA EQU   PSA+516                                                  03471000
PSAPSA   EQU   PSA+512                                                  03472000
FLCHDEND EQU   PSA+512                                                  03473000
FLCCRSAV EQU   FLCMCLA+280                                              03474000
FLCGRSAV EQU   FLCMCLA+216                                              03475000
FLCFPSAV EQU   FLCMCLA+184                                              03476000
FLCFLA   EQU   FLCMCLA+88                                               03477000
FLCRGNCD EQU   FLCMCLA+84                                               03478000
FLCFSAA  EQU   FLCFSA+1                                                 03479000
@NM00068 EQU   FLCFSA                                                   03480000
@NM00067 EQU   FLCMCLA+72                                               03481000
FLCMCIC  EQU   FLCMCLA+64                                               03482000
@NM00066 EQU   FLCMCLA+20                                               03483000
FLCIOAA  EQU   FLCIOA+1                                                 03484000
@NM00065 EQU   FLCIOA                                                   03485000
@NM00064 EQU   FLCMCLA+15                                               03486000
@NM00063 EQU   FLCMCLA+14                                               03487000
@NM00062 EQU   FLCMCLA+12                                               03488000
FLCLCL   EQU   FLCMCLA+8                                                03489000
FLCIOELA EQU   FLCIOEL+1                                                03490000
@NM00061 EQU   FLCIOEL                                                  03491000
FLCCHNID EQU   FLCMCLA                                                  03492000
@NM00060 EQU   PSA+160                                                  03493000
FLCMTRCD EQU   PSA+157                                                  03494000
@NM00059 EQU   PSA+156                                                  03495000
FLCPERA  EQU   FLCPER+1                                                 03496000
@NM00058 EQU   FLCPER                                                   03497000
@NM00057 EQU   PSA+151                                                  03498000
FLCPERCD EQU   PSA+150                                                  03499000
FLCMCNUM EQU   PSA+149                                                  03500000
@NM00056 EQU   PSA+148                                                  03501000
FLCTEAA  EQU   FLCTEA+1                                                 03502000
@NM00055 EQU   FLCTEA                                                   03503000
PSAPIPC  EQU   PSAPICOD                                                 03504000
PSAPIMC  EQU   PSAPICOD                                                 03505000
PSAPIPER EQU   PSAPICOD                                                 03506000
PSARV049 EQU   FLCPICOD                                                 03507000
FLCPILCB EQU   FLCPIILC                                                 03508000
@NM00054 EQU   FLCPIILC                                                 03509000
@NM00053 EQU   PSAEPPSW                                                 03510000
FLCSVCN  EQU   PSAESPSW+2                                               03511000
FLCSILCB EQU   FLCSVILC                                                 03512000
@NM00052 EQU   FLCSVILC                                                 03513000
@NM00051 EQU   PSAESPSW                                                 03514000
FLCEICOD EQU   PSAEEPSW+2                                               03515000
PSASPAD  EQU   PSAEEPSW                                                 03516000
@NM00050 EQU   PSA+128                                                  03517000
FLCINPSW EQU   PSA+120                                                  03518000
FLCMNPSW EQU   PSA+112                                                  03519000
FLCPNPSW EQU   PSA+104                                                  03520000
FLCSNPSW EQU   PSA+96                                                   03521000
FLCENPSW EQU   PSA+88                                                   03522000
FLCTRACE EQU   PSA+84                                                   03523000
FLCTIMER EQU   PSA+80                                                   03524000
FLCCVT2  EQU   PSA+76                                                   03525000
FLCCAW   EQU   PSA+72                                                   03526000
FLCCSW   EQU   PSA+64                                                   03527000
FLCIOPSW EQU   PSA+56                                                   03528000
FLCMOPSW EQU   PSA+48                                                   03529000
FLCPOPSW EQU   PSA+40                                                   03530000
FLCSOPSW EQU   PSA+32                                                   03531000
FLCEOPSW EQU   PSA+24                                                   03532000
@NM00049 EQU   FLCICCW2+4                                               03533000
FLCCVT   EQU   FLCICCW2                                                 03534000
FLCICCW1 EQU   FLCROPSW                                                 03535000
FLCIPPSW EQU   FLCRNPSW                                                 03536000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03537000
@ENDDATA EQU   *                                                        03538000
         END   ISTAPC66,(C'PLS0918',0603,75310)                         03539000
