         TITLE 'ISTAPC36-TPLOCK EXCLUSIVE ROUTINE                      *00001000
                        '                                               00002000
ISTAPC36 CSECT                                                          00003000
         USING ISTAPC36,GPR12                                           00004000
*      GPR12=GPR15;  /* LOAD BASE REGISTER                @Z40GKD9*/    00005000
         LR    GPR12,GPR15                                         0158 00006000
*          IF LEVELREG<=CRALKACT    /*RQSTD LEVEL <= CURR LEVEL       * 00007000
*          THEN                    /*HERE IF RQSTD LEVL =< CURR LEVEL*/ 00008000
         CL    LEVELREG,CRALKACT(,CRAREG)                          0159 00009000
         BH    @RF00159                                            0159 00010000
*ELS03:        DO;                                                 0160 00011000
ELS03    DS    0H                                                  0161 00012000
*              IF LOKPTRWD=GPR2    /*LOCK ALREADY OWNED BY PROCESS   */ 00013000
*              THEN                /* YES */                       0161 00014000
         C     GPR2,LOKPTRWD(,CRALXREG)                            0161 00015000
         BNE   @RF00161                                            0161 00016000
*TR06:           DO;                                               0162 00017000
TR06     DS    0H                                                  0163 00018000
*                RPHSAV16=12;      /*SET LOCK ALREADY OWN RC @XM03693*/ 00019000
         MVC   RPHSAV16(4,RPHREG),@CF00032                         0163 00020000
*                RETURN;           /*EXIT FROM PROCEDURE             */ 00021000
@EL00001 DS    0H                                                  0164 00022000
@EF00001 DS    0H                                                  0164 00023000
@ER00001 BR    @14                                                 0164 00024000
*                END TR06;                                         0165 00025000
*              ELSE                                                0166 00026000
*ELS06:          DO;                                               0166 00027000
@RF00161 DS    0H                                                  0166 00028000
ELS06    DS    0H                                                  0167 00029000
*                RPHSAV16=4;       /*SET HIER VIOL RET CODE  @XM03693*/ 00030000
         MVC   RPHSAV16(4,RPHREG),@CF00076                         0167 00031000
*                RETURN;           /*EXIT FROM PROCEDURE             */ 00032000
         B     @EL00001                                            0168 00033000
*                END ELS06;                                        0169 00034000
*              END ELS03;                                          0170 00035000
*          ELSE      /* REQUESTED LEVELE > CURR LEVEL     */       0171 00036000
*              LOKPTRWD=LOKREG; /* SET LOCK WORD POINTER   */      0171 00037000
@RF00159 ST    LOKREG,LOKPTRWD(,CRALXREG)                          0171 00038000
*RETRY: ;                                                          0172 00039000
RETRY    DS    0H                                                  0173 00040000
*          GEN(SLR   GPR15,GPR15);/*GPR15=0 GENERATED FOR PERFORMANCE   00041000
*                                   CONSIDERATIONS       @Z40GKD9 */    00042000
         SLR   GPR15,GPR15                                              00043000
* /* FOLLOWING STATEMENT TO SET RETURN CODE TO ZERO (RPHSAV16 = 0) IS   00044000
*    GENERATED FOR PERFORMANCE CONSIDERATIONS. NOTE: GPR15 HAS BEEN     00045000
*    PREVIOUSLY SET TO ZERO                            @Z40GKD9*/  0174 00046000
*      GEN(ST    GPR15,RPHSAV16(,RPHREG)); /*SET RETURN CODE @XM03745*/ 00047000
         ST    GPR15,RPHSAV16(,RPHREG)                                  00048000
*          NEWREG=LOKCT1 | LOKXCL1;                                0175 00049000
         L     NEWREG,@CF00154                                     0175 00050000
         O     NEWREG,@CF00148                                     0175 00051000
*          CS (GPR15,NEWREG,LOCKWORD);                             0176 00052000
         CS    GPR15,@05,LOCKWORD(LOKREG)                          0176 00053000
*          BC (FAIL,SWAPFAL1);                                     0177 00054000
         BC    7,SWAPFAL1                                          0177 00055000
*          CRALKACT=CRALKACT | LEVELREG; /*INDIC NEW LEVEL LOCKED  */   00056000
         L     @06,CRALKACT(,CRAREG)                               0178 00057000
         OR    @06,LEVELREG                                        0178 00058000
         ST    @06,CRALKACT(,CRAREG)                               0178 00059000
*        GEN(BR    14); /* EXIT FROM PROCEDURE - GENERATED FOR     0179 00060000
*                          PERFORMANCE CONSIDERATIONS    @Z40GKD9 */    00061000
         BR    14                                                       00062000
*SWAPFAL1: IF (GPR15 & LOKPRY1) ^= 0     /*WAS LOK UNLOKD WITH PRTY*/   00063000
*          THEN                          /* YES, REJECT REQUEST    */   00064000
SWAPFAL1 LR    @06,GPR15                                           0180 00065000
         N     @06,@CF00150                                        0180 00066000
         LTR   @06,@06                                             0180 00067000
         BZ    @RF00180                                            0180 00068000
*TR07:       DO;                                                   0181 00069000
TR07     DS    0H                                                  0182 00070000
*            RPHSAV16=8;                                   /*@XM03693*/ 00071000
         MVC   RPHSAV16(4,RPHREG),@CF00041                         0182 00072000
*            END TR07;                                             0183 00073000
*          ELSE                                                    0184 00074000
*ELS07:      DO;                                                   0184 00075000
         B     @RC00180                                            0184 00076000
@RF00180 DS    0H                                                  0184 00077000
ELS07    DS    0H                                                  0185 00078000
*            RPHRPHA=LOKXCL1 | (GPR15 & LOKCHN1);                  0185 00079000
         LA    @06,1                                               0185 00080000
         LR    @11,GPR15                                           0185 00081000
         N     @11,@CF00152                                        0185 00082000
         OR    @11,@06                                             0185 00083000
         ST    @11,RPHRPHA(,RPHREG)                                0185 00084000
*            RPHGATE='1'B;      /*TURN ON RPH QD BIT         @Z30APGG*/ 00085000
         OI    RPHGATE(RPHREG),B'10000000'                         0186 00086000
*            NEWREG=RPHREG | LOKXCL1 | (GPR15 & LOKCT255);         0187 00087000
         OR    @06,RPHREG                                          0187 00088000
         LR    NEWREG,GPR15                                        0187 00089000
         N     NEWREG,@CF00156                                     0187 00090000
         OR    @06,NEWREG                                          0187 00091000
         LR    NEWREG,@06                                          0187 00092000
*            CS (GPR15,NEWREG,LOCKWORD);                           0188 00093000
         CS    GPR15,@05,LOCKWORD(LOKREG)                          0188 00094000
*            BC (FAIL,SWAPFAL2);                                   0189 00095000
         BC    7,SWAPFAL2                                          0189 00096000
*        RFY RETSV RSTD;                                           0190 00097000
*         RETSV=GPR14;                                     /*@XM00180*/ 00098000
*                                                                  0191 00099000
         LR    RETSV,GPR14                                         0191 00100000
*/*  TPWAIT  NSTR RESUME(GPR14) */                                 0192 00101000
*               DO; /* BEGIN TPWAIT GENERATION*/                   0192 00102000
*               DCL GPR01F FIXED(31) REG(01);                      0193 00103000
*               DCL GPR01P PTR(31)   REG(01);                      0194 00104000
*               DCL GPR14F FIXED(31) REG(14);                      0195 00105000
*               DCL GPR14P PTR(31)   REG(14);                      0196 00106000
*               DCL GPR15F FIXED(31) REG(15);                      0197 00107000
*               DCL GPR15P PTR(31)   REG(15);                      0198 00108000
*               RFY (GPR01P,GPR14P,GPR15P) RSTD;                   0199 00109000
*               GPR15P=GPR14;                                      0200 00110000
         LR    GPR15P,GPR14                                        0200 00111000
*               GPR14P=0;                                          0201 00112000
         SLR   GPR14P,GPR14P                                       0201 00113000
*               GPR15P=GPR15P & '00FFFFFF'X;                       0202 00114000
         N     GPR15P,@CF01540                                     0202 00115000
*               GPR15P=GPR15P | RPHWT1;                            0203 00116000
         O     GPR15P,@CF00130                                     0203 00117000
*               CS (GPR14P,GPR15P,GPR01P->RPHRESMA);               0204 00118000
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         0204 00119000
*               BC (7,LHAB0005);                                   0205 00120000
*                                                                  0205 00121000
         BC    7,LHAB0005                                          0205 00122000
*/* TPEXIT  NONE */                                                0206 00123000
*               DO;                                                0206 00124000
*                                                                  0206 00125000
*               DCL GPR00F FIXED(31) REG(00);                      0207 00126000
*               DCL GPR00P PTR(31)   REG(00);                      0208 00127000
*                 RESPECIFY GPR15P RSTD;                           0209 00128000
*                                                                  0209 00129000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         0210 00130000
*/* END OF ATBUILD */                                              0210 00131000
*                                                                  0210 00132000
*               DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */      0210 00133000
*                 GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/      0211 00134000
         L     GPR15P,ATCLCPTR                                     0211 00135000
*               END; /*LISATCVT*/                                  0212 00136000
*                 RESPECIFY GPR00F RSTD;                           0213 00137000
*                 GPR00F=0;     /*SET PARAMETER REGISTER TO 0*/    0214 00138000
         SLR   GPR00F,GPR00F                                       0214 00139000
*                 GPR15P=GPR15P->ATCAP31;                          0215 00140000
         L     GPR15P,ATCAP31(,GPR15P)                             0215 00141000
*                 DCL FMZL0008 BASED(GPR15P) LABEL VALUERANGE(*);  0216 00142000
*                 CALL FMZL0008;                                   0217 00143000
         BALR  @14,@15                                             0217 00144000
*                 RESPECIFY (GPR00F,GPR15P) UNRSTD;                0218 00145000
*               END; /***** END OF TPEXIT  *****/                  0219 00146000
*LHAB0005:;     GPR01P->RPHRESMA = 0;                              0220 00147000
LHAB0005 DS    0H                                                  0221 00148000
         SLR   @10,@10                                             0221 00149000
         ST    @10,RPHRESMA(,GPR01P)                               0221 00150000
*               RFY (GPR00P) RSTD;                                 0222 00151000
*LHAA0005:;     RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;          0223 00152000
LHAA0005 DS    0H                                                  0224 00153000
*               END; /*****END OF TPWAIT *****/                 /*@XM03 00154000
*92*/                                                              0225 00155000
*         GPR14=RETSV;                                     /*@XM00180*/ 00156000
         LR    GPR14,RETSV                                         0226 00157000
*         RFY RETSV UNRSTD;                                        0227 00158000
*            RETURN;                     /* EXIT FROM PROCEDURE    */   00159000
         B     @EL00001                                            0228 00160000
*SWAPFAL2:   RPHRPHA=0;                                            0229 00161000
SWAPFAL2 SLR   @06,@06                                             0229 00162000
         ST    @06,RPHRPHA(,RPHREG)                                0229 00163000
*            GOTO RETRY;                                           0230 00164000
         B     RETRY                                               0230 00165000
*            END ELS07;                                            0231 00166000
*    GEN(BR    GPR14); /* GENERATED FOR PERFORMANCE CONSIDERATIONS */   00167000
*                                                                  0232 00168000
@RC00180 DS    0H                                                  0232 00169000
         BR    GPR14                                                    00170000
* GEN(DC    C'END ISTAPC36  75.290');     /* GENERATE ID FOR ISTAPC36 * 00171000
*                                                                  0233 00172000
         DC    C'END ISTAPC36  75.290'                                  00173000
*/* TPEPILOG   */                                                  0234 00174000
*           GEN (PRINT OFF);                                       0234 00175000
*                                                                  0234 00176000
         PRINT OFF                                                      00177000
*           GEN (PRINT ON);                                        0235 00178000
         PRINT ON                                                       00179000
*/* END OF TPEPILOG */                                             0236 00180000
*          END ISTAPC36;                                           0236 00181000
         B     @EL00001                                            0236 00182000
@DATA    DS    0H                                                       00183000
@DATD    DSECT                                                          00184000
         DS    0F                                                       00185000
ISTAPC36 CSECT                                                          00186000
         DS    0F                                                       00187000
@CF00076 DC    F'4'                                                     00188000
@CF00041 DC    F'8'                                                     00189000
@CF00032 DC    F'12'                                                    00190000
@CF00130 DC    XL4'08000000'                                            00191000
@CF00148 DC    XL4'00000001'                                            00192000
@CF00150 DC    XL4'00000002'                                            00193000
@CF00152 DC    XL4'00FFFFFC'                                            00194000
@CF00154 DC    XL4'01000000'                                            00195000
@CF00156 DC    XL4'FF000000'                                            00196000
@CF01540 DC    XL4'00FFFFFF'                                            00197000
@DATD    DSECT                                                          00198000
         DS    0D                                                       00199000
LCPBPTR  DS    A                                                        00200000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00201000
@ENDDATD EQU   *                                                        00202000
ISTAPC36 CSECT                                                          00203000
         DS    0F                                                       00204000
@SIZDATD DC    AL1(0)                                                   00205000
         DC    AL3(@ENDDATD-@DATD)                                      00206000
         DS    0D                                                       00207000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00208000
@01      EQU   01                                                       00209000
@02      EQU   02                                                       00210000
@03      EQU   03                                                       00211000
@04      EQU   04                                                       00212000
@05      EQU   05                                                       00213000
@06      EQU   06                                                       00214000
@07      EQU   07                                                       00215000
@08      EQU   08                                                       00216000
@09      EQU   09                                                       00217000
@10      EQU   10                                                       00218000
@11      EQU   11                                                       00219000
@12      EQU   12                                                       00220000
@13      EQU   13                                                       00221000
@14      EQU   14                                                       00222000
@15      EQU   15                                                       00223000
RPHPTR   EQU   @01                                                      00224000
RPHREG   EQU   @01                                                      00225000
LOKREG   EQU   @02                                                      00226000
CRALXREG EQU   @03                                                      00227000
CRAREG   EQU   @04                                                      00228000
DOWREG   EQU   @07                                                      00229000
RETSV    EQU   @11                                                      00230000
GPR12    EQU   @12                                                      00231000
GPR14    EQU   @14                                                      00232000
LEVELREG EQU   @00                                                      00233000
TEMPREG  EQU   @05                                                      00234000
NEWREG   EQU   @05                                                      00235000
GPR2     EQU   @02                                                      00236000
GPR3     EQU   @03                                                      00237000
GPR15    EQU   @15                                                      00238000
GPR01P   EQU   @01                                                      00239000
GPR14P   EQU   @14                                                      00240000
GPR15P   EQU   @15                                                      00241000
GPR00F   EQU   @00                                                      00242000
GPR00P   EQU   @00                                                      00243000
GPR01F   EQU   @01                                                      00244000
GPR14F   EQU   @14                                                      00245000
GPR15F   EQU   @15                                                      00246000
ATCLCPTR EQU   1032                                                     00247000
ISTRPH   EQU   0                                                        00248000
RPHCNTL  EQU   ISTRPH                                                   00249000
RPHFLAGS EQU   RPHCNTL+2                                                00250000
RPHAPTYP EQU   RPHFLAGS                                                 00251000
RPHFSTLC EQU   RPHFLAGS                                                 00252000
RPHFLGB  EQU   RPHCNTL+3                                                00253000
RPHRPHA  EQU   ISTRPH+4                                                 00254000
RPHGATE  EQU   RPHRPHA                                                  00255000
RPHTSKID EQU   ISTRPH+8                                                 00256000
RPHRESMA EQU   ISTRPH+16                                                00257000
RPHWPFLG EQU   RPHRESMA                                                 00258000
RPHWEA   EQU   ISTRPH+24                                                00259000
RPHCSPA  EQU   RPHWEA                                                   00260000
RPHSRPRM EQU   ISTRPH+28                                                00261000
RPHPABQA EQU   ISTRPH+36                                                00262000
RPHWORK  EQU   ISTRPH+40                                                00263000
RPHSAVE1 EQU   RPHWORK                                                  00264000
RPHSBITS EQU   RPHSAVE1+1                                               00265000
RPHSAV16 EQU   RPHWORK+60                                               00266000
ISTLOK   EQU   0                                                        00267000
LOKCHN   EQU   ISTLOK+1                                                 00268000
LOKCHNG  EQU   LOKCHN                                                   00269000
@NM00005 EQU   LOKCHNG+2                                                00270000
ISTLCCW  EQU   0                                                        00271000
LCCWOP   EQU   ISTLCCW                                                  00272000
LCCWRWOP EQU   LCCWOP                                                   00273000
LCCWCTL  EQU   LCCWRWOP                                                 00274000
LCCWFLAG EQU   ISTLCCW+1                                                00275000
LCCWLSI  EQU   LCCWFLAG                                                 00276000
ISTLCPB  EQU   0                                                        00277000
LCPREQTG EQU   ISTLCPB+2                                                00278000
LCPFLAGS EQU   LCPREQTG                                                 00279000
LCPZF001 EQU   LCPFLAGS                                                 00280000
LCPZRT02 EQU   LCPZF001                                                 00281000
LCPZF002 EQU   LCPFLAGS                                                 00282000
LCPZRT03 EQU   LCPZF002                                                 00283000
LCPZF003 EQU   LCPFLAGS                                                 00284000
LCPZRT04 EQU   LCPZF003                                                 00285000
LCPZF004 EQU   LCPFLAGS                                                 00286000
LCPZRT05 EQU   LCPZF004                                                 00287000
LCPZRT06 EQU   LCPFLAGS                                                 00288000
LCPZRT07 EQU   LCPFLAGS                                                 00289000
LCPMNRCD EQU   LCPREQTG+1                                               00290000
LCPZRT08 EQU   LCPMNRCD                                                 00291000
LCPZRT09 EQU   LCPMNRCD                                                 00292000
LCPCHAIN EQU   ISTLCPB+4                                                00293000
LCPCHAI1 EQU   LCPCHAIN                                                 00294000
LCPRUCNT EQU   ISTLCPB+8                                                00295000
LCPFLAG2 EQU   ISTLCPB+9                                                00296000
LCPTLBPI EQU   LCPFLAG2                                                 00297000
LCPFID0  EQU   LCPFLAG2                                                 00298000
LCPSEQ   EQU   ISTLCPB+10                                               00299000
LCPCID   EQU   ISTLCPB+16                                               00300000
LCPFDBA  EQU   ISTLCPB+24                                               00301000
LCPFLG1  EQU   ISTLCPB+37                                               00302000
LCPFLCCW EQU   ISTLCPB+40                                               00303000
LCPLCCW  EQU   ISTLCPB+48                                               00304000
LCPPABA  EQU   LCPLCCW+4                                                00305000
LCPRPHA  EQU   LCPPABA                                                  00306000
ISTZSAVE EQU   0                                                        00307000
ZSAZSVBC EQU   ISTZSAVE                                                 00308000
ZSAZSVMS EQU   ZSAZSVBC                                                 00309000
ISTPFCRR EQU   0                                                        00310000
PFCCRR   EQU   ISTPFCRR                                                 00311000
PFCCRRID EQU   PFCCRR                                                   00312000
PFCCRRLN EQU   PFCCRR+2                                                 00313000
PFCHDR   EQU   ISTPFCRR+4                                               00314000
PFCCRRO  EQU   PFCHDR                                                   00315000
PFCFRRO  EQU   PFCHDR+4                                                 00316000
ISTCFCRR EQU   0                                                        00317000
CFCAUDIT EQU   ISTCFCRR                                                 00318000
CFCNTRD  EQU   CFCAUDIT                                                 00319000
CFCCRT   EQU   CFCAUDIT+1                                               00320000
ISTZCRR  EQU   0                                                        00321000
ZCRCRR   EQU   ISTZCRR                                                  00322000
ZCRFLGS1 EQU   ISTZCRR+12                                               00323000
ZCRFLGS2 EQU   ISTZCRR+13                                               00324000
ZCRSWFLD EQU   ISTZCRR+14                                               00325000
ZCRENDSH EQU   ZCRSWFLD                                                 00326000
ZCRNDLCP EQU   ZCRSWFLD                                                 00327000
ZCRRESET EQU   ZCRSWFLD                                                 00328000
ZCRFLGS3 EQU   ISTZCRR+15                                               00329000
ZCRGENSW EQU   ISTZCRR+16                                               00330000
ZCRPFLGS EQU   ISTZCRR+17                                               00331000
ZCRIBPR  EQU   ISTZCRR+18                                               00332000
ZCRSCPSW EQU   ISTZCRR+19                                               00333000
ZCRPARMS EQU   ISTZCRR+24                                               00334000
ZCRFBPTR EQU   ZCRPARMS                                                 00335000
ZCRDFRDA EQU   ZCRPARMS+10                                              00336000
ZCRPCOD1 EQU   ZCRPARMS+12                                              00337000
ZCRPLSBF EQU   ZCRPCOD1                                                 00338000
ZCRPCOD2 EQU   ZCRPARMS+13                                              00339000
ZCRSVRTN EQU   ISTZCRR+56                                               00340000
ZCRWKARA EQU   ISTZCRR+156                                              00341000
ZCRCIDSV EQU   ISTZCRR+192                                              00342000
ZCRAUDIT EQU   ISTZCRR+440                                              00343000
ZCRENTER EQU   ZCRAUDIT+5                                               00344000
ZCRLCPB  EQU   ISTZCRR+480                                              00345000
ZCRRHRU  EQU   ZCRLCPB                                                  00346000
ISTASCRR EQU   0                                                        00347000
ASCFLAGS EQU   ISTASCRR+16                                              00348000
ASCFLG1  EQU   ASCFLAGS                                                 00349000
ASCFLG2  EQU   ASCFLAGS+2                                               00350000
ASCFLG3  EQU   ASCFLAGS+4                                               00351000
ASCUSRGS EQU   ISTASCRR+28                                              00352000
ISTAPCRR EQU   0                                                        00353000
APCATFLG EQU   ISTAPCRR+16                                              00354000
APCRFLG  EQU   ISTAPCRR+18                                              00355000
APCSAVE  EQU   ISTAPCRR+44                                              00356000
APCCOMF  EQU   ISTAPCRR+116                                             00357000
APCCOMF1 EQU   APCCOMF                                                  00358000
APC31FLG EQU   ISTAPCRR+132                                             00359000
APC52FLG EQU   ISTAPCRR+133                                             00360000
APC53FLG EQU   ISTAPCRR+134                                             00361000
APC54FLG EQU   ISTAPCRR+135                                             00362000
APC57FLG EQU   ISTAPCRR+136                                             00363000
ISTCRA   EQU   0                                                        00364000
CRABASIC EQU   ISTCRA                                                   00365000
CRAHDR   EQU   CRABASIC                                                 00366000
CRALKACT EQU   CRABASIC+8                                               00367000
CRASVC   EQU   ISTCRA+848                                               00368000
CRABUFA  EQU   CRASVC+68                                                00369000
ISTPAB   EQU   0                                                        00370000
PABWQCHN EQU   ISTPAB                                                   00371000
PABWEQA  EQU   PABWQCHN                                                 00372000
PABCHAIN EQU   PABWQCHN+4                                               00373000
PABRPHFG EQU   ISTPAB+12                                                00374000
PABFLAGS EQU   PABRPHFG                                                 00375000
PABERLCK EQU   PABFLAGS                                                 00376000
PABERRLK EQU   PABERLCK                                                 00377000
ISTDYPAB EQU   0                                                        00378000
ISTATCVT EQU   0                                                        00379000
ATCCOM   EQU   ISTATCVT                                                 00380000
ATCSTAT  EQU   ATCCOM                                                   00381000
ATCSTAT1 EQU   ATCSTAT                                                  00382000
ATCSTFLG EQU   ATCSTAT+1                                                00383000
ATCPOFLG EQU   ATCSTAT+2                                                00384000
ATCSTAT4 EQU   ATCSTAT+3                                                00385000
ATCIOTRC EQU   ATCCOM+140                                               00386000
ATCTHTRC EQU   ATCIOTRC                                                 00387000
ATCCSMR  EQU   ISTATCVT+296                                             00388000
ATCSHRFG EQU   ISTATCVT+316                                             00389000
ATCHPGM  EQU   ISTATCVT+384                                             00390000
ATCVLCNT EQU   ISTATCVT+772                                             00391000
ATCRNO   EQU   ISTATCVT+788                                             00392000
ATCSOPD  EQU   ISTATCVT+792                                             00393000
ATCSIPD  EQU   ISTATCVT+800                                             00394000
ATCSECST EQU   ISTATCVT+812                                             00395000
ATCSTAT2 EQU   ISTATCVT+818                                             00396000
@NM00026 EQU   ISTATCVT+911                                             00397000
ATCAOSM  EQU   ISTATCVT+912                                             00398000
ATCGSRBQ EQU   ATCAOSM+4                                                00399000
ATCGSRBG EQU   ATCGSRBQ                                                 00400000
ATCAP31  EQU   ATCAOSM+24                                               00401000
ATCICAPP EQU   ATCAOSM+100                                              00402000
ATCLDAPP EQU   ATCAOSM+120                                              00403000
ATCDAPVT EQU   ATCAOSM+140                                              00404000
ATCVTFLG EQU   ATCAOSM+392                                              00405000
ATCZFLAG EQU   ATCAOSM+588                                              00406000
LOKPTRWD EQU   0                                                        00407000
LOCKWORD EQU   0                                                        00408000
FMZL0008 EQU   0                                                        00409000
LCPZTIE  EQU   LCPCID                                                   00410000
LCPZSNAM EQU   LCPZTIE+8                                                00411000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00412000
LCPZTRV4 EQU   LCPZSNAM+4                                               00413000
LCPZTRV1 EQU   LCPZSNAM                                                 00414000
LCPZSNA  EQU   LCPZTIE+4                                                00415000
LCPZFMCA EQU   LCPZTIE                                                  00416000
ATCAOS   EQU   ISTATCVT+1584                                            00417000
ATCPOPAB EQU   ATCAOSM+640                                              00418000
ATCVIOPM EQU   ATCAOSM+636                                              00419000
ATCTPMMI EQU   ATCAOSM+632                                              00420000
ATCTPMPB EQU   ATCAOSM+600                                              00421000
ATCRSV88 EQU   ATCAOSM+596                                              00422000
ATCRPLCT EQU   ATCAOSM+594                                              00423000
ATCCRACT EQU   ATCAOSM+592                                              00424000
ATCSRBCT EQU   ATCAOSM+590                                              00425000
ATCRSV75 EQU   ATCAOSM+589                                              00426000
ATCRSV66 EQU   ATCZFLAG                                                 00427000
ATCZF001 EQU   ATCZFLAG                                                 00428000
ATCTPCP1 EQU   ATCAOSM+584                                              00429000
ATCTPCP0 EQU   ATCAOSM+580                                              00430000
ATCAICTN EQU   ATCAOSM+576                                              00431000
ATCZR01  EQU   ATCAOSM+572                                              00432000
ATCMPLTA EQU   ATCAOSM+568                                              00433000
ATCASCB  EQU   ATCAOSM+564                                              00434000
ATCAP86  EQU   ATCAOSM+560                                              00435000
ATCAP85  EQU   ATCAOSM+556                                              00436000
ATCAP84  EQU   ATCAOSM+552                                              00437000
ATCAP83  EQU   ATCAOSM+548                                              00438000
ATCAP82  EQU   ATCAOSM+544                                              00439000
ATCAP69  EQU   ATCAOSM+540                                              00440000
ATCAP66  EQU   ATCAOSM+536                                              00441000
ATCAP62  EQU   ATCAOSM+532                                              00442000
ATCAPC59 EQU   ATCAOSM+528                                              00443000
ATCAP56  EQU   ATCAOSM+524                                              00444000
ATCAP55  EQU   ATCAOSM+520                                              00445000
ATCRCFY0 EQU   ATCAOSM+516                                              00446000
ATCAP41  EQU   ATCAOSM+512                                              00447000
ATCAPC25 EQU   ATCAOSM+508                                              00448000
ATCAP23  EQU   ATCAOSM+504                                              00449000
ATCTPSPB EQU   ATCAOSM+472                                              00450000
ATCTRMPB EQU   ATCAOSM+440                                              00451000
ATCAPBE  EQU   ATCAOSM+436                                              00452000
ATCPSTA  EQU   ATCAOSM+432                                              00453000
ATCSMABF EQU   ATCAOSM+428                                              00454000
ATCSMAPR EQU   ATCAOSM+424                                              00455000
ATCTPWQA EQU   ATCAOSM+420                                              00456000
ATCSMAID EQU   ATCAOSM+416                                              00457000
ATCSMARA EQU   ATCAOSM+412                                              00458000
ATCCACXA EQU   ATCAOSM+408                                              00459000
ATCZLAAB EQU   ATCAOSM+404                                              00460000
ATCATA10 EQU   ATCAOSM+400                                              00461000
ATCHLTCB EQU   ATCAOSM+396                                              00462000
@NM00028 EQU   ATCVTFLG                                                 00463000
ATCVTACT EQU   ATCVTFLG                                                 00464000
ATCRPT40 EQU   ATCAOSM+388                                              00465000
ATCRPT39 EQU   ATCAOSM+384                                              00466000
ATCRPT38 EQU   ATCAOSM+380                                              00467000
ATCRPT37 EQU   ATCAOSM+376                                              00468000
ATCRPT36 EQU   ATCAOSM+372                                              00469000
ATCRPT35 EQU   ATCAOSM+368                                              00470000
ATCRPT34 EQU   ATCAOSM+364                                              00471000
ATCRPT33 EQU   ATCAOSM+360                                              00472000
ATCRPT32 EQU   ATCAOSM+356                                              00473000
ATCRPT31 EQU   ATCAOSM+352                                              00474000
ATCRPT30 EQU   ATCAOSM+348                                              00475000
ATCRPT29 EQU   ATCAOSM+344                                              00476000
ATCRPT28 EQU   ATCAOSM+340                                              00477000
ATCRPT27 EQU   ATCAOSM+336                                              00478000
ATCRPT26 EQU   ATCAOSM+332                                              00479000
ATCRPT25 EQU   ATCAOSM+328                                              00480000
ATCRPT24 EQU   ATCAOSM+324                                              00481000
ATCRPT23 EQU   ATCAOSM+320                                              00482000
ATCRPT22 EQU   ATCAOSM+316                                              00483000
ATCRPT21 EQU   ATCAOSM+312                                              00484000
ATCRPT20 EQU   ATCAOSM+308                                              00485000
ATCRPT19 EQU   ATCAOSM+304                                              00486000
ATCRPT18 EQU   ATCAOSM+300                                              00487000
ATCRPT17 EQU   ATCAOSM+296                                              00488000
ATCRPT16 EQU   ATCAOSM+292                                              00489000
ATCRPT15 EQU   ATCAOSM+288                                              00490000
ATCRPT14 EQU   ATCAOSM+284                                              00491000
ATCRPT13 EQU   ATCAOSM+280                                              00492000
ATCRPT12 EQU   ATCAOSM+276                                              00493000
ATCDMAPP EQU   ATCAOSM+272                                              00494000
ATCAP38  EQU   ATCAOSM+268                                              00495000
ATCAP37  EQU   ATCAOSM+264                                              00496000
ATCZDFJ0 EQU   ATCAOSM+260                                              00497000
ATCAP51  EQU   ATCAOSM+256                                              00498000
ATCZPAB2 EQU   ATCAOSM+224                                              00499000
ATCZPAB1 EQU   ATCAOSM+192                                              00500000
ATCZLFVT EQU   ATCAOSM+188                                              00501000
ATCZLPVT EQU   ATCAOSM+184                                              00502000
ATCZDVTX EQU   ATCAOSM+180                                              00503000
ATCZDVTA EQU   ATCAOSM+176                                              00504000
ATCZDVT9 EQU   ATCAOSM+172                                              00505000
ATCZDVT8 EQU   ATCAOSM+168                                              00506000
ATCZDVT7 EQU   ATCAOSM+164                                              00507000
ATCRSV56 EQU   ATCDAPVT+22                                              00508000
ATCDAPDG EQU   ATCDAPVT+20                                              00509000
ATCDXCEA EQU   ATCDAPVT+16                                              00510000
ATCDCEA  EQU   ATCDAPVT+12                                              00511000
ATCDPCIA EQU   ATCDAPVT+8                                               00512000
ATCDSIOA EQU   ATCDAPVT+4                                               00513000
ATCDEOEA EQU   ATCDAPVT                                                 00514000
ATCZLAEA EQU   ATCLDAPP+16                                              00515000
ATCZLCEA EQU   ATCLDAPP+12                                              00516000
ATCRSV17 EQU   ATCLDAPP+8                                               00517000
ATCSMFRR EQU   ATCLDAPP+4                                               00518000
ATCCDTID EQU   ATCLDAPP                                                 00519000
ATCZAEA  EQU   ATCICAPP+16                                              00520000
ATCZCEA  EQU   ATCICAPP+12                                              00521000
ATCCDTCB EQU   ATCICAPP+8                                               00522000
ATCZSIOA EQU   ATCICAPP+4                                               00523000
ATCCDRPH EQU   ATCICAPP                                                 00524000
ATCAP65  EQU   ATCAOSM+96                                               00525000
ATCZDVT6 EQU   ATCAOSM+92                                               00526000
ATCZDVT4 EQU   ATCAOSM+88                                               00527000
ATCZDVT3 EQU   ATCAOSM+84                                               00528000
ATCZDVT1 EQU   ATCAOSM+80                                               00529000
ATCICNCB EQU   ATCAOSM+76                                               00530000
ATCZPSVT EQU   ATCAOSM+72                                               00531000
ATCZFSVT EQU   ATCAOSM+68                                               00532000
ATCAP64  EQU   ATCAOSM+64                                               00533000
ATCAP63  EQU   ATCAOSM+60                                               00534000
ATCAP61  EQU   ATCAOSM+56                                               00535000
ATCAP58  EQU   ATCAOSM+52                                               00536000
ATCAP57  EQU   ATCAOSM+48                                               00537000
ATCAP54  EQU   ATCAOSM+44                                               00538000
ATCAP53  EQU   ATCAOSM+40                                               00539000
ATCAP52  EQU   ATCAOSM+36                                               00540000
ATCAP34  EQU   ATCAOSM+32                                               00541000
ATCAP32  EQU   ATCAOSM+28                                               00542000
ATCAP12  EQU   ATCAOSM+20                                               00543000
ATCAP11  EQU   ATCAOSM+16                                               00544000
ATCCMTCB EQU   ATCAOSM+12                                               00545000
ATCPRPH  EQU   ATCAOSM+8                                                00546000
ATCGSRBF EQU   ATCGSRBG                                                 00547000
ATCSRBRT EQU   ATCAOSM                                                  00548000
@NM00027 EQU   @NM00026                                                 00549000
ATCVTMAB EQU   @NM00026                                                 00550000
@NM00025 EQU   ISTATCVT+908                                             00551000
ATCVDLOK EQU   ISTATCVT+904                                             00552000
ATCVFPAB EQU   ISTATCVT+872                                             00553000
ATCVDPAB EQU   ISTATCVT+840                                             00554000
ATCIOECB EQU   ISTATCVT+836                                             00555000
ATCINCW3 EQU   ISTATCVT+832                                             00556000
ATCMODTB EQU   ISTATCVT+828                                             00557000
ATCUSSPT EQU   ISTATCVT+824                                             00558000
ATCSRTAB EQU   ISTATCVT+820                                             00559000
@NM00024 EQU   ISTATCVT+819                                             00560000
@NM00023 EQU   ATCSTAT2                                                 00561000
ATCTRSMS EQU   ATCSTAT2                                                 00562000
ATCTRLOK EQU   ATCSTAT2                                                 00563000
ATCTRPSS EQU   ATCSTAT2                                                 00564000
ATCTRESC EQU   ATCSTAT2                                                 00565000
ATCTRAPI EQU   ATCSTAT2                                                 00566000
ATCNMCTR EQU   ISTATCVT+816                                             00567000
ATCSEC51 EQU   ATCSECST                                                 00568000
ATCSEC40 EQU   ATCSIPD+8                                                00569000
ATCSEC30 EQU   ATCSIPD+4                                                00570000
ATCSEC21 EQU   ATCSIPD                                                  00571000
ATCSEC10 EQU   ATCSOPD+4                                                00572000
ATCSEC01 EQU   ATCSOPD                                                  00573000
ATCPOIA  EQU   ATCRNO+1                                                 00574000
@NM00022 EQU   ATCRNO                                                   00575000
ATCPODVT EQU   ISTATCVT+784                                             00576000
ATCS49XL EQU   ISTATCVT+780                                             00577000
ATCS49XI EQU   ISTATCVT+776                                             00578000
ATCLCLCT EQU   ATCVLCNT+2                                               00579000
ATCRNCNT EQU   ATCVLCNT                                                 00580000
ATCCFEAD EQU   ISTATCVT+768                                             00581000
ATCPTR00 EQU   ISTATCVT+736                                             00582000
ATCRSV10 EQU   ISTATCVT+704                                             00583000
ATCTACB  EQU   ISTATCVT+700                                             00584000
ATCVTINM EQU   ISTATCVT+696                                             00585000
ATCTCLIM EQU   ISTATCVT+692                                             00586000
ATCTCLOM EQU   ISTATCVT+688                                             00587000
ATCVTIPB EQU   ISTATCVT+656                                             00588000
ATCTCIPB EQU   ISTATCVT+624                                             00589000
ATCTIPAB EQU   ISTATCVT+592                                             00590000
ATCOCCCB EQU   ISTATCVT+588                                             00591000
ATCOCCOB EQU   ISTATCVT+584                                             00592000
ATCCDLAD EQU   ISTATCVT+580                                             00593000
ATCCCLAD EQU   ISTATCVT+576                                             00594000
ATCDLRPB EQU   ISTATCVT+544                                             00595000
ATCPGPAB EQU   ISTATCVT+512                                             00596000
ATCVPAB1 EQU   ISTATCVT+480                                             00597000
ATCRSV97 EQU   ISTATCVT+476                                             00598000
ATCRDTLK EQU   ISTATCVT+472                                             00599000
ATCVOCLK EQU   ISTATCVT+468                                             00600000
ATCCDFDN EQU   ISTATCVT+464                                             00601000
ATCCDFIN EQU   ISTATCVT+460                                             00602000
ATCDVTLK EQU   ISTATCVT+456                                             00603000
ATCAP36  EQU   ISTATCVT+452                                             00604000
ATCAP35  EQU   ISTATCVT+448                                             00605000
ATCAP33  EQU   ISTATCVT+444                                             00606000
ATCRSV99 EQU   ISTATCVT+440                                             00607000
ATCONFIG EQU   ISTATCVT+432                                             00608000
ATCNODDS EQU   ISTATCVT+428                                             00609000
ATCNODEL EQU   ISTATCVT+420                                             00610000
ATCRSV69 EQU   ISTATCVT+416                                             00611000
ATCAPCR5 EQU   ISTATCVT+412                                             00612000
ATCLDECB EQU   ISTATCVT+408                                             00613000
ATCLDNCS EQU   ISTATCVT+404                                             00614000
ATCCDPTR EQU   ISTATCVT+400                                             00615000
ATCADEL  EQU   ISTATCVT+396                                             00616000
ATCTODVT EQU   ISTATCVT+392                                             00617000
ATCDEBCH EQU   ISTATCVT+388                                             00618000
ATCHBSIZ EQU   ATCHPGM+2                                                00619000
ATCHBFNO EQU   ATCHPGM                                                  00620000
ATCCRME  EQU   ISTATCVT+380                                             00621000
ATCRVCHS EQU   ISTATCVT+372                                             00622000
ATCECTLP EQU   ISTATCVT+368                                             00623000
ATCZDVTB EQU   ISTATCVT+364                                             00624000
ATCECPRT EQU   ISTATCVT+360                                             00625000
ATCVTLOD EQU   ISTATCVT+356                                             00626000
ATCTRPAB EQU   ISTATCVT+352                                             00627000
ATCMSGM  EQU   ISTATCVT+348                                             00628000
ATCMSGP  EQU   ISTATCVT+344                                             00629000
ATCEPT   EQU   ISTATCVT+340                                             00630000
ATCDVT   EQU   ISTATCVT+336                                             00631000
ATCTRCPT EQU   ISTATCVT+332                                             00632000
ATCDVLOD EQU   ISTATCVT+328                                             00633000
ATCALERT EQU   ISTATCVT+324                                             00634000
ATCEPA   EQU   ISTATCVT+320                                             00635000
ATCSAF   EQU   ISTATCVT+318                                             00636000
ATCXRANG EQU   ISTATCVT+317                                             00637000
ATCLAST  EQU   ATCSHRFG                                                 00638000
ATCSHRTN EQU   ISTATCVT+308                                             00639000
ATCUEP   EQU   ISTATCVT+304                                             00640000
ATCOCRT  EQU   ISTATCVT+300                                             00641000
ATCCSMA  EQU   ATCCSMR                                                  00642000
ATCESC02 EQU   ISTATCVT+292                                             00643000
ATCESC01 EQU   ISTATCVT+288                                             00644000
ATCCDFND EQU   ISTATCVT+284                                             00645000
ATCCDDEL EQU   ISTATCVT+280                                             00646000
ATCCDADD EQU   ISTATCVT+276                                             00647000
ATCMNT   EQU   ISTATCVT+272                                             00648000
ATCRSV16 EQU   ISTATCVT+270                                             00649000
ATCMAXID EQU   ISTATCVT+269                                             00650000
ATCMSGSP EQU   ATCCOM+268                                               00651000
ATCCIDM  EQU   ATCCOM+266                                               00652000
ATCACTRM EQU   ATCCOM+264                                               00653000
ATCNERAP EQU   ATCCOM+260                                               00654000
ATCNESAL EQU   ATCCOM+256                                               00655000
ATCRCC65 EQU   ATCCOM+252                                               00656000
ATCRCC26 EQU   ATCCOM+248                                               00657000
ATCRCC63 EQU   ATCCOM+244                                               00658000
ATCRSV11 EQU   ATCCOM+242                                               00659000
ATCVTMID EQU   ATCCOM+240                                               00660000
ATCAPOST EQU   ATCCOM+236                                               00661000
ATCNERFN EQU   ATCCOM+232                                               00662000
ATCNERNE EQU   ATCCOM+228                                               00663000
ATCNERCV EQU   ATCCOM+224                                               00664000
ATCNERST EQU   ATCCOM+220                                               00665000
ATCDCC61 EQU   ATCCOM+216                                               00666000
ATCDCC60 EQU   ATCCOM+212                                               00667000
ATCSRTDF EQU   ATCCOM+208                                               00668000
ATCSRTAD EQU   ATCCOM+204                                               00669000
ATCFIRA  EQU   ATCCOM+200                                               00670000
ATCSMBQ  EQU   ATCCOM+196                                               00671000
ATCSMRC  EQU   ATCCOM+192                                               00672000
ATCSMRS  EQU   ATCCOM+188                                               00673000
ATCSMQU  EQU   ATCCOM+184                                               00674000
ATCSMRQ  EQU   ATCCOM+180                                               00675000
ATCACDA  EQU   ATCCOM+176                                               00676000
ATCSTMA  EQU   ATCCOM+172                                               00677000
ATCFRSTR EQU   ATCCOM+168                                               00678000
ATCGTSTR EQU   ATCCOM+164                                               00679000
ATCREADA EQU   ATCCOM+160                                               00680000
ATCALOAD EQU   ATCCOM+156                                               00681000
ATCBLDLA EQU   ATCCOM+152                                               00682000
ATCFBRPH EQU   ATCCOM+148                                               00683000
ATCBFTRC EQU   ATCCOM+144                                               00684000
ATCTPBUF EQU   ATCTHTRC                                                 00685000
ATCREMOV EQU   ATCCOM+136                                               00686000
ATCADD   EQU   ATCCOM+132                                               00687000
ATCBPDA  EQU   ATCCOM+128                                               00688000
ATCDVTPT EQU   ATCCOM+124                                               00689000
ATCFEPT  EQU   ATCCOM+120                                               00690000
ATCFDVT  EQU   ATCCOM+116                                               00691000
ATCCONFT EQU   ATCCOM+112                                               00692000
ATCPTCHA EQU   ATCCOM+108                                               00693000
ATCAUTHA EQU   ATCCOM+104                                               00694000
ATCACCTA EQU   ATCCOM+100                                               00695000
ATCRDTH  EQU   ATCCOM+96                                                00696000
ATCFRSCH EQU   ATCCOM+92                                                00697000
ATCFSB   EQU   ATCCOM+88                                                00698000
ATCHLTMS EQU   ATCCOM+84                                                00699000
ATCECPRM EQU   ATCCOM+80                                                00700000
ATCECNET EQU   ATCCOM+76                                                00701000
ATCECOPC EQU   ATCCOM+72                                                00702000
ATCVPARM EQU   ATCCOM+68                                                00703000
ATCECVRQ EQU   ATCCOM+64                                                00704000
ATCECSES EQU   ATCCOM+60                                                00705000
ATCOCHA  EQU   ATCCOM+56                                                00706000
ATCDSPLQ EQU   ATCCOM+52                                                00707000
ATCECDSP EQU   ATCCOM+48                                                00708000
ATCVARYQ EQU   ATCCOM+44                                                00709000
ATCECVRY EQU   ATCCOM+40                                                00710000
ATCHALTQ EQU   ATCCOM+36                                                00711000
ATCECHLT EQU   ATCCOM+32                                                00712000
ATCMODQ  EQU   ATCCOM+28                                                00713000
ATCECMOD EQU   ATCCOM+24                                                00714000
ATCASCHD EQU   ATCCOM+20                                                00715000
ATCSRT   EQU   ATCCOM+16                                                00716000
ATCRDT   EQU   ATCCOM+12                                                00717000
ATCDCFRR EQU   ATCCOM+8                                                 00718000
ATCAPI   EQU   ATCCOM+4                                                 00719000
ATCRSV04 EQU   ATCSTAT4                                                 00720000
ATCVTTRC EQU   ATCSTAT4                                                 00721000
ATCNCSD  EQU   ATCSTAT4                                                 00722000
ATCMTST  EQU   ATCSTAT4                                                 00723000
ATCTPRT  EQU   ATCSTAT4                                                 00724000
ATCPRTAT EQU   ATCSTAT4                                                 00725000
@NM00021 EQU   ATCPOFLG                                                 00726000
ATCPOUNS EQU   ATCPOFLG                                                 00727000
ATCHSDMF EQU   ATCSTFLG                                                 00728000
@NM00020 EQU   ATCSTAT1                                                 00729000
ATCMDHLT EQU   ATCSTAT1                                                 00730000
ATCINHLT EQU   ATCSTAT1                                                 00731000
ATCNETSL EQU   ATCSTAT1                                                 00732000
ATCQKHLT EQU   ATCSTAT1                                                 00733000
ATCSNHLT EQU   ATCSTAT1                                                 00734000
ATCACTIV EQU   ATCSTAT1                                                 00735000
ATCSTART EQU   ATCSTAT1                                                 00736000
DYPPAB   EQU   ISTDYPAB+16                                              00737000
DYPRSV01 EQU   ISTDYPAB+12                                              00738000
DYPTSKID EQU   ISTDYPAB+8                                               00739000
DYPCHAIN EQU   ISTDYPAB+4                                               00740000
DYPFLGS  EQU   ISTDYPAB+2                                               00741000
DYPLNGTH EQU   ISTDYPAB+1                                               00742000
DYPTYPE  EQU   ISTDYPAB                                                 00743000
PABRPHA  EQU   PABRPHFG+1                                               00744000
PABNODQ  EQU   PABFLAGS                                                 00745000
PABINHBT EQU   PABFLAGS                                                 00746000
PABERLOK EQU   PABERRLK                                                 00747000
PABSSN   EQU   PABFLAGS                                                 00748000
PABDYNAM EQU   PABFLAGS                                                 00749000
PABNORPR EQU   PABFLAGS                                                 00750000
PABPRIOR EQU   PABFLAGS                                                 00751000
PABAPYP  EQU   PABFLAGS                                                 00752000
PABDVTA  EQU   ISTPAB+9                                                 00753000
PABOFFST EQU   ISTPAB+8                                                 00754000
PABCHNGP EQU   PABCHAIN+1                                               00755000
PABRSV02 EQU   PABCHAIN                                                 00756000
PABRUNNG EQU   PABCHAIN                                                 00757000
PABRESET EQU   PABCHAIN                                                 00758000
PABUNCON EQU   PABCHAIN                                                 00759000
PABCDP   EQU   PABCHAIN                                                 00760000
PABRESCH EQU   PABCHAIN                                                 00761000
PABCHNG  EQU   PABCHAIN                                                 00762000
PABWEQP  EQU   PABWEQA+1                                                00763000
PABRSV01 EQU   PABWEQA                                                  00764000
PABWEQG  EQU   PABWEQA                                                  00765000
CRACHAIN EQU   ISTCRA+928                                               00766000
CRARSV02 EQU   ISTCRA+924                                               00767000
CRARSV01 EQU   ISTCRA+920                                               00768000
CRABFTBA EQU   CRABUFA                                                  00769000
CRAMASK  EQU   CRASVC+64                                                00770000
CRAHSIZ  EQU   CRASVC+60                                                00771000
CRAASCRR EQU   CRASVC                                                   00772000
CRAPROCR EQU   ISTCRA+312                                               00773000
CRAPSS   EQU   ISTCRA+160                                               00774000
CRARPH   EQU   ISTCRA+52                                                00775000
CRALAPTR EQU   CRABASIC+48                                              00776000
CRAL9PTR EQU   CRABASIC+44                                              00777000
CRAL8PTR EQU   CRABASIC+40                                              00778000
CRAL7PTR EQU   CRABASIC+36                                              00779000
CRAL6PTR EQU   CRABASIC+32                                              00780000
CRAL5PTR EQU   CRABASIC+28                                              00781000
CRAL4PTR EQU   CRABASIC+24                                              00782000
CRAL3PTR EQU   CRABASIC+20                                              00783000
CRAL2PTR EQU   CRABASIC+16                                              00784000
CRAL1PTR EQU   CRABASIC+12                                              00785000
CRALEV01 EQU   CRALKACT+3                                               00786000
CRALEV02 EQU   CRALKACT+3                                               00787000
CRALEV03 EQU   CRALKACT+3                                               00788000
CRALEV04 EQU   CRALKACT+3                                               00789000
CRALEV05 EQU   CRALKACT+3                                               00790000
CRALEV06 EQU   CRALKACT+3                                               00791000
CRALEV07 EQU   CRALKACT+3                                               00792000
CRALEV08 EQU   CRALKACT+3                                               00793000
CRALEV09 EQU   CRALKACT+2                                               00794000
CRALEV10 EQU   CRALKACT+2                                               00795000
CRALEV11 EQU   CRALKACT+2                                               00796000
CRALEV12 EQU   CRALKACT+2                                               00797000
CRALEV13 EQU   CRALKACT+2                                               00798000
CRALEV14 EQU   CRALKACT+2                                               00799000
CRALEV15 EQU   CRALKACT+2                                               00800000
CRALEV16 EQU   CRALKACT+2                                               00801000
CRALEV17 EQU   CRALKACT+1                                               00802000
CRALEV18 EQU   CRALKACT+1                                               00803000
CRALEV19 EQU   CRALKACT+1                                               00804000
CRALEV20 EQU   CRALKACT+1                                               00805000
CRALEV21 EQU   CRALKACT+1                                               00806000
CRALEV22 EQU   CRALKACT+1                                               00807000
CRALEV23 EQU   CRALKACT+1                                               00808000
CRALEV24 EQU   CRALKACT+1                                               00809000
CRALEV25 EQU   CRALKACT                                                 00810000
CRALEV26 EQU   CRALKACT                                                 00811000
CRALEV27 EQU   CRALKACT                                                 00812000
CRALEV28 EQU   CRALKACT                                                 00813000
CRALEV29 EQU   CRALKACT                                                 00814000
CRALEV30 EQU   CRALKACT                                                 00815000
CRALEV31 EQU   CRALKACT                                                 00816000
CRALEV32 EQU   CRALKACT                                                 00817000
CRAFRR   EQU   CRAHDR+4                                                 00818000
CRACRR   EQU   CRAHDR                                                   00819000
@NM00019 EQU   ISTAPCRR+137                                             00820000
@NM00018 EQU   APC57FLG                                                 00821000
APCNREL  EQU   APC57FLG                                                 00822000
APCRECRA EQU   APC57FLG                                                 00823000
@NM00017 EQU   APC54FLG                                                 00824000
APCRLST  EQU   APC54FLG                                                 00825000
APCPR153 EQU   APC53FLG                                                 00826000
@NM00016 EQU   APC52FLG                                                 00827000
APCWKF   EQU   APC52FLG                                                 00828000
APCNWF   EQU   APC52FLG                                                 00829000
APCRDQ   EQU   APC52FLG                                                 00830000
APCQENQ  EQU   APC52FLG                                                 00831000
APCSMSR  EQU   APC52FLG                                                 00832000
APCCKRQ  EQU   APC52FLG                                                 00833000
@NM00015 EQU   APC31FLG                                                 00834000
APCSORT  EQU   APC31FLG                                                 00835000
APCRESCH EQU   APC31FLG                                                 00836000
APCTPXIT EQU   APC31FLG                                                 00837000
APCSWTWD EQU   ISTAPCRR+128                                             00838000
APCSAV2  EQU   ISTAPCRR+124                                             00839000
APCSAV1  EQU   ISTAPCRR+120                                             00840000
APCRETCD EQU   APCCOMF+2                                                00841000
@NM00014 EQU   APCCOMF1+1                                               00842000
APCZLBER EQU   APCCOMF1                                                 00843000
APCEXIT  EQU   APCCOMF1                                                 00844000
APCRELR  EQU   APCCOMF1                                                 00845000
APCIRB2  EQU   APCCOMF1                                                 00846000
APCIRB1  EQU   APCCOMF1                                                 00847000
APCSMCR  EQU   APCCOMF1                                                 00848000
APCUETSK EQU   APCCOMF1                                                 00849000
APCSSTSK EQU   APCCOMF1                                                 00850000
APCESTAL EQU   APCSAVE                                                  00851000
APCFRRPM EQU   ISTAPCRR+40                                              00852000
APCQWFO  EQU   ISTAPCRR+36                                              00853000
APCPABSV EQU   ISTAPCRR+32                                              00854000
APCRTRN  EQU   ISTAPCRR+28                                              00855000
APCTCBA  EQU   ISTAPCRR+24                                              00856000
APCPSTA  EQU   ISTAPCRR+20                                              00857000
@NM00013 EQU   APCRFLG+1                                                00858000
APC31R   EQU   APCRFLG                                                  00859000
APC58R   EQU   APCRFLG                                                  00860000
APC57R   EQU   APCRFLG                                                  00861000
APC56R   EQU   APCRFLG                                                  00862000
APC54R   EQU   APCRFLG                                                  00863000
APC53R   EQU   APCRFLG                                                  00864000
APC52R   EQU   APCRFLG                                                  00865000
APC51R   EQU   APCRFLG                                                  00866000
@NM00012 EQU   APCATFLG+1                                               00867000
APC31E   EQU   APCATFLG                                                 00868000
APC58E   EQU   APCATFLG                                                 00869000
APC57E   EQU   APCATFLG                                                 00870000
APC56E   EQU   APCATFLG                                                 00871000
APC54E   EQU   APCATFLG                                                 00872000
APC53E   EQU   APCATFLG                                                 00873000
APC52E   EQU   APCATFLG                                                 00874000
APC51E   EQU   APCATFLG                                                 00875000
APCHDRSV EQU   ISTAPCRR                                                 00876000
ASCPSREG EQU   ISTASCRR+44                                              00877000
ASCUSR01 EQU   ASCUSRGS+12                                              00878000
ASCUSR00 EQU   ASCUSRGS+8                                               00879000
ASCUSR15 EQU   ASCUSRGS+4                                               00880000
ASCUSR14 EQU   ASCUSRGS                                                 00881000
ASCETRYA EQU   ISTASCRR+24                                              00882000
ASCKEY   EQU   ISTASCRR+23                                              00883000
ASCAUDIT EQU   ASCFLG3                                                  00884000
ASCFBDUD EQU   ASCFLG3                                                  00885000
ASCLLKF  EQU   ASCFLG3                                                  00886000
ASCKEYF  EQU   ASCFLG3                                                  00887000
ASCFBDAL EQU   ASCFLG3                                                  00888000
ASCFSRGT EQU   ASCFLG3                                                  00889000
ASCICR   EQU   ASCFLG2                                                  00890000
ASCFSRIC EQU   ASCFLG2                                                  00891000
ASCFBDIC EQU   ASCFLG2                                                  00892000
ASCFBAIC EQU   ASCFLG2                                                  00893000
ASCPASTR EQU   ASCFLG1                                                  00894000
ASCFSR   EQU   ASCFLG1                                                  00895000
ASCFBD   EQU   ASCFLG1                                                  00896000
ASCFBA   EQU   ASCFLG1                                                  00897000
ASCPFCRR EQU   ISTASCRR                                                 00898000
ZCRRU    EQU   ZCRRHRU+3                                                00899000
ZCRRH    EQU   ZCRRHRU                                                  00900000
ZCRWORDA EQU   ISTZCRR+477                                              00901000
ZCRCMNRC EQU   ISTZCRR+476                                              00902000
ZCRRSV97 EQU   ZCRENTER+18                                              00903000
ZCREIC2B EQU   ZCRENTER+18                                              00904000
ZCREAC2B EQU   ZCRENTER+18                                              00905000
ZCRELCAB EQU   ZCRENTER+18                                              00906000
ZCREDCMF EQU   ZCRENTER+18                                              00907000
ZCREBCIF EQU   ZCRENTER+18                                              00908000
ZCREICSG EQU   ZCRENTER+18                                              00909000
ZCREDCK0 EQU   ZCRENTER+18                                              00910000
ZCRECFY0 EQU   ZCRENTER+17                                              00911000
ZCREKCCB EQU   ZCRENTER+17                                              00912000
ZCREDCNB EQU   ZCRENTER+17                                              00913000
ZCREICOE EQU   ZCRENTER+17                                              00914000
ZCREBCNB EQU   ZCRENTER+17                                              00915000
ZCREBC0L EQU   ZCRENTER+17                                              00916000
ZCREBCAL EQU   ZCRENTER+17                                              00917000
ZCREDCQR EQU   ZCRENTER+17                                              00918000
ZCREDCPR EQU   ZCRENTER+16                                              00919000
ZCREBCSB EQU   ZCRENTER+16                                              00920000
ZCREAC1R EQU   ZCRENTER+16                                              00921000
ZCRECCCI EQU   ZCRENTER+16                                              00922000
ZCRECCAI EQU   ZCRENTER+16                                              00923000
ZCRECCBI EQU   ZCRENTER+16                                              00924000
ZCREBCAR EQU   ZCRENTER+16                                              00925000
ZCREBCDR EQU   ZCRENTER+16                                              00926000
ZCREBCBR EQU   ZCRENTER+15                                              00927000
ZCREDCXR EQU   ZCRENTER+15                                              00928000
ZCREDCWB EQU   ZCRENTER+15                                              00929000
ZCREDCWR EQU   ZCRENTER+15                                              00930000
ZCREKCCN EQU   ZCRENTER+15                                              00931000
ZCREKCBN EQU   ZCRENTER+15                                              00932000
ZCREKCBB EQU   ZCRENTER+15                                              00933000
ZCREJC0B EQU   ZCRENTER+15                                              00934000
ZCREJCDB EQU   ZCRENTER+14                                              00935000
ZCREJCCB EQU   ZCRENTER+14                                              00936000
ZCREJCBB EQU   ZCRENTER+14                                              00937000
ZCREJCAB EQU   ZCRENTER+14                                              00938000
ZCREIC1B EQU   ZCRENTER+14                                              00939000
ZCREIC0B EQU   ZCRENTER+14                                              00940000
ZCREICX0 EQU   ZCRENTER+14                                              00941000
ZCREICWB EQU   ZCRENTER+14                                              00942000
ZCREICVB EQU   ZCRENTER+13                                              00943000
ZCREICUB EQU   ZCRENTER+13                                              00944000
ZCREICTB EQU   ZCRENTER+13                                              00945000
ZCREICSC EQU   ZCRENTER+13                                              00946000
ZCREICSB EQU   ZCRENTER+13                                              00947000
ZCREICRB EQU   ZCRENTER+13                                              00948000
ZCREICQB EQU   ZCRENTER+13                                              00949000
ZCREICQA EQU   ZCRENTER+13                                              00950000
ZCREICOB EQU   ZCRENTER+12                                              00951000
ZCREICOA EQU   ZCRENTER+12                                              00952000
ZCREICNB EQU   ZCRENTER+12                                              00953000
ZCREICNA EQU   ZCRENTER+12                                              00954000
ZCREICMB EQU   ZCRENTER+12                                              00955000
ZCREICLB EQU   ZCRENTER+12                                              00956000
ZCREICKG EQU   ZCRENTER+12                                              00957000
ZCREICKE EQU   ZCRENTER+12                                              00958000
ZCREICKB EQU   ZCRENTER+11                                              00959000
ZCREICJB EQU   ZCRENTER+11                                              00960000
ZCREICID EQU   ZCRENTER+11                                              00961000
ZCREICIB EQU   ZCRENTER+11                                              00962000
ZCREICHB EQU   ZCRENTER+11                                              00963000
ZCREICGB EQU   ZCRENTER+11                                              00964000
ZCREICEB EQU   ZCRENTER+11                                              00965000
ZCREICDB EQU   ZCRENTER+11                                              00966000
ZCREICCI EQU   ZCRENTER+10                                              00967000
ZCREICCB EQU   ZCRENTER+10                                              00968000
ZCREICBI EQU   ZCRENTER+10                                              00969000
ZCREICBB EQU   ZCRENTER+10                                              00970000
ZCREICAB EQU   ZCRENTER+10                                              00971000
ZCREICAA EQU   ZCRENTER+10                                              00972000
ZCREHCAN EQU   ZCRENTER+10                                              00973000
ZCREGC0B EQU   ZCRENTER+10                                              00974000
ZCREGC0A EQU   ZCRENTER+9                                               00975000
ZCREGCLA EQU   ZCRENTER+9                                               00976000
ZCREGCEB EQU   ZCRENTER+9                                               00977000
ZCREGCDB EQU   ZCRENTER+9                                               00978000
@NM00011 EQU   ZCRENTER+9                                               00979000
ZCREGCBB EQU   ZCRENTER+9                                               00980000
ZCREGCAB EQU   ZCRENTER+9                                               00981000
ZCREFCEB EQU   ZCRENTER+9                                               00982000
ZCREFCEA EQU   ZCRENTER+8                                               00983000
ZCREECTA EQU   ZCRENTER+8                                               00984000
ZCREECEA EQU   ZCRENTER+8                                               00985000
ZCREECDA EQU   ZCRENTER+8                                               00986000
ZCREECCB EQU   ZCRENTER+8                                               00987000
ZCREECCA EQU   ZCRENTER+8                                               00988000
ZCREECBB EQU   ZCRENTER+8                                               00989000
ZCREECBA EQU   ZCRENTER+8                                               00990000
ZCREDCMB EQU   ZCRENTER+7                                               00991000
ZCREDCL0 EQU   ZCRENTER+7                                               00992000
ZCREDCKB EQU   ZCRENTER+7                                               00993000
ZCREDCKA EQU   ZCRENTER+7                                               00994000
ZCREDCJ0 EQU   ZCRENTER+7                                               00995000
ZCREDCI0 EQU   ZCRENTER+7                                               00996000
ZCREDCH0 EQU   ZCRENTER+7                                               00997000
ZCREDCF0 EQU   ZCRENTER+7                                               00998000
ZCREDCE0 EQU   ZCRENTER+6                                               00999000
ZCREDCD0 EQU   ZCRENTER+6                                               01000000
ZCREDCC0 EQU   ZCRENTER+6                                               01001000
ZCREDCB0 EQU   ZCRENTER+6                                               01002000
ZCREDCA0 EQU   ZCRENTER+6                                               01003000
ZCRECC2B EQU   ZCRENTER+6                                               01004000
ZCRECC1B EQU   ZCRENTER+6                                               01005000
ZCRECC1A EQU   ZCRENTER+6                                               01006000
ZCRECC0B EQU   ZCRENTER+5                                               01007000
ZCRECC0A EQU   ZCRENTER+5                                               01008000
ZCREBC0B EQU   ZCRENTER+5                                               01009000
ZCREBC0A EQU   ZCRENTER+5                                               01010000
ZCREBCZ0 EQU   ZCRENTER+5                                               01011000
ZCREBCY0 EQU   ZCRENTER+5                                               01012000
ZCREBCX0 EQU   ZCRENTER+5                                               01013000
ZCREBCXA EQU   ZCRENTER+5                                               01014000
ZCREBCSC EQU   ZCRENTER+4                                               01015000
ZCREBCRB EQU   ZCRENTER+4                                               01016000
ZCREBCRA EQU   ZCRENTER+4                                               01017000
ZCREBCQB EQU   ZCRENTER+4                                               01018000
ZCREBCPB EQU   ZCRENTER+4                                               01019000
ZCREBCOB EQU   ZCRENTER+4                                               01020000
ZCREBCNE EQU   ZCRENTER+4                                               01021000
ZCREBCND EQU   ZCRENTER+4                                               01022000
ZCREBCMB EQU   ZCRENTER+3                                               01023000
ZCREBCLB EQU   ZCRENTER+3                                               01024000
ZCREBCLA EQU   ZCRENTER+3                                               01025000
ZCREBCKB EQU   ZCRENTER+3                                               01026000
ZCREBCKA EQU   ZCRENTER+3                                               01027000
ZCREBCJB EQU   ZCRENTER+3                                               01028000
ZCREBCJA EQU   ZCRENTER+3                                               01029000
ZCREBCID EQU   ZCRENTER+3                                               01030000
ZCREBCIB EQU   ZCRENTER+2                                               01031000
ZCREBCIA EQU   ZCRENTER+2                                               01032000
ZCREBCHB EQU   ZCRENTER+2                                               01033000
ZCREBCHA EQU   ZCRENTER+2                                               01034000
ZCREBCGB EQU   ZCRENTER+2                                               01035000
ZCREBCGA EQU   ZCRENTER+2                                               01036000
ZCREBCFB EQU   ZCRENTER+2                                               01037000
ZCREBCFA EQU   ZCRENTER+2                                               01038000
ZCREBCEB EQU   ZCRENTER+1                                               01039000
ZCREBCDI EQU   ZCRENTER+1                                               01040000
ZCREBCCB EQU   ZCRENTER+1                                               01041000
ZCREBCBI EQU   ZCRENTER+1                                               01042000
ZCREBCBB EQU   ZCRENTER+1                                               01043000
ZCREBCBA EQU   ZCRENTER+1                                               01044000
ZCREBCAM EQU   ZCRENTER+1                                               01045000
ZCREBCAI EQU   ZCRENTER+1                                               01046000
ZCREBCAG EQU   ZCRENTER                                                 01047000
ZCREBCAE EQU   ZCRENTER                                                 01048000
ZCREBCAB EQU   ZCRENTER                                                 01049000
ZCREBCAA EQU   ZCRENTER                                                 01050000
ZCREAC1B EQU   ZCRENTER                                                 01051000
ZCREAC0B EQU   ZCRENTER                                                 01052000
ZCREAC0A EQU   ZCRENTER                                                 01053000
ZCREAC1A EQU   ZCRENTER                                                 01054000
ZCRTNAME EQU   ZCRAUDIT+1                                               01055000
ZCRTID   EQU   ZCRAUDIT                                                 01056000
ZCRREMIC EQU   ISTZCRR+436                                              01057000
ZCRSAVEZ EQU   ISTZCRR+196                                              01058000
ZCRDAFSV EQU   ZCRCIDSV+2                                               01059000
ZCRSAFSV EQU   ZCRCIDSV                                                 01060000
ZCRR13SV EQU   ISTZCRR+188                                              01061000
ZCRR2SV  EQU   ISTZCRR+184                                              01062000
ZCROPCDE EQU   ISTZCRR+183                                              01063000
ZCRPRMTC EQU   ISTZCRR+182                                              01064000
ZCRRCDSV EQU   ISTZCRR+181                                              01065000
ZCRAWQSW EQU   ISTZCRR+180                                              01066000
ZCRTOPQ  EQU   ISTZCRR+180                                              01067000
ZCRLSTFB EQU   ISTZCRR+180                                              01068000
ZCRXSCHD EQU   ISTZCRR+180                                              01069000
ZCRNXTEL EQU   ISTZCRR+180                                              01070000
ZCRSCANQ EQU   ISTZCRR+180                                              01071000
ZCRMOREL EQU   ISTZCRR+180                                              01072000
ZCRFBPRC EQU   ISTZCRR+180                                              01073000
ZCRFSBSV EQU   ISTZCRR+176                                              01074000
ZCRSVWK5 EQU   ZCRWKARA+16                                              01075000
ZCRSVWK4 EQU   ZCRWKARA+12                                              01076000
ZCRSVWK3 EQU   ZCRWKARA+8                                               01077000
ZCRSVWK2 EQU   ZCRWKARA+4                                               01078000
ZCRSVWK1 EQU   ZCRWKARA                                                 01079000
ZCRSVF25 EQU   ZCRSVRTN+96                                              01080000
ZCRSVF24 EQU   ZCRSVRTN+92                                              01081000
ZCRSVF23 EQU   ZCRSVRTN+88                                              01082000
ZCRSVF22 EQU   ZCRSVRTN+84                                              01083000
ZCRSVF21 EQU   ZCRSVRTN+80                                              01084000
ZCRSVF20 EQU   ZCRSVRTN+76                                              01085000
ZCRSVF19 EQU   ZCRSVRTN+72                                              01086000
ZCRSVF18 EQU   ZCRSVRTN+68                                              01087000
ZCRSVF17 EQU   ZCRSVRTN+64                                              01088000
ZCRSVF16 EQU   ZCRSVRTN+60                                              01089000
ZCRSVF15 EQU   ZCRSVRTN+56                                              01090000
ZCRSVF14 EQU   ZCRSVRTN+52                                              01091000
ZCRSVF13 EQU   ZCRSVRTN+48                                              01092000
ZCRSVF12 EQU   ZCRSVRTN+44                                              01093000
ZCRSVF11 EQU   ZCRSVRTN+40                                              01094000
ZCRSVF10 EQU   ZCRSVRTN+36                                              01095000
ZCRSVF9  EQU   ZCRSVRTN+32                                              01096000
ZCRSVF8  EQU   ZCRSVRTN+28                                              01097000
ZCRSVF7  EQU   ZCRSVRTN+24                                              01098000
ZCRSVF6  EQU   ZCRSVRTN+20                                              01099000
ZCRSVF5  EQU   ZCRSVRTN+16                                              01100000
ZCRSVF4  EQU   ZCRSVRTN+12                                              01101000
ZCRSVF3  EQU   ZCRSVRTN+8                                               01102000
ZCRSVF2  EQU   ZCRSVRTN+4                                               01103000
ZCRSVF1  EQU   ZCRSVRTN                                                 01104000
ZCRPVZB  EQU   ISTZCRR+52                                               01105000
ZCRZLB   EQU   ISTZCRR+48                                               01106000
ZCRBFPTR EQU   ISTZCRR+44                                               01107000
ZCRCCWA  EQU   ISTZCRR+40                                               01108000
ZCRPSW   EQU   ZCRPARMS+15                                              01109000
ZCRPCHAR EQU   ZCRPARMS+14                                              01110000
ZCRPRES2 EQU   ZCRPCOD2                                                 01111000
ZCRPMFGF EQU   ZCRPCOD2                                                 01112000
ZCRPFHDR EQU   ZCRPCOD2                                                 01113000
ZCRPPG2  EQU   ZCRPCOD2                                                 01114000
ZCRPRES  EQU   ZCRPCOD1                                                 01115000
ZCRPCFTX EQU   ZCRPCOD1                                                 01116000
ZCRPBUF  EQU   ZCRPCOD1                                                 01117000
ZCRPLSCB EQU   ZCRPCOD1                                                 01118000
ZCRPLSBQ EQU   ZCRPLSBF                                                 01119000
ZCRPFSB  EQU   ZCRPCOD1                                                 01120000
ZCRPLNG  EQU   ZCRPCOD1                                                 01121000
ZCRPPG   EQU   ZCRPCOD1                                                 01122000
ZCRDTODA EQU   ZCRDFRDA                                                 01123000
ZCRMLNG  EQU   ZCRPARMS+8                                               01124000
ZCRTBPTR EQU   ZCRPARMS+4                                               01125000
ZCRCBPTR EQU   ZCRFBPTR                                                 01126000
ZCRCRLCP EQU   ISTZCRR+20                                               01127000
@NM00010 EQU   ZCRSCPSW                                                 01128000
ZCRSKIPT EQU   ZCRSCPSW                                                 01129000
ZCRFSBWE EQU   ZCRSCPSW                                                 01130000
ZCRPRCMP EQU   ZCRSCPSW                                                 01131000
ZCRLREQ  EQU   ZCRSCPSW                                                 01132000
ZCRRJLCP EQU   ZCRSCPSW                                                 01133000
ZCRTPINV EQU   ZCRSCPSW                                                 01134000
ZCRTPEX  EQU   ZCRSCPSW                                                 01135000
@NM00009 EQU   ZCRIBPR                                                  01136000
ZCR3270R EQU   ZCRIBPR                                                  01137000
ZCR3270  EQU   ZCRIBPR                                                  01138000
ZCRLCPFD EQU   ZCRIBPR                                                  01139000
ZCRLCPFR EQU   ZCRIBPR                                                  01140000
ZCRRELK  EQU   ZCRIBPR                                                  01141000
ZCRERR   EQU   ZCRIBPR                                                  01142000
ZCRNOBUF EQU   ZCRIBPR                                                  01143000
@NM00008 EQU   ZCRPFLGS                                                 01144000
ZCRQAHED EQU   ZCRPFLGS                                                 01145000
ZCRF1RES EQU   ZCRGENSW                                                 01146000
ZCRBRIS  EQU   ZCRGENSW                                                 01147000
ZCRCLRBD EQU   ZCRGENSW                                                 01148000
ZCREXRES EQU   ZCRGENSW                                                 01149000
ZCRLCSYN EQU   ZCRGENSW                                                 01150000
ZCRRT06  EQU   ZCRGENSW                                                 01151000
ZCRTSW2  EQU   ZCRGENSW                                                 01152000
ZCRTSW1  EQU   ZCRGENSW                                                 01153000
ZCRINLCP EQU   ZCRFLGS3                                                 01154000
ZCRWRPTR EQU   ZCRFLGS3                                                 01155000
ZCRNOFRE EQU   ZCRFLGS3                                                 01156000
ZCREDRIV EQU   ZCRFLGS3                                                 01157000
ZCRDISC  EQU   ZCRFLGS3                                                 01158000
ZCRTPDIS EQU   ZCRFLGS3                                                 01159000
ZCRTPCON EQU   ZCRFLGS3                                                 01160000
ZCRTIC   EQU   ZCRFLGS3                                                 01161000
ZCRCNLXL EQU   ZCRRESET                                                 01162000
ZCRENDAN EQU   ZCRSWFLD                                                 01163000
ZCRENDXL EQU   ZCRSWFLD                                                 01164000
ZCRENDX  EQU   ZCRSWFLD                                                 01165000
ZCROB1   EQU   ZCRNDLCP                                                 01166000
ZCRENDPR EQU   ZCRSWFLD                                                 01167000
ZCREXTYP EQU   ZCRSWFLD                                                 01168000
ZCRSLCP  EQU   ZCRENDSH                                                 01169000
ZCRIF0E3 EQU   ZCRFLGS2                                                 01170000
ZCRIF0E2 EQU   ZCRFLGS2                                                 01171000
ZCRIF0E1 EQU   ZCRFLGS2                                                 01172000
ZCROB    EQU   ZCRFLGS2                                                 01173000
ZCRFMSED EQU   ZCRFLGS2                                                 01174000
ZCRSHEDI EQU   ZCRFLGS2                                                 01175000
ZCRLOCAL EQU   ZCRFLGS2                                                 01176000
ZCRFEXIT EQU   ZCRFLGS1                                                 01177000
ZCRUNSOL EQU   ZCRFLGS1                                                 01178000
ZCRENDLP EQU   ZCRFLGS1                                                 01179000
ZCRNRMEX EQU   ZCRFLGS1                                                 01180000
ZCRWAIT  EQU   ZCRFLGS1                                                 01181000
ZCRDEQSW EQU   ZCRFLGS1                                                 01182000
ZCRQUESW EQU   ZCRFLGS1                                                 01183000
ZCREXSW  EQU   ZCRFLGS1                                                 01184000
ZCRFRRA  EQU   ISTZCRR+8                                                01185000
ZCRCHAIN EQU   ISTZCRR+4                                                01186000
ZCRFLAG  EQU   ZCRCRR+3                                                 01187000
ZCRLEN   EQU   ZCRCRR+1                                                 01188000
ZCRID    EQU   ZCRCRR                                                   01189000
CCFRSVD1 EQU   CFCCRT                                                   01190000
CCFCR2   EQU   CFCCRT                                                   01191000
CCFCRP   EQU   CFCCRT                                                   01192000
CCFCR1   EQU   CFCCRT                                                   01193000
CCFCS2   EQU   CFCCRT                                                   01194000
CCFCS1   EQU   CFCCRT                                                   01195000
NCFRSVD  EQU   CFCNTRD                                                  01196000
NCFCR2   EQU   CFCNTRD                                                  01197000
NCFCRP   EQU   CFCNTRD                                                  01198000
NCFCR1   EQU   CFCNTRD                                                  01199000
NCFCS2   EQU   CFCNTRD                                                  01200000
NCFCS1   EQU   CFCNTRD                                                  01201000
PFCRSV01 EQU   ISTPFCRR+13                                              01202000
PFCFTA   EQU   ISTPFCRR+12                                              01203000
CRRFRR   EQU   PFCFRRO                                                  01204000
CRRCHAIN EQU   PFCCRRO                                                  01205000
CRRLEN   EQU   PFCCRRLN                                                 01206000
PFCRSV10 EQU   PFCCRR+1                                                 01207000
CRRID    EQU   PFCCRRID                                                 01208000
ZSAZTRAC EQU   ISTZSAVE+36                                              01209000
ZSAZSVVR EQU   ISTZSAVE+12                                              01210000
ZSAZSVRR EQU   ISTZSAVE+8                                               01211000
ZSAZSVFC EQU   ISTZSAVE+4                                               01212000
ZSAZACTV EQU   ZSAZSVMS                                                 01213000
LCPFTYPE EQU   LCPRPHA                                                  01214000
LCPRSTQH EQU   LCPLCCW                                                  01215000
LCPCLREP EQU   ISTLCPB+44                                               01216000
LCPUBFSB EQU   LCPFLCCW                                                 01217000
LCPRSV77 EQU   ISTLCPB+39                                               01218000
LCPLCCWC EQU   ISTLCPB+38                                               01219000
LCPRSV78 EQU   LCPFLG1                                                  01220000
LCPTRANS EQU   LCPFLG1                                                  01221000
LCPSTLB  EQU   LCPFLG1                                                  01222000
LCPREDRV EQU   LCPFLG1                                                  01223000
LCPDIRPT EQU   LCPFLG1                                                  01224000
LCPINTER EQU   LCPFLG1                                                  01225000
LCPRESET EQU   LCPFLG1                                                  01226000
LCPSTYPE EQU   ISTLCPB+36                                               01227000
LCPFSNCH EQU   ISTLCPB+34                                               01228000
LCPFOSN  EQU   ISTLCPB+32                                               01229000
LCPTLBAD EQU   ISTLCPB+28                                               01230000
LCPFDB2  EQU   LCPFDBA+1                                                01231000
LCPFDB1  EQU   LCPFDBA                                                  01232000
LCPNXLCW EQU   ISTLCPB+20                                               01233000
LCPDAF   EQU   LCPCID+2                                                 01234000
LCPSAF   EQU   LCPCID                                                   01235000
LCPLCCW1 EQU   ISTLCPB+12                                               01236000
LCPRRCNT EQU   LCPSEQ+1                                                 01237000
LCPRRCCT EQU   LCPSEQ                                                   01238000
LCPATOP  EQU   LCPFLAG2                                                 01239000
LCPFREE  EQU   LCPFLAG2                                                 01240000
LCPDSTAT EQU   LCPFLAG2                                                 01241000
LCPEXRES EQU   LCPFID0                                                  01242000
LCPZRIMM EQU   LCPTLBPI                                                 01243000
LCPRSTRT EQU   LCPFLAG2                                                 01244000
LCPASYN  EQU   LCPFLAG2                                                 01245000
LCPPRFLG EQU   LCPFLAG2                                                 01246000
LCPZMIRC EQU   LCPRUCNT                                                 01247000
LCPCHAI2 EQU   LCPCHAIN+1                                               01248000
LCPCHNG  EQU   LCPCHAI1                                                 01249000
LCPZRT0B EQU   LCPMNRCD                                                 01250000
LCPZRT0A EQU   LCPMNRCD                                                 01251000
LCPZRTL9 EQU   LCPZRT09                                                 01252000
LCPZRTL8 EQU   LCPZRT08                                                 01253000
LCPZRTL7 EQU   LCPZRT07                                                 01254000
LCPZRTL6 EQU   LCPZRT06                                                 01255000
LCPZRTL5 EQU   LCPZRT05                                                 01256000
LCPZRTL4 EQU   LCPZRT04                                                 01257000
LCPZRTL3 EQU   LCPZRT03                                                 01258000
LCPZRTL2 EQU   LCPZRT02                                                 01259000
LCPZRT01 EQU   LCPFLAGS                                                 01260000
LCPZRT00 EQU   LCPFLAGS                                                 01261000
LCPLNGTH EQU   ISTLCPB+1                                                01262000
LCPTYPE  EQU   ISTLCPB                                                  01263000
LCCWDATA EQU   ISTLCCW+4                                                01264000
LCCWCNT  EQU   ISTLCCW+2                                                01265000
LCCWACI  EQU   LCCWFLAG                                                 01266000
LCCWRFI  EQU   LCCWFLAG                                                 01267000
LCCWPER  EQU   LCCWLSI                                                  01268000
LCCWIDAT EQU   LCCWFLAG                                                 01269000
LCCWNTVC EQU   LCCWFLAG                                                 01270000
LCCWCKPT EQU   LCCWFLAG                                                 01271000
LCCWCC   EQU   LCCWFLAG                                                 01272000
LCCWCD   EQU   LCCWFLAG                                                 01273000
LCCWTYPE EQU   LCCWCTL                                                  01274000
LCCWMODE EQU   LCCWCTL                                                  01275000
LCCWSOP  EQU   LCCWRWOP                                                 01276000
@NM00007 EQU   LCCWRWOP                                                 01277000
LCCWSD   EQU   LCCWOP                                                   01278000
LCCWSI   EQU   LCCWOP                                                   01279000
LOKXCL   EQU   @NM00005                                                 01280000
LOKPRY   EQU   @NM00005                                                 01281000
@NM00006 EQU   @NM00005                                                 01282000
@NM00004 EQU   LOKCHNG                                                  01283000
LOKCT    EQU   ISTLOK                                                   01284000
RPHNEXPO EQU   ISTRPH+104                                               01285000
RPHSAV15 EQU   RPHWORK+56                                               01286000
RPHSAV14 EQU   RPHWORK+52                                               01287000
RPHSAV13 EQU   RPHWORK+48                                               01288000
RPHSAV12 EQU   RPHWORK+44                                               01289000
RPHSAV11 EQU   RPHWORK+40                                               01290000
RPHSAV10 EQU   RPHWORK+36                                               01291000
RPHSAVE9 EQU   RPHWORK+32                                               01292000
RPHSAVE8 EQU   RPHWORK+28                                               01293000
RPHSAVE7 EQU   RPHWORK+24                                               01294000
RPHSAVE6 EQU   RPHWORK+20                                               01295000
RPHSAVE5 EQU   RPHWORK+16                                               01296000
RPHSAVE4 EQU   RPHWORK+12                                               01297000
RPHSAVE3 EQU   RPHWORK+8                                                01298000
RPHSAVE2 EQU   RPHWORK+4                                                01299000
RPHSHALF EQU   RPHSAVE1+2                                               01300000
RPHSBIT8 EQU   RPHSBITS                                                 01301000
RPHSBIT7 EQU   RPHSBITS                                                 01302000
RPHSBIT6 EQU   RPHSBITS                                                 01303000
RPHSBIT5 EQU   RPHSBITS                                                 01304000
RPHSBIT4 EQU   RPHSBITS                                                 01305000
RPHSBIT3 EQU   RPHSBITS                                                 01306000
RPHSBIT2 EQU   RPHSBITS                                                 01307000
RPHSBIT1 EQU   RPHSBITS                                                 01308000
RPHSBYTE EQU   RPHSAVE1                                                 01309000
RPHPABQP EQU   RPHPABQA+1                                               01310000
RPHPABFG EQU   RPHPABQA                                                 01311000
RPHCRR   EQU   ISTRPH+32                                                01312000
RPHSRP34 EQU   RPHSRPRM+2                                               01313000
RPHSRP12 EQU   RPHSRPRM                                                 01314000
RPHWEGT  EQU   RPHCSPA                                                  01315000
RPHMAJCB EQU   ISTRPH+21                                                01316000
RPHPABOF EQU   ISTRPH+20                                                01317000
RPHRESUM EQU   RPHRESMA+1                                               01318000
RPHRSV01 EQU   RPHWPFLG                                                 01319000
RPHPURGE EQU   RPHWPFLG                                                 01320000
RPHPT    EQU   RPHWPFLG                                                 01321000
RPHWT    EQU   RPHWPFLG                                                 01322000
RPHRSKEY EQU   RPHWPFLG                                                 01323000
RPHDVTA  EQU   ISTRPH+12                                                01324000
RPHTIK   EQU   RPHTSKID+3                                               01325000
@NM00003 EQU   RPHTSKID                                                 01326000
RPHRPHAP EQU   RPHRPHA+1                                                01327000
@NM00002 EQU   RPHRPHA                                                  01328000
@NM00001 EQU   RPHFLGB                                                  01329000
RPHRLCRA EQU   RPHFLGB                                                  01330000
RPHNRSAV EQU   RPHFLGB                                                  01331000
RPHPGCMP EQU   RPHFLGB                                                  01332000
RPHFBAPS EQU   RPHFLGB                                                  01333000
RPHBSSP  EQU   RPHFLGB                                                  01334000
RPHLOCK  EQU   RPHFLGB                                                  01335000
RPHFNFLG EQU   RPHFSTLC                                                 01336000
RPHMLTCP EQU   RPHFLAGS                                                 01337000
RPHSMCLR EQU   RPHFLAGS                                                 01338000
RPHSMTYP EQU   RPHFLAGS                                                 01339000
RPHSMQ   EQU   RPHFLAGS                                                 01340000
RPHAUTEX EQU   RPHAPTYP                                                 01341000
RPHSPGIN EQU   RPHFLAGS                                                 01342000
RPHOGIND EQU   RPHFLAGS                                                 01343000
RPHLNGTH EQU   RPHCNTL+1                                                01344000
RPHTYPE  EQU   RPHCNTL                                                  01345000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01346000
@ENDDATA EQU   *                                                        01347000
         END   ISTAPC36,(C'PLS1711',0603,75290)                         01348000
