         TITLE 'ISTAPM59-PSS FAST DISPATCH TO TPIOS                    *00001000
                        '                                               00002000
ISTAPC59 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTAPC59  76.018'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
*                                                                  0216 00013000
*   /*****************************************************************/ 00014000
*   /*                                                               */ 00015000
*   /* BEGIN CODE GET @MPST FROM PST PTD TO BY ASXB                  */ 00016000
*   /*                                                               */ 00017000
*   /*****************************************************************/ 00018000
*                                                                  0217 00019000
*   MPSTPTR=PSAAOLD->ASCBASXB->ASXBMPST;/*                   @ZM32636*/ 00020000
*                                                                  0217 00021000
         L     @07,PSAAOLD                                         0217 00022000
         L     @07,ASCBASXB(,@07)                                  0217 00023000
         L     MPSTPTR,ASXBMPST(,@07)                              0217 00024000
*   /*****************************************************************/ 00025000
*   /*                                                               */ 00026000
*   /* SETUP ERROR RECOVERY                                          */ 00027000
*   /*                                                               */ 00028000
*   /*****************************************************************/ 00029000
*                                                                  0218 00030000
*   RFY                                                            0218 00031000
*    (FRRPREG) RSTD;                                               0218 00032000
*   DO;                             /* LISATCVT                    0219 00033000
*                                      CVTBASE(PAGEABLE,(REG15))     */ 00034000
*     REG15=ATCLCPTR;               /* SET UP ATCVT POINTER          */ 00035000
         L     REG15,ATCLCPTR                                      0220 00036000
*   END;                            /* LISATCVT                      */ 00037000
*   FRRPREG=REG15->ATCAP66;         /* ISTAPC66 WILL COVER FOR AWHILE*/ 00038000
         L     FRRPREG,ATCAP66(,REG15)                             0222 00039000
*   GENERATE REFS(FRRPREG,PARREG,WRKA,WRKB,PSACSTK,PSA,FRRSCURR,FRRS,   00040000
*       FRRSLAST,FRRSELEN,FRRSFRRA,FRRSENTR,FRRSPARM,FRRSEMP,PSALSFCC); 00041000
   SETFRR A,FRRAD=(FRRPREG),PARMAD=(PARREG),WRKREGS=(WRKA,WRKB)         00042000
*   WORD0=MPSTPTR;                  /* SET FRR PARM WORD 0 TO MPST@  */ 00043000
         ST    MPSTPTR,WORD0(,PARREG)                              0224 00044000
*   WORD1=REG1;                     /* SET FRR PARM WORD 1 TO PAB@   */ 00045000
         ST    REG1,WORD1(,PARREG)                                 0225 00046000
*   PABMPSTA=(REG1-(REG1->PABOFFST))/* FIND PABS MPST        @ZM32636*/ 00047000
*       ->DYPTSKID                  /* VIA MAJCB TSKID       @ZM32636*/ 00048000
*       ->PSTMPSTP;                 /* MPST FOR THIS PABS PST      0226 00049000
*                                                            @ZM32636*/ 00050000
         LR    @10,REG1                                            0226 00051000
         SLR   @08,@08                                             0226 00052000
         IC    @08,PABOFFST(,REG1)                                 0226 00053000
         SLR   @10,@08                                             0226 00054000
         L     @10,DYPTSKID(,@10)                                  0226 00055000
         L     PABMPSTA,PSTMPSTP(,@10)                             0226 00056000
*   IF PABMPSTA^=MPSTPTR            /* IF PAB NOW IN WRONG MEMORY  0227 00057000
*                                                            @ZM32636*/ 00058000
*     THEN                          /* SWITCH TO CORRECT MEMORY    0227 00059000
*                                                            @ZM32636*/ 00060000
         CR    PABMPSTA,MPSTPTR                                    0227 00061000
         BNE   @RT00227                                            0227 00062000
*     GO TO RESCHED;                /* PASS PAB TO ISTAPC32 FOR    0228 00063000
*                                      RESCHED               @ZM32636*/ 00064000
*   RFY                                                            0229 00065000
*    (FRRPREG) UNRSTD;                                             0229 00066000
*                                                                  0229 00067000
*   /*****************************************************************/ 00068000
*   /*                                                               */ 00069000
*   /* OBTAIN CRA - TRY ATCVT CRA QUE FIRST. IF ATCVT CRA QUE IS     */ 00070000
*   /* EMPTY, TRY REQSTORE. IF REQSTORE FAILS REDRIVE PAB VIA APC32  */ 00071000
*   /* AND RETURN TO SYSTEM DISPATCHER                               */ 00072000
*   /*                                                               */ 00073000
*   /*****************************************************************/ 00074000
*                                                                  0230 00075000
*   DO;                             /* LISATCVT                    0230 00076000
*                                      CVTBASE(PAGEABLE,(REG15))     */ 00077000
*     REG15=ATCLCPTR;               /* SET UP ATCVT POINTER          */ 00078000
         L     REG15,ATCLCPTR                                      0231 00079000
*   END;                            /* LISATCVT GET ATCVT PTR      0232 00080000
*                                                            @Z40GKF6*/ 00081000
*   RFY                                                            0233 00082000
*     ISTATCVT BASED(REG15);        /*                       @Z40GKF6*/ 00083000
*   RFY                                                            0234 00084000
*    (NEWCT) RSTD;                                                 0234 00085000
*   CRAREG=ATCCRAQ;                 /* COMP EVEN REG FOR CS  @Z40GKF6*/ 00086000
         L     CRAREG,ATCCRAQ(,REG15)                              0235 00087000
*   OLDCT=ATCCRACN;                 /* COMP ODD REG FOR CS   @Z40GKF6*/ 00088000
         L     OLDCT,ATCCRACN(,REG15)                              0236 00089000
*LOOP1:                                                            0237 00090000
*   IF ATCCRAAC>0                   /* CHECK FOR CRA AVAIL ON MPST 0237 00091000
*                                      CRA Q                 @Z40GKF6*/ 00092000
*     THEN                                                         0237 00093000
LOOP1    CLC   ATCCRAAC(2,REG15),@CH00034                          0237 00094000
         BNH   @RF00237                                            0237 00095000
*     DO;                           /* IF AVAIL SWAP IT OFF          */ 00096000
*       NEWCT=OLDCT-1;              /* DECREASE NUMBER OF CRAS AVAIL */ 00097000
         LR    NEWCT,OLDCT                                         0239 00098000
         BCTR  NEWCT,0                                             0239 00099000
*       NEWCRA=CRAREG->CRACHAIN;    /* POINT TO NEXT AVAIL CRA       */ 00100000
         L     NEWCRA,CRACHAIN(,CRAREG)                            0240 00101000
*       CDS(CRAREG,NEWCRA,ATCCRA);  /* USE CDS               @Z40GKF6*/ 00102000
         CDS   CRAREG,NEWCRA,ATCCRA(REG15)                         0241 00103000
*       BC(7,LOOP1);                /* IF FAIL TRY AGAIN             */ 00104000
         BC    7,LOOP1                                             0242 00105000
*       RFY                                                        0243 00106000
*        (NEWCT) UNRSTD;                                           0243 00107000
*     END;                          /* END - SWAP AVAIL CRA          */ 00108000
*   ELSE                                                           0245 00109000
*     DO;                           /* MPST CRA Q EMPTY - TRY      0245 00110000
*                                      REQSTORE                      */ 00111000
         B     @RC00237                                            0245 00112000
@RF00237 DS    0H                                                  0246 00113000
*       REG13=PARREG;               /* SAVE RETURN ADDR ACROSS     0246 00114000
*                                      REQSTORE              @ZM32636*/ 00115000
*                                                                  0246 00116000
         LR    REG13,PARREG                                        0246 00117000
*       /*************************************************************/ 00118000
*       /*                                                           */ 00119000
*       /* REQSTORE CBID(CRA)SAVE(NO)CLEAR(NO)                       */ 00120000
*       /*                                                           */ 00121000
*       /*************************************************************/ 00122000
*                                                                  0247 00123000
*       DO;                                                        0247 00124000
*                                                                  0247 00125000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */ 00126000
*/* END OF ATBUILD                                                   */ 00127000
*                                                                  0248 00128000
*         DCL                                                      0248 00129000
*           GPR01F FIXED(31) REG(01);                              0248 00130000
*         DCL                                                      0249 00131000
*           GPR01P PTR(31) REG(01);                                0249 00132000
*         DCL                                                      0250 00133000
*           GPR02F FIXED(31) REG(02);                              0250 00134000
*         DCL                                                      0251 00135000
*           GPR02P PTR(31) REG(02);                                0251 00136000
*         DCL                                                      0252 00137000
*           GPR03F FIXED(31) REG(03);                              0252 00138000
*         DCL                                                      0253 00139000
*           GPR03P PTR(31) REG(03);                                0253 00140000
*         DCL                                                      0254 00141000
*           GPR04F FIXED(31) REG(04);                              0254 00142000
*         DCL                                                      0255 00143000
*           GPR04P PTR(31) REG(04);                                0255 00144000
*         DCL                                                      0256 00145000
*           GPR05F FIXED(31) REG(05);                              0256 00146000
*         DCL                                                      0257 00147000
*           GPR05P PTR(31) REG(05);                                0257 00148000
*         DCL                                                      0258 00149000
*           GPR06F FIXED(31) REG(06);                              0258 00150000
*         DCL                                                      0259 00151000
*           GPR06P PTR(31) REG(06);                                0259 00152000
*         DCL                                                      0260 00153000
*           GPR07F FIXED(31) REG(07);                              0260 00154000
*         DCL                                                      0261 00155000
*           GPR07P PTR(31) REG(07);                                0261 00156000
*         DCL                                                      0262 00157000
*           GPR08F FIXED(31) REG(08);                              0262 00158000
*         DCL                                                      0263 00159000
*           GPR08P PTR(31) REG(08);                                0263 00160000
*         DCL                                                      0264 00161000
*           GPR09F FIXED(31) REG(09);                              0264 00162000
*         DCL                                                      0265 00163000
*           GPR09P PTR(31) REG(09);                                0265 00164000
*         DCL                                                      0266 00165000
*           GPR10F FIXED(31) REG(10);                              0266 00166000
*         DCL                                                      0267 00167000
*           GPR10P PTR(31) REG(10);                                0267 00168000
*         DCL                                                      0268 00169000
*           GPR11F FIXED(31) REG(11);                              0268 00170000
*         DCL                                                      0269 00171000
*           GPR11P PTR(31) REG(11);                                0269 00172000
*         DCL                                                      0270 00173000
*           GPR12F FIXED(31) REG(12);                              0270 00174000
*         DCL                                                      0271 00175000
*           GPR12P PTR(31) REG(12);                                0271 00176000
*         DCL                                                      0272 00177000
*           GPR13F FIXED(31) REG(13);                              0272 00178000
*         DCL                                                      0273 00179000
*           GPR13P PTR(31) REG(13);                                0273 00180000
*         DCL                                                      0274 00181000
*           GPR15F FIXED(31) REG(15);                              0274 00182000
*         DCL                                                      0275 00183000
*           GPR15P PTR(31) REG(15);                                0275 00184000
*         RFY                                                      0276 00185000
*          (GPR02P,                                                0276 00186000
*           GPR03P,                                                0276 00187000
*           GPR04P,                                                0276 00188000
*           GPR15P) RSTD;                                          0276 00189000
*         DO;                       /* LISATCVT                    0277 00190000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00191000
*           GPR15P=ATCLCPTR;        /* SET UP ATCVT POINTER          */ 00192000
         L     GPR15P,ATCLCPTR                                     0278 00193000
*         END;                      /* LISATCVT                      */ 00194000
*         GPR02P=GPR15P->ATCBPDA|'80000000'X;                      0280 00195000
         L     GPR02P,ATCBPDA(,GPR15P)                             0280 00196000
         O     GPR02P,@CF01248                                     0280 00197000
*         DCL                                                      0281 00198000
*           1 FMZA0013 FIXED(31) STATIC LOCAL,                     0281 00199000
*            2 * FIXED(8) INIT(16),                                0281 00200000
*            2 * PTR(24) INIT(0);                                  0281 00201000
*         GPR03F=FMZA0013;                                         0282 00202000
         L     GPR03F,FMZA0013                                     0282 00203000
*         GPR04F=23;                                               0283 00204000
         LA    GPR04F,23                                           0283 00205000
*         GPR15P=GPR15P->ATCSMRQ;                                  0284 00206000
         L     GPR15P,ATCSMRQ(,GPR15P)                             0284 00207000
*         DCL                                                      0285 00208000
*           FMZL0013 BASED(GPR15P) LABEL VALUERANGE(*);            0285 00209000
*         CALL FMZL0013;                                           0286 00210000
         BALR  @14,@15                                             0286 00211000
*         RFY                                                      0287 00212000
*          (GPR02P,                                                0287 00213000
*           GPR03P,                                                0287 00214000
*           GPR04P,                                                0287 00215000
*           GPR15P) UNRSTD;                                        0287 00216000
*       END;                        /* ******** END OF REQSTORE    0288 00217000
*                                      EXPANSION                     */ 00218000
*       IF REG15>4                  /* CHECK RETURN CODE FROM      0289 00219000
*                                      REQSTORE                      */ 00220000
*         THEN                                                     0289 00221000
         C     REG15,@CF00044                                      0289 00222000
         BNH   @RF00289                                            0289 00223000
*         DO;                       /* REQSTORE FAILED - NO CRA AVAIL   00224000
*                                      ANYWHERE                      */ 00225000
*           PARREG=REG13;           /*                       @ZM32636*/ 00226000
         LR    PARREG,REG13                                        0291 00227000
*RESCHED:                                                          0292 00228000
*           REG0=0;                 /* INIT FOR APC32        @ZM32636*/ 00229000
RESCHED  SLR   REG0,REG0                                           0292 00230000
*           PABREG=REG1;            /* ADDR OF PAB IN REG5 FOR     0293 00231000
*                                      ISTAPC32                      */ 00232000
         LR    PABREG,REG1                                         0293 00233000
*           DO;                     /* LISATCVT                    0294 00234000
*                                      CVTBASE(PAGEABLE,(REG15))     */ 00235000
*             REG15=ATCLCPTR;       /* SET UP ATCVT POINTER          */ 00236000
         L     REG15,ATCLCPTR                                      0295 00237000
*           END;                    /* LISATCVT                      */ 00238000
*           WORD1=REG0;             /*                       @ZM32636*/ 00239000
         ST    REG0,WORD1(,PARREG)                                 0297 00240000
*           CALL REG15->ATCAP32;    /* CALL ISTAPC32 TO QUE PAB ON 0298 00241000
*                                      MPST RDY Q                    */ 00242000
         L     @10,ATCAP32(,REG15)                                 0298 00243000
         LR    @15,@10                                             0298 00244000
         BALR  @14,@15                                             0298 00245000
*           REG14=CVTSRBRT;         /* RESTORE RTN           @ZM32636*/ 00246000
*                                                                  0299 00247000
         L     @10,CVTPTR                                          0299 00248000
         L     REG14,CVTSRBRT(,@10)                                0299 00249000
*           /*********************************************************/ 00250000
*           /*                                                       */ 00251000
*           /* REMOVE ERROR RECOVERY                                 */ 00252000
*           /*                                                       */ 00253000
*           /*********************************************************/ 00254000
*                                                                  0300 00255000
*           GENERATE REFS(WRKA,WRKB,PSACSTK,PSA,FRRSCURR,FRRSEMP,FRRS,  00256000
*               FRRSLAST,FRRSELEN,FRRSFRRA,FRRSENTR,FRRSPARM);     0300 00257000
   SETFRR D,WRKREGS=(WRKA,WRKB)                                         00258000
*           RETURN;                 /* RETURN TO SRB DISPATCHER      */ 00259000
@EL00001 DS    0H                                                  0301 00260000
@EF00001 DS    0H                                                  0301 00261000
@ER00001 BR    @14                                                 0301 00262000
*         END;                      /* END - NO CRA AVAILABLE ANY  0302 00263000
*                                      WHERE                         */ 00264000
*       ELSE                        /* USE REQSTORED CRA             */ 00265000
*         CRAREG=REG3;              /* REG 3 CONTAINS ADDR OF CRA    */ 00266000
@RF00289 LR    CRAREG,REG3                                         0303 00267000
*     END;                          /* END - TRY REQSTORE CRA        */ 00268000
*                                                                  0304 00269000
*   /*****************************************************************/ 00270000
*   /*                                                               */ 00271000
*   /* INITIALIZE CRA - RPH - CRR CRAREG POINTS TO A FRESH AVAILABLE */ 00272000
*   /* CRA                                                           */ 00273000
*   /*                                                               */ 00274000
*   /*****************************************************************/ 00275000
*                                                                  0305 00276000
*   PABREG=REG1;                    /* GET PAB ADDR OUT OF REG 1     */ 00277000
@RC00237 LR    PABREG,REG1                                         0305 00278000
*   CRACRR=ADDR(CRAPSS);            /* POINT CRA TO PSS CRR          */ 00279000
         LA    @10,CRAPSS(,CRAREG)                                 0306 00280000
         ST    @10,CRACRR(,CRAREG)                                 0306 00281000
*   CRALKACT=0;                     /* CLEAR ACTIVE LOCKS            */ 00282000
         SLR   @07,@07                                             0307 00283000
         ST    @07,CRALKACT(,CRAREG)                               0307 00284000
*   RPHREG=ADDR(CRARPH);            /* POINT TO RPH                  */ 00285000
         LA    RPHREG,CRARPH(,CRAREG)                              0308 00286000
*   CRARPH=CRARPH&&CRARPH;          /* CLEAR THE RPH                 */ 00287000
         XC    CRARPH(108,CRAREG),CRARPH(CRAREG)                   0309 00288000
*   RPHCRR=CRAREG;                  /* CONNECT RPH TO CRA            */ 00289000
         ST    CRAREG,RPHCRR(,RPHREG)                              0310 00290000
*   CRRREG=ADDR(CRAPSS);            /* LOAD CRR POINTER              */ 00291000
         LR    CRRREG,@10                                          0311 00292000
*   APCPSTA=(PABREG-PABOFFST)->DYPTSKID;/* FILL IN PST PTR IN CRR    */ 00293000
         SLR   @10,@10                                             0312 00294000
         IC    @10,PABOFFST(,PABREG)                               0312 00295000
         LR    @02,PABREG                                          0312 00296000
         SLR   @02,@10                                             0312 00297000
         L     @09,DYPTSKID(,@02)                                  0312 00298000
         ST    @09,APCPSTA(,CRRREG)                                0312 00299000
*   RPHTSKID=(PABREG-PABOFFST)->DYPTSKID;/* FILL IN PST PTR IN RPH   */ 00300000
         ST    @09,RPHTSKID(,RPHREG)                               0313 00301000
*   APCRTRN=CVTSRBRT;               /* FILL IN SRB RETURN ADDR FROM     00302000
*                                      CVT                   @ZM32636*/ 00303000
         L     @08,CVTPTR                                          0314 00304000
         L     @08,CVTSRBRT(,@08)                                  0314 00305000
         ST    @08,APCRTRN(,CRRREG)                                0314 00306000
*   APCRFLG=0;                      /* CLEAR RUNNING FLAGS           */ 00307000
         STH   @07,APCRFLG(,CRRREG)                                0315 00308000
*   APCATFLG=0;                     /* CLEAR ACTIVE FLAGS            */ 00309000
         STH   @07,APCATFLG(,CRRREG)                               0316 00310000
*   APCCOMF=0;                      /* CLEAR COMMUNICATION FLAGS     */ 00311000
         ST    @07,APCCOMF(,CRRREG)                                0317 00312000
*   APCHDRSV=APCHDRSV&&APCHDRSV;    /* CLEAR CRR HDR                 */ 00313000
         XC    APCHDRSV(16,CRRREG),APCHDRSV(CRRREG)                0318 00314000
*   RPHTYPE=RPTYPE;                 /* RPH IS AN RPH                 */ 00315000
         MVI   RPHTYPE(RPHREG),X'01'                               0319 00316000
*   RPHLNGTH=LENGTH(ISTRPH);        /* THATS HOW LONG IT IS          */ 00317000
         MVI   RPHLNGTH(RPHREG),X'6C'                              0320 00318000
*   RPHDVTA=PABDVTA;                /* CONNECT RPH TO THE DVT        */ 00319000
         L     @07,PABDVTA-1(,PABREG)                              0321 00320000
         LA    @07,0(,@07)                                         0321 00321000
         ST    @07,RPHDVTA(,RPHREG)                                0321 00322000
*   RPHPABOF=PABOFFST;              /* FILL IN OFF SET INTO MAJCB    */ 00323000
         STC   @10,RPHPABOF(,RPHREG)                               0322 00324000
*   RPHMAJCB=(PABREG-PABOFFST);     /* POINT RPH TO MAJCB            */ 00325000
         STCM  @02,7,RPHMAJCB(RPHREG)                              0323 00326000
*   PABRPHA=RPHREG;                 /* CONNECT PAB TO RPH            */ 00327000
         STCM  RPHREG,7,PABRPHA(PABREG)                            0324 00328000
*/*SMSID  BUFF(CRAREG)TSKID(APCPSTA)                                 */ 00329000
*                                                                  0325 00330000
*   DO;                                                            0325 00331000
*     DCL                                                          0326 00332000
*       1 CMZ0033A PTR(31) BASED((CRAREG)-8),                      0326 00333000
*        2 * BIT(8),                                               0326 00334000
*        2 CMZ0033 PTR(24);                                        0326 00335000
*     CMZ0033=(APCPSTA);                                           0327 00336000
         LR    @10,CRAREG                                          0327 00337000
         AL    @10,@CF02928                                        0327 00338000
         STCM  @09,7,CMZ0033-1(@10)                                0327 00339000
*   END;                            /* SMSID PUT TSKID IN PFX      0328 00340000
*                                                            @Z40GKF6*/ 00341000
*                                                                  0328 00342000
*   /*****************************************************************/ 00343000
*   /*                                                               */ 00344000
*   /* REPLACE ERROR RECOVERY                                        */ 00345000
*   /*                                                               */ 00346000
*   /*****************************************************************/ 00347000
*                                                                  0329 00348000
*   RFY                                                            0329 00349000
*    (FRRPREG) RSTD;                                               0329 00350000
*   DO;                             /* LISATCVT                    0330 00351000
*                                      CVTBASE(PAGEABLE,(REG15))     */ 00352000
*     REG15=ATCLCPTR;               /* SET UP ATCVT POINTER          */ 00353000
         L     REG15,ATCLCPTR                                      0331 00354000
*   END;                            /* LISATCVT                      */ 00355000
*   FRRPREG=REG15->ATCAP62;         /* ISTAPC62 COVERS THE PROCESS   */ 00356000
         L     FRRPREG,ATCAP62(,REG15)                             0333 00357000
*   GENERATE REFS(FRRPREG,PARREG,WRKA,WRKB,PSACSTK,PSA,FRRSCURR,FRRS,   00358000
*       FRRSLAST,FRRSELEN,FRRSFRRA,FRRSENTR,FRRSPARM,FRRSEMP);     0334 00359000
   SETFRR R,FRRAD=(FRRPREG),PARMAD=(PARREG),WRKREGS=(WRKA,WRKB)         00360000
*   APCFRRPM=PARREG;                /* POINT CRR TO FRR PARM AREA    */ 00361000
         ST    PARREG,APCFRRPM(,CRRREG)                            0335 00362000
*   WORD0=CRAREG;                   /* FILL IN PARM WORD 0           */ 00363000
         ST    CRAREG,WORD0(,PARREG)                               0336 00364000
*   OTHWRDS=OTHWRDS&&OTHWRDS;       /* CLEAR ALL OTHERS              */ 00365000
         XC    OTHWRDS(20,PARREG),OTHWRDS(PARREG)                  0337 00366000
*   RFY                                                            0338 00367000
*    (FRRPREG) UNRSTD;                                             0338 00368000
*                                                                  0338 00369000
*   /*****************************************************************/ 00370000
*   /*                                                               */ 00371000
*   /* HANDLE WORK ELEMENT ON PAB - DEQUE/FIND                       */ 00372000
*   /*                                                               */ 00373000
*   /*****************************************************************/ 00374000
*                                                                  0339 00375000
*   IF PABNODQ=ON                   /* DOES REQUESTOR WANT WORK    0339 00376000
*                                      ELEMENT DEQUED?               */ 00377000
*     THEN                                                         0339 00378000
         TM    PABNODQ(PABREG),B'00000001'                         0339 00379000
         BNO   @RF00339                                            0339 00380000
*     DO;                           /* NO - THEN JUST FIND IT FOR HIM*/ 00381000
*/* TPFEL (,PABWEQA) RETPTR(RPHWEA)                                  */ 00382000
*                                                                  0341 00383000
*       DO;                         /* BEGIN TPFEL CODE GENERATION   */ 00384000
*         DCL                                                      0342 00385000
*           FMZCA039 BIT(32) CONSTANT('80000000'X);                0342 00386000
*         DCL                                                      0343 00387000
*           FMZCB039 BIT(32) CONSTANT('7FFFFFFF'X);                0343 00388000
*         DCL                                                      0344 00389000
*           GPR00F FIXED(31) REG(00);                              0344 00390000
*         DCL                                                      0345 00391000
*           GPR00P PTR(31) REG(00);                                0345 00392000
*         DCL                                                      0346 00393000
*           GPR14F FIXED(31) REG(14);                              0346 00394000
*         DCL                                                      0347 00395000
*           GPR14P PTR(31) REG(14);                                0347 00396000
*         RFY                                                      0348 00397000
*          (GPR00P,                                                0348 00398000
*           GPR01P,                                                0348 00399000
*           GPR14P,                                                0348 00400000
*           GPR15P) RSTD;                                          0348 00401000
*         RFY                                                      0349 00402000
*           ISTWKE;                                                0349 00403000
*         GPR15P=ADDR(PABWEQA);     /* ADDRESS QUEUE POINTER         */ 00404000
         LR    GPR15P,PABREG                                       0350 00405000
*         GPR14P=GPR15P->PABWEQA|FMZCA039;                         0351 00406000
         L     @10,@CF01248                                        0351 00407000
         L     GPR14P,PABWEQA(,GPR15P)                             0351 00408000
         OR    GPR14P,@10                                          0351 00409000
*         IF GPR14P=FMZCA039 THEN                                  0352 00410000
         CLR   GPR14P,@10                                          0352 00411000
         BE    @RT00352                                            0352 00412000
*           ;                                                      0353 00413000
*         ELSE                                                     0354 00414000
*           DO;                                                    0354 00415000
*             GPR00P=FMZCA039;      /* INITIALIZE QUIT FLAG          */ 00416000
         L     GPR00P,@CF01248                                     0355 00417000
*             DO WHILE(GPR00P^=GPR14P->WKECHAIN);                  0356 00418000
         B     @DE00356                                            0356 00419000
@DL00356 DS    0H                                                  0357 00420000
*               GPR14P=GPR14P->WKECHAIN;/* SEARCH FOR END OF CHAIN   */ 00421000
         L     GPR14P,WKECHAIN(,GPR14P)                            0357 00422000
*             END;                                                 0358 00423000
@DE00356 C     GPR00P,WKECHAIN(,GPR14P)                            0358 00424000
         BNE   @DL00356                                            0358 00425000
*           END;                                                   0359 00426000
*         GPR14P=GPR14P&FMZCB039;                                  0360 00427000
@RT00352 N     GPR14P,@CF01246                                     0360 00428000
*         RPHWEA=GPR14P;                                           0361 00429000
         ST    GPR14P,RPHWEA(,RPHREG)                              0361 00430000
*         RFY                                                      0362 00431000
*          (GPR00P,                                                0362 00432000
*           GPR01P,                                                0362 00433000
*           GPR14P,                                                0362 00434000
*           GPR15P) UNRSTD;                                        0362 00435000
*       END;                        /* END TPFEL GENERATION          */ 00436000
*     END;                          /* END - FIND WORK ELEMENT       */ 00437000
*   ELSE                                                           0365 00438000
*     DO;                           /* NODQ IS OFF - SO DEQUE WORK 0365 00439000
*                                      ELEMENT                       */ 00440000
         B     @RC00339                                            0365 00441000
@RF00339 DS    0H                                                  0366 00442000
*/* TPDEQ (,PABWEQA) RETPTR(RPHWEA)                                  */ 00443000
*                                                                  0366 00444000
*       DO;                         /* BEGIN TPDEQ CODE GENERATION   */ 00445000
*         RFY                                                      0367 00446000
*          (GPR00P,                                                0367 00447000
*           GPR01P,                                                0367 00448000
*           GPR14P,                                                0367 00449000
*           GPR15P) RSTD;                                          0367 00450000
*         GPR15P=ADDR(PABWEQA);     /* ADDRESS QUEUE POINTER         */ 00451000
         LR    GPR15P,PABREG                                       0368 00452000
*         GPR14P=GPR15P->PABWEQA|FMZCA039;                         0369 00453000
         L     @10,@CF01248                                        0369 00454000
         L     GPR14P,PABWEQA(,GPR15P)                             0369 00455000
         OR    GPR14P,@10                                          0369 00456000
*         IF GPR14P=FMZCA039 THEN                                  0370 00457000
         CLR   GPR14P,@10                                          0370 00458000
         BE    @RT00370                                            0370 00459000
*           ;                                                      0371 00460000
*         ELSE                                                     0372 00461000
*           DO;                                                    0372 00462000
*FMZL1043:                                                         0373 00463000
*             ;                                                    0373 00464000
FMZL1043 DS    0H                                                  0374 00465000
*             DO WHILE(GPR14P->WKECHAIN^=FMZCA039);                0374 00466000
         B     @DE00374                                            0374 00467000
@DL00374 DS    0H                                                  0375 00468000
*               GPR15P=ADDR(GPR14P->WKECHAIN);                     0375 00469000
         LA    GPR15P,WKECHAIN(,GPR14P)                            0375 00470000
*               GPR14P=GPR15P->PABWEQA;                            0376 00471000
         L     GPR14P,PABWEQA(,GPR15P)                             0376 00472000
*             END;                                                 0377 00473000
@DE00374 L     @10,@CF01248                                        0377 00474000
         CL    @10,WKECHAIN(,GPR14P)                               0377 00475000
         BNE   @DL00374                                            0377 00476000
*             GPR00P=FMZCA039;                                     0378 00477000
         LR    GPR00P,@10                                          0378 00478000
*             CS(GPR14P,GPR00P,GPR15P->PABWEQA);                   0379 00479000
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0379 00480000
*             BC(7,FMZL1043);                                      0380 00481000
         BC    7,FMZL1043                                          0380 00482000
*             GPR14P->WKECHAIN=0;                                  0381 00483000
         SLR   @10,@10                                             0381 00484000
         ST    @10,WKECHAIN(,GPR14P)                               0381 00485000
*           END;                                                   0382 00486000
*ISTA0043:                                                         0383 00487000
*         ;                                                        0383 00488000
@RT00370 DS    0H                                                  0383 00489000
ISTA0043 DS    0H                                                  0384 00490000
*         GPR14P=GPR14P&FMZCB039;                                  0384 00491000
         N     GPR14P,@CF01246                                     0384 00492000
*         RPHWEA=GPR14P;                                           0385 00493000
         ST    GPR14P,RPHWEA(,RPHREG)                              0385 00494000
*         RFY                                                      0386 00495000
*          (GPR00P,                                                0386 00496000
*           GPR01P,                                                0386 00497000
*           GPR14P,                                                0386 00498000
*           GPR15P) UNRSTD;                                        0386 00499000
*       END;                        /* END TPDEQ GENERATION          */ 00500000
*     END;                          /* END - DEQUE WORK ELEMENT      */ 00501000
*                                                                  0388 00502000
*   /*****************************************************************/ 00503000
*   /*                                                               */ 00504000
*   /* MODE SET TO VTAM KEY AND ESCAPE                               */ 00505000
*   /*                                                               */ 00506000
*   /*****************************************************************/ 00507000
*                                                                  0389 00508000
*   GEN(MODESET EXTKEY=VTAM);                                      0389 00509000
@RC00339 DS    0H                                                  0389 00510000
         MODESET EXTKEY=VTAM                                            00511000
*   REG15=DVTPROC;                  /* LOAD R15 WITH ADDRESS OF    0390 00512000
*                                      PROCESS TO BE BRANCHED TO   0390 00513000
*                                                            @Z404204*/ 00514000
         L     @10,RPHDVTA(,RPHREG)                                0390 00515000
         L     REG15,DVTPROC(,@10)                                 0390 00516000
*   RPHDVTA=RPHDVTA+4;              /* UPDATE DVT PTR TO POINT TO  0391 00517000
*                                      NEXT ENTRY IN DVT     @Z404204*/ 00518000
         AL    @10,@CF00044                                        0391 00519000
         ST    @10,RPHDVTA(,RPHREG)                                0391 00520000
*   CALL REG15;                     /* BRANCH DIRECTLY TO PROCESS  0392 00521000
*                                                            @Z404204*/ 00522000
         BALR  @14,@15                                             0392 00523000
*/* TPEPILOG                                                         */ 00524000
*                                                                  0393 00525000
*   GEN(PRINT OFF);                                                0393 00526000
         PRINT OFF                                                      00527000
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    0394 00528000
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           0394 00529000
*        2  * CHAR(4),                 /* SPACE                       * 00530000
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               * 00531000
*           3 WKEFLAGS BIT(8),         /* FLAGS                       * 00532000
*             4 WKEGATE  BIT(1),       /* GATE BIT                    * 00533000
*             4 *        BIT(7),       /* RESERVED                    * 00534000
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 * 00535000
*   GEN(PRINT ON);                                                 0395 00536000
*                                                                  0395 00537000
         PRINT ON                                                       00538000
*/* END OF TPEPILOG                                                  */ 00539000
*                                                                  0396 00540000
*   END ISTAPC59                    /* THATS ALL - AND WASNT THAT  0396 00541000
*                                      FAST                          */ 00542000
*                                                                  0396 00543000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00544000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00545000
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */ 00546000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00547000
*/*%INCLUDE SYSLIB  (IHAASXB )                                       */ 00548000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00549000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00550000
*                                                                  0396 00551000
*       ;                                                          0396 00552000
         B     @EL00001                                            0396 00553000
@DATA    DS    0H                                                       00554000
@CH00034 DC    H'0'                                                     00555000
@DATD    DSECT                                                          00556000
         DS    0F                                                       00557000
ISTAPC59 CSECT                                                          00558000
         DS    0F                                                       00559000
@CF00044 DC    F'4'                                                     00560000
@CF02928 DC    F'-7'                                                    00561000
@CF01246 DC    XL4'7FFFFFFF'                                            00562000
@CF01248 DC    XL4'80000000'                                            00563000
@DATD    DSECT                                                          00564000
         DS    0D                                                       00565000
FRRSPTR  DS    A                                                        00566000
FRREPTR  DS    A                                                        00567000
ASCBPTR  DS    A                                                        00568000
ASXBPTR  DS    A                                                        00569000
SRBPTR   DS    A                                                        00570000
LCPBPTR  DS    A                                                        00571000
WKEPTR   DS    A                                                        00572000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00573000
@ENDDATD EQU   *                                                        00574000
ISTAPC59 CSECT                                                          00575000
         DS    0F                                                       00576000
@SIZDATD DC    AL1(0)                                                   00577000
         DC    AL3(@ENDDATD-@DATD)                                      00578000
         DS    0D                                                       00579000
FMZA0013 DS    FL4                                                      00580000
         ORG   FMZA0013                                                 00581000
@NM00061 DC    AL1(16)                                                  00582000
@NM00062 DC    AL3(0)                                                   00583000
         ORG   FMZA0013+4                                               00584000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00585000
@01      EQU   01                                                       00586000
@02      EQU   02                                                       00587000
@03      EQU   03                                                       00588000
@04      EQU   04                                                       00589000
@05      EQU   05                                                       00590000
@06      EQU   06                                                       00591000
@07      EQU   07                                                       00592000
@08      EQU   08                                                       00593000
@09      EQU   09                                                       00594000
@10      EQU   10                                                       00595000
@11      EQU   11                                                       00596000
@12      EQU   12                                                       00597000
@13      EQU   13                                                       00598000
@14      EQU   14                                                       00599000
@15      EQU   15                                                       00600000
RPHPTR   EQU   @01                                                      00601000
SRBREG   EQU   @00                                                      00602000
REG0     EQU   @00                                                      00603000
REG1     EQU   @01                                                      00604000
RPHREG   EQU   @01                                                      00605000
REG3     EQU   @03                                                      00606000
PARREG   EQU   @03                                                      00607000
CRAREG   EQU   @04                                                      00608000
PABMPSTA EQU   @04                                                      00609000
OLDCT    EQU   @05                                                      00610000
PABREG   EQU   @05                                                      00611000
WRKA     EQU   @07                                                      00612000
NEWCRA   EQU   @06                                                      00613000
WRKB     EQU   @06                                                      00614000
NEWCT    EQU   @07                                                      00615000
FRRPREG  EQU   @09                                                      00616000
MPSTPTR  EQU   @11                                                      00617000
REG12    EQU   @12                                                      00618000
REG13    EQU   @13                                                      00619000
CRRREG   EQU   @13                                                      00620000
REG14    EQU   @14                                                      00621000
REG15    EQU   @15                                                      00622000
GPR01P   EQU   @01                                                      00623000
GPR02P   EQU   @02                                                      00624000
GPR03F   EQU   @03                                                      00625000
GPR03P   EQU   @03                                                      00626000
GPR04F   EQU   @04                                                      00627000
GPR04P   EQU   @04                                                      00628000
GPR15P   EQU   @15                                                      00629000
GPR00P   EQU   @00                                                      00630000
GPR14P   EQU   @14                                                      00631000
GPR00F   EQU   @00                                                      00632000
GPR01F   EQU   @01                                                      00633000
GPR02F   EQU   @02                                                      00634000
GPR05F   EQU   @05                                                      00635000
GPR05P   EQU   @05                                                      00636000
GPR06F   EQU   @06                                                      00637000
GPR06P   EQU   @06                                                      00638000
GPR07F   EQU   @07                                                      00639000
GPR07P   EQU   @07                                                      00640000
GPR08F   EQU   @08                                                      00641000
GPR08P   EQU   @08                                                      00642000
GPR09F   EQU   @09                                                      00643000
GPR09P   EQU   @09                                                      00644000
GPR10F   EQU   @10                                                      00645000
GPR10P   EQU   @10                                                      00646000
GPR11F   EQU   @11                                                      00647000
GPR11P   EQU   @11                                                      00648000
GPR12F   EQU   @12                                                      00649000
GPR12P   EQU   @12                                                      00650000
GPR13F   EQU   @13                                                      00651000
GPR13P   EQU   @13                                                      00652000
GPR14F   EQU   @14                                                      00653000
GPR15F   EQU   @15                                                      00654000
PSA      EQU   0                                                        00655000
FLCRNPSW EQU   PSA                                                      00656000
FLCROPSW EQU   PSA+8                                                    00657000
FLCICCW2 EQU   PSA+16                                                   00658000
PSAEEPSW EQU   PSA+132                                                  00659000
PSAESPSW EQU   PSA+136                                                  00660000
FLCSVILC EQU   PSAESPSW+1                                               00661000
PSAEPPSW EQU   PSA+140                                                  00662000
FLCPIILC EQU   PSAEPPSW+1                                               00663000
FLCPICOD EQU   PSAEPPSW+2                                               00664000
PSAPICOD EQU   FLCPICOD+1                                               00665000
FLCTEA   EQU   PSAEPPSW+4                                               00666000
FLCPER   EQU   PSA+152                                                  00667000
FLCMCLA  EQU   PSA+168                                                  00668000
FLCIOEL  EQU   FLCMCLA+4                                                00669000
FLCIOA   EQU   FLCMCLA+16                                               00670000
FLCFSA   EQU   FLCMCLA+80                                               00671000
PSAAOLD  EQU   PSA+548                                                  00672000
PSASUPER EQU   PSA+552                                                  00673000
PSASUP1  EQU   PSASUPER                                                 00674000
PSASUP2  EQU   PSASUPER+1                                               00675000
PSASUP3  EQU   PSASUPER+2                                               00676000
PSASUP4  EQU   PSASUPER+3                                               00677000
PSACLHT  EQU   PSA+640                                                  00678000
PSALKSA  EQU   PSA+696                                                  00679000
PSAHLHI  EQU   PSA+760                                                  00680000
PSADSSFL EQU   PSA+836                                                  00681000
PSADSSF1 EQU   PSADSSFL                                                 00682000
PSADSSF3 EQU   PSADSSFL+2                                               00683000
PSADSSF4 EQU   PSADSSFL+3                                               00684000
PSARSVT  EQU   PSA+896                                                  00685000
PSALSFCC EQU   PSA+1012                                                 00686000
CVTPTR   EQU   16                                                       00687000
ATCLCPTR EQU   1032                                                     00688000
FRRS     EQU   0                                                        00689000
FRRSHEAD EQU   FRRS                                                     00690000
FRRSEMP  EQU   FRRSHEAD                                                 00691000
FRRSLAST EQU   FRRSHEAD+4                                               00692000
FRRSELEN EQU   FRRSHEAD+8                                               00693000
FRRSCURR EQU   FRRSHEAD+12                                              00694000
FRRSENTR EQU   0                                                        00695000
FRRSFRRA EQU   FRRSENTR                                                 00696000
FRRSFLGS EQU   FRRSENTR+4                                               00697000
FRRSFLG1 EQU   FRRSFLGS                                                 00698000
FRRSPARM EQU   FRRSENTR+8                                               00699000
ASCB     EQU   0                                                        00700000
ASCBSUPC EQU   ASCB+16                                                  00701000
ASCBFW1  EQU   ASCB+100                                                 00702000
ASCBRCTF EQU   ASCBFW1+2                                                00703000
ASCBFLG1 EQU   ASCBFW1+3                                                00704000
ASCBASXB EQU   ASCB+108                                                 00705000
ASCBDSP1 EQU   ASCB+114                                                 00706000
ASCBFLG2 EQU   ASCB+115                                                 00707000
ASCBLKGP EQU   ASCB+128                                                 00708000
ASCBSRQ  EQU   ASCB+180                                                 00709000
ASCBSRQ1 EQU   ASCBSRQ                                                  00710000
ASCBSRQ2 EQU   ASCBSRQ+1                                                00711000
ASCBSRQ3 EQU   ASCBSRQ+2                                                00712000
ASCBSRQ4 EQU   ASCBSRQ+3                                                00713000
ASXB     EQU   0                                                        00714000
ASXBMPST EQU   ASXB+16                                                  00715000
ASXBAEQ  EQU   ASXB+168                                                 00716000
ASXBCASW EQU   ASXB+216                                                 00717000
ASXBCRB1 EQU   ASXBCASW                                                 00718000
SRBSECT  EQU   0                                                        00719000
SRBFLC   EQU   SRBSECT+12                                               00720000
CVTMAP   EQU   0                                                        00721000
CVTDAR   EQU   CVTMAP+72                                                00722000
CVTFLGS1 EQU   CVTDAR                                                   00723000
CVTDCB   EQU   CVTMAP+116                                               00724000
CVTIERLC EQU   CVTMAP+144                                               00725000
CVTOPTA  EQU   CVTMAP+182                                               00726000
CVTOPTB  EQU   CVTMAP+183                                               00727000
CVTGTF   EQU   CVTMAP+236                                               00728000
CVTGTFST EQU   CVTGTF                                                   00729000
CVTGTFS  EQU   CVTGTFST                                                 00730000
CVTSTATE EQU   CVTGTFST                                                 00731000
CVTTMODE EQU   CVTGTFST                                                 00732000
CVTFORM  EQU   CVTGTFST                                                 00733000
CVTAQAVT EQU   CVTMAP+240                                               00734000
CVTTCMFG EQU   CVTAQAVT                                                 00735000
CVTVOLM2 EQU   CVTMAP+244                                               00736000
CVTTATA  EQU   CVTVOLM2                                                 00737000
CVTTSKS  EQU   CVTTATA                                                  00738000
CVTVOLF2 EQU   CVTTSKS                                                  00739000
CVTTAT   EQU   CVTTATA+1                                                00740000
CVTATER  EQU   CVTMAP+248                                               00741000
CVTEXT1  EQU   CVTMAP+252                                               00742000
CVTPURG  EQU   CVTMAP+260                                               00743000
CVTQMSG  EQU   CVTMAP+268                                               00744000
CVTDMSR  EQU   CVTMAP+272                                               00745000
CVTRSV37 EQU   CVTDMSR                                                  00746000
CVTDMSRF EQU   CVTRSV37                                                 00747000
CVTERPV  EQU   CVTMAP+316                                               00748000
CVTINTLA EQU   CVTMAP+320                                               00749000
CVTAPF   EQU   CVTMAP+324                                               00750000
CVTEXT2  EQU   CVTMAP+328                                               00751000
CVTHJES  EQU   CVTMAP+332                                               00752000
CVTPGSIA EQU   CVTMAP+348                                               00753000
CVTA1F1  EQU   CVTMAP+356                                               00754000
CVTSYSK  EQU   CVTMAP+357                                               00755000
CVTVOLM1 EQU   CVTMAP+380                                               00756000
CVTVOLF1 EQU   CVTVOLM1                                                 00757000
CVTATMCT EQU   CVTMAP+388                                               00758000
CVTXTNT1 EQU   0                                                        00759000
CVTXTNT2 EQU   0                                                        00760000
CVTDSSV  EQU   CVTXTNT2                                                 00761000
CVTFLGBT EQU   CVTXTNT2+5                                               00762000
CVTQID   EQU   CVTXTNT2+24                                              00763000
CVTSHS   EQU   CVTXTNT2+40                                              00764000
CVTRV400 EQU   CVTXTNT2+52                                              00765000
CVTRV409 EQU   CVTXTNT2+53                                              00766000
CVTATCVT EQU   CVTXTNT2+64                                              00767000
CVTRV429 EQU   CVTXTNT2+84                                              00768000
CVTRV438 EQU   CVTXTNT2+85                                              00769000
CVTRV457 EQU   CVTXTNT2+112                                             00770000
CVTRV466 EQU   CVTXTNT2+113                                             00771000
CVTFIX   EQU   0                                                        00772000
CVTRELNO EQU   CVTFIX+252                                               00773000
ISTPAB   EQU   0                                                        00774000
PABWQCHN EQU   ISTPAB                                                   00775000
PABWEQA  EQU   PABWQCHN                                                 00776000
PABCHAIN EQU   PABWQCHN+4                                               00777000
PABOFFST EQU   ISTPAB+8                                                 00778000
PABDVTA  EQU   ISTPAB+9                                                 00779000
PABRPHFG EQU   ISTPAB+12                                                00780000
PABFLAGS EQU   PABRPHFG                                                 00781000
PABERLCK EQU   PABFLAGS                                                 00782000
PABERRLK EQU   PABERLCK                                                 00783000
PABNODQ  EQU   PABFLAGS                                                 00784000
PABRPHA  EQU   PABRPHFG+1                                               00785000
ISTDYPAB EQU   0                                                        00786000
DYPTSKID EQU   ISTDYPAB+8                                               00787000
ISTRPH   EQU   0                                                        00788000
RPHCNTL  EQU   ISTRPH                                                   00789000
RPHTYPE  EQU   RPHCNTL                                                  00790000
RPHLNGTH EQU   RPHCNTL+1                                                00791000
RPHFLAGS EQU   RPHCNTL+2                                                00792000
RPHAPTYP EQU   RPHFLAGS                                                 00793000
RPHFSTLC EQU   RPHFLAGS                                                 00794000
RPHFLGB  EQU   RPHCNTL+3                                                00795000
RPHRPHA  EQU   ISTRPH+4                                                 00796000
RPHTSKID EQU   ISTRPH+8                                                 00797000
RPHDVTA  EQU   ISTRPH+12                                                00798000
RPHRESMA EQU   ISTRPH+16                                                00799000
RPHWPFLG EQU   RPHRESMA                                                 00800000
RPHPABOF EQU   ISTRPH+20                                                00801000
RPHMAJCB EQU   ISTRPH+21                                                00802000
RPHWEA   EQU   ISTRPH+24                                                00803000
RPHCSPA  EQU   RPHWEA                                                   00804000
RPHSRPRM EQU   ISTRPH+28                                                00805000
RPHCRR   EQU   ISTRPH+32                                                00806000
RPHPABQA EQU   ISTRPH+36                                                00807000
RPHWORK  EQU   ISTRPH+40                                                00808000
RPHSAVE1 EQU   RPHWORK                                                  00809000
RPHSBITS EQU   RPHSAVE1+1                                               00810000
ISTPST   EQU   0                                                        00811000
PSTRQFGA EQU   ISTPST+8                                                 00812000
PSTRQUE  EQU   PSTRQFGA                                                 00813000
PSTFLGA  EQU   PSTRQFGA+4                                               00814000
PSTABINP EQU   PSTFLGA                                                  00815000
PSTMPSTP EQU   ISTPST+20                                                00816000
PSTDMPS  EQU   ISTPST+132                                               00817000
ISTMPST  EQU   0                                                        00818000
MPSRQUE  EQU   ISTMPST+8                                                00819000
MPSFLGA  EQU   ISTMPST+12                                               00820000
MPSCRA   EQU   ISTMPST+24                                               00821000
MPSCRACT EQU   MPSCRA+4                                                 00822000
MPSSRB   EQU   ISTMPST+32                                               00823000
MPSSRBCT EQU   MPSSRB+4                                                 00824000
MPSCRPL  EQU   ISTMPST+40                                               00825000
MPSRPLCT EQU   MPSCRPL+4                                                00826000
ISTLCCW  EQU   0                                                        00827000
LCCWOP   EQU   ISTLCCW                                                  00828000
LCCWRWOP EQU   LCCWOP                                                   00829000
LCCWCTL  EQU   LCCWRWOP                                                 00830000
LCCWFLAG EQU   ISTLCCW+1                                                00831000
LCCWLSI  EQU   LCCWFLAG                                                 00832000
ISTLCPB  EQU   0                                                        00833000
LCPREQTG EQU   ISTLCPB+2                                                00834000
LCPFLAGS EQU   LCPREQTG                                                 00835000
LCPZF001 EQU   LCPFLAGS                                                 00836000
LCPZRT02 EQU   LCPZF001                                                 00837000
LCPZF002 EQU   LCPFLAGS                                                 00838000
LCPZRT03 EQU   LCPZF002                                                 00839000
LCPZF003 EQU   LCPFLAGS                                                 00840000
LCPZRT04 EQU   LCPZF003                                                 00841000
LCPZF004 EQU   LCPFLAGS                                                 00842000
LCPZRT05 EQU   LCPZF004                                                 00843000
LCPZRT06 EQU   LCPFLAGS                                                 00844000
LCPZRT07 EQU   LCPFLAGS                                                 00845000
LCPMNRCD EQU   LCPREQTG+1                                               00846000
LCPZRT08 EQU   LCPMNRCD                                                 00847000
LCPZRT09 EQU   LCPMNRCD                                                 00848000
LCPCHAIN EQU   ISTLCPB+4                                                00849000
LCPCHAI1 EQU   LCPCHAIN                                                 00850000
LCPRUCNT EQU   ISTLCPB+8                                                00851000
LCPFLAG2 EQU   ISTLCPB+9                                                00852000
LCPTLBPI EQU   LCPFLAG2                                                 00853000
LCPFID0  EQU   LCPFLAG2                                                 00854000
LCPSEQ   EQU   ISTLCPB+10                                               00855000
LCPCID   EQU   ISTLCPB+16                                               00856000
LCPFDBA  EQU   ISTLCPB+24                                               00857000
LCPFLG1  EQU   ISTLCPB+37                                               00858000
LCPFLCCW EQU   ISTLCPB+40                                               00859000
LCPLCCW  EQU   ISTLCPB+48                                               00860000
LCPPABA  EQU   LCPLCCW+4                                                00861000
LCPRPHA  EQU   LCPPABA                                                  00862000
ISTZSAVE EQU   0                                                        00863000
ZSAZSVBC EQU   ISTZSAVE                                                 00864000
ZSAZSVMS EQU   ZSAZSVBC                                                 00865000
ISTPFCRR EQU   0                                                        00866000
PFCCRR   EQU   ISTPFCRR                                                 00867000
PFCCRRID EQU   PFCCRR                                                   00868000
PFCCRRLN EQU   PFCCRR+2                                                 00869000
PFCHDR   EQU   ISTPFCRR+4                                               00870000
PFCCRRO  EQU   PFCHDR                                                   00871000
PFCFRRO  EQU   PFCHDR+4                                                 00872000
ISTCFCRR EQU   0                                                        00873000
CFCAUDIT EQU   ISTCFCRR                                                 00874000
CFCNTRD  EQU   CFCAUDIT                                                 00875000
CFCCRT   EQU   CFCAUDIT+1                                               00876000
ISTZCRR  EQU   0                                                        00877000
ZCRCRR   EQU   ISTZCRR                                                  00878000
ZCRFLGS1 EQU   ISTZCRR+12                                               00879000
ZCRFLGS2 EQU   ISTZCRR+13                                               00880000
ZCRSWFLD EQU   ISTZCRR+14                                               00881000
ZCRENDSH EQU   ZCRSWFLD                                                 00882000
ZCRNDLCP EQU   ZCRSWFLD                                                 00883000
ZCRRESET EQU   ZCRSWFLD                                                 00884000
ZCRFLGS3 EQU   ISTZCRR+15                                               00885000
ZCRGENSW EQU   ISTZCRR+16                                               00886000
ZCRPFLGS EQU   ISTZCRR+17                                               00887000
ZCRIBPR  EQU   ISTZCRR+18                                               00888000
ZCRSCPSW EQU   ISTZCRR+19                                               00889000
ZCRPARMS EQU   ISTZCRR+24                                               00890000
ZCRFBPTR EQU   ZCRPARMS                                                 00891000
ZCRDFRDA EQU   ZCRPARMS+10                                              00892000
ZCRPCOD1 EQU   ZCRPARMS+12                                              00893000
ZCRPLSBF EQU   ZCRPCOD1                                                 00894000
ZCRPCOD2 EQU   ZCRPARMS+13                                              00895000
ZCRSVRTN EQU   ISTZCRR+56                                               00896000
ZCRWKARA EQU   ISTZCRR+156                                              00897000
ZCRCIDSV EQU   ISTZCRR+192                                              00898000
ZCRAUDIT EQU   ISTZCRR+440                                              00899000
ZCRENTER EQU   ZCRAUDIT+5                                               00900000
ZCRLCPB  EQU   ISTZCRR+480                                              00901000
ZCRRHRU  EQU   ZCRLCPB                                                  00902000
ISTASCRR EQU   0                                                        00903000
ASCFLAGS EQU   ISTASCRR+16                                              00904000
ASCFLG1  EQU   ASCFLAGS                                                 00905000
ASCFLG2  EQU   ASCFLAGS+2                                               00906000
ASCFLG3  EQU   ASCFLAGS+4                                               00907000
ASCUSRGS EQU   ISTASCRR+28                                              00908000
ISTAPCRR EQU   0                                                        00909000
APCHDRSV EQU   ISTAPCRR                                                 00910000
APCATFLG EQU   ISTAPCRR+16                                              00911000
APCRFLG  EQU   ISTAPCRR+18                                              00912000
APCPSTA  EQU   ISTAPCRR+20                                              00913000
APCRTRN  EQU   ISTAPCRR+28                                              00914000
APCFRRPM EQU   ISTAPCRR+40                                              00915000
APCSAVE  EQU   ISTAPCRR+44                                              00916000
APCCOMF  EQU   ISTAPCRR+116                                             00917000
APCCOMF1 EQU   APCCOMF                                                  00918000
APC31FLG EQU   ISTAPCRR+132                                             00919000
APC52FLG EQU   ISTAPCRR+133                                             00920000
APC53FLG EQU   ISTAPCRR+134                                             00921000
APC54FLG EQU   ISTAPCRR+135                                             00922000
APC57FLG EQU   ISTAPCRR+136                                             00923000
ISTCRA   EQU   0                                                        00924000
CRABASIC EQU   ISTCRA                                                   00925000
CRAHDR   EQU   CRABASIC                                                 00926000
CRACRR   EQU   CRAHDR                                                   00927000
CRALKACT EQU   CRABASIC+8                                               00928000
CRARPH   EQU   ISTCRA+52                                                00929000
CRAPSS   EQU   ISTCRA+160                                               00930000
CRASVC   EQU   ISTCRA+848                                               00931000
CRABUFA  EQU   CRASVC+68                                                00932000
CRACHAIN EQU   ISTCRA+928                                               00933000
ISTLOK   EQU   0                                                        00934000
LOKCHN   EQU   ISTLOK+1                                                 00935000
LOKCHNG  EQU   LOKCHN                                                   00936000
@NM00050 EQU   LOKCHNG+2                                                00937000
ISTATCVT EQU   0                                                        00938000
ATCCOM   EQU   ISTATCVT                                                 00939000
ATCSTAT  EQU   ATCCOM                                                   00940000
ATCSTAT1 EQU   ATCSTAT                                                  00941000
ATCSTFLG EQU   ATCSTAT+1                                                00942000
ATCPOFLG EQU   ATCSTAT+2                                                00943000
ATCSTAT4 EQU   ATCSTAT+3                                                00944000
ATCBPDA  EQU   ATCCOM+128                                               00945000
ATCIOTRC EQU   ATCCOM+140                                               00946000
ATCTHTRC EQU   ATCIOTRC                                                 00947000
ATCSMRQ  EQU   ATCCOM+180                                               00948000
ATCCSMR  EQU   ISTATCVT+296                                             00949000
ATCSHRFG EQU   ISTATCVT+316                                             00950000
ATCHPGM  EQU   ISTATCVT+384                                             00951000
ATCVLCNT EQU   ISTATCVT+772                                             00952000
ATCRNO   EQU   ISTATCVT+788                                             00953000
ATCSOPD  EQU   ISTATCVT+792                                             00954000
ATCSIPD  EQU   ISTATCVT+800                                             00955000
ATCSECST EQU   ISTATCVT+812                                             00956000
ATCSTAT2 EQU   ISTATCVT+818                                             00957000
ATCVTBAM EQU   ISTATCVT+908                                             00958000
@NM00058 EQU   ATCVTBAM+3                                               00959000
ATCAOSM  EQU   ISTATCVT+912                                             00960000
ATCGSRBQ EQU   ATCAOSM+4                                                00961000
ATCGSRBG EQU   ATCGSRBQ                                                 00962000
ATCAP32  EQU   ATCAOSM+28                                               00963000
ATCICAPP EQU   ATCAOSM+100                                              00964000
ATCLDAPP EQU   ATCAOSM+120                                              00965000
ATCDAPVT EQU   ATCAOSM+140                                              00966000
ATCCRA   EQU   ATCAOSM+280                                              00967000
ATCCRAQ  EQU   ATCCRA                                                   00968000
ATCCRACN EQU   ATCCRA+4                                                 00969000
ATCCRAAC EQU   ATCCRACN+2                                               00970000
ATCSRB   EQU   ATCAOSM+288                                              00971000
ATCSRBCN EQU   ATCSRB+4                                                 00972000
ATCCRPL  EQU   ATCAOSM+296                                              00973000
ATCRPLCN EQU   ATCCRPL+4                                                00974000
ATCVTFLG EQU   ATCAOSM+392                                              00975000
ATCAP62  EQU   ATCAOSM+532                                              00976000
ATCAP66  EQU   ATCAOSM+536                                              00977000
ATCZFLAG EQU   ATCAOSM+588                                              00978000
ISTDVT   EQU   0                                                        00979000
DVTHDR   EQU   ISTDVT                                                   00980000
DVTHFGA  EQU   DVTHDR+8                                                 00981000
ISTDVTE  EQU   0                                                        00982000
DVTPROC  EQU   ISTDVTE                                                  00983000
DVTFLAG1 EQU   DVTPROC                                                  00984000
SIXWRDS  EQU   0                                                        00985000
WORD0    EQU   SIXWRDS                                                  00986000
OTHWRDS  EQU   SIXWRDS+4                                                00987000
WORD1    EQU   OTHWRDS                                                  00988000
FMZL0013 EQU   0                                                        00989000
CMZ0033A EQU   0                                                        00990000
CMZ0033  EQU   CMZ0033A+1                                               00991000
ISTWKE   EQU   0                                                        00992000
WKECHAIN EQU   ISTWKE+4                                                 00993000
WKEFLAGS EQU   WKECHAIN                                                 00994000
PSARSVTE EQU   PSARSVT                                                  00995000
PSACSTK  EQU   PSARSVTE                                                 00996000
CVTS01   EQU   CVTPGSIA                                                 00997000
CVTLPDIA EQU   CVTS01+12                                                00998000
CVTDIRST EQU   CVTLPDIA                                                 00999000
CVTSLIDA EQU   CVTS01+24                                                01000000
CVTCTLFG EQU   CVTS01+50                                                01001000
CVTSRBRT EQU   CVTS01+100                                               01002000
CVTRV210 EQU   CVTS01+424                                               01003000
CVTRV219 EQU   CVTS01+425                                               01004000
CVTRV228 EQU   CVTS01+426                                               01005000
CVTRV237 EQU   CVTS01+427                                               01006000
CVTMFRTR EQU   CVTS01+452                                               01007000
CVTRV262 EQU   CVTS01+468                                               01008000
CVTRV271 EQU   CVTS01+469                                               01009000
CVTRV280 EQU   CVTS01+470                                               01010000
CVTRV289 EQU   CVTS01+471                                               01011000
CVTGSDA  EQU   CVTS01+600                                               01012000
LCPZTIE  EQU   LCPCID                                                   01013000
LCPZSNAM EQU   LCPZTIE+8                                                01014000
FLC      EQU   PSA                                                      01015000
SRB      EQU   SRBSECT                                                  01016000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01017000
LCPZTRV4 EQU   LCPZSNAM+4                                               01018000
LCPZTRV1 EQU   LCPZSNAM                                                 01019000
LCPZSNA  EQU   LCPZTIE+4                                                01020000
LCPZFMCA EQU   LCPZTIE                                                  01021000
CVTRV628 EQU   CVTS01+728                                               01022000
CVTRV627 EQU   CVTS01+724                                               01023000
CVTRV626 EQU   CVTS01+720                                               01024000
CVTRV625 EQU   CVTS01+716                                               01025000
CVTRV624 EQU   CVTS01+712                                               01026000
CVTRV623 EQU   CVTS01+708                                               01027000
CVTRV622 EQU   CVTS01+704                                               01028000
CVTRV621 EQU   CVTS01+700                                               01029000
CVTRV620 EQU   CVTS01+696                                               01030000
CVTRV619 EQU   CVTS01+692                                               01031000
CVTRV618 EQU   CVTS01+688                                               01032000
CVTRV617 EQU   CVTS01+684                                               01033000
CVTRV616 EQU   CVTS01+680                                               01034000
CVTRV615 EQU   CVTS01+676                                               01035000
CVTRV614 EQU   CVTS01+672                                               01036000
CVTRV613 EQU   CVTS01+668                                               01037000
CVTTCASP EQU   CVTS01+664                                               01038000
CVT0PT03 EQU   CVTS01+660                                               01039000
CVT0PT0E EQU   CVTS01+656                                               01040000
CVTIRM   EQU   CVTS01+652                                               01041000
CVTCGK   EQU   CVTS01+648                                               01042000
CVTRV607 EQU   CVTS01+644                                               01043000
CVTRV606 EQU   CVTS01+640                                               01044000
CVTRV605 EQU   CVTS01+636                                               01045000
CVTRV604 EQU   CVTS01+632                                               01046000
CVTEFF02 EQU   CVTS01+628                                               01047000
CVTCBBR  EQU   CVTS01+624                                               01048000
CVTSSCR  EQU   CVTS01+620                                               01049000
CVTEVENT EQU   CVTS01+616                                               01050000
CVTCRCA  EQU   CVTS01+612                                               01051000
CVTTPIO  EQU   CVTS01+608                                               01052000
CVTADV   EQU   CVTS01+604                                               01053000
CVTGSDAB EQU   CVTGSDA                                                  01054000
CVTQV3   EQU   CVTS01+596                                               01055000
CVTQV2   EQU   CVTS01+592                                               01056000
CVTQV1   EQU   CVTS01+588                                               01057000
CVTRPT   EQU   CVTS01+584                                               01058000
CVTSSRB  EQU   CVTS01+580                                               01059000
CVTCSDRL EQU   CVTS01+576                                               01060000
CVTEXP1  EQU   CVTS01+572                                               01061000
CVTRMPMT EQU   CVTS01+568                                               01062000
CVTRMPTT EQU   CVTS01+564                                               01063000
CVTVPSA  EQU   CVTS01+560                                               01064000
CVTVSTOP EQU   CVTS01+556                                               01065000
CVTGTFR8 EQU   CVTS01+552                                               01066000
CVTQUIT  EQU   CVTS01+548                                               01067000
CVTVACR  EQU   CVTS01+544                                               01068000
CVTWTCB  EQU   CVTS01+540                                               01069000
CVTSTPRS EQU   CVTS01+536                                               01070000
CVT0PT02 EQU   CVTS01+532                                               01071000
CVTDARCM EQU   CVTS01+528                                               01072000
CVTIRECM EQU   CVTS01+524                                               01073000
CVTJRECM EQU   CVTS01+520                                               01074000
CVTVEMS0 EQU   CVTS01+516                                               01075000
CVTSPFRR EQU   CVTS01+512                                               01076000
CVTRLSTG EQU   CVTS01+508                                               01077000
CVT0TC0A EQU   CVTS01+504                                               01078000
CVTGMBR  EQU   CVTS01+500                                               01079000
CVTLFRM  EQU   CVTS01+496                                               01080000
CVTRMBR  EQU   CVTS01+492                                               01081000
CVTVIOP  EQU   CVTS01+488                                               01082000
CVTRV307 EQU   CVTS01+486                                               01083000
CVTRV306 EQU   CVTS01+484                                               01084000
CVTRV305 EQU   CVTS01+482                                               01085000
CVTRV304 EQU   CVTS01+480                                               01086000
CVTRV303 EQU   CVTS01+478                                               01087000
CVTRV302 EQU   CVTS01+476                                               01088000
CVTTRCA  EQU   CVTS01+472                                               01089000
CVTRV297 EQU   CVTRV289                                                 01090000
CVTRV296 EQU   CVTRV289                                                 01091000
CVTRV295 EQU   CVTRV289                                                 01092000
CVTRV294 EQU   CVTRV289                                                 01093000
CVTRV293 EQU   CVTRV289                                                 01094000
CVTRV292 EQU   CVTRV289                                                 01095000
CVTRV291 EQU   CVTRV289                                                 01096000
CVTRV290 EQU   CVTRV289                                                 01097000
CVTRV288 EQU   CVTRV280                                                 01098000
CVTRV287 EQU   CVTRV280                                                 01099000
CVTRV286 EQU   CVTRV280                                                 01100000
CVTRV285 EQU   CVTRV280                                                 01101000
CVTRV284 EQU   CVTRV280                                                 01102000
CVTRV283 EQU   CVTRV280                                                 01103000
CVTRV282 EQU   CVTRV280                                                 01104000
CVTRV281 EQU   CVTRV280                                                 01105000
CVTRV279 EQU   CVTRV271                                                 01106000
CVTRV278 EQU   CVTRV271                                                 01107000
CVTRV277 EQU   CVTRV271                                                 01108000
CVTRV276 EQU   CVTRV271                                                 01109000
CVTRV275 EQU   CVTRV271                                                 01110000
CVTRV274 EQU   CVTRV271                                                 01111000
CVTRV273 EQU   CVTRV271                                                 01112000
CVTRV272 EQU   CVTRV271                                                 01113000
CVTRV270 EQU   CVTRV262                                                 01114000
CVTRV269 EQU   CVTRV262                                                 01115000
CVTRV268 EQU   CVTRV262                                                 01116000
CVTRV267 EQU   CVTRV262                                                 01117000
CVTRV266 EQU   CVTRV262                                                 01118000
CVTRV265 EQU   CVTRV262                                                 01119000
CVTRV264 EQU   CVTRV262                                                 01120000
CVTRV263 EQU   CVTRV262                                                 01121000
CVTVFP   EQU   CVTS01+464                                               01122000
CVTVSI   EQU   CVTS01+460                                               01123000
CVTVPSIB EQU   CVTS01+456                                               01124000
CVTMFACT EQU   CVTMFRTR                                                 01125000
CVTMFCTL EQU   CVTS01+448                                               01126000
CVTPVBP  EQU   CVTS01+444                                               01127000
CVTPWI   EQU   CVTS01+440                                               01128000
CVTRV254 EQU   CVTS01+438                                               01129000
CVTRV253 EQU   CVTS01+436                                               01130000
CVTRV252 EQU   CVTS01+434                                               01131000
CVTRV251 EQU   CVTS01+433                                               01132000
CVTRV250 EQU   CVTS01+432                                               01133000
CVTRV249 EQU   CVTS01+431                                               01134000
CVTRV248 EQU   CVTS01+430                                               01135000
CVTRV247 EQU   CVTS01+429                                               01136000
CVTRV246 EQU   CVTS01+428                                               01137000
CVTRV245 EQU   CVTRV237                                                 01138000
CVTRV244 EQU   CVTRV237                                                 01139000
CVTRV243 EQU   CVTRV237                                                 01140000
CVTRV242 EQU   CVTRV237                                                 01141000
CVTRV241 EQU   CVTRV237                                                 01142000
CVTRV240 EQU   CVTRV237                                                 01143000
CVTRV239 EQU   CVTRV237                                                 01144000
CVTRV238 EQU   CVTRV237                                                 01145000
CVTRV236 EQU   CVTRV228                                                 01146000
CVTRV235 EQU   CVTRV228                                                 01147000
CVTRV234 EQU   CVTRV228                                                 01148000
CVTRV233 EQU   CVTRV228                                                 01149000
CVTRV232 EQU   CVTRV228                                                 01150000
CVTRV231 EQU   CVTRV228                                                 01151000
CVTRV230 EQU   CVTRV228                                                 01152000
CVTRV229 EQU   CVTRV228                                                 01153000
CVTRV227 EQU   CVTRV219                                                 01154000
CVTRV226 EQU   CVTRV219                                                 01155000
CVTRV225 EQU   CVTRV219                                                 01156000
CVTRV224 EQU   CVTRV219                                                 01157000
CVTRV223 EQU   CVTRV219                                                 01158000
CVTRV222 EQU   CVTRV219                                                 01159000
CVTRV221 EQU   CVTRV219                                                 01160000
CVTRV220 EQU   CVTRV219                                                 01161000
CVTRV218 EQU   CVTRV210                                                 01162000
CVTRV217 EQU   CVTRV210                                                 01163000
CVTRV216 EQU   CVTRV210                                                 01164000
CVTRV215 EQU   CVTRV210                                                 01165000
CVTRV214 EQU   CVTRV210                                                 01166000
CVTRV213 EQU   CVTRV210                                                 01167000
CVTRV212 EQU   CVTRV210                                                 01168000
CVTRV211 EQU   CVTRV210                                                 01169000
CVTLCCAT EQU   CVTS01+420                                               01170000
CVTPCCAT EQU   CVTS01+416                                               01171000
CVTIPCRP EQU   CVTS01+412                                               01172000
CVTIPCRI EQU   CVTS01+408                                               01173000
CVTIPCDS EQU   CVTS01+404                                               01174000
CVTAIDVT EQU   CVTS01+400                                               01175000
CVTSSAP  EQU   CVTS01+396                                               01176000
CVTEHCIR EQU   CVTS01+392                                               01177000
CVTEHDEF EQU   CVTS01+388                                               01178000
CVTDAIR  EQU   CVTS01+384                                               01179000
CVTPERFM EQU   CVTS01+380                                               01180000
CVT044R2 EQU   CVTS01+376                                               01181000
CVTFETCH EQU   CVTS01+372                                               01182000
CVTRSTWD EQU   CVTS01+368                                               01183000
CVTSPOST EQU   CVTS01+364                                               01184000
CVTIOBP  EQU   CVTS01+360                                               01185000
CVTASMVT EQU   CVTS01+356                                               01186000
CVTRECRQ EQU   CVTS01+352                                               01187000
CVTWSAC  EQU   CVTS01+348                                               01188000
CVTRV149 EQU   CVTS01+344                                               01189000
CVTWSAL  EQU   CVTS01+340                                               01190000
CVTSPSA  EQU   CVTS01+336                                               01191000
CVTGLMN  EQU   CVTS01+332                                               01192000
CVTVEAC0 EQU   CVTS01+328                                               01193000
CVT062R1 EQU   CVTS01+324                                               01194000
CVTRPOST EQU   CVTS01+320                                               01195000
CVTDQIQE EQU   CVTS01+316                                               01196000
CVTCSD   EQU   CVTS01+312                                               01197000
CVTLKRMA EQU   CVTS01+308                                               01198000
CVTRSPIE EQU   CVTS01+304                                               01199000
CVTRENQ  EQU   CVTS01+300                                               01200000
CVTLQCB  EQU   CVTS01+296                                               01201000
CVTFQCB  EQU   CVTS01+292                                               01202000
CVTQCS01 EQU   CVTS01+288                                               01203000
CVTAPFT  EQU   CVTS01+284                                               01204000
CVTPARRL EQU   CVTS01+280                                               01205000
CVTVWAIT EQU   CVTS01+276                                               01206000
CVTGSPL  EQU   CVTS01+272                                               01207000
CVTLSMQ  EQU   CVTS01+268                                               01208000
CVTGSMQ  EQU   CVTS01+264                                               01209000
CVTEXPRO EQU   CVTS01+260                                               01210000
CVTOPCTP EQU   CVTS01+256                                               01211000
CVTSIC   EQU   CVTS01+252                                               01212000
CVTTPIOS EQU   CVTS01+248                                               01213000
CVTRTMS  EQU   CVTS01+244                                               01214000
CVTSDBF  EQU   CVTS01+240                                               01215000
CVTSCBP  EQU   CVTS01+236                                               01216000
CVTSDMP  EQU   CVTS01+232                                               01217000
CVTSV60  EQU   CVTS01+228                                               01218000
CVTRTMCT EQU   CVTS01+224                                               01219000
CVTASCBL EQU   CVTS01+220                                               01220000
CVTASCBH EQU   CVTS01+216                                               01221000
CVTGDA   EQU   CVTS01+212                                               01222000
CVTASVT  EQU   CVTS01+208                                               01223000
CVTVVMDI EQU   CVTS01+204                                               01224000
CVTAQTOP EQU   CVTS01+200                                               01225000
CVTIOSCS EQU   CVTS01+196                                               01226000
CVTSDRM  EQU   CVTS01+192                                               01227000
CVTOPTE  EQU   CVTS01+188                                               01228000
CVTSTXU  EQU   CVTS01+184                                               01229000
CVTQUIS  EQU   CVTS01+180                                               01230000
CVTPARS  EQU   CVTS01+176                                               01231000
CVTS1EE  EQU   CVTS01+172                                               01232000
CVTFRAS  EQU   CVTS01+168                                               01233000
CVTQSAS  EQU   CVTS01+164                                               01234000
CVTCRAS  EQU   CVTS01+160                                               01235000
CVTCRMN  EQU   CVTS01+156                                               01236000
CVTDELCP EQU   CVTS01+152                                               01237000
CVTFRECL EQU   CVTS01+148                                               01238000
CVTGETCL EQU   CVTS01+144                                               01239000
CVTBLDCP EQU   CVTS01+140                                               01240000
CVTAUTHL EQU   CVTS01+136                                               01241000
CVTSCAN  EQU   CVTS01+132                                               01242000
CVTRV144 EQU   CVTS01+130                                               01243000
CVTMAXMP EQU   CVTS01+128                                               01244000
CVTSTCK  EQU   CVTS01+124                                               01245000
CVTRV139 EQU   CVTS01+123                                               01246000
CVTDSSAC EQU   CVTS01+122                                               01247000
CVTRV513 EQU   CVTS01+121                                               01248000
CVTIOSPL EQU   CVTS01+120                                               01249000
CVTPTGT  EQU   CVTS01+116                                               01250000
CVTCSPIE EQU   CVTS01+112                                               01251000
CVTSMFEX EQU   CVTS01+108                                               01252000
CVTOLT0A EQU   CVTS01+104                                               01253000
CVTPUTL  EQU   CVTS01+96                                                01254000
CVTASCRL EQU   CVTS01+92                                                01255000
CVTASCRF EQU   CVTS01+88                                                01256000
CVTRV326 EQU   CVTS01+84                                                01257000
CVTRV325 EQU   CVTS01+80                                                01258000
CVTRV324 EQU   CVTS01+76                                                01259000
CVT0VL01 EQU   CVTS01+72                                                01260000
CVTSHRVM EQU   CVTS01+68                                                01261000
CVTRV332 EQU   CVTS01+64                                                01262000
CVTTAS   EQU   CVTS01+60                                                01263000
CVTRSCN  EQU   CVTS01+56                                                01264000
CVTTRAC2 EQU   CVTS01+54                                                01265000
CVTTRACE EQU   CVTS01+52                                                01266000
CVTAPG   EQU   CVTS01+51                                                01267000
CVTSDTRC EQU   CVTCTLFG                                                 01268000
CVTGTRCE EQU   CVTCTLFG                                                 01269000
CVTNOMP  EQU   CVTCTLFG                                                 01270000
CVTRSV79 EQU   CVTCTLFG                                                 01271000
CVTDSTAT EQU   CVTCTLFG                                                 01272000
CVTRSV78 EQU   CVTCTLFG                                                 01273000
CVTRV333 EQU   CVTCTLFG                                                 01274000
CVTRV323 EQU   CVTCTLFG                                                 01275000
CVTSPVLK EQU   CVTS01+49                                                01276000
CVTRSV77 EQU   CVTS01+48                                                01277000
CVTRV331 EQU   CVTS01+44                                                01278000
CVTRV330 EQU   CVTS01+40                                                01279000
CVTRV329 EQU   CVTS01+36                                                01280000
CVTRV328 EQU   CVTS01+32                                                01281000
CVTRV322 EQU   CVTS01+28                                                01282000
CVTSLID  EQU   CVTSLIDA+1                                               01283000
CVTSYLK  EQU   CVTSLIDA                                                 01284000
CVTRV321 EQU   CVTS01+20                                                01285000
CVTRV320 EQU   CVTS01+16                                                01286000
CVTLPDIR EQU   CVTLPDIA+1                                               01287000
CVTRSV69 EQU   CVTDIRST                                                 01288000
CVTRSV68 EQU   CVTDIRST                                                 01289000
CVTRSV67 EQU   CVTDIRST                                                 01290000
CVTRSV66 EQU   CVTDIRST                                                 01291000
CVTRSV65 EQU   CVTDIRST                                                 01292000
CVTRSV64 EQU   CVTDIRST                                                 01293000
CVTRSV63 EQU   CVTDIRST                                                 01294000
CVTDICOM EQU   CVTDIRST                                                 01295000
CVTPVTP  EQU   CVTS01+8                                                 01296000
CVTLPDSR EQU   CVTS01+4                                                 01297000
CVTGETL  EQU   CVTS01                                                   01298000
PSARSAV  EQU   PSARSVTE+60                                              01299000
PSARSTK  EQU   PSARSVTE+56                                              01300000
PSAESAV3 EQU   PSARSVTE+52                                              01301000
PSAESTK3 EQU   PSARSVTE+48                                              01302000
PSAESAV2 EQU   PSARSVTE+44                                              01303000
PSAESTK2 EQU   PSARSVTE+40                                              01304000
PSAESAV1 EQU   PSARSVTE+36                                              01305000
PSAESTK1 EQU   PSARSVTE+32                                              01306000
PSAPSAV  EQU   PSARSVTE+28                                              01307000
PSAPSTK  EQU   PSARSVTE+24                                              01308000
PSAMSAV  EQU   PSARSVTE+20                                              01309000
PSAMSTK  EQU   PSARSVTE+16                                              01310000
PSASSAV  EQU   PSARSVTE+12                                              01311000
PSASSTK  EQU   PSARSVTE+8                                               01312000
PSANSTK  EQU   PSARSVTE+4                                               01313000
WKECHNGP EQU   WKECHAIN+1                                               01314000
@NM00065 EQU   WKEFLAGS                                                 01315000
WKEGATE  EQU   WKEFLAGS                                                 01316000
@NM00064 EQU   ISTWKE                                                   01317000
@NM00063 EQU   CMZ0033A                                                 01318000
WORD5    EQU   OTHWRDS+16                                               01319000
WORD4    EQU   OTHWRDS+12                                               01320000
WORD3    EQU   OTHWRDS+8                                                01321000
WORD2    EQU   OTHWRDS+4                                                01322000
DVTPROCA EQU   DVTPROC+1                                                01323000
DVTRSV14 EQU   DVTFLAG1                                                 01324000
DVTRSV13 EQU   DVTFLAG1                                                 01325000
DVTRSV12 EQU   DVTFLAG1                                                 01326000
DVTRSV11 EQU   DVTFLAG1                                                 01327000
DVTRSV10 EQU   DVTFLAG1                                                 01328000
DVTRSV09 EQU   DVTFLAG1                                                 01329000
DVTRSV08 EQU   DVTFLAG1                                                 01330000
DVTEXITF EQU   DVTFLAG1                                                 01331000
DVTENTRY EQU   ISTDVT+24                                                01332000
DVTRSV01 EQU   DVTHDR+20                                                01333000
DVTRSV15 EQU   DVTHDR+14                                                01334000
DVTHDCNT EQU   DVTHDR+12                                                01335000
DVTHLEN  EQU   DVTHDR+10                                                01336000
DVTHFGB  EQU   DVTHDR+9                                                 01337000
DVTRSV07 EQU   DVTHFGA                                                  01338000
DVTRSV06 EQU   DVTHFGA                                                  01339000
DVTRSV05 EQU   DVTHFGA                                                  01340000
DVTRSV04 EQU   DVTHFGA                                                  01341000
DVTRSV03 EQU   DVTHFGA                                                  01342000
DVTRSV02 EQU   DVTHFGA                                                  01343000
DVTHFGA1 EQU   DVTHFGA                                                  01344000
DVTHFGA0 EQU   DVTHFGA                                                  01345000
DVTHUCNT EQU   DVTHDR+6                                                 01346000
DVTHECNT EQU   DVTHDR+4                                                 01347000
DVTHFORW EQU   DVTHDR                                                   01348000
ATCAOS   EQU   ISTATCVT+1584                                            01349000
ATCPOPAB EQU   ATCAOSM+640                                              01350000
ATCVIOPM EQU   ATCAOSM+636                                              01351000
ATCTPMMI EQU   ATCAOSM+632                                              01352000
ATCTPMPB EQU   ATCAOSM+600                                              01353000
ATCRSV88 EQU   ATCAOSM+596                                              01354000
ATCRPLCT EQU   ATCAOSM+594                                              01355000
ATCCRACT EQU   ATCAOSM+592                                              01356000
ATCSRBCT EQU   ATCAOSM+590                                              01357000
ATCRSV75 EQU   ATCAOSM+589                                              01358000
ATCRSV66 EQU   ATCZFLAG                                                 01359000
ATCZF001 EQU   ATCZFLAG                                                 01360000
ATCTPCP1 EQU   ATCAOSM+584                                              01361000
ATCTPCP0 EQU   ATCAOSM+580                                              01362000
ATCAICTN EQU   ATCAOSM+576                                              01363000
ATCZR01  EQU   ATCAOSM+572                                              01364000
ATCMPLTA EQU   ATCAOSM+568                                              01365000
ATCASCB  EQU   ATCAOSM+564                                              01366000
ATCAP86  EQU   ATCAOSM+560                                              01367000
ATCAP85  EQU   ATCAOSM+556                                              01368000
ATCAP84  EQU   ATCAOSM+552                                              01369000
ATCAP83  EQU   ATCAOSM+548                                              01370000
ATCAP82  EQU   ATCAOSM+544                                              01371000
ATCAP69  EQU   ATCAOSM+540                                              01372000
ATCAPC59 EQU   ATCAOSM+528                                              01373000
ATCAP56  EQU   ATCAOSM+524                                              01374000
ATCAP55  EQU   ATCAOSM+520                                              01375000
ATCRCFY0 EQU   ATCAOSM+516                                              01376000
ATCAP41  EQU   ATCAOSM+512                                              01377000
ATCAPC25 EQU   ATCAOSM+508                                              01378000
ATCAP23  EQU   ATCAOSM+504                                              01379000
ATCTPSPB EQU   ATCAOSM+472                                              01380000
ATCTRMPB EQU   ATCAOSM+440                                              01381000
ATCAPBE  EQU   ATCAOSM+436                                              01382000
ATCPSTA  EQU   ATCAOSM+432                                              01383000
ATCSMABF EQU   ATCAOSM+428                                              01384000
ATCSMAPR EQU   ATCAOSM+424                                              01385000
ATCTPWQA EQU   ATCAOSM+420                                              01386000
ATCSMAID EQU   ATCAOSM+416                                              01387000
ATCSMARA EQU   ATCAOSM+412                                              01388000
ATCCACXA EQU   ATCAOSM+408                                              01389000
ATCZLAAB EQU   ATCAOSM+404                                              01390000
ATCATA10 EQU   ATCAOSM+400                                              01391000
ATCHLTCB EQU   ATCAOSM+396                                              01392000
@NM00060 EQU   ATCVTFLG                                                 01393000
ATCVTACT EQU   ATCVTFLG                                                 01394000
ATCRPT40 EQU   ATCAOSM+388                                              01395000
ATCRPT39 EQU   ATCAOSM+384                                              01396000
ATCRPT38 EQU   ATCAOSM+380                                              01397000
ATCRPT37 EQU   ATCAOSM+376                                              01398000
ATCRPT36 EQU   ATCAOSM+372                                              01399000
ATCRPT35 EQU   ATCAOSM+368                                              01400000
ATCRPT34 EQU   ATCAOSM+364                                              01401000
ATCRPT33 EQU   ATCAOSM+360                                              01402000
ATCRPT32 EQU   ATCAOSM+356                                              01403000
ATCRPT31 EQU   ATCAOSM+352                                              01404000
ATCRPT30 EQU   ATCAOSM+348                                              01405000
ATCRPT29 EQU   ATCAOSM+344                                              01406000
ATCRPT28 EQU   ATCAOSM+340                                              01407000
ATCRPT27 EQU   ATCAOSM+336                                              01408000
ATCRPT26 EQU   ATCAOSM+332                                              01409000
ATCRPT25 EQU   ATCAOSM+328                                              01410000
ATCRPT24 EQU   ATCAOSM+324                                              01411000
ATCRPT23 EQU   ATCAOSM+320                                              01412000
ATCRPT22 EQU   ATCAOSM+316                                              01413000
ATCRPT21 EQU   ATCAOSM+312                                              01414000
ATCRPT20 EQU   ATCAOSM+308                                              01415000
ATCRPT19 EQU   ATCAOSM+304                                              01416000
ATCRPLAC EQU   ATCRPLCN+2                                               01417000
ATCRPLRC EQU   ATCRPLCN                                                 01418000
ATCCRPLQ EQU   ATCCRPL                                                  01419000
ATCSRBAC EQU   ATCSRBCN+2                                               01420000
ATCSRBRC EQU   ATCSRBCN                                                 01421000
ATCSRBQ  EQU   ATCSRB                                                   01422000
ATCCRARC EQU   ATCCRACN                                                 01423000
ATCRPT12 EQU   ATCAOSM+276                                              01424000
ATCDMAPP EQU   ATCAOSM+272                                              01425000
ATCAP38  EQU   ATCAOSM+268                                              01426000
ATCAP37  EQU   ATCAOSM+264                                              01427000
ATCZDFJ0 EQU   ATCAOSM+260                                              01428000
ATCAP51  EQU   ATCAOSM+256                                              01429000
ATCZPAB2 EQU   ATCAOSM+224                                              01430000
ATCZPAB1 EQU   ATCAOSM+192                                              01431000
ATCZLFVT EQU   ATCAOSM+188                                              01432000
ATCZLPVT EQU   ATCAOSM+184                                              01433000
ATCZDVTX EQU   ATCAOSM+180                                              01434000
ATCZDVTA EQU   ATCAOSM+176                                              01435000
ATCZDVT9 EQU   ATCAOSM+172                                              01436000
ATCZDVT8 EQU   ATCAOSM+168                                              01437000
ATCZDVT7 EQU   ATCAOSM+164                                              01438000
ATCRSV56 EQU   ATCDAPVT+22                                              01439000
ATCDAPDG EQU   ATCDAPVT+20                                              01440000
ATCDXCEA EQU   ATCDAPVT+16                                              01441000
ATCDCEA  EQU   ATCDAPVT+12                                              01442000
ATCDPCIA EQU   ATCDAPVT+8                                               01443000
ATCDSIOA EQU   ATCDAPVT+4                                               01444000
ATCDEOEA EQU   ATCDAPVT                                                 01445000
ATCZLAEA EQU   ATCLDAPP+16                                              01446000
ATCZLCEA EQU   ATCLDAPP+12                                              01447000
ATCRSV17 EQU   ATCLDAPP+8                                               01448000
ATCSMFRR EQU   ATCLDAPP+4                                               01449000
ATCCDTID EQU   ATCLDAPP                                                 01450000
ATCZAEA  EQU   ATCICAPP+16                                              01451000
ATCZCEA  EQU   ATCICAPP+12                                              01452000
ATCCDTCB EQU   ATCICAPP+8                                               01453000
ATCZSIOA EQU   ATCICAPP+4                                               01454000
ATCCDRPH EQU   ATCICAPP                                                 01455000
ATCAP65  EQU   ATCAOSM+96                                               01456000
ATCZDVT6 EQU   ATCAOSM+92                                               01457000
ATCZDVT4 EQU   ATCAOSM+88                                               01458000
ATCZDVT3 EQU   ATCAOSM+84                                               01459000
ATCZDVT1 EQU   ATCAOSM+80                                               01460000
ATCICNCB EQU   ATCAOSM+76                                               01461000
ATCZPSVT EQU   ATCAOSM+72                                               01462000
ATCZFSVT EQU   ATCAOSM+68                                               01463000
ATCAP64  EQU   ATCAOSM+64                                               01464000
ATCAP63  EQU   ATCAOSM+60                                               01465000
ATCAP61  EQU   ATCAOSM+56                                               01466000
ATCAP58  EQU   ATCAOSM+52                                               01467000
ATCAP57  EQU   ATCAOSM+48                                               01468000
ATCAP54  EQU   ATCAOSM+44                                               01469000
ATCAP53  EQU   ATCAOSM+40                                               01470000
ATCAP52  EQU   ATCAOSM+36                                               01471000
ATCAP34  EQU   ATCAOSM+32                                               01472000
ATCAP31  EQU   ATCAOSM+24                                               01473000
ATCAP12  EQU   ATCAOSM+20                                               01474000
ATCAP11  EQU   ATCAOSM+16                                               01475000
ATCCMTCB EQU   ATCAOSM+12                                               01476000
ATCPRPH  EQU   ATCAOSM+8                                                01477000
ATCGSRBF EQU   ATCGSRBG                                                 01478000
ATCSRBRT EQU   ATCAOSM                                                  01479000
@NM00059 EQU   @NM00058                                                 01480000
ATCVTMAB EQU   @NM00058                                                 01481000
@NM00057 EQU   ATCVTBAM                                                 01482000
ATCVDLOK EQU   ISTATCVT+904                                             01483000
ATCVFPAB EQU   ISTATCVT+872                                             01484000
ATCVDPAB EQU   ISTATCVT+840                                             01485000
ATCIOECB EQU   ISTATCVT+836                                             01486000
ATCINCW3 EQU   ISTATCVT+832                                             01487000
ATCMODTB EQU   ISTATCVT+828                                             01488000
ATCUSSPT EQU   ISTATCVT+824                                             01489000
ATCSRTAB EQU   ISTATCVT+820                                             01490000
@NM00056 EQU   ISTATCVT+819                                             01491000
@NM00055 EQU   ATCSTAT2                                                 01492000
ATCTRSMS EQU   ATCSTAT2                                                 01493000
ATCTRLOK EQU   ATCSTAT2                                                 01494000
ATCTRPSS EQU   ATCSTAT2                                                 01495000
ATCTRESC EQU   ATCSTAT2                                                 01496000
ATCTRAPI EQU   ATCSTAT2                                                 01497000
ATCNMCTR EQU   ISTATCVT+816                                             01498000
ATCSEC51 EQU   ATCSECST                                                 01499000
ATCSEC40 EQU   ATCSIPD+8                                                01500000
ATCSEC30 EQU   ATCSIPD+4                                                01501000
ATCSEC21 EQU   ATCSIPD                                                  01502000
ATCSEC10 EQU   ATCSOPD+4                                                01503000
ATCSEC01 EQU   ATCSOPD                                                  01504000
ATCPOIA  EQU   ATCRNO+1                                                 01505000
@NM00054 EQU   ATCRNO                                                   01506000
ATCPODVT EQU   ISTATCVT+784                                             01507000
ATCS49XL EQU   ISTATCVT+780                                             01508000
ATCS49XI EQU   ISTATCVT+776                                             01509000
ATCLCLCT EQU   ATCVLCNT+2                                               01510000
ATCRNCNT EQU   ATCVLCNT                                                 01511000
ATCCFEAD EQU   ISTATCVT+768                                             01512000
ATCPTR00 EQU   ISTATCVT+736                                             01513000
ATCRSV10 EQU   ISTATCVT+704                                             01514000
ATCTACB  EQU   ISTATCVT+700                                             01515000
ATCVTINM EQU   ISTATCVT+696                                             01516000
ATCTCLIM EQU   ISTATCVT+692                                             01517000
ATCTCLOM EQU   ISTATCVT+688                                             01518000
ATCVTIPB EQU   ISTATCVT+656                                             01519000
ATCTCIPB EQU   ISTATCVT+624                                             01520000
ATCTIPAB EQU   ISTATCVT+592                                             01521000
ATCOCCCB EQU   ISTATCVT+588                                             01522000
ATCOCCOB EQU   ISTATCVT+584                                             01523000
ATCCDLAD EQU   ISTATCVT+580                                             01524000
ATCCCLAD EQU   ISTATCVT+576                                             01525000
ATCDLRPB EQU   ISTATCVT+544                                             01526000
ATCPGPAB EQU   ISTATCVT+512                                             01527000
ATCVPAB1 EQU   ISTATCVT+480                                             01528000
ATCRSV97 EQU   ISTATCVT+476                                             01529000
ATCRDTLK EQU   ISTATCVT+472                                             01530000
ATCVOCLK EQU   ISTATCVT+468                                             01531000
ATCCDFDN EQU   ISTATCVT+464                                             01532000
ATCCDFIN EQU   ISTATCVT+460                                             01533000
ATCDVTLK EQU   ISTATCVT+456                                             01534000
ATCAP36  EQU   ISTATCVT+452                                             01535000
ATCAP35  EQU   ISTATCVT+448                                             01536000
ATCAP33  EQU   ISTATCVT+444                                             01537000
ATCRSV99 EQU   ISTATCVT+440                                             01538000
ATCONFIG EQU   ISTATCVT+432                                             01539000
ATCNODDS EQU   ISTATCVT+428                                             01540000
ATCNODEL EQU   ISTATCVT+420                                             01541000
ATCRSV69 EQU   ISTATCVT+416                                             01542000
ATCAPCR5 EQU   ISTATCVT+412                                             01543000
ATCLDECB EQU   ISTATCVT+408                                             01544000
ATCLDNCS EQU   ISTATCVT+404                                             01545000
ATCCDPTR EQU   ISTATCVT+400                                             01546000
ATCADEL  EQU   ISTATCVT+396                                             01547000
ATCTODVT EQU   ISTATCVT+392                                             01548000
ATCDEBCH EQU   ISTATCVT+388                                             01549000
ATCHBSIZ EQU   ATCHPGM+2                                                01550000
ATCHBFNO EQU   ATCHPGM                                                  01551000
ATCCRME  EQU   ISTATCVT+380                                             01552000
ATCRVCHS EQU   ISTATCVT+372                                             01553000
ATCECTLP EQU   ISTATCVT+368                                             01554000
ATCZDVTB EQU   ISTATCVT+364                                             01555000
ATCECPRT EQU   ISTATCVT+360                                             01556000
ATCVTLOD EQU   ISTATCVT+356                                             01557000
ATCTRPAB EQU   ISTATCVT+352                                             01558000
ATCMSGM  EQU   ISTATCVT+348                                             01559000
ATCMSGP  EQU   ISTATCVT+344                                             01560000
ATCEPT   EQU   ISTATCVT+340                                             01561000
ATCDVT   EQU   ISTATCVT+336                                             01562000
ATCTRCPT EQU   ISTATCVT+332                                             01563000
ATCDVLOD EQU   ISTATCVT+328                                             01564000
ATCALERT EQU   ISTATCVT+324                                             01565000
ATCEPA   EQU   ISTATCVT+320                                             01566000
ATCSAF   EQU   ISTATCVT+318                                             01567000
ATCXRANG EQU   ISTATCVT+317                                             01568000
ATCLAST  EQU   ATCSHRFG                                                 01569000
ATCSHRTN EQU   ISTATCVT+308                                             01570000
ATCUEP   EQU   ISTATCVT+304                                             01571000
ATCOCRT  EQU   ISTATCVT+300                                             01572000
ATCCSMA  EQU   ATCCSMR                                                  01573000
ATCESC02 EQU   ISTATCVT+292                                             01574000
ATCESC01 EQU   ISTATCVT+288                                             01575000
ATCCDFND EQU   ISTATCVT+284                                             01576000
ATCCDDEL EQU   ISTATCVT+280                                             01577000
ATCCDADD EQU   ISTATCVT+276                                             01578000
ATCMNT   EQU   ISTATCVT+272                                             01579000
ATCRSV16 EQU   ISTATCVT+270                                             01580000
ATCMAXID EQU   ISTATCVT+269                                             01581000
ATCMSGSP EQU   ATCCOM+268                                               01582000
ATCCIDM  EQU   ATCCOM+266                                               01583000
ATCACTRM EQU   ATCCOM+264                                               01584000
ATCNERAP EQU   ATCCOM+260                                               01585000
ATCNESAL EQU   ATCCOM+256                                               01586000
ATCRCC65 EQU   ATCCOM+252                                               01587000
ATCRCC26 EQU   ATCCOM+248                                               01588000
ATCRCC63 EQU   ATCCOM+244                                               01589000
ATCRSV11 EQU   ATCCOM+242                                               01590000
ATCVTMID EQU   ATCCOM+240                                               01591000
ATCAPOST EQU   ATCCOM+236                                               01592000
ATCNERFN EQU   ATCCOM+232                                               01593000
ATCNERNE EQU   ATCCOM+228                                               01594000
ATCNERCV EQU   ATCCOM+224                                               01595000
ATCNERST EQU   ATCCOM+220                                               01596000
ATCDCC61 EQU   ATCCOM+216                                               01597000
ATCDCC60 EQU   ATCCOM+212                                               01598000
ATCSRTDF EQU   ATCCOM+208                                               01599000
ATCSRTAD EQU   ATCCOM+204                                               01600000
ATCFIRA  EQU   ATCCOM+200                                               01601000
ATCSMBQ  EQU   ATCCOM+196                                               01602000
ATCSMRC  EQU   ATCCOM+192                                               01603000
ATCSMRS  EQU   ATCCOM+188                                               01604000
ATCSMQU  EQU   ATCCOM+184                                               01605000
ATCACDA  EQU   ATCCOM+176                                               01606000
ATCSTMA  EQU   ATCCOM+172                                               01607000
ATCFRSTR EQU   ATCCOM+168                                               01608000
ATCGTSTR EQU   ATCCOM+164                                               01609000
ATCREADA EQU   ATCCOM+160                                               01610000
ATCALOAD EQU   ATCCOM+156                                               01611000
ATCBLDLA EQU   ATCCOM+152                                               01612000
ATCFBRPH EQU   ATCCOM+148                                               01613000
ATCBFTRC EQU   ATCCOM+144                                               01614000
ATCTPBUF EQU   ATCTHTRC                                                 01615000
ATCREMOV EQU   ATCCOM+136                                               01616000
ATCADD   EQU   ATCCOM+132                                               01617000
ATCDVTPT EQU   ATCCOM+124                                               01618000
ATCFEPT  EQU   ATCCOM+120                                               01619000
ATCFDVT  EQU   ATCCOM+116                                               01620000
ATCCONFT EQU   ATCCOM+112                                               01621000
ATCPTCHA EQU   ATCCOM+108                                               01622000
ATCAUTHA EQU   ATCCOM+104                                               01623000
ATCACCTA EQU   ATCCOM+100                                               01624000
ATCRDTH  EQU   ATCCOM+96                                                01625000
ATCFRSCH EQU   ATCCOM+92                                                01626000
ATCFSB   EQU   ATCCOM+88                                                01627000
ATCHLTMS EQU   ATCCOM+84                                                01628000
ATCECPRM EQU   ATCCOM+80                                                01629000
ATCECNET EQU   ATCCOM+76                                                01630000
ATCECOPC EQU   ATCCOM+72                                                01631000
ATCVPARM EQU   ATCCOM+68                                                01632000
ATCECVRQ EQU   ATCCOM+64                                                01633000
ATCECSES EQU   ATCCOM+60                                                01634000
ATCOCHA  EQU   ATCCOM+56                                                01635000
ATCDSPLQ EQU   ATCCOM+52                                                01636000
ATCECDSP EQU   ATCCOM+48                                                01637000
ATCVARYQ EQU   ATCCOM+44                                                01638000
ATCECVRY EQU   ATCCOM+40                                                01639000
ATCHALTQ EQU   ATCCOM+36                                                01640000
ATCECHLT EQU   ATCCOM+32                                                01641000
ATCMODQ  EQU   ATCCOM+28                                                01642000
ATCECMOD EQU   ATCCOM+24                                                01643000
ATCASCHD EQU   ATCCOM+20                                                01644000
ATCSRT   EQU   ATCCOM+16                                                01645000
ATCRDT   EQU   ATCCOM+12                                                01646000
ATCDCFRR EQU   ATCCOM+8                                                 01647000
ATCAPI   EQU   ATCCOM+4                                                 01648000
ATCRSV04 EQU   ATCSTAT4                                                 01649000
ATCVTTRC EQU   ATCSTAT4                                                 01650000
ATCNCSD  EQU   ATCSTAT4                                                 01651000
ATCMTST  EQU   ATCSTAT4                                                 01652000
ATCTPRT  EQU   ATCSTAT4                                                 01653000
ATCPRTAT EQU   ATCSTAT4                                                 01654000
@NM00053 EQU   ATCPOFLG                                                 01655000
ATCPOUNS EQU   ATCPOFLG                                                 01656000
ATCHSDMF EQU   ATCSTFLG                                                 01657000
@NM00052 EQU   ATCSTAT1                                                 01658000
ATCMDHLT EQU   ATCSTAT1                                                 01659000
ATCINHLT EQU   ATCSTAT1                                                 01660000
ATCNETSL EQU   ATCSTAT1                                                 01661000
ATCQKHLT EQU   ATCSTAT1                                                 01662000
ATCSNHLT EQU   ATCSTAT1                                                 01663000
ATCACTIV EQU   ATCSTAT1                                                 01664000
ATCSTART EQU   ATCSTAT1                                                 01665000
LOKXCL   EQU   @NM00050                                                 01666000
LOKPRY   EQU   @NM00050                                                 01667000
@NM00051 EQU   @NM00050                                                 01668000
@NM00049 EQU   LOKCHNG                                                  01669000
LOKCT    EQU   ISTLOK                                                   01670000
CRARSV02 EQU   ISTCRA+924                                               01671000
CRARSV01 EQU   ISTCRA+920                                               01672000
CRABFTBA EQU   CRABUFA                                                  01673000
CRAMASK  EQU   CRASVC+64                                                01674000
CRAHSIZ  EQU   CRASVC+60                                                01675000
CRAASCRR EQU   CRASVC                                                   01676000
CRAPROCR EQU   ISTCRA+312                                               01677000
CRALAPTR EQU   CRABASIC+48                                              01678000
CRAL9PTR EQU   CRABASIC+44                                              01679000
CRAL8PTR EQU   CRABASIC+40                                              01680000
CRAL7PTR EQU   CRABASIC+36                                              01681000
CRAL6PTR EQU   CRABASIC+32                                              01682000
CRAL5PTR EQU   CRABASIC+28                                              01683000
CRAL4PTR EQU   CRABASIC+24                                              01684000
CRAL3PTR EQU   CRABASIC+20                                              01685000
CRAL2PTR EQU   CRABASIC+16                                              01686000
CRAL1PTR EQU   CRABASIC+12                                              01687000
CRALEV01 EQU   CRALKACT+3                                               01688000
CRALEV02 EQU   CRALKACT+3                                               01689000
CRALEV03 EQU   CRALKACT+3                                               01690000
CRALEV04 EQU   CRALKACT+3                                               01691000
CRALEV05 EQU   CRALKACT+3                                               01692000
CRALEV06 EQU   CRALKACT+3                                               01693000
CRALEV07 EQU   CRALKACT+3                                               01694000
CRALEV08 EQU   CRALKACT+3                                               01695000
CRALEV09 EQU   CRALKACT+2                                               01696000
CRALEV10 EQU   CRALKACT+2                                               01697000
CRALEV11 EQU   CRALKACT+2                                               01698000
CRALEV12 EQU   CRALKACT+2                                               01699000
CRALEV13 EQU   CRALKACT+2                                               01700000
CRALEV14 EQU   CRALKACT+2                                               01701000
CRALEV15 EQU   CRALKACT+2                                               01702000
CRALEV16 EQU   CRALKACT+2                                               01703000
CRALEV17 EQU   CRALKACT+1                                               01704000
CRALEV18 EQU   CRALKACT+1                                               01705000
CRALEV19 EQU   CRALKACT+1                                               01706000
CRALEV20 EQU   CRALKACT+1                                               01707000
CRALEV21 EQU   CRALKACT+1                                               01708000
CRALEV22 EQU   CRALKACT+1                                               01709000
CRALEV23 EQU   CRALKACT+1                                               01710000
CRALEV24 EQU   CRALKACT+1                                               01711000
CRALEV25 EQU   CRALKACT                                                 01712000
CRALEV26 EQU   CRALKACT                                                 01713000
CRALEV27 EQU   CRALKACT                                                 01714000
CRALEV28 EQU   CRALKACT                                                 01715000
CRALEV29 EQU   CRALKACT                                                 01716000
CRALEV30 EQU   CRALKACT                                                 01717000
CRALEV31 EQU   CRALKACT                                                 01718000
CRALEV32 EQU   CRALKACT                                                 01719000
CRAFRR   EQU   CRAHDR+4                                                 01720000
@NM00048 EQU   ISTAPCRR+137                                             01721000
@NM00047 EQU   APC57FLG                                                 01722000
APCNREL  EQU   APC57FLG                                                 01723000
APCRECRA EQU   APC57FLG                                                 01724000
@NM00046 EQU   APC54FLG                                                 01725000
APCRLST  EQU   APC54FLG                                                 01726000
APCPR153 EQU   APC53FLG                                                 01727000
@NM00045 EQU   APC52FLG                                                 01728000
APCWKF   EQU   APC52FLG                                                 01729000
APCNWF   EQU   APC52FLG                                                 01730000
APCRDQ   EQU   APC52FLG                                                 01731000
APCQENQ  EQU   APC52FLG                                                 01732000
APCSMSR  EQU   APC52FLG                                                 01733000
APCCKRQ  EQU   APC52FLG                                                 01734000
@NM00044 EQU   APC31FLG                                                 01735000
APCSORT  EQU   APC31FLG                                                 01736000
APCRESCH EQU   APC31FLG                                                 01737000
APCTPXIT EQU   APC31FLG                                                 01738000
APCSWTWD EQU   ISTAPCRR+128                                             01739000
APCSAV2  EQU   ISTAPCRR+124                                             01740000
APCSAV1  EQU   ISTAPCRR+120                                             01741000
APCRETCD EQU   APCCOMF+2                                                01742000
@NM00043 EQU   APCCOMF1+1                                               01743000
APCZLBER EQU   APCCOMF1                                                 01744000
APCEXIT  EQU   APCCOMF1                                                 01745000
APCRELR  EQU   APCCOMF1                                                 01746000
APCIRB2  EQU   APCCOMF1                                                 01747000
APCIRB1  EQU   APCCOMF1                                                 01748000
APCSMCR  EQU   APCCOMF1                                                 01749000
APCUETSK EQU   APCCOMF1                                                 01750000
APCSSTSK EQU   APCCOMF1                                                 01751000
APCESTAL EQU   APCSAVE                                                  01752000
APCQWFO  EQU   ISTAPCRR+36                                              01753000
APCPABSV EQU   ISTAPCRR+32                                              01754000
APCTCBA  EQU   ISTAPCRR+24                                              01755000
@NM00042 EQU   APCRFLG+1                                                01756000
APC31R   EQU   APCRFLG                                                  01757000
APC58R   EQU   APCRFLG                                                  01758000
APC57R   EQU   APCRFLG                                                  01759000
APC56R   EQU   APCRFLG                                                  01760000
APC54R   EQU   APCRFLG                                                  01761000
APC53R   EQU   APCRFLG                                                  01762000
APC52R   EQU   APCRFLG                                                  01763000
APC51R   EQU   APCRFLG                                                  01764000
@NM00041 EQU   APCATFLG+1                                               01765000
APC31E   EQU   APCATFLG                                                 01766000
APC58E   EQU   APCATFLG                                                 01767000
APC57E   EQU   APCATFLG                                                 01768000
APC56E   EQU   APCATFLG                                                 01769000
APC54E   EQU   APCATFLG                                                 01770000
APC53E   EQU   APCATFLG                                                 01771000
APC52E   EQU   APCATFLG                                                 01772000
APC51E   EQU   APCATFLG                                                 01773000
ASCPSREG EQU   ISTASCRR+44                                              01774000
ASCUSR01 EQU   ASCUSRGS+12                                              01775000
ASCUSR00 EQU   ASCUSRGS+8                                               01776000
ASCUSR15 EQU   ASCUSRGS+4                                               01777000
ASCUSR14 EQU   ASCUSRGS                                                 01778000
ASCETRYA EQU   ISTASCRR+24                                              01779000
ASCKEY   EQU   ISTASCRR+23                                              01780000
ASCAUDIT EQU   ASCFLG3                                                  01781000
ASCFBDUD EQU   ASCFLG3                                                  01782000
ASCLLKF  EQU   ASCFLG3                                                  01783000
ASCKEYF  EQU   ASCFLG3                                                  01784000
ASCFBDAL EQU   ASCFLG3                                                  01785000
ASCFSRGT EQU   ASCFLG3                                                  01786000
ASCICR   EQU   ASCFLG2                                                  01787000
ASCFSRIC EQU   ASCFLG2                                                  01788000
ASCFBDIC EQU   ASCFLG2                                                  01789000
ASCFBAIC EQU   ASCFLG2                                                  01790000
ASCPASTR EQU   ASCFLG1                                                  01791000
ASCFSR   EQU   ASCFLG1                                                  01792000
ASCFBD   EQU   ASCFLG1                                                  01793000
ASCFBA   EQU   ASCFLG1                                                  01794000
ASCPFCRR EQU   ISTASCRR                                                 01795000
ZCRRU    EQU   ZCRRHRU+3                                                01796000
ZCRRH    EQU   ZCRRHRU                                                  01797000
ZCRWORDA EQU   ISTZCRR+477                                              01798000
ZCRCMNRC EQU   ISTZCRR+476                                              01799000
ZCRRSV97 EQU   ZCRENTER+18                                              01800000
ZCREIC2B EQU   ZCRENTER+18                                              01801000
ZCREAC2B EQU   ZCRENTER+18                                              01802000
ZCRELCAB EQU   ZCRENTER+18                                              01803000
ZCREDCMF EQU   ZCRENTER+18                                              01804000
ZCREBCIF EQU   ZCRENTER+18                                              01805000
ZCREICSG EQU   ZCRENTER+18                                              01806000
ZCREDCK0 EQU   ZCRENTER+18                                              01807000
ZCRECFY0 EQU   ZCRENTER+17                                              01808000
ZCREKCCB EQU   ZCRENTER+17                                              01809000
ZCREDCNB EQU   ZCRENTER+17                                              01810000
ZCREICOE EQU   ZCRENTER+17                                              01811000
ZCREBCNB EQU   ZCRENTER+17                                              01812000
ZCREBC0L EQU   ZCRENTER+17                                              01813000
ZCREBCAL EQU   ZCRENTER+17                                              01814000
ZCREDCQR EQU   ZCRENTER+17                                              01815000
ZCREDCPR EQU   ZCRENTER+16                                              01816000
ZCREBCSB EQU   ZCRENTER+16                                              01817000
ZCREAC1R EQU   ZCRENTER+16                                              01818000
ZCRECCCI EQU   ZCRENTER+16                                              01819000
ZCRECCAI EQU   ZCRENTER+16                                              01820000
ZCRECCBI EQU   ZCRENTER+16                                              01821000
ZCREBCAR EQU   ZCRENTER+16                                              01822000
ZCREBCDR EQU   ZCRENTER+16                                              01823000
ZCREBCBR EQU   ZCRENTER+15                                              01824000
ZCREDCXR EQU   ZCRENTER+15                                              01825000
ZCREDCWB EQU   ZCRENTER+15                                              01826000
ZCREDCWR EQU   ZCRENTER+15                                              01827000
ZCREKCCN EQU   ZCRENTER+15                                              01828000
ZCREKCBN EQU   ZCRENTER+15                                              01829000
ZCREKCBB EQU   ZCRENTER+15                                              01830000
ZCREJC0B EQU   ZCRENTER+15                                              01831000
ZCREJCDB EQU   ZCRENTER+14                                              01832000
ZCREJCCB EQU   ZCRENTER+14                                              01833000
ZCREJCBB EQU   ZCRENTER+14                                              01834000
ZCREJCAB EQU   ZCRENTER+14                                              01835000
ZCREIC1B EQU   ZCRENTER+14                                              01836000
ZCREIC0B EQU   ZCRENTER+14                                              01837000
ZCREICX0 EQU   ZCRENTER+14                                              01838000
ZCREICWB EQU   ZCRENTER+14                                              01839000
ZCREICVB EQU   ZCRENTER+13                                              01840000
ZCREICUB EQU   ZCRENTER+13                                              01841000
ZCREICTB EQU   ZCRENTER+13                                              01842000
ZCREICSC EQU   ZCRENTER+13                                              01843000
ZCREICSB EQU   ZCRENTER+13                                              01844000
ZCREICRB EQU   ZCRENTER+13                                              01845000
ZCREICQB EQU   ZCRENTER+13                                              01846000
ZCREICQA EQU   ZCRENTER+13                                              01847000
ZCREICOB EQU   ZCRENTER+12                                              01848000
ZCREICOA EQU   ZCRENTER+12                                              01849000
ZCREICNB EQU   ZCRENTER+12                                              01850000
ZCREICNA EQU   ZCRENTER+12                                              01851000
ZCREICMB EQU   ZCRENTER+12                                              01852000
ZCREICLB EQU   ZCRENTER+12                                              01853000
ZCREICKG EQU   ZCRENTER+12                                              01854000
ZCREICKE EQU   ZCRENTER+12                                              01855000
ZCREICKB EQU   ZCRENTER+11                                              01856000
ZCREICJB EQU   ZCRENTER+11                                              01857000
ZCREICID EQU   ZCRENTER+11                                              01858000
ZCREICIB EQU   ZCRENTER+11                                              01859000
ZCREICHB EQU   ZCRENTER+11                                              01860000
ZCREICGB EQU   ZCRENTER+11                                              01861000
ZCREICEB EQU   ZCRENTER+11                                              01862000
ZCREICDB EQU   ZCRENTER+11                                              01863000
ZCREICCI EQU   ZCRENTER+10                                              01864000
ZCREICCB EQU   ZCRENTER+10                                              01865000
ZCREICBI EQU   ZCRENTER+10                                              01866000
ZCREICBB EQU   ZCRENTER+10                                              01867000
ZCREICAB EQU   ZCRENTER+10                                              01868000
ZCREICAA EQU   ZCRENTER+10                                              01869000
ZCREHCAN EQU   ZCRENTER+10                                              01870000
ZCREGC0B EQU   ZCRENTER+10                                              01871000
ZCREGC0A EQU   ZCRENTER+9                                               01872000
ZCREGCLA EQU   ZCRENTER+9                                               01873000
ZCREGCEB EQU   ZCRENTER+9                                               01874000
ZCREGCDB EQU   ZCRENTER+9                                               01875000
@NM00040 EQU   ZCRENTER+9                                               01876000
ZCREGCBB EQU   ZCRENTER+9                                               01877000
ZCREGCAB EQU   ZCRENTER+9                                               01878000
ZCREFCEB EQU   ZCRENTER+9                                               01879000
ZCREFCEA EQU   ZCRENTER+8                                               01880000
ZCREECTA EQU   ZCRENTER+8                                               01881000
ZCREECEA EQU   ZCRENTER+8                                               01882000
ZCREECDA EQU   ZCRENTER+8                                               01883000
ZCREECCB EQU   ZCRENTER+8                                               01884000
ZCREECCA EQU   ZCRENTER+8                                               01885000
ZCREECBB EQU   ZCRENTER+8                                               01886000
ZCREECBA EQU   ZCRENTER+8                                               01887000
ZCREDCMB EQU   ZCRENTER+7                                               01888000
ZCREDCL0 EQU   ZCRENTER+7                                               01889000
ZCREDCKB EQU   ZCRENTER+7                                               01890000
ZCREDCKA EQU   ZCRENTER+7                                               01891000
ZCREDCJ0 EQU   ZCRENTER+7                                               01892000
ZCREDCI0 EQU   ZCRENTER+7                                               01893000
ZCREDCH0 EQU   ZCRENTER+7                                               01894000
ZCREDCF0 EQU   ZCRENTER+7                                               01895000
ZCREDCE0 EQU   ZCRENTER+6                                               01896000
ZCREDCD0 EQU   ZCRENTER+6                                               01897000
ZCREDCC0 EQU   ZCRENTER+6                                               01898000
ZCREDCB0 EQU   ZCRENTER+6                                               01899000
ZCREDCA0 EQU   ZCRENTER+6                                               01900000
ZCRECC2B EQU   ZCRENTER+6                                               01901000
ZCRECC1B EQU   ZCRENTER+6                                               01902000
ZCRECC1A EQU   ZCRENTER+6                                               01903000
ZCRECC0B EQU   ZCRENTER+5                                               01904000
ZCRECC0A EQU   ZCRENTER+5                                               01905000
ZCREBC0B EQU   ZCRENTER+5                                               01906000
ZCREBC0A EQU   ZCRENTER+5                                               01907000
ZCREBCZ0 EQU   ZCRENTER+5                                               01908000
ZCREBCY0 EQU   ZCRENTER+5                                               01909000
ZCREBCX0 EQU   ZCRENTER+5                                               01910000
ZCREBCXA EQU   ZCRENTER+5                                               01911000
ZCREBCSC EQU   ZCRENTER+4                                               01912000
ZCREBCRB EQU   ZCRENTER+4                                               01913000
ZCREBCRA EQU   ZCRENTER+4                                               01914000
ZCREBCQB EQU   ZCRENTER+4                                               01915000
ZCREBCPB EQU   ZCRENTER+4                                               01916000
ZCREBCOB EQU   ZCRENTER+4                                               01917000
ZCREBCNE EQU   ZCRENTER+4                                               01918000
ZCREBCND EQU   ZCRENTER+4                                               01919000
ZCREBCMB EQU   ZCRENTER+3                                               01920000
ZCREBCLB EQU   ZCRENTER+3                                               01921000
ZCREBCLA EQU   ZCRENTER+3                                               01922000
ZCREBCKB EQU   ZCRENTER+3                                               01923000
ZCREBCKA EQU   ZCRENTER+3                                               01924000
ZCREBCJB EQU   ZCRENTER+3                                               01925000
ZCREBCJA EQU   ZCRENTER+3                                               01926000
ZCREBCID EQU   ZCRENTER+3                                               01927000
ZCREBCIB EQU   ZCRENTER+2                                               01928000
ZCREBCIA EQU   ZCRENTER+2                                               01929000
ZCREBCHB EQU   ZCRENTER+2                                               01930000
ZCREBCHA EQU   ZCRENTER+2                                               01931000
ZCREBCGB EQU   ZCRENTER+2                                               01932000
ZCREBCGA EQU   ZCRENTER+2                                               01933000
ZCREBCFB EQU   ZCRENTER+2                                               01934000
ZCREBCFA EQU   ZCRENTER+2                                               01935000
ZCREBCEB EQU   ZCRENTER+1                                               01936000
ZCREBCDI EQU   ZCRENTER+1                                               01937000
ZCREBCCB EQU   ZCRENTER+1                                               01938000
ZCREBCBI EQU   ZCRENTER+1                                               01939000
ZCREBCBB EQU   ZCRENTER+1                                               01940000
ZCREBCBA EQU   ZCRENTER+1                                               01941000
ZCREBCAM EQU   ZCRENTER+1                                               01942000
ZCREBCAI EQU   ZCRENTER+1                                               01943000
ZCREBCAG EQU   ZCRENTER                                                 01944000
ZCREBCAE EQU   ZCRENTER                                                 01945000
ZCREBCAB EQU   ZCRENTER                                                 01946000
ZCREBCAA EQU   ZCRENTER                                                 01947000
ZCREAC1B EQU   ZCRENTER                                                 01948000
ZCREAC0B EQU   ZCRENTER                                                 01949000
ZCREAC0A EQU   ZCRENTER                                                 01950000
ZCREAC1A EQU   ZCRENTER                                                 01951000
ZCRTNAME EQU   ZCRAUDIT+1                                               01952000
ZCRTID   EQU   ZCRAUDIT                                                 01953000
ZCRREMIC EQU   ISTZCRR+436                                              01954000
ZCRSAVEZ EQU   ISTZCRR+196                                              01955000
ZCRDAFSV EQU   ZCRCIDSV+2                                               01956000
ZCRSAFSV EQU   ZCRCIDSV                                                 01957000
ZCRR13SV EQU   ISTZCRR+188                                              01958000
ZCRR2SV  EQU   ISTZCRR+184                                              01959000
ZCROPCDE EQU   ISTZCRR+183                                              01960000
ZCRPRMTC EQU   ISTZCRR+182                                              01961000
ZCRRCDSV EQU   ISTZCRR+181                                              01962000
ZCRAWQSW EQU   ISTZCRR+180                                              01963000
ZCRTOPQ  EQU   ISTZCRR+180                                              01964000
ZCRLSTFB EQU   ISTZCRR+180                                              01965000
ZCRXSCHD EQU   ISTZCRR+180                                              01966000
ZCRNXTEL EQU   ISTZCRR+180                                              01967000
ZCRSCANQ EQU   ISTZCRR+180                                              01968000
ZCRMOREL EQU   ISTZCRR+180                                              01969000
ZCRFBPRC EQU   ISTZCRR+180                                              01970000
ZCRFSBSV EQU   ISTZCRR+176                                              01971000
ZCRSVWK5 EQU   ZCRWKARA+16                                              01972000
ZCRSVWK4 EQU   ZCRWKARA+12                                              01973000
ZCRSVWK3 EQU   ZCRWKARA+8                                               01974000
ZCRSVWK2 EQU   ZCRWKARA+4                                               01975000
ZCRSVWK1 EQU   ZCRWKARA                                                 01976000
ZCRSVF25 EQU   ZCRSVRTN+96                                              01977000
ZCRSVF24 EQU   ZCRSVRTN+92                                              01978000
ZCRSVF23 EQU   ZCRSVRTN+88                                              01979000
ZCRSVF22 EQU   ZCRSVRTN+84                                              01980000
ZCRSVF21 EQU   ZCRSVRTN+80                                              01981000
ZCRSVF20 EQU   ZCRSVRTN+76                                              01982000
ZCRSVF19 EQU   ZCRSVRTN+72                                              01983000
ZCRSVF18 EQU   ZCRSVRTN+68                                              01984000
ZCRSVF17 EQU   ZCRSVRTN+64                                              01985000
ZCRSVF16 EQU   ZCRSVRTN+60                                              01986000
ZCRSVF15 EQU   ZCRSVRTN+56                                              01987000
ZCRSVF14 EQU   ZCRSVRTN+52                                              01988000
ZCRSVF13 EQU   ZCRSVRTN+48                                              01989000
ZCRSVF12 EQU   ZCRSVRTN+44                                              01990000
ZCRSVF11 EQU   ZCRSVRTN+40                                              01991000
ZCRSVF10 EQU   ZCRSVRTN+36                                              01992000
ZCRSVF9  EQU   ZCRSVRTN+32                                              01993000
ZCRSVF8  EQU   ZCRSVRTN+28                                              01994000
ZCRSVF7  EQU   ZCRSVRTN+24                                              01995000
ZCRSVF6  EQU   ZCRSVRTN+20                                              01996000
ZCRSVF5  EQU   ZCRSVRTN+16                                              01997000
ZCRSVF4  EQU   ZCRSVRTN+12                                              01998000
ZCRSVF3  EQU   ZCRSVRTN+8                                               01999000
ZCRSVF2  EQU   ZCRSVRTN+4                                               02000000
ZCRSVF1  EQU   ZCRSVRTN                                                 02001000
ZCRPVZB  EQU   ISTZCRR+52                                               02002000
ZCRZLB   EQU   ISTZCRR+48                                               02003000
ZCRBFPTR EQU   ISTZCRR+44                                               02004000
ZCRCCWA  EQU   ISTZCRR+40                                               02005000
ZCRPSW   EQU   ZCRPARMS+15                                              02006000
ZCRPCHAR EQU   ZCRPARMS+14                                              02007000
ZCRPRES2 EQU   ZCRPCOD2                                                 02008000
ZCRPMFGF EQU   ZCRPCOD2                                                 02009000
ZCRPFHDR EQU   ZCRPCOD2                                                 02010000
ZCRPPG2  EQU   ZCRPCOD2                                                 02011000
ZCRPRES  EQU   ZCRPCOD1                                                 02012000
ZCRPCFTX EQU   ZCRPCOD1                                                 02013000
ZCRPBUF  EQU   ZCRPCOD1                                                 02014000
ZCRPLSCB EQU   ZCRPCOD1                                                 02015000
ZCRPLSBQ EQU   ZCRPLSBF                                                 02016000
ZCRPFSB  EQU   ZCRPCOD1                                                 02017000
ZCRPLNG  EQU   ZCRPCOD1                                                 02018000
ZCRPPG   EQU   ZCRPCOD1                                                 02019000
ZCRDTODA EQU   ZCRDFRDA                                                 02020000
ZCRMLNG  EQU   ZCRPARMS+8                                               02021000
ZCRTBPTR EQU   ZCRPARMS+4                                               02022000
ZCRCBPTR EQU   ZCRFBPTR                                                 02023000
ZCRCRLCP EQU   ISTZCRR+20                                               02024000
@NM00039 EQU   ZCRSCPSW                                                 02025000
ZCRSKIPT EQU   ZCRSCPSW                                                 02026000
ZCRFSBWE EQU   ZCRSCPSW                                                 02027000
ZCRPRCMP EQU   ZCRSCPSW                                                 02028000
ZCRLREQ  EQU   ZCRSCPSW                                                 02029000
ZCRRJLCP EQU   ZCRSCPSW                                                 02030000
ZCRTPINV EQU   ZCRSCPSW                                                 02031000
ZCRTPEX  EQU   ZCRSCPSW                                                 02032000
@NM00038 EQU   ZCRIBPR                                                  02033000
ZCR3270R EQU   ZCRIBPR                                                  02034000
ZCR3270  EQU   ZCRIBPR                                                  02035000
ZCRLCPFD EQU   ZCRIBPR                                                  02036000
ZCRLCPFR EQU   ZCRIBPR                                                  02037000
ZCRRELK  EQU   ZCRIBPR                                                  02038000
ZCRERR   EQU   ZCRIBPR                                                  02039000
ZCRNOBUF EQU   ZCRIBPR                                                  02040000
@NM00037 EQU   ZCRPFLGS                                                 02041000
ZCRQAHED EQU   ZCRPFLGS                                                 02042000
ZCRF1RES EQU   ZCRGENSW                                                 02043000
ZCRBRIS  EQU   ZCRGENSW                                                 02044000
ZCRCLRBD EQU   ZCRGENSW                                                 02045000
ZCREXRES EQU   ZCRGENSW                                                 02046000
ZCRLCSYN EQU   ZCRGENSW                                                 02047000
ZCRRT06  EQU   ZCRGENSW                                                 02048000
ZCRTSW2  EQU   ZCRGENSW                                                 02049000
ZCRTSW1  EQU   ZCRGENSW                                                 02050000
ZCRINLCP EQU   ZCRFLGS3                                                 02051000
ZCRWRPTR EQU   ZCRFLGS3                                                 02052000
ZCRNOFRE EQU   ZCRFLGS3                                                 02053000
ZCREDRIV EQU   ZCRFLGS3                                                 02054000
ZCRDISC  EQU   ZCRFLGS3                                                 02055000
ZCRTPDIS EQU   ZCRFLGS3                                                 02056000
ZCRTPCON EQU   ZCRFLGS3                                                 02057000
ZCRTIC   EQU   ZCRFLGS3                                                 02058000
ZCRCNLXL EQU   ZCRRESET                                                 02059000
ZCRENDAN EQU   ZCRSWFLD                                                 02060000
ZCRENDXL EQU   ZCRSWFLD                                                 02061000
ZCRENDX  EQU   ZCRSWFLD                                                 02062000
ZCROB1   EQU   ZCRNDLCP                                                 02063000
ZCRENDPR EQU   ZCRSWFLD                                                 02064000
ZCREXTYP EQU   ZCRSWFLD                                                 02065000
ZCRSLCP  EQU   ZCRENDSH                                                 02066000
ZCRIF0E3 EQU   ZCRFLGS2                                                 02067000
ZCRIF0E2 EQU   ZCRFLGS2                                                 02068000
ZCRIF0E1 EQU   ZCRFLGS2                                                 02069000
ZCROB    EQU   ZCRFLGS2                                                 02070000
ZCRFMSED EQU   ZCRFLGS2                                                 02071000
ZCRSHEDI EQU   ZCRFLGS2                                                 02072000
ZCRLOCAL EQU   ZCRFLGS2                                                 02073000
ZCRFEXIT EQU   ZCRFLGS1                                                 02074000
ZCRUNSOL EQU   ZCRFLGS1                                                 02075000
ZCRENDLP EQU   ZCRFLGS1                                                 02076000
ZCRNRMEX EQU   ZCRFLGS1                                                 02077000
ZCRWAIT  EQU   ZCRFLGS1                                                 02078000
ZCRDEQSW EQU   ZCRFLGS1                                                 02079000
ZCRQUESW EQU   ZCRFLGS1                                                 02080000
ZCREXSW  EQU   ZCRFLGS1                                                 02081000
ZCRFRRA  EQU   ISTZCRR+8                                                02082000
ZCRCHAIN EQU   ISTZCRR+4                                                02083000
ZCRFLAG  EQU   ZCRCRR+3                                                 02084000
ZCRLEN   EQU   ZCRCRR+1                                                 02085000
ZCRID    EQU   ZCRCRR                                                   02086000
CCFRSVD1 EQU   CFCCRT                                                   02087000
CCFCR2   EQU   CFCCRT                                                   02088000
CCFCRP   EQU   CFCCRT                                                   02089000
CCFCR1   EQU   CFCCRT                                                   02090000
CCFCS2   EQU   CFCCRT                                                   02091000
CCFCS1   EQU   CFCCRT                                                   02092000
NCFRSVD  EQU   CFCNTRD                                                  02093000
NCFCR2   EQU   CFCNTRD                                                  02094000
NCFCRP   EQU   CFCNTRD                                                  02095000
NCFCR1   EQU   CFCNTRD                                                  02096000
NCFCS2   EQU   CFCNTRD                                                  02097000
NCFCS1   EQU   CFCNTRD                                                  02098000
PFCRSV01 EQU   ISTPFCRR+13                                              02099000
PFCFTA   EQU   ISTPFCRR+12                                              02100000
CRRFRR   EQU   PFCFRRO                                                  02101000
CRRCHAIN EQU   PFCCRRO                                                  02102000
CRRLEN   EQU   PFCCRRLN                                                 02103000
PFCRSV10 EQU   PFCCRR+1                                                 02104000
CRRID    EQU   PFCCRRID                                                 02105000
ZSAZTRAC EQU   ISTZSAVE+36                                              02106000
ZSAZSVVR EQU   ISTZSAVE+12                                              02107000
ZSAZSVRR EQU   ISTZSAVE+8                                               02108000
ZSAZSVFC EQU   ISTZSAVE+4                                               02109000
ZSAZACTV EQU   ZSAZSVMS                                                 02110000
LCPFTYPE EQU   LCPRPHA                                                  02111000
LCPRSTQH EQU   LCPLCCW                                                  02112000
LCPCLREP EQU   ISTLCPB+44                                               02113000
LCPUBFSB EQU   LCPFLCCW                                                 02114000
LCPRSV77 EQU   ISTLCPB+39                                               02115000
LCPLCCWC EQU   ISTLCPB+38                                               02116000
LCPRSV78 EQU   LCPFLG1                                                  02117000
LCPTRANS EQU   LCPFLG1                                                  02118000
LCPSTLB  EQU   LCPFLG1                                                  02119000
LCPREDRV EQU   LCPFLG1                                                  02120000
LCPDIRPT EQU   LCPFLG1                                                  02121000
LCPINTER EQU   LCPFLG1                                                  02122000
LCPRESET EQU   LCPFLG1                                                  02123000
LCPSTYPE EQU   ISTLCPB+36                                               02124000
LCPFSNCH EQU   ISTLCPB+34                                               02125000
LCPFOSN  EQU   ISTLCPB+32                                               02126000
LCPTLBAD EQU   ISTLCPB+28                                               02127000
LCPFDB2  EQU   LCPFDBA+1                                                02128000
LCPFDB1  EQU   LCPFDBA                                                  02129000
LCPNXLCW EQU   ISTLCPB+20                                               02130000
LCPDAF   EQU   LCPCID+2                                                 02131000
LCPSAF   EQU   LCPCID                                                   02132000
LCPLCCW1 EQU   ISTLCPB+12                                               02133000
LCPRRCNT EQU   LCPSEQ+1                                                 02134000
LCPRRCCT EQU   LCPSEQ                                                   02135000
LCPATOP  EQU   LCPFLAG2                                                 02136000
LCPFREE  EQU   LCPFLAG2                                                 02137000
LCPDSTAT EQU   LCPFLAG2                                                 02138000
LCPEXRES EQU   LCPFID0                                                  02139000
LCPZRIMM EQU   LCPTLBPI                                                 02140000
LCPRSTRT EQU   LCPFLAG2                                                 02141000
LCPASYN  EQU   LCPFLAG2                                                 02142000
LCPPRFLG EQU   LCPFLAG2                                                 02143000
LCPZMIRC EQU   LCPRUCNT                                                 02144000
LCPCHAI2 EQU   LCPCHAIN+1                                               02145000
LCPCHNG  EQU   LCPCHAI1                                                 02146000
LCPZRT0B EQU   LCPMNRCD                                                 02147000
LCPZRT0A EQU   LCPMNRCD                                                 02148000
LCPZRTL9 EQU   LCPZRT09                                                 02149000
LCPZRTL8 EQU   LCPZRT08                                                 02150000
LCPZRTL7 EQU   LCPZRT07                                                 02151000
LCPZRTL6 EQU   LCPZRT06                                                 02152000
LCPZRTL5 EQU   LCPZRT05                                                 02153000
LCPZRTL4 EQU   LCPZRT04                                                 02154000
LCPZRTL3 EQU   LCPZRT03                                                 02155000
LCPZRTL2 EQU   LCPZRT02                                                 02156000
LCPZRT01 EQU   LCPFLAGS                                                 02157000
LCPZRT00 EQU   LCPFLAGS                                                 02158000
LCPLNGTH EQU   ISTLCPB+1                                                02159000
LCPTYPE  EQU   ISTLCPB                                                  02160000
LCCWDATA EQU   ISTLCCW+4                                                02161000
LCCWCNT  EQU   ISTLCCW+2                                                02162000
LCCWACI  EQU   LCCWFLAG                                                 02163000
LCCWRFI  EQU   LCCWFLAG                                                 02164000
LCCWPER  EQU   LCCWLSI                                                  02165000
LCCWIDAT EQU   LCCWFLAG                                                 02166000
LCCWNTVC EQU   LCCWFLAG                                                 02167000
LCCWCKPT EQU   LCCWFLAG                                                 02168000
LCCWCC   EQU   LCCWFLAG                                                 02169000
LCCWCD   EQU   LCCWFLAG                                                 02170000
LCCWTYPE EQU   LCCWCTL                                                  02171000
LCCWMODE EQU   LCCWCTL                                                  02172000
LCCWSOP  EQU   LCCWRWOP                                                 02173000
@NM00036 EQU   LCCWRWOP                                                 02174000
LCCWSD   EQU   LCCWOP                                                   02175000
LCCWSI   EQU   LCCWOP                                                   02176000
MPSSRB1  EQU   ISTMPST+172                                              02177000
MPSSAVE  EQU   ISTMPST+140                                              02178000
MPSMQLBP EQU   ISTMPST+136                                              02179000
MPSSYSRT EQU   ISTMPST+132                                              02180000
MPSQEL   EQU   ISTMPST+128                                              02181000
MPSDBTBL EQU   ISTMPST+124                                              02182000
MPSASCB  EQU   ISTMPST+120                                              02183000
MPSTPPAB EQU   ISTMPST+88                                               02184000
MPSSMPAB EQU   ISTMPST+56                                               02185000
MPSSMRPH EQU   ISTMPST+52                                               02186000
MPSSRB55 EQU   ISTMPST+48                                               02187000
MPSRPLAC EQU   MPSRPLCT+2                                               02188000
MPSRPLRC EQU   MPSRPLCT                                                 02189000
MPSCRPLQ EQU   MPSCRPL                                                  02190000
MPSSRBAC EQU   MPSSRBCT+2                                               02191000
MPSSRBRC EQU   MPSSRBCT                                                 02192000
MPSSRBQ  EQU   MPSSRB                                                   02193000
MPSCRAAC EQU   MPSCRACT+2                                               02194000
MPSCRARC EQU   MPSCRACT                                                 02195000
MPSCRAQ  EQU   MPSCRA                                                   02196000
MPSMPSTP EQU   ISTMPST+20                                               02197000
MPSPSTCT EQU   ISTMPST+16                                               02198000
MPSASID  EQU   MPSFLGA+2                                                02199000
MPSRSV02 EQU   MPSFLGA+1                                                02200000
MPSPSTAB EQU   MPSFLGA                                                  02201000
MPSRSV01 EQU   MPSFLGA                                                  02202000
MPSTPBU  EQU   MPSFLGA                                                  02203000
MPMEMTRM EQU   MPSFLGA                                                  02204000
MPSAUTH  EQU   MPSFLGA                                                  02205000
MPSCRAO  EQU   MPSFLGA                                                  02206000
MPSSRBO  EQU   MPSFLGA                                                  02207000
MPSRQUEG EQU   MPSRQUE                                                  02208000
MPSRSV07 EQU   ISTMPST+4                                                02209000
MPSID    EQU   ISTMPST                                                  02210000
PSTDRDYQ EQU   PSTDMPS+1                                                02211000
@NM00035 EQU   PSTDMPS                                                  02212000
PSTDGATE EQU   PSTDMPS                                                  02213000
PSTDEBP  EQU   ISTPST+128                                               02214000
PSTSAVE  EQU   ISTPST+96                                                02215000
PSTSMDYP EQU   ISTPST+64                                                02216000
PSTCRRS  EQU   ISTPST+60                                                02217000
PSTCRR1  EQU   ISTPST+56                                                02218000
PSTIQE22 EQU   ISTPST+52                                                02219000
PSTIQE21 EQU   ISTPST+48                                                02220000
PSTIQE12 EQU   ISTPST+44                                                02221000
PSTIQE11 EQU   ISTPST+40                                                02222000
PSTUEQ   EQU   ISTPST+36                                                02223000
PSTNSSQ  EQU   ISTPST+32                                                02224000
PSTPSSQ  EQU   ISTPST+28                                                02225000
PSTACBCT EQU   ISTPST+24                                                02226000
PSTTCBA  EQU   ISTPST+16                                                02227000
PSTRSV08 EQU   PSTFLGA+1                                                02228000
PSTDMPC  EQU   PSTFLGA+1                                                02229000
PSTABEND EQU   PSTABINP                                                 02230000
PSTAUTH  EQU   PSTFLGA                                                  02231000
PSTSMCU  EQU   PSTFLGA                                                  02232000
PSTSMQR  EQU   PSTFLGA                                                  02233000
PSTIRBU2 EQU   PSTFLGA                                                  02234000
PSTIRBU1 EQU   PSTFLGA                                                  02235000
PSTUERN  EQU   PSTFLGA                                                  02236000
PSTSSRN  EQU   PSTFLGA                                                  02237000
PSTRQUEA EQU   PSTRQUE+1                                                02238000
PSTRSV07 EQU   PSTRQUE                                                  02239000
PSTRSV06 EQU   PSTRQUE                                                  02240000
PSTRSV05 EQU   PSTRQUE                                                  02241000
PSTRSV04 EQU   PSTRQUE                                                  02242000
PSTRSV03 EQU   PSTRQUE                                                  02243000
PSTRSV02 EQU   PSTRQUE                                                  02244000
PSTRSV01 EQU   PSTRQUE                                                  02245000
PSTRQFLG EQU   PSTRQUE                                                  02246000
PSTCHAIN EQU   ISTPST+4                                                 02247000
@NM00034 EQU   ISTPST+2                                                 02248000
PSTLNGTH EQU   ISTPST+1                                                 02249000
PSTTYPE  EQU   ISTPST                                                   02250000
RPHNEXPO EQU   ISTRPH+104                                               02251000
RPHSAV16 EQU   RPHWORK+60                                               02252000
RPHSAV15 EQU   RPHWORK+56                                               02253000
RPHSAV14 EQU   RPHWORK+52                                               02254000
RPHSAV13 EQU   RPHWORK+48                                               02255000
RPHSAV12 EQU   RPHWORK+44                                               02256000
RPHSAV11 EQU   RPHWORK+40                                               02257000
RPHSAV10 EQU   RPHWORK+36                                               02258000
RPHSAVE9 EQU   RPHWORK+32                                               02259000
RPHSAVE8 EQU   RPHWORK+28                                               02260000
RPHSAVE7 EQU   RPHWORK+24                                               02261000
RPHSAVE6 EQU   RPHWORK+20                                               02262000
RPHSAVE5 EQU   RPHWORK+16                                               02263000
RPHSAVE4 EQU   RPHWORK+12                                               02264000
RPHSAVE3 EQU   RPHWORK+8                                                02265000
RPHSAVE2 EQU   RPHWORK+4                                                02266000
RPHSHALF EQU   RPHSAVE1+2                                               02267000
RPHSBIT8 EQU   RPHSBITS                                                 02268000
RPHSBIT7 EQU   RPHSBITS                                                 02269000
RPHSBIT6 EQU   RPHSBITS                                                 02270000
RPHSBIT5 EQU   RPHSBITS                                                 02271000
RPHSBIT4 EQU   RPHSBITS                                                 02272000
RPHSBIT3 EQU   RPHSBITS                                                 02273000
RPHSBIT2 EQU   RPHSBITS                                                 02274000
RPHSBIT1 EQU   RPHSBITS                                                 02275000
RPHSBYTE EQU   RPHSAVE1                                                 02276000
RPHPABQP EQU   RPHPABQA+1                                               02277000
RPHPABFG EQU   RPHPABQA                                                 02278000
RPHSRP34 EQU   RPHSRPRM+2                                               02279000
RPHSRP12 EQU   RPHSRPRM                                                 02280000
RPHWEGT  EQU   RPHCSPA                                                  02281000
RPHRESUM EQU   RPHRESMA+1                                               02282000
RPHRSV01 EQU   RPHWPFLG                                                 02283000
RPHPURGE EQU   RPHWPFLG                                                 02284000
RPHPT    EQU   RPHWPFLG                                                 02285000
RPHWT    EQU   RPHWPFLG                                                 02286000
RPHRSKEY EQU   RPHWPFLG                                                 02287000
RPHTIK   EQU   RPHTSKID+3                                               02288000
@NM00033 EQU   RPHTSKID                                                 02289000
RPHRPHAP EQU   RPHRPHA+1                                                02290000
@NM00032 EQU   RPHRPHA                                                  02291000
RPHGATE  EQU   RPHRPHA                                                  02292000
@NM00031 EQU   RPHFLGB                                                  02293000
RPHRLCRA EQU   RPHFLGB                                                  02294000
RPHNRSAV EQU   RPHFLGB                                                  02295000
RPHPGCMP EQU   RPHFLGB                                                  02296000
RPHFBAPS EQU   RPHFLGB                                                  02297000
RPHBSSP  EQU   RPHFLGB                                                  02298000
RPHLOCK  EQU   RPHFLGB                                                  02299000
RPHFNFLG EQU   RPHFSTLC                                                 02300000
RPHMLTCP EQU   RPHFLAGS                                                 02301000
RPHSMCLR EQU   RPHFLAGS                                                 02302000
RPHSMTYP EQU   RPHFLAGS                                                 02303000
RPHSMQ   EQU   RPHFLAGS                                                 02304000
RPHAUTEX EQU   RPHAPTYP                                                 02305000
RPHSPGIN EQU   RPHFLAGS                                                 02306000
RPHOGIND EQU   RPHFLAGS                                                 02307000
DYPPAB   EQU   ISTDYPAB+16                                              02308000
DYPRSV01 EQU   ISTDYPAB+12                                              02309000
DYPCHAIN EQU   ISTDYPAB+4                                               02310000
DYPFLGS  EQU   ISTDYPAB+2                                               02311000
DYPLNGTH EQU   ISTDYPAB+1                                               02312000
DYPTYPE  EQU   ISTDYPAB                                                 02313000
PABINHBT EQU   PABFLAGS                                                 02314000
PABERLOK EQU   PABERRLK                                                 02315000
PABSSN   EQU   PABFLAGS                                                 02316000
PABDYNAM EQU   PABFLAGS                                                 02317000
PABNORPR EQU   PABFLAGS                                                 02318000
PABPRIOR EQU   PABFLAGS                                                 02319000
PABAPYP  EQU   PABFLAGS                                                 02320000
PABCHNGP EQU   PABCHAIN+1                                               02321000
PABRSV02 EQU   PABCHAIN                                                 02322000
PABDELAY EQU   PABCHAIN                                                 02323000
PABRUNNG EQU   PABCHAIN                                                 02324000
PABRESET EQU   PABCHAIN                                                 02325000
PABUNCON EQU   PABCHAIN                                                 02326000
PABCDP   EQU   PABCHAIN                                                 02327000
PABRESCH EQU   PABCHAIN                                                 02328000
PABCHNG  EQU   PABCHAIN                                                 02329000
PABWEQP  EQU   PABWEQA+1                                                02330000
PABRSV01 EQU   PABWEQA                                                  02331000
PABWEQG  EQU   PABWEQA                                                  02332000
CVTLEVL  EQU   CVTRELNO+2                                               02333000
CVTNUMB  EQU   CVTRELNO                                                 02334000
CVTMDL   EQU   CVTFIX+250                                               02335000
@NM00030 EQU   CVTFIX+248                                               02336000
@NM00029 EQU   CVTFIX                                                   02337000
CVTRV482 EQU   CVTXTNT2+128                                             02338000
CVTRV481 EQU   CVTXTNT2+124                                             02339000
CVTRV480 EQU   CVTXTNT2+120                                             02340000
CVTRV479 EQU   CVTXTNT2+118                                             02341000
CVTRV478 EQU   CVTXTNT2+117                                             02342000
CVTRV477 EQU   CVTXTNT2+116                                             02343000
CVTRV476 EQU   CVTXTNT2+115                                             02344000
CVTRV475 EQU   CVTXTNT2+114                                             02345000
CVTRV474 EQU   CVTRV466                                                 02346000
CVTRV473 EQU   CVTRV466                                                 02347000
CVTRV472 EQU   CVTRV466                                                 02348000
CVTRV471 EQU   CVTRV466                                                 02349000
CVTRV470 EQU   CVTRV466                                                 02350000
CVTRV469 EQU   CVTRV466                                                 02351000
CVTRV468 EQU   CVTRV466                                                 02352000
CVTRV467 EQU   CVTRV466                                                 02353000
CVTRV465 EQU   CVTRV457                                                 02354000
CVTRV464 EQU   CVTRV457                                                 02355000
CVTRV463 EQU   CVTRV457                                                 02356000
CVTRV462 EQU   CVTRV457                                                 02357000
CVTRV461 EQU   CVTRV457                                                 02358000
CVTRV460 EQU   CVTRV457                                                 02359000
CVTRV459 EQU   CVTRV457                                                 02360000
CVTRV458 EQU   CVTRV457                                                 02361000
CVTRV456 EQU   CVTXTNT2+108                                             02362000
CVTRV455 EQU   CVTXTNT2+104                                             02363000
CVTRV454 EQU   CVTXTNT2+100                                             02364000
CVTRV453 EQU   CVTXTNT2+96                                              02365000
CVTRV452 EQU   CVTXTNT2+94                                              02366000
CVTRV451 EQU   CVTXTNT2+92                                              02367000
CVTRV450 EQU   CVTXTNT2+90                                              02368000
CVTRV449 EQU   CVTXTNT2+88                                              02369000
CVTRV448 EQU   CVTXTNT2+87                                              02370000
CVTRV447 EQU   CVTXTNT2+86                                              02371000
CVTRV446 EQU   CVTRV438                                                 02372000
CVTRV445 EQU   CVTRV438                                                 02373000
CVTRV444 EQU   CVTRV438                                                 02374000
CVTRV443 EQU   CVTRV438                                                 02375000
CVTRV442 EQU   CVTRV438                                                 02376000
CVTRV441 EQU   CVTRV438                                                 02377000
CVTRV440 EQU   CVTRV438                                                 02378000
CVTRV439 EQU   CVTRV438                                                 02379000
CVTRV437 EQU   CVTRV429                                                 02380000
CVTRV436 EQU   CVTRV429                                                 02381000
CVTRV435 EQU   CVTRV429                                                 02382000
CVTRV434 EQU   CVTRV429                                                 02383000
CVTRV433 EQU   CVTRV429                                                 02384000
CVTRV432 EQU   CVTRV429                                                 02385000
CVTRV431 EQU   CVTRV429                                                 02386000
CVTRV430 EQU   CVTRV429                                                 02387000
CVTRV428 EQU   CVTXTNT2+80                                              02388000
CVTRV427 EQU   CVTXTNT2+76                                              02389000
CVTRV426 EQU   CVTXTNT2+72                                              02390000
CVTRV425 EQU   CVTXTNT2+68                                              02391000
CVTATACT EQU   CVTATCVT                                                 02392000
CVTRV423 EQU   CVTXTNT2+62                                              02393000
CVTRV422 EQU   CVTXTNT2+60                                              02394000
CVTRV421 EQU   CVTXTNT2+58                                              02395000
CVTRV420 EQU   CVTXTNT2+56                                              02396000
CVTRV419 EQU   CVTXTNT2+55                                              02397000
CVTRV418 EQU   CVTXTNT2+54                                              02398000
CVTRV417 EQU   CVTRV409                                                 02399000
CVTRV416 EQU   CVTRV409                                                 02400000
CVTRV415 EQU   CVTRV409                                                 02401000
CVTRV414 EQU   CVTRV409                                                 02402000
CVTRV413 EQU   CVTRV409                                                 02403000
CVTRV412 EQU   CVTRV409                                                 02404000
CVTRV411 EQU   CVTRV409                                                 02405000
CVTRV410 EQU   CVTRV409                                                 02406000
CVTRV408 EQU   CVTRV400                                                 02407000
CVTRV407 EQU   CVTRV400                                                 02408000
CVTRV406 EQU   CVTRV400                                                 02409000
CVTRV405 EQU   CVTRV400                                                 02410000
CVTRV404 EQU   CVTRV400                                                 02411000
CVTRV403 EQU   CVTRV400                                                 02412000
CVTRV402 EQU   CVTRV400                                                 02413000
CVTRV401 EQU   CVTRV400                                                 02414000
CVTICB   EQU   CVTXTNT2+48                                              02415000
CVTSKTA  EQU   CVTXTNT2+44                                              02416000
CVTSHSB  EQU   CVTSHS                                                   02417000
CVTRSV98 EQU   CVTXTNT2+36                                              02418000
CVTRSV97 EQU   CVTXTNT2+34                                              02419000
CVTRSV96 EQU   CVTXTNT2+32                                              02420000
CVTOLTEP EQU   CVTXTNT2+28                                              02421000
CVTQIDA  EQU   CVTQID+1                                                 02422000
CVTRSV95 EQU   CVTQID                                                   02423000
CVTRSV94 EQU   CVTXTNT2+20                                              02424000
CVTRSV93 EQU   CVTXTNT2+16                                              02425000
CVTRSV92 EQU   CVTXTNT2+12                                              02426000
CVTDEBVR EQU   CVTXTNT2+8                                               02427000
CVTRSV91 EQU   CVTXTNT2+6                                               02428000
CVTRSV9H EQU   CVTFLGBT                                                 02429000
CVTRSV9G EQU   CVTFLGBT                                                 02430000
CVTRSV9F EQU   CVTFLGBT                                                 02431000
CVTRSV9E EQU   CVTFLGBT                                                 02432000
CVTRSV9D EQU   CVTFLGBT                                                 02433000
CVTRSV9C EQU   CVTFLGBT                                                 02434000
CVTVME   EQU   CVTFLGBT                                                 02435000
CVTNPE   EQU   CVTFLGBT                                                 02436000
CVTNUCLS EQU   CVTXTNT2+4                                               02437000
CVTDSSVA EQU   CVTDSSV+1                                                02438000
CVTRSV89 EQU   CVTDSSV                                                  02439000
CVTRSV88 EQU   CVTXTNT1+8                                               02440000
CVTRSV87 EQU   CVTXTNT1+4                                               02441000
CVTFACHN EQU   CVTXTNT1                                                 02442000
CVTRV488 EQU   CVTMAP+412                                               02443000
CVTRV487 EQU   CVTMAP+408                                               02444000
CVTRV486 EQU   CVTMAP+404                                               02445000
CVTRV485 EQU   CVTMAP+400                                               02446000
CVTACTAP EQU   CVTMAP+396                                               02447000
CVTAUTH  EQU   CVTMAP+392                                               02448000
CVTATMCA EQU   CVTATMCT+1                                               02449000
CVTATMST EQU   CVTATMCT                                                 02450000
CVTRSV61 EQU   CVTMAP+384                                               02451000
CVTVOLT1 EQU   CVTVOLM1+1                                               02452000
CVTVOLI1 EQU   CVTVOLF1                                                 02453000
CVTSTOA  EQU   CVTMAP+376                                               02454000
CVTRSV58 EQU   CVTMAP+374                                               02455000
CVTRSV57 EQU   CVTMAP+372                                               02456000
CVTDDCE  EQU   CVTMAP+368                                               02457000
CVTPNWFR EQU   CVTMAP+364                                               02458000
CVTSMF   EQU   CVTMAP+360                                               02459000
CVTSULK  EQU   CVTMAP+358                                               02460000
CVTSLKO  EQU   CVTSYSK                                                  02461000
CVTSLKP  EQU   CVTSYSK                                                  02462000
CVTSLKQ  EQU   CVTSYSK                                                  02463000
CVTSLKR  EQU   CVTSYSK                                                  02464000
CVTRSV56 EQU   CVTSYSK                                                  02465000
CVTRSV55 EQU   CVTSYSK                                                  02466000
CVTRSV54 EQU   CVTSYSK                                                  02467000
CVTRSV53 EQU   CVTSYSK                                                  02468000
CVTRSV52 EQU   CVTA1F1                                                  02469000
CVTRSV51 EQU   CVTA1F1                                                  02470000
CVTRSV50 EQU   CVTA1F1                                                  02471000
CVTRSV49 EQU   CVTA1F1                                                  02472000
CVTRSV48 EQU   CVTA1F1                                                  02473000
CVTRSV47 EQU   CVTA1F1                                                  02474000
CVTSRSW  EQU   CVTA1F1                                                  02475000
CVTPFSW  EQU   CVTA1F1                                                  02476000
CVTPCVT  EQU   CVTMAP+352                                               02477000
CVTRSV46 EQU   CVTMAP+344                                               02478000
CVTRSV45 EQU   CVTMAP+340                                               02479000
CVTRSV44 EQU   CVTMAP+338                                               02480000
CVTRSV43 EQU   CVTMAP+336                                               02481000
CVTHJESA EQU   CVTHJES+1                                                02482000
CVTRSV42 EQU   CVTHJES                                                  02483000
CVTEXT2A EQU   CVTEXT2+1                                                02484000
CVTRSV41 EQU   CVTEXT2                                                  02485000
CVTAPFA  EQU   CVTAPF+1                                                 02486000
CVTRSV40 EQU   CVTAPF                                                   02487000
CVTRV518 EQU   CVTINTLA                                                 02488000
CVTRV517 EQU   CVTERPV                                                  02489000
CVTEORM  EQU   CVTMAP+312                                               02490000
CVTMCHPR EQU   CVTMAP+308                                               02491000
CVTTZ    EQU   CVTMAP+304                                               02492000
CVTJEPS  EQU   CVTMAP+300                                               02493000
CVTJESCT EQU   CVTMAP+296                                               02494000
CVTMODE  EQU   CVTMAP+292                                               02495000
CVTPTRV  EQU   CVTMAP+288                                               02496000
CVTREAL  EQU   CVTMAP+284                                               02497000
CVTRSV39 EQU   CVTMAP+280                                               02498000
CVTRSV38 EQU   CVTMAP+276                                               02499000
CVTDMSRA EQU   CVTDMSR+1                                                02500000
CVTRV634 EQU   CVTDMSRF                                                 02501000
CVTRV633 EQU   CVTDMSRF                                                 02502000
CVTRV632 EQU   CVTDMSRF                                                 02503000
CVTRV631 EQU   CVTDMSRF                                                 02504000
CVTRV630 EQU   CVTDMSRF                                                 02505000
CVTRV629 EQU   CVTDMSRF                                                 02506000
CVTUDUMP EQU   CVTDMSRF                                                 02507000
CVTSDUMP EQU   CVTDMSRF                                                 02508000
CVTQMSGA EQU   CVTQMSG+1                                                02509000
CVTRSV36 EQU   CVTQMSG                                                  02510000
CVTAMFF  EQU   CVTMAP+264                                               02511000
CVTPURGA EQU   CVTPURG+1                                                02512000
CVTRSV35 EQU   CVTPURG                                                  02513000
CVTCBSP  EQU   CVTMAP+256                                               02514000
CVTATERA EQU   CVTATER+1                                                02515000
CVTSYST  EQU   CVTATER                                                  02516000
CVTVOLT2 EQU   CVTTAT                                                   02517000
CVTVOLI2 EQU   CVTVOLF2                                                 02518000
CVTAQAVB EQU   CVTAQAVT+1                                               02519000
CVTRSV34 EQU   CVTTCMFG                                                 02520000
CVTRSV33 EQU   CVTTCMFG                                                 02521000
CVTRSV32 EQU   CVTTCMFG                                                 02522000
CVTRSV31 EQU   CVTTCMFG                                                 02523000
CVTRSV30 EQU   CVTTCMFG                                                 02524000
CVTRSV29 EQU   CVTTCMFG                                                 02525000
CVTRSV28 EQU   CVTTCMFG                                                 02526000
CVTTCRDY EQU   CVTTCMFG                                                 02527000
CVTGTFA  EQU   CVTGTF+1                                                 02528000
CVTRSV27 EQU   CVTGTFST                                                 02529000
CVTRNIO  EQU   CVTGTFST                                                 02530000
CVTUSR   EQU   CVTGTFST                                                 02531000
CVTRV318 EQU   CVTFORM                                                  02532000
CVTRV317 EQU   CVTTMODE                                                 02533000
CVTRV316 EQU   CVTSTATE                                                 02534000
CVTRV315 EQU   CVTGTFS                                                  02535000
CVTGTFAV EQU   CVTGTFS                                                  02536000
CVT0SCR1 EQU   CVTMAP+232                                               02537000
CVTRV515 EQU   CVTMAP+228                                               02538000
CVTRMS   EQU   CVTMAP+224                                               02539000
CVTPATCH EQU   CVTMAP+220                                               02540000
CVTTSCE  EQU   CVTMAP+216                                               02541000
CVTLNKSC EQU   CVTMAP+214                                               02542000
CVTQABST EQU   CVTMAP+212                                               02543000
CVTMDLDS EQU   CVTMAP+208                                               02544000
CVTUSER  EQU   CVTMAP+204                                               02545000
CVTABEND EQU   CVTMAP+200                                               02546000
CVTSMCA  EQU   CVTMAP+196                                               02547000
CVTRSV18 EQU   CVTMAP+192                                               02548000
CVTQLPAQ EQU   CVTMAP+188                                               02549000
CVTQCDSR EQU   CVTMAP+184                                               02550000
CVTRSV17 EQU   CVTOPTB                                                  02551000
CVTRSV16 EQU   CVTOPTB                                                  02552000
CVTFP    EQU   CVTOPTB                                                  02553000
CVTAPTHR EQU   CVTOPTB                                                  02554000
CVTNLOG  EQU   CVTOPTB                                                  02555000
CVTTOD   EQU   CVTOPTB                                                  02556000
CVTCTIMS EQU   CVTOPTB                                                  02557000
CVTPROT  EQU   CVTOPTB                                                  02558000
CVTXPFP  EQU   CVTOPTA                                                  02559000
CVTASCII EQU   CVTOPTA                                                  02560000
CVTRSV13 EQU   CVTOPTA                                                  02561000
CVTRSV12 EQU   CVTOPTA                                                  02562000
CVTNIP   EQU   CVTOPTA                                                  02563000
CVTDDR   EQU   CVTOPTA                                                  02564000
CVTAPR   EQU   CVTOPTA                                                  02565000
CVTCCH   EQU   CVTOPTA                                                  02566000
CVTSNCTR EQU   CVTMAP+180                                               02567000
CVTQMWR  EQU   CVTMAP+176                                               02568000
CVTQOCR  EQU   CVTMAP+172                                               02569000
CVT1EF00 EQU   CVTMAP+168                                               02570000
CVTMZ00  EQU   CVTMAP+164                                               02571000
CVTHEAD  EQU   CVTMAP+160                                               02572000
CVTRSV11 EQU   CVTMAP+156                                               02573000
CVT0PT01 EQU   CVTMAP+152                                               02574000
CVTMSER  EQU   CVTMAP+148                                               02575000
CVTRV516 EQU   CVTIERLC                                                 02576000
CVTILCH  EQU   CVTMAP+140                                               02577000
CVT0DS   EQU   CVTMAP+136                                               02578000
CVTFBOSV EQU   CVTMAP+132                                               02579000
CVTNUCB  EQU   CVTMAP+128                                               02580000
CVTIXAVL EQU   CVTMAP+124                                               02581000
CVTIOQET EQU   CVTMAP+120                                               02582000
CVTDCBA  EQU   CVTMAP+117                                               02583000
CVTMVS2  EQU   CVTDCB                                                   02584000
CVT6DAT  EQU   CVTDCB                                                   02585000
CVT4MPS  EQU   CVTDCB                                                   02586000
CVTRSV09 EQU   CVTDCB                                                   02587000
CVT4MS1  EQU   CVTDCB                                                   02588000
CVT2SPS  EQU   CVTDCB                                                   02589000
CVT1SSS  EQU   CVTDCB                                                   02590000
CVTRSV08 EQU   CVTDCB                                                   02591000
CVTSTB   EQU   CVTMAP+112                                               02592000
CVTQTD00 EQU   CVTMAP+108                                               02593000
CVTQTE00 EQU   CVTMAP+104                                               02594000
CVTCUCB  EQU   CVTMAP+100                                               02595000
CVTSJQ   EQU   CVTMAP+96                                                02596000
CVTPBLDL EQU   CVTMAP+92                                                02597000
CVTTPC   EQU   CVTMAP+88                                                02598000
CVTSVDCB EQU   CVTMAP+84                                                02599000
CVTBRET  EQU   CVTMAP+82                                                02600000
CVTEXIT  EQU   CVTMAP+80                                                02601000
CVT0FN00 EQU   CVTMAP+76                                                02602000
CVTDARA  EQU   CVTDAR+1                                                 02603000
CVTRSV07 EQU   CVTFLGS1                                                 02604000
CVTRSV06 EQU   CVTFLGS1                                                 02605000
CVTRSV05 EQU   CVTFLGS1                                                 02606000
CVTRSV04 EQU   CVTFLGS1                                                 02607000
CVTRSV03 EQU   CVTFLGS1                                                 02608000
CVTRSV02 EQU   CVTFLGS1                                                 02609000
CVTRSV01 EQU   CVTFLGS1                                                 02610000
CVTDMPLK EQU   CVTFLGS1                                                 02611000
CVTXITP  EQU   CVTMAP+68                                                02612000
CVTZDTAB EQU   CVTMAP+64                                                02613000
CVTMSLT  EQU   CVTMAP+60                                                02614000
CVTDATE  EQU   CVTMAP+56                                                02615000
CVTBTERM EQU   CVTMAP+52                                                02616000
CVTSYSAD EQU   CVTMAP+48                                                02617000
CVTXTLER EQU   CVTMAP+44                                                02618000
CVTILK2  EQU   CVTMAP+40                                                02619000
CVTILK1  EQU   CVTMAP+36                                                02620000
CVTPRLTV EQU   CVTMAP+32                                                02621000
CVTPCNVT EQU   CVTMAP+28                                                02622000
CVT0VL00 EQU   CVTMAP+24                                                02623000
CVTXAPG  EQU   CVTMAP+20                                                02624000
CVTBUF   EQU   CVTMAP+16                                                02625000
CVTJOB   EQU   CVTMAP+12                                                02626000
CVTLINK  EQU   CVTMAP+8                                                 02627000
CVT0EF00 EQU   CVTMAP+4                                                 02628000
CVTTCBP  EQU   CVTMAP                                                   02629000
CVT      EQU   CVTMAP                                                   02630000
@NM00028 EQU   SRBSECT+40                                               02631000
@NM00027 EQU   SRBSECT+38                                               02632000
SRBPRIOR EQU   SRBSECT+37                                               02633000
SRBPKF   EQU   SRBSECT+36                                               02634000
SRBSAVE  EQU   SRBSECT+32                                               02635000
SRBPARM  EQU   SRBSECT+28                                               02636000
SRBRMTR  EQU   SRBSECT+24                                               02637000
SRBEP    EQU   SRBSECT+20                                               02638000
SRBPTCB  EQU   SRBFLC+4                                                 02639000
SRBPASID EQU   SRBFLC+2                                                 02640000
SRBCPAFF EQU   SRBFLC                                                   02641000
SRBASCB  EQU   SRBSECT+8                                                02642000
SRBFLNK  EQU   SRBSECT+4                                                02643000
SRBID    EQU   SRBSECT                                                  02644000
ASXBEND  EQU   ASXB+232                                                 02645000
ASXBRV25 EQU   ASXB+228                                                 02646000
ASXBRV24 EQU   ASXB+224                                                 02647000
ASXBPT0E EQU   ASXB+220                                                 02648000
ASXBCRB4 EQU   ASXBCASW+3                                               02649000
ASXBCRB3 EQU   ASXBCASW+2                                               02650000
ASXBCRB2 EQU   ASXBCASW+1                                               02651000
ASXBCR06 EQU   ASXBCRB1                                                 02652000
ASXBCR05 EQU   ASXBCRB1                                                 02653000
ASXBCR04 EQU   ASXBCRB1                                                 02654000
ASXBCR03 EQU   ASXBCRB1                                                 02655000
ASXBCR02 EQU   ASXBCRB1                                                 02656000
ASXBCR01 EQU   ASXBCRB1                                                 02657000
ASXBTFD  EQU   ASXBCRB1                                                 02658000
ASXBPIP  EQU   ASXBCRB1                                                 02659000
ASXBCTDC EQU   ASXB+212                                                 02660000
ASXBTDCB EQU   ASXB+208                                                 02661000
ASXBRV19 EQU   ASXB+204                                                 02662000
ASXBRV18 EQU   ASXB+200                                                 02663000
ASXBRV17 EQU   ASXB+196                                                 02664000
ASXBRV16 EQU   ASXB+192                                                 02665000
ASXBLSRB EQU   ASXBAEQ+20                                               02666000
ASXBFSRB EQU   ASXBAEQ+16                                               02667000
ASXBLRQE EQU   ASXBAEQ+12                                               02668000
ASXBFRQE EQU   ASXBAEQ+8                                                02669000
ASXBLIQE EQU   ASXBAEQ+4                                                02670000
ASXBFIQE EQU   ASXBAEQ                                                  02671000
ASXBETSK EQU   ASXB+164                                                 02672000
ASXBSIRB EQU   ASXB+160                                                 02673000
ASXBPSWD EQU   ASXB+152                                                 02674000
ASXBPRG  EQU   ASXB+136                                                 02675000
ASXBRV26 EQU   ASXB+132                                                 02676000
ASXBOUSB EQU   ASXB+128                                                 02677000
ASXBDDR  EQU   ASXB+124                                                 02678000
ASXBRCTD EQU   ASXB+120                                                 02679000
ASXBRSMD EQU   ASXB+116                                                 02680000
ASXBSPSA EQU   ASXB+112                                                 02681000
ASXBFRWA EQU   ASXB+108                                                 02682000
ASXBFLSA EQU   ASXB+36                                                  02683000
ASXBIHSA EQU   ASXB+32                                                  02684000
ASXBRV15 EQU   ASXB+28                                                  02685000
ASXBRV14 EQU   ASXB+24                                                  02686000
ASXBLWA  EQU   ASXB+20                                                  02687000
ASXBRS00 EQU   ASXB+14                                                  02688000
ASXBTCBS EQU   ASXB+12                                                  02689000
ASXBLTCB EQU   ASXB+8                                                   02690000
ASXBFTCB EQU   ASXB+4                                                   02691000
ASXBASXB EQU   ASXB                                                     02692000
ASXBEGIN EQU   ASXB                                                     02693000
ASCBEND  EQU   ASCB+208                                                 02694000
ASCBSRBT EQU   ASCB+200                                                 02695000
ASCBSWTL EQU   ASCB+196                                                 02696000
ASCBRS14 EQU   ASCB+195                                                 02697000
ASCBSMCT EQU   ASCB+194                                                 02698000
ASCBRS12 EQU   ASCB+192                                                 02699000
ASCBPCTT EQU   ASCB+188                                                 02700000
ASCBVGTT EQU   ASCB+184                                                 02701000
ASCBRV43 EQU   ASCBSRQ4                                                 02702000
ASCBRV42 EQU   ASCBSRQ4                                                 02703000
ASCBRV41 EQU   ASCBSRQ4                                                 02704000
ASCBRV40 EQU   ASCBSRQ4                                                 02705000
ASCBRV39 EQU   ASCBSRQ4                                                 02706000
ASCBRV38 EQU   ASCBSRQ4                                                 02707000
ASCBRV37 EQU   ASCBSRQ4                                                 02708000
ASCBRV36 EQU   ASCBSRQ4                                                 02709000
ASCBRV35 EQU   ASCBSRQ3                                                 02710000
ASCBRV34 EQU   ASCBSRQ3                                                 02711000
ASCBRV33 EQU   ASCBSRQ3                                                 02712000
ASCBRV32 EQU   ASCBSRQ3                                                 02713000
ASCBRV31 EQU   ASCBSRQ3                                                 02714000
ASCBRV30 EQU   ASCBSRQ3                                                 02715000
ASCBRV29 EQU   ASCBSRQ3                                                 02716000
ASCBRV28 EQU   ASCBSRQ3                                                 02717000
ASCBRV27 EQU   ASCBSRQ2                                                 02718000
ASCBRV26 EQU   ASCBSRQ2                                                 02719000
ASCBRV25 EQU   ASCBSRQ2                                                 02720000
ASCBRV24 EQU   ASCBSRQ2                                                 02721000
ASCBRV23 EQU   ASCBSRQ2                                                 02722000
ASCBRV22 EQU   ASCBSRQ2                                                 02723000
ASCBRV21 EQU   ASCBSRQ2                                                 02724000
ASCBRV20 EQU   ASCBSRQ2                                                 02725000
ASCBRV19 EQU   ASCBSRQ1                                                 02726000
ASCBRV18 EQU   ASCBSRQ1                                                 02727000
ASCBRV17 EQU   ASCBSRQ1                                                 02728000
ASCBRV16 EQU   ASCBSRQ1                                                 02729000
ASCBRV15 EQU   ASCBSRQ1                                                 02730000
ASCBRV14 EQU   ASCBSRQ1                                                 02731000
ASCBRV13 EQU   ASCBSRQ1                                                 02732000
ASCBSTA  EQU   ASCBSRQ1                                                 02733000
ASCBJBNS EQU   ASCB+176                                                 02734000
ASCBJBNI EQU   ASCB+172                                                 02735000
ASCBMCC  EQU   ASCB+168                                                 02736000
ASCBRTWA EQU   ASCB+164                                                 02737000
ASCBIQEA EQU   ASCB+160                                                 02738000
ASCBXMPQ EQU   ASCB+156                                                 02739000
ASCBRS01 EQU   ASCB+154                                                 02740000
ASCBFMCT EQU   ASCB+152                                                 02741000
ASCBOUXB EQU   ASCB+148                                                 02742000
ASCBOUCB EQU   ASCB+144                                                 02743000
ASCBMECB EQU   ASCB+140                                                 02744000
ASCBQECB EQU   ASCB+136                                                 02745000
ASCBLSQH EQU   ASCBLKGP+4                                               02746000
ASCBLOCK EQU   ASCBLKGP                                                 02747000
ASCBTCBS EQU   ASCB+124                                                 02748000
ASCBNVSC EQU   ASCB+122                                                 02749000
ASCBVSC  EQU   ASCB+120                                                 02750000
ASCBSRBS EQU   ASCB+118                                                 02751000
ASCBSSRB EQU   ASCB+116                                                 02752000
ASCBRV06 EQU   ASCBFLG2                                                 02753000
ASCBRV05 EQU   ASCBFLG2                                                 02754000
ASCBRV04 EQU   ASCBFLG2                                                 02755000
ASCBSNQS EQU   ASCBFLG2                                                 02756000
ASCBS2S  EQU   ASCBFLG2                                                 02757000
ASCBCEXT EQU   ASCBFLG2                                                 02758000
ASCBPXMT EQU   ASCBFLG2                                                 02759000
ASCBXMPT EQU   ASCBFLG2                                                 02760000
ASCBRF07 EQU   ASCBDSP1                                                 02761000
ASCBRF06 EQU   ASCBDSP1                                                 02762000
ASCBRF05 EQU   ASCBDSP1                                                 02763000
ASCBRF04 EQU   ASCBDSP1                                                 02764000
ASCBRF03 EQU   ASCBDSP1                                                 02765000
ASCBRF02 EQU   ASCBDSP1                                                 02766000
ASCBFAIL EQU   ASCBDSP1                                                 02767000
ASCBNOQ  EQU   ASCBDSP1                                                 02768000
ASCBSWCT EQU   ASCB+112                                                 02769000
ASCBTMCH EQU   ASCB+104                                                 02770000
ASCBNSWP EQU   ASCBFLG1                                                 02771000
ASCBTYP1 EQU   ASCBFLG1                                                 02772000
ASCBSTND EQU   ASCBFLG1                                                 02773000
ASCBABNT EQU   ASCBFLG1                                                 02774000
ASCBTERM EQU   ASCBFLG1                                                 02775000
ASCBS3S  EQU   ASCBFLG1                                                 02776000
ASCBCMSH EQU   ASCBFLG1                                                 02777000
ASCBTOFF EQU   ASCBFLG1                                                 02778000
ASCBRF01 EQU   ASCBRCTF                                                 02779000
ASCBTMLW EQU   ASCBRCTF                                                 02780000
ASCBOUT  EQU   ASCBRCTF                                                 02781000
ASCBWAIT EQU   ASCBRCTF                                                 02782000
ASCBRV08 EQU   ASCBRCTF                                                 02783000
ASCBFQU  EQU   ASCBRCTF                                                 02784000
ASCBFRS  EQU   ASCBRCTF                                                 02785000
ASCBTMNO EQU   ASCBRCTF                                                 02786000
ASCBAFFN EQU   ASCBFW1                                                  02787000
ASCBDUMP EQU   ASCB+96                                                  02788000
ASCBQSVC EQU   ASCB+92                                                  02789000
ASCBUBET EQU   ASCB+88                                                  02790000
ASCBECB  EQU   ASCB+84                                                  02791000
ASCBJSTL EQU   ASCB+80                                                  02792000
ASCBEWST EQU   ASCB+72                                                  02793000
ASCBEJST EQU   ASCB+64                                                  02794000
ASCBTSB  EQU   ASCB+60                                                  02795000
ASCBCSCB EQU   ASCB+56                                                  02796000
ASCBRSM  EQU   ASCB+52                                                  02797000
ASCBLDA  EQU   ASCB+48                                                  02798000
ASCBSTOR EQU   ASCB+44                                                  02799000
ASCBDP   EQU   ASCB+43                                                  02800000
ASCBRV07 EQU   ASCB+42                                                  02801000
ASCBIOSM EQU   ASCB+40                                                  02802000
ASCBSEQN EQU   ASCB+38                                                  02803000
ASCBASID EQU   ASCB+36                                                  02804000
ASCBCPUS EQU   ASCB+32                                                  02805000
ASCBSPL  EQU   ASCB+28                                                  02806000
ASCBIOSP EQU   ASCB+24                                                  02807000
ASCBSYNC EQU   ASCBSUPC+4                                               02808000
ASCBSVRB EQU   ASCBSUPC                                                 02809000
ASCBCMSF EQU   ASCB+12                                                  02810000
ASCBBWDP EQU   ASCB+8                                                   02811000
ASCBFWDP EQU   ASCB+4                                                   02812000
ASCBASCB EQU   ASCB                                                     02813000
ASCBEGIN EQU   ASCB                                                     02814000
@NM00026 EQU   FRRSFLGS+1                                               02815000
@NM00025 EQU   FRRSFLG1                                                 02816000
FRRSRCUR EQU   FRRSFLG1                                                 02817000
FRRSENTS EQU   FRRS+84                                                  02818000
FRRSRTMW EQU   FRRS+16                                                  02819000
@NM00024 EQU   PSA+3668                                                 02820000
PSASTAK  EQU   PSA+3072                                                 02821000
@NM00023 EQU   PSA+1048                                                 02822000
PSAUSEND EQU   PSA+1048                                                 02823000
PSARV062 EQU   PSA+1044                                                 02824000
PSACDAL  EQU   PSA+1040                                                 02825000
PSAWTCOD EQU   PSA+1036                                                 02826000
PSAATCVT EQU   PSA+1032                                                 02827000
PSAPCPSW EQU   PSA+1024                                                 02828000
PSAPIR2  EQU   PSA+1020                                                 02829000
PSARV059 EQU   PSA+1018                                                 02830000
PSASVC13 EQU   PSA+1016                                                 02831000
PSASFACC EQU   PSA+1008                                                 02832000
PSASTOP  EQU   PSA+992                                                  02833000
PSASTART EQU   PSA+976                                                  02834000
PSARSPSW EQU   PSA+968                                                  02835000
PSASRPSW EQU   PSA+960                                                  02836000
PSARV045 EQU   PSA+892                                                  02837000
PSARV044 EQU   PSA+888                                                  02838000
PSARV043 EQU   PSA+884                                                  02839000
PSARV042 EQU   PSA+880                                                  02840000
PSARV041 EQU   PSA+876                                                  02841000
PSARV040 EQU   PSA+872                                                  02842000
PSARV025 EQU   PSA+868                                                  02843000
PSADSSED EQU   PSA+868                                                  02844000
PSADSSPR EQU   PSA+864                                                  02845000
PSADSSFW EQU   PSA+860                                                  02846000
PSADSS14 EQU   PSA+856                                                  02847000
PSADSSPP EQU   PSA+848                                                  02848000
PSADSSRP EQU   PSA+840                                                  02849000
PSADSS05 EQU   PSADSSF4                                                 02850000
PSADSS10 EQU   PSADSSF4                                                 02851000
PSADSSVE EQU   PSADSSF4                                                 02852000
PSADSSDE EQU   PSADSSF4                                                 02853000
PSADSSC0 EQU   PSADSSF4                                                 02854000
PSADSSIE EQU   PSADSSF4                                                 02855000
PSADSS12 EQU   PSADSSF4                                                 02856000
PSADSSRC EQU   PSADSSF4                                                 02857000
PSARV057 EQU   PSADSSF3                                                 02858000
PSARV056 EQU   PSADSSF3                                                 02859000
PSARV055 EQU   PSADSSF3                                                 02860000
PSADSSMC EQU   PSADSSF3                                                 02861000
PSADSSRW EQU   PSADSSF3                                                 02862000
PSADSSNM EQU   PSADSSF3                                                 02863000
PSADSSES EQU   PSADSSF3                                                 02864000
PSADSSGP EQU   PSADSSF3                                                 02865000
PSADSSF2 EQU   PSADSSFL+1                                               02866000
PSADSSPI EQU   PSADSSF1                                                 02867000
PSADSSOI EQU   PSADSSF1                                                 02868000
PSADSSSP EQU   PSADSSF1                                                 02869000
PSADSSTP EQU   PSADSSF1                                                 02870000
PSADSSDW EQU   PSADSSF1                                                 02871000
PSADSSDD EQU   PSADSSF1                                                 02872000
PSADSSDM EQU   PSADSSF1                                                 02873000
PSADSSMV EQU   PSADSSF1                                                 02874000
PSADSSTS EQU   PSA+816                                                  02875000
PSADSSWK EQU   PSA+812                                                  02876000
PSADSSR3 EQU   PSA+808                                                  02877000
PSADSSR2 EQU   PSA+804                                                  02878000
PSADSSRS EQU   PSA+800                                                  02879000
PSASTOR  EQU   PSA+796                                                  02880000
PSACPUSA EQU   PSA+794                                                  02881000
PSAVSTAP EQU   PSA+792                                                  02882000
PSAWKVAP EQU   PSA+788                                                  02883000
PSAWKRAP EQU   PSA+784                                                  02884000
PSAMCHIC EQU   PSA+783                                                  02885000
PSARV061 EQU   PSA+782                                                  02886000
PSASYMSK EQU   PSA+781                                                  02887000
PSAMCHFL EQU   PSA+780                                                  02888000
PSACR0   EQU   PSA+776                                                  02889000
PSAPSWSV EQU   PSA+768                                                  02890000
PSALITA  EQU   PSA+764                                                  02891000
PSACLHS  EQU   PSAHLHI                                                  02892000
PSALKR15 EQU   PSALKSA+60                                               02893000
PSALKR14 EQU   PSALKSA+56                                               02894000
PSALKR13 EQU   PSALKSA+52                                               02895000
PSALKR12 EQU   PSALKSA+48                                               02896000
PSALKR11 EQU   PSALKSA+44                                               02897000
PSALKR10 EQU   PSALKSA+40                                               02898000
PSALKR9  EQU   PSALKSA+36                                               02899000
PSALKR8  EQU   PSALKSA+32                                               02900000
PSALKR7  EQU   PSALKSA+28                                               02901000
PSALKR6  EQU   PSALKSA+24                                               02902000
PSALKR5  EQU   PSALKSA+20                                               02903000
PSALKR4  EQU   PSALKSA+16                                               02904000
PSALKR3  EQU   PSALKSA+12                                               02905000
PSALKR2  EQU   PSALKSA+8                                                02906000
PSALKR1  EQU   PSALKSA+4                                                02907000
PSALKR0  EQU   PSALKSA                                                  02908000
PSARV023 EQU   PSACLHT+52                                               02909000
PSALOCAL EQU   PSACLHT+48                                               02910000
PSACMSL  EQU   PSACLHT+44                                               02911000
PSAOPTL  EQU   PSACLHT+40                                               02912000
PSATPACL EQU   PSACLHT+36                                               02913000
PSATPDNL EQU   PSACLHT+32                                               02914000
PSATPNCL EQU   PSACLHT+28                                               02915000
PSAIOSLL EQU   PSACLHT+24                                               02916000
PSAIOSUL EQU   PSACLHT+20                                               02917000
PSAIOSCL EQU   PSACLHT+16                                               02918000
PSAIOSSL EQU   PSACLHT+12                                               02919000
PSASALCL EQU   PSACLHT+8                                                02920000
PSAASML  EQU   PSACLHT+4                                                02921000
PSADISPL EQU   PSACLHT                                                  02922000
PSASRSA  EQU   PSA+636                                                  02923000
PSARV050 EQU   PSA+634                                                  02924000
PSADSSGO EQU   PSA+633                                                  02925000
PSARECUR EQU   PSA+632                                                  02926000
PSAHLHIS EQU   PSA+628                                                  02927000
PSAIPCSA EQU   PSA+624                                                  02928000
@NM00022 EQU   PSA+621                                                  02929000
PSAIPCDM EQU   PSA+620                                                  02930000
PSAIPCD  EQU   PSA+616                                                  02931000
@NM00021 EQU   PSA+613                                                  02932000
PSAIPCRM EQU   PSA+612                                                  02933000
PSAIPCR  EQU   PSA+608                                                  02934000
PSAMCHEX EQU   PSA+600                                                  02935000
PSAMPSW  EQU   PSA+592                                                  02936000
PSAEXPS2 EQU   PSA+584                                                  02937000
PSAEXPS1 EQU   PSA+576                                                  02938000
PSAPIREG EQU   PSA+572                                                  02939000
PSARSREG EQU   PSA+568                                                  02940000
PSAGPREG EQU   PSA+556                                                  02941000
PSARV022 EQU   PSASUP4                                                  02942000
PSARV021 EQU   PSASUP4                                                  02943000
PSARV020 EQU   PSASUP4                                                  02944000
PSARV019 EQU   PSASUP4                                                  02945000
PSARV018 EQU   PSASUP4                                                  02946000
PSARV017 EQU   PSASUP4                                                  02947000
PSARV016 EQU   PSASUP4                                                  02948000
PSARV015 EQU   PSASUP4                                                  02949000
PSARV014 EQU   PSASUP3                                                  02950000
PSARV013 EQU   PSASUP3                                                  02951000
PSARV012 EQU   PSASUP3                                                  02952000
PSARV011 EQU   PSASUP3                                                  02953000
PSASPR   EQU   PSASUP3                                                  02954000
PSAPSREG EQU   PSASUP3                                                  02955000
PSAPI2   EQU   PSASUP3                                                  02956000
PSAIOSUP EQU   PSASUP3                                                  02957000
PSALCR   EQU   PSASUP2                                                  02958000
PSARTM   EQU   PSASUP2                                                  02959000
PSAACR   EQU   PSASUP2                                                  02960000
PSAIPCE2 EQU   PSASUP2                                                  02961000
PSAIPCES EQU   PSASUP2                                                  02962000
PSAIPCEC EQU   PSASUP2                                                  02963000
PSAGTF   EQU   PSASUP2                                                  02964000
PSAIPCRI EQU   PSASUP2                                                  02965000
PSARV063 EQU   PSASUP1                                                  02966000
PSATCTL  EQU   PSASUP1                                                  02967000
PSADISP  EQU   PSASUP1                                                  02968000
PSALOCK  EQU   PSASUP1                                                  02969000
PSAPI    EQU   PSASUP1                                                  02970000
PSAEXT   EQU   PSASUP1                                                  02971000
PSASVC   EQU   PSASUP1                                                  02972000
PSAIO    EQU   PSASUP1                                                  02973000
PSAANEW  EQU   PSA+544                                                  02974000
PSATOLD  EQU   PSA+540                                                  02975000
PSATNEW  EQU   PSA+536                                                  02976000
PSALCCAR EQU   PSA+532                                                  02977000
PSALCCAV EQU   PSA+528                                                  02978000
PSAPCCAR EQU   PSA+524                                                  02979000
PSAPCCAV EQU   PSA+520                                                  02980000
PSACPULA EQU   PSA+518                                                  02981000
PSACPUPA EQU   PSA+516                                                  02982000
PSAPSA   EQU   PSA+512                                                  02983000
FLCHDEND EQU   PSA+512                                                  02984000
FLCCRSAV EQU   FLCMCLA+280                                              02985000
FLCGRSAV EQU   FLCMCLA+216                                              02986000
FLCFPSAV EQU   FLCMCLA+184                                              02987000
FLCFLA   EQU   FLCMCLA+88                                               02988000
FLCRGNCD EQU   FLCMCLA+84                                               02989000
FLCFSAA  EQU   FLCFSA+1                                                 02990000
@NM00020 EQU   FLCFSA                                                   02991000
@NM00019 EQU   FLCMCLA+72                                               02992000
FLCMCIC  EQU   FLCMCLA+64                                               02993000
@NM00018 EQU   FLCMCLA+20                                               02994000
FLCIOAA  EQU   FLCIOA+1                                                 02995000
@NM00017 EQU   FLCIOA                                                   02996000
@NM00016 EQU   FLCMCLA+15                                               02997000
@NM00015 EQU   FLCMCLA+14                                               02998000
@NM00014 EQU   FLCMCLA+12                                               02999000
FLCLCL   EQU   FLCMCLA+8                                                03000000
FLCIOELA EQU   FLCIOEL+1                                                03001000
@NM00013 EQU   FLCIOEL                                                  03002000
FLCCHNID EQU   FLCMCLA                                                  03003000
@NM00012 EQU   PSA+160                                                  03004000
FLCMTRCD EQU   PSA+157                                                  03005000
@NM00011 EQU   PSA+156                                                  03006000
FLCPERA  EQU   FLCPER+1                                                 03007000
@NM00010 EQU   FLCPER                                                   03008000
@NM00009 EQU   PSA+151                                                  03009000
FLCPERCD EQU   PSA+150                                                  03010000
FLCMCNUM EQU   PSA+149                                                  03011000
@NM00008 EQU   PSA+148                                                  03012000
FLCTEAA  EQU   FLCTEA+1                                                 03013000
@NM00007 EQU   FLCTEA                                                   03014000
PSAPIPC  EQU   PSAPICOD                                                 03015000
PSAPIMC  EQU   PSAPICOD                                                 03016000
PSAPIPER EQU   PSAPICOD                                                 03017000
PSARV049 EQU   FLCPICOD                                                 03018000
FLCPILCB EQU   FLCPIILC                                                 03019000
@NM00006 EQU   FLCPIILC                                                 03020000
@NM00005 EQU   PSAEPPSW                                                 03021000
FLCSVCN  EQU   PSAESPSW+2                                               03022000
FLCSILCB EQU   FLCSVILC                                                 03023000
@NM00004 EQU   FLCSVILC                                                 03024000
@NM00003 EQU   PSAESPSW                                                 03025000
FLCEICOD EQU   PSAEEPSW+2                                               03026000
PSASPAD  EQU   PSAEEPSW                                                 03027000
@NM00002 EQU   PSA+128                                                  03028000
FLCINPSW EQU   PSA+120                                                  03029000
FLCMNPSW EQU   PSA+112                                                  03030000
FLCPNPSW EQU   PSA+104                                                  03031000
FLCSNPSW EQU   PSA+96                                                   03032000
FLCENPSW EQU   PSA+88                                                   03033000
FLCTRACE EQU   PSA+84                                                   03034000
FLCTIMER EQU   PSA+80                                                   03035000
FLCCVT2  EQU   PSA+76                                                   03036000
FLCCAW   EQU   PSA+72                                                   03037000
FLCCSW   EQU   PSA+64                                                   03038000
FLCIOPSW EQU   PSA+56                                                   03039000
FLCMOPSW EQU   PSA+48                                                   03040000
FLCPOPSW EQU   PSA+40                                                   03041000
FLCSOPSW EQU   PSA+32                                                   03042000
FLCEOPSW EQU   PSA+24                                                   03043000
@NM00001 EQU   FLCICCW2+4                                               03044000
FLCCVT   EQU   FLCICCW2                                                 03045000
FLCICCW1 EQU   FLCROPSW                                                 03046000
FLCIPPSW EQU   FLCRNPSW                                                 03047000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03048000
@RT00227 EQU   RESCHED                                                  03049000
@ENDDATA EQU   *                                                        03050000
         END   ISTAPC59,(C'PLS0418',0603,76018)                         03051000
