         TITLE 'ISTDCC00: CONTROL LAYER REQUEST START ONE              *00001000
                        '                                               00002000
ISTDCC00 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTDCC00  75.288'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
*PTRCRR=ADDR(CRRSPACE);             /* ADDRESS THE                   */ 00013000
         L     @15,RPHCRR(,PTRRPH)                                 0445 00014000
         L     @15,CRACRR(,@15)                                    0445 00015000
         LA    PTRCRR,CRRSPACE(,@15)                               0445 00016000
*RFY CRRSAREA BASED(PTRCRR);        /*  COMPONENT RECOVERY RECORD    */ 00017000
*RFY ISTPFCRR BASED(ADDR(CRRCRR));                                 0447 00018000
*/* INIALIALIZE CRR @D33SKXW*/                                     0448 00019000
*/********************************************************************/ 00020000
*/*                                                                  */ 00021000
*/* SEGMENT NAME : NESTCH                                            */ 00022000
*/*                                                                  */ 00023000
*/* FUNCTION :  INITIALIZES THE CRR                                  */ 00024000
*/*                                                                  */ 00025000
*/* INPUT : A NEW CRR OR CURRENTLY USED BY SOLICIT ALL               */ 00026000
*/*                                                                  */ 00027000
*/*                                                                  */ 00028000
*/* OUTPUT :    AN INITIALIZED CRR                                   */ 00029000
*/*                                                                  */ 00030000
*/* SUBROUTINES CALLED :  NONE                                       */ 00031000
*/*                                                                  */ 00032000
*/* MACROS USED :  LISATCVT                                          */ 00033000
*/*                                                                  */ 00034000
*/********************************************************************/ 00035000
* IF CRRID =CRRTYPE THEN                                           0448 00036000
         CLI   CRRID(@15),X'22'                                    0448 00037000
         BNE   @RF00448                                            0448 00038000
*    DO;                                                           0449 00039000
*    RFY (PTRRPH,PTRRPL,PTRLCPB,PTRFMCB,PTRCRR) RSTD;              0450 00040000
*CRRFLGS = CRRFLGS && CRRFLGS;      /* CLEAR CRRFLGS                 */ 00041000
         XC    CRRFLGS(1,PTRCRR),CRRFLGS(PTRCRR)                   0451 00042000
*CRRFLGS2 = CRRFLGS2 && CRRFLGS2;   /* CLEAR CRRFLGS2                */ 00043000
         XC    CRRFLGS2(1,PTRCRR),CRRFLGS2(PTRCRR)                 0452 00044000
*CRRFLGS3 = CRRFLGS3 && CRRFLGS3;   /* CLEAR CRRFLGS3                */ 00045000
*                                                                  0453 00046000
         XC    CRRFLGS3(1,PTRCRR),CRRFLGS3(PTRCRR)                 0453 00047000
*CRRC02=OFF;                        /* CLEAR REQUEST FINISH INDICATOR*/ 00048000
         NI    CRRC02(PTRCRR),B'11011111'                          0454 00049000
*CRRINIO=OFF;                       /* CLEAR I/O INITIALIZED FLAG    */ 00050000
*CRRSOLRQ=OFF;                      /* CLEAR SOLICIT REQUEST SWITCH  */ 00051000
*CRRCPROC=OFF;                      /* CLEAR CPROC SWITCH            */ 00052000
         NI    CRRINIO(PTRCRR),B'11011010'                         0457 00053000
*CRRSW2=ON;                        /* 1ST PASS SWITCH(FOR SL ALL)   */  00054000
         OI    CRRSW2(PTRCRR),B'00100000'                          0458 00055000
*    END;                                                          0459 00056000
* ELSE DO;                                                         0460 00057000
         B     @RC00448                                            0460 00058000
@RF00448 DS    0H                                                  0461 00059000
* RFY ISTDCCRR BASED (ADDR(CRAPROCR));                             0461 00060000
* PTRCRR=ADDR(CRRSPACE);                                           0462 00061000
         L     @15,RPHCRR(,PTRRPH)                                 0462 00062000
         LA    @14,312                                             0462 00063000
         ALR   @14,@15                                             0462 00064000
         LA    PTRCRR,CRRSPACE(,@14)                               0462 00065000
* RFY CRRSAREA BASED (PTRCRR);                                     0463 00066000
*         /* ZERO OUT ALL OF THE CRR FIRST                   @Z40GKNL*/ 00067000
*CRRSAREA(1:256) = CRRSAREA(1:256) && CRRSAREA(1:256);  /*   @Z40GKNL*/ 00068000
         XC    CRRSAREA(256,PTRCRR),CRRSAREA(PTRCRR)               0464 00069000
*CRRSAREA(257:LENGTH(CRRSAREA)) = CRRSAREA(257:LENGTH(CRRSAREA)) &&     00070000
*             CRRSAREA(257:LENGTH(CRRSAREA));             /* @Z40GKNL*/ 00071000
         XC    CRRSAREA+256(64,PTRCRR),CRRSAREA+256(PTRCRR)        0465 00072000
*         /* NOW SET ALL NEEDED POINTERS AND FLAGS           @Z40GKNL*/ 00073000
*                                                                  0466 00074000
* DO; /* LISATCVT CVTBASE(PAGEABLE,(CRRATCVT)) */                  0466 00075000
*   CRRATCVT = ATCLCPTR; /*SET UP ATCVT POINTER*/                  0467 00076000
         L     @09,ATCLCPTR                                        0467 00077000
         ST    @09,CRRATCVT(,PTRCRR)                               0467 00078000
* END; /*LISATCVT*/ /* GET  VTAM CVT POINTER    */                 0468 00079000
*RFY ISTATCVT BASED(CRRATCVT);      /* SET BASE ADDRESS              */ 00080000
*CRRFRR=CRAFRR;                     /* PLACE FRR POINTER IN CRR      */ 00081000
         L     @08,CRAFRR(,@15)                                    0470 00082000
         ST    @08,CRRFRR(,@14)                                    0470 00083000
*CRRCHAIN=CRACRR;                   /* SAVE CRR PTR FROM CRA         */ 00084000
         L     @08,CRACRR(,@15)                                    0471 00085000
         ST    @08,CRRCHAIN(,@14)                                  0471 00086000
*CRAFRR=ATCDCFRR;                   /* SAVE FRR POINTER FROM VTAM CVT*/ 00087000
         L     @09,ATCDCFRR(,@09)                                  0472 00088000
         ST    @09,CRAFRR(,@15)                                    0472 00089000
*CRRID=CRRTYPE;                     /* SET CONTROL LAYER ID IN CRR   */ 00090000
         MVI   CRRID(@14),X'22'                                    0473 00091000
*CRRLEN=LENGTH(ISTDCCRR)+LENGTH(CRRSAREA);                         0474 00092000
         MVC   CRRLEN(2,@14),@CH04502                              0474 00093000
*                                   /*SET CRR LENGTH                 */ 00094000
*CRACRR=ADDR(CRAPROCR);             /* SAVE CRR PTR IN CRA           */ 00095000
         LA    @14,CRAPROCR(,@15)                                  0475 00096000
         ST    @14,CRACRR(,@15)                                    0475 00097000
*     END;                                                         0476 00098000
*     CRRC00=ON;/*SET AUDIT TRAIL SWITCH*/                         0477 00099000
@RC00448 OI    CRRC00(PTRCRR),B'10000000'                          0477 00100000
*     CRRM00=ON;/*SET MODULE TRAIL SWITCH*/                        0478 00101000
         OI    CRRM00(PTRCRR),B'10000000'                          0478 00102000
*/* IT'S DETERMINED THAT THE WORK ELEMENT IS NOT AN LCPB.  A       0479 00103000
*  CHECK IS MADE TO FIND OUT IF THE MAJOR NODE CONTROL BLOCK IS    0479 00104000
*  AN FMCB, AND, IF SO, WHETHER THE FMCB IS IN CLEAR STATE.        0479 00105000
*IF IT IS THE ADDRESS OF THE DVT NAME IS PUT IN REG 0 FOR THE      0479 00106000
*TPDVTS MACRO.  IN ALL OTHER CASES ,EXCEPT WHERE THE WORK ELEMENT  0479 00107000
*IS AN LCPB, THE REQUEST SUBROUTINE IS CALLED.  FOR LCPB, THE      0479 00108000
*LCPBPROC SUBROUTINE IS CALLED.                                 */ 0479 00109000
*                                                                  0479 00110000
*                                                                  0479 00111000
*IF RPHWEA=ZERO |                         /* CHECK FOR ZERO WORK ELT */ 00112000
*  RPHWEA->RPLID = '00'X THEN             /* OR AN RPL               */ 00113000
         L     @15,RPHWEA(,PTRRPH)                                 0479 00114000
         LTR   @15,@15                                             0479 00115000
         BZ    @RT00479                                            0479 00116000
         CLI   RPLID(@15),X'00'                                    0479 00117000
         BNE   @RF00479                                            0479 00118000
@RT00479 DS    0H                                                  0480 00119000
*  DO;                                    /* DO NOT AN LCPB          */ 00120000
*   IF RPHMAJCB -> FMCTYPE = FMTYPE THEN                           0481 00121000
         L     @15,RPHMAJCB-1(,PTRRPH)                             0481 00122000
         LA    @15,0(,@15)                                         0481 00123000
         CLI   FMCTYPE(@15),X'03'                                  0481 00124000
         BNE   @RF00481                                            0481 00125000
*      DO;                                /* DO MJR NODE CB AN FMCB  */ 00126000
*       PTRFMCB = RPHMAJCB;               /* ADDRESS THE FMCB        */ 00127000
         LR    PTRFMCB,@15                                         0483 00128000
*       RFY ISTFMCB BASED(PTRFMCB);                                0484 00129000
*       IF FMCCLEAR = ON THEN            /* IS IT IN CLR STATE      */  00130000
         TM    FMCCLEAR(PTRFMCB),B'01000000'                       0485 00131000
         BNO   @RF00485                                            0485 00132000
*          DO;                            /* DO FMCB IN CLR STATE    */ 00133000
*           ADDRDVT = ADDR(DVTCLEAR);     /* PREPARE FOR TPDVTS      */ 00134000
         LA    ADDRDVT,DVTCLEAR                                    0487 00135000
*           CRRSW6 = ON;                                           0488 00136000
         OI    CRRSW6(PTRCRR),B'00000010'                          0488 00137000
*          END;                           /* END FMCB IN CLR STATE   */ 00138000
*       ELSE CALL REQUEST;                                         0490 00139000
         B     @RC00485                                            0490 00140000
@RF00485 BAL   @14,REQUEST                                         0490 00141000
*      END;                               /* END MJR NODE CB AN FMCB */ 00142000
*   ELSE CALL REQUEST;                                             0492 00143000
         B     @RC00481                                            0492 00144000
@RF00481 BAL   @14,REQUEST                                         0492 00145000
*  END;                                   /*  END NOT AN LCPB        */ 00146000
*ELSE DO;                                                   /*@DM09122* 00147000
         B     @RC00479                                            0494 00148000
@RF00479 DS    0H                                                  0495 00149000
*      IF RPHWEA->FSBTYPE=FSTYPE THEN                       /*@DM09122* 00150000
         L     @15,RPHWEA(,PTRRPH)                                 0495 00151000
         CLI   FSBTYPE(@15),X'02'                                  0495 00152000
         BNE   @RF00495                                            0495 00153000
*       DO;                                                 /*@DM09122* 00154000
*         ADDRDVT=ADDR(DVTCLEAR);                           /*@DM09122* 00155000
         LA    ADDRDVT,DVTCLEAR                                    0497 00156000
*         CRRSW6=ON;                                        /*@DM09122* 00157000
         OI    CRRSW6(PTRCRR),B'00000010'                          0498 00158000
*       END;                                                /*@DM09122* 00159000
*      ELSE DO;                                             /*@DM09122* 00160000
         B     @RC00495                                            0500 00161000
@RF00495 DS    0H                                                  0501 00162000
*/********************************************************************/ 00163000
*/*                                                                  */ 00164000
*/* SEGMENT NAME :LCPBPROC                                           */ 00165000
*/*                                                                  */ 00166000
*/* FUNCTION :   TO ROUTE CONTROL TO THE APPROPRIATE ROUTINE WHEN    */ 00167000
*/*   THE WORK ELEMENT IS AN LCPB.                                   */ 00168000
*/*                                                                  */ 00169000
*/*                                                                  */ 00170000
*/* INPUT :   AN LCPB AS A WORK ELEMENT AND A MAJOR NODE CONTROL     */ 00171000
*/*   BLOCK OF AN FMCB OR AN ACDEB.                                  */ 00172000
*/*                                                                  */ 00173000
*/* OUTPUT :   THE ADDRESS OF A DVT NAME IN REGISTER 0 OR A SWITCH   */ 00174000
*/*    INDICATING THE TYPE OF EXIT TO BE TAKEN.                      */ 00175000
*/* SUBROUTINES CALLED :  ISTDCC85 THRU THE ATCVT.                   */ 00176000
*/*                                                                  */ 00177000
*/* MACROS USED :  NONE                                              */ 00178000
*/*                                                                  */ 00179000
*/********************************************************************/ 00180000
*RFY ISTDCLCP BASED (RPHWEA);                                      0501 00181000
*RFY ISTLCPB BASED (ADDR(DCLLCPB));                                0502 00182000
*                                                                  0502 00183000
*    IF RPHMAJCB->ACDTYPE=ACDID THEN                               0503 00184000
         L     @15,RPHMAJCB-1(,PTRRPH)                             0503 00185000
         LA    @15,0(,@15)                                         0503 00186000
         CLI   ACDTYPE(@15),X'0F'                                  0503 00187000
         BNE   @RF00503                                            0503 00188000
*       DO;                  /* DO - READ ANY PURGE  */            0504 00189000
*         RFY ISTATCVT BASED(CRRATCVT); /* BASE THE ATCVT    */    0505 00190000
*         GEN REFS(R14,R12,CRRSAVE1) SETS(CRRSAVE1)         /*@DM09569* 00191000
*         (STM R14,R12,CRRSAVE1+12(R13)); /*SAVE REGISTERS    @DM09569* 00192000
         STM R14,R12,CRRSAVE1+12(R13)                                   00193000
*         CALL ATCNERAP;       /* EXIT TO READ ANY PURGE      @DM08353* 00194000
         L     @14,CRRATCVT(,PTRCRR)                               0507 00195000
         L     @15,ATCNERAP(,@14)                                  0507 00196000
         BALR  @14,@15                                             0507 00197000
*         GEN REFS(CRRSAVE1,R13) SETS(R14,R12)              /*@DM09569* 00198000
*         (LM R14,R12,CRRSAVE1+12(R13));/*RESTORE REGISTERS   @DM09569* 00199000
         LM R14,R12,CRRSAVE1+12(R13)                                    00200000
*         CRRSW5=ON;                                               0509 00201000
         OI    CRRSW5(PTRCRR),B'00000100'                          0509 00202000
*       END;                /* END - READ ANY PURGE     */         0510 00203000
*                                                                  0510 00204000
*     ELSE DO;                                                     0511 00205000
         B     @RC00503                                            0511 00206000
@RF00503 DS    0H                                                  0512 00207000
*            ADDRDVT=ADDR(DVTPURGE);                               0512 00208000
         LA    ADDRDVT,DVTPURGE                                    0512 00209000
*            CRRSW6=ON;                                            0513 00210000
         OI    CRRSW6(PTRCRR),B'00000010'                          0513 00211000
*          END;                                                    0514 00212000
*       END;/*END LCPBPROC*/                                       0515 00213000
@RC00503 DS    0H                                                  0516 00214000
*     END;                                                  /*@DM09122* 00215000
@RC00495 DS    0H                                                  0517 00216000
*IF CRRSW6 = ON THEN                     /* TPDVTS SWITCH           */  00217000
@RC00479 TM    CRRSW6(PTRCRR),B'00000010'                          0517 00218000
         BNO   @RF00517                                            0517 00219000
*  DO;                                                             0518 00220000
*                                                                  0518 00221000
*/*  TPDVTS NAMEPTR(ADDRDVT) */                                    0519 00222000
*   DO;                                                            0519 00223000
*                                                                  0519 00224000
*/* ATBUILD (ISTRPH,ISTPAB,ISTDYPAB,ISTATCVT)  */                  0520 00225000
*/* END OF ATBUILD */                                              0520 00226000
*   RFY (GPR01P,GPR02P,GPR06P,GPR08P) RSTD;                        0520 00227000
*   GEN REFS(GPR01P,GPR02P,GPR08P) SETS(RPHWORK)                   0521 00228000
*   (STM   GPR02P,GPR08P,RPHWORK(GPR01P));                         0521 00229000
         STM   GPR02P,GPR08P,RPHWORK(GPR01P)                            00230000
*   RFY (GPR02P,GPR08P) UNRSTD;                                    0522 00231000
*   RFY GPR00P RSTD;                                               0523 00232000
*   GPR00P = ADDRDVT;                                              0524 00233000
*   GPR01P -> RPHSRPRM = 0;                                        0525 00234000
         SLR   @15,@15                                             0525 00235000
         ST    @15,RPHSRPRM(,GPR01P)                               0525 00236000
*   RFY GPR15P RSTD;                                               0526 00237000
*                                                                  0526 00238000
*   DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                  0527 00239000
*     GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                  0528 00240000
         L     GPR15P,ATCLCPTR                                     0528 00241000
*   END; /*LISATCVT*/                                              0529 00242000
*   GPR15P=GPR15P -> ATCESC02;                                     0530 00243000
         L     GPR15P,ATCESC02(,GPR15P)                            0530 00244000
*   DCL FMZL0022 BASED(GPR15P) LABEL VALUERANGE(*);                0531 00245000
*   CALL FMZL0022;                                                 0532 00246000
         BALR  @14,@15                                             0532 00247000
*   RFY (GPR00P,GPR15P) UNRSTD;                                    0533 00248000
*   RFY (GPR02P,GPR08P) RSTD;                                      0534 00249000
*   GEN REFS(RPHWORK) SETS(GPR02P,GPR08P)                          0535 00250000
*   (LM    GPR02P,GPR08P,RPHWORK(GPR01P));                         0535 00251000
         LM    GPR02P,GPR08P,RPHWORK(GPR01P)                            00252000
*   RFY (GPR01P,GPR02P,GPR06P,GPR08P) UNRSTD;                      0536 00253000
*   END;                                                           0537 00254000
*/***** END OF TPDVTS GENERATION *****/                            0538 00255000
*  CRRRTNCD=CRRLOGIC;                   /* CTRL RTNS HERE IF TPDVTS */  00256000
         MVI   CRRRTNCD(PTRCRR),X'08'                              0538 00257000
*  CRRFDB2='67'X;                       /*  FAILS                   */  00258000
         MVI   CRRFDB2(PTRCRR),X'67'                               0539 00259000
*  END;                                                            0540 00260000
*ELSE IF CRRSW5 = ON THEN                /* TPEXIT SWITCH           */  00261000
*                                                                  0541 00262000
         B     @RC00517                                            0541 00263000
@RF00517 TM    CRRSW5(PTRCRR),B'00000100'                          0541 00264000
         BNO   @RF00541                                            0541 00265000
*/* TPEXIT  NORM */                                                0542 00266000
*   DO;                                                            0542 00267000
*     RESPECIFY GPR15P RSTD;                                       0543 00268000
*                                                                  0543 00269000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         0544 00270000
*/* END OF ATBUILD */                                              0544 00271000
*                                                                  0544 00272000
*   DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                  0544 00273000
*     GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                  0545 00274000
         L     GPR15P,ATCLCPTR                                     0545 00275000
*   END; /*LISATCVT*/                                              0546 00276000
*     RESPECIFY GPR00F RSTD;                                       0547 00277000
*     GPR00F=4;    /* SET PARAMETER REGISTER TO 4 */               0548 00278000
         LA    GPR00F,4                                            0548 00279000
*     GPR15P=GPR15P->ATCAP31;                                      0549 00280000
         L     GPR15P,ATCAP31(,GPR15P)                             0549 00281000
*     DCL FMZL0030 BASED(GPR15P) LABEL VALUERANGE(*);              0550 00282000
*     CALL FMZL0030;                                               0551 00283000
         BALR  @14,@15                                             0551 00284000
*     RESPECIFY (GPR00F,GPR15P) UNRSTD;                            0552 00285000
*   END; /***** END OF TPEXIT  *****/                              0553 00286000
*         /*@DM09007*/                                             0554 00287000
*    ELSE;                                /* NEITHER SWITCH SET       * 00288000
@RF00541 DS    0H                                                  0555 00289000
*                                        /* CAUSES DEFAULT TO TPESC  */ 00290000
*                                                                  0555 00291000
*/*TPESC*/                                                         0555 00292000
*   DO;                                                            0555 00293000
*                                                                  0555 00294000
@RC00517 DS    0H                                                  0556 00295000
*/* ATBUILD (ISTDYPAB,ISTAVT,ISTATCVT)  */                         0556 00296000
*/* VTAM ADDRESS VECTOR TABLE */                                   0556 00297000
*/*  REVISIONS                                         002 03/06/75  */ 00298000
*DCL  1  ISTAVT BDY(WORD) BASED,                                   0556 00299000
*       2  ISTACVT PTR(31),            /* ADDR OF VTAM CVT           */ 00300000
*       2  ISTAS49 PTR(31),            /* ADDR OF SVC 49 CODE        */ 00301000
*          3  ISTAHIP BIT(1),          /* HALT IN PROGRESS           */ 00302000
*       2  ISTAS53 PTR(31),            /* ADDR OF SVC 53 CODE        */ 00303000
*       2  ISTAPSTA PTR(31),           /* ADDR OF APS TABLE          */ 00304000
*       2  AVTASID FIXED(15),          /* VTAM ASID                  */ 00305000
*       2  ISTVTTIK FIXED(15),         /* VTAMRP TASK ID             */ 00306000
*       2  ISTAPSEX PTR(31),           /* ADDR OF APS EXIT           */ 00307000
*       2  ISTPHNM CHAR(5),            /* PHASE NAME OF TRANSIENT    */ 00308000
*       2  ISTX1 CHAR(1),              /* TEST FIELD                 */ 00309000
*       2  ISTARID PTR(15),            /* ADDR OF RID                */ 00310000
*       2  ISTATRT PTR(15),            /* ADDR OF VTAM GATES IN RETAB*/ 00311000
*       2  ISTAGTWT PTR(15),           /* ADDR OF GATEWAIT ROUTINE   */ 00312000
*       2  ISTVTTP  PTR(15),           /* ADDR OF CODE TO CHECK FOR  */ 00313000
*                                      /* PENDING TIMER INTERRUPT    */ 00314000
*       2  ISTAVR01 CHAR(2),           /* RESERVED                   */ 00315000
*       2  ISTPDAVP PTR(31);           /* VECTOR FOR PDAIDS SMS TRACE*/ 00316000
*/* END OF ATBUILD */                                              0557 00317000
*     RFY GPR15P RSTD;                                             0557 00318000
*                                                                  0557 00319000
*   DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                  0558 00320000
*     GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                  0559 00321000
         L     GPR15P,ATCLCPTR                                     0559 00322000
*   END; /*LISATCVT*/                                              0560 00323000
*     GPR15P=GPR15P->ATCESC01;                                     0561 00324000
         L     GPR15P,ATCESC01(,GPR15P)                            0561 00325000
*     DCL FMZL0038 BASED(GPR15P) LABEL VALUERANGE(*);              0562 00326000
*     CALL FMZL0038;                                               0563 00327000
         BALR  @14,@15                                             0563 00328000
*     RESPECIFY GPR15P UNRSTD;                                     0564 00329000
*   END;  /***** END OF  TPESC *****/                              0565 00330000
*/********************************************************************/ 00331000
*/*                                                                  */ 00332000
*/* ROUTINE NAME :REQUEST                                            */ 00333000
*/*                                                                  */ 00334000
*/* FUNCTION :  TO PROCESS REQUESTS THAT DO NOT HAVE AN LCPB AS THE  */ 00335000
*/*   WORK ELEMENT.  IN CASES WHERE THERE IS AN RPL PASSED VIA THE   */ 00336000
*/*   RPH, THE SUBROUTINE DETERMINES THE TYPE OF REQUEST AND,IF IT IS*/ 00337000
*/*   A RECEIVE, READ, OR SOLICIT, FURTHER DETERMINES WHETHER IT IS  */ 00338000
*/*   AN ANY OR SPECIFIC OPERATION.  IN CASES WHERE THERE IS NO WORK */ 00339000
*/*  ELEMENT IN THE RPH, CONTROL PASSES TO A SUBROUTINE WHICH TRIES  */ 00340000
*/*  TO FIND ONE.                                                    */ 00341000
*/*                                                                  */ 00342000
*/* INPUT :USUALLY A WORK ELEMENT OF AN RPL BUT SOME TIMES NO WORK   */ 00343000
*/*   ELEMENT.  ALSO A MAJOR NODE CONTROL BLOCK OF AN FMCB OR ACDEB. */ 00344000
*/*                                                                  */ 00345000
*/* OUTPUT :  A SWITCH INDICATING WHETHER EXIT FROM ISTDCC00 IS VIA  */ 00346000
*/*   TPEXIT,TPDVTS, OR TPESC (NO SWITCH SET).                       */ 00347000
*/*                                                                  */ 00348000
*/* SUBROUTINES CALLED :                                             */ 00349000
*/*  ISTDCC24 (THRU THE ATCVT).                                      */ 00350000
*/*                                                                  */ 00351000
*/* MACROS USED :  TPLOCK                                            */ 00352000
*/*                                                                  */ 00353000
*/********************************************************************/ 00354000
*                                                                  0566 00355000
*                                                                  0566 00356000
*REQUEST: PROC OPTIONS(NOPARMREG,NOSAVE,NOSAVEAREA);               0566 00357000
*                                                                  0566 00358000
         B     @PB00002                                            0566 00359000
REQUEST  DS    0H                                                  0567 00360000
*RFY R14 RSTD;                                                     0567 00361000
*CRRRTN9=R14;                                                      0568 00362000
         ST    R14,CRRRTN9(,PTRCRR)                                0568 00363000
*RFY R14 UNRSTD;                                                   0569 00364000
*IF RPHMAJCB ->FMCTYPE=FMTYPE THEN                                 0570 00365000
         L     @15,RPHMAJCB-1(,PTRRPH)                             0570 00366000
         LA    @15,0(,@15)                                         0570 00367000
         CLI   FMCTYPE(@15),X'03'                                  0570 00368000
         BNE   @RF00570                                            0570 00369000
*  DO;                              /*DO MJR NODE CB IS FMCB   */  0571 00370000
*                                                                  0571 00371000
*/*** START -TPLOCK (CTLLOCK)TYPE(XCLSIVE)- ***/                   0572 00372000
*     DO;                                                          0572 00373000
*     RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;        0573 00374000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);     00375000
         STM GPR00P,GPR14P,RPHWORK(GPR01P)                              00376000
*        GPR02P = ADDR(FMCDCLOK);       /*SET PARAM - LOCKWORD PTR*/    00377000
         LA    GPR02P,FMCDCLOK(,PTRFMCB)                           0575 00378000
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 0576 00379000
         L     GPR04P,RPHCRR(,GPR01P)                              0576 00380000
*        GPR00P = CRALMS08;             /*SET PARAM - LOCK LEVEL FLAG*/ 00381000
         LA    GPR00P,128                                          0577 00382000
*        GPR03P = ADDR(GPR04P->CRAL8PTR);                          0578 00383000
         LA    GPR03P,CRAL8PTR(,GPR04P)                            0578 00384000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  00385000
*        GPR15P=ATCLCPTR->ATCAP36;      /*ADDRESS OF LOCK ROUTINE*/     00386000
         L     @05,ATCLCPTR                                        0579 00387000
         L     GPR15P,ATCAP36(,@05)                                0579 00388000
*        DCL FMZL0046 BASED(GPR15P) LABEL VALUERANGE(*);           0580 00389000
*        CALL FMZL0046;                                            0581 00390000
         BALR  @14,@15                                             0581 00391000
*        GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P 00392000
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P, 00393000
*PR12P,GPR13P,GPR14P,GPR15P);                                      0582 00394000
*                                                                  0582 00395000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               00396000
*     RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;      0583 00397000
*        END;                                                      0584 00398000
*/*** END -TPLOCK (CTLLOCK)TYPE(XCLSIVE)- ***/                     0585 00399000
*    IF R15 = ZERO THEN             /* IF FMCB GOT LOCKED */       0585 00400000
         SLR   @14,@14                                             0585 00401000
         CR    R15,@14                                             0585 00402000
         BNE   @RF00585                                            0585 00403000
*       DO;                         /* DO SET FMCB LOCKED FLAG */  0586 00404000
*       CRRFMCLK=ON;/*@D33SKXW */                                  0587 00405000
*                                                                  0587 00406000
         OI    CRRFMCLK(PTRCRR),B'10000000'                        0587 00407000
*        IF RPHWEA=ZERO THEN    DO;        /* NO WORK ELEMENT IN RPH */ 00408000
         C     @14,RPHWEA(,PTRRPH)                                 0588 00409000
         BNE   @RF00588                                            0588 00410000
*/********************************************************************/ 00411000
*/*                                                                  */ 00412000
*/* SEGMENT NAME :  NOWORKEL                                         */ 00413000
*/*                                                                  */ 00414000
*/* FUNCTION :  FINDS A WORK ELEMENT WHEN THE MAJOR NODE CONTROL     */ 00415000
*/*             BLOCK IS AN FMCB.  FOR RECORD MODE IT CHECKS THE RPL */ 00416000
*/*             RTYPES AGAINST THE TYPES OF DATA ON THE FMCB DATA    */ 00417000
*/*             QUEUES. FOR BASIC MODE IT DEQUES THE OLDEST RPL FROM */ 00418000
*/*             THE FMCB WAIT Q. IF NO RPL IS FOUND CRRSW5 IS TURNED */ 00419000
*/*             ON CAUSING A TPEXIT UPON RETURN.                     */ 00420000
*/* INPUT : A POINTER TO THE FMCB.                                   */ 00421000
*/*                                                                  */ 00422000
*/*                                                                  */ 00423000
*/* OUTPUT :  CRRSW5 IS ON IF A TPEXIT IS TO BE DONE                 */ 00424000
*/*           AN RPL IN RPHWEA IF ONE WAS FOUND.                     */ 00425000
*/* SUBROUTINES CALLED :        UNLOCK                               */ 00426000
*/*                                                                  */ 00427000
*/* MACROS USED :TPDEQ                                               */ 00428000
*/*                                                                  */ 00429000
*/********************************************************************/ 00430000
*                                                                  0590 00431000
*                                                                  0590 00432000
*IF FMCMODE = FMCRCD THEN          /* RECORD MODE TEST */          0590 00433000
         CLC   FMCMODE(8,PTRFMCB),@CC03734                         0590 00434000
         BNE   @RF00590                                            0590 00435000
*  DO;                                                             0591 00436000
*    PTRRPL = FMCRPLA;                     /* GET RPL FROM WAIT Q */    00437000
         L     PTRRPL,FMCRPLA(,PTRFMCB)                            0592 00438000
*    RFY IFGRPL BASED(PTRRPL);                                     0593 00439000
*    DO WHILE PTRRPL ^= ZERO &                                     0594 00440000
*             PTRRPL ^= GATE & CRRARPL=ZERO; /* FIND OLDEST RPL */ 0594 00441000
         B     @DE00594                                            0594 00442000
@DL00594 DS    0H                                                  0595 00443000
*       IF(RPLDFASY=ON&FMCFBAS^=ZERO&FMCFBAS^=GATE) |              0595 00444000
*         (RPLRRESP=ON&FMCFBRE^=ZERO&FMCFBRE^=GATE) |              0595 00445000
*         (RPLNFSYN=OFF&FMCFBA^=ZERO&FMCFBA^=GATE)    THEN         0595 00446000
*                                                                  0595 00447000
         TM    RPLDFASY+16(PTRRPL),B'00000010'                     0595 00448000
         BNO   @GL00003                                            0595 00449000
         L     @15,FMCFBAS(,PTRFMCB)                               0595 00450000
         LTR   @15,@15                                             0595 00451000
         BZ    @GL00003                                            0595 00452000
         CL    @15,@CF01326                                        0595 00453000
         BNE   @RT00595                                            0595 00454000
@GL00003 TM    RPLRRESP+16(PTRRPL),B'00001000'                     0595 00455000
         BNO   @GL00002                                            0595 00456000
         L     @15,FMCFBRE(,PTRFMCB)                               0595 00457000
         LTR   @15,@15                                             0595 00458000
         BZ    @GL00002                                            0595 00459000
         CL    @15,@CF01326                                        0595 00460000
         BNE   @RT00595                                            0595 00461000
@GL00002 TM    RPLNFSYN+16(PTRRPL),B'00000100'                     0595 00462000
         BNZ   @RF00595                                            0595 00463000
         L     @15,FMCFBA(,PTRFMCB)                                0595 00464000
         LTR   @15,@15                                             0595 00465000
         BZ    @RF00595                                            0595 00466000
         CL    @15,@CF01326                                        0595 00467000
         BE    @RF00595                                            0595 00468000
@RT00595 DS    0H                                                  0596 00469000
*         CRRARPL = PTRRPL;             /* SAVE ADDR IF MATCH FOUND */  00470000
         ST    PTRRPL,CRRARPL(,PTRCRR)                             0596 00471000
*       ELSE;                                                      0597 00472000
@RF00595 DS    0H                                                  0598 00473000
*       PTRRPL = RPLPLHPT;           /* GET NEXT RPL IN CHAIN */   0598 00474000
         L     PTRRPL,RPLPLHPT(,PTRRPL)                            0598 00475000
*    END;                            /* END DO WHILE            */ 0599 00476000
*                                                                  0599 00477000
@DE00594 SLR   @15,@15                                             0599 00478000
         CR    PTRRPL,@15                                          0599 00479000
         BE    @DC00594                                            0599 00480000
         CL    PTRRPL,@CF01326                                     0599 00481000
         BE    @DC00594                                            0599 00482000
         C     @15,CRRARPL(,PTRCRR)                                0599 00483000
         BE    @DL00594                                            0599 00484000
@DC00594 DS    0H                                                  0600 00485000
*    IF CRRARPL = ZERO |                                           0600 00486000
*       CRRARPL = GATE THEN ;                                      0600 00487000
         L     @15,CRRARPL(,PTRCRR)                                0600 00488000
         LTR   @15,@15                                             0600 00489000
         BZ    @RT00600                                            0600 00490000
         CL    @15,@CF01326                                        0600 00491000
         BE    @RT00600                                            0600 00492000
*    ELSE DO;                                                      0602 00493000
*                                                                  0602 00494000
*/* TPDEQ (CRRARPL,FMCRPLA)  */                                    0603 00495000
*        DO; /* BEGIN TPDEQ CODE GENERATION */                     0603 00496000
*        DCL FMZCA051 BIT(32) CONSTANT('80000000'X);               0604 00497000
*        DCL FMZCB051 BIT(32) CONSTANT('7FFFFFFF'X);               0605 00498000
*        RFY (GPR00P,GPR01P,GPR14P,GPR15P) RSTD;                   0606 00499000
*                                                                  0606 00500000
*        RFY ISTWKE  ;                                             0607 00501000
*        GPR15P=ADDR(FMCRPLA); /*ADDRESS QUEUE POINTER */          0608 00502000
         LA    GPR15P,FMCRPLA(,PTRFMCB)                            0608 00503000
*        RFY (GPR02P,GPR03P) RSTD;                                 0609 00504000
*        STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                 0610 00505000
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0610 00506000
*        GPR03P=CRRARPL | FMZCA051;                                0611 00507000
         L     @09,@CF01326                                        0611 00508000
         L     GPR03P,CRRARPL(,PTRCRR)                             0611 00509000
         OR    GPR03P,@09                                          0611 00510000
*        GPR14P=FMZCA051;                                          0612 00511000
         LR    GPR14P,@09                                          0612 00512000
*        GPR15P=ADDR(GPR15P->PABWEQA);                             0613 00513000
*        GPR02P=GPR15P->PABWEQA|FMZCA051;                          0614 00514000
         O     @09,PABWEQA(,GPR15P)                                0614 00515000
         LR    GPR02P,@09                                          0614 00516000
*        DO WHILE(GPR02P^=GPR14P);                                 0615 00517000
         B     @DE00615                                            0615 00518000
@DL00615 DS    0H                                                  0616 00519000
*FMZL2051:;                                                        0616 00520000
FMZL2051 DS    0H                                                  0617 00521000
*          IF GPR02P=GPR03P                                        0617 00522000
*          THEN DO;                                                0617 00523000
         CR    GPR02P,GPR03P                                       0617 00524000
         BNE   @RF00617                                            0617 00525000
*            GPR00P=GPR02P->WKECHAIN;                              0619 00526000
         L     GPR00P,WKECHAIN(,GPR02P)                            0619 00527000
*            CS(GPR02P,GPR00P,GPR15P->PABWEQA);                    0620 00528000
         CS    GPR02P,@00,PABWEQA(GPR15P)                          0620 00529000
*            BC(7,FMZL3051);                                       0621 00530000
         BC    7,FMZL3051                                          0621 00531000
*            GPR14P=GPR02P;                                        0622 00532000
         LR    GPR14P,GPR02P                                       0622 00533000
*            GPR14P->WKECHAIN=0;                                   0623 00534000
         SLR   @09,@09                                             0623 00535000
         ST    @09,WKECHAIN(,GPR14P)                               0623 00536000
*            END;                                                  0624 00537000
*          ELSE DO;                                                0625 00538000
         B     @RC00617                                            0625 00539000
@RF00617 DS    0H                                                  0626 00540000
*            IF (GPR02P->WKECHAIN)=GPR14P                          0626 00541000
*            THEN                                                  0626 00542000
         L     @09,WKECHAIN(,GPR02P)                               0626 00543000
         CR    @09,GPR14P                                          0626 00544000
         BE    @RT00626                                            0626 00545000
*              GOTO ISTA0051;                                      0627 00546000
*            ELSE DO;                                              0628 00547000
*              GPR15P=ADDR(GPR02P->WKECHAIN);                      0629 00548000
         LA    GPR15P,WKECHAIN(,GPR02P)                            0629 00549000
*              GPR02P=GPR02P->WKECHAIN;                            0630 00550000
         LR    GPR02P,@09                                          0630 00551000
*              GOTO FMZL2051;                                      0631 00552000
         B     FMZL2051                                            0631 00553000
*              END;                                                0632 00554000
*            END;                                                  0633 00555000
*FMZL3051:;                                                        0634 00556000
@RC00617 DS    0H                                                  0634 00557000
FMZL3051 DS    0H                                                  0635 00558000
*        END;                                                      0635 00559000
@DE00615 CR    GPR02P,GPR14P                                       0635 00560000
         BNE   @DL00615                                            0635 00561000
*ISTA0051:;                                                        0636 00562000
ISTA0051 DS    0H                                                  0637 00563000
*        LM (GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                 0637 00564000
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0637 00565000
*        RFY (GPR02P,GPR03P) UNRSTD;                               0638 00566000
*        GPR14P=GPR14P&FMZCB051;                                   0639 00567000
         N     GPR14P,@CF01324                                     0639 00568000
*        GPR01P->RPHWEA=GPR14P;                                    0640 00569000
         ST    GPR14P,RPHWEA(,GPR01P)                              0640 00570000
*        RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;                 0641 00571000
*        END; /* END TPDEQ GENERATION */             /* DEQUE OLDEST RP 00572000
*    */                                                            0642 00573000
*       CRRARPL=RPHWEA;                                            0643 00574000
         L     @15,RPHWEA(,PTRRPH)                                 0643 00575000
         ST    @15,CRRARPL(,PTRCRR)                                0643 00576000
*         END;                                                     0644 00577000
*                                                                  0644 00578000
*  END;                          /* END RECORD MODE  */            0645 00579000
*ELSE DO;                      /* BASIC MODE             */        0646 00580000
         B     @RC00590                                            0646 00581000
@RF00590 DS    0H                                                  0647 00582000
*    CRRSW4=ON;                                                    0647 00583000
         OI    CRRSW4(PTRCRR),B'00001000'                          0647 00584000
*    IF FMCFBA = ZERO |                                            0648 00585000
*       FMCFBA = GATE THEN                                         0648 00586000
         L     @15,FMCFBA(,PTRFMCB)                                0648 00587000
         LTR   @15,@15                                             0648 00588000
         BZ    @RT00648                                            0648 00589000
         CL    @15,@CF01326                                        0648 00590000
         BNE   @RF00648                                            0648 00591000
@RT00648 DS    0H                                                  0649 00592000
*       IF FMCFLGA0 = ON THEN         /* DATA EXPECTED   */        0649 00593000
         TM    FMCFLGA0(PTRFMCB),B'10000000'                       0649 00594000
         BNO   @RF00649                                            0649 00595000
*          CRRSW4 = OFF;                                           0650 00596000
         NI    CRRSW4(PTRCRR),B'11110111'                          0650 00597000
*       ELSE;                                                      0651 00598000
@RF00649 DS    0H                                                  0652 00599000
*    ELSE;                                                         0652 00600000
*                                                                  0652 00601000
@RF00648 DS    0H                                                  0653 00602000
*    IF CRRSW4 = ON THEN                                           0653 00603000
         TM    CRRSW4(PTRCRR),B'00001000'                          0653 00604000
         BNO   @RF00653                                            0653 00605000
*      DO;                                                         0654 00606000
*                                                                  0654 00607000
*/* TPDEQ (,FMCRPLA)  */                                           0655 00608000
*       DO; /* BEGIN TPDEQ CODE GENERATION */                      0655 00609000
*       RFY (GPR00P,GPR01P,GPR14P,GPR15P) RSTD;                    0656 00610000
*                                                                  0656 00611000
*       GPR15P=ADDR(FMCRPLA); /*ADDRESS QUEUE POINTER */           0657 00612000
         LA    GPR15P,FMCRPLA(,PTRFMCB)                            0657 00613000
*       GPR14P=GPR15P->PABWEQA|FMZCA051;                           0658 00614000
         L     @09,@CF01326                                        0658 00615000
         L     GPR14P,PABWEQA(,GPR15P)                             0658 00616000
         OR    GPR14P,@09                                          0658 00617000
*       IF GPR14P=FMZCA051 THEN;                                   0659 00618000
         CLR   GPR14P,@09                                          0659 00619000
         BE    @RT00659                                            0659 00620000
*       ELSE DO;                                                   0661 00621000
*FMZL1057:;                                                        0662 00622000
FMZL1057 DS    0H                                                  0663 00623000
*         DO WHILE(GPR14P->WKECHAIN^=FMZCA051);                    0663 00624000
         B     @DE00663                                            0663 00625000
@DL00663 DS    0H                                                  0664 00626000
*           GPR15P=ADDR(GPR14P->WKECHAIN);                         0664 00627000
         LA    GPR15P,WKECHAIN(,GPR14P)                            0664 00628000
*           GPR14P=GPR15P->PABWEQA;                                0665 00629000
         L     GPR14P,PABWEQA(,GPR15P)                             0665 00630000
*         END;                                                     0666 00631000
@DE00663 L     @09,@CF01326                                        0666 00632000
         CL    @09,WKECHAIN(,GPR14P)                               0666 00633000
         BNE   @DL00663                                            0666 00634000
*         GPR00P=FMZCA051;                                         0667 00635000
         LR    GPR00P,@09                                          0667 00636000
*         CS(GPR14P,GPR00P,GPR15P->PABWEQA);                       0668 00637000
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0668 00638000
*         BC(7,FMZL1057);                                          0669 00639000
         BC    7,FMZL1057                                          0669 00640000
*         GPR14P->WKECHAIN=0;                                      0670 00641000
         SLR   @09,@09                                             0670 00642000
         ST    @09,WKECHAIN(,GPR14P)                               0670 00643000
*       END;                                                       0671 00644000
*ISTA0057:;                                                        0672 00645000
@RT00659 DS    0H                                                  0672 00646000
ISTA0057 DS    0H                                                  0673 00647000
*       GPR14P=GPR14P&FMZCB051;                                    0673 00648000
         N     GPR14P,@CF01324                                     0673 00649000
*       GPR01P->RPHWEA=GPR14P;                                     0674 00650000
         ST    GPR14P,RPHWEA(,GPR01P)                              0674 00651000
*       RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;                  0675 00652000
*       END; /* END TPDEQ GENERATION *//*@D33SKXW*/                0676 00653000
*      CRRARPL=RPHWEA;                                             0677 00654000
         L     @15,RPHWEA(,PTRRPH)                                 0677 00655000
         ST    @15,CRRARPL(,PTRCRR)                                0677 00656000
*      END;                                                        0678 00657000
*    ELSE;                                                         0679 00658000
@RF00653 DS    0H                                                  0680 00659000
*   END;                        /* END BASIC          */           0680 00660000
*                                                                  0680 00661000
*IF RPHWEA = ZERO |                                                0681 00662000
*  RPHWEA = GATE THEN                                              0681 00663000
@RC00590 L     @15,RPHWEA(,PTRRPH)                                 0681 00664000
         LTR   @15,@15                                             0681 00665000
         BZ    @RT00681                                            0681 00666000
         CL    @15,@CF01326                                        0681 00667000
         BNE   @RF00681                                            0681 00668000
@RT00681 DS    0H                                                  0682 00669000
*  DO;                                                             0682 00670000
*    CALL UNLOCK;                /* UNLOCK FMCB */                 0683 00671000
         BAL   @14,UNLOCK                                          0683 00672000
*    CRRSW5 = ON;               /* PREPARE TO TPEXIT */            0684 00673000
         OI    CRRSW5(PTRCRR),B'00000100'                          0684 00674000
*  END;                                                            0685 00675000
*ELSE;                                                             0686 00676000
@RF00681 DS    0H                                                  0687 00677000
* END;                                                             0687 00678000
*        ELSE;                                                     0688 00679000
@RF00588 DS    0H                                                  0689 00680000
*       END;                             /* END SET FMCB LOCKED FLAG */ 00681000
*    ELSE CRRSW5 = ON;                  /* COULD NOT LOCK FMCB-TPEXIT*/ 00682000
         B     @RC00585                                            0690 00683000
@RF00585 OI    CRRSW5(PTRCRR),B'00000100'                          0690 00684000
*   END;                              /*   END MJR NODE CB IS FMCB   */ 00685000
*ELSE DO;                                                          0692 00686000
         B     @RC00570                                            0692 00687000
@RF00570 DS    0H                                                  0693 00688000
*  RFY ISTACDEB BASED (PTRDEB);                                    0693 00689000
*   PTRDEB=RPHMAJCB;                                               0694 00690000
         L     PTRDEB,RPHMAJCB-1(,PTRRPH)                          0694 00691000
         LA    PTRDEB,0(,PTRDEB)                                   0694 00692000
*   IF RPHWEA = ZERO |                /* CHECK FOR WORK ELEMENT    */   00693000
*      RPHWEA = GATE THEN                                          0695 00694000
         L     @15,RPHWEA(,PTRRPH)                                 0695 00695000
         LTR   @15,@15                                             0695 00696000
         BZ    @RT00695                                            0695 00697000
         CL    @15,@CF01326                                        0695 00698000
         BNE   @RF00695                                            0695 00699000
@RT00695 DS    0H                                                  0696 00700000
*     DO;                            /* TRY AND FIND A WORK ELEMENT*/   00701000
*/********************************************************************/ 00702000
*/*                                                                  */ 00703000
*/* SEGMENT NAME : NODEBEL                                           */ 00704000
*/*                                                                  */ 00705000
*/* FUNCTION :   TO FIND A WORK ELEMENT WHEN THE MAJOR NODE          */ 00706000
*/*              CONTROL BLOCK IS AN ACDEB. IF THE REQUSET IS        */ 00707000
*/*              RECORD MODE THE RTYPES OF THE RPLS ON THE WAIT      */ 00708000
*/*              QUEUE ARE CHECKED AGAINST THE DATA TYPES ON THE     */ 00709000
*/*              FMCB DATA QUEUES.  IN BASIC MODE THE OLDEST RPL     */ 00710000
*/*              IS DEQUEUED.  IF NO RPLS ARE FOUND THEN CRRSW5      */ 00711000
*/*              IS TURNED ON TO INDICATE A TPEXIT UPON RETURN.      */ 00712000
*/*                                                                  */ 00713000
*/* INPUT :THE ADDRESS OF THE ACDEB .                                */ 00714000
*/*                                                                  */ 00715000
*/*                                                                  */ 00716000
*/* OUTPUT :CRRSW5 ON INDICATING TPEXIT OR AN RPL IN RPHWEA          */ 00717000
*/*                                                                  */ 00718000
*/* SUBROUTINES CALLED :                                             */ 00719000
*/*                                                                  */ 00720000
*/* MACROS USED :  TPDEQ,TPLOCK,TPUNLOCK                             */ 00721000
*/*                                                                  */ 00722000
*/********************************************************************/ 00723000
*                                                                  0697 00724000
*                                                                  0697 00725000
*/*LOCK ACDEB*/                                                    0697 00726000
*IF CRRDBLCK = OFF THEN     /*FINDLKDEB*/                          0697 00727000
         TM    CRRDBLCK(PTRCRR),B'00010000'                        0697 00728000
         BNZ   @RF00697                                            0697 00729000
*  DO;                                                             0698 00730000
*/*VMDESET  ((15),ZERO)*/                                          0699 00731000
*     DO;                                /* INVOKE MODESET MACRO    */  00732000
*       GEN;                                                       0700 00733000
*                                                                  0700 00734000
         MODESET EXTKEY=ZERO,WORKREG=2                                  00735000
*     RFY (GPR15P) RSTD;                                           0701 00736000
*       GPR15F=0;                                                  0702 00737000
*                                                                  0702 00738000
         SLR   GPR15F,GPR15F                                       0702 00739000
*     RFY (GPR15P) UNRSTD;               /*PUT RETURN CODE IN RCREG*/   00740000
*     END;  /* VMDESET */                                          0704 00741000
*                                                                  0704 00742000
*/*** START -TPLOCK (DEBLOCK)TYPE(XCLSIVE)- ***/                   0705 00743000
*     DO;                                                          0705 00744000
*     RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;        0706 00745000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);     00746000
         STM GPR00P,GPR14P,RPHWORK(GPR01P)                              00747000
*        GPR02P = ADDR(ACDLOCK);        /*SET PARAM - LOCKWORD PTR*/    00748000
         LA    GPR02P,ACDLOCK(,PTRDEB)                             0708 00749000
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 0709 00750000
         L     GPR04P,RPHCRR(,GPR01P)                              0709 00751000
*        GPR00P = CRALMS05;             /*SET PARAM - LOCK LEVEL FLAG*/ 00752000
         LA    GPR00P,16                                           0710 00753000
*        GPR03P = ADDR(GPR04P->CRAL5PTR);                          0711 00754000
         LA    GPR03P,CRAL5PTR(,GPR04P)                            0711 00755000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  00756000
*        GPR15P=ATCLCPTR->ATCAP36;      /*ADDRESS OF LOCK ROUTINE*/     00757000
         L     @05,ATCLCPTR                                        0712 00758000
         L     GPR15P,ATCAP36(,@05)                                0712 00759000
*        DCL FMZL0064 BASED(GPR15P) LABEL VALUERANGE(*);           0713 00760000
*        CALL FMZL0064;                                            0714 00761000
         BALR  @14,@15                                             0714 00762000
*        GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P 00763000
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P, 00764000
*PR12P,GPR13P,GPR14P,GPR15P);                                      0715 00765000
*                                                                  0715 00766000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               00767000
*     RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;      0716 00768000
*        END;                                                      0717 00769000
*/*** END -TPLOCK (DEBLOCK)TYPE(XCLSIVE)- ***/                     0718 00770000
*     CRRDBLCK = ON;                                               0718 00771000
*                                                                  0718 00772000
         OI    CRRDBLCK(PTRCRR),B'00010000'                        0718 00773000
*/*VMDESET  ((15),ATCAM)*/                                         0719 00774000
*     DO;                                /* INVOKE MODESET MACRO    */  00775000
*       GEN;                                                       0720 00776000
*                                                                  0720 00777000
         MODESET EXTKEY=VTAM,WORKREG=2                                  00778000
*     RFY (GPR15P) RSTD;                                           0721 00779000
*       GPR15F=0;                                                  0722 00780000
*                                                                  0722 00781000
         SLR   GPR15F,GPR15F                                       0722 00782000
*     RFY (GPR15P) UNRSTD;               /*PUT RETURN CODE IN RCREG*/   00783000
*     END;  /* VMDESET */                                          0724 00784000
*  END;                                                            0725 00785000
*                                                                  0725 00786000
*PTRRPL = ACDRARQ;                /* GET RPL FROM DEB RA Q */      0726 00787000
*                                                                  0726 00788000
@RF00697 L     PTRRPL,ACDRARQ(,PTRDEB)                             0726 00789000
*DO WHILE PTRRPL^=ZERO &                                           0727 00790000
*        PTRRPL^=GATE & CRRARPL=ZERO;                              0727 00791000
         B     @DE00727                                            0727 00792000
@DL00727 DS    0H                                                  0728 00793000
*  IF(RPLDFASY=ON&ACDASFQ^=ZERO&ACDASFQ^=GATE) |                   0728 00794000
*    (RPLRRESP=ON&ACDREFQ^=ZERO&ACDREFQ^=GATE) THEN                0728 00795000
         TM    RPLDFASY+16(PTRRPL),B'00000010'                     0728 00796000
         BNO   @GL00016                                            0728 00797000
         L     @15,ACDASFQ(,PTRDEB)                                0728 00798000
         LTR   @15,@15                                             0728 00799000
         BZ    @GL00016                                            0728 00800000
         CL    @15,@CF01326                                        0728 00801000
         BNE   @RT00728                                            0728 00802000
@GL00016 TM    RPLRRESP+16(PTRRPL),B'00001000'                     0728 00803000
         BNO   @RF00728                                            0728 00804000
         L     @15,ACDREFQ(,PTRDEB)                                0728 00805000
         LTR   @15,@15                                             0728 00806000
         BZ    @RF00728                                            0728 00807000
         CL    @15,@CF01326                                        0728 00808000
         BE    @RF00728                                            0728 00809000
@RT00728 DS    0H                                                  0729 00810000
*    CRRARPL=PTRRPL;                /*STORE MATCHED PAIR */        0729 00811000
         ST    PTRRPL,CRRARPL(,PTRCRR)                             0729 00812000
*  ELSE                                                            0730 00813000
*    DO;                          /* NO MATCH       */             0730 00814000
         B     @RC00728                                            0730 00815000
@RF00728 DS    0H                                                  0731 00816000
*      IF (RPLNFSYN = OFF ) &                         /*     @D31KKNL*/ 00817000
*         (ACDRAFQ^=ZERO&ACDRAFQ^=GATE) THEN                       0731 00818000
         TM    RPLNFSYN+16(PTRRPL),B'00000100'                     0731 00819000
         BNZ   @RF00731                                            0731 00820000
         L     @15,ACDRAFQ(,PTRDEB)                                0731 00821000
         LTR   @15,@15                                             0731 00822000
         BZ    @RF00731                                            0731 00823000
         CL    @15,@CF01326                                        0731 00824000
         BE    @RF00731                                            0731 00825000
*         DO;                                                      0732 00826000
*           PTRFMCB=ACDRAFQ;        /*GET FMCB ADDRESS */          0733 00827000
         LR    PTRFMCB,@15                                         0733 00828000
*           IF RPLREQ='23'X THEN                                   0734 00829000
         CLI   RPLREQ(PTRRPL),35                                   0734 00830000
         BNE   @RF00734                                            0734 00831000
*              DO WHILE (PTRFMCB^=ZERO &                           0735 00832000
*                        PTRFMCB^= GATE) &                  /*@DM09850* 00833000
*                       (CRRARPL=ZERO |                            0735 00834000
*                        CRRARPL=GATE);                            0735 00835000
         B     @DE00735                                            0735 00836000
@DL00735 DS    0H                                                  0736 00837000
*                 IF FMCMODE=FMCRCD THEN                           0736 00838000
         CLC   FMCMODE(8,PTRFMCB),@CC03734                         0736 00839000
         BNE   @RF00736                                            0736 00840000
*                    CRRARPL=PTRRPL;                               0737 00841000
         ST    PTRRPL,CRRARPL(,PTRCRR)                             0737 00842000
*                 ELSE PTRFMCB=FMCRAFM;                            0738 00843000
         B     @RC00736                                            0738 00844000
@RF00736 L     PTRFMCB,FMCRAFM(,PTRFMCB)                           0738 00845000
*              END;              /* END DO WHILE    */             0739 00846000
@RC00736 DS    0H                                                  0739 00847000
@DE00735 SLR   @15,@15                                             0739 00848000
         CR    PTRFMCB,@15                                         0739 00849000
         BE    @DC00735                                            0739 00850000
         L     @14,@CF01326                                        0739 00851000
         CLR   PTRFMCB,@14                                         0739 00852000
         BE    @DC00735                                            0739 00853000
         L     @09,CRRARPL(,PTRCRR)                                0739 00854000
         CR    @09,@15                                             0739 00855000
         BE    @DL00735                                            0739 00856000
         CLR   @09,@14                                             0739 00857000
         BE    @DL00735                                            0739 00858000
@DC00735 DS    0H                                                  0740 00859000
*           ELSE                                                   0740 00860000
*              DO WHILE (PTRFMCB^=ZERO &                           0740 00861000
*                        PTRFMCB^=GATE) &                   /*@DM09850* 00862000
*                       (CRRARPL=ZERO |                            0740 00863000
*                        CRRARPL=GATE);                            0740 00864000
         B     @RC00734                                            0740 00865000
@RF00734 B     @DE00740                                            0740 00866000
@DL00740 DS    0H                                                  0741 00867000
*                 IF FMCMODE^=FMCRCD THEN                          0741 00868000
         CLC   FMCMODE(8,PTRFMCB),@CC03734                         0741 00869000
         BE    @RF00741                                            0741 00870000
*                    CRRARPL=PTRRPL;                               0742 00871000
         ST    PTRRPL,CRRARPL(,PTRCRR)                             0742 00872000
*                 ELSE PTRFMCB=FMCRAFM;                            0743 00873000
         B     @RC00741                                            0743 00874000
@RF00741 L     PTRFMCB,FMCRAFM(,PTRFMCB)                           0743 00875000
*              END;                                                0744 00876000
@RC00741 DS    0H                                                  0744 00877000
@DE00740 SLR   @15,@15                                             0744 00878000
         CR    PTRFMCB,@15                                         0744 00879000
         BE    @DC00740                                            0744 00880000
         L     @14,@CF01326                                        0744 00881000
         CLR   PTRFMCB,@14                                         0744 00882000
         BE    @DC00740                                            0744 00883000
         L     @09,CRRARPL(,PTRCRR)                                0744 00884000
         CR    @09,@15                                             0744 00885000
         BE    @DL00740                                            0744 00886000
         CLR   @09,@14                                             0744 00887000
         BE    @DL00740                                            0744 00888000
@DC00740 DS    0H                                                  0745 00889000
*         END;               /*DFSYN OR READ & FMCB  ON RD  ANY Q*/     00890000
*      ELSE;                                                       0746 00891000
@RF00731 DS    0H                                                  0747 00892000
*    END;                                                          0747 00893000
@RC00731 DS    0H                                                  0748 00894000
*  PTRRPL=RPLPLHPT;                 /* GET NEXT RPL      */        0748 00895000
@RC00728 L     PTRRPL,RPLPLHPT(,PTRRPL)                            0748 00896000
*END;                                                              0749 00897000
*                                                                  0749 00898000
@DE00727 SLR   @15,@15                                             0749 00899000
         CR    PTRRPL,@15                                          0749 00900000
         BE    @DC00727                                            0749 00901000
         CL    PTRRPL,@CF01326                                     0749 00902000
         BE    @DC00727                                            0749 00903000
         C     @15,CRRARPL(,PTRCRR)                                0749 00904000
         BE    @DL00727                                            0749 00905000
@DC00727 DS    0H                                                  0750 00906000
*IF CRRARPL^=ZERO &                                                0750 00907000
*  CRRARPL^=GATE THEN                                              0750 00908000
         L     @15,CRRARPL(,PTRCRR)                                0750 00909000
         LTR   @15,@15                                             0750 00910000
         BZ    @RF00750                                            0750 00911000
         L     @14,@CF01326                                        0750 00912000
         CLR   @15,@14                                             0750 00913000
         BE    @RF00750                                            0750 00914000
*  DO;                                                             0751 00915000
*                                                                  0751 00916000
*/* TPDEQ (CRRARPL,ACDRARQ)  */                                    0752 00917000
*     DO; /* BEGIN TPDEQ CODE GENERATION */                        0752 00918000
*     RFY (GPR00P,GPR01P,GPR14P,GPR15P) RSTD;                      0753 00919000
*                                                                  0753 00920000
*     GPR15P=ADDR(ACDRARQ); /*ADDRESS QUEUE POINTER */             0754 00921000
         LA    GPR15P,ACDRARQ(,PTRDEB)                             0754 00922000
*     RFY (GPR02P,GPR03P) RSTD;                                    0755 00923000
*     STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                    0756 00924000
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0756 00925000
*     GPR03P=CRRARPL | FMZCA051;                                   0757 00926000
         L     @09,@CF01326                                        0757 00927000
         L     @08,CRRARPL(,PTRCRR)                                0757 00928000
         OR    @08,@09                                             0757 00929000
         LR    GPR03P,@08                                          0757 00930000
*     GPR14P=FMZCA051;                                             0758 00931000
         LR    GPR14P,@09                                          0758 00932000
*     GPR15P=ADDR(GPR15P->PABWEQA);                                0759 00933000
*     GPR02P=GPR15P->PABWEQA|FMZCA051;                             0760 00934000
         O     @09,PABWEQA(,GPR15P)                                0760 00935000
         LR    GPR02P,@09                                          0760 00936000
*     DO WHILE(GPR02P^=GPR14P);                                    0761 00937000
         B     @DE00761                                            0761 00938000
@DL00761 DS    0H                                                  0762 00939000
*FMZL2072:;                                                        0762 00940000
FMZL2072 DS    0H                                                  0763 00941000
*       IF GPR02P=GPR03P                                           0763 00942000
*       THEN DO;                                                   0763 00943000
         CR    GPR02P,GPR03P                                       0763 00944000
         BNE   @RF00763                                            0763 00945000
*         GPR00P=GPR02P->WKECHAIN;                                 0765 00946000
         L     GPR00P,WKECHAIN(,GPR02P)                            0765 00947000
*         CS(GPR02P,GPR00P,GPR15P->PABWEQA);                       0766 00948000
         CS    GPR02P,@00,PABWEQA(GPR15P)                          0766 00949000
*         BC(7,FMZL3072);                                          0767 00950000
         BC    7,FMZL3072                                          0767 00951000
*         GPR14P=GPR02P;                                           0768 00952000
         LR    GPR14P,GPR02P                                       0768 00953000
*         GPR14P->WKECHAIN=0;                                      0769 00954000
         SLR   @09,@09                                             0769 00955000
         ST    @09,WKECHAIN(,GPR14P)                               0769 00956000
*         END;                                                     0770 00957000
*       ELSE DO;                                                   0771 00958000
         B     @RC00763                                            0771 00959000
@RF00763 DS    0H                                                  0772 00960000
*         IF (GPR02P->WKECHAIN)=GPR14P                             0772 00961000
*         THEN                                                     0772 00962000
         L     @09,WKECHAIN(,GPR02P)                               0772 00963000
         CR    @09,GPR14P                                          0772 00964000
         BE    @RT00772                                            0772 00965000
*           GOTO ISTA0072;                                         0773 00966000
*         ELSE DO;                                                 0774 00967000
*           GPR15P=ADDR(GPR02P->WKECHAIN);                         0775 00968000
         LA    GPR15P,WKECHAIN(,GPR02P)                            0775 00969000
*           GPR02P=GPR02P->WKECHAIN;                               0776 00970000
         LR    GPR02P,@09                                          0776 00971000
*           GOTO FMZL2072;                                         0777 00972000
         B     FMZL2072                                            0777 00973000
*           END;                                                   0778 00974000
*         END;                                                     0779 00975000
*FMZL3072:;                                                        0780 00976000
@RC00763 DS    0H                                                  0780 00977000
FMZL3072 DS    0H                                                  0781 00978000
*     END;                                                         0781 00979000
@DE00761 CR    GPR02P,GPR14P                                       0781 00980000
         BNE   @DL00761                                            0781 00981000
*ISTA0072:;                                                        0782 00982000
ISTA0072 DS    0H                                                  0783 00983000
*     LM (GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                    0783 00984000
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0783 00985000
*     RFY (GPR02P,GPR03P) UNRSTD;                                  0784 00986000
*     GPR14P=GPR14P&FMZCB051;                                      0785 00987000
         N     GPR14P,@CF01324                                     0785 00988000
*     GPR01P->RPHWEA=GPR14P;                                       0786 00989000
         ST    GPR14P,RPHWEA(,GPR01P)                              0786 00990000
*     RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;                    0787 00991000
*     END; /* END TPDEQ GENERATION */                              0788 00992000
*     CRRARPL=RPHWEA;                                              0789 00993000
         L     @15,RPHWEA(,PTRRPH)                                 0789 00994000
         ST    @15,CRRARPL(,PTRCRR)                                0789 00995000
*  END;                                                            0790 00996000
*ELSE CRRSW5=ON;                                                   0791 00997000
*                                                                  0791 00998000
         B     @RC00750                                            0791 00999000
@RF00750 OI    CRRSW5(PTRCRR),B'00000100'                          0791 01000000
*IF CRRDBLCK = ON THEN  /*UNLKDEB*/                                0792 01001000
@RC00750 TM    CRRDBLCK(PTRCRR),B'00010000'                        0792 01002000
         BNO   @RF00792                                            0792 01003000
*  DO;                                                             0793 01004000
*                                                                  0793 01005000
*/*VMDESET  ((15),ZERO)*/                                          0794 01006000
*      DO;                               /* INVOKE MODESET MACRO    */  01007000
*        GEN;                                                      0795 01008000
*                                                                  0795 01009000
         MODESET EXTKEY=ZERO,WORKREG=2                                  01010000
*      RFY (GPR15P) RSTD;                                          0796 01011000
*        GPR15F=0;                                                 0797 01012000
*                                                                  0797 01013000
         SLR   GPR15F,GPR15F                                       0797 01014000
*      RFY (GPR15P) UNRSTD;              /*PUT RETURN CODE IN RCREG*/   01015000
*      END;  /* VMDESET */                                         0799 01016000
*     CRRDBLCK=OFF;                                                0800 01017000
*                                                                  0800 01018000
         NI    CRRDBLCK(PTRCRR),B'11101111'                        0800 01019000
*/*** START -TPUNLOCK (DEBLOCK)- ***/                              0801 01020000
*      DO;                                                         0801 01021000
*                                                                  0801 01022000
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)  */                             0802 01023000
*/* END OF ATBUILD */                                              0802 01024000
*                                                                  0802 01025000
*      RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;       0802 01026000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);     01027000
         STM GPR00P,GPR15P,RPHWORK(GPR01P)                              01028000
*        GPR02P = ADDR(ACDLOCK);        /*SET PARAM - LOCKWORD PTR*/    01029000
         LA    GPR02P,ACDLOCK(,PTRDEB)                             0804 01030000
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 0805 01031000
         L     GPR04P,RPHCRR(,GPR01P)                              0805 01032000
*        GPR00P = CRALMS05;             /*SET PARAM - LOCK LEVEL FLAG*/ 01033000
         LA    GPR00P,16                                           0806 01034000
*        GPR03P = ADDR(GPR04P->CRAL5PTR);                          0807 01035000
         LA    GPR03P,CRAL5PTR(,GPR04P)                            0807 01036000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  01037000
*                                                                  0808 01038000
*      DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */               0808 01039000
*        GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/               0809 01040000
         L     GPR15P,ATCLCPTR                                     0809 01041000
*      END; /*LISATCVT*/                                           0810 01042000
*        GPR15P=GPR15P->ATCAP33;                                   0811 01043000
         L     GPR15P,ATCAP33(,GPR15P)                             0811 01044000
*        DCL FMZL0081 BASED(GPR15P) LABEL VALUERANGE(*);           0812 01045000
*        CALL FMZL0081;                                            0813 01046000
         BALR  @14,@15                                             0813 01047000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P 01048000
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P, 01049000
*PR12P,GPR13P,GPR14P,GPR15P);                                      0814 01050000
*                                                                  0814 01051000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               01052000
*      RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;     0815 01053000
*        END;                                                      0816 01054000
*/*** END -TPUNLOCK (DEBLOCK)- ***/                                0817 01055000
*                                                                  0817 01056000
*/*VMDESET  ((15),VTAM)*/                                          0817 01057000
*      DO;                               /* INVOKE MODESET MACRO    */  01058000
*        GEN;                                                      0818 01059000
*                                                                  0818 01060000
         MODESET EXTKEY=VTAM,WORKREG=2                                  01061000
*      RFY (GPR15P) RSTD;                                          0819 01062000
*        GPR15F=0;                                                 0820 01063000
*                                                                  0820 01064000
         SLR   GPR15F,GPR15F                                       0820 01065000
*      RFY (GPR15P) UNRSTD;              /*PUT RETURN CODE IN RCREG*/   01066000
*      END;  /* VMDESET */                                         0822 01067000
*  END;                                                            0823 01068000
*  END;/*END NODEBEL*/                                             0824 01069000
*   ELSE;                                                          0825 01070000
@RF00695 DS    0H                                                  0826 01071000
*  END;                                                            0826 01072000
*                                                                  0826 01073000
*                                                                  0826 01074000
@RC00695 DS    0H                                                  0827 01075000
*IF CRRSW5 = OFF THEN               /* NO TPEXIT INDICATED           */ 01076000
@RC00570 TM    CRRSW5(PTRCRR),B'00000100'                          0827 01077000
         BNZ   @RF00827                                            0827 01078000
*  DO;                              /* DO - NOT A TPEXIT             */ 01079000
*   RFY IFGRPL BASED (RPHWEA);      /* ADDRESS THE RPL               */ 01080000
*   CRRLCPB=ZERO;                   /* CLEAR THE LCPB PTR IN CRR     */ 01081000
         SLR   @15,@15                                             0830 01082000
         ST    @15,CRRLCPB(,PTRCRR)                                0830 01083000
*   CRRARPL=ADDR(IFGRPL);           /* PLACE RPL ADDRESS IN CRR      */ 01084000
         L     @15,RPHWEA(,PTRRPH)                                 0831 01085000
         ST    @15,CRRARPL(,PTRCRR)                                0831 01086000
*   CRRREQP=ON;                    /* INDICATE A REQUEST MADE       */  01087000
*                                                                  0832 01088000
         OI    CRRREQP(PTRCRR),B'00000010'                         0832 01089000
*/*       HERE A CHECK IS MADE FOR A VALID REQUEST                   */ 01090000
*                                                                  0833 01091000
*   IF RPLREQ<'11'X|                                               0833 01092000
*      RPLREQ>'24'X|                                               0833 01093000
*     (RPLREQ>'13'X & RPLREQ<'1D'X) |                              0833 01094000
*     (RPLREQ>'1E'X & RPLREQ < '22'X) THEN                         0833 01095000
         CLI   RPLREQ(@15),17                                      0833 01096000
         BL    @RT00833                                            0833 01097000
         CLI   RPLREQ(@15),36                                      0833 01098000
         BH    @RT00833                                            0833 01099000
         CLI   RPLREQ(@15),19                                      0833 01100000
         BNH   @GL00032                                            0833 01101000
         CLI   RPLREQ(@15),29                                      0833 01102000
         BL    @RT00833                                            0833 01103000
@GL00032 L     @15,RPHWEA(,PTRRPH)                                 0833 01104000
         CLI   RPLREQ(@15),30                                      0833 01105000
         BNH   @RF00833                                            0833 01106000
         CLI   RPLREQ(@15),34                                      0833 01107000
         BNL   @RF00833                                            0833 01108000
@RT00833 DS    0H                                                  0834 01109000
*      DO;                              /* DO INVALID REQUEST        */ 01110000
*       CRRRTNCD=CRRLOGIC;                                         0835 01111000
         MVI   CRRRTNCD(PTRCRR),X'08'                              0835 01112000
*       CRRFDB2=CRRCRIRT;                                          0836 01113000
         MVI   CRRFDB2(PTRCRR),X'1C'                               0836 01114000
*       CRRFMCB=RPHMAJCB;/*@AS09500*/                              0837 01115000
         L     @15,RPHMAJCB-1(,PTRRPH)                             0837 01116000
         LA    @15,0(,@15)                                         0837 01117000
         ST    @15,CRRFMCB(,PTRCRR)                                0837 01118000
*      END;                            /* END INVALID REQUEST        */ 01119000
*   ELSE DO;                           /* DO VALID REQUEST           */ 01120000
         B     @RC00833                                            0839 01121000
@RF00833 DS    0H                                                  0840 01122000
*         CRRSW1=OFF;                                              0840 01123000
*                                                                  0840 01124000
         NI    CRRSW1(PTRCRR),B'10111111'                          0840 01125000
*/* CRRSW1 IS SET IF THE REQUEST IS A SOLICIT ALL, RECEIVE ANY, OR READ 01126000
*   ANY                                                              */ 01127000
*                                                                  0841 01128000
*        IF RPLREQ='1E'X|                                          0841 01129000
*            RPLREQ='23'X|                                         0841 01130000
*            RPLREQ='1D'X THEN                                     0841 01131000
         L     @15,RPHWEA(,PTRRPH)                                 0841 01132000
         CLI   RPLREQ(@15),30                                      0841 01133000
         BE    @RT00841                                            0841 01134000
         CLI   RPLREQ(@15),35                                      0841 01135000
         BE    @RT00841                                            0841 01136000
         CLI   RPLREQ(@15),29                                      0841 01137000
         BNE   @RF00841                                            0841 01138000
@RT00841 DS    0H                                                  0842 01139000
*            IF RPHMAJCB->ACDTYPE=ACDID THEN                       0842 01140000
         L     @15,RPHMAJCB-1(,PTRRPH)                             0842 01141000
         LA    @15,0(,@15)                                         0842 01142000
         CLI   ACDTYPE(@15),X'0F'                                  0842 01143000
         BNE   @RF00842                                            0842 01144000
*               CRRSW1=ON;                                         0843 01145000
         OI    CRRSW1(PTRCRR),B'01000000'                          0843 01146000
*            ELSE;                                                 0844 01147000
@RF00842 DS    0H                                                  0845 01148000
*         ELSE IF RPHMAJCB->FMCTYPE=FMTYPE THEN;                   0845 01149000
         B     @RC00841                                            0845 01150000
@RF00841 L     @15,RPHMAJCB-1(,PTRRPH)                             0845 01151000
         LA    @15,0(,@15)                                         0845 01152000
         CLI   FMCTYPE(@15),X'03'                                  0845 01153000
         BE    @RT00845                                            0845 01154000
*              ELSE DO;          /*DO - NOT ACDEB,NOT FMCB  */     0847 01155000
*                    CRRRTNCD=CRRLOGIC;                            0848 01156000
         MVI   CRRRTNCD(PTRCRR),X'08'                              0848 01157000
*                    CRRFDB2=CRRCRIRT;                             0849 01158000
         MVI   CRRFDB2(PTRCRR),X'1C'                               0849 01159000
*                    CRRSW1=ON;                                    0850 01160000
         OI    CRRSW1(PTRCRR),B'01000000'                          0850 01161000
*                    CRRFMCB=ZERO;                                 0851 01162000
         SLR   @15,@15                                             0851 01163000
         ST    @15,CRRFMCB(,PTRCRR)                                0851 01164000
*                   END;         /* END - NOT ACDEB,NOT FMCB  */   0852 01165000
*                                                                  0852 01166000
*/* THE BUFPURGE SUBROUTINE IS AALLED IF THE REQUEST ISN'T AN 'ANY'     01167000
*    TYPE REQUEST                                                    */ 01168000
*                                                                  0853 01169000
*         IF CRRSW1=OFF THEN                                       0853 01170000
@RT00845 DS    0H                                                  0853 01171000
@RC00841 TM    CRRSW1(PTRCRR),B'01000000'                          0853 01172000
         BNZ   @RF00853                                            0853 01173000
*      DO;/*      BUFPURGE*/                                       0854 01174000
*/********************************************************************/ 01175000
*/*                                                                  */ 01176000
*/* SEGMENT NAME : BUFPURGE                                          */ 01177000
*/*                                                                  */ 01178000
*/* FUNCTION :  TO RELINQUISH CONTROL TO PURGE OUTBOUND THRU TPDVTS  */ 01179000
*/*             AND TO CALL THE BUFFER TRACE ROUTINE WHEN THE        */ 01180000
*/*             BUFFER TRACE ACTIVE FLAG IS ON IN THE FMCB.          */ 01181000
*/*             BUFFER TRACE IS ONLY CALLED FOR SEND,WRITE OR DO     */ 01182000
*/*             COMMANDS.                                            */ 01183000
*/* INPUT :FMCFLGA4 FLAG FOR PURGE                                   */ 01184000
*/*        FMCZF007 FLAG FOR BUFFER TRACE                            */ 01185000
*/*                                                                  */ 01186000
*/* OUTPUT :  CRRSW6 ON TO INDICATE TPDVTS FOR PURGE                 */ 01187000
*/*                                                                  */ 01188000
*/* SUBROUTINES CALLED :  UNLOCK                                     */ 01189000
*/*                                                                  */ 01190000
*/* MACROS USED :  NONE                                              */ 01191000
*/*                                                                  */ 01192000
*/********************************************************************/ 01193000
*CRRFMCB=ZERO;                                                     0855 01194000
         SLR   @15,@15                                             0855 01195000
         ST    @15,CRRFMCB(,PTRCRR)                                0855 01196000
*IF FMCFLGA4=ON THEN                                               0856 01197000
         TM    FMCFLGA4(PTRFMCB),B'00001000'                       0856 01198000
         BNO   @RF00856                                            0856 01199000
*  DO;                                                             0857 01200000
*    CALL UNLOCK;                                                  0858 01201000
         BAL   @14,UNLOCK                                          0858 01202000
*    CRRSW6=ON;                                                    0859 01203000
         OI    CRRSW6(PTRCRR),B'00000010'                          0859 01204000
*    ADDRDVT=ADDR(DVTPURGE);                                       0860 01205000
         LA    ADDRDVT,DVTPURGE                                    0860 01206000
*  END;                                                            0861 01207000
*                                                                  0861 01208000
*ELSE                                                              0862 01209000
*  DO;                                                             0862 01210000
         B     @RC00856                                            0862 01211000
@RF00856 DS    0H                                                  0863 01212000
*    IF FMCZF007 = ON &                                            0863 01213000
*       (RPLREQ = '11'X |                                          0863 01214000
*        RPLREQ = '13'X    |                                       0863 01215000
*        RPLREQ = '22'X) THEN                                      0863 01216000
         TM    FMCZF007(PTRFMCB),B'00000100'                       0863 01217000
         BNO   @RF00863                                            0863 01218000
         L     @15,RPHWEA(,PTRRPH)                                 0863 01219000
         CLI   RPLREQ(@15),17                                      0863 01220000
         BE    @RT00863                                            0863 01221000
         CLI   RPLREQ(@15),19                                      0863 01222000
         BE    @RT00863                                            0863 01223000
         CLI   RPLREQ(@15),34                                      0863 01224000
         BNE   @RF00863                                            0863 01225000
@RT00863 DS    0H                                                  0864 01226000
*       DO;                                                        0864 01227000
*  GEN REFS(R14,R12,CRRSAVE) SETS(CRRSAVE)                         0865 01228000
*  ( STM  R14,R12,CRRSAVE+12(R13));  /* SAVE REGISTERS          */ 0865 01229000
          STM  R14,R12,CRRSAVE+12(R13)                                  01230000
*  RFY (R02,R06,R14,R15) RSTD;    /* REQUIRED FOR CALLING SEQK0860 */   01231000
*  R02=PTRFMCB;                            /* SAVE FMCB PTR  @DM12472*/ 01232000
         LR    R02,PTRFMCB                                         0867 01233000
*  R06 = CRRARPL;                 /* GET ADDRESS OF RPL            */   01234000
         L     R06,CRRARPL(,PTRCRR)                                0868 01235000
*  R06 = R06&HIZERO;              /* SET HIGH ORDER BYTE TO ZERO   */   01236000
         N     R06,@CF04362                                        0869 01237000
*  R15 = CRRATCVT->ATCBFTRC;      /* ADDRESS TRACE ROUTINE    */   0870 01238000
         L     @03,CRRATCVT(,PTRCRR)                               0870 01239000
         L     R15,ATCBFTRC(,@03)                                  0870 01240000
*  GEN (BALR R14,R15)             /* CALL THE                 */   0871 01241000
*  SETS(R14) REFS(R15);          /*  BUFFER TRACE ROUTINE    */    0871 01242000
         BALR R14,R15                                                   01243000
*  RFY (R02,R06,R14,R15) UNRSTD;      /* END OF CALL SEQUENCE    */     01244000
*                                                                  0872 01245000
*  PTRCRR=ADDR(CRRSPACE);           /*REBASE THE CRR          @DM09781* 01246000
*                                                                  0873 01247000
         L     PTRCRR,RPHCRR(,PTRRPH)                              0873 01248000
         LA    PTRCRR,CRRSPACE+312(,PTRCRR)                        0873 01249000
*  GEN REFS(CRRSAVE,R13) SETS(R14,R12)                             0874 01250000
*  ( LM  R14,R12,CRRSAVE+12(R13));  /* RESTORE REGISTERS        */ 0874 01251000
          LM  R14,R12,CRRSAVE+12(R13)                                   01252000
*     END;                                                         0875 01253000
*  ELSE;                                                           0876 01254000
@RF00863 DS    0H                                                  0877 01255000
* END;                    /* END - PURGE NOT IN PROGRESS */        0877 01256000
* END;                                                             0878 01257000
*         ELSE;                                                    0879 01258000
@RF00853 DS    0H                                                  0880 01259000
*         IF CRRSW6=OFF THEN                                       0880 01260000
@RC00853 TM    CRRSW6(PTRCRR),B'00000010'                          0880 01261000
         BNZ   @RF00880                                            0880 01262000
*            DO;                                                   0881 01263000
*             IF (RPLREQ='1D'X|RPLREQ='23'X)&              /*@DM08360*/ 01264000
*                 RPHMAJCB->ACDTYPE=ACDID THEN;            /*@DM08360*/ 01265000
         L     @15,RPHWEA(,PTRRPH)                                 0882 01266000
         CLI   RPLREQ(@15),29                                      0882 01267000
         BE    @GL00042                                            0882 01268000
         CLI   RPLREQ(@15),35                                      0882 01269000
         BNE   @RF00882                                            0882 01270000
@GL00042 L     @15,RPHMAJCB-1(,PTRRPH)                             0882 01271000
         LA    @15,0(,@15)                                         0882 01272000
         CLI   ACDTYPE(@15),X'0F'                                  0882 01273000
         BE    @RT00882                                            0882 01274000
*          ELSE DO;                   /*DO - NOT RCV ANY OR READ ANY */ 01275000
@RF00882 DS    0H                                                  0885 01276000
*                IF RPLREQ^='23'X & RPLREQ^='24'X THEN             0885 01277000
         L     @15,RPHWEA(,PTRRPH)                                 0885 01278000
         CLI   RPLREQ(@15),35                                      0885 01279000
         BE    @RF00885                                            0885 01280000
         CLI   RPLREQ(@15),36                                      0885 01281000
         BE    @RF00885                                            0885 01282000
*                IF RPLREQ^='23'X THEN                             0886 01283000
         CLI   RPLREQ(@15),35                                      0886 01284000
         BE    @RF00886                                            0886 01285000
*             DO;/*      NRCRDANY*/                                0887 01286000
*/********************************************************************/ 01287000
*/*                                                                  */ 01288000
*/* SEGMENT NAME :NRCRDANY                                           */ 01289000
*/*                                                                  */ 01290000
*/* FUNCTION :  TO BUILD AN LCPB FOR ALL REQUESTS EXCEPT RECEIVES    */ 01291000
*/*             AND READ ANY'S. FOR SOLICITALL REQUESTS THAT HAVE    */ 01292000
*/*             NOT YET BEEN PROCESSED FOR THE FIRST FMCB, IT GETS   */ 01293000
*/*             AN FMCB FOR SOLICIT ALL TO PROCESS FROM THE ACDEB.   */ 01294000
*/* INPUT :RPH IN REG 1                                              */ 01295000
*/*                                                                  */ 01296000
*/*                                                                  */ 01297000
*/* OUTPUT :  AN INITIALIZED LCPB, AND , FOR A SOLICIT ALL, AN FMCB  */ 01298000
*/*           TO PROCESS.                                            */ 01299000
*/* SUBROUTINES CALLED :                                             */ 01300000
*/*                                                                  */ 01301000
*/* MACROS USED :  REQSTORE,TPUNLOCK,TPLOCK                          */ 01302000
*/*                                                                  */ 01303000
*/********************************************************************/ 01304000
*                                                                  0888 01305000
*RFY R15 RSTD;                                                     0888 01306000
* /*REQSTORE CBID(DCLCP)RPH(PTRRPH)CLEAR(YES)SAVE(YES)*/           0889 01307000
*  DO;                                                             0889 01308000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)  */                         0890 01309000
*/* END OF ATBUILD */                                              0890 01310000
*                                                                  0890 01311000
* RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                          0890 01312000
*                                                                  0890 01313000
* RFY (GPR01P,GPR13P) RSTD;                                        0891 01314000
*          GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);      0892 01315000
*                                                                  0892 01316000
           STM GPR02P,GPR13P,RPHWORK(GPR01P)                            01317000
* RFY (GPR01P,GPR13P) UNRSTD;                                      0893 01318000
*                                                                  0893 01319000
* DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                    0894 01320000
*   GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                    0895 01321000
         L     GPR15P,ATCLCPTR                                     0895 01322000
* END; /*LISATCVT*/                                                0896 01323000
*          GPR02P=GPR15P->ATCBPDA | '80000000'X;                   0897 01324000
         L     GPR02P,ATCBPDA(,GPR15P)                             0897 01325000
         O     GPR02P,@CF01326                                     0897 01326000
*          DCL 1 FMZA0094 FIXED(31) STATIC LOCAL,                  0898 01327000
*              2 *        FIXED(8) INIT(184),                      0898 01328000
*              2 *        PTR(24) INIT(0);                         0898 01329000
*          GPR03F=FMZA0094;                                        0899 01330000
         L     GPR03F,FMZA0094                                     0899 01331000
*          GPR04F=5;                                               0900 01332000
         LA    GPR04F,5                                            0900 01333000
*          GPR15P=GPR15P->ATCSMRQ;                                 0901 01334000
         L     GPR15P,ATCSMRQ(,GPR15P)                             0901 01335000
*          DCL FMZL0094 BASED(GPR15P) LABEL VALUERANGE(*);         0902 01336000
*          CALL FMZL0094;                                          0903 01337000
*                                                                  0903 01338000
         BALR  @14,@15                                             0903 01339000
* RFY (GPR13P) RSTD;                                               0904 01340000
*          GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);      0905 01341000
*                                                                  0905 01342000
           LM GPR02P,GPR13P,RPHWORK(GPR01P)                             01343000
* RFY (GPR13P) UNRSTD;                                             0906 01344000
*                                                                  0906 01345000
* RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;                        0907 01346000
* END ;    /********* END OF REQSTORE EXPANSION **********/        0908 01347000
*IF R15 = RCTPWAIT THEN                                            0909 01348000
*                                                                  0909 01349000
         C     R15,@CF00038                                        0909 01350000
         BNE   @RF00909                                            0909 01351000
*/*  TPWAIT   */                                                   0910 01352000
*   DO; /* BEGIN TPWAIT GENERATION*/                               0910 01353000
*   RFY (GPR01P,GPR14P,GPR15P) RSTD;                               0911 01354000
*   RFY (GPR00P) RSTD;                                             0912 01355000
*   GEN (STM   GPR00P,GPR15P,RPHWORK(GPR01P))                      0913 01356000
*   REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);                      0913 01357000
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)                            01358000
*   RFY (GPR00P) UNRSTD;                                           0914 01359000
*   GPR15P=ADDR(LHAA0113);                                         0915 01360000
         LA    GPR15P,LHAA0113                                     0915 01361000
*   GPR14P=0;                                                      0916 01362000
         SLR   GPR14P,GPR14P                                       0916 01363000
*   GPR15P=GPR15P & '00FFFFFF'X;                                   0917 01364000
         N     GPR15P,@CF04362                                     0917 01365000
*   GPR15P=GPR15P | RPHWT1;                                        0918 01366000
         O     GPR15P,@CF01350                                     0918 01367000
*   CS (GPR14P,GPR15P,GPR01P->RPHRESMA);                           0919 01368000
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         0919 01369000
*   BC (7,LHAB0113);                                               0920 01370000
*                                                                  0920 01371000
         BC    7,LHAB0113                                          0920 01372000
*/* TPEXIT  NONE */                                                0921 01373000
*   DO;                                                            0921 01374000
*     RESPECIFY GPR15P RSTD;                                       0922 01375000
*                                                                  0922 01376000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         0923 01377000
*/* END OF ATBUILD */                                              0923 01378000
*                                                                  0923 01379000
*   DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                  0923 01380000
*     GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                  0924 01381000
         L     GPR15P,ATCLCPTR                                     0924 01382000
*   END; /*LISATCVT*/                                              0925 01383000
*     RESPECIFY GPR00F RSTD;                                       0926 01384000
*     GPR00F=0;     /*SET PARAMETER REGISTER TO 0*/                0927 01385000
         SLR   GPR00F,GPR00F                                       0927 01386000
*     GPR15P=GPR15P->ATCAP31;                                      0928 01387000
         L     GPR15P,ATCAP31(,GPR15P)                             0928 01388000
*     DCL FMZL0118 BASED(GPR15P) LABEL VALUERANGE(*);              0929 01389000
*     CALL FMZL0118;                                               0930 01390000
         BALR  @14,@15                                             0930 01391000
*     RESPECIFY (GPR00F,GPR15P) UNRSTD;                            0931 01392000
*   END; /***** END OF TPEXIT  *****/                              0932 01393000
*LHAB0113:;                                                        0933 01394000
LHAB0113 DS    0H                                                  0934 01395000
*   GPR01P->RPHRESMA = 0;                                          0934 01396000
         SLR   @09,@09                                             0934 01397000
         ST    @09,RPHRESMA(,GPR01P)                               0934 01398000
*   RFY (GPR00P) RSTD;                                             0935 01399000
*LHAA0113:;                                                        0936 01400000
LHAA0113 DS    0H                                                  0937 01401000
*   GEN (LM    GPR00P,GPR15P,RPHWORK(GPR01P))                      0937 01402000
*   REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);                      0937 01403000
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)                            01404000
*   RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;                      0938 01405000
*   END; /*****END OF TPWAIT *****/                                0939 01406000
*ELSE;                                                             0940 01407000
@RF00909 DS    0H                                                  0941 01408000
*RFY R15 UNRSTD;                                                   0941 01409000
*PTRLCPB=RPHSRPRM;                                                 0942 01410000
         L     PTRLCPB,RPHSRPRM(,PTRRPH)                           0942 01411000
*RFY ISTDCLCP BASED(PTRLCPB);                                      0943 01412000
*RFY ISTLCPB BASED (ADDR(DCLLCPB));                                0944 01413000
*CRRLCPB=ADDR(ISTDCLCP);                                           0945 01414000
         ST    PTRLCPB,CRRLCPB(,PTRCRR)                            0945 01415000
*RFY IFGRPL BASED(RPHWEA);                                         0946 01416000
*                                                                  0946 01417000
*                                                                  0946 01418000
*IF CRRRTNCD = ZERO THEN                                           0947 01419000
         CLI   CRRRTNCD(PTRCRR),0                                  0947 01420000
         BNE   @RF00947                                            0947 01421000
*  DO;                      /* DO - NO ERROR HAS OCCURRED */       0948 01422000
*    DCLRQTP=RPLREQ;                                               0949 01423000
         L     @15,RPHWEA(,PTRRPH)                                 0949 01424000
         MVC   DCLRQTP(1,PTRLCPB),RPLREQ(@15)                      0949 01425000
*    DCLRPLA=CRRARPL;                                              0950 01426000
         L     @15,CRRARPL(,PTRCRR)                                0950 01427000
         ST    @15,DCLRPLA(,PTRLCPB)                               0950 01428000
*    LCPTYPE=DCLTYPE;                                              0951 01429000
         MVI   LCPTYPE(PTRLCPB),X'12'                              0951 01430000
*    LCPLNGTH=LENGTH(ISTDCLCP);                                    0952 01431000
         MVI   LCPLNGTH(PTRLCPB),X'64'                             0952 01432000
*    LCPNXLCW=ADDR(LCPLCCW);                                       0953 01433000
         LA    @15,LCPLCCW(,PTRLCPB)                               0953 01434000
         ST    @15,LCPNXLCW(,PTRLCPB)                              0953 01435000
*    CRRCLCCW=ADDR(LCPLCCW);                                       0954 01436000
         ST    @15,CRRCLCCW(,PTRCRR)                               0954 01437000
*    IF DCLRQTP='1E'X &                                            0955 01438000
*       RPHMAJCB->ACDTYPE=ACDID THEN                               0955 01439000
         CLI   DCLRQTP(PTRLCPB),X'1E'                              0955 01440000
         BNE   @RF00955                                            0955 01441000
         L     @15,RPHMAJCB-1(,PTRRPH)                             0955 01442000
         LA    @15,0(,@15)                                         0955 01443000
         CLI   ACDTYPE(@15),X'0F'                                  0955 01444000
         BNE   @RF00955                                            0955 01445000
*       DO;                 /* DO - SOLICIT ALL            */      0956 01446000
*         DCLBNSP = ON;                                            0957 01447000
         OI    DCLBNSP(PTRLCPB),B'00000001'                        0957 01448000
*         IF CRRSW2 = OFF THEN                                     0958 01449000
         TM    CRRSW2(PTRCRR),B'00100000'                          0958 01450000
         BNZ   @RF00958                                            0958 01451000
*            DO;            /* DO - NOT 1ST SOLICIT ALL    */      0959 01452000
*              PTRDEB = RPHMAJCB;                                  0960 01453000
         LR    PTRDEB,@15                                          0960 01454000
*              RFY ISTACDEB BASED(PTRDEB);                         0961 01455000
*                                                                  0961 01456000
*/*VMDESET  ((15),ZERO)*/                                          0962 01457000
*               DO;                      /* INVOKE MODESET MACRO    */  01458000
*                 GEN;                                             0963 01459000
*                                                                  0963 01460000
         MODESET EXTKEY=ZERO,WORKREG=2                                  01461000
*               RFY (GPR15P) RSTD;                                 0964 01462000
*                 GPR15F=0;                                        0965 01463000
*                                                                  0965 01464000
         SLR   GPR15F,GPR15F                                       0965 01465000
*               RFY (GPR15P) UNRSTD;     /*PUT RETURN CODE IN RCREG*/   01466000
*               END;  /* VMDESET */                                0967 01467000
*                                                                  0967 01468000
*/*** START -TPLOCK (DEBLOCK)- ***/                                0968 01469000
*               DO;                                                0968 01470000
*               RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;   01471000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);     01472000
         STM GPR00P,GPR14P,RPHWORK(GPR01P)                              01473000
*        GPR02P = ADDR(ACDLOCK);        /*SET PARAM - LOCKWORD PTR*/    01474000
         LA    GPR02P,ACDLOCK(,PTRDEB)                             0971 01475000
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 0972 01476000
         L     GPR04P,RPHCRR(,GPR01P)                              0972 01477000
*        GPR00P = CRALMS05;             /*SET PARAM - LOCK LEVEL FLAG*/ 01478000
         LA    GPR00P,16                                           0973 01479000
*        GPR03P = ADDR(GPR04P->CRAL5PTR);                          0974 01480000
         LA    GPR03P,CRAL5PTR(,GPR04P)                            0974 01481000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  01482000
*        GPR15P=ATCLCPTR->ATCAP35;      /*ADDRESS OF LOCK ROUTINE*/     01483000
         L     @05,ATCLCPTR                                        0975 01484000
         L     GPR15P,ATCAP35(,@05)                                0975 01485000
*        DCL FMZL0131 BASED(GPR15P) LABEL VALUERANGE(*);           0976 01486000
*        CALL FMZL0131;                                            0977 01487000
         BALR  @14,@15                                             0977 01488000
*        GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P 01489000
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P, 01490000
*PR12P,GPR13P,GPR14P,GPR15P);                                      0978 01491000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               01492000
*               RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD; 01493000
*        END;                                                      0980 01494000
*/*** END -TPLOCK (DEBLOCK)- ***/                                  0981 01495000
*                    CRRDBLCK=ON;           /*DEB LOCKED     @DM12428*/ 01496000
         OI    CRRDBLCK(PTRCRR),B'00010000'                        0981 01497000
*              PTRFMCB = ACDFMCB;                                  0982 01498000
*                                                                  0982 01499000
         L     PTRFMCB,ACDFMCB(,PTRDEB)                            0982 01500000
*/*VMDESET  ((15),VTAM)*/                                          0983 01501000
*               DO;                      /* INVOKE MODESET MACRO    */  01502000
*                 GEN;                                             0984 01503000
*                                                                  0984 01504000
         MODESET EXTKEY=VTAM,WORKREG=2                                  01505000
*               RFY (GPR15P) RSTD;                                 0985 01506000
*                 GPR15F=0;                                        0986 01507000
*                                                                  0986 01508000
         SLR   @14,@14                                             0986 01509000
         LR    GPR15F,@14                                          0986 01510000
*               RFY (GPR15P) UNRSTD;     /*PUT RETURN CODE IN RCREG*/   01511000
*               END;  /* VMDESET */                                0988 01512000
*              RFY ISTFMCB BASED(PTRFMCB);                         0989 01513000
*              IF PTRFMCB^=ZERO THEN                               0990 01514000
         CR    PTRFMCB,@14                                         0990 01515000
         BE    @RF00990                                            0990 01516000
*                 CRRFMCB = ADDR(ISTFMCB);                         0991 01517000
         ST    PTRFMCB,CRRFMCB(,PTRCRR)                            0991 01518000
*              ELSE                                                0992 01519000
*                 DO;                /* DO - NO FMCB OFF ACDEB*/   0992 01520000
*                                                                  0992 01521000
         B     @RC00990                                            0992 01522000
@RF00990 DS    0H                                                  0993 01523000
*/*VMDESET  ((15),ZERO)*/                                          0993 01524000
*                    DO;                 /* INVOKE MODESET MACRO    */  01525000
*                      GEN;                                        0994 01526000
*                                                                  0994 01527000
         MODESET EXTKEY=ZERO,WORKREG=2                                  01528000
*                    RFY (GPR15P) RSTD;                            0995 01529000
*                      GPR15F=0;                                   0996 01530000
*                                                                  0996 01531000
         SLR   GPR15F,GPR15F                                       0996 01532000
*                    RFY (GPR15P) UNRSTD;/*PUT RETURN CODE IN RCREG*/   01533000
*                    END;  /* VMDESET */                           0998 01534000
*                                                                  0998 01535000
*/*** START -TPUNLOCK (DEBLOCK)- ***/                              0999 01536000
*                    DO;                                           0999 01537000
*                                                                  0999 01538000
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)  */                             1000 01539000
*/* END OF ATBUILD */                                              1000 01540000
*                    RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RS 01541000
*D;      GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);     01542000
         STM GPR00P,GPR15P,RPHWORK(GPR01P)                              01543000
*        GPR02P = ADDR(ACDLOCK);        /*SET PARAM - LOCKWORD PTR*/    01544000
         LA    GPR02P,ACDLOCK(,PTRDEB)                             1002 01545000
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 1003 01546000
         L     GPR04P,RPHCRR(,GPR01P)                              1003 01547000
*        GPR00P = CRALMS05;             /*SET PARAM - LOCK LEVEL FLAG*/ 01548000
         LA    GPR00P,16                                           1004 01549000
*        GPR03P = ADDR(GPR04P->CRAL5PTR);                          1005 01550000
         LA    GPR03P,CRAL5PTR(,GPR04P)                            1005 01551000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  01552000
*                                                                  1006 01553000
*                    DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */ 1006 01554000
*                      GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/ 1007 01555000
         L     GPR15P,ATCLCPTR                                     1007 01556000
*                    END; /*LISATCVT*/                             1008 01557000
*        GPR15P=GPR15P->ATCAP33;                                   1009 01558000
         L     GPR15P,ATCAP33(,GPR15P)                             1009 01559000
*        DCL FMZL0142 BASED(GPR15P) LABEL VALUERANGE(*);           1010 01560000
*        CALL FMZL0142;                                            1011 01561000
         BALR  @14,@15                                             1011 01562000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P 01563000
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P, 01564000
*PR12P,GPR13P,GPR14P,GPR15P);                                      1012 01565000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               01566000
*                    RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UN 01567000
*STD;    END;                                                      1013 01568000
*/*** END -TPUNLOCK (DEBLOCK)- ***/                                1015 01569000
*                  CRRDBLCK=OFF;          /* DEB UNLOCKED    @DM12428*/ 01570000
*                                                                  1015 01571000
         NI    CRRDBLCK(PTRCRR),B'11101111'                        1015 01572000
*/*VMDESET  ((15),VTAM)*/                                          1016 01573000
*                    DO;                 /* INVOKE MODESET MACRO    */  01574000
*                      GEN;                                        1017 01575000
*                                                                  1017 01576000
         MODESET EXTKEY=VTAM,WORKREG=2                                  01577000
*                    RFY (GPR15P) RSTD;                            1018 01578000
*                      GPR15F=0;                                   1019 01579000
*                                                                  1019 01580000
         SLR   GPR15F,GPR15F                                       1019 01581000
*                    RFY (GPR15P) UNRSTD;/*PUT RETURN CODE IN RCREG*/   01582000
*                    END;  /* VMDESET */                           1021 01583000
*                 END;               /* END - NO FMCB OFF ACDEB*/  1022 01584000
*             END;            /* END - NOT 1ST SOLICIT ALL PASS */ 1023 01585000
*           ELSE;                                                  1024 01586000
@RF00958 DS    0H                                                  1025 01587000
*         END;               /* END - SOLICIT ALL                */     01588000
*      ELSE                                                        1026 01589000
*         DO;                /* DO - NOT SOLICIT ALL           */  1026 01590000
         B     @RC00955                                            1026 01591000
@RF00955 DS    0H                                                  1027 01592000
*           PTRFMCB = RPHMAJCB;                                    1027 01593000
         L     PTRFMCB,RPHMAJCB-1(,PTRRPH)                         1027 01594000
         LA    PTRFMCB,0(,PTRFMCB)                                 1027 01595000
*           RFY ISTFMCB BASED(PTRFMCB);                            1028 01596000
*           RFY PTRDNCB RSTD;                                      1029 01597000
*           PTRDNCB=FMCDNCBA;                                      1030 01598000
         L     PTRDNCB,FMCDNCBA(,PTRFMCB)                          1030 01599000
*           RFY ISTDNCB BASED(PTRDNCB);                            1031 01600000
*           RFY ISTNCB BASED (ADDR(DNCNCB));                       1032 01601000
*           LCPSAF = FMCSAF;                                       1033 01602000
         MVC   LCPSAF(2,PTRLCPB),FMCSAF(PTRFMCB)                   1033 01603000
*           LCPDAF = NCBDAF;                                       1034 01604000
         MVC   LCPDAF(2,PTRLCPB),NCBDAF(PTRDNCB)                   1034 01605000
*           RFY PTRDNCB UNRSTD;                                    1035 01606000
*           RFY (ISTDNCB,ISTNCB);                                  1036 01607000
*           IF FMCFLGA1=ON THEN                                    1037 01608000
         TM    FMCFLGA1(PTRFMCB),B'01000000'                       1037 01609000
         BNO   @RF01037                                            1037 01610000
*              CRRSTSPR = ON;                                      1038 01611000
         OI    CRRSTSPR(PTRCRR),B'00100000'                        1038 01612000
*           ELSE CRRSTSPR = OFF;                                   1039 01613000
         B     @RC01037                                            1039 01614000
@RF01037 NI    CRRSTSPR(PTRCRR),B'11011111'                        1039 01615000
*/********************************************************************/ 01616000
*/*                                                                  */ 01617000
*/* SEGMENT NAME :  NESTCH1                                          */ 01618000
*/*                                                                  */ 01619000
*/* FUNCTION :  THIS SUBROUTINE PROCESSES LDOS BY MOVING THE LDO     */ 01620000
*/*              COMMAND INTO THE LCCW.  FOR READ COMMANDS IT ALSO   */ 01621000
*/*              CHECKS TO SEE WHETHER THERE IS DATA PRESENT AND     */ 01622000
*/*              WHETHER THERE IS AN OLDER RPL ON THE WAIT Q WHICH   */ 01623000
*/*             SHOULD BE HONORED FIRST.  IN THAT CASE THE PRESENT   */ 01624000
*/*             RPL IS QUEUED AND THE OLDEST RPL IS DEQUEUED         */ 01625000
*/* INPUT :ADDRESS OF RPL,LDO,CRR AND FMCB                           */ 01626000
*/*                                                                  */ 01627000
*/*                                                                  */ 01628000
*/* OUTPUT :  AN LCCW CONTAINING THE LDO COMMAND OR                  */ 01629000
*/*            A DEQUEUED RPL OR                                     */ 01630000
*/*            ERROR CODES IN THE CRR INDICATING AN INVALID          */ 01631000
*/*            CONDITION                                             */ 01632000
*/* SUBROUTINES CALLED :                                             */ 01633000
*/*                                                                  */ 01634000
*/* MACROS USED :  TPQUE  ,VMDESET                                   */ 01635000
*/*                                                                  */ 01636000
*/********************************************************************/ 01637000
*                                   /* RESTRICT POINTER REGISTERS    */ 01638000
*RFY (PTRRPH,PTRRPL,PTRLCPB,PTRLDO,PTRFMCB,PTRCRR) RSTD;           1040 01639000
@RC01037 DS    0H                                                  1041 01640000
*RFY ISTLDO BASED(PTRLDO);                                         1041 01641000
*RFY ISTLCCW BASED (ADDR(LCPLCCW));   /* ADDRESS THE LCCW           */  01642000
*IF DCLRQTP ^='22'X THEN                     /*@DM08463*/          1043 01643000
         CLI   DCLRQTP(PTRLCPB),X'22'                              1043 01644000
         BE    @RF01043                                            1043 01645000
* DO;                                 /* DO REQUEST NOT A SEND       */ 01646000
* IF DCLRQTP='13'X THEN               /* IF REQUEST WAS FOR A 'DO'   */ 01647000
         CLI   DCLRQTP(PTRLCPB),X'13'                              1045 01648000
         BNE   @RF01045                                            1045 01649000
*  DO;                                                             1046 01650000
*   CRRCLDO=RPLAREA;                  /* PUT LDO ADDRESS IN THE CRR  */ 01651000
         L     @02,RPHWEA(,PTRRPH)                                 1047 01652000
         L     @02,RPLAREA(,@02)                                   1047 01653000
         ST    @02,CRRCLDO(,PTRCRR)                                1047 01654000
*   PTRLDO=CRRCLDO;                   /* SET UP POINTER TO THE LDO   */ 01655000
*                                                                  1048 01656000
         LR    PTRLDO,@02                                          1048 01657000
*/*VMDESET  ((15),ZERO)*/                                          1049 01658000
*  DO;                                   /* INVOKE MODESET MACRO    */  01659000
*    GEN;                                                          1050 01660000
*                                                                  1050 01661000
         MODESET EXTKEY=ZERO,WORKREG=2                                  01662000
*  RFY (GPR15P) RSTD;                                              1051 01663000
*    GPR15F=0;                                                     1052 01664000
*                                                                  1052 01665000
         SLR   GPR15F,GPR15F                                       1052 01666000
*  RFY (GPR15P) UNRSTD;                  /*PUT RETURN CODE IN RCREG*/   01667000
*  END;  /* VMDESET */                                             1054 01668000
*   LCCWOP=LDOCMD;                    /* MOVE THE COMMAND TO THE LCCW*/ 01669000
*                                                                  1055 01670000
         MVC   LCCWOP+48(1,PTRLCPB),LDOCMD(PTRLDO)                 1055 01671000
*/*VMDESET  ((15),VTAM)*/                                          1056 01672000
*   DO;                                  /* INVOKE MODESET MACRO    */  01673000
*     GEN;                                                         1057 01674000
*                                                                  1057 01675000
         MODESET EXTKEY=VTAM,WORKREG=2                                  01676000
*   RFY (GPR15P) RSTD;                                             1058 01677000
*     GPR15F=0;                                                    1059 01678000
*                                                                  1059 01679000
         SLR   GPR15F,GPR15F                                       1059 01680000
*   RFY (GPR15P) UNRSTD;                 /*PUT RETURN CODE IN RCREG*/   01681000
*   END;  /* VMDESET */                                            1061 01682000
*   CRRFLDOS=ON;                     /* INDICATE 1ST LDO IN THE CRR */  01683000
         OI    CRRFLDOS(PTRCRR),B'01000000'                        1062 01684000
*  END;                               /* END REQUEST WAS A 'DO'     */  01685000
*ELSE;                                /* REQUEST WAS NOT A 'DO'     */  01686000
@RF01045 DS    0H                                                  1065 01687000
*  /*NESTCH2    */                    /*                            */  01688000
*/********************************************************************/ 01689000
*/*                                                                  */ 01690000
*/*SEGMENT NAME:NESTCH2                                              */ 01691000
*/*                                                                  */ 01692000
*/* INPUT:                                                           */ 01693000
*/*      PTRCRR   -> ISTDCCRR                                        */ 01694000
*/*      CRRCLDO  -> FIRST LDO IN LDO STRING                         */ 01695000
*/*                                                                  */ 01696000
*/* OUTPUT:                                                          */ 01697000
*/*      **NO NORMAL OUTPUT**                                        */ 01698000
*/*      CONTROL BLOCKS ARE ONLY CHANGED FOR ERROR SITUATIONS        */ 01699000
*/*                                                                  */ 01700000
*/* CALLS:                                                           */ 01701000
*/*      **NONE**                                                    */ 01702000
*/*                                                                  */ 01703000
*/* MACROS:                                                          */ 01704000
*/*      ?VALCHECK:                                                  */ 01705000
*/*            VALIDATE CORE STORAGE BLOCK                           */ 01706000
*/*                                                                  */ 01707000
*/********************************************************************/ 01708000
*                                   /* RESTRICT POINTER REGISTERS    */ 01709000
*RFY (PTRLDO,PTRRPH,PTRRPL,PTRLCPB,PTRFMCB,PTRCRR) RSTD;           1065 01710000
*IF DCLRQTP='1D'X THEN;              /* FIRST CHECK FOR A READ       */ 01711000
         CLI   DCLRQTP(PTRLCPB),X'1D'                              1066 01712000
         BE    @RT01066                                            1066 01713000
*ELSE                                                              1068 01714000
*  DO;                               /* REQUEST TYPE NOT A READ      */ 01715000
*    IF DCLRQTP='13'X THEN            /* CHECK FOR AN LDO           */  01716000
         CLI   DCLRQTP(PTRLCPB),X'13'                              1069 01717000
         BNE   @RF01069                                            1069 01718000
*       DO;                                                        1070 01719000
*         PTRLDO=CRRCLDO;            /* ADDRESS THE LDO            */   01720000
         L     PTRLDO,CRRCLDO(,PTRCRR)                             1071 01721000
*         RFY ISTLDO BASED(PTRLDO); /*  LOGICAL DEVICE ORDER  */   1072 01722000
*                                                                  1072 01723000
*/*VMDESET  ((15),ZERO)*/                                          1073 01724000
*         DO;                            /* INVOKE MODESET MACRO    */  01725000
*           GEN;                                                   1074 01726000
*                                                                  1074 01727000
         MODESET EXTKEY=ZERO,WORKREG=2                                  01728000
*         RFY (GPR15P) RSTD;                                       1075 01729000
*           GPR15F=0;                                              1076 01730000
*                                                                  1076 01731000
         SLR   GPR15F,GPR15F                                       1076 01732000
*         RFY (GPR15P) UNRSTD;           /*PUT RETURN CODE IN RCREG*/   01733000
*         END;  /* VMDESET */         /* KEY ZERO           @VS40556*/  01734000
*         IF LDOCMD = LDOREAD THEN; /* IS OPERATION = READ?          */ 01735000
         CLI   LDOCMD(PTRLDO),X'02'                                1079 01736000
         BE    @RT01079                                            1079 01737000
*                                   /* YES- FALL THROUGH TO EXIT     */ 01738000
*         ELSE                      /* NO-- CHECK FOR JUMP           */ 01739000
*           DO;                                                    1081 01740000
*             IF LDOCMD = LDOJUMP THEN  /* IS OPERATION = JUMP?      */ 01741000
         CLI   LDOCMD(PTRLDO),X'08'                                1082 01742000
         BNE   @RF01082                                            1082 01743000
*                DO;                /* YES- CHECK JUMP TO ADDRESS    */ 01744000
*                  PTRLDO=LDOADDR;   /* ADDRESS NEXT LDO             */ 01745000
         L     PTRLDO,LDOADDR(,PTRLDO)                             1084 01746000
*                  LCCWOP=LDOCMD;   /* PUT CMD CODE IN LCCW          */ 01747000
         MVC   LCCWOP+48(1,PTRLCPB),LDOCMD(PTRLDO)                 1085 01748000
*                  IF LDOCMD = LDOREAD THEN; /* IS OP CODE READ?     */ 01749000
         CLI   LDOCMD(PTRLDO),X'02'                                1086 01750000
         BE    @RT01086                                            1086 01751000
*                                   /* YES- FALL THROUGH TO EXIT     */ 01752000
*                  ELSE CRRSW0 = ON;  /* NO-- SET ERROR SWITCH      */  01753000
         OI    CRRSW0(PTRCRR),B'10000000'                          1088 01754000
*                END;                                              1089 01755000
*             ELSE CRRSW0=ON;        /* NOT JUMP LDO              */    01756000
*                                                                  1090 01757000
         B     @RC01082                                            1090 01758000
@RF01082 OI    CRRSW0(PTRCRR),B'10000000'                          1090 01759000
*             CRRCLDO=PTRLDO;         /* UPDATE POINTER IN CRR      */  01760000
@RC01082 ST    PTRLDO,CRRCLDO(,PTRCRR)                             1091 01761000
*          END;                       /*END COMMAND NOT READ LDO    */  01762000
*                                                                  1092 01763000
*/*VMDESET  ((15),VTAM)*/                                          1093 01764000
*          DO;                           /* INVOKE MODESET MACRO    */  01765000
@RT01079 DS    0H                                                  1094 01766000
*            GEN;                                                  1094 01767000
*                                                                  1094 01768000
         MODESET EXTKEY=VTAM,WORKREG=2                                  01769000
*          RFY (GPR15P) RSTD;                                      1095 01770000
*            GPR15F=0;                                             1096 01771000
*                                                                  1096 01772000
         SLR   GPR15F,GPR15F                                       1096 01773000
*          RFY (GPR15P) UNRSTD;          /*PUT RETURN CODE IN RCREG*/   01774000
*          END;  /* VMDESET */        /* VTAM KEY           @VS40556*/  01775000
*        END;                         /* END REQUEST TYPE AN LDO    */  01776000
*     ELSE CRRSW0 = ON;            /* NOT LDO ADDRESS VALID        */   01777000
         B     @RC01069                                            1100 01778000
@RF01069 OI    CRRSW0(PTRCRR),B'10000000'                          1100 01779000
*  END;                               /* END REQUEST TYPE NOT A READ */ 01780000
@RC01069 DS    0H                                                  1102 01781000
*RFY PTRLDO UNRSTD;                 /* NO LONGER REQUIRED            */ 01782000
@RT01066 DS    0H                                                  1103 01783000
*                                       /* DON'T UNLOCK FMCB @XM11207*/ 01784000
* END;                                 /*END SEND MACRO @DM12550*/ 1103 01785000
*ELSE;                                                             1104 01786000
*                                                                  1104 01787000
*                                                                  1104 01788000
@RF01043 DS    0H                                                  1105 01789000
*IF FMCFLGA5=ON &                 /* BUFFER THRESHOLD EXCEEDED ? */     01790000
*  CRRSW0=ON THEN                    /*AND MACRO TYPE NOT A READ   */   01791000
         TM    FMCFLGA5(PTRFMCB),B'00000100'                       1105 01792000
         BNO   @RF01105                                            1105 01793000
         TM    CRRSW0(PTRCRR),B'10000000'                          1105 01794000
         BNO   @RF01105                                            1105 01795000
*  DO;                                                             1106 01796000
*   CRRRTNCD=CRRLOGIC;                                             1107 01797000
         MVI   CRRRTNCD(PTRCRR),X'08'                              1107 01798000
*   CRRFDB2=CRRBUFTE;                                              1108 01799000
         MVI   CRRFDB2(PTRCRR),X'0F'                               1108 01800000
*  END;                                                            1109 01801000
*ELSE;                                                             1110 01802000
*                                                                  1110 01803000
*                                                                  1110 01804000
@RF01105 DS    0H                                                  1111 01805000
*/* IF THE DEVICE IS OFFLINE OR DISCONNECTED AND NO DATA IS QUEUED,     01806000
*   THE ERROR CODES ARE SET.                                         */ 01807000
*                                                                  1111 01808000
*IF FMCDEVOF= ON |                                                 1111 01809000
*  FMCDEDSC = ON THEN                                              1111 01810000
         TM    FMCDEVOF(PTRFMCB),B'00011000'                       1111 01811000
         BZ    @RF01111                                            1111 01812000
*  DO;                                                             1112 01813000
*   IF FMCFBA=ZERO |                                               1113 01814000
*      FMCFBA=GATE THEN                                            1113 01815000
         L     @15,FMCFBA(,PTRFMCB)                                1113 01816000
         LTR   @15,@15                                             1113 01817000
         BZ    @RT01113                                            1113 01818000
         CL    @15,@CF01326                                        1113 01819000
         BNE   @RF01113                                            1113 01820000
@RT01113 DS    0H                                                  1114 01821000
*      CRRSW0=ON;                                                  1114 01822000
         OI    CRRSW0(PTRCRR),B'10000000'                          1114 01823000
*   ELSE;                                                          1115 01824000
@RF01113 DS    0H                                                  1116 01825000
*   IF CRRSW0=ON THEN                                              1116 01826000
         TM    CRRSW0(PTRCRR),B'10000000'                          1116 01827000
         BNO   @RF01116                                            1116 01828000
*      DO;                                                         1117 01829000
*       CRRRTNCD=CRRPURGE;                                  /*@DM09502* 01830000
         MVI   CRRRTNCD(PTRCRR),X'1C'                              1118 01831000
*       CRRFDB2=CRRDEVOF;                /* DEVICE OFFLINE   @XM9224K*/ 01832000
         MVI   CRRFDB2(PTRCRR),X'07'                               1119 01833000
*      END;                                                        1120 01834000
*   ELSE;                                                          1121 01835000
@RF01116 DS    0H                                                  1122 01836000
*  END;                                                            1122 01837000
*ELSE;                                                             1123 01838000
@RF01111 DS    0H                                                  1124 01839000
*        END;           /* END - NOT SOLICIT ALL        */         1124 01840000
*    END;                /* END - NO ERROR HAS OCCURRED  */        1125 01841000
*ELSE;                                                             1126 01842000
@RF00947 DS    0H                                                  1127 01843000
*  END;                                                            1127 01844000
*                ELSE;                                             1128 01845000
@RF00886 DS    0H                                                  1129 01846000
*          IF RPHMAJCB->ACDTYPE=ACDID THEN                         1129 01847000
@RC00886 DS    0H                                                  1129 01848000
@RF00885 L     @15,RPHMAJCB-1(,PTRRPH)                             1129 01849000
         LA    @15,0(,@15)                                         1129 01850000
         CLI   ACDTYPE(@15),X'0F'                                  1129 01851000
         BNE   @RF01129                                            1129 01852000
*            DO;                    /* DO - MJR NODE CB IS ACDEB */     01853000
*              GEN REFS(R14,R12,CRRSAVE1) SETS(CRRSAVE1)    /*@DM09295* 01854000
*              (STM  R14,R12,CRRSAVE1+12(R13));  /* SAVE REGS @DM09295* 01855000
         STM  R14,R12,CRRSAVE1+12(R13)                                  01856000
*              RFY ISTATCVT BASED (CRRATCVT);                      1132 01857000
*              CALL ATCNESAL;                                      1133 01858000
         L     @14,CRRATCVT(,PTRCRR)                               1133 01859000
         L     @15,ATCNESAL(,@14)                                  1133 01860000
         BALR  @14,@15                                             1133 01861000
*              GEN REFS(CRRSAVE1,R13) SETS(R14,R12)         /*@DM09295* 01862000
*              (LM R14,R12,CRRSAVE1+12(R13));               /*@DM09295* 01863000
         LM R14,R12,CRRSAVE1+12(R13)                                    01864000
*                                       /* PUT DVT ENTRY ADDR IN RPH */ 01865000
*              RPHDVTA=ADDR(ATCNERFN);                      /*@DM08928* 01866000
         L     @15,CRRATCVT(,PTRCRR)                               1135 01867000
         LA    @15,ATCNERFN(,@15)                                  1135 01868000
         ST    @15,RPHDVTA(,PTRRPH)                                1135 01869000
*            END;                  /* END - MJR NODE CB IS ACDEB */     01870000
*                                                                  1136 01871000
*                                                                  1136 01872000
*          ELSE DO;                /*DO - MJR NODE CB IS FMCB  */  1137 01873000
         B     @RC01129                                            1137 01874000
@RF01129 DS    0H                                                  1138 01875000
*                 CRRFMCB=RPHMAJCB;                                1138 01876000
         L     @15,RPHMAJCB-1(,PTRRPH)                             1138 01877000
         LA    @15,0(,@15)                                         1138 01878000
         ST    @15,CRRFMCB(,PTRCRR)                                1138 01879000
*                 IF CRRRTNCD=ZERO THEN                            1139 01880000
         CLI   CRRRTNCD(PTRCRR),0                                  1139 01881000
         BNE   @RF01139                                            1139 01882000
*                    DO;              /* DO -SET UP DVT           */    01883000
*                      ADDRDVT=ADDR(SIDS(RPLREQ-'11'X+1));         1141 01884000
         L     @15,RPHWEA(,PTRRPH)                                 1141 01885000
         SLR   ADDRDVT,ADDRDVT                                     1141 01886000
         IC    ADDRDVT,RPLREQ(,@15)                                1141 01887000
         SLA   ADDRDVT,3                                           1141 01888000
         LR    @15,ADDRDVT                                         1141 01889000
         LA    ADDRDVT,SIDS-136(@15)                               1141 01890000
*                      CRRSW6=ON;                                  1142 01891000
         OI    CRRSW6(PTRCRR),B'00000010'                          1142 01892000
*                    END;             /* END SET UP DVT    */      1143 01893000
*                 ELSE;                                            1144 01894000
@RF01139 DS    0H                                                  1145 01895000
*                END;       /* END MJR NODE CB IS FMCB  */         1145 01896000
*            END;                     /*END - NOT RCV ANY OR READ ANY * 01897000
*          END;                      /* END - NO TPDVTS             */  01898000
*         ELSE;                                                    1148 01899000
@RF00880 DS    0H                                                  1149 01900000
*       END;                        /* END - REQUEST TYPE VALID     */  01901000
*      END;                         /* END - NOT TPEXIT             */  01902000
*     ELSE;                                                        1151 01903000
@RF00827 DS    0H                                                  1152 01904000
*RFY R14 RSTD;                                                     1152 01905000
@RC00827 DS    0H                                                  1153 01906000
*R14=CRRRTN9;                                                      1153 01907000
         L     R14,CRRRTN9(,PTRCRR)                                1153 01908000
*RFY R14 UNRSTD;                                                   1154 01909000
*RETURN;                                                           1155 01910000
@EL00002 DS    0H                                                  1155 01911000
@EF00002 DS    0H                                                  1155 01912000
@ER00002 BR    @14                                                 1155 01913000
*END REQUEST;                                                      1156 01914000
*                                                                  1157 01915000
*UNLOCK: PROC OPTIONS ( NOPARMREG,NOSAVE,NOSAVEAREA );             1157 01916000
UNLOCK   DS    0H                                                  1158 01917000
*/********************************************************************/ 01918000
*/*                                                                  */ 01919000
*/* ROUTINE NAME : UNLOCK                                            */ 01920000
*/*                                                                  */ 01921000
*/* FUNCTION : TO UNLOCK THE FMCB                                    */ 01922000
*/*                                                                  */ 01923000
*/* INPUT : NONE                                                     */ 01924000
*/*                                                                  */ 01925000
*/* OUTPUT :CRRFMCLK TURNED OFF                                      */ 01926000
*/*                                                                  */ 01927000
*/* SUBROUTINES CALLED : NONE                                        */ 01928000
*/*                                                                  */ 01929000
*/* MACROS USED : TPUNLOCK                                           */ 01930000
*/*                                                                  */ 01931000
*/********************************************************************/ 01932000
*                                                                  1158 01933000
*RFY R14 RSTD;                                                     1158 01934000
*CRRRTN6=R14;                                                      1159 01935000
         ST    R14,CRRRTN6(,PTRCRR)                                1159 01936000
*RFY R14 UNRSTD;                                                   1160 01937000
* IF CRRFMCLK=ON THEN /*LOCKING CHECK   @D33SKXW*/                 1161 01938000
         TM    CRRFMCLK(PTRCRR),B'10000000'                        1161 01939000
         BNO   @RF01161                                            1161 01940000
*    DO;                                                           1162 01941000
*     CRRFMCLK=OFF;                                                1163 01942000
*                                                                  1163 01943000
*                                                                  1163 01944000
*                                                                  1163 01945000
         NI    CRRFMCLK(PTRCRR),B'01111111'                        1163 01946000
*/*** START -TPUNLOCK (CTLLOCK)- ***/                              1164 01947000
*       DO;                                                        1164 01948000
*                                                                  1164 01949000
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)  */                             1165 01950000
*/* END OF ATBUILD */                                              1165 01951000
*                                                                  1165 01952000
*       RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;      1165 01953000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);     01954000
         STM GPR00P,GPR15P,RPHWORK(GPR01P)                              01955000
*        GPR02P = ADDR(FMCDCLOK);       /*SET PARAM - LOCKWORD PTR*/    01956000
         LA    GPR02P,FMCDCLOK(,PTRFMCB)                           1167 01957000
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 1168 01958000
         L     GPR04P,RPHCRR(,GPR01P)                              1168 01959000
*        GPR00P = CRALMS08;             /*SET PARAM - LOCK LEVEL FLAG*/ 01960000
         LA    GPR00P,128                                          1169 01961000
*        GPR03P = ADDR(GPR04P->CRAL8PTR);                          1170 01962000
         LA    GPR03P,CRAL8PTR(,GPR04P)                            1170 01963000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  01964000
*                                                                  1171 01965000
*       DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */              1171 01966000
*         GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/              1172 01967000
         L     GPR15P,ATCLCPTR                                     1172 01968000
*       END; /*LISATCVT*/                                          1173 01969000
*        GPR15P=GPR15P->ATCAP33;                                   1174 01970000
         L     GPR15P,ATCAP33(,GPR15P)                             1174 01971000
*        DCL FMZL0167 BASED(GPR15P) LABEL VALUERANGE(*);           1175 01972000
*        CALL FMZL0167;                                            1176 01973000
         BALR  @14,@15                                             1176 01974000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P 01975000
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P, 01976000
*PR12P,GPR13P,GPR14P,GPR15P);                                      1177 01977000
*                                                                  1177 01978000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               01979000
*       RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;    1178 01980000
*        END;                                                      1179 01981000
*/*** END -TPUNLOCK (CTLLOCK)- ***/                                1180 01982000
*    END;                                                          1180 01983000
*RFY R14 RSTD;                                                     1181 01984000
@RF01161 DS    0H                                                  1182 01985000
*R14=CRRRTN6;                                                      1182 01986000
         L     R14,CRRRTN6(,PTRCRR)                                1182 01987000
*RFY R14 UNRSTD;                                                   1183 01988000
*RETURN;                                                           1184 01989000
@EL00003 DS    0H                                                  1184 01990000
@EF00003 DS    0H                                                  1184 01991000
@ER00003 BR    @14                                                 1184 01992000
*END UNLOCK;                                                       1185 01993000
*                                                                  1185 01994000
@PB00003 DS    0H                                                  1185 01995000
*/* TPEPILOG   */                                                  1186 01996000
* GEN (PRINT OFF);                                                 1186 01997000
*                                                                  1186 01998000
         PRINT OFF                                                      01999000
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    1187 02000000
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           1187 02001000
*        2  * CHAR(4),                 /* SPACE                       * 02002000
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               * 02003000
*           3 WKEFLAGS BIT(8),         /* FLAGS                       * 02004000
*             4 WKEGATE  BIT(1),       /* GATE BIT                    * 02005000
*             4 *        BIT(7),       /* RESERVED                    * 02006000
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 * 02007000
* GEN (PRINT ON);                                                  1188 02008000
         PRINT ON                                                       02009000
*/* END OF TPEPILOG */                                             1189 02010000
*END ISTDCC00                       /* END OF PROCEDURES             */ 02011000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 02012000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                        * 02013000
*/*%INCLUDE SYSLIB  (IFGRPLVT)                                        * 02014000
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                        * 02015000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 02016000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        * 02017000
*;                                                                 1189 02018000
@DATA    DS    0H                                                       02019000
@CH04502 DC    H'332'                                                   02020000
@DATD    DSECT                                                          02021000
         DS    0F                                                       02022000
ISTDCC00 CSECT                                                          02023000
         DS    0F                                                       02024000
@CF00038 DC    F'8'                                                     02025000
@CF01324 DC    XL4'7FFFFFFF'                                            02026000
@CF01326 DC    XL4'80000000'                                            02027000
@CF01350 DC    XL4'08000000'                                            02028000
@CF04362 DC    XL4'00FFFFFF'                                            02029000
@DATD    DSECT                                                          02030000
         DS    0D                                                       02031000
CVTPTR   DS    A                                                        02032000
LCPBPTR  DS    A                                                        02033000
DNCBPTR  DS    A                                                        02034000
FMCBPTR  DS    A                                                        02035000
FSBPTR   DS    A                                                        02036000
WKEPTR   DS    A                                                        02037000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02038000
@ENDDATD EQU   *                                                        02039000
ISTDCC00 CSECT                                                          02040000
         DS    0F                                                       02041000
@SIZDATD DC    AL1(0)                                                   02042000
         DC    AL3(@ENDDATD-@DATD)                                      02043000
         DS    0D                                                       02044000
FMZA0094 DS    FL4                                                      02045000
         ORG   FMZA0094                                                 02046000
@NM00100 DC    AL1(184)                                                 02047000
@NM00101 DC    AL3(0)                                                   02048000
         ORG   FMZA0094+4                                               02049000
@CC03734 DC    C'RECORD  '                                              02050000
DVTPURGE DC    CL8'IDPURGEO'                                            02051000
DVTPRMPT DC    CL8'IDPRESTO'                                            02052000
DVTCLEAR DC    CL8'IRCLROUT'                                            02053000
SIDS     DC    CL8'IDWRITE '                                            02054000
         DC    CL8'IDRESET '                                            02055000
         DC    CL8'IDDO    '                                            02056000
         DC    CL8'ID14    '                                            02057000
         DC    CL8'ID15    '                                            02058000
         DC    CL8'ID16    '                                            02059000
         DC    CL8'ID17    '                                            02060000
         DC    CL8'ID18    '                                            02061000
         DC    CL8'ID19    '                                            02062000
         DC    CL8'ID1A    '                                            02063000
         DC    CL8'ID1B    '                                            02064000
         DC    CL8'ID1C    '                                            02065000
         DC    CL8'IDREAD  '                                            02066000
         DC    CL8'IDSOLICT'                                            02067000
         DC    CL8'ID1F    '                                            02068000
         DC    CL8'ID20    '                                            02069000
         DC    CL8'ID21    '                                            02070000
         DC    CL8'IRSNDOUT'                                            02071000
         DC    CL8'IRRCVOUT'                                            02072000
         DC    CL8'IRRSTOUT'                                            02073000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02074000
@01      EQU   01                                                       02075000
@02      EQU   02                                                       02076000
@03      EQU   03                                                       02077000
@04      EQU   04                                                       02078000
@05      EQU   05                                                       02079000
@06      EQU   06                                                       02080000
@07      EQU   07                                                       02081000
@08      EQU   08                                                       02082000
@09      EQU   09                                                       02083000
@10      EQU   10                                                       02084000
@11      EQU   11                                                       02085000
@12      EQU   12                                                       02086000
@13      EQU   13                                                       02087000
@14      EQU   14                                                       02088000
@15      EQU   15                                                       02089000
RPHPTR   EQU   @01                                                      02090000
GPR00F   EQU   @00                                                      02091000
GPR00P   EQU   @00                                                      02092000
GPR01P   EQU   @01                                                      02093000
GPR02P   EQU   @02                                                      02094000
GPR03F   EQU   @03                                                      02095000
GPR03P   EQU   @03                                                      02096000
GPR04F   EQU   @04                                                      02097000
GPR04P   EQU   @04                                                      02098000
GPR05P   EQU   @05                                                      02099000
GPR06P   EQU   @06                                                      02100000
GPR07P   EQU   @07                                                      02101000
GPR08P   EQU   @08                                                      02102000
GPR09P   EQU   @09                                                      02103000
GPR10P   EQU   @10                                                      02104000
GPR11P   EQU   @11                                                      02105000
GPR12P   EQU   @12                                                      02106000
GPR13P   EQU   @13                                                      02107000
GPR14P   EQU   @14                                                      02108000
GPR15F   EQU   @15                                                      02109000
GPR15P   EQU   @15                                                      02110000
ADDRDVT  EQU   @00                                                      02111000
PTRRPH   EQU   @01                                                      02112000
PTRRPL   EQU   @06                                                      02113000
PTRLCPB  EQU   @07                                                      02114000
PTRFMCB  EQU   @11                                                      02115000
PTRDEB   EQU   @10                                                      02116000
PTRDNCB  EQU   @03                                                      02117000
PTRLDO   EQU   @03                                                      02118000
PTRCRR   EQU   @13                                                      02119000
R02      EQU   @02                                                      02120000
R06      EQU   @06                                                      02121000
R12      EQU   @12                                                      02122000
R13      EQU   @13                                                      02123000
R14      EQU   @14                                                      02124000
R15      EQU   @15                                                      02125000
GPR01F   EQU   @01                                                      02126000
GPR02F   EQU   @02                                                      02127000
GPR05F   EQU   @05                                                      02128000
GPR06F   EQU   @06                                                      02129000
GPR07F   EQU   @07                                                      02130000
GPR08F   EQU   @08                                                      02131000
GPR09F   EQU   @09                                                      02132000
GPR10F   EQU   @10                                                      02133000
GPR11F   EQU   @11                                                      02134000
GPR12F   EQU   @12                                                      02135000
GPR13F   EQU   @13                                                      02136000
GPR14F   EQU   @14                                                      02137000
NEWVALUE EQU   @09                                                      02138000
OLDVALUE EQU   @08                                                      02139000
R00      EQU   @00                                                      02140000
R01      EQU   @01                                                      02141000
R03      EQU   @03                                                      02142000
R04      EQU   @04                                                      02143000
R05      EQU   @05                                                      02144000
R07      EQU   @07                                                      02145000
R08      EQU   @08                                                      02146000
R09      EQU   @09                                                      02147000
R10      EQU   @10                                                      02148000
R11      EQU   @11                                                      02149000
WORKREG  EQU   @03                                                      02150000
PSA      EQU   0                                                        02151000
FLCRNPSW EQU   PSA                                                      02152000
FLCROPSW EQU   PSA+8                                                    02153000
FLCICCW2 EQU   PSA+16                                                   02154000
PSAEEPSW EQU   PSA+132                                                  02155000
PSAESPSW EQU   PSA+136                                                  02156000
FLCSVILC EQU   PSAESPSW+1                                               02157000
PSAEPPSW EQU   PSA+140                                                  02158000
FLCPIILC EQU   PSAEPPSW+1                                               02159000
FLCPICOD EQU   PSAEPPSW+2                                               02160000
PSAPICOD EQU   FLCPICOD+1                                               02161000
FLCTEA   EQU   PSAEPPSW+4                                               02162000
FLCPER   EQU   PSA+152                                                  02163000
FLCMCLA  EQU   PSA+168                                                  02164000
FLCIOEL  EQU   FLCMCLA+4                                                02165000
FLCIOA   EQU   FLCMCLA+16                                               02166000
FLCFSA   EQU   FLCMCLA+80                                               02167000
PSASUPER EQU   PSA+552                                                  02168000
PSASUP1  EQU   PSASUPER                                                 02169000
PSASUP2  EQU   PSASUPER+1                                               02170000
PSASUP3  EQU   PSASUPER+2                                               02171000
PSASUP4  EQU   PSASUPER+3                                               02172000
PSACLHT  EQU   PSA+640                                                  02173000
PSALKSA  EQU   PSA+696                                                  02174000
PSAHLHI  EQU   PSA+760                                                  02175000
PSADSSFL EQU   PSA+836                                                  02176000
PSADSSF1 EQU   PSADSSFL                                                 02177000
PSADSSF3 EQU   PSADSSFL+2                                               02178000
PSADSSF4 EQU   PSADSSFL+3                                               02179000
PSARSVT  EQU   PSA+896                                                  02180000
ATCLCPTR EQU   1032                                                     02181000
IFGRPL   EQU   0                                                        02182000
RPLCOMN  EQU   IFGRPL                                                   02183000
RPLIDWD  EQU   RPLCOMN                                                  02184000
RPLID    EQU   RPLIDWD                                                  02185000
RPLREQ   EQU   RPLIDWD+2                                                02186000
RPLLEN   EQU   RPLIDWD+3                                                02187000
RPLPLHPT EQU   RPLCOMN+4                                                02188000
RPLECB   EQU   RPLCOMN+8                                                02189000
RPLFDBWD EQU   RPLCOMN+12                                               02190000
RPLFDBK  EQU   RPLFDBWD+1                                               02191000
RPLRTNCD EQU   RPLFDBK                                                  02192000
RPLCNDCD EQU   RPLFDBK+1                                                02193000
RPLCMPON EQU   RPLCNDCD                                                 02194000
RPLFDB2  EQU   RPLCMPON                                                 02195000
RPLERRCD EQU   RPLCNDCD+1                                               02196000
RPLFDB3  EQU   RPLERRCD                                                 02197000
RPLKEYLE EQU   RPLCOMN+16                                               02198000
RPLAREA  EQU   RPLCOMN+32                                               02199000
RPLARG   EQU   RPLCOMN+36                                               02200000
RPLOPTCD EQU   RPLCOMN+40                                               02201000
RPLOPT1  EQU   RPLOPTCD                                                 02202000
RPLECBSW EQU   RPLOPT1                                                  02203000
RPLOPT2  EQU   RPLOPTCD+1                                               02204000
RPLADR   EQU   RPLOPT2                                                  02205000
RPLOPT3  EQU   RPLOPTCD+2                                               02206000
RPLOPT4  EQU   RPLOPTCD+3                                               02207000
RPLNXTRP EQU   RPLCOMN+44                                               02208000
RPLOPTC2 EQU   RPLCOMN+56                                               02209000
RPLOPT5  EQU   RPLOPTC2                                                 02210000
RPLWRTYP EQU   RPLOPT5                                                  02211000
RPLOPT6  EQU   RPLOPTC2+1                                               02212000
RPLUNTYP EQU   RPLOPT6                                                  02213000
RPLOPT7  EQU   RPLOPTC2+2                                               02214000
RPLCNOPT EQU   RPLOPT7                                                  02215000
RPLOPT8  EQU   RPLOPTC2+3                                               02216000
RPLRBAR  EQU   RPLCOMN+60                                               02217000
RPLAIXID EQU   RPLRBAR+2                                                02218000
RPLEXTDS EQU   RPLCOMN+68                                               02219000
RPLEXTD1 EQU   RPLEXTDS                                                 02220000
RPLVTEXT EQU   IFGRPL+76                                                02221000
RPLFDBK2 EQU   RPLVTEXT+12                                              02222000
RPLSSNSI EQU   RPLFDBK2                                                 02223000
RPLDSB   EQU   RPLSSNSI                                                 02224000
RPLDSB1  EQU   RPLDSB                                                   02225000
RPLSSEI  EQU   RPLDSB1                                                  02226000
RPLDSB2  EQU   RPLDSB+1                                                 02227000
RPLUSNSI EQU   RPLFDBK2+2                                               02228000
RPLOPTC3 EQU   RPLVTEXT+20                                              02229000
RPLOPT9  EQU   RPLOPTC3                                                 02230000
RPLOPT10 EQU   RPLOPTC3+1                                               02231000
RPLOPT11 EQU   RPLOPTC3+2                                               02232000
RPLOPT12 EQU   RPLOPTC3+3                                               02233000
RPLOSENS EQU   RPLVTEXT+24                                              02234000
RPLSSNSO EQU   RPLOSENS                                                 02235000
RPLSSEO  EQU   RPLSSNSO                                                 02236000
RPLOF16  EQU   0                                                        02237000
RPLRH3   EQU   RPLOF16                                                  02238000
RPLSRTYP EQU   RPLOF16+1                                                02239000
RPLSTYPE EQU   RPLSRTYP                                                 02240000
RPLRTYPE EQU   RPLSRTYP                                                 02241000
RPLRRESP EQU   RPLRTYPE                                                 02242000
RPLNFSYN EQU   RPLRTYPE                                                 02243000
RPLDFASY EQU   RPLRTYPE                                                 02244000
RPLCHN   EQU   RPLOF16+2                                                02245000
RPLVTFL1 EQU   RPLOF16+3                                                02246000
RPLVTFL2 EQU   RPLOF16+4                                                02247000
RPLPOSTV EQU   RPLVTFL2                                                 02248000
RPLRESP  EQU   RPLVTFL2                                                 02249000
RPLCNTRL EQU   RPLOF16+5                                                02250000
RPLCNTDF EQU   RPLCNTRL                                                 02251000
RPLCNTDC EQU   RPLCNTRL+1                                               02252000
RPLCNTSC EQU   RPLCNTRL+2                                               02253000
RPLOF60  EQU   0                                                        02254000
RPLOBSQ  EQU   RPLOF60+4                                                02255000
RPLIBSQ  EQU   RPLOF60+5                                                02256000
CVTMAP   EQU   0                                                        02257000
CVTDAR   EQU   CVTMAP+72                                                02258000
CVTFLGS1 EQU   CVTDAR                                                   02259000
CVTDCB   EQU   CVTMAP+116                                               02260000
CVTIERLC EQU   CVTMAP+144                                               02261000
CVTOPTA  EQU   CVTMAP+182                                               02262000
CVTOPTB  EQU   CVTMAP+183                                               02263000
CVTGTF   EQU   CVTMAP+236                                               02264000
CVTGTFST EQU   CVTGTF                                                   02265000
CVTGTFS  EQU   CVTGTFST                                                 02266000
CVTSTATE EQU   CVTGTFST                                                 02267000
CVTTMODE EQU   CVTGTFST                                                 02268000
CVTFORM  EQU   CVTGTFST                                                 02269000
CVTAQAVT EQU   CVTMAP+240                                               02270000
CVTTCMFG EQU   CVTAQAVT                                                 02271000
CVTVOLM2 EQU   CVTMAP+244                                               02272000
CVTTATA  EQU   CVTVOLM2                                                 02273000
CVTTSKS  EQU   CVTTATA                                                  02274000
CVTVOLF2 EQU   CVTTSKS                                                  02275000
CVTTAT   EQU   CVTTATA+1                                                02276000
CVTATER  EQU   CVTMAP+248                                               02277000
CVTEXT1  EQU   CVTMAP+252                                               02278000
CVTPURG  EQU   CVTMAP+260                                               02279000
CVTQMSG  EQU   CVTMAP+268                                               02280000
CVTDMSR  EQU   CVTMAP+272                                               02281000
CVTERPV  EQU   CVTMAP+316                                               02282000
CVTINTLA EQU   CVTMAP+320                                               02283000
CVTAPF   EQU   CVTMAP+324                                               02284000
CVTEXT2  EQU   CVTMAP+328                                               02285000
CVTHJES  EQU   CVTMAP+332                                               02286000
CVTPGSIA EQU   CVTMAP+348                                               02287000
CVTA1F1  EQU   CVTMAP+356                                               02288000
CVTSYSK  EQU   CVTMAP+357                                               02289000
CVTVOLM1 EQU   CVTMAP+380                                               02290000
CVTVOLF1 EQU   CVTVOLM1                                                 02291000
CVTATMCT EQU   CVTMAP+388                                               02292000
CVTXTNT1 EQU   0                                                        02293000
CVTXTNT2 EQU   0                                                        02294000
CVTDSSV  EQU   CVTXTNT2                                                 02295000
CVTFLGBT EQU   CVTXTNT2+5                                               02296000
CVTQID   EQU   CVTXTNT2+24                                              02297000
CVTSHS   EQU   CVTXTNT2+40                                              02298000
CVTRV400 EQU   CVTXTNT2+52                                              02299000
CVTRV409 EQU   CVTXTNT2+53                                              02300000
CVTATCVT EQU   CVTXTNT2+64                                              02301000
CVTRV429 EQU   CVTXTNT2+84                                              02302000
CVTRV438 EQU   CVTXTNT2+85                                              02303000
CVTRV457 EQU   CVTXTNT2+112                                             02304000
CVTRV466 EQU   CVTXTNT2+113                                             02305000
CVTFIX   EQU   0                                                        02306000
CVTRELNO EQU   CVTFIX+252                                               02307000
ISTPAB   EQU   0                                                        02308000
PABWQCHN EQU   ISTPAB                                                   02309000
PABWEQA  EQU   PABWQCHN                                                 02310000
PABCHAIN EQU   PABWQCHN+4                                               02311000
PABRPHFG EQU   ISTPAB+12                                                02312000
PABFLAGS EQU   PABRPHFG                                                 02313000
PABERLCK EQU   PABFLAGS                                                 02314000
PABERRLK EQU   PABERLCK                                                 02315000
ISTLOK   EQU   0                                                        02316000
LOKCHN   EQU   ISTLOK+1                                                 02317000
LOKCHNG  EQU   LOKCHN                                                   02318000
@NM00054 EQU   LOKCHNG+2                                                02319000
ISTACDEB EQU   0                                                        02320000
ACDVTPRX EQU   ISTACDEB                                                 02321000
ACDTYPE  EQU   ACDVTPRX                                                 02322000
ACDDBPFX EQU   ISTACDEB+16                                              02323000
ACDTBLOF EQU   ACDDBPFX+6                                               02324000
ACDBASIC EQU   ISTACDEB+24                                              02325000
ACDTCBAD EQU   ACDBASIC                                                 02326000
ACDNMSUB EQU   ACDTCBAD                                                 02327000
ACDDEBAD EQU   ACDBASIC+4                                               02328000
ACDUSRPG EQU   ACDBASIC+16                                              02329000
ACDACBAD EQU   ACDBASIC+24                                              02330000
ACDAPPAD EQU   ACDBASIC+28                                              02331000
ACDVTAM  EQU   ISTACDEB+56                                              02332000
ACDLOCK  EQU   ACDVTAM                                                  02333000
ACDFMCB  EQU   ACDVTAM+8                                                02334000
ACDRAFQ  EQU   ACDVTAM+12                                               02335000
ACDRARQ  EQU   ACDVTAM+16                                               02336000
ACDSSFLG EQU   ACDVTAM+80                                               02337000
ACDAPDAT EQU   ACDVTAM+83                                               02338000
ACDASFQ  EQU   ISTACDEB+200                                             02339000
ACDREFQ  EQU   ISTACDEB+204                                             02340000
ISTDYPAB EQU   0                                                        02341000
ISTRPH   EQU   0                                                        02342000
RPHCNTL  EQU   ISTRPH                                                   02343000
RPHFLAGS EQU   RPHCNTL+2                                                02344000
RPHAPTYP EQU   RPHFLAGS                                                 02345000
RPHFSTLC EQU   RPHFLAGS                                                 02346000
RPHFLGB  EQU   RPHCNTL+3                                                02347000
RPHRPHA  EQU   ISTRPH+4                                                 02348000
RPHTSKID EQU   ISTRPH+8                                                 02349000
RPHDVTA  EQU   ISTRPH+12                                                02350000
RPHRESMA EQU   ISTRPH+16                                                02351000
RPHWPFLG EQU   RPHRESMA                                                 02352000
RPHMAJCB EQU   ISTRPH+21                                                02353000
RPHWEA   EQU   ISTRPH+24                                                02354000
RPHCSPA  EQU   RPHWEA                                                   02355000
RPHSRPRM EQU   ISTRPH+28                                                02356000
RPHCRR   EQU   ISTRPH+32                                                02357000
RPHPABQA EQU   ISTRPH+36                                                02358000
RPHWORK  EQU   ISTRPH+40                                                02359000
RPHSAVE1 EQU   RPHWORK                                                  02360000
RPHSBITS EQU   RPHSAVE1+1                                               02361000
ISTATCVT EQU   0                                                        02362000
ATCCOM   EQU   ISTATCVT                                                 02363000
ATCSTAT  EQU   ATCCOM                                                   02364000
ATCSTAT1 EQU   ATCSTAT                                                  02365000
ATCSTFLG EQU   ATCSTAT+1                                                02366000
ATCPOFLG EQU   ATCSTAT+2                                                02367000
ATCSTAT4 EQU   ATCSTAT+3                                                02368000
ATCDCFRR EQU   ATCCOM+8                                                 02369000
ATCBPDA  EQU   ATCCOM+128                                               02370000
ATCIOTRC EQU   ATCCOM+140                                               02371000
ATCTHTRC EQU   ATCIOTRC                                                 02372000
ATCBFTRC EQU   ATCCOM+144                                               02373000
ATCSMRQ  EQU   ATCCOM+180                                               02374000
ATCNERFN EQU   ATCCOM+232                                               02375000
ATCNESAL EQU   ATCCOM+256                                               02376000
ATCNERAP EQU   ATCCOM+260                                               02377000
ATCESC01 EQU   ISTATCVT+288                                             02378000
ATCESC02 EQU   ISTATCVT+292                                             02379000
ATCCSMR  EQU   ISTATCVT+296                                             02380000
ATCSHRFG EQU   ISTATCVT+316                                             02381000
ATCHPGM  EQU   ISTATCVT+384                                             02382000
ATCAP33  EQU   ISTATCVT+444                                             02383000
ATCAP35  EQU   ISTATCVT+448                                             02384000
ATCAP36  EQU   ISTATCVT+452                                             02385000
ATCVLCNT EQU   ISTATCVT+772                                             02386000
ATCRNO   EQU   ISTATCVT+788                                             02387000
ATCSOPD  EQU   ISTATCVT+792                                             02388000
ATCSIPD  EQU   ISTATCVT+800                                             02389000
ATCSECST EQU   ISTATCVT+812                                             02390000
ATCSTAT2 EQU   ISTATCVT+818                                             02391000
@NM00065 EQU   ISTATCVT+911                                             02392000
ATCAOSM  EQU   ISTATCVT+912                                             02393000
ATCGSRBQ EQU   ATCAOSM+4                                                02394000
ATCGSRBG EQU   ATCGSRBQ                                                 02395000
ATCAP31  EQU   ATCAOSM+24                                               02396000
ATCICAPP EQU   ATCAOSM+100                                              02397000
ATCLDAPP EQU   ATCAOSM+120                                              02398000
ATCDAPVT EQU   ATCAOSM+140                                              02399000
ATCVTFLG EQU   ATCAOSM+392                                              02400000
ATCZFLAG EQU   ATCAOSM+588                                              02401000
ISTDCCRR EQU   0                                                        02402000
CRRCRR   EQU   ISTDCCRR                                                 02403000
CRRSPACE EQU   ISTDCCRR+12                                              02404000
CRRSAREA EQU   0                                                        02405000
CRRSAVE  EQU   CRRSAREA                                                 02406000
CRRSAVE1 EQU   CRRSAREA+72                                              02407000
CRRMAS   EQU   CRRSAREA+148                                             02408000
CRRMAS1  EQU   CRRMAS                                                   02409000
CRRM00   EQU   CRRMAS1                                                  02410000
CRRMAS2  EQU   CRRMAS+1                                                 02411000
CRRMAS3  EQU   CRRMAS+2                                                 02412000
CRRMAS4  EQU   CRRMAS+3                                                 02413000
CRRRMAS1 EQU   CRRMAS+4                                                 02414000
CRRRMAS2 EQU   CRRMAS+5                                                 02415000
CRRRMAS3 EQU   CRRMAS+6                                                 02416000
CRRSMAS  EQU   CRRRMAS3                                                 02417000
CRRATS   EQU   CRRSAREA+156                                             02418000
CRRATS1  EQU   CRRATS                                                   02419000
CRRC00   EQU   CRRATS1                                                  02420000
CRRC02   EQU   CRRATS1                                                  02421000
CRRATS2  EQU   CRRATS+1                                                 02422000
CRRATS3  EQU   CRRATS+2                                                 02423000
CRRATS4  EQU   CRRATS+3                                                 02424000
CRRRATS1 EQU   CRRATS+4                                                 02425000
CRRRATS2 EQU   CRRATS+5                                                 02426000
CRRRATS3 EQU   CRRATS+6                                                 02427000
CRRSATS  EQU   CRRRATS3                                                 02428000
CRRFLGS1 EQU   CRRSAREA+164                                             02429000
CRRFLDOS EQU   CRRFLGS1                                                 02430000
CRRINIO  EQU   CRRFLGS1                                                 02431000
CRRCPROC EQU   CRRFLGS1                                                 02432000
CRRREQP  EQU   CRRFLGS1                                                 02433000
CRRSOLRQ EQU   CRRFLGS1                                                 02434000
CRRFLGS2 EQU   CRRSAREA+165                                             02435000
CRRFLGS3 EQU   CRRSAREA+166                                             02436000
CRRSTSPR EQU   CRRFLGS3                                                 02437000
CRRFLGS4 EQU   CRRSAREA+167                                             02438000
CRRFMCLK EQU   CRRFLGS4                                                 02439000
CRRFLGS  EQU   CRRSAREA+168                                             02440000
CRRSW0   EQU   CRRFLGS                                                  02441000
CRRSW1   EQU   CRRFLGS                                                  02442000
CRRSW2   EQU   CRRFLGS                                                  02443000
CRRSW4   EQU   CRRFLGS                                                  02444000
CRRSW5   EQU   CRRFLGS                                                  02445000
CRRSW6   EQU   CRRFLGS                                                  02446000
CRRRFLG1 EQU   CRRSAREA+169                                             02447000
CRRDBLCK EQU   CRRRFLG1                                                 02448000
CRRRTYPE EQU   CRRRFLG1                                                 02449000
CRRFDBK1 EQU   CRRSAREA+170                                             02450000
CRRRTNCD EQU   CRRFDBK1                                                 02451000
CRRFDB2  EQU   CRRFDBK1+1                                               02452000
CRRFDB3  EQU   CRRFDBK1+2                                               02453000
CRRFDBK2 EQU   CRRSAREA+176                                             02454000
CRRDSB   EQU   CRRFDBK2                                                 02455000
CRRESR   EQU   CRRFDBK2+2                                               02456000
CRRCLCCW EQU   CRRSAREA+180                                             02457000
CRRFMCB  EQU   CRRSAREA+184                                             02458000
CRRLCPB  EQU   CRRSAREA+192                                             02459000
CRRCLDO  EQU   CRRSAREA+200                                             02460000
CRRTRBUF EQU   CRRSAREA+204                                             02461000
CRRARPL  EQU   CRRTRBUF+4                                               02462000
CRRATCVT EQU   CRRSAREA+216                                             02463000
CRRRTN6  EQU   CRRSAREA+244                                             02464000
CRRRTN9  EQU   CRRSAREA+256                                             02465000
CRRBFLGS EQU   CRRSAREA+280                                             02466000
ISTLCCW  EQU   0                                                        02467000
LCCWOP   EQU   ISTLCCW                                                  02468000
LCCWRWOP EQU   LCCWOP                                                   02469000
LCCWCTL  EQU   LCCWRWOP                                                 02470000
LCCWFLAG EQU   ISTLCCW+1                                                02471000
LCCWLSI  EQU   LCCWFLAG                                                 02472000
ISTLCPB  EQU   0                                                        02473000
LCPTYPE  EQU   ISTLCPB                                                  02474000
LCPLNGTH EQU   ISTLCPB+1                                                02475000
LCPREQTG EQU   ISTLCPB+2                                                02476000
LCPFLAGS EQU   LCPREQTG                                                 02477000
LCPZF001 EQU   LCPFLAGS                                                 02478000
LCPZRT02 EQU   LCPZF001                                                 02479000
LCPZF002 EQU   LCPFLAGS                                                 02480000
LCPZRT03 EQU   LCPZF002                                                 02481000
LCPZF003 EQU   LCPFLAGS                                                 02482000
LCPZRT04 EQU   LCPZF003                                                 02483000
LCPZF004 EQU   LCPFLAGS                                                 02484000
LCPZRT05 EQU   LCPZF004                                                 02485000
LCPZRT06 EQU   LCPFLAGS                                                 02486000
LCPZRT07 EQU   LCPFLAGS                                                 02487000
LCPMNRCD EQU   LCPREQTG+1                                               02488000
LCPZRT08 EQU   LCPMNRCD                                                 02489000
LCPZRT09 EQU   LCPMNRCD                                                 02490000
LCPCHAIN EQU   ISTLCPB+4                                                02491000
LCPCHAI1 EQU   LCPCHAIN                                                 02492000
LCPRUCNT EQU   ISTLCPB+8                                                02493000
LCPFLAG2 EQU   ISTLCPB+9                                                02494000
LCPTLBPI EQU   LCPFLAG2                                                 02495000
LCPFID0  EQU   LCPFLAG2                                                 02496000
LCPSEQ   EQU   ISTLCPB+10                                               02497000
LCPCID   EQU   ISTLCPB+16                                               02498000
LCPSAF   EQU   LCPCID                                                   02499000
LCPDAF   EQU   LCPCID+2                                                 02500000
LCPNXLCW EQU   ISTLCPB+20                                               02501000
LCPFDBA  EQU   ISTLCPB+24                                               02502000
LCPFLG1  EQU   ISTLCPB+37                                               02503000
LCPFLCCW EQU   ISTLCPB+40                                               02504000
LCPLCCW  EQU   ISTLCPB+48                                               02505000
LCPPABA  EQU   LCPLCCW+4                                                02506000
LCPRPHA  EQU   LCPPABA                                                  02507000
ISTZSAVE EQU   0                                                        02508000
ZSAZSVBC EQU   ISTZSAVE                                                 02509000
ZSAZSVMS EQU   ZSAZSVBC                                                 02510000
ISTPFCRR EQU   0                                                        02511000
PFCCRR   EQU   ISTPFCRR                                                 02512000
PFCCRRID EQU   PFCCRR                                                   02513000
CRRID    EQU   PFCCRRID                                                 02514000
PFCCRRLN EQU   PFCCRR+2                                                 02515000
CRRLEN   EQU   PFCCRRLN                                                 02516000
PFCHDR   EQU   ISTPFCRR+4                                               02517000
PFCCRRO  EQU   PFCHDR                                                   02518000
CRRCHAIN EQU   PFCCRRO                                                  02519000
PFCFRRO  EQU   PFCHDR+4                                                 02520000
CRRFRR   EQU   PFCFRRO                                                  02521000
ISTCFCRR EQU   0                                                        02522000
CFCAUDIT EQU   ISTCFCRR                                                 02523000
CFCNTRD  EQU   CFCAUDIT                                                 02524000
CFCCRT   EQU   CFCAUDIT+1                                               02525000
ISTZCRR  EQU   0                                                        02526000
ZCRCRR   EQU   ISTZCRR                                                  02527000
ZCRFLGS1 EQU   ISTZCRR+12                                               02528000
ZCRFLGS2 EQU   ISTZCRR+13                                               02529000
ZCRSWFLD EQU   ISTZCRR+14                                               02530000
ZCRENDSH EQU   ZCRSWFLD                                                 02531000
ZCRNDLCP EQU   ZCRSWFLD                                                 02532000
ZCRRESET EQU   ZCRSWFLD                                                 02533000
ZCRFLGS3 EQU   ISTZCRR+15                                               02534000
ZCRGENSW EQU   ISTZCRR+16                                               02535000
ZCRPFLGS EQU   ISTZCRR+17                                               02536000
ZCRIBPR  EQU   ISTZCRR+18                                               02537000
ZCRSCPSW EQU   ISTZCRR+19                                               02538000
ZCRPARMS EQU   ISTZCRR+24                                               02539000
ZCRFBPTR EQU   ZCRPARMS                                                 02540000
ZCRDFRDA EQU   ZCRPARMS+10                                              02541000
ZCRPCOD1 EQU   ZCRPARMS+12                                              02542000
ZCRPLSBF EQU   ZCRPCOD1                                                 02543000
ZCRPCOD2 EQU   ZCRPARMS+13                                              02544000
ZCRSVRTN EQU   ISTZCRR+56                                               02545000
ZCRWKARA EQU   ISTZCRR+156                                              02546000
ZCRCIDSV EQU   ISTZCRR+192                                              02547000
ZCRAUDIT EQU   ISTZCRR+440                                              02548000
ZCRENTER EQU   ZCRAUDIT+5                                               02549000
ZCRLCPB  EQU   ISTZCRR+480                                              02550000
ZCRRHRU  EQU   ZCRLCPB                                                  02551000
ISTASCRR EQU   0                                                        02552000
ASCFLAGS EQU   ISTASCRR+16                                              02553000
ASCFLG1  EQU   ASCFLAGS                                                 02554000
ASCFLG2  EQU   ASCFLAGS+2                                               02555000
ASCFLG3  EQU   ASCFLAGS+4                                               02556000
ASCUSRGS EQU   ISTASCRR+28                                              02557000
ISTAPCRR EQU   0                                                        02558000
APCATFLG EQU   ISTAPCRR+16                                              02559000
APCRFLG  EQU   ISTAPCRR+18                                              02560000
APCSAVE  EQU   ISTAPCRR+44                                              02561000
APCCOMF  EQU   ISTAPCRR+116                                             02562000
APCCOMF1 EQU   APCCOMF                                                  02563000
APC31FLG EQU   ISTAPCRR+132                                             02564000
APC52FLG EQU   ISTAPCRR+133                                             02565000
APC53FLG EQU   ISTAPCRR+134                                             02566000
APC54FLG EQU   ISTAPCRR+135                                             02567000
APC57FLG EQU   ISTAPCRR+136                                             02568000
ISTCRA   EQU   0                                                        02569000
CRABASIC EQU   ISTCRA                                                   02570000
CRAHDR   EQU   CRABASIC                                                 02571000
CRACRR   EQU   CRAHDR                                                   02572000
CRAFRR   EQU   CRAHDR+4                                                 02573000
CRALKACT EQU   CRABASIC+8                                               02574000
CRAL5PTR EQU   CRABASIC+28                                              02575000
CRAL8PTR EQU   CRABASIC+40                                              02576000
CRAPROCR EQU   ISTCRA+312                                               02577000
CRASVC   EQU   ISTCRA+848                                               02578000
CRABUFA  EQU   CRASVC+68                                                02579000
ISTDEVCH EQU   0                                                        02580000
DEVSHCH  EQU   ISTDEVCH                                                 02581000
DEVCHAR  EQU   DEVSHCH                                                  02582000
DEVTCODE EQU   ISTDEVCH+1                                               02583000
DEVFLAGS EQU   ISTDEVCH+3                                               02584000
DEVFCCTL EQU   DEVFLAGS                                                 02585000
DEVCHAR3 EQU   DEVFLAGS                                                 02586000
ISTNCB   EQU   0                                                        02587000
NCBDAF   EQU   ISTNCB+2                                                 02588000
NCBFLAGS EQU   ISTNCB+24                                                02589000
NCBFRAS  EQU   NCBFLAGS+1                                               02590000
NCBFTRIO EQU   NCBFRAS                                                  02591000
NCBFLAG1 EQU   NCBFLAGS+2                                               02592000
ISTPROCD EQU   0                                                        02593000
PROPROC  EQU   ISTPROCD                                                 02594000
PROPROC1 EQU   PROPROC                                                  02595000
PROPROC2 EQU   PROPROC+1                                                02596000
PROPROC3 EQU   PROPROC+2                                                02597000
PROPROC4 EQU   PROPROC+3                                                02598000
PROPROCS EQU   0                                                        02599000
PROSETMS EQU   PROPROCS+1                                               02600000
PROSETM2 EQU   PROSETMS                                                 02601000
PROSETM3 EQU   PROSETMS+1                                               02602000
PROSETM4 EQU   PROSETMS+2                                               02603000
ISTDNCB  EQU   0                                                        02604000
DNCNCB   EQU   ISTDNCB                                                  02605000
DNCOS    EQU   ISTDNCB+56                                               02606000
DNCZFLGS EQU   DNCOS                                                    02607000
DNCBSCED EQU   DNCOS+2                                                  02608000
ISTFMCB  EQU   0                                                        02609000
FMCTYPE  EQU   ISTFMCB                                                  02610000
FMCSAF   EQU   ISTFMCB+2                                                02611000
FMCDNCBA EQU   ISTFMCB+16                                               02612000
FMCSTAT  EQU   ISTFMCB+28                                               02613000
FMCDEVOF EQU   FMCSTAT                                                  02614000
FMCDEDSC EQU   FMCSTAT                                                  02615000
FMCZF007 EQU   FMCSTAT                                                  02616000
FMCSTAT1 EQU   ISTFMCB+29                                               02617000
FMCCMDFL EQU   ISTFMCB+31                                               02618000
FMCCMPS1 EQU   ISTFMCB+36                                               02619000
FMCMODE  EQU   ISTFMCB+52                                               02620000
FMCSIPA  EQU   ISTFMCB+148                                              02621000
FMCNXOSQ EQU   ISTFMCB+152                                              02622000
FMCNXCFM EQU   FMCNXOSQ                                                 02623000
FMCNXOSC EQU   FMCNXOSQ+2                                               02624000
FMCSSTAT EQU   ISTFMCB+159                                              02625000
FMCPACE  EQU   ISTFMCB+160                                              02626000
FMCPACEN EQU   FMCPACE                                                  02627000
FMCPACEM EQU   FMCPACE+1                                                02628000
FMCPACPC EQU   FMCPACE+2                                                02629000
FMCCVAL  EQU   FMCPACE+3                                                02630000
FMCOBCE  EQU   FMCCVAL                                                  02631000
FMCCLEXT EQU   ISTFMCB+164                                              02632000
FMCRPLA  EQU   FMCCLEXT                                                 02633000
FMCFBA   EQU   FMCCLEXT+4                                               02634000
FMCRAFM  EQU   FMCCLEXT+8                                               02635000
FMCDCLOK EQU   FMCCLEXT+12                                              02636000
FMCCMPS2 EQU   FMCCLEXT+16                                              02637000
FMCFLGA  EQU   FMCCMPS2                                                 02638000
FMCFLGA0 EQU   FMCFLGA                                                  02639000
FMCFLGA1 EQU   FMCFLGA                                                  02640000
FMCFLGA4 EQU   FMCFLGA                                                  02641000
FMCFLGA5 EQU   FMCFLGA                                                  02642000
FMCFLGCL EQU   FMCCMPS2+1                                               02643000
FMCPSCMD EQU   FMCCMPS2+2                                               02644000
FMCPSTAT EQU   FMCCMPS2+3                                               02645000
FMCSTAT2 EQU   ISTFMCB+186                                              02646000
FMCMODEB EQU   ISTFMCB+189                                              02647000
FMCCLEAR EQU   FMCMODEB                                                 02648000
FMCCLSEQ EQU   ISTFMCB+190                                              02649000
FMCRRESP EQU   ISTFMCB+195                                              02650000
FMCSSEGQ EQU   ISTFMCB+200                                              02651000
FMCFBAS  EQU   ISTFMCB+216                                              02652000
FMCZV002 EQU   FMCFBAS                                                  02653000
FMCFBRE  EQU   ISTFMCB+220                                              02654000
FMCSNCTL EQU   ISTFMCB+224                                              02655000
FMCSCFLG EQU   FMCSNCTL                                                 02656000
FMCVS1   EQU   ISTFMCB+232                                              02657000
FMCZFLAG EQU   FMCVS1                                                   02658000
FMCZF006 EQU   FMCZFLAG                                                 02659000
FMCLBXM  EQU   FMCVS1+12                                                02660000
FMCSHEAQ EQU   FMCLBXM                                                  02661000
FMCLCPBQ EQU   FMCVS1+16                                                02662000
FMCLCPAQ EQU   FMCVS1+20                                                02663000
FMCSEQ1  EQU   FMCVS1+34                                                02664000
FMCZFLG2 EQU   FMCVS1+35                                                02665000
FMCCVFLG EQU   FMCVS1+44                                                02666000
FMCFLAG  EQU   0                                                        02667000
FMCFLGB  EQU   FMCFLAG                                                  02668000
ISTFDB   EQU   0                                                        02669000
ISTFSB   EQU   0                                                        02670000
FSBFSB   EQU   ISTFSB                                                   02671000
FSBTYPE  EQU   FSBFSB                                                   02672000
FSBMNRCD EQU   FSBFSB+2                                                 02673000
FSBSFLGS EQU   FSBFSB+3                                                 02674000
FSBFSBA  EQU   FSBFSB+4                                                 02675000
FSBBTH   EQU   FSBFSB+8                                                 02676000
FSBCID   EQU   FSBBTH                                                   02677000
FSBRQTAG EQU   FSBBTH+4                                                 02678000
FSBSEQID EQU   FSBRQTAG                                                 02679000
FSBFLAGS EQU   FSBSEQID                                                 02680000
FSBSEQ   EQU   FSBSEQID+1                                               02681000
FSBCSWST EQU   FSBBTH+6                                                 02682000
FSBTHFLD EQU   FSBCSWST                                                 02683000
FSBTH1   EQU   FSBTHFLD                                                 02684000
FSBSYSRS EQU   FSBTH1                                                   02685000
FSBTH2   EQU   FSBTHFLD+1                                               02686000
FSBEXTRS EQU   FSBTH2                                                   02687000
FSBXFSTS EQU   FSBEXTRS                                                 02688000
FSBXCODE EQU   FSBEXTRS                                                 02689000
FSBNETRS EQU   FSBFSB+16                                                02690000
FSBSRCAT EQU   FSBNETRS                                                 02691000
FSBERC   EQU   FSBNETRS+1                                               02692000
FSBFBMI  EQU   FSBERC                                                   02693000
FSBDMGRS EQU   FSBFSB+18                                                02694000
FSBSS1   EQU   FSBDMGRS                                                 02695000
FSBSS2   EQU   FSBDMGRS+1                                               02696000
FSBLCPB  EQU   FSBFSB+20                                                02697000
FSBMSGID EQU   FSBLCPB                                                  02698000
FSBLCCWA EQU   FSBFSB+24                                                02699000
FSBRLSTS EQU   FSBLCCWA                                                 02700000
ISTDCLCP EQU   0                                                        02701000
DCLLCPB  EQU   ISTDCLCP                                                 02702000
DCLRPLA  EQU   ISTDCLCP+72                                              02703000
DCLRTYPE EQU   ISTDCLCP+76                                              02704000
DCLRQTP  EQU   DCLRTYPE                                                 02705000
DCLRFLG  EQU   DCLRTYPE+1                                               02706000
DCLBNSP  EQU   DCLRFLG                                                  02707000
DCLFLAG1 EQU   ISTDCLCP+78                                              02708000
ISTLDO   EQU   0                                                        02709000
LDOCMD   EQU   ISTLDO                                                   02710000
LDOFLAGS EQU   ISTLDO+1                                                 02711000
LDOADDR  EQU   ISTLDO+4                                                 02712000
FMZL0022 EQU   0                                                        02713000
FMZL0030 EQU   0                                                        02714000
ISTAVT   EQU   0                                                        02715000
ISTAS49  EQU   ISTAVT+4                                                 02716000
FMZL0038 EQU   0                                                        02717000
FMZL0046 EQU   0                                                        02718000
ISTWKE   EQU   0                                                        02719000
WKECHAIN EQU   ISTWKE+4                                                 02720000
WKEFLAGS EQU   WKECHAIN                                                 02721000
FMZL0064 EQU   0                                                        02722000
FMZL0081 EQU   0                                                        02723000
FMZL0094 EQU   0                                                        02724000
FMZL0118 EQU   0                                                        02725000
FMZL0131 EQU   0                                                        02726000
FMZL0142 EQU   0                                                        02727000
FMZL0167 EQU   0                                                        02728000
ISTRPL   EQU   0                                                        02729000
CVTS01   EQU   CVTPGSIA                                                 02730000
CVTLPDIA EQU   CVTS01+12                                                02731000
CVTDIRST EQU   CVTLPDIA                                                 02732000
CVTSLIDA EQU   CVTS01+24                                                02733000
CVTCTLFG EQU   CVTS01+50                                                02734000
CVTRV210 EQU   CVTS01+424                                               02735000
CVTRV219 EQU   CVTS01+425                                               02736000
CVTRV228 EQU   CVTS01+426                                               02737000
CVTRV237 EQU   CVTS01+427                                               02738000
CVTMFRTR EQU   CVTS01+452                                               02739000
CVTRV262 EQU   CVTS01+468                                               02740000
CVTRV271 EQU   CVTS01+469                                               02741000
CVTRV280 EQU   CVTS01+470                                               02742000
CVTRV289 EQU   CVTS01+471                                               02743000
CVTGSDA  EQU   CVTS01+600                                               02744000
PSARSVTE EQU   PSARSVT                                                  02745000
LCPZTIE  EQU   LCPCID                                                   02746000
LCPZSNAM EQU   LCPZTIE+8                                                02747000
FSBCOMBN EQU   FSBNETRS                                                 02748000
FSBRHFLD EQU   FSBCOMBN+1                                               02749000
FSBRH3   EQU   FSBRHFLD+2                                               02750000
FSBLDFLG EQU   FSBRH3                                                   02751000
@NM00099 EQU   FSBRQTAG                                                 02752000
FLC      EQU   PSA                                                      02753000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02754000
FSBRT0B  EQU   @NM00099+1                                               02755000
FSBRT0A  EQU   @NM00099+1                                               02756000
FSBRT09  EQU   @NM00099+1                                               02757000
FSBRT08  EQU   @NM00099+1                                               02758000
FSBRT07  EQU   @NM00099                                                 02759000
FSBRT06  EQU   @NM00099                                                 02760000
FSBRT05  EQU   @NM00099                                                 02761000
FSBRT04  EQU   @NM00099                                                 02762000
FSBRT03  EQU   @NM00099                                                 02763000
FSBRT02  EQU   @NM00099                                                 02764000
FSBRT01  EQU   @NM00099                                                 02765000
FSBRT00  EQU   @NM00099                                                 02766000
FSBLDCUF EQU   FSBLDFLG                                                 02767000
FSBLDSIF EQU   FSBLDFLG                                                 02768000
FSBLDSOF EQU   FSBLDFLG                                                 02769000
FSBLDEBF EQU   FSBLDFLG                                                 02770000
FSBLDBBF EQU   FSBLDFLG                                                 02771000
FSBLDFME EQU   FSBLDFLG                                                 02772000
FSBLDSCF EQU   FSBLDFLG                                                 02773000
FSBLDRMF EQU   FSBLDFLG                                                 02774000
FSBRH2   EQU   FSBRHFLD+1                                               02775000
FSBRH1   EQU   FSBRHFLD                                                 02776000
FSBALIGN EQU   FSBCOMBN                                                 02777000
LCPZTRV4 EQU   LCPZSNAM+4                                               02778000
LCPZTRV1 EQU   LCPZSNAM                                                 02779000
LCPZSNA  EQU   LCPZTIE+4                                                02780000
LCPZFMCA EQU   LCPZTIE                                                  02781000
PSARSAV  EQU   PSARSVTE+60                                              02782000
PSARSTK  EQU   PSARSVTE+56                                              02783000
PSAESAV3 EQU   PSARSVTE+52                                              02784000
PSAESTK3 EQU   PSARSVTE+48                                              02785000
PSAESAV2 EQU   PSARSVTE+44                                              02786000
PSAESTK2 EQU   PSARSVTE+40                                              02787000
PSAESAV1 EQU   PSARSVTE+36                                              02788000
PSAESTK1 EQU   PSARSVTE+32                                              02789000
PSAPSAV  EQU   PSARSVTE+28                                              02790000
PSAPSTK  EQU   PSARSVTE+24                                              02791000
PSAMSAV  EQU   PSARSVTE+20                                              02792000
PSAMSTK  EQU   PSARSVTE+16                                              02793000
PSASSAV  EQU   PSARSVTE+12                                              02794000
PSASSTK  EQU   PSARSVTE+8                                               02795000
PSANSTK  EQU   PSARSVTE+4                                               02796000
PSACSTK  EQU   PSARSVTE                                                 02797000
CVTRV628 EQU   CVTS01+728                                               02798000
CVTRV627 EQU   CVTS01+724                                               02799000
CVTRV626 EQU   CVTS01+720                                               02800000
CVTRV625 EQU   CVTS01+716                                               02801000
CVTRV624 EQU   CVTS01+712                                               02802000
CVTRV623 EQU   CVTS01+708                                               02803000
CVTRV622 EQU   CVTS01+704                                               02804000
CVTRV621 EQU   CVTS01+700                                               02805000
CVTRV620 EQU   CVTS01+696                                               02806000
CVTSUSP  EQU   CVTS01+692                                               02807000
CVTT6SVC EQU   CVTS01+688                                               02808000
CVTCDAL  EQU   CVTS01+684                                               02809000
CVTTCTL  EQU   CVTS01+680                                               02810000
CVTRSUME EQU   CVTS01+676                                               02811000
CVTJTERM EQU   CVTS01+672                                               02812000
CVTASMRM EQU   CVTS01+668                                               02813000
CVTTCASP EQU   CVTS01+664                                               02814000
CVT0PT03 EQU   CVTS01+660                                               02815000
CVT0PT0E EQU   CVTS01+656                                               02816000
CVTIRM   EQU   CVTS01+652                                               02817000
CVTCGK   EQU   CVTS01+648                                               02818000
CVTRAC   EQU   CVTS01+644                                               02819000
CVTRV606 EQU   CVTS01+640                                               02820000
CVTRV605 EQU   CVTS01+636                                               02821000
CVTRV604 EQU   CVTS01+632                                               02822000
CVTEFF02 EQU   CVTS01+628                                               02823000
CVTCBBR  EQU   CVTS01+624                                               02824000
CVTSSCR  EQU   CVTS01+620                                               02825000
CVTEVENT EQU   CVTS01+616                                               02826000
CVTCRCA  EQU   CVTS01+612                                               02827000
CVTTPIO  EQU   CVTS01+608                                               02828000
CVTADV   EQU   CVTS01+604                                               02829000
CVTGSDAB EQU   CVTGSDA                                                  02830000
CVTQV3   EQU   CVTS01+596                                               02831000
CVTQV2   EQU   CVTS01+592                                               02832000
CVTQV1   EQU   CVTS01+588                                               02833000
CVTRPT   EQU   CVTS01+584                                               02834000
CVTSSRB  EQU   CVTS01+580                                               02835000
CVTCSDRL EQU   CVTS01+576                                               02836000
CVTEXP1  EQU   CVTS01+572                                               02837000
CVTRMPMT EQU   CVTS01+568                                               02838000
CVTRMPTT EQU   CVTS01+564                                               02839000
CVTVPSA  EQU   CVTS01+560                                               02840000
CVTVSTOP EQU   CVTS01+556                                               02841000
CVTGTFR8 EQU   CVTS01+552                                               02842000
CVTQUIT  EQU   CVTS01+548                                               02843000
CVTVACR  EQU   CVTS01+544                                               02844000
CVTWTCB  EQU   CVTS01+540                                               02845000
CVTSTPRS EQU   CVTS01+536                                               02846000
CVT0PT02 EQU   CVTS01+532                                               02847000
CVTDARCM EQU   CVTS01+528                                               02848000
CVTIRECM EQU   CVTS01+524                                               02849000
CVTJRECM EQU   CVTS01+520                                               02850000
CVTVEMS0 EQU   CVTS01+516                                               02851000
CVTSPFRR EQU   CVTS01+512                                               02852000
CVTRLSTG EQU   CVTS01+508                                               02853000
CVT0TC0A EQU   CVTS01+504                                               02854000
CVTGMBR  EQU   CVTS01+500                                               02855000
CVTLFRM  EQU   CVTS01+496                                               02856000
CVTRMBR  EQU   CVTS01+492                                               02857000
CVTVIOP  EQU   CVTS01+488                                               02858000
CVTRV307 EQU   CVTS01+486                                               02859000
CVTRV306 EQU   CVTS01+484                                               02860000
CVTRV305 EQU   CVTS01+482                                               02861000
CVTRV304 EQU   CVTS01+480                                               02862000
CVTRV303 EQU   CVTS01+478                                               02863000
CVTRV302 EQU   CVTS01+476                                               02864000
CVTTRCA  EQU   CVTS01+472                                               02865000
CVTRV297 EQU   CVTRV289                                                 02866000
CVTRV296 EQU   CVTRV289                                                 02867000
CVTRV295 EQU   CVTRV289                                                 02868000
CVTRV294 EQU   CVTRV289                                                 02869000
CVTRV293 EQU   CVTRV289                                                 02870000
CVTRV292 EQU   CVTRV289                                                 02871000
CVTRV291 EQU   CVTRV289                                                 02872000
CVTRV290 EQU   CVTRV289                                                 02873000
CVTRV288 EQU   CVTRV280                                                 02874000
CVTRV287 EQU   CVTRV280                                                 02875000
CVTRV286 EQU   CVTRV280                                                 02876000
CVTRV285 EQU   CVTRV280                                                 02877000
CVTRV284 EQU   CVTRV280                                                 02878000
CVTRV283 EQU   CVTRV280                                                 02879000
CVTRV282 EQU   CVTRV280                                                 02880000
CVTRV281 EQU   CVTRV280                                                 02881000
CVTRV279 EQU   CVTRV271                                                 02882000
CVTRV278 EQU   CVTRV271                                                 02883000
CVTRV277 EQU   CVTRV271                                                 02884000
CVTRV276 EQU   CVTRV271                                                 02885000
CVTRV275 EQU   CVTRV271                                                 02886000
CVTRV274 EQU   CVTRV271                                                 02887000
CVTRV273 EQU   CVTRV271                                                 02888000
CVTRV272 EQU   CVTRV271                                                 02889000
CVTRV270 EQU   CVTRV262                                                 02890000
CVTRV269 EQU   CVTRV262                                                 02891000
CVTRV268 EQU   CVTRV262                                                 02892000
CVTRV267 EQU   CVTRV262                                                 02893000
CVTRV266 EQU   CVTRV262                                                 02894000
CVTRV265 EQU   CVTRV262                                                 02895000
CVTRV264 EQU   CVTRV262                                                 02896000
CVTRV263 EQU   CVTRV262                                                 02897000
CVTVFP   EQU   CVTS01+464                                               02898000
CVTVSI   EQU   CVTS01+460                                               02899000
CVTVPSIB EQU   CVTS01+456                                               02900000
CVTMFACT EQU   CVTMFRTR                                                 02901000
CVTMFCTL EQU   CVTS01+448                                               02902000
CVTPVBP  EQU   CVTS01+444                                               02903000
CVTPWI   EQU   CVTS01+440                                               02904000
CVTRV254 EQU   CVTS01+438                                               02905000
CVTRV253 EQU   CVTS01+436                                               02906000
CVTRV252 EQU   CVTS01+434                                               02907000
CVTRV251 EQU   CVTS01+433                                               02908000
CVTRV250 EQU   CVTS01+432                                               02909000
CVTRV249 EQU   CVTS01+431                                               02910000
CVTRV248 EQU   CVTS01+430                                               02911000
CVTRV247 EQU   CVTS01+429                                               02912000
CVTRV246 EQU   CVTS01+428                                               02913000
CVTRV245 EQU   CVTRV237                                                 02914000
CVTRV244 EQU   CVTRV237                                                 02915000
CVTRV243 EQU   CVTRV237                                                 02916000
CVTRV242 EQU   CVTRV237                                                 02917000
CVTRV241 EQU   CVTRV237                                                 02918000
CVTRV240 EQU   CVTRV237                                                 02919000
CVTRV239 EQU   CVTRV237                                                 02920000
CVTRV238 EQU   CVTRV237                                                 02921000
CVTRV236 EQU   CVTRV228                                                 02922000
CVTRV235 EQU   CVTRV228                                                 02923000
CVTRV234 EQU   CVTRV228                                                 02924000
CVTRV233 EQU   CVTRV228                                                 02925000
CVTRV232 EQU   CVTRV228                                                 02926000
CVTRV231 EQU   CVTRV228                                                 02927000
CVTRV230 EQU   CVTRV228                                                 02928000
CVTRV229 EQU   CVTRV228                                                 02929000
CVTRV227 EQU   CVTRV219                                                 02930000
CVTRV226 EQU   CVTRV219                                                 02931000
CVTRV225 EQU   CVTRV219                                                 02932000
CVTRV224 EQU   CVTRV219                                                 02933000
CVTRV223 EQU   CVTRV219                                                 02934000
CVTRV222 EQU   CVTRV219                                                 02935000
CVTRV221 EQU   CVTRV219                                                 02936000
CVTRV220 EQU   CVTRV219                                                 02937000
CVTRV218 EQU   CVTRV210                                                 02938000
CVTRV217 EQU   CVTRV210                                                 02939000
CVTRV216 EQU   CVTRV210                                                 02940000
CVTRV215 EQU   CVTRV210                                                 02941000
CVTRV214 EQU   CVTRV210                                                 02942000
CVTRV213 EQU   CVTRV210                                                 02943000
CVTRV212 EQU   CVTRV210                                                 02944000
CVTRV211 EQU   CVTRV210                                                 02945000
CVTLCCAT EQU   CVTS01+420                                               02946000
CVTPCCAT EQU   CVTS01+416                                               02947000
CVTIPCRP EQU   CVTS01+412                                               02948000
CVTIPCRI EQU   CVTS01+408                                               02949000
CVTIPCDS EQU   CVTS01+404                                               02950000
CVTAIDVT EQU   CVTS01+400                                               02951000
CVTSSAP  EQU   CVTS01+396                                               02952000
CVTEHCIR EQU   CVTS01+392                                               02953000
CVTEHDEF EQU   CVTS01+388                                               02954000
CVTDAIR  EQU   CVTS01+384                                               02955000
CVTPERFM EQU   CVTS01+380                                               02956000
CVT044R2 EQU   CVTS01+376                                               02957000
CVTFETCH EQU   CVTS01+372                                               02958000
CVTRSTWD EQU   CVTS01+368                                               02959000
CVTSPOST EQU   CVTS01+364                                               02960000
CVTIOBP  EQU   CVTS01+360                                               02961000
CVTASMVT EQU   CVTS01+356                                               02962000
CVTRECRQ EQU   CVTS01+352                                               02963000
CVTWSAC  EQU   CVTS01+348                                               02964000
CVTRV149 EQU   CVTS01+344                                               02965000
CVTWSAL  EQU   CVTS01+340                                               02966000
CVTSPSA  EQU   CVTS01+336                                               02967000
CVTGLMN  EQU   CVTS01+332                                               02968000
CVTVEAC0 EQU   CVTS01+328                                               02969000
CVT062R1 EQU   CVTS01+324                                               02970000
CVTRPOST EQU   CVTS01+320                                               02971000
CVTDQIQE EQU   CVTS01+316                                               02972000
CVTCSD   EQU   CVTS01+312                                               02973000
CVTLKRMA EQU   CVTS01+308                                               02974000
CVTRSPIE EQU   CVTS01+304                                               02975000
CVTRENQ  EQU   CVTS01+300                                               02976000
CVTLQCB  EQU   CVTS01+296                                               02977000
CVTFQCB  EQU   CVTS01+292                                               02978000
CVTQCS01 EQU   CVTS01+288                                               02979000
CVTAPFT  EQU   CVTS01+284                                               02980000
CVTPARRL EQU   CVTS01+280                                               02981000
CVTVWAIT EQU   CVTS01+276                                               02982000
CVTGSPL  EQU   CVTS01+272                                               02983000
CVTLSMQ  EQU   CVTS01+268                                               02984000
CVTGSMQ  EQU   CVTS01+264                                               02985000
CVTEXPRO EQU   CVTS01+260                                               02986000
CVTOPCTP EQU   CVTS01+256                                               02987000
CVTSIC   EQU   CVTS01+252                                               02988000
CVTTPIOS EQU   CVTS01+248                                               02989000
CVTRTMS  EQU   CVTS01+244                                               02990000
CVTSDBF  EQU   CVTS01+240                                               02991000
CVTSCBP  EQU   CVTS01+236                                               02992000
CVTSDMP  EQU   CVTS01+232                                               02993000
CVTSV60  EQU   CVTS01+228                                               02994000
CVTRTMCT EQU   CVTS01+224                                               02995000
CVTASCBL EQU   CVTS01+220                                               02996000
CVTASCBH EQU   CVTS01+216                                               02997000
CVTGDA   EQU   CVTS01+212                                               02998000
CVTASVT  EQU   CVTS01+208                                               02999000
CVTVVMDI EQU   CVTS01+204                                               03000000
CVTAQTOP EQU   CVTS01+200                                               03001000
CVTIOSCS EQU   CVTS01+196                                               03002000
CVTSDRM  EQU   CVTS01+192                                               03003000
CVTOPTE  EQU   CVTS01+188                                               03004000
CVTSTXU  EQU   CVTS01+184                                               03005000
CVTQUIS  EQU   CVTS01+180                                               03006000
CVTPARS  EQU   CVTS01+176                                               03007000
CVTS1EE  EQU   CVTS01+172                                               03008000
CVTFRAS  EQU   CVTS01+168                                               03009000
CVTQSAS  EQU   CVTS01+164                                               03010000
CVTCRAS  EQU   CVTS01+160                                               03011000
CVTCRMN  EQU   CVTS01+156                                               03012000
CVTDELCP EQU   CVTS01+152                                               03013000
CVTFRECL EQU   CVTS01+148                                               03014000
CVTGETCL EQU   CVTS01+144                                               03015000
CVTBLDCP EQU   CVTS01+140                                               03016000
CVTAUTHL EQU   CVTS01+136                                               03017000
CVTSCAN  EQU   CVTS01+132                                               03018000
CVTRV144 EQU   CVTS01+130                                               03019000
CVTMAXMP EQU   CVTS01+128                                               03020000
CVTSTCK  EQU   CVTS01+124                                               03021000
CVTRV139 EQU   CVTS01+123                                               03022000
CVTDSSAC EQU   CVTS01+122                                               03023000
CVTRV513 EQU   CVTS01+121                                               03024000
CVTIOSPL EQU   CVTS01+120                                               03025000
CVTPTGT  EQU   CVTS01+116                                               03026000
CVTCSPIE EQU   CVTS01+112                                               03027000
CVTSMFEX EQU   CVTS01+108                                               03028000
CVTOLT0A EQU   CVTS01+104                                               03029000
CVTSRBRT EQU   CVTS01+100                                               03030000
CVTPUTL  EQU   CVTS01+96                                                03031000
CVTASCRL EQU   CVTS01+92                                                03032000
CVTASCRF EQU   CVTS01+88                                                03033000
CVTRV326 EQU   CVTS01+84                                                03034000
CVTRV325 EQU   CVTS01+80                                                03035000
CVTRV324 EQU   CVTS01+76                                                03036000
CVT0VL01 EQU   CVTS01+72                                                03037000
CVTSHRVM EQU   CVTS01+68                                                03038000
CVTRV332 EQU   CVTS01+64                                                03039000
CVTTAS   EQU   CVTS01+60                                                03040000
CVTRSCN  EQU   CVTS01+56                                                03041000
CVTTRAC2 EQU   CVTS01+54                                                03042000
CVTTRACE EQU   CVTS01+52                                                03043000
CVTAPG   EQU   CVTS01+51                                                03044000
CVTSDTRC EQU   CVTCTLFG                                                 03045000
CVTGTRCE EQU   CVTCTLFG                                                 03046000
CVTNOMP  EQU   CVTCTLFG                                                 03047000
CVTRSV79 EQU   CVTCTLFG                                                 03048000
CVTDSTAT EQU   CVTCTLFG                                                 03049000
CVTRSV78 EQU   CVTCTLFG                                                 03050000
CVTRV333 EQU   CVTCTLFG                                                 03051000
CVTRV323 EQU   CVTCTLFG                                                 03052000
CVTSPVLK EQU   CVTS01+49                                                03053000
CVTRSV77 EQU   CVTS01+48                                                03054000
CVTRV331 EQU   CVTS01+44                                                03055000
CVTRV330 EQU   CVTS01+40                                                03056000
CVTRV329 EQU   CVTS01+36                                                03057000
CVTRV328 EQU   CVTS01+32                                                03058000
CVTRV322 EQU   CVTS01+28                                                03059000
CVTSLID  EQU   CVTSLIDA+1                                               03060000
CVTSYLK  EQU   CVTSLIDA                                                 03061000
CVTRV321 EQU   CVTS01+20                                                03062000
CVTRV320 EQU   CVTS01+16                                                03063000
CVTLPDIR EQU   CVTLPDIA+1                                               03064000
CVTRSV69 EQU   CVTDIRST                                                 03065000
CVTRSV68 EQU   CVTDIRST                                                 03066000
CVTRSV67 EQU   CVTDIRST                                                 03067000
CVTRSV66 EQU   CVTDIRST                                                 03068000
CVTRSV65 EQU   CVTDIRST                                                 03069000
CVTRSV64 EQU   CVTDIRST                                                 03070000
CVTRSV63 EQU   CVTDIRST                                                 03071000
CVTDICOM EQU   CVTDIRST                                                 03072000
CVTPVTP  EQU   CVTS01+8                                                 03073000
CVTLPDSR EQU   CVTS01+4                                                 03074000
CVTGETL  EQU   CVTS01                                                   03075000
WKECHNGP EQU   WKECHAIN+1                                               03076000
@NM00103 EQU   WKEFLAGS                                                 03077000
WKEGATE  EQU   WKEFLAGS                                                 03078000
@NM00102 EQU   ISTWKE                                                   03079000
ISTPDAVP EQU   ISTAVT+40                                                03080000
ISTAVR01 EQU   ISTAVT+38                                                03081000
ISTVTTP  EQU   ISTAVT+36                                                03082000
ISTAGTWT EQU   ISTAVT+34                                                03083000
ISTATRT  EQU   ISTAVT+32                                                03084000
ISTARID  EQU   ISTAVT+30                                                03085000
ISTX1    EQU   ISTAVT+29                                                03086000
ISTPHNM  EQU   ISTAVT+24                                                03087000
ISTAPSEX EQU   ISTAVT+20                                                03088000
ISTVTTIK EQU   ISTAVT+18                                                03089000
AVTASID  EQU   ISTAVT+16                                                03090000
ISTAPSTA EQU   ISTAVT+12                                                03091000
ISTAS53  EQU   ISTAVT+8                                                 03092000
ISTAHIP  EQU   ISTAS49                                                  03093000
ISTACVT  EQU   ISTAVT                                                   03094000
LDOLEN   EQU   ISTLDO+2                                                 03095000
LDOCMHN  EQU   LDOFLAGS                                                 03096000
LDOACHN  EQU   LDOFLAGS                                                 03097000
DCLECHAR EQU   ISTDCLCP+98                                              03098000
DCLIOLEN EQU   ISTDCLCP+96                                              03099000
DCLBTLEN EQU   ISTDCLCP+92                                              03100000
DCLCLDOA EQU   ISTDCLCP+88                                              03101000
DCLIOBUF EQU   ISTDCLCP+84                                              03102000
DCLLDO1  EQU   ISTDCLCP+80                                              03103000
DCLRSV03 EQU   ISTDCLCP+79                                              03104000
DCLRSV02 EQU   DCLFLAG1                                                 03105000
DCLRPLS  EQU   DCLFLAG1                                                 03106000
DCLBTEIS EQU   DCLFLAG1                                                 03107000
DCLNODE  EQU   DCLFLAG1                                                 03108000
DCLRSV04 EQU   DCLFLAG1                                                 03109000
DCLSRESW EQU   DCLFLAG1                                                 03110000
DCLCONV  EQU   DCLRFLG                                                  03111000
DCLRSV01 EQU   DCLRFLG                                                  03112000
DCLLCCW3 EQU   ISTDCLCP+64                                              03113000
DCLLCCW2 EQU   ISTDCLCP+56                                              03114000
FSBFDB   EQU   ISTFSB+32                                                03115000
FSBRSV01 EQU   FSBFSB+30                                                03116000
FSBTHCNT EQU   FSBFSB+28                                                03117000
FSBRLRSV EQU   FSBRLSTS                                                 03118000
FSBCFTX  EQU   FSBRLSTS                                                 03119000
FSBICNCB EQU   FSBMSGID                                                 03120000
FSBSSOC  EQU   FSBSS2                                                   03121000
FSBSSCC  EQU   FSBSS2                                                   03122000
FSBSSDC  EQU   FSBSS2                                                   03123000
FSBSSEC  EQU   FSBSS2                                                   03124000
FSBSSIR  EQU   FSBSS2                                                   03125000
FSBSSCR  EQU   FSBSS2                                                   03126000
@NM00098 EQU   FSBSS2                                                   03127000
@NM00097 EQU   FSBSS1                                                   03128000
FSBSSDE  EQU   FSBSS1                                                   03129000
FSBSSUS  EQU   FSBSS1                                                   03130000
@NM00096 EQU   FSBSS1                                                   03131000
FSBSOHI  EQU   FSBERC                                                   03132000
FSBLGI   EQU   FSBERC                                                   03133000
FSBLMRI  EQU   FSBFBMI                                                  03134000
FSBETI   EQU   FSBERC                                                   03135000
FSBEMI   EQU   FSBERC                                                   03136000
FSBEBI   EQU   FSBERC                                                   03137000
FSBECI   EQU   FSBERC                                                   03138000
FSBELI   EQU   FSBERC                                                   03139000
FSBMJRCD EQU   FSBSRCAT                                                 03140000
FSBXLCI  EQU   FSBXCODE                                                 03141000
FSBXFINS EQU   FSBXCODE                                                 03142000
FSBXNORM EQU   FSBXFSTS                                                 03143000
FSBSCODE EQU   FSBSYSRS                                                 03144000
FSBSPHSE EQU   FSBSYSRS                                                 03145000
FSBSERR  EQU   FSBSYSRS                                                 03146000
FSBCMD   EQU   FSBSEQ                                                   03147000
FSBDTRCE EQU   FSBFLAGS                                                 03148000
FSBASBTU EQU   FSBFLAGS                                                 03149000
FSBINPET EQU   FSBFLAGS                                                 03150000
FSBNONCB EQU   FSBFLAGS                                                 03151000
FSBLBIND EQU   FSBFLAGS                                                 03152000
FSBFFIND EQU   FSBFLAGS                                                 03153000
FSBACIND EQU   FSBFLAGS                                                 03154000
FSBRFIND EQU   FSBFLAGS                                                 03155000
FSBDAF   EQU   FSBCID+2                                                 03156000
FSBSAF   EQU   FSBCID                                                   03157000
FSBGATE  EQU   FSBFSBA                                                  03158000
FSBRSV02 EQU   FSBSFLGS                                                 03159000
FSBPGBUF EQU   FSBSFLGS                                                 03160000
FSBMNSDA EQU   FSBMNRCD                                                 03161000
FSBMNOA  EQU   FSBMNRCD                                                 03162000
FSBMNDIF EQU   FSBMNRCD                                                 03163000
FSBMNEOP EQU   FSBMNRCD                                                 03164000
FSBMNDNU EQU   FSBMNRCD                                                 03165000
FSBMNATN EQU   FSBMNRCD                                                 03166000
FSBMNRVI EQU   FSBMNRCD                                                 03167000
FSBMNELI EQU   FSBMNRCD                                                 03168000
FSBLNGTH EQU   FSBFSB+1                                                 03169000
FDBOFSET EQU   ISTFDB+10                                                03170000
FDBDATCT EQU   ISTFDB+8                                                 03171000
FDBDATAA EQU   ISTFDB+4                                                 03172000
FDBFDBA  EQU   ISTFDB                                                   03173000
FMCFLRSV EQU   FMCFLGB                                                  03174000
FMCFLGA8 EQU   FMCFLGB                                                  03175000
FMCCLRPH EQU   FMCVS1+45                                                03176000
FMCRSV0X EQU   FMCCVFLG                                                 03177000
FMCVYRPH EQU   FMCCVFLG                                                 03178000
FMCZV004 EQU   FMCVS1+40                                                03179000
FMCLOCK2 EQU   FMCVS1+36                                                03180000
@NM00095 EQU   FMCZFLG2                                                 03181000
FMCZF027 EQU   FMCZFLG2                                                 03182000
FMCZF026 EQU   FMCZFLG2                                                 03183000
FMCSEQ1B EQU   FMCSEQ1                                                  03184000
FMCSEQ1T EQU   FMCSEQ1                                                  03185000
FMCZX006 EQU   FMCVS1+33                                                03186000
FMCZX005 EQU   FMCVS1+32                                                03187000
FMCZX004 EQU   FMCVS1+31                                                03188000
FMCZX003 EQU   FMCVS1+30                                                03189000
FMCZX002 EQU   FMCVS1+29                                                03190000
FMCZX001 EQU   FMCVS1+28                                                03191000
FMCZV001 EQU   FMCVS1+24                                                03192000
FMCAWATQ EQU   FMCLCPAQ+1                                               03193000
@NM00094 EQU   FMCLCPAQ                                                 03194000
FMCLCPB2 EQU   FMCLCPBQ+1                                               03195000
FMCLCPB1 EQU   FMCLCPBQ                                                 03196000
FMCASCDQ EQU   FMCSHEAQ+1                                               03197000
@NM00093 EQU   FMCSHEAQ                                                 03198000
FMCSHEDQ EQU   FMCVS1+8                                                 03199000
FMCZFCSQ EQU   FMCVS1+6                                                 03200000
FMCZH001 EQU   FMCVS1+4                                                 03201000
FMCZF025 EQU   FMCZFLAG+3                                               03202000
FMCZF024 EQU   FMCZFLAG+3                                               03203000
FMCZF023 EQU   FMCZFLAG+3                                               03204000
FMCZF022 EQU   FMCZFLAG+3                                               03205000
FMCZF021 EQU   FMCZFLAG+3                                               03206000
FMCZF020 EQU   FMCZFLAG+3                                               03207000
FMCZF019 EQU   FMCZFLAG+3                                               03208000
FMCZF018 EQU   FMCZFLAG+3                                               03209000
FMCZF017 EQU   FMCZFLAG+2                                               03210000
FMCZF016 EQU   FMCZFLAG+2                                               03211000
FMCZF015 EQU   FMCZFLAG+2                                               03212000
FMCZF014 EQU   FMCZFLAG+2                                               03213000
FMCZF013 EQU   FMCZFLAG+2                                               03214000
FMCZF012 EQU   FMCZFLAG+2                                               03215000
FMCZF011 EQU   FMCZFLAG+2                                               03216000
FMCZF010 EQU   FMCZFLAG+2                                               03217000
FMCZF00F EQU   FMCZFLAG+1                                               03218000
FMCZF00E EQU   FMCZFLAG+1                                               03219000
FMCZF00D EQU   FMCZFLAG+1                                               03220000
FMCZF00C EQU   FMCZFLAG+1                                               03221000
FMCZF00B EQU   FMCZFLAG+1                                               03222000
FMCRSV10 EQU   FMCZFLAG+1                                               03223000
FMCZF009 EQU   FMCZFLAG+1                                               03224000
FMCZFD06 EQU   FMCZF006+1                                               03225000
FMCZFC06 EQU   FMCZF006                                                 03226000
FMCZFB06 EQU   FMCZF006                                                 03227000
FMCZFA06 EQU   FMCZF006                                                 03228000
FMCZF005 EQU   FMCZFLAG                                                 03229000
FMCZF004 EQU   FMCZFLAG                                                 03230000
FMCZF003 EQU   FMCZFLAG                                                 03231000
FMCZF002 EQU   FMCZFLAG                                                 03232000
FMCZF001 EQU   FMCZFLAG                                                 03233000
FMCFRESA EQU   ISTFMCB+228                                              03234000
FMCSCSQN EQU   FMCSNCTL+2                                               03235000
FMCSCCTL EQU   FMCSNCTL+1                                               03236000
FMCSTCTL EQU   FMCSCFLG                                                 03237000
FMCSCCLO EQU   FMCSCFLG                                                 03238000
FMCAPRO  EQU   FMCSCFLG                                                 03239000
FMCLURO  EQU   FMCSCFLG                                                 03240000
FMCOBSAC EQU   FMCSCFLG                                                 03241000
FMCIBSAC EQU   FMCSCFLG                                                 03242000
FMCFBXM  EQU   FMCZV002                                                 03243000
FMCASEGQ EQU   ISTFMCB+212                                              03244000
FMCRDTPT EQU   ISTFMCB+208                                              03245000
FMCLOCK  EQU   ISTFMCB+204                                              03246000
FMCSEGD  EQU   FMCSSEGQ                                                 03247000
FMCRSPLM EQU   ISTFMCB+198                                              03248000
FMCPSTRS EQU   ISTFMCB+196                                              03249000
@NM00092 EQU   FMCRRESP                                                 03250000
FMCTSLHA EQU   FMCRRESP                                                 03251000
FMCFRRN  EQU   FMCRRESP                                                 03252000
FMCFME   EQU   FMCRRESP                                                 03253000
FMCFEX   EQU   FMCRRESP                                                 03254000
FMCFPE   EQU   FMCRRESP                                                 03255000
FMCCTLB  EQU   ISTFMCB+194                                              03256000
FMCBSQNO EQU   FMCCLSEQ+2                                               03257000
FMCTSQNO EQU   FMCCLSEQ                                                 03258000
FMCOBPRG EQU   FMCMODEB                                                 03259000
FMCIBPRG EQU   FMCMODEB                                                 03260000
FMCRESOT EQU   FMCMODEB                                                 03261000
FMCRSTSR EQU   FMCMODEB                                                 03262000
FMCLUQ   EQU   FMCMODEB                                                 03263000
FMCAPQ   EQU   FMCMODEB                                                 03264000
FMCHOLD  EQU   FMCMODEB                                                 03265000
FMCIPSEQ EQU   ISTFMCB+188                                              03266000
FMCLUSTR EQU   ISTFMCB+187                                              03267000
FMCRSV87 EQU   FMCSTAT2                                                 03268000
FMCSEQI  EQU   FMCSTAT2                                                 03269000
FMCCPIP  EQU   FMCSTAT2                                                 03270000
FMCALIPR EQU   FMCSTAT2                                                 03271000
FMCIAIO  EQU   FMCSTAT2                                                 03272000
FMCZF00A EQU   FMCSTAT2                                                 03273000
FMCVPIP  EQU   FMCSTAT2                                                 03274000
FMCBHSET EQU   ISTFMCB+185                                              03275000
FMCPRMRC EQU   FMCCLEXT+20                                              03276000
FMCRSV89 EQU   FMCPSTAT                                                 03277000
FMCPCLSD EQU   FMCPSTAT                                                 03278000
FMCDDOCD EQU   FMCPSTAT                                                 03279000
FMCIDVFD EQU   FMCPSTAT                                                 03280000
FMCELKST EQU   FMCPSTAT                                                 03281000
FMCRSV88 EQU   FMCPSCMD                                                 03282000
FMCRDBLK EQU   FMCPSCMD                                                 03283000
FMCDSEOC EQU   FMCPSCMD                                                 03284000
FMCPURGE EQU   FMCPSCMD                                                 03285000
FMCRESTI EQU   FMCPSCMD                                                 03286000
FMCCNTCT EQU   FMCPSCMD                                                 03287000
FMCINVT  EQU   FMCPSCMD                                                 03288000
FMCFLGB7 EQU   FMCFLGCL                                                 03289000
FMCFLGB6 EQU   FMCFLGCL                                                 03290000
FMCFLGB5 EQU   FMCFLGCL                                                 03291000
FMCFLGB4 EQU   FMCFLGCL                                                 03292000
FMCFLGB3 EQU   FMCFLGCL                                                 03293000
FMCFLGB2 EQU   FMCFLGCL                                                 03294000
FMCFLGB1 EQU   FMCFLGCL                                                 03295000
FMCFLGB0 EQU   FMCFLGCL                                                 03296000
FMCFLGA7 EQU   FMCFLGA                                                  03297000
FMCFLGA6 EQU   FMCFLGA                                                  03298000
FMCFLGA3 EQU   FMCFLGA                                                  03299000
FMCFLGA2 EQU   FMCFLGA                                                  03300000
FMCFBPTR EQU   FMCFBA+1                                                 03301000
FMCFBRSV EQU   FMCFBA                                                   03302000
FMCRPLPT EQU   FMCRPLA+1                                                03303000
FMCRPLRS EQU   FMCRPLA                                                  03304000
FMCPRCLS EQU   FMCCVAL                                                  03305000
FMCIBCE  EQU   FMCCVAL                                                  03306000
FMCONLY  EQU   FMCOBCE                                                  03307000
FMCLAST  EQU   FMCOBCE                                                  03308000
FMCMIDLE EQU   FMCOBCE                                                  03309000
FMCFIRST EQU   FMCOBCE                                                  03310000
FMCCPCNT EQU   FMCPACPC                                                 03311000
FMCMPCNT EQU   FMCPACEM                                                 03312000
FMCNPCNT EQU   FMCPACEN                                                 03313000
FMCCONF  EQU   FMCSSTAT                                                 03314000
FMCPURCH EQU   FMCSSTAT                                                 03315000
FMCNSALU EQU   FMCSSTAT                                                 03316000
FMCBIP   EQU   FMCSSTAT                                                 03317000
FMCSDTR  EQU   FMCSSTAT                                                 03318000
FMCUIPI  EQU   FMCSSTAT                                                 03319000
FMCCIPI  EQU   FMCSSTAT                                                 03320000
FMCSNBI  EQU   FMCSSTAT                                                 03321000
FMCRVD01 EQU   ISTFMCB+158                                              03322000
FMCISSN  EQU   ISTFMCB+156                                              03323000
FMCOASN  EQU   FMCNXOSC                                                 03324000
FMCOSSN  EQU   FMCNXCFM                                                 03325000
FMCSIP   EQU   FMCSIPA                                                  03326000
FMCEXLST EQU   ISTFMCB+144                                              03327000
FMCPAB5  EQU   ISTFMCB+128                                              03328000
FMCPAB4  EQU   ISTFMCB+112                                              03329000
FMCPAB3  EQU   ISTFMCB+96                                               03330000
FMCPAB2  EQU   ISTFMCB+80                                               03331000
FMCPAB1  EQU   ISTFMCB+64                                               03332000
FMCFASYA EQU   ISTFMCB+60                                               03333000
FMCPROCD EQU   ISTFMCB+48                                               03334000
FMCVWT   EQU   ISTFMCB+44                                               03335000
FMCRPLH  EQU   ISTFMCB+40                                               03336000
FMCBUFNB EQU   FMCCMPS1+2                                               03337000
FMCBUFLM EQU   FMCCMPS1                                                 03338000
FMCDEBA  EQU   ISTFMCB+32                                               03339000
@NM00091 EQU   FMCCMDFL                                                 03340000
FMCSNA   EQU   FMCCMDFL                                                 03341000
FMCVSNA  EQU   FMCCMDFL                                                 03342000
FMCCMDR  EQU   FMCCMDFL                                                 03343000
@NM00090 EQU   ISTFMCB+30                                               03344000
@NM00089 EQU   FMCSTAT1                                                 03345000
FMCLTCLS EQU   FMCSTAT1                                                 03346000
FMCHPURG EQU   FMCSTAT1                                                 03347000
FMCVSP2  EQU   FMCSTAT1                                                 03348000
FMCVSP1  EQU   FMCSTAT                                                  03349000
FMCLTEAS EQU   FMCSTAT                                                  03350000
FMCDAPT  EQU   FMCSTAT                                                  03351000
FMCPRMTE EQU   FMCSTAT                                                  03352000
FMCPRMTR EQU   FMCSTAT                                                  03353000
FMCUSFLD EQU   ISTFMCB+24                                               03354000
FMCFMCBA EQU   ISTFMCB+20                                               03355000
FMCDVTA  EQU   ISTFMCB+12                                               03356000
FMCTSKID EQU   ISTFMCB+8                                                03357000
FMCNXTCB EQU   ISTFMCB+4                                                03358000
FMCLNGTH EQU   ISTFMCB+1                                                03359000
DNCZC001 EQU   DNCOS+40                                                 03360000
DNCLOCK  EQU   DNCOS+36                                                 03361000
DNCZV005 EQU   DNCOS+32                                                 03362000
DNCZV004 EQU   DNCOS+28                                                 03363000
DNCZV003 EQU   DNCOS+24                                                 03364000
DNCZV002 EQU   DNCOS+21                                                 03365000
DNCZX001 EQU   DNCOS+20                                                 03366000
DNCZV001 EQU   DNCOS+17                                                 03367000
DNCZX003 EQU   DNCOS+16                                                 03368000
DNCZV000 EQU   DNCOS+12                                                 03369000
DNCSESCQ EQU   DNCOS+8                                                  03370000
DNCSESIQ EQU   DNCOS+4                                                  03371000
DNCACIP  EQU   DNCBSCED+1                                               03372000
DNCLICP  EQU   DNCBSCED                                                 03373000
DNCZF008 EQU   DNCZFLGS+1                                               03374000
DNCZPSRD EQU   DNCZFLGS+1                                               03375000
DNCPSOL  EQU   DNCZFLGS+1                                               03376000
DNCZF007 EQU   DNCZFLGS+1                                               03377000
DNCZF006 EQU   DNCZFLGS+1                                               03378000
DNCZF005 EQU   DNCZFLGS+1                                               03379000
DNCZF004 EQU   DNCZFLGS+1                                               03380000
DNCZF003 EQU   DNCZFLGS                                                 03381000
DNCZF002 EQU   DNCZFLGS                                                 03382000
DNCZRSCH EQU   DNCZFLGS                                                 03383000
DNCDISC  EQU   DNCZFLGS                                                 03384000
DNCCONT  EQU   DNCZFLGS                                                 03385000
DNCINVIT EQU   DNCZFLGS                                                 03386000
DNCSESS  EQU   DNCZFLGS                                                 03387000
DNCZF001 EQU   DNCZFLGS                                                 03388000
DNCMODE  EQU   ISTDNCB+49                                               03389000
DNCBHSET EQU   ISTDNCB+48                                               03390000
PROSRDEF EQU   PROSETM4                                                 03391000
PRORSV47 EQU   PROSETM4                                                 03392000
PROSCON  EQU   PROSETM4                                                 03393000
PRORSV46 EQU   PROSETM3                                                 03394000
PROSMONT EQU   PROSETM3                                                 03395000
PRORSV45 EQU   PROSETM3                                                 03396000
PROSNTO  EQU   PROSETM3                                                 03397000
PRORSV44 EQU   PROSETM3                                                 03398000
PRORSV43 EQU   PROSETM2                                                 03399000
PROSNTFL EQU   PROSETM2                                                 03400000
PRORSV42 EQU   PROSETM2                                                 03401000
PRORSV41 EQU   PROPROCS                                                 03402000
PROMODC  EQU   PROPROC4                                                 03403000
PROMODT  EQU   PROPROC4                                                 03404000
PROMODM  EQU   PROPROC4                                                 03405000
PROMODB  EQU   PROPROC4                                                 03406000
PRORSV14 EQU   PROPROC4                                                 03407000
PRORSV13 EQU   PROPROC4                                                 03408000
PRORSV12 EQU   PROPROC4                                                 03409000
PROEIB   EQU   PROPROC4                                                 03410000
PRORSV11 EQU   PROPROC3                                                 03411000
PROMONT2 EQU   PROPROC3                                                 03412000
PROMONIT EQU   PROPROC3                                                 03413000
PROSUBLK EQU   PROPROC3                                                 03414000
PRONTO   EQU   PROPROC3                                                 03415000
PROLGIN  EQU   PROPROC3                                                 03416000
PROERPI  EQU   PROPROC3                                                 03417000
PRORSV07 EQU   PROPROC3                                                 03418000
PROCFTX  EQU   PROPROC2                                                 03419000
PROEMLC  EQU   PROPROC2                                                 03420000
PRONTFL  EQU   PROPROC2                                                 03421000
PRORSV05 EQU   PROPROC2                                                 03422000
PRORSV04 EQU   PROPROC2                                                 03423000
PROLGOT  EQU   PROPROC2                                                 03424000
PROERPO  EQU   PROPROC2                                                 03425000
PRORSV03 EQU   PROPROC2                                                 03426000
PRORPLC  EQU   PROPROC1                                                 03427000
PROCS    EQU   PROPROC1                                                 03428000
PROCA    EQU   PROPROC1                                                 03429000
PRORESPX EQU   PROPROC1                                                 03430000
PRODFASY EQU   PROPROC1                                                 03431000
PROXPOPT EQU   PROPROC1                                                 03432000
PROTRUNC EQU   PROPROC1                                                 03433000
PROASYIP EQU   PROPROC1                                                 03434000
NCBRSV01 EQU   ISTNCB+46                                                03435000
NCBSWDAF EQU   ISTNCB+44                                                03436000
NCBDEVCH EQU   ISTNCB+36                                                03437000
NCBFMCBP EQU   ISTNCB+32                                                03438000
NCBLTRC  EQU   ISTNCB+30                                                03439000
NCBRVPT1 EQU   ISTNCB+28                                                03440000
NCBNMLLN EQU   NCBFLAGS+3                                               03441000
@NM00088 EQU   NCBFLAG1                                                 03442000
NCBFORCE EQU   NCBFLAG1                                                 03443000
NCBTTF   EQU   NCBFLAG1                                                 03444000
NCBRSYNC EQU   NCBFLAG1                                                 03445000
NCBRSTRT EQU   NCBFLAG1                                                 03446000
NCBCONF  EQU   NCBFLAG1                                                 03447000
NCBSNAI  EQU   NCBFLAG1                                                 03448000
NCBFLTIO EQU   NCBFTRIO                                                 03449000
NCBCSTAT EQU   NCBFLAGS                                                 03450000
NCBNCSL  EQU   ISTNCB+22                                                03451000
NCBNCBA  EQU   ISTNCB+20                                                03452000
NCBFMCBA EQU   ISTNCB+16                                                03453000
NCBNSNA  EQU   ISTNCB+12                                                03454000
NCBTSKID EQU   ISTNCB+8                                                 03455000
NCBRDTE  EQU   ISTNCB+4                                                 03456000
NCBLNGTH EQU   ISTNCB+1                                                 03457000
NCBTYPE  EQU   ISTNCB                                                   03458000
DEVRSV03 EQU   ISTDEVCH+5                                               03459000
DEVPHYSA EQU   ISTDEVCH+4                                               03460000
DEVCSLPN EQU   DEVCHAR3                                                 03461000
DEVCSTCL EQU   DEVCHAR3                                                 03462000
DEVCCHEK EQU   DEVCHAR3                                                 03463000
DEVCATTN EQU   DEVCHAR3                                                 03464000
DEVCSWL  EQU   DEVFCCTL                                                 03465000
DEVCRVB  EQU   DEVFCCTL                                                 03466000
DEVCSSL  EQU   DEVFCCTL                                                 03467000
DEVCBSC  EQU   DEVFCCTL                                                 03468000
DEVMCODE EQU   ISTDEVCH+2                                               03469000
DEVCHAR2 EQU   DEVTCODE                                                 03470000
DEVRSV01 EQU   DEVCHAR                                                  03471000
DEVCCTL  EQU   DEVCHAR                                                  03472000
DEVNNSPT EQU   DEVCHAR                                                  03473000
DEVSPS   EQU   DEVCHAR                                                  03474000
DEVSUBND EQU   DEVCHAR                                                  03475000
DEVCONVR EQU   DEVCHAR                                                  03476000
DEVOTPUT EQU   DEVCHAR                                                  03477000
DEVINPUT EQU   DEVCHAR                                                  03478000
CRACHAIN EQU   ISTCRA+928                                               03479000
CRARSV02 EQU   ISTCRA+924                                               03480000
CRARSV01 EQU   ISTCRA+920                                               03481000
CRABFTBA EQU   CRABUFA                                                  03482000
CRAMASK  EQU   CRASVC+64                                                03483000
CRAHSIZ  EQU   CRASVC+60                                                03484000
CRAASCRR EQU   CRASVC                                                   03485000
CRAPSS   EQU   ISTCRA+160                                               03486000
CRARPH   EQU   ISTCRA+52                                                03487000
CRALAPTR EQU   CRABASIC+48                                              03488000
CRAL9PTR EQU   CRABASIC+44                                              03489000
CRAL7PTR EQU   CRABASIC+36                                              03490000
CRAL6PTR EQU   CRABASIC+32                                              03491000
CRAL4PTR EQU   CRABASIC+24                                              03492000
CRAL3PTR EQU   CRABASIC+20                                              03493000
CRAL2PTR EQU   CRABASIC+16                                              03494000
CRAL1PTR EQU   CRABASIC+12                                              03495000
CRALEV01 EQU   CRALKACT+3                                               03496000
CRALEV02 EQU   CRALKACT+3                                               03497000
CRALEV03 EQU   CRALKACT+3                                               03498000
CRALEV04 EQU   CRALKACT+3                                               03499000
CRALEV05 EQU   CRALKACT+3                                               03500000
CRALEV06 EQU   CRALKACT+3                                               03501000
CRALEV07 EQU   CRALKACT+3                                               03502000
CRALEV08 EQU   CRALKACT+3                                               03503000
CRALEV09 EQU   CRALKACT+2                                               03504000
CRALEV10 EQU   CRALKACT+2                                               03505000
CRALEV11 EQU   CRALKACT+2                                               03506000
CRALEV12 EQU   CRALKACT+2                                               03507000
CRALEV13 EQU   CRALKACT+2                                               03508000
CRALEV14 EQU   CRALKACT+2                                               03509000
CRALEV15 EQU   CRALKACT+2                                               03510000
CRALEV16 EQU   CRALKACT+2                                               03511000
CRALEV17 EQU   CRALKACT+1                                               03512000
CRALEV18 EQU   CRALKACT+1                                               03513000
CRALEV19 EQU   CRALKACT+1                                               03514000
CRALEV20 EQU   CRALKACT+1                                               03515000
CRALEV21 EQU   CRALKACT+1                                               03516000
CRALEV22 EQU   CRALKACT+1                                               03517000
CRALEV23 EQU   CRALKACT+1                                               03518000
CRALEV24 EQU   CRALKACT+1                                               03519000
CRALEV25 EQU   CRALKACT                                                 03520000
CRALEV26 EQU   CRALKACT                                                 03521000
CRALEV27 EQU   CRALKACT                                                 03522000
CRALEV28 EQU   CRALKACT                                                 03523000
CRALEV29 EQU   CRALKACT                                                 03524000
CRALEV30 EQU   CRALKACT                                                 03525000
CRALEV31 EQU   CRALKACT                                                 03526000
CRALEV32 EQU   CRALKACT                                                 03527000
@NM00087 EQU   ISTAPCRR+137                                             03528000
@NM00086 EQU   APC57FLG                                                 03529000
APCNREL  EQU   APC57FLG                                                 03530000
APCRECRA EQU   APC57FLG                                                 03531000
@NM00085 EQU   APC54FLG                                                 03532000
APCRLST  EQU   APC54FLG                                                 03533000
APCPR153 EQU   APC53FLG                                                 03534000
@NM00084 EQU   APC52FLG                                                 03535000
APCWKF   EQU   APC52FLG                                                 03536000
APCNWF   EQU   APC52FLG                                                 03537000
APCRDQ   EQU   APC52FLG                                                 03538000
APCQENQ  EQU   APC52FLG                                                 03539000
APCSMSR  EQU   APC52FLG                                                 03540000
APCCKRQ  EQU   APC52FLG                                                 03541000
@NM00083 EQU   APC31FLG                                                 03542000
APCSORT  EQU   APC31FLG                                                 03543000
APCRESCH EQU   APC31FLG                                                 03544000
APCTPXIT EQU   APC31FLG                                                 03545000
APCSWTWD EQU   ISTAPCRR+128                                             03546000
APCSAV2  EQU   ISTAPCRR+124                                             03547000
APCSAV1  EQU   ISTAPCRR+120                                             03548000
APCRETCD EQU   APCCOMF+2                                                03549000
@NM00082 EQU   APCCOMF1+1                                               03550000
APCZLBER EQU   APCCOMF1                                                 03551000
APCEXIT  EQU   APCCOMF1                                                 03552000
APCRELR  EQU   APCCOMF1                                                 03553000
APCIRB2  EQU   APCCOMF1                                                 03554000
APCIRB1  EQU   APCCOMF1                                                 03555000
APCSMCR  EQU   APCCOMF1                                                 03556000
APCUETSK EQU   APCCOMF1                                                 03557000
APCSSTSK EQU   APCCOMF1                                                 03558000
APCESTAL EQU   APCSAVE                                                  03559000
APCFRRPM EQU   ISTAPCRR+40                                              03560000
APCQWFO  EQU   ISTAPCRR+36                                              03561000
APCPABSV EQU   ISTAPCRR+32                                              03562000
APCRTRN  EQU   ISTAPCRR+28                                              03563000
APCTCBA  EQU   ISTAPCRR+24                                              03564000
APCPSTA  EQU   ISTAPCRR+20                                              03565000
@NM00081 EQU   APCRFLG+1                                                03566000
APC31R   EQU   APCRFLG                                                  03567000
APC58R   EQU   APCRFLG                                                  03568000
APC57R   EQU   APCRFLG                                                  03569000
APC56R   EQU   APCRFLG                                                  03570000
APC54R   EQU   APCRFLG                                                  03571000
APC53R   EQU   APCRFLG                                                  03572000
APC52R   EQU   APCRFLG                                                  03573000
APC51R   EQU   APCRFLG                                                  03574000
@NM00080 EQU   APCATFLG+1                                               03575000
APC31E   EQU   APCATFLG                                                 03576000
APC58E   EQU   APCATFLG                                                 03577000
APC57E   EQU   APCATFLG                                                 03578000
APC56E   EQU   APCATFLG                                                 03579000
APC54E   EQU   APCATFLG                                                 03580000
APC53E   EQU   APCATFLG                                                 03581000
APC52E   EQU   APCATFLG                                                 03582000
APC51E   EQU   APCATFLG                                                 03583000
APCHDRSV EQU   ISTAPCRR                                                 03584000
ASCPSREG EQU   ISTASCRR+44                                              03585000
ASCUSR01 EQU   ASCUSRGS+12                                              03586000
ASCUSR00 EQU   ASCUSRGS+8                                               03587000
ASCUSR15 EQU   ASCUSRGS+4                                               03588000
ASCUSR14 EQU   ASCUSRGS                                                 03589000
ASCETRYA EQU   ISTASCRR+24                                              03590000
ASCKEY   EQU   ISTASCRR+23                                              03591000
ASCAUDIT EQU   ASCFLG3                                                  03592000
ASCFBDUD EQU   ASCFLG3                                                  03593000
ASCLLKF  EQU   ASCFLG3                                                  03594000
ASCKEYF  EQU   ASCFLG3                                                  03595000
ASCFBDAL EQU   ASCFLG3                                                  03596000
ASCFSRGT EQU   ASCFLG3                                                  03597000
ASCICR   EQU   ASCFLG2                                                  03598000
ASCFSRIC EQU   ASCFLG2                                                  03599000
ASCFBDIC EQU   ASCFLG2                                                  03600000
ASCFBAIC EQU   ASCFLG2                                                  03601000
ASCPASTR EQU   ASCFLG1                                                  03602000
ASCFSR   EQU   ASCFLG1                                                  03603000
ASCFBD   EQU   ASCFLG1                                                  03604000
ASCFBA   EQU   ASCFLG1                                                  03605000
ASCPFCRR EQU   ISTASCRR                                                 03606000
ZCRRU    EQU   ZCRRHRU+3                                                03607000
ZCRRH    EQU   ZCRRHRU                                                  03608000
ZCRWORDA EQU   ISTZCRR+477                                              03609000
ZCRCMNRC EQU   ISTZCRR+476                                              03610000
ZCRRSV97 EQU   ZCRENTER+18                                              03611000
ZCREIC2B EQU   ZCRENTER+18                                              03612000
ZCREAC2B EQU   ZCRENTER+18                                              03613000
ZCRELCAB EQU   ZCRENTER+18                                              03614000
ZCREDCMF EQU   ZCRENTER+18                                              03615000
ZCREBCIF EQU   ZCRENTER+18                                              03616000
ZCREICSG EQU   ZCRENTER+18                                              03617000
ZCREDCK0 EQU   ZCRENTER+18                                              03618000
ZCRECFY0 EQU   ZCRENTER+17                                              03619000
ZCREKCCB EQU   ZCRENTER+17                                              03620000
ZCREDCNB EQU   ZCRENTER+17                                              03621000
ZCREICOE EQU   ZCRENTER+17                                              03622000
ZCREBCNB EQU   ZCRENTER+17                                              03623000
ZCREBC0L EQU   ZCRENTER+17                                              03624000
ZCREBCAL EQU   ZCRENTER+17                                              03625000
ZCREDCQR EQU   ZCRENTER+17                                              03626000
ZCREDCPR EQU   ZCRENTER+16                                              03627000
ZCREBCSB EQU   ZCRENTER+16                                              03628000
ZCREAC1R EQU   ZCRENTER+16                                              03629000
ZCRECCCI EQU   ZCRENTER+16                                              03630000
ZCRECCAI EQU   ZCRENTER+16                                              03631000
ZCRECCBI EQU   ZCRENTER+16                                              03632000
ZCREBCAR EQU   ZCRENTER+16                                              03633000
ZCREBCDR EQU   ZCRENTER+16                                              03634000
ZCREBCBR EQU   ZCRENTER+15                                              03635000
ZCREDCXR EQU   ZCRENTER+15                                              03636000
ZCREDCWB EQU   ZCRENTER+15                                              03637000
ZCREDCWR EQU   ZCRENTER+15                                              03638000
ZCREKCCN EQU   ZCRENTER+15                                              03639000
ZCREKCBN EQU   ZCRENTER+15                                              03640000
ZCREKCBB EQU   ZCRENTER+15                                              03641000
ZCREJC0B EQU   ZCRENTER+15                                              03642000
ZCREJCDB EQU   ZCRENTER+14                                              03643000
ZCREJCCB EQU   ZCRENTER+14                                              03644000
ZCREJCBB EQU   ZCRENTER+14                                              03645000
ZCREJCAB EQU   ZCRENTER+14                                              03646000
ZCREIC1B EQU   ZCRENTER+14                                              03647000
ZCREIC0B EQU   ZCRENTER+14                                              03648000
ZCREICX0 EQU   ZCRENTER+14                                              03649000
ZCREICWB EQU   ZCRENTER+14                                              03650000
ZCREICVB EQU   ZCRENTER+13                                              03651000
ZCREICUB EQU   ZCRENTER+13                                              03652000
ZCREICTB EQU   ZCRENTER+13                                              03653000
ZCREICSC EQU   ZCRENTER+13                                              03654000
ZCREICSB EQU   ZCRENTER+13                                              03655000
ZCREICRB EQU   ZCRENTER+13                                              03656000
ZCREICQB EQU   ZCRENTER+13                                              03657000
ZCREICQA EQU   ZCRENTER+13                                              03658000
ZCREICOB EQU   ZCRENTER+12                                              03659000
ZCREICOA EQU   ZCRENTER+12                                              03660000
ZCREICNB EQU   ZCRENTER+12                                              03661000
ZCREICNA EQU   ZCRENTER+12                                              03662000
ZCREICMB EQU   ZCRENTER+12                                              03663000
ZCREICLB EQU   ZCRENTER+12                                              03664000
ZCREICKG EQU   ZCRENTER+12                                              03665000
ZCREICKE EQU   ZCRENTER+12                                              03666000
ZCREICKB EQU   ZCRENTER+11                                              03667000
ZCREICJB EQU   ZCRENTER+11                                              03668000
ZCREICID EQU   ZCRENTER+11                                              03669000
ZCREICIB EQU   ZCRENTER+11                                              03670000
ZCREICHB EQU   ZCRENTER+11                                              03671000
ZCREICGB EQU   ZCRENTER+11                                              03672000
ZCREICEB EQU   ZCRENTER+11                                              03673000
ZCREICDB EQU   ZCRENTER+11                                              03674000
ZCREICCI EQU   ZCRENTER+10                                              03675000
ZCREICCB EQU   ZCRENTER+10                                              03676000
ZCREICBI EQU   ZCRENTER+10                                              03677000
ZCREICBB EQU   ZCRENTER+10                                              03678000
ZCREICAB EQU   ZCRENTER+10                                              03679000
ZCREICAA EQU   ZCRENTER+10                                              03680000
ZCREHCAN EQU   ZCRENTER+10                                              03681000
ZCREGC0B EQU   ZCRENTER+10                                              03682000
ZCREGC0A EQU   ZCRENTER+9                                               03683000
ZCREGCLA EQU   ZCRENTER+9                                               03684000
ZCREGCEB EQU   ZCRENTER+9                                               03685000
ZCREGCDB EQU   ZCRENTER+9                                               03686000
@NM00079 EQU   ZCRENTER+9                                               03687000
ZCREGCBB EQU   ZCRENTER+9                                               03688000
ZCREGCAB EQU   ZCRENTER+9                                               03689000
ZCREFCEB EQU   ZCRENTER+9                                               03690000
ZCREFCEA EQU   ZCRENTER+8                                               03691000
ZCREECTA EQU   ZCRENTER+8                                               03692000
ZCREECEA EQU   ZCRENTER+8                                               03693000
ZCREECDA EQU   ZCRENTER+8                                               03694000
ZCREECCB EQU   ZCRENTER+8                                               03695000
ZCREECCA EQU   ZCRENTER+8                                               03696000
ZCREECBB EQU   ZCRENTER+8                                               03697000
ZCREECBA EQU   ZCRENTER+8                                               03698000
ZCREDCMB EQU   ZCRENTER+7                                               03699000
ZCREDCL0 EQU   ZCRENTER+7                                               03700000
ZCREDCKB EQU   ZCRENTER+7                                               03701000
ZCREDCKA EQU   ZCRENTER+7                                               03702000
ZCREDCJ0 EQU   ZCRENTER+7                                               03703000
ZCREDCI0 EQU   ZCRENTER+7                                               03704000
ZCREDCH0 EQU   ZCRENTER+7                                               03705000
ZCREDCF0 EQU   ZCRENTER+7                                               03706000
ZCREDCE0 EQU   ZCRENTER+6                                               03707000
ZCREDCD0 EQU   ZCRENTER+6                                               03708000
ZCREDCC0 EQU   ZCRENTER+6                                               03709000
ZCREDCB0 EQU   ZCRENTER+6                                               03710000
ZCREDCA0 EQU   ZCRENTER+6                                               03711000
ZCRECC2B EQU   ZCRENTER+6                                               03712000
ZCRECC1B EQU   ZCRENTER+6                                               03713000
ZCRECC1A EQU   ZCRENTER+6                                               03714000
ZCRECC0B EQU   ZCRENTER+5                                               03715000
ZCRECC0A EQU   ZCRENTER+5                                               03716000
ZCREBC0B EQU   ZCRENTER+5                                               03717000
ZCREBC0A EQU   ZCRENTER+5                                               03718000
ZCREBCZ0 EQU   ZCRENTER+5                                               03719000
ZCREBCY0 EQU   ZCRENTER+5                                               03720000
ZCREBCX0 EQU   ZCRENTER+5                                               03721000
ZCREBCXA EQU   ZCRENTER+5                                               03722000
ZCREBCSC EQU   ZCRENTER+4                                               03723000
ZCREBCRB EQU   ZCRENTER+4                                               03724000
ZCREBCRA EQU   ZCRENTER+4                                               03725000
ZCREBCQB EQU   ZCRENTER+4                                               03726000
ZCREBCPB EQU   ZCRENTER+4                                               03727000
ZCREBCOB EQU   ZCRENTER+4                                               03728000
ZCREBCNE EQU   ZCRENTER+4                                               03729000
ZCREBCND EQU   ZCRENTER+4                                               03730000
ZCREBCMB EQU   ZCRENTER+3                                               03731000
ZCREBCLB EQU   ZCRENTER+3                                               03732000
ZCREBCLA EQU   ZCRENTER+3                                               03733000
ZCREBCKB EQU   ZCRENTER+3                                               03734000
ZCREBCKA EQU   ZCRENTER+3                                               03735000
ZCREBCJB EQU   ZCRENTER+3                                               03736000
ZCREBCJA EQU   ZCRENTER+3                                               03737000
ZCREBCID EQU   ZCRENTER+3                                               03738000
ZCREBCIB EQU   ZCRENTER+2                                               03739000
ZCREBCIA EQU   ZCRENTER+2                                               03740000
ZCREBCHB EQU   ZCRENTER+2                                               03741000
ZCREBCHA EQU   ZCRENTER+2                                               03742000
ZCREBCGB EQU   ZCRENTER+2                                               03743000
ZCREBCGA EQU   ZCRENTER+2                                               03744000
ZCREBCFB EQU   ZCRENTER+2                                               03745000
ZCREBCFA EQU   ZCRENTER+2                                               03746000
ZCREBCEB EQU   ZCRENTER+1                                               03747000
ZCREBCDI EQU   ZCRENTER+1                                               03748000
ZCREBCCB EQU   ZCRENTER+1                                               03749000
ZCREBCBI EQU   ZCRENTER+1                                               03750000
ZCREBCBB EQU   ZCRENTER+1                                               03751000
ZCREBCBA EQU   ZCRENTER+1                                               03752000
ZCREBCAM EQU   ZCRENTER+1                                               03753000
ZCREBCAI EQU   ZCRENTER+1                                               03754000
ZCREBCAG EQU   ZCRENTER                                                 03755000
ZCREBCAE EQU   ZCRENTER                                                 03756000
ZCREBCAB EQU   ZCRENTER                                                 03757000
ZCREBCAA EQU   ZCRENTER                                                 03758000
ZCREAC1B EQU   ZCRENTER                                                 03759000
ZCREAC0B EQU   ZCRENTER                                                 03760000
ZCREAC0A EQU   ZCRENTER                                                 03761000
ZCREAC1A EQU   ZCRENTER                                                 03762000
ZCRTNAME EQU   ZCRAUDIT+1                                               03763000
ZCRTID   EQU   ZCRAUDIT                                                 03764000
ZCRREMIC EQU   ISTZCRR+436                                              03765000
ZCRSAVEZ EQU   ISTZCRR+196                                              03766000
ZCRDAFSV EQU   ZCRCIDSV+2                                               03767000
ZCRSAFSV EQU   ZCRCIDSV                                                 03768000
ZCRR13SV EQU   ISTZCRR+188                                              03769000
ZCRR2SV  EQU   ISTZCRR+184                                              03770000
ZCROPCDE EQU   ISTZCRR+183                                              03771000
ZCRPRMTC EQU   ISTZCRR+182                                              03772000
ZCRRCDSV EQU   ISTZCRR+181                                              03773000
ZCRAWQSW EQU   ISTZCRR+180                                              03774000
ZCRTOPQ  EQU   ISTZCRR+180                                              03775000
ZCRLSTFB EQU   ISTZCRR+180                                              03776000
ZCRXSCHD EQU   ISTZCRR+180                                              03777000
ZCRNXTEL EQU   ISTZCRR+180                                              03778000
ZCRSCANQ EQU   ISTZCRR+180                                              03779000
ZCRMOREL EQU   ISTZCRR+180                                              03780000
ZCRFBPRC EQU   ISTZCRR+180                                              03781000
ZCRFSBSV EQU   ISTZCRR+176                                              03782000
ZCRSVWK5 EQU   ZCRWKARA+16                                              03783000
ZCRSVWK4 EQU   ZCRWKARA+12                                              03784000
ZCRSVWK3 EQU   ZCRWKARA+8                                               03785000
ZCRSVWK2 EQU   ZCRWKARA+4                                               03786000
ZCRSVWK1 EQU   ZCRWKARA                                                 03787000
ZCRSVF25 EQU   ZCRSVRTN+96                                              03788000
ZCRSVF24 EQU   ZCRSVRTN+92                                              03789000
ZCRSVF23 EQU   ZCRSVRTN+88                                              03790000
ZCRSVF22 EQU   ZCRSVRTN+84                                              03791000
ZCRSVF21 EQU   ZCRSVRTN+80                                              03792000
ZCRSVF20 EQU   ZCRSVRTN+76                                              03793000
ZCRSVF19 EQU   ZCRSVRTN+72                                              03794000
ZCRSVF18 EQU   ZCRSVRTN+68                                              03795000
ZCRSVF17 EQU   ZCRSVRTN+64                                              03796000
ZCRSVF16 EQU   ZCRSVRTN+60                                              03797000
ZCRSVF15 EQU   ZCRSVRTN+56                                              03798000
ZCRSVF14 EQU   ZCRSVRTN+52                                              03799000
ZCRSVF13 EQU   ZCRSVRTN+48                                              03800000
ZCRSVF12 EQU   ZCRSVRTN+44                                              03801000
ZCRSVF11 EQU   ZCRSVRTN+40                                              03802000
ZCRSVF10 EQU   ZCRSVRTN+36                                              03803000
ZCRSVF9  EQU   ZCRSVRTN+32                                              03804000
ZCRSVF8  EQU   ZCRSVRTN+28                                              03805000
ZCRSVF7  EQU   ZCRSVRTN+24                                              03806000
ZCRSVF6  EQU   ZCRSVRTN+20                                              03807000
ZCRSVF5  EQU   ZCRSVRTN+16                                              03808000
ZCRSVF4  EQU   ZCRSVRTN+12                                              03809000
ZCRSVF3  EQU   ZCRSVRTN+8                                               03810000
ZCRSVF2  EQU   ZCRSVRTN+4                                               03811000
ZCRSVF1  EQU   ZCRSVRTN                                                 03812000
ZCRPVZB  EQU   ISTZCRR+52                                               03813000
ZCRZLB   EQU   ISTZCRR+48                                               03814000
ZCRBFPTR EQU   ISTZCRR+44                                               03815000
ZCRCCWA  EQU   ISTZCRR+40                                               03816000
ZCRPSW   EQU   ZCRPARMS+15                                              03817000
ZCRPCHAR EQU   ZCRPARMS+14                                              03818000
ZCRPRES2 EQU   ZCRPCOD2                                                 03819000
ZCRPMFGF EQU   ZCRPCOD2                                                 03820000
ZCRPFHDR EQU   ZCRPCOD2                                                 03821000
ZCRPPG2  EQU   ZCRPCOD2                                                 03822000
ZCRPRES  EQU   ZCRPCOD1                                                 03823000
ZCRPCFTX EQU   ZCRPCOD1                                                 03824000
ZCRPBUF  EQU   ZCRPCOD1                                                 03825000
ZCRPLSCB EQU   ZCRPCOD1                                                 03826000
ZCRPLSBQ EQU   ZCRPLSBF                                                 03827000
ZCRPFSB  EQU   ZCRPCOD1                                                 03828000
ZCRPLNG  EQU   ZCRPCOD1                                                 03829000
ZCRPPG   EQU   ZCRPCOD1                                                 03830000
ZCRDTODA EQU   ZCRDFRDA                                                 03831000
ZCRMLNG  EQU   ZCRPARMS+8                                               03832000
ZCRTBPTR EQU   ZCRPARMS+4                                               03833000
ZCRCBPTR EQU   ZCRFBPTR                                                 03834000
ZCRCRLCP EQU   ISTZCRR+20                                               03835000
@NM00078 EQU   ZCRSCPSW                                                 03836000
ZCRSKIPT EQU   ZCRSCPSW                                                 03837000
ZCRFSBWE EQU   ZCRSCPSW                                                 03838000
ZCRPRCMP EQU   ZCRSCPSW                                                 03839000
ZCRLREQ  EQU   ZCRSCPSW                                                 03840000
ZCRRJLCP EQU   ZCRSCPSW                                                 03841000
ZCRTPINV EQU   ZCRSCPSW                                                 03842000
ZCRTPEX  EQU   ZCRSCPSW                                                 03843000
@NM00077 EQU   ZCRIBPR                                                  03844000
ZCR3270R EQU   ZCRIBPR                                                  03845000
ZCR3270  EQU   ZCRIBPR                                                  03846000
ZCRLCPFD EQU   ZCRIBPR                                                  03847000
ZCRLCPFR EQU   ZCRIBPR                                                  03848000
ZCRRELK  EQU   ZCRIBPR                                                  03849000
ZCRERR   EQU   ZCRIBPR                                                  03850000
ZCRNOBUF EQU   ZCRIBPR                                                  03851000
@NM00076 EQU   ZCRPFLGS                                                 03852000
ZCRQAHED EQU   ZCRPFLGS                                                 03853000
ZCRF1RES EQU   ZCRGENSW                                                 03854000
ZCRBRIS  EQU   ZCRGENSW                                                 03855000
ZCRCLRBD EQU   ZCRGENSW                                                 03856000
ZCREXRES EQU   ZCRGENSW                                                 03857000
ZCRLCSYN EQU   ZCRGENSW                                                 03858000
ZCRRT06  EQU   ZCRGENSW                                                 03859000
ZCRTSW2  EQU   ZCRGENSW                                                 03860000
ZCRTSW1  EQU   ZCRGENSW                                                 03861000
ZCRINLCP EQU   ZCRFLGS3                                                 03862000
ZCRWRPTR EQU   ZCRFLGS3                                                 03863000
ZCRNOFRE EQU   ZCRFLGS3                                                 03864000
ZCREDRIV EQU   ZCRFLGS3                                                 03865000
ZCRDISC  EQU   ZCRFLGS3                                                 03866000
ZCRTPDIS EQU   ZCRFLGS3                                                 03867000
ZCRTPCON EQU   ZCRFLGS3                                                 03868000
ZCRTIC   EQU   ZCRFLGS3                                                 03869000
ZCRCNLXL EQU   ZCRRESET                                                 03870000
ZCRENDAN EQU   ZCRSWFLD                                                 03871000
ZCRENDXL EQU   ZCRSWFLD                                                 03872000
ZCRENDX  EQU   ZCRSWFLD                                                 03873000
ZCROB1   EQU   ZCRNDLCP                                                 03874000
ZCRENDPR EQU   ZCRSWFLD                                                 03875000
ZCREXTYP EQU   ZCRSWFLD                                                 03876000
ZCRSLCP  EQU   ZCRENDSH                                                 03877000
ZCRIF0E3 EQU   ZCRFLGS2                                                 03878000
ZCRIF0E2 EQU   ZCRFLGS2                                                 03879000
ZCRIF0E1 EQU   ZCRFLGS2                                                 03880000
ZCROB    EQU   ZCRFLGS2                                                 03881000
ZCRFMSED EQU   ZCRFLGS2                                                 03882000
ZCRSHEDI EQU   ZCRFLGS2                                                 03883000
ZCRLOCAL EQU   ZCRFLGS2                                                 03884000
ZCRFEXIT EQU   ZCRFLGS1                                                 03885000
ZCRUNSOL EQU   ZCRFLGS1                                                 03886000
ZCRENDLP EQU   ZCRFLGS1                                                 03887000
ZCRNRMEX EQU   ZCRFLGS1                                                 03888000
ZCRWAIT  EQU   ZCRFLGS1                                                 03889000
ZCRDEQSW EQU   ZCRFLGS1                                                 03890000
ZCRQUESW EQU   ZCRFLGS1                                                 03891000
ZCREXSW  EQU   ZCRFLGS1                                                 03892000
ZCRFRRA  EQU   ISTZCRR+8                                                03893000
ZCRCHAIN EQU   ISTZCRR+4                                                03894000
ZCRFLAG  EQU   ZCRCRR+3                                                 03895000
ZCRLEN   EQU   ZCRCRR+1                                                 03896000
ZCRID    EQU   ZCRCRR                                                   03897000
CCFRSVD1 EQU   CFCCRT                                                   03898000
CCFCR2   EQU   CFCCRT                                                   03899000
CCFCRP   EQU   CFCCRT                                                   03900000
CCFCR1   EQU   CFCCRT                                                   03901000
CCFCS2   EQU   CFCCRT                                                   03902000
CCFCS1   EQU   CFCCRT                                                   03903000
NCFRSVD  EQU   CFCNTRD                                                  03904000
NCFCR2   EQU   CFCNTRD                                                  03905000
NCFCRP   EQU   CFCNTRD                                                  03906000
NCFCR1   EQU   CFCNTRD                                                  03907000
NCFCS2   EQU   CFCNTRD                                                  03908000
NCFCS1   EQU   CFCNTRD                                                  03909000
PFCRSV01 EQU   ISTPFCRR+13                                              03910000
PFCFTA   EQU   ISTPFCRR+12                                              03911000
PFCRSV10 EQU   PFCCRR+1                                                 03912000
ZSAZTRAC EQU   ISTZSAVE+36                                              03913000
ZSAZSVVR EQU   ISTZSAVE+12                                              03914000
ZSAZSVRR EQU   ISTZSAVE+8                                               03915000
ZSAZSVFC EQU   ISTZSAVE+4                                               03916000
ZSAZACTV EQU   ZSAZSVMS                                                 03917000
LCPFTYPE EQU   LCPRPHA                                                  03918000
LCPRSTQH EQU   LCPLCCW                                                  03919000
LCPCLREP EQU   ISTLCPB+44                                               03920000
LCPUBFSB EQU   LCPFLCCW                                                 03921000
LCPRSV77 EQU   ISTLCPB+39                                               03922000
LCPLCCWC EQU   ISTLCPB+38                                               03923000
LCPRSV78 EQU   LCPFLG1                                                  03924000
LCPTRANS EQU   LCPFLG1                                                  03925000
LCPSTLB  EQU   LCPFLG1                                                  03926000
LCPREDRV EQU   LCPFLG1                                                  03927000
LCPDIRPT EQU   LCPFLG1                                                  03928000
LCPINTER EQU   LCPFLG1                                                  03929000
LCPRESET EQU   LCPFLG1                                                  03930000
LCPSTYPE EQU   ISTLCPB+36                                               03931000
LCPFSNCH EQU   ISTLCPB+34                                               03932000
LCPFOSN  EQU   ISTLCPB+32                                               03933000
LCPTLBAD EQU   ISTLCPB+28                                               03934000
LCPFDB2  EQU   LCPFDBA+1                                                03935000
LCPFDB1  EQU   LCPFDBA                                                  03936000
LCPLCCW1 EQU   ISTLCPB+12                                               03937000
LCPRRCNT EQU   LCPSEQ+1                                                 03938000
LCPRRCCT EQU   LCPSEQ                                                   03939000
LCPATOP  EQU   LCPFLAG2                                                 03940000
LCPFREE  EQU   LCPFLAG2                                                 03941000
LCPDSTAT EQU   LCPFLAG2                                                 03942000
LCPEXRES EQU   LCPFID0                                                  03943000
LCPZRIMM EQU   LCPTLBPI                                                 03944000
LCPRSTRT EQU   LCPFLAG2                                                 03945000
LCPASYN  EQU   LCPFLAG2                                                 03946000
LCPPRFLG EQU   LCPFLAG2                                                 03947000
LCPZMIRC EQU   LCPRUCNT                                                 03948000
LCPCHAI2 EQU   LCPCHAIN+1                                               03949000
LCPCHNG  EQU   LCPCHAI1                                                 03950000
LCPZRT0B EQU   LCPMNRCD                                                 03951000
LCPZRT0A EQU   LCPMNRCD                                                 03952000
LCPZRTL9 EQU   LCPZRT09                                                 03953000
LCPZRTL8 EQU   LCPZRT08                                                 03954000
LCPZRTL7 EQU   LCPZRT07                                                 03955000
LCPZRTL6 EQU   LCPZRT06                                                 03956000
LCPZRTL5 EQU   LCPZRT05                                                 03957000
LCPZRTL4 EQU   LCPZRT04                                                 03958000
LCPZRTL3 EQU   LCPZRT03                                                 03959000
LCPZRTL2 EQU   LCPZRT02                                                 03960000
LCPZRT01 EQU   LCPFLAGS                                                 03961000
LCPZRT00 EQU   LCPFLAGS                                                 03962000
LCCWDATA EQU   ISTLCCW+4                                                03963000
LCCWCNT  EQU   ISTLCCW+2                                                03964000
LCCWACI  EQU   LCCWFLAG                                                 03965000
LCCWRFI  EQU   LCCWFLAG                                                 03966000
LCCWPER  EQU   LCCWLSI                                                  03967000
LCCWIDAT EQU   LCCWFLAG                                                 03968000
LCCWNTVC EQU   LCCWFLAG                                                 03969000
LCCWCKPT EQU   LCCWFLAG                                                 03970000
LCCWCC   EQU   LCCWFLAG                                                 03971000
LCCWCD   EQU   LCCWFLAG                                                 03972000
LCCWTYPE EQU   LCCWCTL                                                  03973000
LCCWMODE EQU   LCCWCTL                                                  03974000
LCCWSOP  EQU   LCCWRWOP                                                 03975000
@NM00075 EQU   LCCWRWOP                                                 03976000
LCCWSD   EQU   LCCWOP                                                   03977000
LCCWSI   EQU   LCCWOP                                                   03978000
CRRRVPT5 EQU   CRRSAREA+316                                             03979000
CRRRVPT4 EQU   CRRSAREA+312                                             03980000
CRRRVPT3 EQU   CRRSAREA+308                                             03981000
CRRRVPT2 EQU   CRRSAREA+304                                             03982000
CRRRVPT1 EQU   CRRSAREA+300                                             03983000
CRRRVCR2 EQU   CRRSAREA+292                                             03984000
CRRRVCR1 EQU   CRRSAREA+291                                             03985000
CRRXFNCD EQU   CRRSAREA+290                                             03986000
CRRLDOCT EQU   CRRSAREA+288                                             03987000
CRRBTLEN EQU   CRRSAREA+284                                             03988000
CRRBLEN  EQU   CRRSAREA+282                                             03989000
CRRBRTCD EQU   CRRSAREA+281                                             03990000
@NM00074 EQU   CRRBFLGS                                                 03991000
CRRBFLG1 EQU   CRRBFLGS                                                 03992000
CRRBLDAD EQU   CRRSAREA+276                                             03993000
CRRBARAD EQU   CRRSAREA+272                                             03994000
CRRRTN12 EQU   CRRSAREA+268                                             03995000
CRRRTN11 EQU   CRRSAREA+264                                             03996000
CRRRTN10 EQU   CRRSAREA+260                                             03997000
CRRRTN8  EQU   CRRSAREA+252                                             03998000
CRRRTN7  EQU   CRRSAREA+248                                             03999000
CRRRTN5  EQU   CRRSAREA+240                                             04000000
CRRRTN4  EQU   CRRSAREA+236                                             04001000
CRRRTN3  EQU   CRRSAREA+232                                             04002000
CRRRTN2  EQU   CRRSAREA+228                                             04003000
CRRRTN1  EQU   CRRSAREA+224                                             04004000
CRRRES1  EQU   CRRSAREA+222                                             04005000
CRRLCNT  EQU   CRRSAREA+220                                             04006000
CRRVALCK EQU   CRRSAREA+212                                             04007000
CRRBIND  EQU   CRRTRBUF+3                                               04008000
CRRTRRES EQU   CRRTRBUF                                                 04009000
CRRUECB  EQU   CRRSAREA+196                                             04010000
CRRCMDAD EQU   CRRSAREA+188                                             04011000
CRRESR2  EQU   CRRESR+1                                                 04012000
CRRESR1  EQU   CRRESR                                                   04013000
CRRDSB2  EQU   CRRDSB+1                                                 04014000
CRRDSB1  EQU   CRRDSB                                                   04015000
CRRDTACT EQU   CRRSAREA+174                                             04016000
CRRRSV99 EQU   CRRSAREA+173                                             04017000
CRRRDSOH EQU   CRRFDB3                                                  04018000
CRRRLG   EQU   CRRFDB3                                                  04019000
CRRLGFRC EQU   CRRFDB3                                                  04020000
CRRRDEOT EQU   CRRFDB3                                                  04021000
CRRRDEOM EQU   CRRFDB3                                                  04022000
CRRRDEOB EQU   CRRFDB3                                                  04023000
CRRUNUSD EQU   CRRFDB3                                                  04024000
CRRUINPT EQU   CRRFDB3                                                  04025000
CRRSTSAV EQU   CRRFDB2                                                  04026000
CRRCUERR EQU   CRRFDB2                                                  04027000
CRRDLGFL EQU   CRRFDB2                                                  04028000
CRRIOERR EQU   CRRFDB2                                                  04029000
CRRDVUNS EQU   CRRFDB2                                                  04030000
CRRATND  EQU   CRRFDB2                                                  04031000
CRRRVID  EQU   CRRFDB2                                                  04032000
CRRERLK  EQU   CRRFDB2                                                  04033000
CRRNSNA  EQU   CRRRTYPE                                                 04034000
CRRDFSYN EQU   CRRRTYPE                                                 04035000
CRRRESP  EQU   CRRRTYPE                                                 04036000
CRRDFASY EQU   CRRRTYPE                                                 04037000
CRRRPSBD EQU   CRRRFLG1                                                 04038000
CRRRPLOQ EQU   CRRRFLG1                                                 04039000
CRRRPLS  EQU   CRRRFLG1                                                 04040000
CRRSW7   EQU   CRRFLGS                                                  04041000
CRRSW3   EQU   CRRFLGS                                                  04042000
CRRRSV04 EQU   CRRFLGS4                                                 04043000
CRRDLCCW EQU   CRRFLGS3                                                 04044000
CRRRESET EQU   CRRFLGS3                                                 04045000
CRRSUBBK EQU   CRRFLGS3                                                 04046000
CRRRSV08 EQU   CRRFLGS3                                                 04047000
CRRDEBQ  EQU   CRRFLGS3                                                 04048000
CRRDREQ  EQU   CRRFLGS3                                                 04049000
CRRDFDBK EQU   CRRFLGS3                                                 04050000
CRRDFSB  EQU   CRRFLGS2                                                 04051000
CRRDPROC EQU   CRRFLGS2                                                 04052000
CRREXTS  EQU   CRRFLGS2                                                 04053000
CRRELSRI EQU   CRRFLGS2                                                 04054000
CRRPOST  EQU   CRRFLGS2                                                 04055000
CRRENDLW EQU   CRRFLGS2                                                 04056000
CRRPRGIP EQU   CRRFLGS2                                                 04057000
CRRDEXP  EQU   CRRFLGS2                                                 04058000
CRRFINI  EQU   CRRFLGS1                                                 04059000
CRRPREIO EQU   CRRFLGS1                                                 04060000
CRRDOCUR EQU   CRRFLGS1                                                 04061000
CRRRATS4 EQU   CRRATS+7                                                 04062000
@NM00073 EQU   CRRSATS                                                  04063000
CRRASC51 EQU   CRRSATS                                                  04064000
CRRASC40 EQU   CRRSATS                                                  04065000
CRRASC30 EQU   CRRSATS                                                  04066000
CRRASC21 EQU   CRRSATS                                                  04067000
CRRASC10 EQU   CRRSATS                                                  04068000
CRRASC01 EQU   CRRSATS                                                  04069000
@NM00072 EQU   CRRRATS2                                                 04070000
CRRPLIC  EQU   CRRRATS2                                                 04071000
CRRRC81  EQU   CRRRATS2                                                 04072000
CRRRC80  EQU   CRRRATS2                                                 04073000
CRRRC65  EQU   CRRRATS2                                                 04074000
CRRRC63  EQU   CRRRATS2                                                 04075000
CRRRC55  EQU   CRRRATS2                                                 04076000
CRRRC54  EQU   CRRRATS2                                                 04077000
CRRRC53  EQU   CRRRATS1                                                 04078000
CRRRC52  EQU   CRRRATS1                                                 04079000
CRRRC51  EQU   CRRRATS1                                                 04080000
CRRRC30  EQU   CRRRATS1                                                 04081000
CRRRC26  EQU   CRRRATS1                                                 04082000
CRRRC23  EQU   CRRRATS1                                                 04083000
CRRRC22  EQU   CRRRATS1                                                 04084000
CRRRC21  EQU   CRRRATS1                                                 04085000
@NM00071 EQU   CRRATS4                                                  04086000
CRRC3X   EQU   CRRATS4                                                  04087000
CRRC85   EQU   CRRATS4                                                  04088000
CRRC83   EQU   CRRATS4                                                  04089000
CRRC82   EQU   CRRATS4                                                  04090000
CRRC61   EQU   CRRATS4                                                  04091000
CRRC60   EQU   CRRATS4                                                  04092000
CRRC81   EQU   CRRATS3                                                  04093000
CRRC80   EQU   CRRATS3                                                  04094000
CRRC75   EQU   CRRATS3                                                  04095000
CRRC51   EQU   CRRATS3                                                  04096000
CRRC50   EQU   CRRATS3                                                  04097000
CRRC42   EQU   CRRATS3                                                  04098000
CRRC41   EQU   CRRATS3                                                  04099000
CRRC40   EQU   CRRATS3                                                  04100000
CRRC32   EQU   CRRATS2                                                  04101000
CRRC31   EQU   CRRATS2                                                  04102000
CRRC30   EQU   CRRATS2                                                  04103000
CRRC25   EQU   CRRATS2                                                  04104000
CRRC24   EQU   CRRATS2                                                  04105000
CRRC23   EQU   CRRATS2                                                  04106000
CRRC22   EQU   CRRATS2                                                  04107000
CRRC21   EQU   CRRATS2                                                  04108000
CRRC20   EQU   CRRATS1                                                  04109000
CRRC13   EQU   CRRATS1                                                  04110000
CRRC12   EQU   CRRATS1                                                  04111000
CRRC11   EQU   CRRATS1                                                  04112000
CRRC10   EQU   CRRATS1                                                  04113000
CRRC01   EQU   CRRATS1                                                  04114000
CRRRMAS4 EQU   CRRMAS+7                                                 04115000
@NM00070 EQU   CRRSMAS                                                  04116000
CRRMSC51 EQU   CRRSMAS                                                  04117000
CRRMSC40 EQU   CRRSMAS                                                  04118000
CRRMSC30 EQU   CRRSMAS                                                  04119000
CRRMSC21 EQU   CRRSMAS                                                  04120000
CRRMSC10 EQU   CRRSMAS                                                  04121000
CRRMSC01 EQU   CRRSMAS                                                  04122000
@NM00069 EQU   CRRRMAS2                                                 04123000
CRRRM81  EQU   CRRRMAS2                                                 04124000
CRRRM80  EQU   CRRRMAS2                                                 04125000
CRRRM65  EQU   CRRRMAS2                                                 04126000
CRRRM63  EQU   CRRRMAS2                                                 04127000
CRRRM55  EQU   CRRRMAS2                                                 04128000
CRRRM54  EQU   CRRRMAS2                                                 04129000
CRRRM53  EQU   CRRRMAS1                                                 04130000
CRRRM52  EQU   CRRRMAS1                                                 04131000
CRRRM51  EQU   CRRRMAS1                                                 04132000
CRRRM30  EQU   CRRRMAS1                                                 04133000
CRRRM26  EQU   CRRRMAS1                                                 04134000
CRRRM23  EQU   CRRRMAS1                                                 04135000
CRRRM22  EQU   CRRRMAS1                                                 04136000
CRRRM21  EQU   CRRRMAS1                                                 04137000
@NM00068 EQU   CRRMAS4                                                  04138000
CRRM3X   EQU   CRRMAS4                                                  04139000
CRRM85   EQU   CRRMAS4                                                  04140000
CRRM83   EQU   CRRMAS4                                                  04141000
CRRM82   EQU   CRRMAS4                                                  04142000
CRRM61   EQU   CRRMAS4                                                  04143000
CRRM60   EQU   CRRMAS4                                                  04144000
CRRM81   EQU   CRRMAS3                                                  04145000
CRRM80   EQU   CRRMAS3                                                  04146000
CRRM75   EQU   CRRMAS3                                                  04147000
CRRM51   EQU   CRRMAS3                                                  04148000
CRRM50   EQU   CRRMAS3                                                  04149000
CRRM42   EQU   CRRMAS3                                                  04150000
CRRM41   EQU   CRRMAS3                                                  04151000
CRRM40   EQU   CRRMAS3                                                  04152000
CRRM32   EQU   CRRMAS2                                                  04153000
CRRM31   EQU   CRRMAS2                                                  04154000
CRRM30   EQU   CRRMAS2                                                  04155000
CRRM25   EQU   CRRMAS2                                                  04156000
CRRM24   EQU   CRRMAS2                                                  04157000
CRRM23   EQU   CRRMAS2                                                  04158000
CRRM22   EQU   CRRMAS2                                                  04159000
CRRM21   EQU   CRRMAS2                                                  04160000
CRRM20   EQU   CRRMAS1                                                  04161000
CRRM13   EQU   CRRMAS1                                                  04162000
CRRM12   EQU   CRRMAS1                                                  04163000
CRRM11   EQU   CRRMAS1                                                  04164000
CRRM10   EQU   CRRMAS1                                                  04165000
CRRM02   EQU   CRRMAS1                                                  04166000
CRRM01   EQU   CRRMAS1                                                  04167000
CRRFSB   EQU   CRRSAREA+144                                             04168000
CRRRSV22 EQU   ISTDCCRR+4                                               04169000
ATCAOS   EQU   ISTATCVT+1584                                            04170000
ATCPOPAB EQU   ATCAOSM+640                                              04171000
ATCVIOPM EQU   ATCAOSM+636                                              04172000
ATCTPMMI EQU   ATCAOSM+632                                              04173000
ATCTPMPB EQU   ATCAOSM+600                                              04174000
ATCRSV88 EQU   ATCAOSM+596                                              04175000
ATCRPLCT EQU   ATCAOSM+594                                              04176000
ATCCRACT EQU   ATCAOSM+592                                              04177000
ATCSRBCT EQU   ATCAOSM+590                                              04178000
ATCRSV75 EQU   ATCAOSM+589                                              04179000
ATCRSV66 EQU   ATCZFLAG                                                 04180000
ATCZF001 EQU   ATCZFLAG                                                 04181000
ATCTPCP1 EQU   ATCAOSM+584                                              04182000
ATCTPCP0 EQU   ATCAOSM+580                                              04183000
ATCAICTN EQU   ATCAOSM+576                                              04184000
ATCZR01  EQU   ATCAOSM+572                                              04185000
ATCMPLTA EQU   ATCAOSM+568                                              04186000
ATCASCB  EQU   ATCAOSM+564                                              04187000
ATCAP86  EQU   ATCAOSM+560                                              04188000
ATCAP85  EQU   ATCAOSM+556                                              04189000
ATCAP84  EQU   ATCAOSM+552                                              04190000
ATCAP83  EQU   ATCAOSM+548                                              04191000
ATCAP82  EQU   ATCAOSM+544                                              04192000
ATCAP69  EQU   ATCAOSM+540                                              04193000
ATCAP66  EQU   ATCAOSM+536                                              04194000
ATCAP62  EQU   ATCAOSM+532                                              04195000
ATCAPC59 EQU   ATCAOSM+528                                              04196000
ATCAP56  EQU   ATCAOSM+524                                              04197000
ATCAP55  EQU   ATCAOSM+520                                              04198000
ATCRCFY0 EQU   ATCAOSM+516                                              04199000
ATCAP41  EQU   ATCAOSM+512                                              04200000
ATCAPC25 EQU   ATCAOSM+508                                              04201000
ATCAP23  EQU   ATCAOSM+504                                              04202000
ATCTPSPB EQU   ATCAOSM+472                                              04203000
ATCTRMPB EQU   ATCAOSM+440                                              04204000
ATCAPBE  EQU   ATCAOSM+436                                              04205000
ATCPSTA  EQU   ATCAOSM+432                                              04206000
ATCSMABF EQU   ATCAOSM+428                                              04207000
ATCSMAPR EQU   ATCAOSM+424                                              04208000
ATCTPWQA EQU   ATCAOSM+420                                              04209000
ATCSMAID EQU   ATCAOSM+416                                              04210000
ATCSMARA EQU   ATCAOSM+412                                              04211000
ATCCACXA EQU   ATCAOSM+408                                              04212000
ATCZLAAB EQU   ATCAOSM+404                                              04213000
ATCATA10 EQU   ATCAOSM+400                                              04214000
ATCHLTCB EQU   ATCAOSM+396                                              04215000
@NM00067 EQU   ATCVTFLG                                                 04216000
ATCVTACT EQU   ATCVTFLG                                                 04217000
ATCRPT40 EQU   ATCAOSM+388                                              04218000
ATCRPT39 EQU   ATCAOSM+384                                              04219000
ATCRPT38 EQU   ATCAOSM+380                                              04220000
ATCRPT37 EQU   ATCAOSM+376                                              04221000
ATCRPT36 EQU   ATCAOSM+372                                              04222000
ATCRPT35 EQU   ATCAOSM+368                                              04223000
ATCRPT34 EQU   ATCAOSM+364                                              04224000
ATCRPT33 EQU   ATCAOSM+360                                              04225000
ATCRPT32 EQU   ATCAOSM+356                                              04226000
ATCRPT31 EQU   ATCAOSM+352                                              04227000
ATCRPT30 EQU   ATCAOSM+348                                              04228000
ATCRPT29 EQU   ATCAOSM+344                                              04229000
ATCRPT28 EQU   ATCAOSM+340                                              04230000
ATCRPT27 EQU   ATCAOSM+336                                              04231000
ATCRPT26 EQU   ATCAOSM+332                                              04232000
ATCRPT25 EQU   ATCAOSM+328                                              04233000
ATCRPT24 EQU   ATCAOSM+324                                              04234000
ATCRPT23 EQU   ATCAOSM+320                                              04235000
ATCRPT22 EQU   ATCAOSM+316                                              04236000
ATCRPT21 EQU   ATCAOSM+312                                              04237000
ATCRPT20 EQU   ATCAOSM+308                                              04238000
ATCRPT19 EQU   ATCAOSM+304                                              04239000
ATCRPT18 EQU   ATCAOSM+300                                              04240000
ATCRPT17 EQU   ATCAOSM+296                                              04241000
ATCRPT16 EQU   ATCAOSM+292                                              04242000
ATCRPT15 EQU   ATCAOSM+288                                              04243000
ATCRPT14 EQU   ATCAOSM+284                                              04244000
ATCRPT13 EQU   ATCAOSM+280                                              04245000
ATCRPT12 EQU   ATCAOSM+276                                              04246000
ATCDMAPP EQU   ATCAOSM+272                                              04247000
ATCAP38  EQU   ATCAOSM+268                                              04248000
ATCAP37  EQU   ATCAOSM+264                                              04249000
ATCZDFJ0 EQU   ATCAOSM+260                                              04250000
ATCAP51  EQU   ATCAOSM+256                                              04251000
ATCZPAB2 EQU   ATCAOSM+224                                              04252000
ATCZPAB1 EQU   ATCAOSM+192                                              04253000
ATCZLFVT EQU   ATCAOSM+188                                              04254000
ATCZLPVT EQU   ATCAOSM+184                                              04255000
ATCZDVTX EQU   ATCAOSM+180                                              04256000
ATCZDVTA EQU   ATCAOSM+176                                              04257000
ATCZDVT9 EQU   ATCAOSM+172                                              04258000
ATCZDVT8 EQU   ATCAOSM+168                                              04259000
ATCZDVT7 EQU   ATCAOSM+164                                              04260000
ATCRSV56 EQU   ATCDAPVT+22                                              04261000
ATCDAPDG EQU   ATCDAPVT+20                                              04262000
ATCDXCEA EQU   ATCDAPVT+16                                              04263000
ATCDCEA  EQU   ATCDAPVT+12                                              04264000
ATCDPCIA EQU   ATCDAPVT+8                                               04265000
ATCDSIOA EQU   ATCDAPVT+4                                               04266000
ATCDEOEA EQU   ATCDAPVT                                                 04267000
ATCZLAEA EQU   ATCLDAPP+16                                              04268000
ATCZLCEA EQU   ATCLDAPP+12                                              04269000
ATCRSV17 EQU   ATCLDAPP+8                                               04270000
ATCSMFRR EQU   ATCLDAPP+4                                               04271000
ATCCDTID EQU   ATCLDAPP                                                 04272000
ATCZAEA  EQU   ATCICAPP+16                                              04273000
ATCZCEA  EQU   ATCICAPP+12                                              04274000
ATCCDTCB EQU   ATCICAPP+8                                               04275000
ATCZSIOA EQU   ATCICAPP+4                                               04276000
ATCCDRPH EQU   ATCICAPP                                                 04277000
ATCAP65  EQU   ATCAOSM+96                                               04278000
ATCZDVT6 EQU   ATCAOSM+92                                               04279000
ATCZDVT4 EQU   ATCAOSM+88                                               04280000
ATCZDVT3 EQU   ATCAOSM+84                                               04281000
ATCZDVT1 EQU   ATCAOSM+80                                               04282000
ATCICNCB EQU   ATCAOSM+76                                               04283000
ATCZPSVT EQU   ATCAOSM+72                                               04284000
ATCZFSVT EQU   ATCAOSM+68                                               04285000
ATCAP64  EQU   ATCAOSM+64                                               04286000
ATCAP63  EQU   ATCAOSM+60                                               04287000
ATCAP61  EQU   ATCAOSM+56                                               04288000
ATCAP58  EQU   ATCAOSM+52                                               04289000
ATCAP57  EQU   ATCAOSM+48                                               04290000
ATCAP54  EQU   ATCAOSM+44                                               04291000
ATCAP53  EQU   ATCAOSM+40                                               04292000
ATCAP52  EQU   ATCAOSM+36                                               04293000
ATCAP34  EQU   ATCAOSM+32                                               04294000
ATCAP32  EQU   ATCAOSM+28                                               04295000
ATCAP12  EQU   ATCAOSM+20                                               04296000
ATCAP11  EQU   ATCAOSM+16                                               04297000
ATCCMTCB EQU   ATCAOSM+12                                               04298000
ATCPRPH  EQU   ATCAOSM+8                                                04299000
ATCGSRBF EQU   ATCGSRBG                                                 04300000
ATCSRBRT EQU   ATCAOSM                                                  04301000
@NM00066 EQU   @NM00065                                                 04302000
ATCVTMAB EQU   @NM00065                                                 04303000
@NM00064 EQU   ISTATCVT+908                                             04304000
ATCVDLOK EQU   ISTATCVT+904                                             04305000
ATCVFPAB EQU   ISTATCVT+872                                             04306000
ATCVDPAB EQU   ISTATCVT+840                                             04307000
ATCIOECB EQU   ISTATCVT+836                                             04308000
ATCINCW3 EQU   ISTATCVT+832                                             04309000
ATCMODTB EQU   ISTATCVT+828                                             04310000
ATCUSSPT EQU   ISTATCVT+824                                             04311000
ATCSRTAB EQU   ISTATCVT+820                                             04312000
@NM00063 EQU   ISTATCVT+819                                             04313000
@NM00062 EQU   ATCSTAT2                                                 04314000
ATCTRSMS EQU   ATCSTAT2                                                 04315000
ATCTRLOK EQU   ATCSTAT2                                                 04316000
ATCTRPSS EQU   ATCSTAT2                                                 04317000
ATCTRESC EQU   ATCSTAT2                                                 04318000
ATCTRAPI EQU   ATCSTAT2                                                 04319000
ATCNMCTR EQU   ISTATCVT+816                                             04320000
ATCSEC51 EQU   ATCSECST                                                 04321000
ATCSEC40 EQU   ATCSIPD+8                                                04322000
ATCSEC30 EQU   ATCSIPD+4                                                04323000
ATCSEC21 EQU   ATCSIPD                                                  04324000
ATCSEC10 EQU   ATCSOPD+4                                                04325000
ATCSEC01 EQU   ATCSOPD                                                  04326000
ATCPOIA  EQU   ATCRNO+1                                                 04327000
@NM00061 EQU   ATCRNO                                                   04328000
ATCPODVT EQU   ISTATCVT+784                                             04329000
ATCS49XL EQU   ISTATCVT+780                                             04330000
ATCS49XI EQU   ISTATCVT+776                                             04331000
ATCLCLCT EQU   ATCVLCNT+2                                               04332000
ATCRNCNT EQU   ATCVLCNT                                                 04333000
ATCCFEAD EQU   ISTATCVT+768                                             04334000
ATCPTR00 EQU   ISTATCVT+736                                             04335000
ATCRSV10 EQU   ISTATCVT+704                                             04336000
ATCTACB  EQU   ISTATCVT+700                                             04337000
ATCVTINM EQU   ISTATCVT+696                                             04338000
ATCTCLIM EQU   ISTATCVT+692                                             04339000
ATCTCLOM EQU   ISTATCVT+688                                             04340000
ATCVTIPB EQU   ISTATCVT+656                                             04341000
ATCTCIPB EQU   ISTATCVT+624                                             04342000
ATCTIPAB EQU   ISTATCVT+592                                             04343000
ATCOCCCB EQU   ISTATCVT+588                                             04344000
ATCOCCOB EQU   ISTATCVT+584                                             04345000
ATCCDLAD EQU   ISTATCVT+580                                             04346000
ATCCCLAD EQU   ISTATCVT+576                                             04347000
ATCDLRPB EQU   ISTATCVT+544                                             04348000
ATCPGPAB EQU   ISTATCVT+512                                             04349000
ATCVPAB1 EQU   ISTATCVT+480                                             04350000
ATCRSV97 EQU   ISTATCVT+476                                             04351000
ATCRDTLK EQU   ISTATCVT+472                                             04352000
ATCVOCLK EQU   ISTATCVT+468                                             04353000
ATCCDFDN EQU   ISTATCVT+464                                             04354000
ATCCDFIN EQU   ISTATCVT+460                                             04355000
ATCDVTLK EQU   ISTATCVT+456                                             04356000
ATCRSV99 EQU   ISTATCVT+440                                             04357000
ATCONFIG EQU   ISTATCVT+432                                             04358000
ATCNODDS EQU   ISTATCVT+428                                             04359000
ATCNODEL EQU   ISTATCVT+420                                             04360000
ATCRSV69 EQU   ISTATCVT+416                                             04361000
ATCAPCR5 EQU   ISTATCVT+412                                             04362000
ATCLDECB EQU   ISTATCVT+408                                             04363000
ATCLDNCS EQU   ISTATCVT+404                                             04364000
ATCCDPTR EQU   ISTATCVT+400                                             04365000
ATCADEL  EQU   ISTATCVT+396                                             04366000
ATCTODVT EQU   ISTATCVT+392                                             04367000
ATCDEBCH EQU   ISTATCVT+388                                             04368000
ATCHBSIZ EQU   ATCHPGM+2                                                04369000
ATCHBFNO EQU   ATCHPGM                                                  04370000
ATCCRME  EQU   ISTATCVT+380                                             04371000
ATCRVCHS EQU   ISTATCVT+372                                             04372000
ATCECTLP EQU   ISTATCVT+368                                             04373000
ATCZDVTB EQU   ISTATCVT+364                                             04374000
ATCECPRT EQU   ISTATCVT+360                                             04375000
ATCVTLOD EQU   ISTATCVT+356                                             04376000
ATCTRPAB EQU   ISTATCVT+352                                             04377000
ATCMSGM  EQU   ISTATCVT+348                                             04378000
ATCMSGP  EQU   ISTATCVT+344                                             04379000
ATCEPT   EQU   ISTATCVT+340                                             04380000
ATCDVT   EQU   ISTATCVT+336                                             04381000
ATCTRCPT EQU   ISTATCVT+332                                             04382000
ATCDVLOD EQU   ISTATCVT+328                                             04383000
ATCALERT EQU   ISTATCVT+324                                             04384000
ATCEPA   EQU   ISTATCVT+320                                             04385000
ATCSAF   EQU   ISTATCVT+318                                             04386000
ATCXRANG EQU   ISTATCVT+317                                             04387000
ATCLAST  EQU   ATCSHRFG                                                 04388000
ATCSHRTN EQU   ISTATCVT+308                                             04389000
ATCUEP   EQU   ISTATCVT+304                                             04390000
ATCOCRT  EQU   ISTATCVT+300                                             04391000
ATCCSMA  EQU   ATCCSMR                                                  04392000
ATCCDFND EQU   ISTATCVT+284                                             04393000
ATCCDDEL EQU   ISTATCVT+280                                             04394000
ATCCDADD EQU   ISTATCVT+276                                             04395000
ATCMNT   EQU   ISTATCVT+272                                             04396000
ATCRSV16 EQU   ISTATCVT+270                                             04397000
ATCMAXID EQU   ISTATCVT+269                                             04398000
ATCMSGSP EQU   ATCCOM+268                                               04399000
ATCCIDM  EQU   ATCCOM+266                                               04400000
ATCACTRM EQU   ATCCOM+264                                               04401000
ATCRCC65 EQU   ATCCOM+252                                               04402000
ATCRCC26 EQU   ATCCOM+248                                               04403000
ATCRCC63 EQU   ATCCOM+244                                               04404000
ATCRSV11 EQU   ATCCOM+242                                               04405000
ATCVTMID EQU   ATCCOM+240                                               04406000
ATCAPOST EQU   ATCCOM+236                                               04407000
ATCNERNE EQU   ATCCOM+228                                               04408000
ATCNERCV EQU   ATCCOM+224                                               04409000
ATCNERST EQU   ATCCOM+220                                               04410000
ATCDCC61 EQU   ATCCOM+216                                               04411000
ATCDCC60 EQU   ATCCOM+212                                               04412000
ATCSRTDF EQU   ATCCOM+208                                               04413000
ATCSRTAD EQU   ATCCOM+204                                               04414000
ATCFIRA  EQU   ATCCOM+200                                               04415000
ATCSMBQ  EQU   ATCCOM+196                                               04416000
ATCSMRC  EQU   ATCCOM+192                                               04417000
ATCSMRS  EQU   ATCCOM+188                                               04418000
ATCSMQU  EQU   ATCCOM+184                                               04419000
ATCACDA  EQU   ATCCOM+176                                               04420000
ATCSTMA  EQU   ATCCOM+172                                               04421000
ATCFRSTR EQU   ATCCOM+168                                               04422000
ATCGTSTR EQU   ATCCOM+164                                               04423000
ATCREADA EQU   ATCCOM+160                                               04424000
ATCALOAD EQU   ATCCOM+156                                               04425000
ATCBLDLA EQU   ATCCOM+152                                               04426000
ATCFBRPH EQU   ATCCOM+148                                               04427000
ATCTPBUF EQU   ATCTHTRC                                                 04428000
ATCREMOV EQU   ATCCOM+136                                               04429000
ATCADD   EQU   ATCCOM+132                                               04430000
ATCDVTPT EQU   ATCCOM+124                                               04431000
ATCFEPT  EQU   ATCCOM+120                                               04432000
ATCFDVT  EQU   ATCCOM+116                                               04433000
ATCCONFT EQU   ATCCOM+112                                               04434000
ATCPTCHA EQU   ATCCOM+108                                               04435000
ATCAUTHA EQU   ATCCOM+104                                               04436000
ATCACCTA EQU   ATCCOM+100                                               04437000
ATCRDTH  EQU   ATCCOM+96                                                04438000
ATCFRSCH EQU   ATCCOM+92                                                04439000
ATCFSB   EQU   ATCCOM+88                                                04440000
ATCHLTMS EQU   ATCCOM+84                                                04441000
ATCECPRM EQU   ATCCOM+80                                                04442000
ATCECNET EQU   ATCCOM+76                                                04443000
ATCECOPC EQU   ATCCOM+72                                                04444000
ATCVPARM EQU   ATCCOM+68                                                04445000
ATCECVRQ EQU   ATCCOM+64                                                04446000
ATCECSES EQU   ATCCOM+60                                                04447000
ATCOCHA  EQU   ATCCOM+56                                                04448000
ATCDSPLQ EQU   ATCCOM+52                                                04449000
ATCECDSP EQU   ATCCOM+48                                                04450000
ATCVARYQ EQU   ATCCOM+44                                                04451000
ATCECVRY EQU   ATCCOM+40                                                04452000
ATCHALTQ EQU   ATCCOM+36                                                04453000
ATCECHLT EQU   ATCCOM+32                                                04454000
ATCMODQ  EQU   ATCCOM+28                                                04455000
ATCECMOD EQU   ATCCOM+24                                                04456000
ATCASCHD EQU   ATCCOM+20                                                04457000
ATCSRT   EQU   ATCCOM+16                                                04458000
ATCRDT   EQU   ATCCOM+12                                                04459000
ATCAPI   EQU   ATCCOM+4                                                 04460000
ATCRSV04 EQU   ATCSTAT4                                                 04461000
ATCVTTRC EQU   ATCSTAT4                                                 04462000
ATCNCSD  EQU   ATCSTAT4                                                 04463000
ATCMTST  EQU   ATCSTAT4                                                 04464000
ATCTPRT  EQU   ATCSTAT4                                                 04465000
ATCPRTAT EQU   ATCSTAT4                                                 04466000
@NM00060 EQU   ATCPOFLG                                                 04467000
ATCPOUNS EQU   ATCPOFLG                                                 04468000
ATCHSDMF EQU   ATCSTFLG                                                 04469000
@NM00059 EQU   ATCSTAT1                                                 04470000
ATCMDHLT EQU   ATCSTAT1                                                 04471000
ATCINHLT EQU   ATCSTAT1                                                 04472000
ATCNETSL EQU   ATCSTAT1                                                 04473000
ATCQKHLT EQU   ATCSTAT1                                                 04474000
ATCSNHLT EQU   ATCSTAT1                                                 04475000
ATCACTIV EQU   ATCSTAT1                                                 04476000
ATCSTART EQU   ATCSTAT1                                                 04477000
RPHNEXPO EQU   ISTRPH+104                                               04478000
RPHSAV16 EQU   RPHWORK+60                                               04479000
RPHSAV15 EQU   RPHWORK+56                                               04480000
RPHSAV14 EQU   RPHWORK+52                                               04481000
RPHSAV13 EQU   RPHWORK+48                                               04482000
RPHSAV12 EQU   RPHWORK+44                                               04483000
RPHSAV11 EQU   RPHWORK+40                                               04484000
RPHSAV10 EQU   RPHWORK+36                                               04485000
RPHSAVE9 EQU   RPHWORK+32                                               04486000
RPHSAVE8 EQU   RPHWORK+28                                               04487000
RPHSAVE7 EQU   RPHWORK+24                                               04488000
RPHSAVE6 EQU   RPHWORK+20                                               04489000
RPHSAVE5 EQU   RPHWORK+16                                               04490000
RPHSAVE4 EQU   RPHWORK+12                                               04491000
RPHSAVE3 EQU   RPHWORK+8                                                04492000
RPHSAVE2 EQU   RPHWORK+4                                                04493000
RPHSHALF EQU   RPHSAVE1+2                                               04494000
RPHSBIT8 EQU   RPHSBITS                                                 04495000
RPHSBIT7 EQU   RPHSBITS                                                 04496000
RPHSBIT6 EQU   RPHSBITS                                                 04497000
RPHSBIT5 EQU   RPHSBITS                                                 04498000
RPHSBIT4 EQU   RPHSBITS                                                 04499000
RPHSBIT3 EQU   RPHSBITS                                                 04500000
RPHSBIT2 EQU   RPHSBITS                                                 04501000
RPHSBIT1 EQU   RPHSBITS                                                 04502000
RPHSBYTE EQU   RPHSAVE1                                                 04503000
RPHPABQP EQU   RPHPABQA+1                                               04504000
RPHPABFG EQU   RPHPABQA                                                 04505000
RPHSRP34 EQU   RPHSRPRM+2                                               04506000
RPHSRP12 EQU   RPHSRPRM                                                 04507000
RPHWEGT  EQU   RPHCSPA                                                  04508000
RPHPABOF EQU   ISTRPH+20                                                04509000
RPHRESUM EQU   RPHRESMA+1                                               04510000
RPHRSV01 EQU   RPHWPFLG                                                 04511000
RPHPURGE EQU   RPHWPFLG                                                 04512000
RPHPT    EQU   RPHWPFLG                                                 04513000
RPHWT    EQU   RPHWPFLG                                                 04514000
RPHRSKEY EQU   RPHWPFLG                                                 04515000
RPHTIK   EQU   RPHTSKID+3                                               04516000
@NM00058 EQU   RPHTSKID                                                 04517000
RPHRPHAP EQU   RPHRPHA+1                                                04518000
@NM00057 EQU   RPHRPHA                                                  04519000
RPHGATE  EQU   RPHRPHA                                                  04520000
@NM00056 EQU   RPHFLGB                                                  04521000
RPHRLCRA EQU   RPHFLGB                                                  04522000
RPHNRSAV EQU   RPHFLGB                                                  04523000
RPHPGCMP EQU   RPHFLGB                                                  04524000
RPHFBAPS EQU   RPHFLGB                                                  04525000
RPHBSSP  EQU   RPHFLGB                                                  04526000
RPHLOCK  EQU   RPHFLGB                                                  04527000
RPHFNFLG EQU   RPHFSTLC                                                 04528000
RPHMLTCP EQU   RPHFLAGS                                                 04529000
RPHSMCLR EQU   RPHFLAGS                                                 04530000
RPHSMTYP EQU   RPHFLAGS                                                 04531000
RPHSMQ   EQU   RPHFLAGS                                                 04532000
RPHAUTEX EQU   RPHAPTYP                                                 04533000
RPHSPGIN EQU   RPHFLAGS                                                 04534000
RPHOGIND EQU   RPHFLAGS                                                 04535000
RPHLNGTH EQU   RPHCNTL+1                                                04536000
RPHTYPE  EQU   RPHCNTL                                                  04537000
DYPPAB   EQU   ISTDYPAB+16                                              04538000
DYPRSV01 EQU   ISTDYPAB+12                                              04539000
DYPTSKID EQU   ISTDYPAB+8                                               04540000
DYPCHAIN EQU   ISTDYPAB+4                                               04541000
DYPFLGS  EQU   ISTDYPAB+2                                               04542000
DYPLNGTH EQU   ISTDYPAB+1                                               04543000
DYPTYPE  EQU   ISTDYPAB                                                 04544000
ACDSOP   EQU   ISTACDEB+184                                             04545000
ACDSIP   EQU   ISTACDEB+168                                             04546000
ACDRSV24 EQU   ACDVTAM+108                                              04547000
ACDRSV23 EQU   ACDVTAM+104                                              04548000
ACDRSV22 EQU   ACDVTAM+100                                              04549000
ACDOCWAD EQU   ACDVTAM+96                                               04550000
ACDRSV10 EQU   ACDVTAM+92                                               04551000
ACDAPDDT EQU   ACDAPDAT+1                                               04552000
ACDAPDLN EQU   ACDAPDAT                                                 04553000
ACDRSV07 EQU   ACDVTAM+82                                               04554000
ACDRSV06 EQU   ACDVTAM+81                                               04555000
ACDRSV09 EQU   ACDSSFLG                                                 04556000
ACDAICLS EQU   ACDSSFLG                                                 04557000
ACDABEND EQU   ACDSSFLG                                                 04558000
ACDCACB  EQU   ACDSSFLG                                                 04559000
ACDRSV21 EQU   ACDVTAM+64                                               04560000
ACDSSPAB EQU   ACDVTAM+48                                               04561000
ACDNEPAB EQU   ACDVTAM+32                                               04562000
ACDRSV20 EQU   ACDVTAM+20                                               04563000
ACDRDTE  EQU   ACDVTAM+4                                                04564000
ACDAPP   EQU   ACDAPPAD+1                                               04565000
ACDEXSCL EQU   ACDAPPAD                                                 04566000
ACDACB   EQU   ACDACBAD+1                                               04567000
ACDDEBID EQU   ACDACBAD                                                 04568000
ACDPROTG EQU   ACDACBAD                                                 04569000
ACDECBAD EQU   ACDBASIC+20                                              04570000
ACDUSRPB EQU   ACDUSRPG+1                                               04571000
ACDNMEXT EQU   ACDUSRPG                                                 04572000
ACDPRLEN EQU   ACDBASIC+15                                              04573000
ACDFLGS1 EQU   ACDBASIC+14                                              04574000
ACDQSCNT EQU   ACDBASIC+13                                              04575000
ACDOPATB EQU   ACDBASIC+12                                              04576000
ACDIRBAD EQU   ACDBASIC+8                                               04577000
ACDDEB   EQU   ACDDEBAD+1                                               04578000
ACDAMLNG EQU   ACDDEBAD                                                 04579000
ACDTCB   EQU   ACDTCBAD+1                                               04580000
ACDOPNAD EQU   ACDNMSUB                                                 04581000
ACDRSV03 EQU   ACDTBLOF+1                                               04582000
ACDRSV02 EQU   ACDTBLOF                                                 04583000
ACDAMTYP EQU   ACDDBPFX+5                                               04584000
ACDLENG  EQU   ACDDBPFX+4                                               04585000
ACDDEBX  EQU   ACDDBPFX                                                 04586000
ACDRSV08 EQU   ACDVTPRX+12                                              04587000
ACDTSKID EQU   ACDVTPRX+8                                               04588000
ACDCHN   EQU   ACDVTPRX+4                                               04589000
ACDSAF   EQU   ACDVTPRX+2                                               04590000
ACDLNGTH EQU   ACDVTPRX+1                                               04591000
LOKXCL   EQU   @NM00054                                                 04592000
LOKPRY   EQU   @NM00054                                                 04593000
@NM00055 EQU   @NM00054                                                 04594000
@NM00053 EQU   LOKCHNG                                                  04595000
LOKCT    EQU   ISTLOK                                                   04596000
PABRPHA  EQU   PABRPHFG+1                                               04597000
PABNODQ  EQU   PABFLAGS                                                 04598000
PABINHBT EQU   PABFLAGS                                                 04599000
PABERLOK EQU   PABERRLK                                                 04600000
PABSSN   EQU   PABFLAGS                                                 04601000
PABDYNAM EQU   PABFLAGS                                                 04602000
PABNORPR EQU   PABFLAGS                                                 04603000
PABPRIOR EQU   PABFLAGS                                                 04604000
PABAPYP  EQU   PABFLAGS                                                 04605000
PABDVTA  EQU   ISTPAB+9                                                 04606000
PABOFFST EQU   ISTPAB+8                                                 04607000
PABCHNGP EQU   PABCHAIN+1                                               04608000
PABRSV02 EQU   PABCHAIN                                                 04609000
PABRUNNG EQU   PABCHAIN                                                 04610000
PABRESET EQU   PABCHAIN                                                 04611000
PABUNCON EQU   PABCHAIN                                                 04612000
PABCDP   EQU   PABCHAIN                                                 04613000
PABRESCH EQU   PABCHAIN                                                 04614000
PABCHNG  EQU   PABCHAIN                                                 04615000
PABWEQP  EQU   PABWEQA+1                                                04616000
PABRSV01 EQU   PABWEQA                                                  04617000
PABWEQG  EQU   PABWEQA                                                  04618000
CVTLEVL  EQU   CVTRELNO+2                                               04619000
CVTNUMB  EQU   CVTRELNO                                                 04620000
CVTMDL   EQU   CVTFIX+250                                               04621000
@NM00028 EQU   CVTFIX+248                                               04622000
@NM00027 EQU   CVTFIX                                                   04623000
CVTRV482 EQU   CVTXTNT2+128                                             04624000
CVTRV481 EQU   CVTXTNT2+124                                             04625000
CVTRV480 EQU   CVTXTNT2+120                                             04626000
CVTRV479 EQU   CVTXTNT2+118                                             04627000
CVTRV478 EQU   CVTXTNT2+117                                             04628000
CVTRV477 EQU   CVTXTNT2+116                                             04629000
CVTRV476 EQU   CVTXTNT2+115                                             04630000
CVTRV475 EQU   CVTXTNT2+114                                             04631000
CVTRV474 EQU   CVTRV466                                                 04632000
CVTRV473 EQU   CVTRV466                                                 04633000
CVTRV472 EQU   CVTRV466                                                 04634000
CVTRV471 EQU   CVTRV466                                                 04635000
CVTRV470 EQU   CVTRV466                                                 04636000
CVTRV469 EQU   CVTRV466                                                 04637000
CVTRV468 EQU   CVTRV466                                                 04638000
CVTRV467 EQU   CVTRV466                                                 04639000
CVTRV465 EQU   CVTRV457                                                 04640000
CVTRV464 EQU   CVTRV457                                                 04641000
CVTRV463 EQU   CVTRV457                                                 04642000
CVTRV462 EQU   CVTRV457                                                 04643000
CVTRV461 EQU   CVTRV457                                                 04644000
CVTRV460 EQU   CVTRV457                                                 04645000
CVTRV459 EQU   CVTRV457                                                 04646000
CVTRV458 EQU   CVTRV457                                                 04647000
CVTRV456 EQU   CVTXTNT2+108                                             04648000
CVTRV455 EQU   CVTXTNT2+104                                             04649000
CVTRV454 EQU   CVTXTNT2+100                                             04650000
CVTRV453 EQU   CVTXTNT2+96                                              04651000
CVTRV452 EQU   CVTXTNT2+94                                              04652000
CVTRV451 EQU   CVTXTNT2+92                                              04653000
CVTRV450 EQU   CVTXTNT2+90                                              04654000
CVTRV449 EQU   CVTXTNT2+88                                              04655000
CVTRV448 EQU   CVTXTNT2+87                                              04656000
CVTRV447 EQU   CVTXTNT2+86                                              04657000
CVTRV446 EQU   CVTRV438                                                 04658000
CVTRV445 EQU   CVTRV438                                                 04659000
CVTRV444 EQU   CVTRV438                                                 04660000
CVTRV443 EQU   CVTRV438                                                 04661000
CVTRV442 EQU   CVTRV438                                                 04662000
CVTRV441 EQU   CVTRV438                                                 04663000
CVTRV440 EQU   CVTRV438                                                 04664000
CVTRV439 EQU   CVTRV438                                                 04665000
CVTRV437 EQU   CVTRV429                                                 04666000
CVTRV436 EQU   CVTRV429                                                 04667000
CVTRV435 EQU   CVTRV429                                                 04668000
CVTRV434 EQU   CVTRV429                                                 04669000
CVTRV433 EQU   CVTRV429                                                 04670000
CVTRV432 EQU   CVTRV429                                                 04671000
CVTRV431 EQU   CVTRV429                                                 04672000
CVTRV430 EQU   CVTRV429                                                 04673000
CVTRV428 EQU   CVTXTNT2+80                                              04674000
CVTRV427 EQU   CVTXTNT2+76                                              04675000
CVTRV426 EQU   CVTXTNT2+72                                              04676000
CVTRV425 EQU   CVTXTNT2+68                                              04677000
CVTATACT EQU   CVTATCVT                                                 04678000
CVTRV423 EQU   CVTXTNT2+62                                              04679000
CVTRV422 EQU   CVTXTNT2+60                                              04680000
CVTRV421 EQU   CVTXTNT2+58                                              04681000
CVTRV420 EQU   CVTXTNT2+56                                              04682000
CVTRV419 EQU   CVTXTNT2+55                                              04683000
CVTRV418 EQU   CVTXTNT2+54                                              04684000
CVTRV417 EQU   CVTRV409                                                 04685000
CVTRV416 EQU   CVTRV409                                                 04686000
CVTRV415 EQU   CVTRV409                                                 04687000
CVTRV414 EQU   CVTRV409                                                 04688000
CVTRV413 EQU   CVTRV409                                                 04689000
CVTRV412 EQU   CVTRV409                                                 04690000
CVTRV411 EQU   CVTRV409                                                 04691000
CVTRV410 EQU   CVTRV409                                                 04692000
CVTRV408 EQU   CVTRV400                                                 04693000
CVTRV407 EQU   CVTRV400                                                 04694000
CVTRV406 EQU   CVTRV400                                                 04695000
CVTRV405 EQU   CVTRV400                                                 04696000
CVTRV404 EQU   CVTRV400                                                 04697000
CVTRV403 EQU   CVTRV400                                                 04698000
CVTRV402 EQU   CVTRV400                                                 04699000
CVTRV401 EQU   CVTRV400                                                 04700000
CVTICB   EQU   CVTXTNT2+48                                              04701000
CVTSKTA  EQU   CVTXTNT2+44                                              04702000
CVTSHSB  EQU   CVTSHS                                                   04703000
CVTRSV98 EQU   CVTXTNT2+36                                              04704000
CVTRSV97 EQU   CVTXTNT2+34                                              04705000
CVTRSV96 EQU   CVTXTNT2+32                                              04706000
CVTOLTEP EQU   CVTXTNT2+28                                              04707000
CVTQIDA  EQU   CVTQID+1                                                 04708000
CVTRSV95 EQU   CVTQID                                                   04709000
CVTRSV94 EQU   CVTXTNT2+20                                              04710000
CVTRSV93 EQU   CVTXTNT2+16                                              04711000
CVTRSV92 EQU   CVTXTNT2+12                                              04712000
CVTDEBVR EQU   CVTXTNT2+8                                               04713000
CVTRSV91 EQU   CVTXTNT2+6                                               04714000
CVTRSV9H EQU   CVTFLGBT                                                 04715000
CVTRSV9G EQU   CVTFLGBT                                                 04716000
CVTRSV9F EQU   CVTFLGBT                                                 04717000
CVTRSV9E EQU   CVTFLGBT                                                 04718000
CVTRSV9D EQU   CVTFLGBT                                                 04719000
CVTRSV9C EQU   CVTFLGBT                                                 04720000
CVTVME   EQU   CVTFLGBT                                                 04721000
CVTNPE   EQU   CVTFLGBT                                                 04722000
CVTNUCLS EQU   CVTXTNT2+4                                               04723000
CVTDSSVA EQU   CVTDSSV+1                                                04724000
CVTRSV89 EQU   CVTDSSV                                                  04725000
CVTRSV88 EQU   CVTXTNT1+8                                               04726000
CVTRSV87 EQU   CVTXTNT1+4                                               04727000
CVTFACHN EQU   CVTXTNT1                                                 04728000
CVTRV488 EQU   CVTMAP+412                                               04729000
CVTRV487 EQU   CVTMAP+408                                               04730000
CVTRV486 EQU   CVTMAP+404                                               04731000
CVTRV485 EQU   CVTMAP+400                                               04732000
CVTACTAP EQU   CVTMAP+396                                               04733000
CVTAUTH  EQU   CVTMAP+392                                               04734000
CVTATMCA EQU   CVTATMCT+1                                               04735000
CVTATMST EQU   CVTATMCT                                                 04736000
CVTRSV61 EQU   CVTMAP+384                                               04737000
CVTVOLT1 EQU   CVTVOLM1+1                                               04738000
CVTVOLI1 EQU   CVTVOLF1                                                 04739000
CVTSTOA  EQU   CVTMAP+376                                               04740000
CVTRSV58 EQU   CVTMAP+374                                               04741000
CVTRSV57 EQU   CVTMAP+372                                               04742000
CVTDDCE  EQU   CVTMAP+368                                               04743000
CVTPNWFR EQU   CVTMAP+364                                               04744000
CVTSMF   EQU   CVTMAP+360                                               04745000
CVTSULK  EQU   CVTMAP+358                                               04746000
CVTSLKO  EQU   CVTSYSK                                                  04747000
CVTSLKP  EQU   CVTSYSK                                                  04748000
CVTSLKQ  EQU   CVTSYSK                                                  04749000
CVTSLKR  EQU   CVTSYSK                                                  04750000
CVTRSV56 EQU   CVTSYSK                                                  04751000
CVTRSV55 EQU   CVTSYSK                                                  04752000
CVTRSV54 EQU   CVTSYSK                                                  04753000
CVTRSV53 EQU   CVTSYSK                                                  04754000
CVTRSV52 EQU   CVTA1F1                                                  04755000
CVTRSV51 EQU   CVTA1F1                                                  04756000
CVTRSV50 EQU   CVTA1F1                                                  04757000
CVTRSV49 EQU   CVTA1F1                                                  04758000
CVTRSV48 EQU   CVTA1F1                                                  04759000
CVTRSV47 EQU   CVTA1F1                                                  04760000
CVTSRSW  EQU   CVTA1F1                                                  04761000
CVTPFSW  EQU   CVTA1F1                                                  04762000
CVTPCVT  EQU   CVTMAP+352                                               04763000
CVTRSV46 EQU   CVTMAP+344                                               04764000
CVTRSV45 EQU   CVTMAP+340                                               04765000
CVTRSV44 EQU   CVTMAP+338                                               04766000
CVTRSV43 EQU   CVTMAP+336                                               04767000
CVTHJESA EQU   CVTHJES+1                                                04768000
CVTRSV42 EQU   CVTHJES                                                  04769000
CVTEXT2A EQU   CVTEXT2+1                                                04770000
CVTRSV41 EQU   CVTEXT2                                                  04771000
CVTAPFA  EQU   CVTAPF+1                                                 04772000
CVTRSV40 EQU   CVTAPF                                                   04773000
CVTRV518 EQU   CVTINTLA                                                 04774000
CVTRV517 EQU   CVTERPV                                                  04775000
CVTEORM  EQU   CVTMAP+312                                               04776000
CVTMCHPR EQU   CVTMAP+308                                               04777000
CVTTZ    EQU   CVTMAP+304                                               04778000
CVTJEPS  EQU   CVTMAP+300                                               04779000
CVTJESCT EQU   CVTMAP+296                                               04780000
CVTMODE  EQU   CVTMAP+292                                               04781000
CVTPTRV  EQU   CVTMAP+288                                               04782000
CVTREAL  EQU   CVTMAP+284                                               04783000
CVTRSV39 EQU   CVTMAP+280                                               04784000
CVTRSV38 EQU   CVTMAP+276                                               04785000
CVTDMSRA EQU   CVTDMSR+1                                                04786000
CVTRSV37 EQU   CVTDMSR                                                  04787000
CVTQMSGA EQU   CVTQMSG+1                                                04788000
CVTRSV36 EQU   CVTQMSG                                                  04789000
CVTAMFF  EQU   CVTMAP+264                                               04790000
CVTPURGA EQU   CVTPURG+1                                                04791000
CVTRSV35 EQU   CVTPURG                                                  04792000
CVTCBSP  EQU   CVTMAP+256                                               04793000
CVTATERA EQU   CVTATER+1                                                04794000
CVTSYST  EQU   CVTATER                                                  04795000
CVTVOLT2 EQU   CVTTAT                                                   04796000
CVTVOLI2 EQU   CVTVOLF2                                                 04797000
CVTAQAVB EQU   CVTAQAVT+1                                               04798000
CVTRSV34 EQU   CVTTCMFG                                                 04799000
CVTRSV33 EQU   CVTTCMFG                                                 04800000
CVTRSV32 EQU   CVTTCMFG                                                 04801000
CVTRSV31 EQU   CVTTCMFG                                                 04802000
CVTRSV30 EQU   CVTTCMFG                                                 04803000
CVTRSV29 EQU   CVTTCMFG                                                 04804000
CVTRSV28 EQU   CVTTCMFG                                                 04805000
CVTTCRDY EQU   CVTTCMFG                                                 04806000
CVTGTFA  EQU   CVTGTF+1                                                 04807000
CVTRSV27 EQU   CVTGTFST                                                 04808000
CVTRNIO  EQU   CVTGTFST                                                 04809000
CVTUSR   EQU   CVTGTFST                                                 04810000
CVTRV318 EQU   CVTFORM                                                  04811000
CVTRV317 EQU   CVTTMODE                                                 04812000
CVTRV316 EQU   CVTSTATE                                                 04813000
CVTRV315 EQU   CVTGTFS                                                  04814000
CVTGTFAV EQU   CVTGTFS                                                  04815000
CVT0SCR1 EQU   CVTMAP+232                                               04816000
CVTRV515 EQU   CVTMAP+228                                               04817000
CVTRMS   EQU   CVTMAP+224                                               04818000
CVTPATCH EQU   CVTMAP+220                                               04819000
CVTTSCE  EQU   CVTMAP+216                                               04820000
CVTLNKSC EQU   CVTMAP+214                                               04821000
CVTQABST EQU   CVTMAP+212                                               04822000
CVTMDLDS EQU   CVTMAP+208                                               04823000
CVTUSER  EQU   CVTMAP+204                                               04824000
CVTABEND EQU   CVTMAP+200                                               04825000
CVTSMCA  EQU   CVTMAP+196                                               04826000
CVTRSV18 EQU   CVTMAP+192                                               04827000
CVTQLPAQ EQU   CVTMAP+188                                               04828000
CVTQCDSR EQU   CVTMAP+184                                               04829000
CVTRSV17 EQU   CVTOPTB                                                  04830000
CVTRSV16 EQU   CVTOPTB                                                  04831000
CVTFP    EQU   CVTOPTB                                                  04832000
CVTAPTHR EQU   CVTOPTB                                                  04833000
CVTNLOG  EQU   CVTOPTB                                                  04834000
CVTTOD   EQU   CVTOPTB                                                  04835000
CVTCTIMS EQU   CVTOPTB                                                  04836000
CVTPROT  EQU   CVTOPTB                                                  04837000
CVTXPFP  EQU   CVTOPTA                                                  04838000
CVTASCII EQU   CVTOPTA                                                  04839000
CVTRSV13 EQU   CVTOPTA                                                  04840000
CVTRSV12 EQU   CVTOPTA                                                  04841000
CVTNIP   EQU   CVTOPTA                                                  04842000
CVTDDR   EQU   CVTOPTA                                                  04843000
CVTAPR   EQU   CVTOPTA                                                  04844000
CVTCCH   EQU   CVTOPTA                                                  04845000
CVTSNCTR EQU   CVTMAP+180                                               04846000
CVTQMWR  EQU   CVTMAP+176                                               04847000
CVTQOCR  EQU   CVTMAP+172                                               04848000
CVT1EF00 EQU   CVTMAP+168                                               04849000
CVTMZ00  EQU   CVTMAP+164                                               04850000
CVTHEAD  EQU   CVTMAP+160                                               04851000
CVTRSV11 EQU   CVTMAP+156                                               04852000
CVT0PT01 EQU   CVTMAP+152                                               04853000
CVTMSER  EQU   CVTMAP+148                                               04854000
CVTRV516 EQU   CVTIERLC                                                 04855000
CVTILCH  EQU   CVTMAP+140                                               04856000
CVT0DS   EQU   CVTMAP+136                                               04857000
CVTFBOSV EQU   CVTMAP+132                                               04858000
CVTNUCB  EQU   CVTMAP+128                                               04859000
CVTIXAVL EQU   CVTMAP+124                                               04860000
CVTIOQET EQU   CVTMAP+120                                               04861000
CVTDCBA  EQU   CVTMAP+117                                               04862000
CVTMVS2  EQU   CVTDCB                                                   04863000
CVT6DAT  EQU   CVTDCB                                                   04864000
CVT4MPS  EQU   CVTDCB                                                   04865000
CVTRSV09 EQU   CVTDCB                                                   04866000
CVT4MS1  EQU   CVTDCB                                                   04867000
CVT2SPS  EQU   CVTDCB                                                   04868000
CVT1SSS  EQU   CVTDCB                                                   04869000
CVTRSV08 EQU   CVTDCB                                                   04870000
CVTSTB   EQU   CVTMAP+112                                               04871000
CVTQTD00 EQU   CVTMAP+108                                               04872000
CVTQTE00 EQU   CVTMAP+104                                               04873000
CVTCUCB  EQU   CVTMAP+100                                               04874000
CVTSJQ   EQU   CVTMAP+96                                                04875000
CVTPBLDL EQU   CVTMAP+92                                                04876000
CVTTPC   EQU   CVTMAP+88                                                04877000
CVTSVDCB EQU   CVTMAP+84                                                04878000
CVTBRET  EQU   CVTMAP+82                                                04879000
CVTEXIT  EQU   CVTMAP+80                                                04880000
CVT0FN00 EQU   CVTMAP+76                                                04881000
CVTDARA  EQU   CVTDAR+1                                                 04882000
CVTRSV07 EQU   CVTFLGS1                                                 04883000
CVTRSV06 EQU   CVTFLGS1                                                 04884000
CVTRSV05 EQU   CVTFLGS1                                                 04885000
CVTRSV04 EQU   CVTFLGS1                                                 04886000
CVTRSV03 EQU   CVTFLGS1                                                 04887000
CVTRSV02 EQU   CVTFLGS1                                                 04888000
CVTRSV01 EQU   CVTFLGS1                                                 04889000
CVTDMPLK EQU   CVTFLGS1                                                 04890000
CVTXITP  EQU   CVTMAP+68                                                04891000
CVTZDTAB EQU   CVTMAP+64                                                04892000
CVTMSLT  EQU   CVTMAP+60                                                04893000
CVTDATE  EQU   CVTMAP+56                                                04894000
CVTBTERM EQU   CVTMAP+52                                                04895000
CVTSYSAD EQU   CVTMAP+48                                                04896000
CVTXTLER EQU   CVTMAP+44                                                04897000
CVTILK2  EQU   CVTMAP+40                                                04898000
CVTILK1  EQU   CVTMAP+36                                                04899000
CVTPRLTV EQU   CVTMAP+32                                                04900000
CVTPCNVT EQU   CVTMAP+28                                                04901000
CVT0VL00 EQU   CVTMAP+24                                                04902000
CVTXAPG  EQU   CVTMAP+20                                                04903000
CVTBUF   EQU   CVTMAP+16                                                04904000
CVTJOB   EQU   CVTMAP+12                                                04905000
CVTLINK  EQU   CVTMAP+8                                                 04906000
CVT0EF00 EQU   CVTMAP+4                                                 04907000
CVTTCBP  EQU   CVTMAP                                                   04908000
CVT      EQU   CVTMAP                                                   04909000
RPLSEQNO EQU   RPLOF60+6                                                04910000
@NM00026 EQU   RPLIBSQ                                                  04911000
RPLIINV  EQU   RPLIBSQ                                                  04912000
RPLINEG  EQU   RPLIBSQ                                                  04913000
RPLIPOS  EQU   RPLIBSQ                                                  04914000
RPLIIGN  EQU   RPLIBSQ                                                  04915000
RPLIRSET EQU   RPLIBSQ                                                  04916000
RPLITST  EQU   RPLIBSQ                                                  04917000
RPLISET  EQU   RPLIBSQ                                                  04918000
@NM00025 EQU   RPLOBSQ                                                  04919000
RPLOINV  EQU   RPLOBSQ                                                  04920000
RPLONEG  EQU   RPLOBSQ                                                  04921000
RPLOPOS  EQU   RPLOBSQ                                                  04922000
RPLOIGN  EQU   RPLOBSQ                                                  04923000
RPLORSET EQU   RPLOBSQ                                                  04924000
RPLOTST  EQU   RPLOBSQ                                                  04925000
RPLOSET  EQU   RPLOBSQ                                                  04926000
RPLIBSQV EQU   RPLOF60+2                                                04927000
RPLOBSQV EQU   RPLOF60                                                  04928000
@NM00024 EQU   RPLCNTSC                                                 04929000
RPLRSHUT EQU   RPLCNTSC                                                 04930000
RPLRQR   EQU   RPLCNTSC                                                 04931000
RPLSHUTC EQU   RPLCNTSC                                                 04932000
RPLSHUTD EQU   RPLCNTSC                                                 04933000
RPLSTSN  EQU   RPLCNTSC                                                 04934000
RPLCLEAR EQU   RPLCNTSC                                                 04935000
RPLSDT   EQU   RPLCNTSC                                                 04936000
@NM00023 EQU   RPLCNTDC                                                 04937000
RPLSIGNL EQU   RPLCNTDC                                                 04938000
RPLLUS   EQU   RPLCNTDC                                                 04939000
RPLRTR   EQU   RPLCNTDC                                                 04940000
RPLBID   EQU   RPLCNTDC                                                 04941000
@NM00022 EQU   RPLCNTDF                                                 04942000
RPLQI    EQU   RPLCNTDF                                                 04943000
RPLRELQ  EQU   RPLCNTDF                                                 04944000
RPLCHASE EQU   RPLCNTDF                                                 04945000
RPLQEC   EQU   RPLCNTDF                                                 04946000
RPLQC    EQU   RPLCNTDF                                                 04947000
RPLCNCEL EQU   RPLCNTDF                                                 04948000
RPLDATA  EQU   RPLCNTDF                                                 04949000
RPLRRN   EQU   RPLRESP                                                  04950000
RPLNFME  EQU   RPLRESP                                                  04951000
RPLEX    EQU   RPLRESP                                                  04952000
@NM00021 EQU   RPLRESP                                                  04953000
@NM00020 EQU   RPLPOSTV                                                 04954000
RPLSCHED EQU   RPLPOSTV                                                 04955000
@NM00019 EQU   RPLVTFL1                                                 04956000
RPLAUTUS EQU   RPLVTFL1                                                 04957000
RPLVTUSE EQU   RPLVTFL1                                                 04958000
@NM00018 EQU   RPLVTFL1                                                 04959000
@NM00017 EQU   RPLCHN                                                   04960000
RPLONLY  EQU   RPLCHN                                                   04961000
RPLLAST  EQU   RPLCHN                                                   04962000
RPLMIDLE EQU   RPLCHN                                                   04963000
RPLFIRST EQU   RPLCHN                                                   04964000
@NM00016 EQU   RPLRTYPE                                                 04965000
@NM00015 EQU   RPLSTYPE                                                 04966000
RPLSRESP EQU   RPLSTYPE                                                 04967000
@NM00014 EQU   RPLRH3                                                   04968000
RPLCSI   EQU   RPLRH3                                                   04969000
RPLCHREQ EQU   RPLRH3                                                   04970000
RPLCMD   EQU   RPLRH3                                                   04971000
RPLEB    EQU   RPLRH3                                                   04972000
RPLBB    EQU   RPLRH3                                                   04973000
RPLSIGDA EQU   RPLVTEXT+32                                              04974000
RPLSAV13 EQU   RPLVTEXT+28                                              04975000
RPLUSNSO EQU   RPLOSENS+2                                               04976000
RPLSSMO  EQU   RPLSSNSO+1                                               04977000
@NM00013 EQU   RPLSSEO                                                  04978000
RPLRRO   EQU   RPLSSEO                                                  04979000
RPLFIO   EQU   RPLSSEO                                                  04980000
RPLSTATO EQU   RPLSSEO                                                  04981000
RPLCPMO  EQU   RPLSSEO                                                  04982000
@NM00012 EQU   RPLSSEO                                                  04983000
RPLFMHDR EQU   RPLOPT12                                                 04984000
@NM00011 EQU   RPLOPT12                                                 04985000
@NM00010 EQU   RPLOPT12                                                 04986000
@NM00009 EQU   RPLOPT12                                                 04987000
RPLNIBTK EQU   RPLOPT12                                                 04988000
RPLTRUNC EQU   RPLOPT12                                                 04989000
RPLKEEP  EQU   RPLOPT12                                                 04990000
@NM00008 EQU   RPLOPT12                                                 04991000
RPLRSVE8 EQU   RPLOPT11                                                 04992000
RPLRSVE7 EQU   RPLOPT11                                                 04993000
RPLRSVE6 EQU   RPLOPT11                                                 04994000
RPLRSVE5 EQU   RPLOPT11                                                 04995000
RPLRSVE4 EQU   RPLOPT11                                                 04996000
RPLSTOP  EQU   RPLOPT11                                                 04997000
RPLSTART EQU   RPLOPT11                                                 04998000
RPLQUIES EQU   RPLOPT11                                                 04999000
RPLRSVI6 EQU   RPLOPT10                                                 05000000
RPLRSVI5 EQU   RPLOPT10                                                 05001000
RPLRSVI4 EQU   RPLOPT10                                                 05002000
RPLRSVI3 EQU   RPLOPT10                                                 05003000
RPLRSVI2 EQU   RPLOPT10                                                 05004000
RPLSPARM EQU   RPLOPT10                                                 05005000
RPLDSPLY EQU   RPLOPT10                                                 05006000
RPLBSCID EQU   RPLOPT10                                                 05007000
RPLTOPL  EQU   RPLOPT9                                                  05008000
RPLCIDE  EQU   RPLOPT9                                                  05009000
RPLRNNM  EQU   RPLOPT9                                                  05010000
RPLAPPST EQU   RPLOPT9                                                  05011000
RPLCOUNT EQU   RPLOPT9                                                  05012000
RPLTERMS EQU   RPLOPT9                                                  05013000
RPLDEVCH EQU   RPLOPT9                                                  05014000
RPLLOGON EQU   RPLOPT9                                                  05015000
RPLUSFLD EQU   RPLVTEXT+16                                              05016000
RPLESR2  EQU   RPLUSNSI+1                                               05017000
RPLESR1  EQU   RPLUSNSI                                                 05018000
RPLSSMI  EQU   RPLDSB2                                                  05019000
@NM00007 EQU   RPLSSEI                                                  05020000
RPLRRI   EQU   RPLSSEI                                                  05021000
RPLFII   EQU   RPLSSEI                                                  05022000
RPLSTATI EQU   RPLSSEI                                                  05023000
RPLCPMI  EQU   RPLSSEI                                                  05024000
RPLPATHI EQU   RPLSSEI                                                  05025000
RPLARCLN EQU   RPLVTEXT+8                                               05026000
RPLAARLN EQU   RPLVTEXT+4                                               05027000
RPLAAREA EQU   RPLVTEXT                                                 05028000
RPLERMSA EQU   RPLCOMN+72                                               05029000
RPLEMLEN EQU   RPLCOMN+70                                               05030000
RPLACTIV EQU   RPLCOMN+69                                               05031000
RPLBRANC EQU   RPLEXTD1                                                 05032000
RPLNIB   EQU   RPLEXTD1                                                 05033000
@NM00006 EQU   RPLEXTD1                                                 05034000
RPLEXIT  EQU   RPLEXTD1                                                 05035000
RPLNEXIT EQU   RPLEXTD1                                                 05036000
RPLEXSCH EQU   RPLEXTD1                                                 05037000
RPLDDDD  EQU   RPLRBAR+4                                                05038000
@NM00005 EQU   RPLRBAR+3                                                05039000
@NM00004 EQU   RPLAIXID                                                 05040000
RPLAXPKP EQU   RPLAIXID                                                 05041000
RPLAIXPC EQU   RPLRBAR                                                  05042000
RPLRSV88 EQU   RPLOPT8                                                  05043000
RPLUNCON EQU   RPLOPT8                                                  05044000
RPLACTV  EQU   RPLOPT8                                                  05045000
RPLSESS  EQU   RPLOPT8                                                  05046000
RPLPEND  EQU   RPLOPT8                                                  05047000
RPLODPRM EQU   RPLOPT8                                                  05048000
RPLODACP EQU   RPLOPT8                                                  05049000
RPLODACQ EQU   RPLOPT8                                                  05050000
RPLRSV78 EQU   RPLOPT7                                                  05051000
RPLTCRNO EQU   RPLOPT7                                                  05052000
RPLRLSOP EQU   RPLOPT7                                                  05053000
RPLTPOST EQU   RPLOPT7                                                  05054000
RPLQOPT  EQU   RPLOPT7                                                  05055000
RPLCNIMM EQU   RPLCNOPT                                                 05056000
RPLCNANY EQU   RPLCNOPT                                                 05057000
RPLCNALL EQU   RPLCNOPT                                                 05058000
RPLRSV68 EQU   RPLOPT6                                                  05059000
RPLRSV67 EQU   RPLOPT6                                                  05060000
RPLLOCK  EQU   RPLOPT6                                                  05061000
RPLNCOND EQU   RPLOPT6                                                  05062000
RPLCOND  EQU   RPLOPT6                                                  05063000
RPLEOT   EQU   RPLUNTYP                                                 05064000
RPLEOM   EQU   RPLUNTYP                                                 05065000
RPLEOB   EQU   RPLUNTYP                                                 05066000
RPLWROPT EQU   RPLOPT5                                                  05067000
RPLNODE  EQU   RPLOPT5                                                  05068000
RPLERACE EQU   RPLWRTYP                                                 05069000
RPLEAU   EQU   RPLWRTYP                                                 05070000
RPLNERAS EQU   RPLWRTYP                                                 05071000
RPLPSOPT EQU   RPLOPT5                                                  05072000
@NM00003 EQU   RPLOPT5                                                  05073000
RPLDLGIN EQU   RPLOPT5                                                  05074000
RPLBUFL  EQU   RPLCOMN+52                                               05075000
RPLRLEN  EQU   RPLCOMN+48                                               05076000
RPLCHAIN EQU   RPLNXTRP                                                 05077000
RPLBOP   EQU   RPLOPT4                                                  05078000
@NM00002 EQU   RPLOPT4                                                  05079000
RPLMKFRM EQU   RPLOPT4                                                  05080000
RPLENDTR EQU   RPLOPT4                                                  05081000
RPLALIGN EQU   RPLOPT3                                                  05082000
RPLFMT   EQU   RPLOPT3                                                  05083000
RPLFLD   EQU   RPLOPT3                                                  05084000
RPLVFY   EQU   RPLOPT3                                                  05085000
RPLBLK   EQU   RPLOPT3                                                  05086000
RPLSFORM EQU   RPLOPT3                                                  05087000
RPLEODS  EQU   RPLOPT3                                                  05088000
RPLNSP   EQU   RPLOPT2                                                  05089000
RPLUPD   EQU   RPLOPT2                                                  05090000
@NM00001 EQU   RPLOPT2                                                  05091000
RPLLRD   EQU   RPLOPT2                                                  05092000
RPLBWD   EQU   RPLOPT2                                                  05093000
RPLCNV   EQU   RPLOPT2                                                  05094000
RPLADD   EQU   RPLADR                                                   05095000
RPLKEY   EQU   RPLOPT2                                                  05096000
RPLECBIN EQU   RPLECBSW                                                 05097000
RPLGEN   EQU   RPLOPT1                                                  05098000
RPLKGE   EQU   RPLOPT1                                                  05099000
RPLASY   EQU   RPLOPT1                                                  05100000
RPLSKP   EQU   RPLOPT1                                                  05101000
RPLSEQ   EQU   RPLOPT1                                                  05102000
RPLDIR   EQU   RPLOPT1                                                  05103000
RPLLOC   EQU   RPLOPT1                                                  05104000
RPLDAF   EQU   RPLARG+2                                                 05105000
RPLSAF   EQU   RPLARG                                                   05106000
RPLTCBPT EQU   RPLCOMN+28                                               05107000
RPLDACB  EQU   RPLCOMN+24                                               05108000
RPLCCHAR EQU   RPLCOMN+20                                               05109000
RPLSTRID EQU   RPLCOMN+18                                               05110000
RPLKEYL  EQU   RPLKEYLE                                                 05111000
RPLRDSOH EQU   RPLFDB3                                                  05112000
RPLRLG   EQU   RPLFDB3                                                  05113000
RPLLGFRC EQU   RPLFDB3                                                  05114000
RPLREOT  EQU   RPLFDB3                                                  05115000
RPLREOM  EQU   RPLFDB3                                                  05116000
RPLREOB  EQU   RPLFDB3                                                  05117000
RPLSV32  EQU   RPLFDB3                                                  05118000
RPLUINPT EQU   RPLFDB3                                                  05119000
RPLSTSAV EQU   RPLFDB2                                                  05120000
RPLCUERR EQU   RPLFDB2                                                  05121000
RPLDLGFL EQU   RPLFDB2                                                  05122000
RPLIOERR EQU   RPLFDB2                                                  05123000
RPLDVUNS EQU   RPLFDB2                                                  05124000
RPLATND  EQU   RPLFDB2                                                  05125000
RPLRVID  EQU   RPLFDB2                                                  05126000
RPLERLK  EQU   RPLFDB2                                                  05127000
RPLERREG EQU   RPLRTNCD                                                 05128000
RPLSTAT  EQU   RPLFDBWD                                                 05129000
RPLPOST  EQU   RPLECB                                                   05130000
RPLWAIT  EQU   RPLECB                                                   05131000
RPLLEN2  EQU   RPLLEN                                                   05132000
RPLSTYP  EQU   RPLIDWD+1                                                05133000
@NM00052 EQU   PSA+3668                                                 05134000
PSASTAK  EQU   PSA+3072                                                 05135000
@NM00051 EQU   PSA+1048                                                 05136000
PSAUSEND EQU   PSA+1048                                                 05137000
PSARV062 EQU   PSA+1044                                                 05138000
PSACDAL  EQU   PSA+1040                                                 05139000
PSAWTCOD EQU   PSA+1036                                                 05140000
PSAATCVT EQU   PSA+1032                                                 05141000
PSAPCPSW EQU   PSA+1024                                                 05142000
PSAPIR2  EQU   PSA+1020                                                 05143000
PSARV059 EQU   PSA+1018                                                 05144000
PSASVC13 EQU   PSA+1016                                                 05145000
PSALSFCC EQU   PSA+1012                                                 05146000
PSASFACC EQU   PSA+1008                                                 05147000
PSASTOP  EQU   PSA+992                                                  05148000
PSASTART EQU   PSA+976                                                  05149000
PSARSPSW EQU   PSA+968                                                  05150000
PSASRPSW EQU   PSA+960                                                  05151000
PSARV045 EQU   PSA+892                                                  05152000
PSARV044 EQU   PSA+888                                                  05153000
PSARV043 EQU   PSA+884                                                  05154000
PSARV042 EQU   PSA+880                                                  05155000
PSARV041 EQU   PSA+876                                                  05156000
PSARV040 EQU   PSA+872                                                  05157000
PSARV025 EQU   PSA+868                                                  05158000
PSADSSED EQU   PSA+868                                                  05159000
PSADSSPR EQU   PSA+864                                                  05160000
PSADSSFW EQU   PSA+860                                                  05161000
PSADSS14 EQU   PSA+856                                                  05162000
PSADSSPP EQU   PSA+848                                                  05163000
PSADSSRP EQU   PSA+840                                                  05164000
PSADSS05 EQU   PSADSSF4                                                 05165000
PSADSS10 EQU   PSADSSF4                                                 05166000
PSADSSVE EQU   PSADSSF4                                                 05167000
PSADSSDE EQU   PSADSSF4                                                 05168000
PSADSSC0 EQU   PSADSSF4                                                 05169000
PSADSSIE EQU   PSADSSF4                                                 05170000
PSADSS12 EQU   PSADSSF4                                                 05171000
PSADSSRC EQU   PSADSSF4                                                 05172000
PSARV057 EQU   PSADSSF3                                                 05173000
PSARV056 EQU   PSADSSF3                                                 05174000
PSARV055 EQU   PSADSSF3                                                 05175000
PSADSSMC EQU   PSADSSF3                                                 05176000
PSADSSRW EQU   PSADSSF3                                                 05177000
PSADSSNM EQU   PSADSSF3                                                 05178000
PSADSSES EQU   PSADSSF3                                                 05179000
PSADSSGP EQU   PSADSSF3                                                 05180000
PSADSSF2 EQU   PSADSSFL+1                                               05181000
PSADSSPI EQU   PSADSSF1                                                 05182000
PSADSSOI EQU   PSADSSF1                                                 05183000
PSADSSSP EQU   PSADSSF1                                                 05184000
PSADSSTP EQU   PSADSSF1                                                 05185000
PSADSSDW EQU   PSADSSF1                                                 05186000
PSADSSDD EQU   PSADSSF1                                                 05187000
PSADSSDM EQU   PSADSSF1                                                 05188000
PSADSSMV EQU   PSADSSF1                                                 05189000
PSADSSTS EQU   PSA+816                                                  05190000
PSADSSWK EQU   PSA+812                                                  05191000
PSADSSR3 EQU   PSA+808                                                  05192000
PSADSSR2 EQU   PSA+804                                                  05193000
PSADSSRS EQU   PSA+800                                                  05194000
PSASTOR  EQU   PSA+796                                                  05195000
PSACPUSA EQU   PSA+794                                                  05196000
PSAVSTAP EQU   PSA+792                                                  05197000
PSAWKVAP EQU   PSA+788                                                  05198000
PSAWKRAP EQU   PSA+784                                                  05199000
PSAMCHIC EQU   PSA+783                                                  05200000
PSARV061 EQU   PSA+782                                                  05201000
PSASYMSK EQU   PSA+781                                                  05202000
PSAMCHFL EQU   PSA+780                                                  05203000
PSACR0   EQU   PSA+776                                                  05204000
PSAPSWSV EQU   PSA+768                                                  05205000
PSALITA  EQU   PSA+764                                                  05206000
PSACLHS  EQU   PSAHLHI                                                  05207000
PSALKR15 EQU   PSALKSA+60                                               05208000
PSALKR14 EQU   PSALKSA+56                                               05209000
PSALKR13 EQU   PSALKSA+52                                               05210000
PSALKR12 EQU   PSALKSA+48                                               05211000
PSALKR11 EQU   PSALKSA+44                                               05212000
PSALKR10 EQU   PSALKSA+40                                               05213000
PSALKR9  EQU   PSALKSA+36                                               05214000
PSALKR8  EQU   PSALKSA+32                                               05215000
PSALKR7  EQU   PSALKSA+28                                               05216000
PSALKR6  EQU   PSALKSA+24                                               05217000
PSALKR5  EQU   PSALKSA+20                                               05218000
PSALKR4  EQU   PSALKSA+16                                               05219000
PSALKR3  EQU   PSALKSA+12                                               05220000
PSALKR2  EQU   PSALKSA+8                                                05221000
PSALKR1  EQU   PSALKSA+4                                                05222000
PSALKR0  EQU   PSALKSA                                                  05223000
PSARV023 EQU   PSACLHT+52                                               05224000
PSALOCAL EQU   PSACLHT+48                                               05225000
PSACMSL  EQU   PSACLHT+44                                               05226000
PSAOPTL  EQU   PSACLHT+40                                               05227000
PSATPACL EQU   PSACLHT+36                                               05228000
PSATPDNL EQU   PSACLHT+32                                               05229000
PSATPNCL EQU   PSACLHT+28                                               05230000
PSAIOSLL EQU   PSACLHT+24                                               05231000
PSAIOSUL EQU   PSACLHT+20                                               05232000
PSAIOSCL EQU   PSACLHT+16                                               05233000
PSAIOSSL EQU   PSACLHT+12                                               05234000
PSASALCL EQU   PSACLHT+8                                                05235000
PSAASML  EQU   PSACLHT+4                                                05236000
PSADISPL EQU   PSACLHT                                                  05237000
PSASRSA  EQU   PSA+636                                                  05238000
PSARV050 EQU   PSA+634                                                  05239000
PSADSSGO EQU   PSA+633                                                  05240000
PSARECUR EQU   PSA+632                                                  05241000
PSAHLHIS EQU   PSA+628                                                  05242000
PSAIPCSA EQU   PSA+624                                                  05243000
@NM00050 EQU   PSA+621                                                  05244000
PSAIPCDM EQU   PSA+620                                                  05245000
PSAIPCD  EQU   PSA+616                                                  05246000
@NM00049 EQU   PSA+613                                                  05247000
PSAIPCRM EQU   PSA+612                                                  05248000
PSAIPCR  EQU   PSA+608                                                  05249000
PSAMCHEX EQU   PSA+600                                                  05250000
PSAMPSW  EQU   PSA+592                                                  05251000
PSAEXPS2 EQU   PSA+584                                                  05252000
PSAEXPS1 EQU   PSA+576                                                  05253000
PSAPIREG EQU   PSA+572                                                  05254000
PSARSREG EQU   PSA+568                                                  05255000
PSAGPREG EQU   PSA+556                                                  05256000
PSARV022 EQU   PSASUP4                                                  05257000
PSARV021 EQU   PSASUP4                                                  05258000
PSARV020 EQU   PSASUP4                                                  05259000
PSARV019 EQU   PSASUP4                                                  05260000
PSARV018 EQU   PSASUP4                                                  05261000
PSARV017 EQU   PSASUP4                                                  05262000
PSARV016 EQU   PSASUP4                                                  05263000
PSARV015 EQU   PSASUP4                                                  05264000
PSARV014 EQU   PSASUP3                                                  05265000
PSARV013 EQU   PSASUP3                                                  05266000
PSARV012 EQU   PSASUP3                                                  05267000
PSARV011 EQU   PSASUP3                                                  05268000
PSASPR   EQU   PSASUP3                                                  05269000
PSAPSREG EQU   PSASUP3                                                  05270000
PSAPI2   EQU   PSASUP3                                                  05271000
PSAIOSUP EQU   PSASUP3                                                  05272000
PSALCR   EQU   PSASUP2                                                  05273000
PSARTM   EQU   PSASUP2                                                  05274000
PSAACR   EQU   PSASUP2                                                  05275000
PSAIPCE2 EQU   PSASUP2                                                  05276000
PSAIPCES EQU   PSASUP2                                                  05277000
PSAIPCEC EQU   PSASUP2                                                  05278000
PSAGTF   EQU   PSASUP2                                                  05279000
PSAIPCRI EQU   PSASUP2                                                  05280000
PSARV063 EQU   PSASUP1                                                  05281000
PSATCTL  EQU   PSASUP1                                                  05282000
PSADISP  EQU   PSASUP1                                                  05283000
PSALOCK  EQU   PSASUP1                                                  05284000
PSAPI    EQU   PSASUP1                                                  05285000
PSAEXT   EQU   PSASUP1                                                  05286000
PSASVC   EQU   PSASUP1                                                  05287000
PSAIO    EQU   PSASUP1                                                  05288000
PSAAOLD  EQU   PSA+548                                                  05289000
PSAANEW  EQU   PSA+544                                                  05290000
PSATOLD  EQU   PSA+540                                                  05291000
PSATNEW  EQU   PSA+536                                                  05292000
PSALCCAR EQU   PSA+532                                                  05293000
PSALCCAV EQU   PSA+528                                                  05294000
PSAPCCAR EQU   PSA+524                                                  05295000
PSAPCCAV EQU   PSA+520                                                  05296000
PSACPULA EQU   PSA+518                                                  05297000
PSACPUPA EQU   PSA+516                                                  05298000
PSAPSA   EQU   PSA+512                                                  05299000
FLCHDEND EQU   PSA+512                                                  05300000
FLCCRSAV EQU   FLCMCLA+280                                              05301000
FLCGRSAV EQU   FLCMCLA+216                                              05302000
FLCFPSAV EQU   FLCMCLA+184                                              05303000
FLCFLA   EQU   FLCMCLA+88                                               05304000
FLCRGNCD EQU   FLCMCLA+84                                               05305000
FLCFSAA  EQU   FLCFSA+1                                                 05306000
@NM00048 EQU   FLCFSA                                                   05307000
@NM00047 EQU   FLCMCLA+72                                               05308000
FLCMCIC  EQU   FLCMCLA+64                                               05309000
@NM00046 EQU   FLCMCLA+20                                               05310000
FLCIOAA  EQU   FLCIOA+1                                                 05311000
@NM00045 EQU   FLCIOA                                                   05312000
@NM00044 EQU   FLCMCLA+15                                               05313000
@NM00043 EQU   FLCMCLA+14                                               05314000
@NM00042 EQU   FLCMCLA+12                                               05315000
FLCLCL   EQU   FLCMCLA+8                                                05316000
FLCIOELA EQU   FLCIOEL+1                                                05317000
@NM00041 EQU   FLCIOEL                                                  05318000
FLCCHNID EQU   FLCMCLA                                                  05319000
@NM00040 EQU   PSA+160                                                  05320000
FLCMTRCD EQU   PSA+157                                                  05321000
@NM00039 EQU   PSA+156                                                  05322000
FLCPERA  EQU   FLCPER+1                                                 05323000
@NM00038 EQU   FLCPER                                                   05324000
@NM00037 EQU   PSA+151                                                  05325000
FLCPERCD EQU   PSA+150                                                  05326000
FLCMCNUM EQU   PSA+149                                                  05327000
@NM00036 EQU   PSA+148                                                  05328000
FLCTEAA  EQU   FLCTEA+1                                                 05329000
@NM00035 EQU   FLCTEA                                                   05330000
PSAPIPC  EQU   PSAPICOD                                                 05331000
PSAPIMC  EQU   PSAPICOD                                                 05332000
PSAPIPER EQU   PSAPICOD                                                 05333000
PSARV049 EQU   FLCPICOD                                                 05334000
FLCPILCB EQU   FLCPIILC                                                 05335000
@NM00034 EQU   FLCPIILC                                                 05336000
@NM00033 EQU   PSAEPPSW                                                 05337000
FLCSVCN  EQU   PSAESPSW+2                                               05338000
FLCSILCB EQU   FLCSVILC                                                 05339000
@NM00032 EQU   FLCSVILC                                                 05340000
@NM00031 EQU   PSAESPSW                                                 05341000
FLCEICOD EQU   PSAEEPSW+2                                               05342000
PSASPAD  EQU   PSAEEPSW                                                 05343000
@NM00030 EQU   PSA+128                                                  05344000
FLCINPSW EQU   PSA+120                                                  05345000
FLCMNPSW EQU   PSA+112                                                  05346000
FLCPNPSW EQU   PSA+104                                                  05347000
FLCSNPSW EQU   PSA+96                                                   05348000
FLCENPSW EQU   PSA+88                                                   05349000
FLCTRACE EQU   PSA+84                                                   05350000
FLCTIMER EQU   PSA+80                                                   05351000
FLCCVT2  EQU   PSA+76                                                   05352000
FLCCAW   EQU   PSA+72                                                   05353000
FLCCSW   EQU   PSA+64                                                   05354000
FLCIOPSW EQU   PSA+56                                                   05355000
FLCMOPSW EQU   PSA+48                                                   05356000
FLCPOPSW EQU   PSA+40                                                   05357000
FLCSOPSW EQU   PSA+32                                                   05358000
FLCEOPSW EQU   PSA+24                                                   05359000
@NM00029 EQU   FLCICCW2+4                                               05360000
FLCCVT   EQU   FLCICCW2                                                 05361000
FLCICCW1 EQU   FLCROPSW                                                 05362000
FLCIPPSW EQU   FLCRNPSW                                                 05363000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      05364000
@RC00481 EQU   @RC00479                                                 05365000
@RT00626 EQU   ISTA0051                                                 05366000
@RT00600 EQU   @RC00590                                                 05367000
@RC00585 EQU   @RC00570                                                 05368000
@RC00734 EQU   @RC00731                                                 05369000
@RT00772 EQU   ISTA0072                                                 05370000
@RF00792 EQU   @RC00695                                                 05371000
@RC00856 EQU   @RC00853                                                 05372000
@RT01086 EQU   @RC01082                                                 05373000
@RC00947 EQU   @RC00886                                                 05374000
@RC00833 EQU   @RC00827                                                 05375000
@RC00880 EQU   @RC00827                                                 05376000
@PB00002 EQU   @PB00003                                                 05377000
@RC00485 EQU   @RC00481                                                 05378000
@RC00955 EQU   @RC00947                                                 05379000
@RT00882 EQU   @RC00880                                                 05380000
@RC01129 EQU   @RC00880                                                 05381000
@RC00958 EQU   @RC00955                                                 05382000
@RC00990 EQU   @RC00958                                                 05383000
@ENDDATA EQU   *                                                        05384000
         END   ISTDCC00,(C'PLS1742',0603,75288)                         05385000
