SVTM     TITLE ' SSCP -- ISTINCVS -- VARY ACTIVATE/SYSDEF INTERFACE    *00001000
                        '                                               00002000
ISTINCVS CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTINCVS  76.205'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
*                                POOL- IF ON                 @XM19499*/ 00014000
*                                                                  0614 00015000
*                                                                  0615 00016000
*   /*****************************************************************/ 00017000
*   /*                                                               */ 00018000
*   /* MESSAGES                                                      */ 00019000
*   /*                                                               */ 00020000
*   /*****************************************************************/ 00021000
*                                                                  0615 00022000
*CVSMSGS:                                                          0615 00023000
*   ;                                                              0615 00024000
*                                                                  0615 00025000
CVSMSGS  DS    0H                                                  0616 00026000
*/*  IST061I VARY FAILED- ID=XXXXXXXX UNKNOWN TO VTAM                */ 00027000
*                                                                  0616 00028000
*   DCL                                                            0616 00029000
*     CVSMS061 BDY(WORD)CHAR(4)INIT('061I');                       0616 00030000
*                                                                  0616 00031000
*/*                                                                  */ 00032000
*/*  IST066I VVVVVVVV FAILED- INVALID OPTIONS                        */ 00033000
*                                                                  0617 00034000
*   DCL                                                            0617 00035000
*     CVSMS066 BDY(WORD)CHAR(4)INIT('066I');                       0617 00036000
*                                                                  0617 00037000
* /*                                                                 */ 00038000
*/*  IST072I VARY FAILED DURING NETWORK DEFINITION OF XXXXXXXX       */ 00039000
*                                                                  0618 00040000
*   DCL                                                            0618 00041000
*     CVSMS072 BDY(WORD)CHAR(4)INIT('072I');                       0618 00042000
*                                                                  0618 00043000
*/*                                                                  */ 00044000
*/*  IST074I VVVVVVVV FAILED FOR ID=XXXXXXXX- INSUFFICIENT STORAGE   */ 00045000
*                                                                  0619 00046000
*   DCL                                                            0619 00047000
*      CVSMS074 BDY(WORD)CHAR(4)INIT('074I');                      0619 00048000
*                                                                  0619 00049000
*/*                                                                  */ 00050000
*/*  IST093I XXXXXXXX ACTIVE                                         */ 00051000
*                                                                  0620 00052000
*   DCL                                                            0620 00053000
*     CVSMS093 BDY(WORD)CHAR(4)INIT('093I');                       0620 00054000
*                                                                  0620 00055000
*/*                                                                  */ 00056000
*/*  IST602I VVVVVVVV FAILED FOR ID=XXXXXXXX - HIGHER NODE HAS BECOME   00057000
*       INACTIVE                                                     */ 00058000
*                                                                  0621 00059000
*   DCL                                                            0621 00060000
*     CVSMS602 BDY(WORD)CHAR(4)INIT('602I');                       0621 00061000
*                                                                  0622 00062000
*   /*****************************************************************/ 00063000
*   /*                                                               */ 00064000
*   /* SAVE CALLER'S REGS IN THE WORKAREA, DECREMENT REG 13 BY 72 TO */ 00065000
*   /* POINT TO THIS ROUTINE'S REGISTER SAVE AREA IN THE WORKAREA,   */ 00066000
*   /* CHAIN THE SAVE AREAS, RESET LOCAL SWITCHES IN THE WORKAREA,   */ 00067000
*   /* PROCEED WITH PROCESSING.                                      */ 00068000
*   /*                                                               */ 00069000
*   /*****************************************************************/ 00070000
*                                                                  0622 00071000
*   RFY                                                            0622 00072000
*     CVSR7 RSTD;                                                  0622 00073000
*                                                                  0622 00074000
*    DO;                                                           0623 00075000
*/***  CRRMAINT  PROCNM(ISTINCVS)COMP(VY)FUNC(SUB)RPHADD((NCSPLRPH))  * 00076000
**/                                                                0624 00077000
*                                                                  0624 00078000
*/* ATBUILD (ISTRPH,ISTCRA,ISTPFCRR,ISTVYCRR)  */                  0624 00079000
*/* END OF ATBUILD */                                              0624 00080000
*    /*** SET ENTERED BIT FOR THIS PROCEDURE ***/                  0624 00081000
*NCSPLRPH->RPHCRR->CRACRR->NINCVS = '1'B;                          0624 00082000
         L     @15,NCSPLRPH(,CVSR1)                                0624 00083000
         L     @15,RPHCRR(,@15)                                    0624 00084000
         L     @15,CRACRR(,@15)                                    0624 00085000
         OI    NINCVS(@15),B'00000100'                             0624 00086000
*    /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/                 0625 00087000
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          0625 00088000
         XC    VYCCRT+1(11,@15),VYCCRT+1(@15)                      0625 00089000
         MVI   VYCCRT(@15),B'00000000'                             0625 00090000
*NCSPLRPH->RPHCRR->CRACRR->CINCVS = '1'B;                          0626 00091000
         OI    CINCVS(@15),B'00000100'                             0626 00092000
*    END;                                                          0627 00093000
*   GEN REFS(CVSWAPTR);                                            0628 00094000
      USING  @DATD,CVSWAPTR                                             00095000
*   CVSR7=CVSR13;                   /* SAVE CALLER'S SAVE AREA     0629 00096000
*                                      ADDRESS                       */ 00097000
         LR    CVSR7,CVSR13                                        0629 00098000
*   CVSR13=CVSR13-(LENGTH(CVSSVARA));/* DECREMENT R13 BY 72          */ 00099000
         SL    CVSR13,@CF01802                                     0630 00100000
*   CVSSVBKP=CVSR7;                 /* CHAIN CALLER'S SAVE AREA TO 0631 00101000
*                                      THIS ROUTINE'S                */ 00102000
         ST    CVSR7,CVSSVBKP(,CVSR13)                             0631 00103000
*   CVSSVFWP=0;                     /* ZERO THIS RTNS SAVEAREA     0632 00104000
*                                      FORWARD PTR                   */ 00105000
         SLR   @15,@15                                             0632 00106000
         ST    @15,CVSSVFWP(,CVSR13)                               0632 00107000
*   CVSR7->CVSSVFWP=CVSR13;         /* CHAIN THIS ROUTINES'S SAVE  0633 00108000
*                                      AREA TO CALLER'S              */ 00109000
         ST    CVSR13,CVSSVFWP(,CVSR7)                             0633 00110000
*   CVSWAPTR=CVSR1->NCSPLWKA->CVSWKA;/* GET WORKAREA ADDRESS         */ 00111000
         L     @15,NCSPLWKA(,CVSR1)                                0634 00112000
         L     CVSWAPTR,CVSWKA(,@15)                               0634 00113000
*   CVSWKA=CVSWAPTR+@SIZDATD+(CVS8-(@SIZDATD//CVS8));    /* RESET NEXT  00114000
*                                AVAILABLE WORKAREA ADDRESS  @D32CKC8*/ 00115000
         L     @11,@SIZDATD                                        0635 00116000
         LR    @00,CVSWAPTR                                        0635 00117000
         ALR   @00,@11                                             0635 00118000
         LR    @02,@11                                             0635 00119000
         SRDA  @02,32                                              0635 00120000
         D     @02,@CF00092                                        0635 00121000
         LCR   @02,@02                                             0635 00122000
         AL    @02,@CF00092                                        0635 00123000
         ALR   @00,@02                                             0635 00124000
         ST    @00,CVSWKA(,@15)                                    0635 00125000
*   NCSPLPTR=CVSR1;                 /* ESTABLISH NCSPL BASE ADR      */ 00126000
         LR    NCSPLPTR,CVSR1                                      0636 00127000
*   CVSSWTCH=0;                     /* INITIALIZE ALL SWITCHES       */ 00128000
         MVI   CVSSWTCH,X'00'                                      0637 00129000
*   CVSVARY='VARY    ';             /* INITIALIZE 'VARY' MESSAGE   0638 00130000
*                                      VARIABLE                      */ 00131000
         MVC   CVSVARY(8),@CC04823                                 0638 00132000
*   CVSNAME1=NCSPLRID;              /* INITIALIZE NODENAME MESSAGE 0639 00133000
*                                      VARIABLE TO COMMAND NODENAME  */ 00134000
         MVC   CVSNAME1(8),NCSPLRID(CVSR1)                         0639 00135000
*   RFY                                                            0640 00136000
*     CVSR7 UNRSTD;                                                0640 00137000
*   RFY                                                            0641 00138000
*     ISTNCSPL BASED(NCSPLPTR);     /* NEW BASE FOR NCSPL            */ 00139000
*                                                                  0641 00140000
*       /*************************************************************/ 00141000
*       /*                                                           */ 00142000
*       /* RDTE NOT PROVIDED - GOTO THE SYS. DEF. INTERFACE          */ 00143000
*       /* SUBROUTINE.                                               */ 00144000
*       /*                                                           */ 00145000
*       /*************************************************************/ 00146000
*                                                                  0642 00147000
*        /*SEGMENT(CVSSR10)REQUEST*/DO;GOTO CVSSR10;CVSSR10#:END;  0642 00148000
         B     CVSSR10                                             0643 00149000
CVSSR10# DS    0H                                                  0645 00150000
*       IF CVSGOSW='1'B             /* GO SWITCH ON?                 */ 00151000
*        THEN                       /* YES -                         */ 00152000
         TM    CVSGOSW,B'10000000'                                 0645 00153000
         BNO   @RF00645                                            0645 00154000
*         IF NCSVSTAT='1'B          /* THIS NCSPL FLAGGED AS STATIC? */ 00155000
*         THEN                      /* YES- GO COPY NCSPL            */ 00156000
         TM    NCSVSTAT(NCSPLPTR),B'00100000'                      0646 00157000
         BNO   @RF00646                                            0646 00158000
*          /*SEGMENT(CVSCOPY)REQUEST*/DO;GOTO CVSCOPY;CVSCOPY#:END;     00159000
         B     CVSCOPY                                             0648 00160000
*         ELSE                      /* NO - MODIFY THIS NCSPL        */ 00161000
*         CALL CVSQUE;                                     /*@X50BHC8*/ 00162000
         B     @RC00646                                            0650 00163000
@RF00646 BAL   @14,CVSQUE                                          0650 00164000
*       ELSE                                                       0651 00165000
*         ;                                                        0651 00166000
@RF00645 DS    0H                                                  0652 00167000
*     IF CVSSOM='1'B                /* SUPPRESS OPER MESSAGES?       */ 00168000
*       THEN                                                       0652 00169000
@RC00645 TM    CVSSOM,B'01000000'                                  0652 00170000
         BO    @RT00652                                            0652 00171000
*       ;                           /* YES - EXIT                    */ 00172000
*     ELSE DO;                                                     0654 00173000
*       CALL CVSTPMSG;              /* NO - GO OUTPUT MSG            */ 00174000
         BAL   @14,CVSTPMSG                                        0655 00175000
*   IF NCSPLLPT=0                   /* IS THE APPLICATION LOGON POINTER 00176000
*                                      ZERO?                         */ 00177000
*     THEN;                         /* YES - EXIT                    */ 00178000
         L     @15,NCSPLLPT(,NCSPLPTR)                             0656 00179000
         LTR   @15,@15                                             0656 00180000
         BZ    @RT00656                                            0656 00181000
*     ELSE                                                         0658 00182000
*       DO;                                                        0658 00183000
*         RFY                                                      0659 00184000
*           CVSR0 RSTD;                                            0659 00185000
*                                                                  0659 00186000
*         /***********************************************************/ 00187000
*         /*                                                         */ 00188000
*         /* GET THE VOC LOCK                                        */ 00189000
*         /*                                                         */ 00190000
*         /***********************************************************/ 00191000
*                                                                  0660 00192000
*         CVSR0=CVS0;                                              0660 00193000
         SLR   CVSR0,CVSR0                                         0660 00194000
*         CALL CVSSRLOC;                                           0661 00195000
         BAL   @14,CVSSRLOC                                        0661 00196000
*         CVSWKRDT=NCSPLLPT;        /* GET THE ADDRESS OF THE SIMLOGON  00197000
*                                      APPLICATION ENTRY             */ 00198000
         L     CVSWKRDT,NCSPLLPT(,NCSPLPTR)                        0662 00199000
*         DO WHILE CVSWKRDT->RPRENTRY^=RPRENTAH;/* LOOK FOR THE    0663 00200000
*                                      APPLICATION HEADER ENTRY      */ 00201000
         B     @DE00663                                            0663 00202000
@DL00663 DS    0H                                                  0664 00203000
*           CVSWKRDT=CVSWKRDT->RPRNSNEA;/* GET THE NEXT HIGHER NODE  */ 00204000
         L     CVSWKRDT,RPRNSNEA(,CVSWKRDT)                        0664 00205000
*         END;                                                     0665 00206000
@DE00663 CLI   RPRENTRY(CVSWKRDT),X'02'                            0665 00207000
         BNE   @DL00663                                            0665 00208000
*         CVSWKRDT->RDTLGCT=CVSWKRDT->RDTLGCT-CVS1;/* DECREMENT THE     00209000
*                                      LOGON COUNT IN THE APPLICATION   00210000
*                                      HEADER                        */ 00211000
*                                                                  0666 00212000
         SLR   @15,@15                                             0666 00213000
         IC    @15,RDTLGCT(,CVSWKRDT)                              0666 00214000
         BCTR  @15,0                                               0666 00215000
         STC   @15,RDTLGCT(,CVSWKRDT)                              0666 00216000
*         /***********************************************************/ 00217000
*         /*                                                         */ 00218000
*         /* RELEASE THE VOC LOCK                                    */ 00219000
*         /*                                                         */ 00220000
*         /***********************************************************/ 00221000
*                                                                  0667 00222000
*         CVSR0=CVS10;                                             0667 00223000
         LA    CVSR0,10                                            0667 00224000
*         CALL CVSSRLOC;                                           0668 00225000
         BAL   @14,CVSSRLOC                                        0668 00226000
*         RFY                                                      0669 00227000
*           CVSR0 UNRSTD;                                          0669 00228000
*       END;                                                       0670 00229000
*     END;                                                         0671 00230000
@RT00656 DS    0H                                                  0672 00231000
*   NCSVDEL=CVSON;                  /* INDICATE DELETE NCSPL         */ 00232000
@RT00652 OI    NCSVDEL(NCSPLPTR),B'01000000'                       0672 00233000
*   CVSWKA=CVSWAPTR;                /* RESET WORKAREA PTR            */ 00234000
         L     @15,NCSPLWKA(,NCSPLPTR)                             0673 00235000
         ST    CVSWAPTR,CVSWKA(,@15)                               0673 00236000
*   CVSR13=CVSSVBKP;                /* GET ADDR OF CALLER'S SAVEAREA    00237000
*                                      --                            */ 00238000
         L     CVSR13,CVSSVBKP(,CVSR13)                            0674 00239000
*   RETURN;                         /* RESTORE REGS AND EXIT         */ 00240000
@EL00001 DS    0H                                                  0675 00241000
@EF00001 DS    0H                                                  0675 00242000
@ER00001 LM    @14,@12,12(@13)                                     0675 00243000
         BR    @14                                                 0675 00244000
*   GEN(  EJECT);                                                  0676 00245000
*                                                                  0676 00246000
           EJECT                                                        00247000
*   /*****************************************************************/ 00248000
*   /*                                                               */ 00249000
*   /* COPY NCSPL SUBROUTINE                                         */ 00250000
*   /*                                                               */ 00251000
*   /*****************************************************************/ 00252000
*                                                                  0677 00253000
*    /*SEGMENT(CVSCOPY)START*/DO;GOTO CVSCOPY@;CVSCOPY:END;        0677 00254000
         B     CVSCOPY@                                            0678 00255000
CVSCOPY  DS    0H                                                  0680 00256000
*   DCL I FIXED(31);      /* LOOP CONTROL COUNTER            @X50BHC8*/ 00257000
*   RFY                                                            0681 00258000
*     (CVSR0,CVSR15) RSTD;                                 /*@D32CKDQ*/ 00259000
*   RFY ISTVYCRR BASED(NCSPLRPH->RPHCRR->CRACRR);          /*@D32CKDQ*/ 00260000
*   RFY ISTGTNCS BASED(ADDR(VYCRRCW3));                    /*@D32CKDQ*/ 00261000
*   CVSR1=NCSPLRPH;                 /* GET RPH ADDRESS               */ 00262000
*                                                                  0684 00263000
         L     @11,NCSPLRPH(,NCSPLPTR)                             0684 00264000
         LR    CVSR1,@11                                           0684 00265000
*   /*****************************************************************/ 00266000
*   /*                                                               */ 00267000
*   /* OBTAIN STORAGE FOR A NEW NCSPL:                               */ 00268000
*   /*                                                               */ 00269000
*   /*****************************************************************/ 00270000
*                                                                  0685 00271000
*   CVSR0=ADDR(VYCRRCW3);            /*PARM PTR              @D32CKDQ*/ 00272000
         L     @11,RPHCRR(,@11)                                    0685 00273000
         L     @11,CRACRR(,@11)                                    0685 00274000
         LA    CVSR0,VYCRRCW3(,@11)                                0685 00275000
*   VYCRRCW3=VYCRRCW3&&VYCRRCW3;        /*PARM LIST          @D32CKDQ*/ 00276000
         XC    VYCRRCW3(8,@11),VYCRRCW3(@11)                       0686 00277000
*   GTNCSREQ=CVSON;                 /*REQSTORE PERMITTED     @D32CKDQ*/ 00278000
*   GTNCSRQU=CVSON;                 /*Q OPTON REQSTOR OK     @D32CKDQ*/ 00279000
         OI    GTNCSREQ+118(@11),B'11000000'                       0688 00280000
*   CALL ISTINCW3;                  /*GET NCSPL AND WKA      @D32CKDQ*/ 00281000
         L     @11,NCSPLCVT(,NCSPLPTR)                             0689 00282000
         L     @15,ATCINCW3(,@11)                                  0689 00283000
         BALR  @14,@15                                             0689 00284000
*   IF CVSR15^=CVS0              /* SUCCESSFUL?             @D32CKDQ*/  00285000
*     THEN                                                         0690 00286000
         LTR   CVSR15,CVSR15                                       0690 00287000
         BZ    @RF00690                                            0690 00288000
*     DO;                           /*  NO -                 @D32CKDQ*/ 00289000
*       CVSMSID@=ADDR(CVSMS074);    /* GET ADDR OF 'INSUFFICIENT   0692 00290000
*                                      STORAGE' MESSAGE              */ 00291000
         LA    @11,CVSMS074                                        0692 00292000
         ST    @11,CVSMSID@                                        0692 00293000
*       CALL CVSERR;                /* FREE THE PABS AND GO TO SYSDEF*/ 00294000
         BAL   @14,CVSERR                                          0693 00295000
*       CVSMSG=ADDR(CVSVARY);      /* GET ADDRESS OF MESSAGE VARIABLE   00296000
*                                                            @X50BHC8*/ 00297000
         LA    @11,CVSVARY                                         0694 00298000
         ST    @11,CVSMSG                                          0694 00299000
*       /* GO UPDATE THE C/R DATA SET FOR MAJOR NODES        @D419400*/ 00300000
*                                                                  0695 00301000
*        DO; /* CKPTN FUNC(DELETE)NODE(NCSPLRID)CONSOLE(NCSPLSID)RPH((N 00302000
*SPLRPH))PROCNM(ISTINCVS)NCSPL((NCSPLPTR))TPPOST((NCSPLRPH)) */    0695 00303000
*                                                                  0695 00304000
*/* ATBUILD (ISTDLRPL,ISTATCVT,ISTNCSPL,ISTAVT)  */                0696 00305000
*/********************************************************************/ 00306000
*/*                                                                  */ 00307000
*/*  ISTTPMPL - TPMSG PARAMETER LIST MAPPING MACRO                   */ 00308000
*/*                                                                  */ 00309000
*/********************************************************************/ 00310000
*DCL  1  ISTTPMPL BDY(WORD) BASED, /* TPMSG PARAMETER LIST           */ 00311000
*        2 TPMPLMID PTR(31),       /* PTR TO MESSAGE ID              */ 00312000
*        2 TPMPLRLN FIXED(8),      /* LENGTH OF REPLY BUFFER         */ 00313000
*        2 TPMPLRBA PTR(24),       /* PTR TO REPLY BUFFER            */ 00314000
*        2 TPMPLRNF PTR(31),       /* REQUESTOR NOTIF FIELD          */ 00315000
*        2 TPMPLTXT PTR(31),       /* PTR TO MESSAGE TEXT            */ 00316000
*        2 TPMPLCID PTR(31);       /* PTR TO CONSOLE ID              */ 00317000
*/********************************************************************/ 00318000
*/*                                                                  */ 00319000
*/*  ISTDLRPL - D/L/R PARAMETER LIST MAPPING MACRO                   */ 00320000
*/*                                                                  */ 00321000
*/********************************************************************/ 00322000
*DCL  1  ISTDLRPL BDY(WORD) BASED, /* D/L/R PARAMETER LIST           */ 00323000
*        2 DLRPLRSA CHAR(72),      /* REGISTER SAVE AREA             */ 00324000
*          3 DLRPLIDF FIXED(8),    /* CONTROL BLOCK ID FIELD         */ 00325000
*          3 DLRPLLTH FIXED(8),    /* CONTROL BLOCK LENGTH           */ 00326000
*          3 DLRPLFCD FIXED(8),    /* D/L/R FUNCTION CODE            */ 00327000
*          3 DLRPLRCD FIXED(8),    /* D/L/R RETURN CODE              */ 00328000
*          3 DLRPLQPT PTR(31),     /* TPQUE/TPDEQ CHAIN PTR          */ 00329000
*          3 *        CHAR(8),     /* FWD PTR, REG 14 SAVE           */ 00330000
*          3 DLRPLR15 PTR(31),     /* REG 15 SAVE AREA               */ 00331000
*        2 DLRPLRPF FIXED(8),      /* REQUESTOR NOTIF FLAGS          */ 00332000
*        2 DLRPLRNF PTR(24),       /* REQUESTOR NOTIF FIELDS         */ 00333000
*        2 DLRPLUSR PTR(31),       /* USER DATA FIELD                */ 00334000
*        2 DLRPLIST CHAR(*);       /* PARAMETER LIST                 */ 00335000
*/********************************************************************/ 00336000
*/*                                                                  */ 00337000
*/*  ISTDLRPL CONTROL BLOCK ID FOR FIELD DLRPLIDF                    */ 00338000
*/*                                                                  */ 00339000
*/********************************************************************/ 00340000
*DCL DLRPLBID BIT(8) CONSTANT('50'X);/* ISTDLRPL CBID                */ 00341000
*/********************************************************************/ 00342000
*/*                                                                  */ 00343000
*/* FUNCTION CODE VALUES FOR FIELD DLRPLFCD                          */ 00344000
*/*                                                                  */ 00345000
*/********************************************************************/ 00346000
*DCL DLRPLCKP FIXED(8) CONSTANT(43);  /* FUNCTION = CKPTN            */ 00347000
*DCL DLRPLCPM FIXED(8) CONSTANT(189); /* FUNCTION = CPMSG            */ 00348000
*/********************************************************************/ 00349000
*/*                                                                  */ 00350000
*/*  REQUESTOR NOTIFICATION VALUES FOR FIELD DLRPLRPF                */ 00351000
*/*                                                                  */ 00352000
*/********************************************************************/ 00353000
*DCL DLRPLNON FIXED(8) CONSTANT(0);  /* NO NOTIFICATION              */ 00354000
*DCL DLRPLRTN FIXED(8) CONSTANT(1);  /* DLRPLRNF -> RTN              */ 00355000
*DCL DLRPLRPH FIXED(8) CONSTANT(2);  /* DLRPLRNF -> RPH              */ 00356000
*DCL DLRPLECB FIXED(8) CONSTANT(3);  /* DLRPLRNF -> ECB              */ 00357000
*DCL DLRPLPAB FIXED(8) CONSTANT(4);  /* DLRPLRNF -> PAB              */ 00358000
*/********************************************************************/ 00359000
*/*                                                                  */ 00360000
*/* PARAMETER LIST FOR MODULE ISTINCOQ                               */ 00361000
*/*                                                                  */ 00362000
*/********************************************************************/ 00363000
*DCL 1 DLRPLCOQ DEFINED(DLRPLIST), /* ISTINCOQ PARAMETER LIST        */ 00364000
*      2 DLRPLOPT BIT(32),         /* RESPONSE PROC OPTIONS          */ 00365000
*        3 DLRPLFOL BIT(1),        /* 1 = FOLD RESPONSE              */ 00366000
*        3 DLRPLGYN BIT(1),        /* 1 = GUARANTEE YES | NO         */ 00367000
*      2 DLRPLTPM CHAR(LENGTH(ISTTPMPL));  /* TPMSG PLIST            */ 00368000
*/********************************************************************/ 00369000
*/* PARAMETER LIST FOR MODULE ISTINCR6                               */ 00370000
*/********************************************************************/ 00371000
*DCL 1 DLRPLCR6 DEFINED(DLRPLIST), /* ISTINCR6 PARAMETER LIST        */ 00372000
*      2 DLRPLCON PTR(31),         /* POINTER TO CONSOLE ID          */ 00373000
*      2 DLRPLNOD PTR(31),         /* POINTER TO NODE ID             */ 00374000
*      2 *        PTR(31),         /* CR6 OPTIONS AREA               */ 00375000
*        3 DLRPLFNC FIXED(8),      /* CR6 OP CODE FIELD              */ 00376000
*        3 DLRPLSWS BIT(8),        /* CR6 SWITCHES                   */ 00377000
*      2 DLRPLMID CHAR(4),         /* CR6 MESSAGE ID FIELD           */ 00378000
*      2 DLRPLSA1 PTR(31),         /* CR6 SAVE AREA 1                */ 00379000
*      2 DLRPLSA2 PTR(31),         /* CR6 SAVE AREA 2                */ 00380000
*      2 DLRPLMSG CHAR(20),        /* CR6 MESSAGE TEXT AREA          */ 00381000
*      2 DLRPLTPL CHAR(LENGTH(ISTTPMPL)); /* TPMSG PARAM LIST        */ 00382000
*/********************************************************************/ 00383000
*/* CKPTN FUNCTION CODES FOR FIELD DLRPLFNC                          */ 00384000
*/********************************************************************/ 00385000
*DCL DLRPLOPN FIXED(8) CONSTANT(1);  /* CKPTN FUNC(OPEN)             */ 00386000
*DCL DLRPLADD FIXED(8) CONSTANT(2);  /* CKPTN FUNC(ADD)              */ 00387000
*DCL DLRPLDEL FIXED(8) CONSTANT(3);  /* CKPTN FUNC(DELETE)           */ 00388000
*DCL DLRPLCLS FIXED(8) CONSTANT(4);  /* CKPTN FUNC(CLOSE)            */ 00389000
*/* END OF ATBUILD */                                              0712 00390000
*                                                                  0712 00391000
*        RFY ISTDLRPL BASED(ADDR(CMZCR6PL));                       0712 00392000
*        RFY (GPR00P,GPR01P,GPR14P,GPR15P) RSTD;                   0713 00393000
*        IF ATCLCPTR->ATCNODDS ^= 0 /* IF CHECKPOINTING         */ 0714 00394000
*          THEN DO;                 /* IS IN PROGRESS           */ 0714 00395000
         L     @11,ATCLCPTR                                        0714 00396000
         L     @11,ATCNODDS(,@11)                                  0714 00397000
         LTR   @11,@11                                             0714 00398000
         BZ    @RF00714                                            0714 00399000
*            /* * * * * * * * * * * * * * * * * * * * * * * * * */ 0716 00400000
*            /*                                                 */ 0716 00401000
*            /* INVOKE ISTINCR6 TO DELETE THE NAME OF THE NODE  */ 0716 00402000
*            /* BEING DEACTIVATED FROM THE CHECKPOINT DATA SET  */ 0716 00403000
*            /* UNLESS HALT VTAM IS IN PROCESS.                 */ 0716 00404000
*            /*                                                 */ 0716 00405000
*            /* * * * * * * * * * * * * * * * * * * * * * * * * */ 0716 00406000
*                                                                  0716 00407000
*        DO; /* LISATCVT CVTBASE(FIXED,(GPR15P)) */                0716 00408000
*                                                                  0716 00409000
*        RFY (EMCR15) RSTD;                                        0717 00410000
*          GEN SETS (EMCR15)                                       0718 00411000
*        (L     EMCR15,X'10' POINT TO CVT);                        0718 00412000
         L     EMCR15,X'10' POINT TO CVT                                00413000
*          GPR15P = EMCR15->CVTEXT2->CVTATCVT; /*SET UP AVT POINTER*/   00414000
*                                                                  0719 00415000
         L     @11,CVTEXT2(,EMCR15)                                0719 00416000
         L     @11,CVTATCVT(,@11)                                  0719 00417000
         LR    GPR15P,@11                                          0719 00418000
*        RFY (EMCR15) UNRSTD;                                      0720 00419000
*        END; /*LISATCVT*/                                         0721 00420000
*            IF GPR15P->ISTAHIP = '0'B                             0722 00421000
*              THEN DO;                                            0722 00422000
*                                                                  0722 00423000
         TM    ISTAHIP(GPR15P),B'10000000'                         0722 00424000
         BNZ   @RF00722                                            0722 00425000
*        DLRPLIDF = DLRPLBID;       /* SET ISTDLRPL CBID         */     00426000
         LA    @11,CMZCR6PL                                        0724 00427000
         MVI   DLRPLIDF(@11),X'50'                                 0724 00428000
*        DLRPLLTH = LENGTH(ISTDLRPL) + LENGTH(DLRPLCR6);/* SET LENGTH * 00429000
*                                                                  0725 00430000
         MVI   DLRPLLTH(@11),X'90'                                 0725 00431000
*        DLRPLFCD = DLRPLCKP;       /* SET FUNCTION CODE = CKPTN */     00432000
         MVI   DLRPLFCD(@11),X'2B'                                 0726 00433000
*        DLRPLRCD = 0;          /* SET RETURN CODE = SUCCESSFUL  */     00434000
         MVI   DLRPLRCD(@11),X'00'                                 0727 00435000
*        DLRPLRPF = DLRPLRPH;       /* INDIC DLRPLRNF -> AN RPH  */     00436000
         MVI   DLRPLRPF(@11),X'02'                                 0728 00437000
*        DLRPLRNF = NCSPLRPH; /* SET COMPLETN NOTIF FIELD  */      0729 00438000
         L     @07,NCSPLRPH(,NCSPLPTR)                             0729 00439000
         STCM  @07,7,DLRPLRNF(@11)                                 0729 00440000
*        DLRPLUSR = 0; /* SET USER DATA FIELD       */             0730 00441000
         SLR   @05,@05                                             0730 00442000
         ST    @05,DLRPLUSR(,@11)                                  0730 00443000
*        DLRPLNOD = ADDR(NCSPLRID); /* SET CR6 NODE ID FIELD     */     00444000
         LA    @05,NCSPLRID(,NCSPLPTR)                             0731 00445000
         ST    @05,DLRPLNOD(,@11)                                  0731 00446000
*        DLRPLCON = ADDR(NCSPLSID); /* SET CR6 CONSOLE ID FIELD  */     00447000
         LA    @05,NCSPLSID(,NCSPLPTR)                             0732 00448000
         ST    @05,DLRPLCON(,@11)                                  0732 00449000
*        DLRPLFNC = DLRPLDEL; /* SET CR6 FUNCTION CODE     */      0733 00450000
*                                                                  0733 00451000
         MVI   DLRPLFNC(@11),X'03'                                 0733 00452000
*        GPR01P = NCSPLRPH; /* GET ADDRESS OF THE RPH */           0734 00453000
*                                                                  0734 00454000
         LR    GPR01P,@07                                          0734 00455000
*/*  TPQUE (ADDR(ISTDLRPL),ATCLCPTR->ATCLDNCS) CHAIN(DLRPLQPT) */  0735 00456000
*                                                                  0735 00457000
*        DO;                                                       0735 00458000
*        RFY (GPR02P) RSTD;                                        0736 00459000
*        GEN REFS(GPR01P) SETS(RPHWORK)                            0737 00460000
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      0737 00461000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              00462000
*        GPR15P=ADDR(ISTDLRPL); /* GET WORK ELEM POINTER */        0738 00463000
         LA    GPR15P,CMZCR6PL                                     0738 00464000
*        GPR14P=ADDR(ATCLCPTR->ATCLDNCS); /* ADDRESS PAB/QUEUE POINTER  00465000
*/       GPR15P=GPR15P|PABWEQG1;                                   0739 00466000
         L     GPR14P,ATCLCPTR                                     0739 00467000
         LA    GPR14P,ATCLDNCS(,GPR14P)                            0739 00468000
         O     GPR15P,@CF01680                                     0740 00469000
*        GPR02P=GPR14P->PABWEQA;/* INITIALIZE WITH QUEUE HEADER */ 0741 00470000
         L     GPR02P,PABWEQA(,GPR14P)                             0741 00471000
*CMZA0028:; /* CS FAIL TARGET */                                   0742 00472000
CMZA0028 DS    0H                                                  0743 00473000
*        GPR00P=GPR02P; /* SAVE QUEUE CONTENTS */                  0743 00474000
         LR    GPR00P,GPR02P                                       0743 00475000
*        GPR15P->DLRPLQPT=GPR02P|PABWEQG1; /*FORWARD CHAIN WORK ELEMENT 00476000
*/       CS   (GPR02P,GPR15P,GPR14P->PABWEQA); /* CHECK FOR END OF QUEU 00477000
* */     BC (7,CMZA0028);                                          0744 00478000
         LR    @11,GPR02P                                          0744 00479000
         O     @11,@CF01680                                        0744 00480000
         ST    @11,DLRPLQPT(,GPR15P)                               0744 00481000
         CS    GPR02P,@15,PABWEQA(GPR14P)                          0745 00482000
         BC    7,CMZA0028                                          0746 00483000
*        GEN REFS(RPHWORK,GPR01P) NOSETS                           0747 00484000
*        (LM    GPR02P,GPR08P,RPHWORK(GPR01P));                    0747 00485000
         LM    GPR02P,GPR08P,RPHWORK(GPR01P)                            00486000
*        RFY (GPR02P) UNRSTD;                                      0748 00487000
*        END; /**** END OF TPQUE GENERATION ****/                  0749 00488000
*        GPR13P = GPR13P + 12; /* OS/VS2 SETLOCK SAVES REGS AT 0(13) */ 00489000
*                                                                  0750 00490000
         AL    GPR13P,@CF00032                                     0750 00491000
*/*VSETLCK  (GPR15P,OBTAIN,LOCAL,(LOCAL,ISTINCVS(CMZR0012)))*/     0751 00492000
*CMZO0012:                                                         0751 00493000
*        DO;                                                       0751 00494000
CMZO0012 DS    0H                                                  0752 00495000
*                                        /*DECLARE AND RESTRICT REGS */ 00496000
*                                        /*   2,10,11,12,13,14, AND 15  00497000
**/                                                                0752 00498000
*        RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P) RSTD;            0752 00499000
*                                        /*SAVE REGS 2 AND 10 THRU 14*/ 00500000
*        GEN REFS(GPR02F,GPR10F,GPR11F,GPR12F,GPR14F,GPR13P);      0753 00501000
*                                                                  0753 00502000
         STM   GPR10F,GPR12F,0(GPR13P)                                  00503000
         ST    GPR14F,12(GPR13P)                                        00504000
         ST    GPR02F,16(GPR13P)                                        00505000
*                                        /*INVOKE MODESET TO CHANGE  */ 00506000
*                                        /*PSW PROTECTION KEY TO 0   */ 00507000
*        GEN SETS(2);                                              0754 00508000
*                                                                  0754 00509000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      00510000
*          GPR10P=GPR13P;                /*PUT SAVE AREA ADDR IN R 10*/ 00511000
         LR    GPR10P,GPR13P                                       0755 00512000
*                                        /*INVOKE OS/VS SETLOCK MACRO*/ 00513000
*          GEN REFS(GPR13P,PSALITA,FLC) SETS(GPR12F);              0756 00514000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        *00515000
               RELATED=(LOCAL,ISTINCVS(CMZR0012))                       00516000
*          GPR15P=GPR13P;                /*PUT RETURN CODE IN R 15 */   00517000
         LR    GPR15P,GPR13P                                       0757 00518000
*                                        /*INVOKE MODESET MACRO TO   */ 00519000
*            DO;                         /*RESTORE PSW PROTECTION KEY*/ 00520000
*        GEN SETS(2);                                              0759 00521000
         MODESET KEYADDR=(2),WORKREG=2                                  00522000
*            END;                        /* RESTORE REGISTERS        */ 00523000
*          GEN REFS(GPR10F,GPR13P) SETS(GPR10F,GPR11F,             0761 00524000
*          GPR12F,GPR13F,GPR14F,GPR02F);                           0761 00525000
         LR    GPR13F,GPR10F                                            00526000
         LM    GPR10F,GPR12F,0(GPR13P)                                  00527000
         L     GPR14F,12(GPR13P)                                        00528000
         L     GPR02F,16(GPR13P)                                        00529000
*          IF GPR15F=4 THEN GPR15F=0;                              0762 00530000
         C     GPR15F,@CF00086                                     0762 00531000
         BNE   @RF00762                                            0762 00532000
         SLR   GPR15F,GPR15F                                       0763 00533000
*          GPR15P=GPR15F;                /*PUT RETURN CODE IN RCREG*/   00534000
*                                                                  0764 00535000
@RF00762 DS    0H                                                  0765 00536000
*        RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P) UNRSTD;          0765 00537000
*        END;  /*CMZO0012:VSETLCK */                               0766 00538000
*/*VPOST  ECB(ATCLCPTR->ATCLDECB)*/                                0767 00539000
*        DO;                                                       0767 00540000
*                                                                  0767 00541000
*        RFY (GPR02P,GPR05P,GPR09P,GPR10P,GPR11P,GPR12P,GPR13P) RSTD;   00542000
*                                        /*DECLARE AND RESTRICT REGS */ 00543000
*                                        /* SAVE REGS         */   0769 00544000
*          GEN REFS(GPR00F,GPR01F,GPR02F,GPR05F,GPR09F,            0769 00545000
*          GPR10F,GPR11F,GPR12P,GPR13P,GPR14F,GPR15F);             0769 00546000
         STM   GPR14F,GPR12F,0(GPR13P)                                  00547000
*          GPR00P=GPR13P;                /*SAVE REG 13 IN REG 0     */  00548000
         LR    GPR00P,GPR13P                                       0770 00549000
*                                        /*INVOKE XREGSET MACRO TO*/    00550000
*                                        /*CHECK ECB PARAMETER AND*/    00551000
*                                        /*PUT ADDRESS IN REG 1   */    00552000
*                                                                  0771 00553000
*/*XREGSET  PID('ECB')PPARM(ATCLCPTR->ATCLDECB)RREG(1,GPR01P)*/    0771 00554000
*        DO;                                                       0771 00555000
*          GPR01P=ADDR(ATCLCPTR->ATCLDECB);                        0772 00556000
         L     GPR01P,ATCLCPTR                                     0772 00557000
         LA    GPR01P,ATCLDECB(,GPR01P)                            0772 00558000
*                                        /*SET RREG SYMBOL TO ADDRESS*/ 00559000
*                                        /*OF PPARM OPERAND          */ 00560000
*        END;  /* XREGSET */                                       0773 00561000
*          GPR10F=0;                     /*SET COMPLETION CODE TO 0*/   00562000
         SLR   GPR10F,GPR10F                                       0774 00563000
*          GPR11P=GPR01P;                /*PUT ECB ADDR IN REG 11    */ 00564000
         LR    GPR11P,GPR01P                                       0775 00565000
*          DCL CMZP0037 PTR(31) LOCATION(16);                      0776 00566000
*                                        /*ESTABLISH POINTER TO CVT  */ 00567000
*/*VMDESET  ((15),ZERO,(2))*/                                      0777 00568000
*        DO;                             /* INVOKE MODESET MACRO    */  00569000
*          GEN SETS (2);                                           0778 00570000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      00571000
*          GPR15F=0;                                               0779 00572000
         SLR   GPR15F,GPR15F                                       0779 00573000
*                                        /*PUT RETURN CODE IN RCREG*/   00574000
*        END;  /* VMDESET */                                       0780 00575000
*          GPR05F=GPR02F;                                          0781 00576000
         LR    GPR05F,GPR02F                                       0781 00577000
*          CALL CMZP0037->CVT0PT01;      /*BRANCH TO TASK SUPERVISOR */ 00578000
         L     @07,CMZP0037                                        0782 00579000
         L     @15,CVT0PT01(,@07)                                  0782 00580000
         BALR  @14,@15                                             0782 00581000
*                                        /* POST ROUTINE (IEA0PT01)  */ 00582000
*          GPR02F=GPR05F;                                          0783 00583000
*                                                                  0783 00584000
         LR    GPR02F,GPR05F                                       0783 00585000
*/*VMDESET  ((15),,,(2))*/                                         0784 00586000
*        DO;                             /* INVOKE MODESET MACRO    */  00587000
*          GEN SETS (2);                                           0785 00588000
         MODESET KEYADDR=(2),WORKREG=2                                  00589000
*          GPR15F=0;                                               0786 00590000
         SLR   GPR15F,GPR15F                                       0786 00591000
*                                        /*PUT RETURN CODE IN RCREG*/   00592000
*        END;  /* VMDESET */                                       0787 00593000
*          GPR13P=GPR00P;                /*RESTORE SAVE AREA ADDR  */   00594000
         LR    GPR13P,GPR00P                                       0788 00595000
*                                        /*     FROM REGISTER 0    */   00596000
*                                        /*RESTORE REGS */         0789 00597000
*          GEN REFS(GPR13P) SETS(GPR00F,                           0789 00598000
*          GPR01F,GPR02F,GPR05F,GPR09F,GPR10F,GPR11F,              0789 00599000
*          GPR12F,GPR14F,GPR15F);                                  0789 00600000
*                                                                  0789 00601000
         LM    GPR14F,GPR12F,0(GPR13P)                                  00602000
*        RFY (GPR02P,GPR05P,GPR09P,GPR10P,GPR11P,GPR12P,GPR13P) UNRSTD; 00603000
*                                        /*UNRESTRICT REGS */      0791 00604000
*        END; /* VPOST */                                          0791 00605000
*                                                                  0791 00606000
*/*VSETLCK  (GPR15P,RELEASE,LOCAL,(LOCAL,ISTINCVS(CMZO0012)))*/    0792 00607000
*CMZR0012:                                                         0792 00608000
*        DO;                                                       0792 00609000
CMZR0012 DS    0H                                                  0793 00610000
*                                        /*DECLARE AND RESTRICT REGS */ 00611000
*                                        /*   2,10,11,12,13,14, AND 15  00612000
**/                                                                0793 00613000
*        RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P) RSTD;            0793 00614000
*                                        /*SAVE REGS 2 AND 10 THRU 14*/ 00615000
*        GEN REFS(GPR02F,GPR10F,GPR11F,GPR12F,GPR14F,GPR13P);      0794 00616000
*                                                                  0794 00617000
         STM   GPR10F,GPR12F,0(GPR13P)                                  00618000
         ST    GPR14F,12(GPR13P)                                        00619000
         ST    GPR02F,16(GPR13P)                                        00620000
*                                        /*INVOKE MODESET TO CHANGE  */ 00621000
*                                        /*PSW PROTECTION KEY TO 0   */ 00622000
*        GEN SETS(2);                                              0795 00623000
*                                                                  0795 00624000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      00625000
*          GPR10P=GPR13P;                /*PUT SAVE AREA ADDR IN R 10*/ 00626000
         LR    GPR10P,GPR13P                                       0796 00627000
*                                        /*INVOKE OS/VS SETLOCK MACRO*/ 00628000
*          GEN REFS(GPR13P,PSALITA,FLC) SETS(GPR12F);              0797 00629000
         SETLOCK RELEASE,TYPE=LOCAL,                                   *00630000
               RELATED=(LOCAL,ISTINCVS(CMZO0012))                       00631000
*          GPR15P=GPR13P;                /*PUT RETURN CODE IN R 15 */   00632000
         LR    GPR15P,GPR13P                                       0798 00633000
*                                        /*INVOKE MODESET MACRO TO   */ 00634000
*            DO;                         /*RESTORE PSW PROTECTION KEY*/ 00635000
*        GEN SETS(2);                                              0800 00636000
         MODESET KEYADDR=(2),WORKREG=2                                  00637000
*            END;                        /* RESTORE REGISTERS        */ 00638000
*          GEN REFS(GPR10F,GPR13P) SETS(GPR10F,GPR11F,             0802 00639000
*          GPR12F,GPR13F,GPR14F,GPR02F);                           0802 00640000
         LR    GPR13F,GPR10F                                            00641000
         LM    GPR10F,GPR12F,0(GPR13P)                                  00642000
         L     GPR14F,12(GPR13P)                                        00643000
         L     GPR02F,16(GPR13P)                                        00644000
*          IF GPR15F=4 THEN GPR15F=0;                              0803 00645000
         C     GPR15F,@CF00086                                     0803 00646000
         BNE   @RF00803                                            0803 00647000
         SLR   GPR15F,GPR15F                                       0804 00648000
*          GPR15P=GPR15F;                /*PUT RETURN CODE IN RCREG*/   00649000
*                                                                  0805 00650000
@RF00803 DS    0H                                                  0806 00651000
*        RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P) UNRSTD;          0806 00652000
*        END;  /*CMZR0012:VSETLCK */                               0807 00653000
*        GPR13P = GPR13P - 12; /* RESTORE REG 13 FOR SAVE AREA CHAIN */ 00654000
         SL    GPR13P,@CF00032                                     0808 00655000
*        GPR15P = 0;            /* INDIC VALID REQUEST          */ 0809 00656000
         SLR   GPR15P,GPR15P                                       0809 00657000
*                END;           /* END VALID REQUEST            */ 0810 00658000
*              ELSE GPR15P = 4; /* INDIC DELETE NOT DONE        */ 0811 00659000
         B     @RC00722                                            0811 00660000
@RF00722 LA    GPR15P,4                                            0811 00661000
*            END;               /* END CHECKPOINTING IN PROCESS */ 0812 00662000
*          ELSE GPR15P = 4;     /* INDIC CKPTING NOT IN PROCESS */ 0813 00663000
*                                                                  0813 00664000
         B     @RC00714                                            0813 00665000
@RF00714 LA    GPR15P,4                                            0813 00666000
*        END; /* END OF CKPTN EXPANSION */                         0814 00667000
@RC00714 DS    0H                                                  0815 00668000
*       IF CVSR15=CVS0     /* NEED TO DO A TPWAIT?           @D419400*/ 00669000
*          THEN           /*                                 @D419400*/ 00670000
         LTR   CVSR15,CVSR15                                       0815 00671000
         BNZ   @RF00815                                            0815 00672000
*          DO;                                             /*@D419400*/ 00673000
*            CVSR1=NCSPLRPH; /* SET REG 1 = ADDR OF RPH      @XM18394*/ 00674000
*                                                                  0817 00675000
         L     CVSR1,NCSPLRPH(,NCSPLPTR)                           0817 00676000
*/*  TPWAIT   */                                                   0818 00677000
*             DO; /* BEGIN TPWAIT GENERATION*/                     0818 00678000
*             GEN (STM   GPR00P,GPR15P,RPHWORK(GPR01P))            0819 00679000
*             REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);            0819 00680000
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)                            00681000
*             GPR15P=ADDR(LHAA0051);                               0820 00682000
         LA    GPR15P,LHAA0051                                     0820 00683000
*             GPR14P=0;                                            0821 00684000
         SLR   GPR14P,GPR14P                                       0821 00685000
*             GPR15P=GPR15P & '00FFFFFF'X;                         0822 00686000
         N     GPR15P,@CF04907                                     0822 00687000
*             GPR15P=GPR15P | RPHWT1;                              0823 00688000
         O     GPR15P,@CF01639                                     0823 00689000
*             CS (GPR14P,GPR15P,GPR01P->RPHRESMA);                 0824 00690000
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         0824 00691000
*             BC (7,LHAB0051);                                     0825 00692000
*                                                                  0825 00693000
         BC    7,LHAB0051                                          0825 00694000
*/* TPEXIT  NONE */                                                0826 00695000
*             DO;                                                  0826 00696000
*               RESPECIFY GPR15P RSTD;                             0827 00697000
*                                                                  0827 00698000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         0828 00699000
*/* END OF ATBUILD */                                              0828 00700000
*                                                                  0828 00701000
*             DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */        0828 00702000
*               GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/        0829 00703000
         L     GPR15P,ATCLCPTR                                     0829 00704000
*             END; /*LISATCVT*/                                    0830 00705000
*               RESPECIFY GPR00F RSTD;                             0831 00706000
*               GPR00F=0;     /*SET PARAMETER REGISTER TO 0*/      0832 00707000
         SLR   GPR00F,GPR00F                                       0832 00708000
*               GPR15P=GPR15P->ATCAP31;                            0833 00709000
         L     GPR15P,ATCAP31(,GPR15P)                             0833 00710000
*               DCL FMZL0056 BASED(GPR15P) LABEL VALUERANGE(*);    0834 00711000
*               CALL FMZL0056;                                     0835 00712000
         BALR  @14,@15                                             0835 00713000
*               RESPECIFY (GPR00F,GPR15P) UNRSTD;                  0836 00714000
*             END; /***** END OF TPEXIT  *****/                    0837 00715000
*LHAB0051:;   GPR01P->RPHRESMA = 0;                                0838 00716000
*                                                                  0838 00717000
LHAB0051 DS    0H                                                  0839 00718000
         SLR   @11,@11                                             0839 00719000
         ST    @11,RPHRESMA(,GPR01P)                               0839 00720000
*LHAA0051:;   GEN (LM    GPR00P,GPR15P,RPHWORK(GPR01P))            0840 00721000
LHAA0051 DS    0H                                                  0841 00722000
*             REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);            0841 00723000
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)                            00724000
*             END; /*****END OF TPWAIT *****/ /* WAIT FOR C/R TO COMPLE 00725000
*E            @D419400*/                                           0842 00726000
*          END;                                            /*@D419400*/ 00727000
*          ELSE;  /* CONTINUE                                @D419400*/ 00728000
@RF00815 DS    0H                                                  0845 00729000
*     END;                                                         0845 00730000
*   ELSE                                                           0846 00731000
*     DO;                           /* INITIALIZE NCSPL      @D32CKDQ*/ 00732000
         B     @RC00690                                            0846 00733000
@RF00690 DS    0H                                                  0847 00734000
*       CVSNCSPL=GTNCSAD;/* GET ADDR OF NEW NCSPL            @D32CKDQ*/ 00735000
         L     @11,NCSPLRPH(,NCSPLPTR)                             0847 00736000
         L     @11,RPHCRR(,@11)                                    0847 00737000
         L     @11,CRACRR(,@11)                                    0847 00738000
         L     @11,GTNCSAD+118(,@11)                               0847 00739000
         ST    @11,CVSNCSPL                                        0847 00740000
*       CVSR0=CVSNCSPL->NCSPLWKA;  /* SAVE FIELDS SET UP BY CW3*/  0848 00741000
         L     CVSR0,NCSPLWKA(,@11)                                0848 00742000
*       CVSR1=CVSNCSPL->NCSPLCVT;  /*SAME                    @D32CKDQ*/ 00743000
         L     CVSR1,NCSPLCVT(,@11)                                0849 00744000
*       IF CVSNCSPL->NCSPLREQ=CVSON                                0850 00745000
*         THEN CVSNCREQ=CVSON;     /*NCSPL REQSTORED         @D32CKDQ*/ 00746000
         TM    NCSPLREQ(@11),B'00010000'                           0850 00747000
         BNO   @RF00850                                            0850 00748000
         OI    CVSNCREQ,B'00001000'                                0851 00749000
*         ELSE;                                            /*@D32CKDQ*/ 00750000
@RF00850 DS    0H                                                  0853 00751000
*       IF CVSNCSPL->NCSPRIV=CVSON  /* WAS NEW NCSPL OBTAINED FROM 0853 00752000
*                             PRIVATE STORAGE POOL?          @XM19499*/ 00753000
*          THEN CVSPRIV=CVSON; /* SET CVS SWITCH             @XM19499*/ 00754000
         L     @11,CVSNCSPL                                        0853 00755000
         TM    NCSPRIV(@11),B'00000001'                            0853 00756000
         BNO   @RF00853                                            0853 00757000
         OI    CVSPRIV,B'00000100'                                 0854 00758000
*          ELSE;                                           /*@XM19499*/ 00759000
@RF00853 DS    0H                                                  0856 00760000
*       DO I=1 TO LENGTH(ISTNCSPL);                        /*@D32CKDQ*/ 00761000
         LA    I,1                                                 0856 00762000
@DL00856 DS    0H                                                  0857 00763000
*        CVSNCSPL->ISTNCSPL(I)=ISTNCSPL(I);/*COPY OLD TO NEW @D32CKDQ*/ 00764000
         L     @11,CVSNCSPL                                        0857 00765000
         ALR   @11,I                                               0857 00766000
         AL    @11,@CF05015                                        0857 00767000
         LR    @07,NCSPLPTR                                        0857 00768000
         ALR   @07,I                                               0857 00769000
         AL    @07,@CF05015                                        0857 00770000
         MVC   ISTNCSPL(1,@11),ISTNCSPL(@07)                       0857 00771000
*        END;                                              /*@D32CKDQ*/ 00772000
         AL    I,@CF00094                                          0858 00773000
         C     I,@CF05008                                          0858 00774000
         BNH   @DL00856                                            0858 00775000
*       RFY ISTNCSPL BASED(CVSNCSPL);                      /*@D32CKDQ*/ 00776000
*       NCSPLWKA=CVSR0;              /*RESTORE SAVED FIELDS  @D32CKDQ*/ 00777000
         L     @11,CVSNCSPL                                        0860 00778000
         ST    CVSR0,NCSPLWKA(,@11)                                0860 00779000
*       NCSPLCVT=CVSR1;                                    /*@D32CKDQ*/ 00780000
         ST    CVSR1,NCSPLCVT(,@11)                                0861 00781000
*       RFY                                                        0862 00782000
*         CVSR15 UNRSTD;                                           0862 00783000
*       NCSPLVDP='0'B;          /* INDICATE NCSPL IS NOT ON THE    0863 00784000
*                                      VARY DEF PAB                  */ 00785000
         NI    NCSPLVDP(@11),B'01111111'                           0863 00786000
*       NCSVSTAT='0'B;          /* TURN THE STATIC FLAG OFF IN     0864 00787000
*                                      THE NEW NCSPL                 */ 00788000
         NI    NCSVSTAT(@11),B'11011111'                           0864 00789000
*       NCSPL2IN='1'B;          /* INDICATE SECOND ENTRY TO CVS  */     00790000
         OI    NCSPL2IN(@11),B'10000000'                           0865 00791000
*       IF CVSNCREQ=CVSON       /*NCSPL REQSTORED?           @D32CKDQ*/ 00792000
*         THEN NCSPLREQ=CVSON;  /*YES                        @D32CKDQ*/ 00793000
         TM    CVSNCREQ,B'00001000'                                0866 00794000
         BNO   @RF00866                                            0866 00795000
         OI    NCSPLREQ(@11),B'00010000'                           0867 00796000
*         ELSE;                                            /*@D32CKDQ*/ 00797000
@RF00866 DS    0H                                                  0869 00798000
*       IF CVSPRIV=CVSON  /* WAS NEW NCSPL OBTAINED FROM           0869 00799000
*                            PRIVATE STORAGE?                @XM19499*/ 00800000
*          THEN NCSPRIV=CVSON;   /* MARK NEW NCSPL AS OBTAINED FROM     00801000
*                                   PRIVATE STORAGE          @XM19499*/ 00802000
         TM    CVSPRIV,B'00000100'                                 0869 00803000
         BNO   @RF00869                                            0869 00804000
         L     @15,CVSNCSPL                                        0870 00805000
         OI    NCSPRIV(@15),B'00000001'                            0870 00806000
*          ELSE;                                           /*@XM19499*/ 00807000
@RF00869 DS    0H                                                  0872 00808000
*       RFY ISTNCSPL BASED(NCSPLPTR);                      /*@D32CKDQ*/ 00809000
*       RFY ISTDYPAB BASED(RDTVPAB);                       /*@D32CKC8*/ 00810000
*                                                                  0873 00811000
*                 /***************************************************/ 00812000
*                 /*                                                 */ 00813000
*                 /* QUEUE NEW NCSPL TO THIS RDT'S VARY PAB AND      */ 00814000
*                 /* SCHEDULE IT:                                    */ 00815000
*                 /*                                                 */ 00816000
*                 /***************************************************/ 00817000
*                                                                  0874 00818000
*        RFY CVSR0 UNRSTD;                                 /*@D32CKC8*/ 00819000
*        CVSR1=NCSPLRPH; /* GET THE RPH ADDRESS              @D32CKC8*/ 00820000
*                                                                  0875 00821000
         L     CVSR1,NCSPLRPH(,NCSPLPTR)                           0875 00822000
*/*  TPQUE (CVSNCSPL,DYPPAB) NORM */                               0876 00823000
*                                                                  0876 00824000
*         DO;                                                      0876 00825000
*         RFY (GPR04P,GPR05P) RSTD;                                0877 00826000
*         GEN REFS(GPR01P) SETS(RPHWORK)                           0878 00827000
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      0878 00828000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              00829000
*         GPR00P=0;                                                0879 00830000
         SLR   GPR00P,GPR00P                                       0879 00831000
*         GPR15P=ADDR(DYPPAB); /*HOLD PAB PTR*/                    0880 00832000
         L     GPR15P,RDTVPAB(,RDTEPTR)                            0880 00833000
         LA    GPR15P,DYPPAB(,GPR15P)                              0880 00834000
*         GPR04P=CVSNCSPL; /*WORK ELE PTR*/                        0881 00835000
         L     GPR04P,CVSNCSPL                                     0881 00836000
*         GPR05P=GPR15P; /*PASS PAB PTR*/                          0882 00837000
         LR    GPR05P,GPR15P                                       0882 00838000
*         CALL ATCLCPTR->ATCAP37->ISTAPC37;                        0883 00839000
         L     @11,ATCLCPTR                                        0883 00840000
         L     @15,ATCAP37(,@11)                                   0883 00841000
         BALR  @14,@15                                             0883 00842000
*         GEN(NOPR  0)NOSETS NOREFS;                               0884 00843000
         NOPR  0                                                        00844000
*         RFY (GPR04P,GPR05P) UNRSTD;                              0885 00845000
*         END; /**** END OF TPQUE GENERATION ****/                 0886 00846000
*/*@D32CKC8*/                                                      0887 00847000
*        CVSSOM='1'B;            /* INDICATE SUPPRESS OPER         0887 00848000
*                                      MESSAGES                      */ 00849000
*        CVSGOSW='0'B;           /* TURN GO SWITCH OFF SO THAT NO  0888 00850000
*                                      FURTHER PROCESSING OF THIS  0888 00851000
*                                      NCSPL WILL OCCUR              */ 00852000
         OI    CVSSOM,B'01000000'                                  0888 00853000
         NI    CVSGOSW,B'01111111'                                 0888 00854000
*      END;                                                        0889 00855000
*    /*SEGMENT(CVSCOPY)FINISH*/DO;GOTO CVSCOPY#;CVSCOPY@:END;      0890 00856000
@RC00690 DS    0H                                                  0891 00857000
         B     CVSCOPY#                                            0891 00858000
CVSCOPY@ DS    0H                                                  0893 00859000
*   GEN(  EJECT);                                                  0893 00860000
           EJECT                                                        00861000
*CVSQUE:                                                           0894 00862000
*     PROC OPTIONS(NOSAVE NOSAVEAREA);                             0894 00863000
*                                                                  0894 00864000
         B     @PB00002                                            0894 00865000
CVSQUE   DS    0H                                                  0895 00866000
*   /*****************************************************************/ 00867000
*   /*                                                               */ 00868000
*   /* THIS SUBROUTINE WILL QUEUE THE MODIFIED NCSPL TO THE NEW      */ 00869000
*   /* VARY PAB WITH THE SCHEDULE FORMAT(NORM).                      */ 00870000
*   /* NOTE: REGISTER 14 IS NOT SAVED UPON ENTRY TO THIS SUBROUTINE  */ 00871000
*   /*       BECAUSE THE SUBROUTINE EXITS VIA TPEXIT.                */ 00872000
*   /*                                                               */ 00873000
*   /*****************************************************************/ 00874000
*                                                                  0895 00875000
*   NCSPL2IN='1'B;                  /* SET THE SECOND ENTRY TO CVS 0895 00876000
*                                      BIT ON IN THE ORIGINAL NCSPL  */ 00877000
         OI    NCSPL2IN(NCSPLPTR),B'10000000'                      0895 00878000
*   NCSPLVDP='0'B;                  /* TURN OFF THE BIT IN THE ORIGINAL 00879000
*                                      NCSPL TO INDICATE THE NCSPL IS   00880000
*                                      NO LONGER ON THE VARY DEF PAB */ 00881000
         NI    NCSPLVDP(NCSPLPTR),B'01111111'                      0896 00882000
*   CVSWKA=NCSPLWKA+CVS8;           /* RESET ALL OF THE WORK AREA TO    00883000
*                                      AVAILABLE                     */ 00884000
         L     @15,NCSPLWKA(,NCSPLPTR)                             0897 00885000
         LA    @11,8                                               0897 00886000
         ALR   @11,@15                                             0897 00887000
         ST    @11,CVSWKA(,@15)                                    0897 00888000
*   CVSR1=NCSPLRPH;                 /* GET AN RPH ADDRESS            */ 00889000
         L     CVSR1,NCSPLRPH(,NCSPLPTR)                           0898 00890000
*   RFY                                                            0899 00891000
*      ISTDYPAB BASED(RDTVPAB);                                    0899 00892000
*                                                                  0899 00893000
*   /*****************************************************************/ 00894000
*   /*                                                               */ 00895000
*   /* QUEUE THE NCSPL TO THE NEW REMOTE RN'S VARY PAB AND           */ 00896000
*   /* SCHEDULE IT.                                                  */ 00897000
*   /*****************************************************************/ 00898000
*                                                                  0900 00899000
*                                                                  0900 00900000
*/*  TPQUE (NCSPLPTR,DYPPAB) NORM */                               0900 00901000
*                                                                  0900 00902000
*    DO;                                                           0900 00903000
*    RFY (GPR04P,GPR05P) RSTD;                                     0901 00904000
*    GEN REFS(GPR01P) SETS(RPHWORK)                                0902 00905000
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      0902 00906000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              00907000
*    GPR00P=0;                                                     0903 00908000
         SLR   GPR00P,GPR00P                                       0903 00909000
*    GPR15P=ADDR(DYPPAB); /*HOLD PAB PTR*/                         0904 00910000
         L     GPR15P,RDTVPAB(,RDTEPTR)                            0904 00911000
         LA    GPR15P,DYPPAB(,GPR15P)                              0904 00912000
*    GPR04P=NCSPLPTR; /*WORK ELE PTR*/                             0905 00913000
         LR    GPR04P,NCSPLPTR                                     0905 00914000
*    GPR05P=GPR15P; /*PASS PAB PTR*/                               0906 00915000
         LR    GPR05P,GPR15P                                       0906 00916000
*    CALL ATCLCPTR->ATCAP37->ISTAPC37;                             0907 00917000
         L     @11,ATCLCPTR                                        0907 00918000
         L     @15,ATCAP37(,@11)                                   0907 00919000
         BALR  @14,@15                                             0907 00920000
*    GEN(NOPR  0)NOSETS NOREFS;                                    0908 00921000
         NOPR  0                                                        00922000
*    RFY (GPR04P,GPR05P) UNRSTD;                                   0909 00923000
*    END; /**** END OF TPQUE GENERATION ****/                      0910 00924000
*                                                                  0910 00925000
*   /*****************************************************************/ 00926000
*   /*                                                               */ 00927000
*   /* THE ORIGINAL NCSPL HAS NOW BEEN QUEUED TO THE NEW VARY PAB.   */ 00928000
*   /* FURTHER PROCESSING WILL BE DONE WHEN THE RE-QUEUED NCSPL IS   */ 00929000
*   /* DISPATCHED.  SINCE NO FURTHER PROCESSING SHOULD BE DONE NOW,  */ 00930000
*   /* EXIT AND ALLOW RE-DISPATCHING.                                */ 00931000
*   /*                                                               */ 00932000
*   /*****************************************************************/ 00933000
*                                                                  0911 00934000
*                                                                  0911 00935000
*/* TPEXIT  NORM */                                                0911 00936000
*    DO;                                                           0911 00937000
*      RESPECIFY GPR15P RSTD;                                      0912 00938000
*                                                                  0912 00939000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         0913 00940000
*/* END OF ATBUILD */                                              0913 00941000
*                                                                  0913 00942000
*    DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                 0913 00943000
*      GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                 0914 00944000
         L     GPR15P,ATCLCPTR                                     0914 00945000
*    END; /*LISATCVT*/                                             0915 00946000
*      RESPECIFY GPR00F RSTD;                                      0916 00947000
*      GPR00F=4;    /* SET PARAMETER REGISTER TO 4 */              0917 00948000
         LA    GPR00F,4                                            0917 00949000
*      GPR15P=GPR15P->ATCAP31;                                     0918 00950000
         L     GPR15P,ATCAP31(,GPR15P)                             0918 00951000
*      DCL FMZL0079 BASED(GPR15P) LABEL VALUERANGE(*);             0919 00952000
*      CALL FMZL0079;                                              0920 00953000
         BALR  @14,@15                                             0920 00954000
*      RESPECIFY (GPR00F,GPR15P) UNRSTD;                           0921 00955000
*    END; /***** END OF TPEXIT  *****/                             0922 00956000
*   END CVSQUE;                                                    0923 00957000
@EL00002 DS    0H                                                  0923 00958000
@EF00002 DS    0H                                                  0923 00959000
@ER00002 BR    @14                                                 0923 00960000
@PB00002 DS    0H                                                  0924 00961000
*   GEN(  EJECT);                                                  0924 00962000
           EJECT                                                        00963000
*CVSERR:                                                           0925 00964000
*     PROC OPTIONS(NOSAVE NOSAVEAREA);                             0925 00965000
*                                                                  0925 00966000
         B     @PB00003                                            0925 00967000
CVSERR   DS    0H                                                  0926 00968000
*   /*****************************************************************/ 00969000
*   /*                                                               */ 00970000
*   /* THIS SUBROUTINE WILL FREE THE PABS AND INTERFACE WITH SYSDEF  */ 00971000
*   /* TO DELETE THE SEGMENT JUST BUILT.                             */ 00972000
*   /*                                                               */ 00973000
*   /*****************************************************************/ 00974000
*                                                                  0926 00975000
*   CVSRSERR=CVSR14;                /* SAVE THE RETURN REGISTER      */ 00976000
         ST    CVSR14,CVSRSERR                                     0926 00977000
*   IF CVSNOPAB=CVSOFF             /* PABS TO BE FREED       @D32CKDQ*/ 00978000
*     THEN                                                         0927 00979000
         TM    CVSNOPAB,B'00010000'                                0927 00980000
         BNZ   @RF00927                                            0927 00981000
*     DO;                           /*FREE PABS              @D32CKDQ*/ 00982000
*       RFY CVSR2 RSTD;                                    /*@D32CKDQ*/ 00983000
*       CVSR1=NCSPLRPH;                 /* GET AN RPH ADDRESS      0930 00984000
*                                                            @D32CKDQ*/ 00985000
         L     CVSR1,NCSPLRPH(,NCSPLPTR)                           0930 00986000
*       IF RPRENTRY=RPRENTRN | RPRENTRY=RPRENTLH                   0931 00987000
*         THEN CVSR2=CVS4PABS;       /*VARY,ERP,DLR,TOLTEP   @D32CKDQ*/ 00988000
         CLI   RPRENTRY(RDTEPTR),X'01'                             0931 00989000
         BE    @RT00931                                            0931 00990000
         CLI   RPRENTRY(RDTEPTR),X'03'                             0931 00991000
         BNE   @RF00931                                            0931 00992000
@RT00931 DS    0H                                                  0932 00993000
         L     CVSR2,CVS4PABS                                      0932 00994000
*         ELSE CVSR2=CVS3PABS;       /*VARY,ERP,DLR          @D32CKDQ*/ 00995000
*                                                                  0933 00996000
         B     @RC00931                                            0933 00997000
@RF00931 L     CVSR2,CVS3PABS                                      0933 00998000
*       /*************************************************************/ 00999000
*       /*                                                           */ 01000000
*       /* RELEASE THE PABS:                                         */ 01001000
*       /*                                                           */ 01002000
*       /*************************************************************/ 01003000
*                                                                  0934 01004000
*    /*FREESTOR AREA(RDTVPAB)SIZE(CVSR2)TYPE(PAGEABLE)CLEAR(NO)SAVE(YES 01005000
**/                                                                0934 01006000
*     DO;                                                          0934 01007000
@RC00931 DS    0H                                                  0935 01008000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */                  0935 01009000
*/* END OF ATBUILD */                                              0935 01010000
*    RFY (GPR02P,GPR03P) RSTD;                                     0935 01011000
*    RFY ISTRPH BASED(GPR01P);                                     0936 01012000
*    GEN REFS(GPR02P,GPR03P,GPR04P,GPR05P,                         0937 01013000
*             GPR06P,GPR07P,GPR08P,GPR09P,                         0937 01014000
*             GPR10P,GPR11P,GPR12P,GPR13P)                         0937 01015000
*        SETS(RPHWORK);                                            0937 01016000
*                                                                  0937 01017000
         STM   GPR02P,GPR13P,RPHWORK(GPR01P)        SAVE REGISTERS      01018000
*    GPR00F = CVSR2;                                   /*SIZE IN REG0*/ 01019000
         LR    GPR00F,CVSR2                                        0938 01020000
*    DCL 1 CMZA0087 FIXED(31) STATIC LOCAL,                        0939 01021000
*          2 * FIXED(8) INIT(64),                    /* OPTION FLAGS */ 01022000
*          2 * FIXED(8) INIT(96),                     /* STORAGE KEY */ 01023000
*          2 * FIXED(8) INIT(231),                 /* SUBPOOL NUMBER */ 01024000
*          2 * FIXED(8) INIT('01'X);                 /* REQUEST TYPE */ 01025000
*    GPR03F = CMZA0087;                                            0940 01026000
         L     GPR03F,CMZA0087                                     0940 01027000
*    RFY (GPR04P) RSTD;                                            0941 01028000
*    GPR04P = RDTVPAB;                    /*PUT FREEMAIN ADDR IN REG4*/ 01029000
*                                                                  0942 01030000
         L     GPR04P,RDTVPAB(,RDTEPTR)                            0942 01031000
*    DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */                 0943 01032000
*      GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/                 0944 01033000
         L     GPR02P,ATCLCPTR                                     0944 01034000
*    END; /*LISATCVT*/                                             0945 01035000
*    CALL GPR02P -> ATCGTSTR;                         /*CALL ISTORFSR*/ 01036000
         L     @15,ATCGTSTR(,GPR02P)                               0946 01037000
         BALR  @14,@15                                             0946 01038000
*    RFY (GPR02P,GPR03P,GPR04P) UNRSTD;                            0947 01039000
*    END ;                                          /*END OF FREESTOR*/ 01040000
*       RFY CVSR2 UNRSTD;                                  /*@D32CKDQ*/ 01041000
*       END;                                               /*@D32CKDQ*/ 01042000
*     ELSE;                         /*NO PABS                @D32CKDQ*/ 01043000
@RF00927 DS    0H                                                  0952 01044000
*   RFY                                                            0952 01045000
*     CVSR0 RSTD;                                                  0952 01046000
*                                                                  0952 01047000
*   /*****************************************************************/ 01048000
*   /*                                                               */ 01049000
*   /* GET THE VOC LOCK                                              */ 01050000
*   /*                                                               */ 01051000
*   /*****************************************************************/ 01052000
*                                                                  0953 01053000
*   CVSR0=CVS0;                                                    0953 01054000
         SLR   CVSR0,CVSR0                                         0953 01055000
*   CALL CVSSRLOC;                                                 0954 01056000
         BAL   @14,CVSSRLOC                                        0954 01057000
*   CVSR1=NCSPLPTR;                 /* GET THE NCSPL ADDRESS         */ 01058000
         LR    CVSR1,NCSPLPTR                                      0955 01059000
*   CALL ISTSDCRC;                  /* GO TO SYS DEF TO DELETE THE 0956 01060000
*                                      NEW SEGMENT                   */ 01061000
*                                                                  0956 01062000
         L     @15,@CV04736                                        0956 01063000
         BALR  @14,@15                                             0956 01064000
*   /*****************************************************************/ 01065000
*   /*                                                               */ 01066000
*   /* RELEASE THE VOC LOCK                                          */ 01067000
*   /*                                                               */ 01068000
*   /*****************************************************************/ 01069000
*                                                                  0957 01070000
*   CVSR0=CVS10;                                                   0957 01071000
         LA    CVSR0,10                                            0957 01072000
*   CALL CVSSRLOC;                                                 0958 01073000
         BAL   @14,CVSSRLOC                                        0958 01074000
*   RFY                                                            0959 01075000
*     CVSR0 UNRSTD;                                                0959 01076000
*   CVSGOSW='0'B;                   /* TURN OFF THE GO SWITCH        */ 01077000
         NI    CVSGOSW,B'01111111'                                 0960 01078000
*   CVSR14=CVSRSERR;                /* RESTORE THE RETURN REGISTER   */ 01079000
         L     CVSR14,CVSRSERR                                     0961 01080000
*   END CVSERR;                     /* RETURN TO THE CALLER          */ 01081000
@EL00003 DS    0H                                                  0962 01082000
@EF00003 DS    0H                                                  0962 01083000
@ER00003 BR    @14                                                 0962 01084000
@PB00003 DS    0H                                                  0963 01085000
*   GEN(  EJECT);                                                  0963 01086000
*                                                                  0963 01087000
           EJECT                                                        01088000
*   /*****************************************************************/ 01089000
*   /*                                                               */ 01090000
*   /* SYSTEM DEFINITION (RDTE BUILD) SUBROUTINE                     */ 01091000
*   /*                                                               */ 01092000
*   /*****************************************************************/ 01093000
*                                                                  0964 01094000
*    /*SEGMENT(CVSSR10)START*/DO;GOTO CVSSR10@;CVSSR10:END;        0964 01095000
         B     CVSSR10@                                            0965 01096000
CVSSR10  DS    0H                                                  0967 01097000
*   RFY                                                            0967 01098000
*     CVSR15 RSTD;                                                 0967 01099000
*       CVSR1=NCSPLPTR;             /* PUT ADDR OF NCSPL IN R1       */ 01100000
*                                                                  0968 01101000
         LR    CVSR1,NCSPLPTR                                      0968 01102000
*       /*************************************************************/ 01103000
*       /*                                                           */ 01104000
*       /* GO TO SYS. DEF. TO BUILD AN RDT:                          */ 01105000
*       /*                                                           */ 01106000
*       /*************************************************************/ 01107000
*                                                                  0969 01108000
*       CALL ISTSDCRC;                                             0969 01109000
         L     @15,@CV04736                                        0969 01110000
         BALR  @14,@15                                             0969 01111000
*       IF CVSR15=0                 /* WAS BUILD SUCCESSFUL?         */ 01112000
*         THEN                      /* YES - CONTINUE                */ 01113000
         SLR   @11,@11                                             0970 01114000
         CR    CVSR15,@11                                          0970 01115000
         BNE   @RF00970                                            0970 01116000
*         DO;                                                      0971 01117000
*           RDTEPTR=CVSR1;  /* PUT ADDR OF NEW SEGMENT HDR IN      0972 01118000
*                              ADDRESSABILITY REG            @X50BHC8*/ 01119000
         LR    RDTEPTR,CVSR1                                       0972 01120000
*           NCSPLRPT=CVSR1;  /* STORE COMMAND RDTE ADDRESS IN      0973 01121000
*                               NCSPL RPT FIELD              @X50BHC8*/ 01122000
         ST    CVSR1,NCSPLRPT(,NCSPLPTR)                           0973 01123000
*           NCSPLRAD=CVSR1;  /* STORE COMMAND RDTE ADDRESS IN      0974 01124000
*                               NCSPL RAD FIELD              @X50BHC8*/ 01125000
         ST    CVSR1,NCSPLRAD(,NCSPLPTR)                           0974 01126000
*           IF (NCSPLUAD=CVS0 |   /* IS THE U= PARAMETER SPECIFIED   */ 01127000
*              (RPRENTRY=RPRENTRN &  /* IS THIS ENTRY AN RN          */ 01128000
*               RRNRBREM=CVSOFF)) /* IS THE RN A LOCAL               */ 01129000
*            & ( RPRENTRY^=RPRENTAH |    /* NOT APPL HDR OR  @ZA12006*/ 01130000
*               ( RPRENTVH=CVSOFF &      /* NOT VTAM HDR AND @ZA12006*/ 01131000
*                 NCSPLLPT=0 ) )         /* LOGON NOT SPEC   @ZA12006*/ 01132000
*              THEN               /* YES, SO CONTINUE PROCESSING     */ 01133000
         SLR   @07,@07                                             0975 01134000
         ICM   @07,7,NCSPLUAD(NCSPLPTR)                            0975 01135000
         CR    @11,@07                                             0975 01136000
         BE    @GL00002                                            0975 01137000
         CLI   RPRENTRY(RDTEPTR),X'01'                             0975 01138000
         BNE   @RF00975                                            0975 01139000
         TM    RRNRBREM(RDTEPTR),B'00000100'                       0975 01140000
         BNZ   @RF00975                                            0975 01141000
@GL00002 CLI   RPRENTRY(RDTEPTR),X'02'                             0975 01142000
         BNE   @RT00975                                            0975 01143000
         TM    RPRENTVH(RDTEPTR),B'10000000'                       0975 01144000
         BNZ   @RF00975                                            0975 01145000
         L     @11,NCSPLLPT(,NCSPLPTR)                             0975 01146000
         LTR   @11,@11                                             0975 01147000
         BNZ   @RF00975                                            0975 01148000
@RT00975 DS    0H                                                  0976 01149000
*                 DO;                                      /*@DM14025*/ 01150000
*                   IF RPRENTRY=RPRENTAH  /* APPLICATION HEADER    0977 01151000
*                                            SEGMENT                 */ 01152000
*                      & NCSSTCMD=CVSOFF  /* START VTAM IN PROGRESS  */ 01153000
*                      & (NCSPLWRM=CVSON  /* WARM START SPECIFIED    */ 01154000
*                        | NCSPLCLD=CVSON) /* COLD START SPECIFIED   */ 01155000
*                      THEN               /* YES, FAIL THE COMMAND   */ 01156000
         CLI   RPRENTRY(RDTEPTR),X'02'                             0977 01157000
         BNE   @RF00977                                            0977 01158000
         TM    NCSSTCMD(NCSPLPTR),B'00000001'                      0977 01159000
         BNZ   @RF00977                                            0977 01160000
         TM    NCSPLWRM(NCSPLPTR),B'11000000'                      0977 01161000
         BZ    @RF00977                                            0977 01162000
*                         DO;                              /*@X50BHC8*/ 01163000
*                           CVSNOPAB=CVSON;  /* SET NO PABS SWITCH TO   01164000
*                                               ON           @X50BHC8*/ 01165000
         OI    CVSNOPAB,B'00010000'                                0979 01166000
*                           CVSMSID@=ADDR(CVSMS066);  /* GET THE   0980 01167000
*                                             ADDRESS OF MSG @X50BHC8*/ 01168000
         LA    @11,CVSMS066                                        0980 01169000
         ST    @11,CVSMSID@                                        0980 01170000
*                           CVSMSG=ADDR(CVSVARY);  /* GET THE ADDRESS   01171000
*                                             OF MSG TEXT    @X50BHC8*/ 01172000
         LA    @11,CVSVARY                                         0981 01173000
         ST    @11,CVSMSG                                          0981 01174000
*                           CALL CVSERR;   /* CLEAN UP       @X50BHC8*/ 01175000
         BAL   @14,CVSERR                                          0982 01176000
*                         END;                             /*@X50BHC8*/ 01177000
*                       ELSE              /* COMMAND OK              */ 01178000
*                          DO;                             /*@X50BHC8*/ 01179000
         B     @RC00977                                            0984 01180000
@RF00977 DS    0H                                                  0985 01181000
*           IF RPRENTRY=RPRENTRN    /* IS THIS AN RN?                */ 01182000
*             THEN                                                 0985 01183000
         CLI   RPRENTRY(RDTEPTR),X'01'                             0985 01184000
         BNE   @RF00985                                            0985 01185000
*             RRNLCSIP='1'B;        /* YES-TURN ON START IN PROGRESS    01186000
*                                      BIT                           */ 01187000
         OI    RRNLCSIP(RDTEPTR),B'00100000'                       0986 01188000
*           ELSE                                                   0987 01189000
*             ;                                                    0987 01190000
@RF00985 DS    0H                                                  0988 01191000
*           RFY                                                    0988 01192000
*             CVSR0 RSTD;                                          0988 01193000
*                                                                  0988 01194000
*           /*********************************************************/ 01195000
*           /*                                                       */ 01196000
*           /* UNLOCK THE RDT JUST BUILT (RELEASE VOC LOCK):         */ 01197000
*           /*                                                       */ 01198000
*           /*********************************************************/ 01199000
*                                                                  0989 01200000
*           CVSR0=CVS10;                                           0989 01201000
         LA    CVSR0,10                                            0989 01202000
*           CALL CVSSRLOC;                                         0990 01203000
         BAL   @14,CVSSRLOC                                        0990 01204000
*           RFY                                                    0991 01205000
*             CVSR0 UNRSTD;                                        0991 01206000
*           CVSR1=NCSPLPTR;         /*INPUT TO CW7           @D32CKDQ*/ 01207000
         LR    CVSR1,NCSPLPTR                                      0992 01208000
*           CALL ISTINCW7;          /* BUILD PABS            @D32CKDQ*/ 01209000
*                                                                  0993 01210000
         L     @15,@CV04735                                        0993 01211000
         BALR  @14,@15                                             0993 01212000
*            DO;                                                   0994 01213000
*/***  CRRMAINT  PROCNM(ISTINCVS)FUNC(RET)COMP(VY)RPHADD((NCSPLRPH))  * 01214000
**/                                                                0995 01215000
*            /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/         0995 01216000
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          0995 01217000
         L     @11,NCSPLRPH(,NCSPLPTR)                             0995 01218000
         L     @11,RPHCRR(,@11)                                    0995 01219000
         L     @11,CRACRR(,@11)                                    0995 01220000
         XC    VYCCRT+1(11,@11),VYCCRT+1(@11)                      0995 01221000
         MVI   VYCCRT(@11),B'00000000'                             0995 01222000
*NCSPLRPH->RPHCRR->CRACRR->CINCVS = '1'B;                          0996 01223000
         OI    CINCVS(@11),B'00000100'                             0996 01224000
*            END;                  /*@D32CKDQ*/                    0997 01225000
*           IF CVSR15=CVS0          /*BUILT                  @D32CKDQ*/ 01226000
*             THEN                                                 0998 01227000
         SLR   @11,@11                                             0998 01228000
         CR    CVSR15,@11                                          0998 01229000
         BNE   @RF00998                                            0998 01230000
*             DO;                   /*YES                    @D32CKDQ*/ 01231000
*           IF RPRENTRY=RPRENTAH    /* IS IT AN APPLICATION SEGMENT? */ 01232000
*             THEN                  /* YES-OUTPUT 'ACTIVE' MSG       */ 01233000
         CLI   RPRENTRY(RDTEPTR),X'02'                             1000 01234000
         BNE   @RF01000                                            1000 01235000
*             DO;                                                  1001 01236000
*               CVSMSID@=ADDR(CVSMS093);/* GET 'ACTIVE' MSG ADDR     */ 01237000
         LA    @07,CVSMS093                                        1002 01238000
         ST    @07,CVSMSID@                                        1002 01239000
*               CVSMSG=ADDR(CVSNAME1);/* GET NODENAME FOR MSG        */ 01240000
         LA    @07,CVSNAME1                                        1003 01241000
         ST    @07,CVSMSG                                          1003 01242000
*               RPRONLIN=CVSON;     /* SET RDTE ACTIVE               */ 01243000
         OI    RPRONLIN(RDTEPTR),B'00001000'                       1004 01244000
*               /* GO AND PUT THE NEW APPL SEGMENT'S NAME IN THE C/R    01245000
*                  MAJOR NODE DATA SET                       @D419400*/ 01246000
*                                                                  1005 01247000
*                DO; /* CKPTN FUNC(ADD)NODE((RDTEPTR))CONSOLE(NCSPLSID) 01248000
*PH((NCSPLRPH))TPPOST((NCSPLRPH))PROCNM(ISTINCVS)NCSPL((NCSPLPTR)) */   01249000
*                                                                  1005 01250000
*/* ATBUILD (ISTDLRPL,ISTATCVT,ISTNCSPL,ISTAVT)  */                1006 01251000
*/* END OF ATBUILD */                                              1006 01252000
*                                                                  1006 01253000
*                RFY ISTDLRPL BASED(ADDR(CMZCR6PL));               1006 01254000
*                                                                  1006 01255000
*                IF ATCLCPTR->ATCNODDS ^= 0 /* IF CHECKPOINTING    1007 01256000
**/                                                                1007 01257000
*                  THEN DO;                 /* IS IN PROGRESS      1007 01258000
**/                                                                1007 01259000
         L     @07,ATCLCPTR                                        1007 01260000
         C     @11,ATCNODDS(,@07)                                  1007 01261000
         BE    @RF01007                                            1007 01262000
*                    /* * * * * * * * * * * * * * * * * * * * * * * * * 01263000
**/                                                                1009 01264000
*                    /*                                            1009 01265000
**/                                                                1009 01266000
*                    /* INVOKE ISTINCR6 TO ADD THE NAME OF THE NODE     01267000
**/                                                                1009 01268000
*                    /* BEING ACTIVATED TO THE CHECKPOINT DATA SET IF   01269000
**/                                                                1009 01270000
*                    /* THE VARY ACTIVATE IS NOT GENERATED BY START     01271000
**/                                                                1009 01272000
*                    /* COMMAND PROCESSING OR IF THE CHECKPOINT DATA    01273000
**/                                                                1009 01274000
*                    /* SET (ATCNODEL) IS NOT THE SAME AS THE      1009 01275000
**/                                                                1009 01276000
*                    /* CONFIGURATION LIST DATA SET (ATCONFIG).    1009 01277000
**/                                                                1009 01278000
*                    /*                                            1009 01279000
**/                                                                1009 01280000
*                    /* * * * * * * * * * * * * * * * * * * * * * * * * 01281000
**/                                                                1009 01282000
*                    GPR15P = NCSPLPTR;                            1009 01283000
         LR    GPR15P,NCSPLPTR                                     1009 01284000
*                    IF (GPR15P->NCSSTCMD = '0'B                   1010 01285000
*                                                                  1010 01286000
*                      & ATCLCPTR->ATCNODEL ^= '0000000000000000'X)     01287000
*                                                                  1010 01288000
*                      | (ATCLCPTR->ATCNODEL ^= ATCLCPTR->ATCONFIG 1010 01289000
*                                                                  1010 01290000
*                      & ATCLCPTR->ATCNODEL ^= '0000000000000000'X)     01291000
*                                                                  1010 01292000
*                      THEN DO;                                    1010 01293000
*                                                                  1010 01294000
*                                                                  1010 01295000
         TM    NCSSTCMD(GPR15P),B'00000001'                        1010 01296000
         BNZ   @GL00009                                            1010 01297000
         CLC   ATCNODEL(8,@07),@CB04936                            1010 01298000
         BNE   @RT01010                                            1010 01299000
@GL00009 L     @11,ATCLCPTR                                        1010 01300000
         CLC   ATCNODEL(8,@11),ATCONFIG(@11)                       1010 01301000
         BE    @RF01010                                            1010 01302000
         CLC   ATCNODEL(8,@11),@CB04936                            1010 01303000
         BE    @RF01010                                            1010 01304000
@RT01010 DS    0H                                                  1011 01305000
*                DLRPLIDF = DLRPLBID;       /* SET ISTDLRPL CBID   1012 01306000
* */                                                               1012 01307000
         LA    @11,CMZCR6PL                                        1012 01308000
         MVI   DLRPLIDF(@11),X'50'                                 1012 01309000
*                DLRPLLTH = LENGTH(ISTDLRPL) + LENGTH(DLRPLCR6);/* SET  01310000
*ENGTH */                                                          1013 01311000
         MVI   DLRPLLTH(@11),X'90'                                 1013 01312000
*                DLRPLFCD = DLRPLCKP;       /* SET FUNCTION CODE = CKPT 01313000
* */                                                               1014 01314000
         MVI   DLRPLFCD(@11),X'2B'                                 1014 01315000
*                DLRPLRCD = 0;          /* SET RETURN CODE = SUCCESSFUL 01316000
* */                                                               1015 01317000
         MVI   DLRPLRCD(@11),X'00'                                 1015 01318000
*                DLRPLRPF = DLRPLRPH;       /* INDIC DLRPLRNF -> AN RPH 01319000
* */                                                               1016 01320000
         MVI   DLRPLRPF(@11),X'02'                                 1016 01321000
*                DLRPLRNF = NCSPLRPH; /* SET COMPLETN NOTIF FIELD  */   01322000
         L     @07,NCSPLRPH(,NCSPLPTR)                             1017 01323000
         STCM  @07,7,DLRPLRNF(@11)                                 1017 01324000
*                DLRPLUSR = 0; /* SET USER DATA FIELD       */     1018 01325000
         SLR   @05,@05                                             1018 01326000
         ST    @05,DLRPLUSR(,@11)                                  1018 01327000
*                DLRPLNOD = RDTEPTR; /* SET CR6 NODE ID FIELD     */    01328000
         ST    RDTEPTR,DLRPLNOD(,@11)                              1019 01329000
*                DLRPLCON = ADDR(NCSPLSID); /* SET CR6 CONSOLE ID FIELD 01330000
* */                                                               1020 01331000
         LA    @05,NCSPLSID(,NCSPLPTR)                             1020 01332000
         ST    @05,DLRPLCON(,@11)                                  1020 01333000
*                DLRPLFNC = DLRPLADD; /* SET CR6 FUNCTION CODE     */   01334000
*                                                                  1021 01335000
         MVI   DLRPLFNC(@11),X'02'                                 1021 01336000
*                GPR01P = NCSPLRPH; /* GET ADDRESS OF THE RPH */   1022 01337000
*                                                                  1022 01338000
         LR    GPR01P,@07                                          1022 01339000
*/*  TPQUE (ADDR(ISTDLRPL),ATCLCPTR->ATCLDNCS) CHAIN(DLRPLQPT) */  1023 01340000
*                                                                  1023 01341000
*                DO;                                               1023 01342000
*                RFY (GPR02P) RSTD;                                1024 01343000
*                GEN REFS(GPR01P) SETS(RPHWORK)                    1025 01344000
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      1025 01345000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              01346000
*                GPR15P=ADDR(ISTDLRPL); /* GET WORK ELEM POINTER */     01347000
         LA    GPR15P,CMZCR6PL                                     1026 01348000
*                GPR14P=ADDR(ATCLCPTR->ATCLDNCS); /* ADDRESS PAB/QUEUE  01349000
*OINTER */       GPR15P=GPR15P|PABWEQG1;                           1027 01350000
         L     GPR14P,ATCLCPTR                                     1027 01351000
         LA    GPR14P,ATCLDNCS(,GPR14P)                            1027 01352000
         O     GPR15P,@CF01680                                     1028 01353000
*                GPR02P=GPR14P->PABWEQA;/* INITIALIZE WITH QUEUE HEADER 01354000
**/                                                                1029 01355000
         L     GPR02P,PABWEQA(,GPR14P)                             1029 01356000
*CMZA0118:; /* CS FAIL TARGET */                                   1030 01357000
CMZA0118 DS    0H                                                  1031 01358000
*                GPR00P=GPR02P; /* SAVE QUEUE CONTENTS */          1031 01359000
         LR    GPR00P,GPR02P                                       1031 01360000
*                GPR15P->DLRPLQPT=GPR02P|PABWEQG1; /*FORWARD CHAIN WORK 01361000
*ELEMENT*/       CS   (GPR02P,GPR15P,GPR14P->PABWEQA); /* CHECK FOR END 01362000
*OF QUEUE */     BC (7,CMZA0118);                                  1032 01363000
         LR    @11,GPR02P                                          1032 01364000
         O     @11,@CF01680                                        1032 01365000
         ST    @11,DLRPLQPT(,GPR15P)                               1032 01366000
         CS    GPR02P,@15,PABWEQA(GPR14P)                          1033 01367000
         BC    7,CMZA0118                                          1034 01368000
*                GEN REFS(RPHWORK,GPR01P) NOSETS                   1035 01369000
*        (LM    GPR02P,GPR08P,RPHWORK(GPR01P));                    1035 01370000
         LM    GPR02P,GPR08P,RPHWORK(GPR01P)                            01371000
*                RFY (GPR02P) UNRSTD;                              1036 01372000
*                END; /**** END OF TPQUE GENERATION ****/          1037 01373000
*                GPR13P = GPR13P + 12; /* OS/VS2 SETLOCK SAVES REGS AT  01374000
*(13) */                                                           1038 01375000
*                                                                  1038 01376000
         AL    GPR13P,@CF00032                                     1038 01377000
*/*VSETLCK  (GPR15P,OBTAIN,LOCAL,(LOCAL,ISTINCVS(CMZR0108)))*/     1039 01378000
*CMZO0108:       DO;                                               1039 01379000
CMZO0108 DS    0H                                                  1040 01380000
*                                        /*DECLARE AND RESTRICT REGS */ 01381000
*                                        /*   2,10,11,12,13,14, AND 15  01382000
**/                                                                1040 01383000
*                RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P) RSTD;    1040 01384000
*                                        /*SAVE REGS 2 AND 10 THRU 14*/ 01385000
*        GEN REFS(GPR02F,GPR10F,GPR11F,GPR12F,GPR14F,GPR13P);      1041 01386000
*                                                                  1041 01387000
         STM   GPR10F,GPR12F,0(GPR13P)                                  01388000
         ST    GPR14F,12(GPR13P)                                        01389000
         ST    GPR02F,16(GPR13P)                                        01390000
*                                        /*INVOKE MODESET TO CHANGE  */ 01391000
*                                        /*PSW PROTECTION KEY TO 0   */ 01392000
*        GEN SETS(2);                                              1042 01393000
*                                                                  1042 01394000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      01395000
*                  GPR10P=GPR13P;        /*PUT SAVE AREA ADDR IN R 10*/ 01396000
         LR    GPR10P,GPR13P                                       1043 01397000
*                                        /*INVOKE OS/VS SETLOCK MACRO*/ 01398000
*                  GEN REFS(GPR13P,PSALITA,FLC) SETS(GPR12F);      1044 01399000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        *01400000
               RELATED=(LOCAL,ISTINCVS(CMZR0108))                       01401000
*                  GPR15P=GPR13P;        /*PUT RETURN CODE IN R 15 */   01402000
         LR    GPR15P,GPR13P                                       1045 01403000
*                                        /*INVOKE MODESET MACRO TO   */ 01404000
*                    DO;                 /*RESTORE PSW PROTECTION KEY*/ 01405000
*        GEN SETS(2);                                              1047 01406000
         MODESET KEYADDR=(2),WORKREG=2                                  01407000
*                    END;                /* RESTORE REGISTERS        */ 01408000
*                  GEN REFS(GPR10F,GPR13P) SETS(GPR10F,GPR11F,     1049 01409000
*                  GPR12F,GPR13F,GPR14F,GPR02F);                   1049 01410000
         LR    GPR13F,GPR10F                                            01411000
         LM    GPR10F,GPR12F,0(GPR13P)                                  01412000
         L     GPR14F,12(GPR13P)                                        01413000
         L     GPR02F,16(GPR13P)                                        01414000
*                  IF GPR15F=4 THEN GPR15F=0;                      1050 01415000
         C     GPR15F,@CF00086                                     1050 01416000
         BNE   @RF01050                                            1050 01417000
         SLR   GPR15F,GPR15F                                       1051 01418000
*                  GPR15P=GPR15F;        /*PUT RETURN CODE IN RCREG*/   01419000
*                                                                  1052 01420000
@RF01050 DS    0H                                                  1053 01421000
*                RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P) UNRSTD;  1053 01422000
*                END;  /*CMZO0108:VSETLCK */                       1054 01423000
*                                                                  1054 01424000
*/*VPOST  ECB(ATCLCPTR->ATCLDECB)*/                                1055 01425000
*                DO;                                               1055 01426000
*                                                                  1055 01427000
*                RFY (GPR02P,GPR05P,GPR09P,GPR10P,GPR11P,GPR12P,GPR13P) 01428000
*RSTD;                                   /*DECLARE AND RESTRICT REGS */ 01429000
*                                        /* SAVE REGS         */   1057 01430000
*                  GEN REFS(GPR00F,GPR01F,GPR02F,GPR05F,GPR09F,    1057 01431000
*                  GPR10F,GPR11F,GPR12P,GPR13P,GPR14F,GPR15F);     1057 01432000
         STM   GPR14F,GPR12F,0(GPR13P)                                  01433000
*                  GPR00P=GPR13P;        /*SAVE REG 13 IN REG 0     */  01434000
         LR    GPR00P,GPR13P                                       1058 01435000
*                                        /*INVOKE XREGSET MACRO TO*/    01436000
*                                        /*CHECK ECB PARAMETER AND*/    01437000
*                                        /*PUT ADDRESS IN REG 1   */    01438000
*                                                                  1059 01439000
*/*XREGSET  PID('ECB')PPARM(ATCLCPTR->ATCLDECB)RREG(1,GPR01P)*/    1059 01440000
*                DO;                                               1059 01441000
*                  GPR01P=ADDR(ATCLCPTR->ATCLDECB);                1060 01442000
         L     GPR01P,ATCLCPTR                                     1060 01443000
         LA    GPR01P,ATCLDECB(,GPR01P)                            1060 01444000
*                                        /*SET RREG SYMBOL TO ADDRESS*/ 01445000
*                                        /*OF PPARM OPERAND          */ 01446000
*                END;  /* XREGSET */                               1061 01447000
*                  GPR10F=0;             /*SET COMPLETION CODE TO 0*/   01448000
         SLR   GPR10F,GPR10F                                       1062 01449000
*                  GPR11P=GPR01P;        /*PUT ECB ADDR IN REG 11    */ 01450000
         LR    GPR11P,GPR01P                                       1063 01451000
*                  DCL CMZP0127 PTR(31) LOCATION(16);              1064 01452000
*                                        /*ESTABLISH POINTER TO CVT  */ 01453000
*                                                                  1065 01454000
*/*VMDESET  ((15),ZERO,(2))*/                                      1065 01455000
*                DO;                     /* INVOKE MODESET MACRO    */  01456000
*                  GEN SETS (2);                                   1066 01457000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      01458000
*                  GPR15F=0;                                       1067 01459000
         SLR   GPR15F,GPR15F                                       1067 01460000
*                                        /*PUT RETURN CODE IN RCREG*/   01461000
*                END;  /* VMDESET */                               1068 01462000
*                  GPR05F=GPR02F;                                  1069 01463000
         LR    GPR05F,GPR02F                                       1069 01464000
*                  CALL CMZP0127->CVT0PT01;                        1070 01465000
         L     @07,CMZP0127                                        1070 01466000
         L     @15,CVT0PT01(,@07)                                  1070 01467000
         BALR  @14,@15                                             1070 01468000
*                                        /*BRANCH TO TASK SUPERVISOR */ 01469000
*                                        /* POST ROUTINE (IEA0PT01)  */ 01470000
*                  GPR02F=GPR05F;                                  1071 01471000
*                                                                  1071 01472000
         LR    GPR02F,GPR05F                                       1071 01473000
*/*VMDESET  ((15),,,(2))*/                                         1072 01474000
*                DO;                     /* INVOKE MODESET MACRO    */  01475000
*                  GEN SETS (2);                                   1073 01476000
         MODESET KEYADDR=(2),WORKREG=2                                  01477000
*                  GPR15F=0;                                       1074 01478000
         SLR   GPR15F,GPR15F                                       1074 01479000
*                                        /*PUT RETURN CODE IN RCREG*/   01480000
*                END;  /* VMDESET */                               1075 01481000
*                  GPR13P=GPR00P;        /*RESTORE SAVE AREA ADDR  */   01482000
         LR    GPR13P,GPR00P                                       1076 01483000
*                                        /*     FROM REGISTER 0    */   01484000
*                                        /*RESTORE REGS */         1077 01485000
*                  GEN REFS(GPR13P) SETS(GPR00F,                   1077 01486000
*                  GPR01F,GPR02F,GPR05F,GPR09F,GPR10F,GPR11F,      1077 01487000
*                  GPR12F,GPR14F,GPR15F);                          1077 01488000
*                                                                  1077 01489000
         LM    GPR14F,GPR12F,0(GPR13P)                                  01490000
*                RFY (GPR02P,GPR05P,GPR09P,GPR10P,GPR11P,GPR12P,GPR13P) 01491000
*UNRSTD;                                 /*UNRESTRICT REGS */      1078 01492000
*                END; /* VPOST */                                  1079 01493000
*                                                                  1079 01494000
*/*VSETLCK  (GPR15P,RELEASE,LOCAL,(LOCAL,ISTINCVS(CMZO0108)))*/    1080 01495000
*CMZR0108:       DO;                                               1080 01496000
CMZR0108 DS    0H                                                  1081 01497000
*                                        /*DECLARE AND RESTRICT REGS */ 01498000
*                                        /*   2,10,11,12,13,14, AND 15  01499000
**/                                                                1081 01500000
*                RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P) RSTD;    1081 01501000
*                                        /*SAVE REGS 2 AND 10 THRU 14*/ 01502000
*        GEN REFS(GPR02F,GPR10F,GPR11F,GPR12F,GPR14F,GPR13P);      1082 01503000
*                                                                  1082 01504000
         STM   GPR10F,GPR12F,0(GPR13P)                                  01505000
         ST    GPR14F,12(GPR13P)                                        01506000
         ST    GPR02F,16(GPR13P)                                        01507000
*                                        /*INVOKE MODESET TO CHANGE  */ 01508000
*                                        /*PSW PROTECTION KEY TO 0   */ 01509000
*        GEN SETS(2);                                              1083 01510000
*                                                                  1083 01511000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      01512000
*                  GPR10P=GPR13P;        /*PUT SAVE AREA ADDR IN R 10*/ 01513000
         LR    GPR10P,GPR13P                                       1084 01514000
*                                        /*INVOKE OS/VS SETLOCK MACRO*/ 01515000
*                  GEN REFS(GPR13P,PSALITA,FLC) SETS(GPR12F);      1085 01516000
         SETLOCK RELEASE,TYPE=LOCAL,                                   *01517000
               RELATED=(LOCAL,ISTINCVS(CMZO0108))                       01518000
*                  GPR15P=GPR13P;        /*PUT RETURN CODE IN R 15 */   01519000
         LR    GPR15P,GPR13P                                       1086 01520000
*                                        /*INVOKE MODESET MACRO TO   */ 01521000
*                    DO;                 /*RESTORE PSW PROTECTION KEY*/ 01522000
*        GEN SETS(2);                                              1088 01523000
         MODESET KEYADDR=(2),WORKREG=2                                  01524000
*                    END;                /* RESTORE REGISTERS        */ 01525000
*                  GEN REFS(GPR10F,GPR13P) SETS(GPR10F,GPR11F,     1090 01526000
*                  GPR12F,GPR13F,GPR14F,GPR02F);                   1090 01527000
         LR    GPR13F,GPR10F                                            01528000
         LM    GPR10F,GPR12F,0(GPR13P)                                  01529000
         L     GPR14F,12(GPR13P)                                        01530000
         L     GPR02F,16(GPR13P)                                        01531000
*                  IF GPR15F=4 THEN GPR15F=0;                      1091 01532000
         C     GPR15F,@CF00086                                     1091 01533000
         BNE   @RF01091                                            1091 01534000
         SLR   GPR15F,GPR15F                                       1092 01535000
*                  GPR15P=GPR15F;        /*PUT RETURN CODE IN RCREG*/   01536000
*                                                                  1093 01537000
@RF01091 DS    0H                                                  1094 01538000
*                RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P) UNRSTD;  1094 01539000
*                END;  /*CMZR0108:VSETLCK */                       1095 01540000
*                GPR13P = GPR13P - 12; /* RESTORE REG 13 FOR SAVE AREA  01541000
*HAIN */                                                           1096 01542000
         SL    GPR13P,@CF00032                                     1096 01543000
*                GPR15P = 0;            /* INDIC VALID REQUEST     1097 01544000
**/                                                                1097 01545000
         SLR   GPR15P,GPR15P                                       1097 01546000
*                        END;           /* END VALID REQUEST       1098 01547000
**/                                                                1098 01548000
*                      ELSE GPR15P = 4; /* INDIC ADD NOT DONE      1099 01549000
**/                                                                1099 01550000
         B     @RC01010                                            1099 01551000
@RF01010 LA    GPR15P,4                                            1099 01552000
*                    END;               /* END CHECKPOINTING IN PROCESS 01553000
**/                                                                1100 01554000
*                  ELSE GPR15P = 4;     /* INDIC CKPTING NOT IN PROCESS 01555000
**/                                                                1101 01556000
*                                                                  1101 01557000
         B     @RC01007                                            1101 01558000
@RF01007 LA    GPR15P,4                                            1101 01559000
*                END; /* END OF CKPTN EXPANSION */ /*@D419400*/    1102 01560000
@RC01007 DS    0H                                                  1103 01561000
*               IF CVSR15=CVS0 /* NEED TO DO A TPWAIT?       @D419400*/ 01562000
*                  THEN          /* YES                      @D419400*/ 01563000
         LTR   CVSR15,CVSR15                                       1103 01564000
         BNZ   @RF01103                                            1103 01565000
*                  DO;                                     /*@D419400*/ 01566000
*                    CVSR1=NCSPLRPH; /* SET REG 1 = @ RPH    @XM18394*/ 01567000
*                                                                  1105 01568000
         L     CVSR1,NCSPLRPH(,NCSPLPTR)                           1105 01569000
*/*  TPWAIT   */                                                   1106 01570000
*                     DO; /* BEGIN TPWAIT GENERATION*/             1106 01571000
*                     GEN (STM   GPR00P,GPR15P,RPHWORK(GPR01P))    1107 01572000
*                     REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);    1107 01573000
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)                            01574000
*                     GPR15P=ADDR(LHAA0141);                       1108 01575000
         LA    GPR15P,LHAA0141                                     1108 01576000
*                     GPR14P=0;                                    1109 01577000
         SLR   GPR14P,GPR14P                                       1109 01578000
*                     GPR15P=GPR15P & '00FFFFFF'X;                 1110 01579000
         N     GPR15P,@CF04907                                     1110 01580000
*                     GPR15P=GPR15P | RPHWT1;                      1111 01581000
         O     GPR15P,@CF01639                                     1111 01582000
*                     CS (GPR14P,GPR15P,GPR01P->RPHRESMA);         1112 01583000
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         1112 01584000
*                     BC (7,LHAB0141);                             1113 01585000
*                                                                  1113 01586000
         BC    7,LHAB0141                                          1113 01587000
*/* TPEXIT  NONE */                                                1114 01588000
*                     DO;                                          1114 01589000
*                       RESPECIFY GPR15P RSTD;                     1115 01590000
*                                                                  1115 01591000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         1116 01592000
*/* END OF ATBUILD */                                              1116 01593000
*                     DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */     01594000
*                       GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/     01595000
         L     GPR15P,ATCLCPTR                                     1117 01596000
*                     END; /*LISATCVT*/                            1118 01597000
*                       RESPECIFY GPR00F RSTD;                     1119 01598000
*                       GPR00F=0;     /*SET PARAMETER REGISTER TO 0*/   01599000
         SLR   GPR00F,GPR00F                                       1120 01600000
*                       GPR15P=GPR15P->ATCAP31;                    1121 01601000
         L     GPR15P,ATCAP31(,GPR15P)                             1121 01602000
*                       DCL FMZL0146 BASED(GPR15P) LABEL VALUERANGE(*); 01603000
*                       CALL FMZL0146;                             1123 01604000
         BALR  @14,@15                                             1123 01605000
*                       RESPECIFY (GPR00F,GPR15P) UNRSTD;          1124 01606000
*                     END; /***** END OF TPEXIT  *****/            1125 01607000
*LHAB0141:;           GPR01P->RPHRESMA = 0;                        1126 01608000
*                                                                  1126 01609000
LHAB0141 DS    0H                                                  1127 01610000
         SLR   @11,@11                                             1127 01611000
         ST    @11,RPHRESMA(,GPR01P)                               1127 01612000
*LHAA0141:;           GEN (LM    GPR00P,GPR15P,RPHWORK(GPR01P))    1128 01613000
LHAA0141 DS    0H                                                  1129 01614000
*                     REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);    1129 01615000
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)                            01616000
*                     END; /*****END OF TPWAIT *****/ /* WAIT FOR C/R T 01617000
* COMPLETE    @D419400*/                                           1130 01618000
*                  END;                                    /*@D419400*/ 01619000
*                  ELSE CVSR15=CVS0; /*RESET REG 15 @D414900,@XM18390*/ 01620000
         B     @RC01103                                            1132 01621000
@RF01103 SLR   CVSR15,CVSR15                                       1132 01622000
*             END;                                                 1133 01623000
*           ELSE                                                   1134 01624000
*             DO;                                                  1134 01625000
         B     @RC01000                                            1134 01626000
@RF01000 DS    0H                                                  1135 01627000
*               IF RPRENTRY^=RPRENTRN/* 370X                 @D32CKDQ*/ 01628000
*                 THEN              /* YES -                         */ 01629000
         CLI   RPRENTRY(RDTEPTR),X'01'                             1135 01630000
         BE    @RF01135                                            1135 01631000
*                 DO;                                              1136 01632000
*                   RPRONLIN=CVSON; /* SET ONLINE BIT ON             */ 01633000
         OI    RPRONLIN(RDTEPTR),B'00001000'                       1137 01634000
*                   RPRLIVE=CVSON;  /* SET LIVE BIT ON               */ 01635000
         OI    RPRLIVE(RDTEPTR),B'00000001'                        1138 01636000
*                 END;                                             1139 01637000
*               ELSE                                               1140 01638000
*                 ;                                                1140 01639000
@RF01135 DS    0H                                                  1141 01640000
*               CVSGOSW=CVSON;      /* SET THE GO SWITCH ON          */ 01641000
         OI    CVSGOSW,B'10000000'                                 1141 01642000
*             END;                                                 1142 01643000
*             END;                                         /*@D32CKDQ*/ 01644000
*           ELSE                                                   1144 01645000
*           DO;                     /*NO PABS BUILT          @D32CKDQ*/ 01646000
         B     @RC00998                                            1144 01647000
@RF00998 DS    0H                                                  1145 01648000
*             CVSNOPAB=CVSON;       /*SET NO PABS            @D32CKDQ*/ 01649000
         OI    CVSNOPAB,B'00010000'                                1145 01650000
*             CALL CVSERR;          /*CLEAN UP               @D32CKDQ*/ 01651000
         BAL   @14,CVSERR                                          1146 01652000
*             CVSMSID@=ADDR(CVSMS074);/*INSUFFICIENT STORAGE @D32CKDQ*/ 01653000
         LA    @11,CVSMS074                                        1147 01654000
         ST    @11,CVSMSID@                                        1147 01655000
*             CVSMSG=ADDR(CVSVARY);  /*NODENAME FOR MSG      @D32CKDQ*/ 01656000
         LA    @11,CVSVARY                                         1148 01657000
         ST    @11,CVSMSG                                          1148 01658000
*             END;                                         /*@D32CKDQ*/ 01659000
*             END;                                         /*@X50BHC8*/ 01660000
*            END;             /* END LOCAL RN PROCESSING     @DM14025*/ 01661000
*           ELSE              /* U= PARAMETER WAS INVALID ON THIS  1152 01662000
*                                RDT ENTRY                   @DM14025*/ 01663000
*              DO;            /* PROCESS THIS ERROR          @DM14025*/ 01664000
         B     @RC00975                                            1152 01665000
@RF00975 DS    0H                                                  1153 01666000
*                CVSNOPAB=CVSON;  /* SET NO PABS SWITCH      @DM14025*/ 01667000
         OI    CVSNOPAB,B'00010000'                                1153 01668000
*                RFY CVSR0 RSTD;                           /*@ZA12006*/ 01669000
*                CVSR0=CVS10;                              /*@ZA12006*/ 01670000
         LA    CVSR0,10                                            1155 01671000
*                CALL CVSSRLOC;                            /*@ZA12006*/ 01672000
         BAL   @14,CVSSRLOC                                        1156 01673000
*                RFY CVSR0 UNRSTD;                         /*@ZA12006*/ 01674000
*                CALL CVSERR;     /* CLEAN UP                @DM14025*/ 01675000
         BAL   @14,CVSERR                                          1158 01676000
*                CVSMSID@=ADDR(CVSMS066);  /* GET THE ADDRESS OF   1159 01677000
*                                             MESSAGE 066I   @DM14025*/ 01678000
         LA    @11,CVSMS066                                        1159 01679000
         ST    @11,CVSMSID@                                        1159 01680000
*                CVSMSG=ADDR(CVSVARY);     /* GET THE ADDRESS OF THE    01681000
*                                             MESSAGE TEXT   @DM14025*/ 01682000
         LA    @11,CVSVARY                                         1160 01683000
         ST    @11,CVSMSG                                          1160 01684000
*              END;            /* END OF ERROR PROCESSING    @DM14025*/ 01685000
*         END;                                                     1162 01686000
*       ELSE                                                       1163 01687000
*         DO;                       /* BUILD NOT OK -                */ 01688000
         B     @RC00970                                            1163 01689000
@RF00970 DS    0H                                                  1164 01690000
*           IF CVSR15=4             /* WAS THE NAME FOUND?           */ 01691000
*             THEN                  /* NO-OUTPUT 'INVALID' MSG       */ 01692000
         C     CVSR15,@CF00086                                     1164 01693000
         BNE   @RF01164                                            1164 01694000
*             DO;                                                  1165 01695000
*               CVSMSID@=ADDR(CVSMS061);/* GET ADDRESS OF 'INVALID' MSG 01696000
*                                          ID                        */ 01697000
         LA    @11,CVSMS061                                        1166 01698000
         ST    @11,CVSMSID@                                        1166 01699000
*               CVSMSG=ADDR(CVSNAME1);/* ADR NODENAME FOR MSG        */ 01700000
         LA    @11,CVSNAME1                                        1167 01701000
         ST    @11,CVSMSG                                          1167 01702000
*             END;                                                 1168 01703000
*           ELSE                                                   1169 01704000
*             IF CVSR15=12          /* INSUFFICIENT STORAGE?         */ 01705000
*               THEN                /* YES-OUTPUT STORAGE MSG        */ 01706000
         B     @RC01164                                            1169 01707000
@RF01164 C     CVSR15,@CF00032                                     1169 01708000
         BNE   @RF01169                                            1169 01709000
*               DO;                                                1170 01710000
*                 CVSMSID@=ADDR(CVSMS074);/* GET ADDR OF 'INSUFFICIENT  01711000
*                                            STORAGE' MSG ID         */ 01712000
         LA    @11,CVSMS074                                        1171 01713000
         ST    @11,CVSMSID@                                        1171 01714000
*                 CVSMSG=ADDR(CVSVARY);/* NODENAME FOR MSG          */  01715000
         LA    @11,CVSVARY                                         1172 01716000
         ST    @11,CVSMSG                                          1172 01717000
*               END;                                               1173 01718000
*             ELSE                  /* ASSUME BUILD FAILED - RETURN     01719000
*                                      CODE = 8                      */ 01720000
*               DO;                                                1174 01721000
         B     @RC01169                                            1174 01722000
@RF01169 DS    0H                                                  1175 01723000
*                 CVSMSID@=ADDR(CVSMS072);/* GET ADDR OF 'NETWORK  1175 01724000
*                                           DEFINITION FAILED' MSG ID*/ 01725000
         LA    @11,CVSMS072                                        1175 01726000
         ST    @11,CVSMSID@                                        1175 01727000
*                 CVSMSG=ADDR(CVSNAME1);/* ADR NODENAME FOR MSG      */ 01728000
         LA    @11,CVSNAME1                                        1176 01729000
         ST    @11,CVSMSG                                          1176 01730000
*               END;                                               1177 01731000
*         END;                                                     1178 01732000
@RC01169 DS    0H                                                  1178 01733000
@RC01164 DS    0H                                                  1179 01734000
*   IF CVSR15^=CVS0 /* WERE THERE ANY ERRORS? */                   1179 01735000
*      THEN                                                        1179 01736000
@RC00970 SLR   @11,@11                                             1179 01737000
         CR    CVSR15,@11                                          1179 01738000
         BE    @RF01179                                            1179 01739000
*      DO;  /* YES, SO UPDATE THE C/R MAJOR NODE DATA SET    @D419400*/ 01740000
*                                                                  1180 01741000
*         DO; /* CKPTN FUNC(DELETE)NODE(NCSPLRID)CONSOLE(NCSPLSID)RPH(( 01742000
*CSPLRPH))TPPOST((NCSPLRPH))PROCNM(ISTINCVS)NCSPL((NCSPLPTR)) */   1181 01743000
*                                                                  1181 01744000
*/* ATBUILD (ISTDLRPL,ISTATCVT,ISTNCSPL,ISTAVT)  */                1182 01745000
*/* END OF ATBUILD */                                              1182 01746000
*                                                                  1182 01747000
*         RFY ISTDLRPL BASED(ADDR(CMZCR6PL));                      1182 01748000
*                                                                  1182 01749000
*         IF ATCLCPTR->ATCNODDS ^= 0 /* IF CHECKPOINTING         */     01750000
*           THEN DO;                 /* IS IN PROGRESS           */     01751000
         L     @07,ATCLCPTR                                        1183 01752000
         C     @11,ATCNODDS(,@07)                                  1183 01753000
         BE    @RF01183                                            1183 01754000
*             /* * * * * * * * * * * * * * * * * * * * * * * * * */     01755000
*             /*                                                 */     01756000
*             /* INVOKE ISTINCR6 TO DELETE THE NAME OF THE NODE  */     01757000
*             /* BEING DEACTIVATED FROM THE CHECKPOINT DATA SET  */     01758000
*             /* UNLESS HALT VTAM IS IN PROCESS.                 */     01759000
*             /*                                                 */     01760000
*             /* * * * * * * * * * * * * * * * * * * * * * * * * */     01761000
*                                                                  1185 01762000
*         DO; /* LISATCVT CVTBASE(FIXED,(GPR15P)) */               1185 01763000
*                                                                  1185 01764000
*         RFY (EMCR15) RSTD;                                       1186 01765000
*           GEN SETS (EMCR15)                                      1187 01766000
*        (L     EMCR15,X'10' POINT TO CVT);                        1187 01767000
         L     EMCR15,X'10' POINT TO CVT                                01768000
*           GPR15P = EMCR15->CVTEXT2->CVTATCVT; /*SET UP AVT POINTER*/  01769000
*                                                                  1188 01770000
         L     @11,CVTEXT2(,EMCR15)                                1188 01771000
         L     @11,CVTATCVT(,@11)                                  1188 01772000
         LR    GPR15P,@11                                          1188 01773000
*         RFY (EMCR15) UNRSTD;                                     1189 01774000
*         END; /*LISATCVT*/                                        1190 01775000
*             IF GPR15P->ISTAHIP = '0'B                            1191 01776000
*               THEN DO;                                           1191 01777000
*                                                                  1191 01778000
         TM    ISTAHIP(GPR15P),B'10000000'                         1191 01779000
         BNZ   @RF01191                                            1191 01780000
*         DLRPLIDF = DLRPLBID;       /* SET ISTDLRPL CBID         */    01781000
         LA    @11,CMZCR6PL                                        1193 01782000
         MVI   DLRPLIDF(@11),X'50'                                 1193 01783000
*         DLRPLLTH = LENGTH(ISTDLRPL) + LENGTH(DLRPLCR6);/* SET LENGTH  01784000
*/                                                                 1194 01785000
         MVI   DLRPLLTH(@11),X'90'                                 1194 01786000
*         DLRPLFCD = DLRPLCKP;       /* SET FUNCTION CODE = CKPTN */    01787000
         MVI   DLRPLFCD(@11),X'2B'                                 1195 01788000
*         DLRPLRCD = 0;          /* SET RETURN CODE = SUCCESSFUL  */    01789000
         MVI   DLRPLRCD(@11),X'00'                                 1196 01790000
*         DLRPLRPF = DLRPLRPH;       /* INDIC DLRPLRNF -> AN RPH  */    01791000
         MVI   DLRPLRPF(@11),X'02'                                 1197 01792000
*         DLRPLRNF = NCSPLRPH; /* SET COMPLETN NOTIF FIELD  */     1198 01793000
         L     @07,NCSPLRPH(,NCSPLPTR)                             1198 01794000
         STCM  @07,7,DLRPLRNF(@11)                                 1198 01795000
*         DLRPLUSR = 0; /* SET USER DATA FIELD       */            1199 01796000
         SLR   @05,@05                                             1199 01797000
         ST    @05,DLRPLUSR(,@11)                                  1199 01798000
*         DLRPLNOD = ADDR(NCSPLRID); /* SET CR6 NODE ID FIELD     */    01799000
         LA    @05,NCSPLRID(,NCSPLPTR)                             1200 01800000
         ST    @05,DLRPLNOD(,@11)                                  1200 01801000
*         DLRPLCON = ADDR(NCSPLSID); /* SET CR6 CONSOLE ID FIELD  */    01802000
         LA    @05,NCSPLSID(,NCSPLPTR)                             1201 01803000
         ST    @05,DLRPLCON(,@11)                                  1201 01804000
*         DLRPLFNC = DLRPLDEL; /* SET CR6 FUNCTION CODE     */     1202 01805000
*                                                                  1202 01806000
         MVI   DLRPLFNC(@11),X'03'                                 1202 01807000
*         GPR01P = NCSPLRPH; /* GET ADDRESS OF THE RPH */          1203 01808000
*                                                                  1203 01809000
         LR    GPR01P,@07                                          1203 01810000
*/*  TPQUE (ADDR(ISTDLRPL),ATCLCPTR->ATCLDNCS) CHAIN(DLRPLQPT) */  1204 01811000
*                                                                  1204 01812000
*         DO;                                                      1204 01813000
*         RFY (GPR02P) RSTD;                                       1205 01814000
*         GEN REFS(GPR01P) SETS(RPHWORK)                           1206 01815000
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      1206 01816000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              01817000
*         GPR15P=ADDR(ISTDLRPL); /* GET WORK ELEM POINTER */       1207 01818000
         LA    GPR15P,CMZCR6PL                                     1207 01819000
*         GPR14P=ADDR(ATCLCPTR->ATCLDNCS); /* ADDRESS PAB/QUEUE POINTER 01820000
**/       GPR15P=GPR15P|PABWEQG1;                                  1208 01821000
         L     GPR14P,ATCLCPTR                                     1208 01822000
         LA    GPR14P,ATCLDNCS(,GPR14P)                            1208 01823000
         O     GPR15P,@CF01680                                     1209 01824000
*         GPR02P=GPR14P->PABWEQA;/* INITIALIZE WITH QUEUE HEADER */     01825000
         L     GPR02P,PABWEQA(,GPR14P)                             1210 01826000
*CMZA0172:; /* CS FAIL TARGET */                                   1211 01827000
CMZA0172 DS    0H                                                  1212 01828000
*         GPR00P=GPR02P; /* SAVE QUEUE CONTENTS */                 1212 01829000
         LR    GPR00P,GPR02P                                       1212 01830000
*         GPR15P->DLRPLQPT=GPR02P|PABWEQG1; /*FORWARD CHAIN WORK ELEMEN 01831000
**/       CS   (GPR02P,GPR15P,GPR14P->PABWEQA); /* CHECK FOR END OF QUE 01832000
*E */     BC (7,CMZA0172);                                         1213 01833000
         LR    @11,GPR02P                                          1213 01834000
         O     @11,@CF01680                                        1213 01835000
         ST    @11,DLRPLQPT(,GPR15P)                               1213 01836000
         CS    GPR02P,@15,PABWEQA(GPR14P)                          1214 01837000
         BC    7,CMZA0172                                          1215 01838000
*         GEN REFS(RPHWORK,GPR01P) NOSETS                          1216 01839000
*        (LM    GPR02P,GPR08P,RPHWORK(GPR01P));                    1216 01840000
         LM    GPR02P,GPR08P,RPHWORK(GPR01P)                            01841000
*         RFY (GPR02P) UNRSTD;                                     1217 01842000
*         END; /**** END OF TPQUE GENERATION ****/                 1218 01843000
*         GPR13P = GPR13P + 12; /* OS/VS2 SETLOCK SAVES REGS AT 0(13) * 01844000
*                                                                  1219 01845000
*                                                                  1219 01846000
         AL    GPR13P,@CF00032                                     1219 01847000
*/*VSETLCK  (GPR15P,OBTAIN,LOCAL,(LOCAL,ISTINCVS(CMZR0156)))*/     1220 01848000
*CMZO0156:DO;                                                      1220 01849000
CMZO0156 DS    0H                                                  1221 01850000
*                                        /*DECLARE AND RESTRICT REGS */ 01851000
*                                        /*   2,10,11,12,13,14, AND 15  01852000
**/                                                                1221 01853000
*         RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P) RSTD;           1221 01854000
*                                        /*SAVE REGS 2 AND 10 THRU 14*/ 01855000
*        GEN REFS(GPR02F,GPR10F,GPR11F,GPR12F,GPR14F,GPR13P);      1222 01856000
*                                                                  1222 01857000
         STM   GPR10F,GPR12F,0(GPR13P)                                  01858000
         ST    GPR14F,12(GPR13P)                                        01859000
         ST    GPR02F,16(GPR13P)                                        01860000
*                                        /*INVOKE MODESET TO CHANGE  */ 01861000
*                                        /*PSW PROTECTION KEY TO 0   */ 01862000
*        GEN SETS(2);                                              1223 01863000
*                                                                  1223 01864000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      01865000
*           GPR10P=GPR13P;               /*PUT SAVE AREA ADDR IN R 10*/ 01866000
         LR    GPR10P,GPR13P                                       1224 01867000
*                                        /*INVOKE OS/VS SETLOCK MACRO*/ 01868000
*           GEN REFS(GPR13P,PSALITA,FLC) SETS(GPR12F);             1225 01869000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        *01870000
               RELATED=(LOCAL,ISTINCVS(CMZR0156))                       01871000
*           GPR15P=GPR13P;               /*PUT RETURN CODE IN R 15 */   01872000
         LR    GPR15P,GPR13P                                       1226 01873000
*                                        /*INVOKE MODESET MACRO TO   */ 01874000
*             DO;                        /*RESTORE PSW PROTECTION KEY*/ 01875000
*        GEN SETS(2);                                              1228 01876000
         MODESET KEYADDR=(2),WORKREG=2                                  01877000
*             END;                       /* RESTORE REGISTERS        */ 01878000
*           GEN REFS(GPR10F,GPR13P) SETS(GPR10F,GPR11F,            1230 01879000
*           GPR12F,GPR13F,GPR14F,GPR02F);                          1230 01880000
         LR    GPR13F,GPR10F                                            01881000
         LM    GPR10F,GPR12F,0(GPR13P)                                  01882000
         L     GPR14F,12(GPR13P)                                        01883000
         L     GPR02F,16(GPR13P)                                        01884000
*           IF GPR15F=4 THEN GPR15F=0;                             1231 01885000
         C     GPR15F,@CF00086                                     1231 01886000
         BNE   @RF01231                                            1231 01887000
         SLR   GPR15F,GPR15F                                       1232 01888000
*           GPR15P=GPR15F;               /*PUT RETURN CODE IN RCREG*/   01889000
*                                                                  1233 01890000
@RF01231 DS    0H                                                  1234 01891000
*         RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P) UNRSTD;         1234 01892000
*         END;  /*CMZO0156:VSETLCK */                              1235 01893000
*                                                                  1235 01894000
*/*VPOST  ECB(ATCLCPTR->ATCLDECB)*/                                1236 01895000
*         DO;                                                      1236 01896000
*                                                                  1236 01897000
*         RFY (GPR02P,GPR05P,GPR09P,GPR10P,GPR11P,GPR12P,GPR13P) RSTD;  01898000
*                                        /*DECLARE AND RESTRICT REGS */ 01899000
*                                        /* SAVE REGS         */   1238 01900000
*           GEN REFS(GPR00F,GPR01F,GPR02F,GPR05F,GPR09F,           1238 01901000
*           GPR10F,GPR11F,GPR12P,GPR13P,GPR14F,GPR15F);            1238 01902000
         STM   GPR14F,GPR12F,0(GPR13P)                                  01903000
*           GPR00P=GPR13P;               /*SAVE REG 13 IN REG 0     */  01904000
         LR    GPR00P,GPR13P                                       1239 01905000
*                                        /*INVOKE XREGSET MACRO TO*/    01906000
*                                        /*CHECK ECB PARAMETER AND*/    01907000
*                                        /*PUT ADDRESS IN REG 1   */    01908000
*                                                                  1240 01909000
*/*XREGSET  PID('ECB')PPARM(ATCLCPTR->ATCLDECB)RREG(1,GPR01P)*/    1240 01910000
*         DO;                                                      1240 01911000
*           GPR01P=ADDR(ATCLCPTR->ATCLDECB);                       1241 01912000
         L     GPR01P,ATCLCPTR                                     1241 01913000
         LA    GPR01P,ATCLDECB(,GPR01P)                            1241 01914000
*                                        /*SET RREG SYMBOL TO ADDRESS*/ 01915000
*                                        /*OF PPARM OPERAND          */ 01916000
*         END;  /* XREGSET */                                      1242 01917000
*           GPR10F=0;                    /*SET COMPLETION CODE TO 0*/   01918000
         SLR   GPR10F,GPR10F                                       1243 01919000
*           GPR11P=GPR01P;               /*PUT ECB ADDR IN REG 11    */ 01920000
         LR    GPR11P,GPR01P                                       1244 01921000
*           DCL CMZP0181 PTR(31) LOCATION(16);                     1245 01922000
*                                        /*ESTABLISH POINTER TO CVT  */ 01923000
*                                                                  1246 01924000
*/*VMDESET  ((15),ZERO,(2))*/                                      1246 01925000
*         DO;                            /* INVOKE MODESET MACRO    */  01926000
*           GEN SETS (2);                                          1247 01927000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      01928000
*           GPR15F=0;                                              1248 01929000
         SLR   GPR15F,GPR15F                                       1248 01930000
*                                        /*PUT RETURN CODE IN RCREG*/   01931000
*         END;  /* VMDESET */                                      1249 01932000
*           GPR05F=GPR02F;                                         1250 01933000
         LR    GPR05F,GPR02F                                       1250 01934000
*           CALL CMZP0181->CVT0PT01;     /*BRANCH TO TASK SUPERVISOR */ 01935000
         L     @07,CMZP0181                                        1251 01936000
         L     @15,CVT0PT01(,@07)                                  1251 01937000
         BALR  @14,@15                                             1251 01938000
*                                        /* POST ROUTINE (IEA0PT01)  */ 01939000
*           GPR02F=GPR05F;                                         1252 01940000
*                                                                  1252 01941000
         LR    GPR02F,GPR05F                                       1252 01942000
*/*VMDESET  ((15),,,(2))*/                                         1253 01943000
*         DO;                            /* INVOKE MODESET MACRO    */  01944000
*           GEN SETS (2);                                          1254 01945000
         MODESET KEYADDR=(2),WORKREG=2                                  01946000
*           GPR15F=0;                                              1255 01947000
         SLR   GPR15F,GPR15F                                       1255 01948000
*                                        /*PUT RETURN CODE IN RCREG*/   01949000
*         END;  /* VMDESET */                                      1256 01950000
*           GPR13P=GPR00P;               /*RESTORE SAVE AREA ADDR  */   01951000
         LR    GPR13P,GPR00P                                       1257 01952000
*                                        /*     FROM REGISTER 0    */   01953000
*                                        /*RESTORE REGS */         1258 01954000
*           GEN REFS(GPR13P) SETS(GPR00F,                          1258 01955000
*           GPR01F,GPR02F,GPR05F,GPR09F,GPR10F,GPR11F,             1258 01956000
*           GPR12F,GPR14F,GPR15F);                                 1258 01957000
*                                                                  1258 01958000
         LM    GPR14F,GPR12F,0(GPR13P)                                  01959000
*         RFY (GPR02P,GPR05P,GPR09P,GPR10P,GPR11P,GPR12P,GPR13P) UNRSTD 01960000
*                                        /*UNRESTRICT REGS */      1260 01961000
*         END; /* VPOST */                                         1260 01962000
*                                                                  1260 01963000
*/*VSETLCK  (GPR15P,RELEASE,LOCAL,(LOCAL,ISTINCVS(CMZO0156)))*/    1261 01964000
*CMZR0156:DO;                                                      1261 01965000
CMZR0156 DS    0H                                                  1262 01966000
*                                        /*DECLARE AND RESTRICT REGS */ 01967000
*                                        /*   2,10,11,12,13,14, AND 15  01968000
**/                                                                1262 01969000
*         RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P) RSTD;           1262 01970000
*                                        /*SAVE REGS 2 AND 10 THRU 14*/ 01971000
*        GEN REFS(GPR02F,GPR10F,GPR11F,GPR12F,GPR14F,GPR13P);      1263 01972000
*                                                                  1263 01973000
         STM   GPR10F,GPR12F,0(GPR13P)                                  01974000
         ST    GPR14F,12(GPR13P)                                        01975000
         ST    GPR02F,16(GPR13P)                                        01976000
*                                        /*INVOKE MODESET TO CHANGE  */ 01977000
*                                        /*PSW PROTECTION KEY TO 0   */ 01978000
*        GEN SETS(2);                                              1264 01979000
*                                                                  1264 01980000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      01981000
*           GPR10P=GPR13P;               /*PUT SAVE AREA ADDR IN R 10*/ 01982000
         LR    GPR10P,GPR13P                                       1265 01983000
*                                        /*INVOKE OS/VS SETLOCK MACRO*/ 01984000
*           GEN REFS(GPR13P,PSALITA,FLC) SETS(GPR12F);             1266 01985000
         SETLOCK RELEASE,TYPE=LOCAL,                                   *01986000
               RELATED=(LOCAL,ISTINCVS(CMZO0156))                       01987000
*           GPR15P=GPR13P;               /*PUT RETURN CODE IN R 15 */   01988000
         LR    GPR15P,GPR13P                                       1267 01989000
*                                        /*INVOKE MODESET MACRO TO   */ 01990000
*             DO;                        /*RESTORE PSW PROTECTION KEY*/ 01991000
*        GEN SETS(2);                                              1269 01992000
         MODESET KEYADDR=(2),WORKREG=2                                  01993000
*             END;                       /* RESTORE REGISTERS        */ 01994000
*           GEN REFS(GPR10F,GPR13P) SETS(GPR10F,GPR11F,            1271 01995000
*           GPR12F,GPR13F,GPR14F,GPR02F);                          1271 01996000
         LR    GPR13F,GPR10F                                            01997000
         LM    GPR10F,GPR12F,0(GPR13P)                                  01998000
         L     GPR14F,12(GPR13P)                                        01999000
         L     GPR02F,16(GPR13P)                                        02000000
*           IF GPR15F=4 THEN GPR15F=0;                             1272 02001000
         C     GPR15F,@CF00086                                     1272 02002000
         BNE   @RF01272                                            1272 02003000
         SLR   GPR15F,GPR15F                                       1273 02004000
*           GPR15P=GPR15F;               /*PUT RETURN CODE IN RCREG*/   02005000
*                                                                  1274 02006000
@RF01272 DS    0H                                                  1275 02007000
*         RFY (GPR02P,GPR10P,GPR11P,GPR12P,GPR13P) UNRSTD;         1275 02008000
*         END;  /*CMZR0156:VSETLCK */                              1276 02009000
*         GPR13P = GPR13P - 12; /* RESTORE REG 13 FOR SAVE AREA CHAIN * 02010000
*                                                                  1277 02011000
         SL    GPR13P,@CF00032                                     1277 02012000
*         GPR15P = 0;            /* INDIC VALID REQUEST          */     02013000
         SLR   GPR15P,GPR15P                                       1278 02014000
*                 END;           /* END VALID REQUEST            */     02015000
*               ELSE GPR15P = 4; /* INDIC DELETE NOT DONE        */     02016000
         B     @RC01191                                            1280 02017000
@RF01191 LA    GPR15P,4                                            1280 02018000
*             END;               /* END CHECKPOINTING IN PROCESS */     02019000
*           ELSE GPR15P = 4;     /* INDIC CKPTING NOT IN PROCESS */     02020000
*                                                                  1282 02021000
         B     @RC01183                                            1282 02022000
@RF01183 LA    GPR15P,4                                            1282 02023000
*         END; /* END OF CKPTN EXPANSION */        /*@D419400*/    1283 02024000
@RC01183 DS    0H                                                  1284 02025000
*        IF CVSR15=CVS0  /* NEED TO DO A TPWAIT  */                1284 02026000
*           THEN          /* YES                             @D419400*/ 02027000
         LTR   CVSR15,CVSR15                                       1284 02028000
         BNZ   @RF01284                                            1284 02029000
*           DO;                                            /*@D419400*/ 02030000
*             CVSR1=NCSPLRPH; /* SET REG 1 = ADDR OF RPH     @XM18394*/ 02031000
*                                                                  1286 02032000
         L     CVSR1,NCSPLRPH(,NCSPLPTR)                           1286 02033000
*/*  TPWAIT   */                                                   1287 02034000
*              DO; /* BEGIN TPWAIT GENERATION*/                    1287 02035000
*              GEN (STM   GPR00P,GPR15P,RPHWORK(GPR01P))           1288 02036000
*              REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);           1288 02037000
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)                            02038000
*              GPR15P=ADDR(LHAA0195);                              1289 02039000
         LA    GPR15P,LHAA0195                                     1289 02040000
*              GPR14P=0;                                           1290 02041000
         SLR   GPR14P,GPR14P                                       1290 02042000
*              GPR15P=GPR15P & '00FFFFFF'X;                        1291 02043000
         N     GPR15P,@CF04907                                     1291 02044000
*              GPR15P=GPR15P | RPHWT1;                             1292 02045000
         O     GPR15P,@CF01639                                     1292 02046000
*              CS (GPR14P,GPR15P,GPR01P->RPHRESMA);                1293 02047000
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         1293 02048000
*              BC (7,LHAB0195);                                    1294 02049000
*                                                                  1294 02050000
         BC    7,LHAB0195                                          1294 02051000
*/* TPEXIT  NONE */                                                1295 02052000
*              DO;                                                 1295 02053000
*                RESPECIFY GPR15P RSTD;                            1296 02054000
*                                                                  1296 02055000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         1297 02056000
*/* END OF ATBUILD */                                              1297 02057000
*                                                                  1297 02058000
*              DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */       1297 02059000
*                GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/       1298 02060000
         L     GPR15P,ATCLCPTR                                     1298 02061000
*              END; /*LISATCVT*/                                   1299 02062000
*                RESPECIFY GPR00F RSTD;                            1300 02063000
*                GPR00F=0;     /*SET PARAMETER REGISTER TO 0*/     1301 02064000
         SLR   GPR00F,GPR00F                                       1301 02065000
*                GPR15P=GPR15P->ATCAP31;                           1302 02066000
         L     GPR15P,ATCAP31(,GPR15P)                             1302 02067000
*                DCL FMZL0200 BASED(GPR15P) LABEL VALUERANGE(*);   1303 02068000
*                CALL FMZL0200;                                    1304 02069000
         BALR  @14,@15                                             1304 02070000
*                RESPECIFY (GPR00F,GPR15P) UNRSTD;                 1305 02071000
*              END; /***** END OF TPEXIT  *****/                   1306 02072000
*LHAB0195:;    GPR01P->RPHRESMA = 0;                               1307 02073000
*                                                                  1307 02074000
LHAB0195 DS    0H                                                  1308 02075000
         SLR   @11,@11                                             1308 02076000
         ST    @11,RPHRESMA(,GPR01P)                               1308 02077000
*LHAA0195:;    GEN (LM    GPR00P,GPR15P,RPHWORK(GPR01P))           1309 02078000
LHAA0195 DS    0H                                                  1310 02079000
*              REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);           1310 02080000
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)                            02081000
*              END; /*****END OF TPWAIT *****/ /* WAIT FOR C/R TO COMPL 02082000
*TE           @D419400*/                                           1311 02083000
*           END;                                           /*@D419400*/ 02084000
*           ELSE;     /* CONTINUE                            @D419400*/ 02085000
@RF01284 DS    0H                                                  1314 02086000
*      END;   /* END OF UPDATE FOR C/R                       @D419400*/ 02087000
*      ELSE; /* NO ERRORS, CONTINUE NORMAL PROCESSING        @D419400*/ 02088000
@RF01179 DS    0H                                                  1316 02089000
*   RFY                                                            1316 02090000
*     CVSR15 UNRSTD;                                               1316 02091000
*    /*SEGMENT(CVSSR10)FINISH*/DO;GOTO CVSSR10#;CVSSR10@:END;      1317 02092000
         B     CVSSR10#                                            1318 02093000
CVSSR10@ DS    0H                                                  1320 02094000
*   GEN(  EJECT);                                                  1320 02095000
           EJECT                                                        02096000
*CVSSRLOC:                                                         1321 02097000
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1321 02098000
*                                                                  1321 02099000
         B     @PB00004                                            1321 02100000
CVSSRLOC DS    0H                                                  1322 02101000
*   /*****************************************************************/ 02102000
*   /*                                                               */ 02103000
*   /* LOCK/UNLOCK SUBROUTINE: THIS SUBROUTINE WILL ISSUE TPLOCKS AND*/ 02104000
*   /* TPUNLOCKS FOR OTHER SUBROUTINES. INPUT TO THIS SUBROUTINE IS: */ 02105000
*   /*     R1 = RPH ADDRESS IF R0 IS 30 OR GREATER - IF R0 IS LESS   */ 02106000
*   /*          THAN 30, THE RPH MUST BE OBTAINED.                   */ 02107000
*   /*     R0 =  0 OR 30   GET VOC LOCK                              */ 02108000
*   /*           4 OR 34   GET RDT LOCK                              */ 02109000
*   /*          10 OR 40   RELEASE VOC LOCK                          */ 02110000
*   /*          14 OR 44   RELEASE RDT LOCK                          */ 02111000
*   /*                                                               */ 02112000
*   /*****************************************************************/ 02113000
*                                                                  1322 02114000
*   RFY                                                            1322 02115000
*     ISTRPRE BASED(CVSWKRDT);                                     1322 02116000
*   RFY                                                            1323 02117000
*     CVSR0 RSTD;                                                  1323 02118000
*   CVSRSLOC=CVSR14;                /* SAVE RETURN REGISTER          */ 02119000
         ST    CVSR14,CVSRSLOC                                     1324 02120000
*   IF CVSR0<CVS30                  /* RPH ADDRESS SUPPLIED?         */ 02121000
*     THEN                                                         1325 02122000
         C     CVSR0,@CF04760                                      1325 02123000
         BNL   @RF01325                                            1325 02124000
*     CVSR1=NCSPLRPH;               /* NO - GET RPH ADDRESS FROM   1326 02125000
*                                      NCSPL                         */ 02126000
         L     CVSR1,NCSPLRPH(,NCSPLPTR)                           1326 02127000
*   ELSE                                                           1327 02128000
*     ;                                                            1327 02129000
@RF01325 DS    0H                                                  1328 02130000
*   IF CVSR0=CVS0|CVSR0=CVS30       /* GET THE VOC LOCK?             */ 02131000
*     THEN                                                         1328 02132000
         LTR   CVSR0,CVSR0                                         1328 02133000
         BZ    @RT01328                                            1328 02134000
         C     CVSR0,@CF04760                                      1328 02135000
         BNE   @RF01328                                            1328 02136000
@RT01328 DS    0H                                                  1329 02137000
*     DO;                           /* YES -                         */ 02138000
*       /*************************************************************/ 02139000
*       /*                                                           */ 02140000
*       /* GET THE VARY/OPEN/CLOSE (VOC) LOCK                        */ 02141000
*       /*                                                           */ 02142000
*       /*************************************************************/ 02143000
*                                                                  1330 02144000
*                                                                  1330 02145000
*/*** START -TPLOCK (VOCLOCK)TYPE(XCLSIVE)- ***/                   1330 02146000
*        DO;                                                       1330 02147000
*        RFY (GPR02P,GPR03P,GPR04P) RSTD;                          1331 02148000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);     02149000
         STM GPR00P,GPR14P,RPHWORK(GPR01P)                              02150000
*        GPR15P = ATCAP36;              /*ADDRESS OF LOCK ROUTINE*/     02151000
         L     @11,NCSPLCVT(,NCSPLPTR)                             1333 02152000
         L     GPR15P,ATCAP36(,@11)                                1333 02153000
*        GPR02P = ADDR(ATCVOCLK);       /*SET PARAM - LOCKWORD PTR*/    02154000
         LA    GPR02P,ATCVOCLK(,@11)                               1334 02155000
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 1335 02156000
         L     GPR04P,RPHCRR(,GPR01P)                              1335 02157000
*        GPR00P = CRALMS02;             /*SET PARAM - LOCK LEVEL FLAG*/ 02158000
         LA    GPR00P,2                                            1336 02159000
*        GPR03P = ADDR(GPR04P->CRAL2PTR);                          1337 02160000
         LA    GPR03P,CRAL2PTR(,GPR04P)                            1337 02161000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  02162000
*        DCL FMZL0211 BASED(GPR15P) LABEL VALUERANGE(*);           1338 02163000
*        CALL FMZL0211;                                            1339 02164000
         BALR  @14,@15                                             1339 02165000
*        GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P 02166000
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P, 02167000
*PR12P,GPR13P,GPR14P,GPR15P);                                      1340 02168000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               02169000
*        RFY (GPR02P,GPR03P,GPR04P) UNRSTD;                        1341 02170000
*        END;                                                      1342 02171000
*/*** END -TPLOCK (VOCLOCK)TYPE(XCLSIVE)- ***/                     1343 02172000
*     END;                                                         1343 02173000
*   ELSE                                                           1344 02174000
*     IF CVSR0=CVS4|CVSR0=CVS34     /* GET THE RDT LOCK?             */ 02175000
*       THEN                                                       1344 02176000
         B     @RC01328                                            1344 02177000
@RF01328 C     CVSR0,@CF00086                                      1344 02178000
         BE    @RT01344                                            1344 02179000
         C     CVSR0,@CF04762                                      1344 02180000
         BNE   @RF01344                                            1344 02181000
@RT01344 DS    0H                                                  1345 02182000
*       DO;                         /* YES -                         */ 02183000
*         /***********************************************************/ 02184000
*         /*                                                         */ 02185000
*         /* GET THE RDT LOCK                                        */ 02186000
*         /*                                                         */ 02187000
*         /***********************************************************/ 02188000
*                                                                  1346 02189000
*                                                                  1346 02190000
*/*** START -TPLOCK (RDTLOCK)TYPE(XCLSIVE)- ***/                   1346 02191000
*          DO;                                                     1346 02192000
*          RFY (GPR02P,GPR03P,GPR04P) RSTD;                        1347 02193000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);     02194000
         STM GPR00P,GPR14P,RPHWORK(GPR01P)                              02195000
*        GPR15P = ATCAP36;              /*ADDRESS OF LOCK ROUTINE*/     02196000
         L     @11,NCSPLCVT(,NCSPLPTR)                             1349 02197000
         L     GPR15P,ATCAP36(,@11)                                1349 02198000
*        GPR02P = ADDR(ATCRDTLK);       /*SET PARAM - LOCKWORD PTR*/    02199000
         LA    GPR02P,ATCRDTLK(,@11)                               1350 02200000
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 1351 02201000
         L     GPR04P,RPHCRR(,GPR01P)                              1351 02202000
*        GPR00P = CRALMS03;             /*SET PARAM - LOCK LEVEL FLAG*/ 02203000
         LA    GPR00P,4                                            1352 02204000
*        GPR03P = ADDR(GPR04P->CRAL3PTR);                          1353 02205000
         LA    GPR03P,CRAL3PTR(,GPR04P)                            1353 02206000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  02207000
*        DCL FMZL0216 BASED(GPR15P) LABEL VALUERANGE(*);           1354 02208000
*        CALL FMZL0216;                                            1355 02209000
         BALR  @14,@15                                             1355 02210000
*        GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P 02211000
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P, 02212000
*PR12P,GPR13P,GPR14P,GPR15P);                                      1356 02213000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               02214000
*          RFY (GPR02P,GPR03P,GPR04P) UNRSTD;                      1357 02215000
*        END;                                                      1358 02216000
*/*** END -TPLOCK (RDTLOCK)TYPE(XCLSIVE)- ***/                     1359 02217000
*       END;                                                       1359 02218000
*     ELSE                                                         1360 02219000
*         IF CVSR0=CVS10|CVSR0=CVS40/* RELEASE THE VOC LOCK?         */ 02220000
*           THEN                                                   1360 02221000
         B     @RC01344                                            1360 02222000
@RF01344 C     CVSR0,@CF04228                                      1360 02223000
         BE    @RT01360                                            1360 02224000
         C     CVSR0,@CF03826                                      1360 02225000
         BNE   @RF01360                                            1360 02226000
@RT01360 DS    0H                                                  1361 02227000
*           DO;                     /* YES -                         */ 02228000
*             /*******************************************************/ 02229000
*             /*                                                     */ 02230000
*             /* RELEASE THE VARY/OPEN/CLOSE (VOC) LOCK              */ 02231000
*             /*                                                     */ 02232000
*             /*******************************************************/ 02233000
*                                                                  1362 02234000
*                                                                  1362 02235000
*/*** START -TPUNLOCK (VOCLOCK)- ***/                              1362 02236000
*              DO;                                                 1362 02237000
*                                                                  1362 02238000
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)  */                             1363 02239000
*/* END OF ATBUILD */                                              1363 02240000
*              RFY (GPR02P,GPR03P,GPR04P) RSTD;                    1363 02241000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);     02242000
         STM GPR00P,GPR15P,RPHWORK(GPR01P)                              02243000
*        GPR02P = ADDR(ATCVOCLK);       /*SET PARAM - LOCKWORD PTR*/    02244000
         L     GPR02P,NCSPLCVT(,NCSPLPTR)                          1365 02245000
         LA    GPR02P,ATCVOCLK(,GPR02P)                            1365 02246000
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 1366 02247000
         L     GPR04P,RPHCRR(,GPR01P)                              1366 02248000
*        GPR00P = CRALMS02;             /*SET PARAM - LOCK LEVEL FLAG*/ 02249000
         LA    GPR00P,2                                            1367 02250000
*        GPR03P = ADDR(GPR04P->CRAL2PTR);                          1368 02251000
         LA    GPR03P,CRAL2PTR(,GPR04P)                            1368 02252000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  02253000
*                                                                  1369 02254000
*              DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */       1369 02255000
*                GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/       1370 02256000
         L     GPR15P,ATCLCPTR                                     1370 02257000
*              END; /*LISATCVT*/                                   1371 02258000
*        GPR15P=GPR15P->ATCAP33;                                   1372 02259000
         L     GPR15P,ATCAP33(,GPR15P)                             1372 02260000
*        DCL FMZL0221 BASED(GPR15P) LABEL VALUERANGE(*);           1373 02261000
*        CALL FMZL0221;                                            1374 02262000
         BALR  @14,@15                                             1374 02263000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P 02264000
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P, 02265000
*PR12P,GPR13P,GPR14P,GPR15P);                                      1375 02266000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               02267000
*              RFY (GPR02P,GPR03P,GPR04P) UNRSTD;                  1376 02268000
*        END;                                                      1377 02269000
*/*** END -TPUNLOCK (VOCLOCK)- ***/                                1378 02270000
*           END;                                                   1378 02271000
*         ELSE                                                     1379 02272000
*           IF CVSR0=CVS14|CVSR0=CVS44/* RELEASE THE RDT LOCK?       */ 02273000
*             THEN                                                 1379 02274000
         B     @RC01360                                            1379 02275000
@RF01360 C     CVSR0,@CF04234                                      1379 02276000
         BE    @RT01379                                            1379 02277000
         C     CVSR0,@CF01340                                      1379 02278000
         BNE   @RF01379                                            1379 02279000
@RT01379 DS    0H                                                  1380 02280000
*             DO;                   /* YES -                         */ 02281000
*               /*****************************************************/ 02282000
*               /*                                                   */ 02283000
*               /* RELEASE THE RDT LOCK                              */ 02284000
*               /*                                                   */ 02285000
*               /*****************************************************/ 02286000
*                                                                  1381 02287000
*                                                                  1381 02288000
*/*** START -TPUNLOCK (RDTLOCK)- ***/                              1381 02289000
*                DO;                                               1381 02290000
*                                                                  1381 02291000
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)  */                             1382 02292000
*/* END OF ATBUILD */                                              1382 02293000
*                RFY (GPR02P,GPR03P,GPR04P) RSTD;                  1382 02294000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);     02295000
         STM GPR00P,GPR15P,RPHWORK(GPR01P)                              02296000
*        GPR02P = ADDR(ATCRDTLK);       /*SET PARAM - LOCKWORD PTR*/    02297000
         L     GPR02P,NCSPLCVT(,NCSPLPTR)                          1384 02298000
         LA    GPR02P,ATCRDTLK(,GPR02P)                            1384 02299000
*        GPR04P = GPR01P->RPHCRR;       /*SET PARAM - ISTCRA PTR*/ 1385 02300000
         L     GPR04P,RPHCRR(,GPR01P)                              1385 02301000
*        GPR00P = CRALMS03;             /*SET PARAM - LOCK LEVEL FLAG*/ 02302000
         LA    GPR00P,4                                            1386 02303000
*        GPR03P = ADDR(GPR04P->CRAL3PTR);                          1387 02304000
         LA    GPR03P,CRAL3PTR(,GPR04P)                            1387 02305000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  02306000
*                                                                  1388 02307000
*                DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */     1388 02308000
*                  GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/     1389 02309000
         L     GPR15P,ATCLCPTR                                     1389 02310000
*                END; /*LISATCVT*/                                 1390 02311000
*        GPR15P=GPR15P->ATCAP33;                                   1391 02312000
         L     GPR15P,ATCAP33(,GPR15P)                             1391 02313000
*        DCL FMZL0231 BASED(GPR15P) LABEL VALUERANGE(*);           1392 02314000
*        CALL FMZL0231;                                            1393 02315000
         BALR  @14,@15                                             1393 02316000
*        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01P 02317000
*GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P, 02318000
*PR12P,GPR13P,GPR14P,GPR15P);                                      1394 02319000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               02320000
*                RFY (GPR02P,GPR03P,GPR04P) UNRSTD;                1395 02321000
*        END;                                                      1396 02322000
*/*** END -TPUNLOCK (RDTLOCK)- ***/                                1397 02323000
*             END;                                                 1397 02324000
*             ELSE                                                 1398 02325000
*               ;                   /* IF NONE OF THE ABOVE- OOPS    */ 02326000
@RF01379 DS    0H                                                  1399 02327000
*   RFY                                                            1399 02328000
*     CVSR0 UNRSTD;                                                1399 02329000
@RC01360 DS    0H                                                  1399 02330000
@RC01344 DS    0H                                                  1399 02331000
@RC01328 DS    0H                                                  1400 02332000
*   CVSR14=CVSRSLOC;                /* RESTORE RETURN REGISTER       */ 02333000
         L     CVSR14,CVSRSLOC                                     1400 02334000
*   END CVSSRLOC;                   /* RETURN TO CALLER              */ 02335000
@EL00004 DS    0H                                                  1401 02336000
@EF00004 DS    0H                                                  1401 02337000
@ER00004 BR    @14                                                 1401 02338000
@PB00004 DS    0H                                                  1402 02339000
*   GEN(  EJECT);                                                  1402 02340000
           EJECT                                                        02341000
*CVSTPMSG:                                                         1403 02342000
*   PROC OPTIONS(NOSAVE NOSAVEAREA);                               1403 02343000
*                                                                  1403 02344000
         B     @PB00005                                            1403 02345000
CVSTPMSG DS    0H                                                  1404 02346000
*   /*****************************************************************/ 02347000
*   /*                                                               */ 02348000
*   /* MESSAGE SUBROUTINE                                            */ 02349000
*   /*                                                               */ 02350000
*   /*****************************************************************/ 02351000
*                                                                  1404 02352000
*   CVSRSMSG=CVSR14;                /* SAVE RETURN REGISTER          */ 02353000
         ST    CVSR14,CVSRSMSG                                     1404 02354000
*   RFY                                                            1405 02355000
*    (CVSR2,                                                       1405 02356000
*     CVSR3)RSTD;                                                  1405 02357000
*   CVSR2=CVSMSID@;                 /* GET MSG ID FROM SAVEAREA      */ 02358000
         L     CVSR2,CVSMSID@                                      1406 02359000
*   CVSR3=ADDR(NCSPLSID);           /* GET ADDRESS OF CONSOLE ID IN     02360000
*                                      THE NCSPL                     */ 02361000
*                                                                  1407 02362000
         LA    CVSR3,NCSPLSID(,NCSPLPTR)                           1407 02363000
*   /*****************************************************************/ 02364000
*   /*                                                               */ 02365000
*   /* ********* OUTPUT MESSAGE *********                            */ 02366000
*   /*                                                               */ 02367000
*   /*****************************************************************/ 02368000
*                                                                  1408 02369000
*                                                                  1408 02370000
*/*TPMSG MSGID((CVSR2))MSG((CVSMSG))OPTIONS((CVSR3))PLAREA(CVSMSGPL)*/  02371000
*                                                                  1408 02372000
*    DO;                                                           1408 02373000
*      DCL REG1241  REG(1)  PTR;                                   1409 02374000
*      RFY (REG1241) RSTD;                                         1410 02375000
*                                                                  1410 02376000
*    RFY (EMCR13) RSTD;                                            1411 02377000
*      DCL 1 * BASED(REG1241),                                     1412 02378000
*          2 CMZID241 PTR(31),                                     1412 02379000
*          2 *,                                                    1412 02380000
*            3 CMZRL241 PTR(8),                                    1412 02381000
*            3 CMZRA241 PTR(24) BDY(BYTE),                         1412 02382000
*          2 CMZEA241 PTR(31),                                     1412 02383000
*          2 CMZVP241 PTR(31);                                     1412 02384000
*                                                                  1412 02385000
*/*XREGSET  PID('PLAREA')PPARM(CVSMSGPL)RREG(,REG1241)*/           1413 02386000
*    DO;                                                           1413 02387000
*      REG1241=ADDR(CVSMSGPL);           /*SET RREG SYMBOL TO ADDRESS*/ 02388000
         LA    REG1241,CVSMSGPL                                    1414 02389000
*                                        /*OF PPARM OPERAND          */ 02390000
*    END;  /* XREGSET */                                           1415 02391000
*      CMZID241 = 0;                                               1416 02392000
         SLR   @15,@15                                             1416 02393000
         ST    @15,CMZID241(,REG1241)                              1416 02394000
*      CMZRL241 = 0;                                               1417 02395000
         MVI   CMZRL241(REG1241),X'00'                             1417 02396000
*      CMZRA241 = 0;                                               1418 02397000
         STCM  @15,7,CMZRA241(REG1241)                             1418 02398000
*      CMZEA241 = 0;                                               1419 02399000
         ST    @15,CMZEA241(,REG1241)                              1419 02400000
*      CMZVP241 = 0;                                               1420 02401000
         ST    @15,CMZVP241(,REG1241)                              1420 02402000
*      CMZID241=CVSR2;                                             1421 02403000
         ST    CVSR2,CMZID241(,REG1241)                            1421 02404000
*      CMZVP241 = CVSMSG;                                          1422 02405000
         L     @15,CVSMSG                                          1422 02406000
         ST    @15,CMZVP241(,REG1241)                              1422 02407000
*      DCL CMZSA241 (18) PTR(31) BASED(EMCR13);                    1423 02408000
*      CMZSA241(5) = CVSR3;                                        1424 02409000
*                                                                  1424 02410000
         ST    CVSR3,CMZSA241+16(,EMCR13)                          1424 02411000
*      DCL REG15241 REG(15) PTR;                                   1425 02412000
*      RFY REG15241 RSTD;                                          1426 02413000
*                                                                  1426 02414000
*    DO; /* LISATCVT CVTBASE(PAGEABLE,(REG15241)) */               1427 02415000
*      REG15241 = ATCLCPTR; /*SET UP ATCVT POINTER*/               1428 02416000
         L     REG15241,ATCLCPTR                                   1428 02417000
*    END; /*LISATCVT*/                                             1429 02418000
*      DCL CMTA241 BASED(REG15241) ENTRY VALUERANGE(*);            1430 02419000
*      REG15241 = REG15241->ATCMSGP;                               1431 02420000
         L     REG15241,ATCMSGP(,REG15241)                         1431 02421000
*      CALL CMTA241;                                               1432 02422000
         BALR  @14,@15                                             1432 02423000
*      RESPECIFY (REG1241,REG15241)  UNRESTRICTED;                 1433 02424000
*                                                                  1433 02425000
*    RFY (EMCR13) UNRSTD;                                          1434 02426000
*    END;                                                          1435 02427000
*   RFY                                                            1436 02428000
*    (CVSR2,                                                       1436 02429000
*     CVSR3)UNRSTD;                                                1436 02430000
*   CVSR14=CVSRSMSG;                /* RESTORE RETURN REGISTER       */ 02431000
         L     CVSR14,CVSRSMSG                                     1437 02432000
*   END CVSTPMSG;                                                  1438 02433000
*                                                                  1438 02434000
@EL00005 DS    0H                                                  1438 02435000
@EF00005 DS    0H                                                  1438 02436000
@ER00005 BR    @14                                                 1438 02437000
@PB00005 DS    0H                                                  1439 02438000
*/* TPEPILOG   */                                                  1439 02439000
*    GEN (PRINT OFF);                                              1439 02440000
*                                                                  1439 02441000
*                                                                  1439 02442000
         PRINT OFF                                                      02443000
*    DCL 1 CMZCR6PL BDY(WORD),    /* DUMP/LOAD/RESTART      */     1440 02444000
*          2     *    CHAR(LENGTH(ISTDLRPL)),/* PARAM LIST  */     1440 02445000
*          2     *    CHAR(64);   /* ISTINCR6 EXTENSION     */     1440 02446000
*                                                                  1440 02447000
*    DECLARE                                                       1441 02448000
*      EMCR0 PTR REG(0),                                           1441 02449000
*      EMCR1 PTR REG(1),                                           1441 02450000
*      EMCR2 PTR REG(2),                                           1441 02451000
*      EMCR3 PTR REG(3),                                           1441 02452000
*      EMCR4 PTR REG(4),                                           1441 02453000
*      EMCR5 PTR REG(5),                                           1441 02454000
*      EMCR6 PTR REG(6),                                           1441 02455000
*      EMCR7 PTR REG(7),                                           1441 02456000
*      EMCR8 PTR REG(8),                                           1441 02457000
*      EMCR9 PTR REG(9),                                           1441 02458000
*      EMCR10 PTR REG(10),                                         1441 02459000
*      EMCR11 PTR REG(11),                                         1441 02460000
*      EMCR12 PTR REG(12),                                         1441 02461000
*      EMCR13 PTR REG(13),                                         1441 02462000
*      EMCR14 PTR REG(14),                                         1441 02463000
*      EMCR15 PTR REG(15);                                         1441 02464000
*    DCL ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*); /*RESET ROUTINE*/ 1442 02465000
*    DCL ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*); /*TPQUE ROUTINE*/ 1443 02466000
*    GEN (PRINT ON);                                               1444 02467000
         PRINT ON                                                       02468000
*/* END OF TPEPILOG */                                             1445 02469000
*   END ISTINCVS                                                   1445 02470000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 02471000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 02472000
*/*%INCLUDE SYSLIB  (IEZIOB  )                                        * 02473000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                        * 02474000
*/*%INCLUDE SYSLIB  (IHASRB  )                                        * 02475000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        * 02476000
*;                                                                 1445 02477000
         B     @EL00001                                            1445 02478000
@DATA    DS    0H                                                       02479000
@DATD    DSECT                                                          02480000
         DS    0F                                                       02481000
ISTINCVS CSECT                                                          02482000
         DS    0F                                                       02483000
@CF00094 DC    F'1'                                                     02484000
@CF00086 DC    F'4'                                                     02485000
@CF00092 DC    F'8'                                                     02486000
@CF04228 DC    F'10'                                                    02487000
@CF00032 DC    F'12'                                                    02488000
@CF04234 DC    F'14'                                                    02489000
@CF04760 DC    F'30'                                                    02490000
@CF04762 DC    F'34'                                                    02491000
@CF03826 DC    F'40'                                                    02492000
@CF01340 DC    F'44'                                                    02493000
@CF01802 DC    F'72'                                                    02494000
@CF05008 DC    F'280'                                                   02495000
@CF05015 DC    F'-1'                                                    02496000
@CF01639 DC    XL4'08000000'                                            02497000
@CF01680 DC    XL4'80000000'                                            02498000
@CF04907 DC    XL4'00FFFFFF'                                            02499000
@DATD    DSECT                                                          02500000
         DS    0D                                                       02501000
CVSWKARA DS    CL88                                                     02502000
         ORG   CVSWKARA                                                 02503000
CVSSWTCH DS    BL1                                                      02504000
         ORG   CVSSWTCH                                                 02505000
CVSGOSW  DS    BL1                                                      02506000
CVSSOM   EQU   CVSSWTCH+0                                               02507000
CVSDECSW EQU   CVSSWTCH+0                                               02508000
CVSNOPAB EQU   CVSSWTCH+0                                               02509000
CVSNCREQ EQU   CVSSWTCH+0                                               02510000
CVSPRIV  EQU   CVSSWTCH+0                                               02511000
@NM00085 EQU   CVSSWTCH+0                                               02512000
         ORG   CVSWKARA+1                                               02513000
@NM00086 DS    CL2                                                      02514000
         DS    CL1                                                      02515000
@NM00087 DS    AL4                                                      02516000
@NM00088 DS    AL4                                                      02517000
CVSMSID@ DS    AL4                                                      02518000
CVSMSG   DS    AL4                                                      02519000
CVSMSGWA DS    CL24                                                     02520000
         ORG   CVSMSGWA                                                 02521000
CVSVARY  DS    CL8                                                      02522000
CVSNAME1 DS    CL8                                                      02523000
CVSNAME2 DS    CL8                                                      02524000
         ORG   CVSWKARA+44                                              02525000
CVSRNSAV DS    AL4                                                      02526000
CVSNCSPL DS    AL4                                                      02527000
CVSRSERR DS    AL4                                                      02528000
CVSRSWKA DS    AL4                                                      02529000
CVSRSLOC DS    AL4                                                      02530000
CVSRSMSG DS    AL4                                                      02531000
CVSMSGPL DS    CL16                                                     02532000
         ORG   CVSMSGPL                                                 02533000
@NM00089 DS    AL4                                                      02534000
@NM00090 DS    CL4                                                      02535000
         ORG   @NM00090                                                 02536000
@NM00091 DS    AL1                                                      02537000
@NM00092 DS    AL3                                                      02538000
         ORG   CVSMSGPL+8                                               02539000
@NM00093 DS    AL4                                                      02540000
@NM00094 DS    AL4                                                      02541000
         ORG   CVSWKARA+84                                              02542000
@NM00095 DS    AL4                                                      02543000
         ORG   CVSWKARA+88                                              02544000
CMZCR6PL DS    CL144                                                    02545000
         ORG   CMZCR6PL                                                 02546000
@NM00108 DS    CL80                                                     02547000
@NM00109 DS    CL64                                                     02548000
         ORG   CMZCR6PL+144                                             02549000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02550000
@ENDDATD EQU   *                                                        02551000
ISTINCVS CSECT                                                          02552000
         DS    0F                                                       02553000
@SIZDATD DC    AL1(0)                                                   02554000
         DC    AL3(@ENDDATD-@DATD)                                      02555000
@CV04735 DC    V(ISTINCW7)                                              02556000
@CV04736 DC    V(ISTSDCRC)                                              02557000
         DS    0D                                                       02558000
CVS3PABS DC    AL4(3*32)                                                02559000
CVS4PABS DC    AL4(4*32)                                                02560000
CMZA0087 DS    FL4                                                      02561000
         ORG   CMZA0087                                                 02562000
@NM00102 DC    AL1(64)                                                  02563000
@NM00103 DC    AL1(96)                                                  02564000
@NM00104 DC    AL1(231)                                                 02565000
@NM00105 DC    XL1'01'                                                  02566000
         ORG   CMZA0087+4                                               02567000
@CC04823 DC    C'VARY    '                                              02568000
@CB04936 DC    X'0000000000000000'                                      02569000
CVSMS061 DC    CL4'061I'                                                02570000
CVSMS066 DC    CL4'066I'                                                02571000
CVSMS072 DC    CL4'072I'                                                02572000
CVSMS074 DC    CL4'074I'                                                02573000
CVSMS093 DC    CL4'093I'                                                02574000
CVSMS602 DC    CL4'602I'                                                02575000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02576000
@01      EQU   01                                                       02577000
@02      EQU   02                                                       02578000
@03      EQU   03                                                       02579000
@04      EQU   04                                                       02580000
@05      EQU   05                                                       02581000
@06      EQU   06                                                       02582000
@07      EQU   07                                                       02583000
@08      EQU   08                                                       02584000
@09      EQU   09                                                       02585000
@10      EQU   10                                                       02586000
@11      EQU   11                                                       02587000
@12      EQU   12                                                       02588000
@13      EQU   13                                                       02589000
@14      EQU   14                                                       02590000
@15      EQU   15                                                       02591000
I        EQU   @02                                                      02592000
GPR00F   EQU   @00                                                      02593000
GPR00P   EQU   @00                                                      02594000
GPR01F   EQU   @01                                                      02595000
GPR01P   EQU   @01                                                      02596000
GPR02F   EQU   @02                                                      02597000
GPR02P   EQU   @02                                                      02598000
GPR03F   EQU   @03                                                      02599000
GPR03P   EQU   @03                                                      02600000
GPR04P   EQU   @04                                                      02601000
GPR05F   EQU   @05                                                      02602000
GPR05P   EQU   @05                                                      02603000
GPR06P   EQU   @06                                                      02604000
GPR07P   EQU   @07                                                      02605000
GPR08P   EQU   @08                                                      02606000
GPR09F   EQU   @09                                                      02607000
GPR09P   EQU   @09                                                      02608000
GPR10F   EQU   @10                                                      02609000
GPR10P   EQU   @10                                                      02610000
GPR11F   EQU   @11                                                      02611000
GPR11P   EQU   @11                                                      02612000
GPR12F   EQU   @12                                                      02613000
GPR12P   EQU   @12                                                      02614000
GPR13F   EQU   @13                                                      02615000
GPR13P   EQU   @13                                                      02616000
GPR14F   EQU   @14                                                      02617000
GPR14P   EQU   @14                                                      02618000
GPR15F   EQU   @15                                                      02619000
GPR15P   EQU   @15                                                      02620000
RPHPTR   EQU   @01                                                      02621000
LDPRMPTR EQU   @01                                                      02622000
CVSR1    EQU   @01                                                      02623000
RDTEPTR  EQU   @10                                                      02624000
CVSR0    EQU   @00                                                      02625000
CVSR2    EQU   @02                                                      02626000
CVSR3    EQU   @03                                                      02627000
CVSWAPTR EQU   @06                                                      02628000
CVSR7    EQU   @07                                                      02629000
CVSWKRDT EQU   @08                                                      02630000
NCSPLPTR EQU   @09                                                      02631000
CVSR13   EQU   @13                                                      02632000
CVSR14   EQU   @14                                                      02633000
CVSR15   EQU   @15                                                      02634000
EMCR15   EQU   @15                                                      02635000
REG1241  EQU   @01                                                      02636000
EMCR13   EQU   @13                                                      02637000
REG15241 EQU   @15                                                      02638000
CVSR11   EQU   @11                                                      02639000
CVSR12   EQU   @12                                                      02640000
CVSR4    EQU   @04                                                      02641000
CVSR5    EQU   @05                                                      02642000
EMCR0    EQU   @00                                                      02643000
EMCR1    EQU   @01                                                      02644000
EMCR10   EQU   @10                                                      02645000
EMCR11   EQU   @11                                                      02646000
EMCR12   EQU   @12                                                      02647000
EMCR14   EQU   @14                                                      02648000
EMCR2    EQU   @02                                                      02649000
EMCR3    EQU   @03                                                      02650000
EMCR4    EQU   @04                                                      02651000
EMCR5    EQU   @05                                                      02652000
EMCR6    EQU   @06                                                      02653000
EMCR7    EQU   @07                                                      02654000
EMCR8    EQU   @08                                                      02655000
EMCR9    EQU   @09                                                      02656000
GPR04F   EQU   @04                                                      02657000
GPR06F   EQU   @06                                                      02658000
GPR07F   EQU   @07                                                      02659000
GPR08F   EQU   @08                                                      02660000
PSA      EQU   0                                                        02661000
FLCRNPSW EQU   PSA                                                      02662000
FLCROPSW EQU   PSA+8                                                    02663000
FLCICCW2 EQU   PSA+16                                                   02664000
PSAEEPSW EQU   PSA+132                                                  02665000
PSAESPSW EQU   PSA+136                                                  02666000
FLCSVILC EQU   PSAESPSW+1                                               02667000
PSAEPPSW EQU   PSA+140                                                  02668000
FLCPIILC EQU   PSAEPPSW+1                                               02669000
FLCPICOD EQU   PSAEPPSW+2                                               02670000
PSAPICOD EQU   FLCPICOD+1                                               02671000
FLCTEA   EQU   PSAEPPSW+4                                               02672000
FLCPER   EQU   PSA+152                                                  02673000
FLCMCLA  EQU   PSA+168                                                  02674000
FLCIOEL  EQU   FLCMCLA+4                                                02675000
FLCIOA   EQU   FLCMCLA+16                                               02676000
FLCFSA   EQU   FLCMCLA+80                                               02677000
PSASUPER EQU   PSA+552                                                  02678000
PSASUP1  EQU   PSASUPER                                                 02679000
PSASUP2  EQU   PSASUPER+1                                               02680000
PSASUP3  EQU   PSASUPER+2                                               02681000
PSASUP4  EQU   PSASUPER+3                                               02682000
PSACLHT  EQU   PSA+640                                                  02683000
PSALKSA  EQU   PSA+696                                                  02684000
PSAHLHI  EQU   PSA+760                                                  02685000
PSALITA  EQU   PSA+764                                                  02686000
PSADSSFL EQU   PSA+836                                                  02687000
PSADSSF1 EQU   PSADSSFL                                                 02688000
PSADSSF3 EQU   PSADSSFL+2                                               02689000
PSADSSF4 EQU   PSADSSFL+3                                               02690000
PSARSVT  EQU   PSA+896                                                  02691000
ATCLCPTR EQU   1032                                                     02692000
CMZP0037 EQU   16                                                       02693000
CMZP0127 EQU   16                                                       02694000
CMZP0181 EQU   16                                                       02695000
CVTMAP   EQU   0                                                        02696000
CVTDAR   EQU   CVTMAP+72                                                02697000
CVTFLGS1 EQU   CVTDAR                                                   02698000
CVTDCB   EQU   CVTMAP+116                                               02699000
CVTIERLC EQU   CVTMAP+144                                               02700000
CVT0PT01 EQU   CVTMAP+152                                               02701000
CVTOPTA  EQU   CVTMAP+182                                               02702000
CVTOPTB  EQU   CVTMAP+183                                               02703000
CVTGTF   EQU   CVTMAP+236                                               02704000
CVTGTFST EQU   CVTGTF                                                   02705000
CVTGTFS  EQU   CVTGTFST                                                 02706000
CVTSTATE EQU   CVTGTFST                                                 02707000
CVTTMODE EQU   CVTGTFST                                                 02708000
CVTFORM  EQU   CVTGTFST                                                 02709000
CVTAQAVT EQU   CVTMAP+240                                               02710000
CVTTCMFG EQU   CVTAQAVT                                                 02711000
CVTVOLM2 EQU   CVTMAP+244                                               02712000
CVTTATA  EQU   CVTVOLM2                                                 02713000
CVTTSKS  EQU   CVTTATA                                                  02714000
CVTVOLF2 EQU   CVTTSKS                                                  02715000
CVTTAT   EQU   CVTTATA+1                                                02716000
CVTATER  EQU   CVTMAP+248                                               02717000
CVTEXT1  EQU   CVTMAP+252                                               02718000
CVTPURG  EQU   CVTMAP+260                                               02719000
CVTQMSG  EQU   CVTMAP+268                                               02720000
CVTDMSR  EQU   CVTMAP+272                                               02721000
CVTRSV37 EQU   CVTDMSR                                                  02722000
CVTDMSRF EQU   CVTRSV37                                                 02723000
CVTERPV  EQU   CVTMAP+316                                               02724000
CVTINTLA EQU   CVTMAP+320                                               02725000
CVTAPF   EQU   CVTMAP+324                                               02726000
CVTEXT2  EQU   CVTMAP+328                                               02727000
CVTHJES  EQU   CVTMAP+332                                               02728000
CVTPGSIA EQU   CVTMAP+348                                               02729000
CVTA1F1  EQU   CVTMAP+356                                               02730000
CVTSYSK  EQU   CVTMAP+357                                               02731000
CVTVOLM1 EQU   CVTMAP+380                                               02732000
CVTVOLF1 EQU   CVTVOLM1                                                 02733000
CVTATMCT EQU   CVTMAP+388                                               02734000
CVTXTNT1 EQU   0                                                        02735000
CVTXTNT2 EQU   0                                                        02736000
CVTDSSV  EQU   CVTXTNT2                                                 02737000
CVTFLGBT EQU   CVTXTNT2+5                                               02738000
CVTQID   EQU   CVTXTNT2+24                                              02739000
CVTSHS   EQU   CVTXTNT2+40                                              02740000
CVTRV400 EQU   CVTXTNT2+52                                              02741000
CVTRV409 EQU   CVTXTNT2+53                                              02742000
CVTATCVT EQU   CVTXTNT2+64                                              02743000
CVTRV429 EQU   CVTXTNT2+84                                              02744000
CVTRV438 EQU   CVTXTNT2+85                                              02745000
CVTRV457 EQU   CVTXTNT2+112                                             02746000
CVTRV466 EQU   CVTXTNT2+113                                             02747000
CVTFIX   EQU   0                                                        02748000
CVTRELNO EQU   CVTFIX+252                                               02749000
IOBPREFX EQU   0                                                        02750000
IOBCFLG1 EQU   IOBPREFX                                                 02751000
IOBSTDRD EQU   0                                                        02752000
IOBFLAG1 EQU   IOBSTDRD                                                 02753000
IOBCYCCK EQU   IOBFLAG1                                                 02754000
IOBRSTRT EQU   IOBFLAG1                                                 02755000
IOBFLAG2 EQU   IOBSTDRD+1                                               02756000
IOBPURGE EQU   IOBFLAG2                                                 02757000
IOBRDHA0 EQU   IOBFLAG2                                                 02758000
IOBSENS0 EQU   IOBSTDRD+2                                               02759000
IOBS0B7  EQU   IOBSENS0                                                 02760000
IOBSENS1 EQU   IOBSTDRD+3                                               02761000
IOBECBPT EQU   IOBSTDRD+4                                               02762000
IOBFLAG3 EQU   IOBSTDRD+8                                               02763000
IOBFL3   EQU   IOBFLAG3                                                 02764000
IOBCNC   EQU   IOBFL3                                                   02765000
IOBICL   EQU   IOBFL3                                                   02766000
IOBCSW   EQU   IOBSTDRD+9                                               02767000
IOBIOCSW EQU   IOBCSW                                                   02768000
IOBSTBYT EQU   IOBIOCSW+3                                               02769000
IOBUSTAT EQU   IOBSTBYT                                                 02770000
IOBCSTAT EQU   IOBSTBYT+1                                               02771000
IOBSTART EQU   IOBSTDRD+16                                              02772000
IOBDCBPT EQU   IOBSTDRD+20                                              02773000
IOBFLAG4 EQU   IOBDCBPT                                                 02774000
IOBRESTR EQU   IOBSTDRD+24                                              02775000
IOBINCAM EQU   IOBSTDRD+28                                              02776000
IOBBTAMF EQU   IOBINCAM                                                 02777000
IOSB     EQU   0                                                        02778000
IOSFLA   EQU   IOSB                                                     02779000
IOSACHN  EQU   IOSFLA                                                   02780000
IOSFLB   EQU   IOSB+1                                                   02781000
IOSFLC   EQU   IOSB+2                                                   02782000
IOSDVALT EQU   IOSFLC                                                   02783000
IOSPKEY  EQU   IOSB+12                                                  02784000
IOSOPT   EQU   IOSB+14                                                  02785000
IOSOPT2  EQU   IOSB+15                                                  02786000
@NM00004 EQU   IOSB+20                                                  02787000
IOSCSW   EQU   @NM00004+1                                               02788000
IOSTATUS EQU   IOSCSW+3                                                 02789000
IOSIPIB  EQU   IOSB+44                                                  02790000
IOSPATH  EQU   IOSB+86                                                  02791000
IOSCHN   EQU   IOSPATH                                                  02792000
IOSCKEY  EQU   IOSB+89                                                  02793000
IOSEEKA  EQU   IOSB+100                                                 02794000
IOSCCHH  EQU   IOSEEKA+3                                                02795000
IOSSKHH  EQU   IOSCCHH+2                                                02796000
SRBSECT  EQU   0                                                        02797000
SRBFLC   EQU   SRBSECT+12                                               02798000
ISTRPH   EQU   0                                                        02799000
RPHCNTL  EQU   ISTRPH                                                   02800000
RPHFLAGS EQU   RPHCNTL+2                                                02801000
RPHAPTYP EQU   RPHFLAGS                                                 02802000
RPHFSTLC EQU   RPHFLAGS                                                 02803000
RPHFLGB  EQU   RPHCNTL+3                                                02804000
RPHRPHA  EQU   ISTRPH+4                                                 02805000
RPHTSKID EQU   ISTRPH+8                                                 02806000
RPHRESMA EQU   ISTRPH+16                                                02807000
RPHWPFLG EQU   RPHRESMA                                                 02808000
RPHWEA   EQU   ISTRPH+24                                                02809000
RPHCSPA  EQU   RPHWEA                                                   02810000
RPHSRPRM EQU   ISTRPH+28                                                02811000
RPHCRR   EQU   ISTRPH+32                                                02812000
RPHPABQA EQU   ISTRPH+36                                                02813000
RPHWORK  EQU   ISTRPH+40                                                02814000
RPHSAVE1 EQU   RPHWORK                                                  02815000
RPHSBITS EQU   RPHSAVE1+1                                               02816000
ISTPAB   EQU   0                                                        02817000
PABWQCHN EQU   ISTPAB                                                   02818000
PABWEQA  EQU   PABWQCHN                                                 02819000
PABCHAIN EQU   PABWQCHN+4                                               02820000
PABRPHFG EQU   ISTPAB+12                                                02821000
PABFLAGS EQU   PABRPHFG                                                 02822000
PABERLCK EQU   PABFLAGS                                                 02823000
PABERRLK EQU   PABERLCK                                                 02824000
ISTDYPAB EQU   0                                                        02825000
DYPPAB   EQU   ISTDYPAB+16                                              02826000
ISTPOHD  EQU   0                                                        02827000
POHSTAT  EQU   ISTPOHD+1                                                02828000
ISTPFX   EQU   0                                                        02829000
PFXID    EQU   ISTPFX                                                   02830000
ISTNCSPL EQU   0                                                        02831000
@NM00039 EQU   ISTNCSPL                                                 02832000
NCSPFX   EQU   @NM00039                                                 02833000
NCSPLVBF EQU   ISTNCSPL+18                                              02834000
NCSPLVFL EQU   ISTNCSPL+20                                              02835000
NCSVDEL  EQU   NCSPLVFL                                                 02836000
NCSVSTAT EQU   NCSPLVFL                                                 02837000
NCSPLVF1 EQU   ISTNCSPL+21                                              02838000
NCSPLRID EQU   ISTNCSPL+28                                              02839000
NCSPLRPT EQU   ISTNCSPL+52                                              02840000
NCSPLLPT EQU   ISTNCSPL+56                                              02841000
NCSPLCMD EQU   ISTNCSPL+60                                              02842000
NCSCMDA  EQU   NCSPLCMD                                                 02843000
NCSPLUAD EQU   ISTNCSPL+64                                              02844000
NCSCRFLG EQU   ISTNCSPL+67                                              02845000
NCSPLWRM EQU   NCSCRFLG                                                 02846000
NCSPLCLD EQU   NCSCRFLG                                                 02847000
NCSSTCMD EQU   NCSCRFLG                                                 02848000
NCSPLRAD EQU   ISTNCSPL+144                                             02849000
NCSIOCID EQU   ISTNCSPL+148                                             02850000
NCSPLCID EQU   NCSIOCID                                                 02851000
NCSPLWKA EQU   ISTNCSPL+152                                             02852000
NCSPLCVT EQU   ISTNCSPL+156                                             02853000
NCSPLRPH EQU   ISTNCSPL+160                                             02854000
NCSPLFSB EQU   ISTNCSPL+168                                             02855000
NCSPLFL1 EQU   ISTNCSPL+176                                             02856000
NCSPL2IN EQU   NCSPLFL1                                                 02857000
NCSPLREQ EQU   NCSPLFL1                                                 02858000
NCSPLFL2 EQU   ISTNCSPL+177                                             02859000
NCSPLVDP EQU   NCSPLFL2                                                 02860000
NCSPLFL3 EQU   ISTNCSPL+178                                             02861000
NCSPLFL4 EQU   ISTNCSPL+179                                             02862000
NCSPLFL5 EQU   ISTNCSPL+181                                             02863000
NCSPLAPP EQU   ISTNCSPL+216                                             02864000
NCSSENSE EQU   ISTNCSPL+244                                             02865000
NCSCRMSK EQU   ISTNCSPL+268                                             02866000
NCSCHKPT EQU   NCSCRMSK                                                 02867000
NCSCRMOD EQU   NCSCRMSK+2                                               02868000
NCSPLSID EQU   ISTNCSPL+271                                             02869000
NCSPLSTA EQU   NCSPLSID                                                 02870000
NCSPLPHD EQU   NCSPLSID+1                                               02871000
NCSAPP   EQU   0                                                        02872000
NCSAPBUE EQU   NCSAPP+88                                                02873000
NCSUSSRU EQU   0                                                        02874000
ISTLOK   EQU   0                                                        02875000
LOKCHN   EQU   ISTLOK+1                                                 02876000
LOKCHNG  EQU   LOKCHN                                                   02877000
@NM00045 EQU   LOKCHNG+2                                                02878000
ISTDEVCH EQU   0                                                        02879000
DEVSHCH  EQU   ISTDEVCH                                                 02880000
DEVCHAR  EQU   DEVSHCH                                                  02881000
DEVTCODE EQU   ISTDEVCH+1                                               02882000
DEVFLAGS EQU   ISTDEVCH+3                                               02883000
DEVFCCTL EQU   DEVFLAGS                                                 02884000
DEVCHAR3 EQU   DEVFLAGS                                                 02885000
ISTRPRE  EQU   0                                                        02886000
RPRCOMID EQU   ISTRPRE+8                                                02887000
RPRENTRY EQU   ISTRPRE+20                                               02888000
RPRFLAGA EQU   ISTRPRE+21                                               02889000
RPRLIVE  EQU   RPRFLAGA                                                 02890000
RPRFLAGB EQU   ISTRPRE+22                                               02891000
RPRENTVH EQU   RPRFLAGB                                                 02892000
RPRONLIN EQU   RPRFLAGB                                                 02893000
RPRCAUSE EQU   ISTRPRE+23                                               02894000
RPRNSNEA EQU   ISTRPRE+36                                               02895000
RPRFLAGD EQU   ISTRPRE+61                                               02896000
RPRFLAGC EQU   ISTRPRE+62                                               02897000
ISTRCPRE EQU   0                                                        02898000
RCPPMODE EQU   ISTRCPRE+91                                              02899000
RCPLGNIN EQU   ISTRCPRE+92                                              02900000
ISTRDT   EQU   0                                                        02901000
RDTPLEN  EQU   ISTRDT+72                                                02902000
RDTPRIOR EQU   RDTPLEN                                                  02903000
RDTLGCT  EQU   ISTRDT+90                                                02904000
RDTFLAGB EQU   ISTRDT+91                                                02905000
RDTVPAB  EQU   ISTRDT+92                                                02906000
RDTVYRPH EQU   ISTRDT+108                                               02907000
RDTSTCNT EQU   ISTRDT+112                                               02908000
ISTRAP   EQU   0                                                        02909000
RAPFLG   EQU   ISTRAP+108                                               02910000
RAPFLGB  EQU   ISTRAP+109                                               02911000
RAPFLGC  EQU   ISTRAP+110                                               02912000
ISTRLC   EQU   0                                                        02913000
RLCADR   EQU   ISTRLC+72                                                02914000
RLCFLAG  EQU   RLCADR                                                   02915000
ISTRRN   EQU   0                                                        02916000
RRNADR   EQU   ISTRRN+136                                               02917000
RRNFLAG  EQU   RRNADR                                                   02918000
RRNLCSIP EQU   RRNFLAG                                                  02919000
RRNUCBAD EQU   RRNADR+1                                                 02920000
RRNRDF   EQU   ISTRRN+172                                               02921000
RRNRDFA  EQU   RRNRDF                                                   02922000
RRNRBREM EQU   RRNRDFA                                                  02923000
RRNRDFB  EQU   RRNRDF+1                                                 02924000
RRNCMF   EQU   ISTRRN+176                                               02925000
RRNCMFA  EQU   RRNCMF                                                   02926000
RRNCMFB  EQU   RRNCMF+1                                                 02927000
RRNCMFC  EQU   RRNCMF+2                                                 02928000
RRNCMFD  EQU   RRNCMF+3                                                 02929000
RRNNMDPD EQU   ISTRRN+192                                               02930000
RRNHPRE  EQU   ISTRRN+216                                               02931000
ISTRGP   EQU   0                                                        02932000
RGPFLG   EQU   ISTRGP+72                                                02933000
ISTRLN   EQU   0                                                        02934000
RLNADR   EQU   ISTRLN+72                                                02935000
RLNFLAG  EQU   RLNADR                                                   02936000
RLNUCBAD EQU   RLNADR+1                                                 02937000
RLNSTAT1 EQU   ISTRLN+86                                                02938000
RLNSTAT2 EQU   ISTRLN+87                                                02939000
RLNRDF   EQU   ISTRLN+88                                                02940000
RLNRDFA  EQU   RLNRDF                                                   02941000
RLNRACNT EQU   RLNRDFA                                                  02942000
RLNRDFB  EQU   RLNRDF+1                                                 02943000
RLNCRFLG EQU   ISTRLN+102                                               02944000
RLNLSCMD EQU   RLNCRFLG                                                 02945000
ISTRPT   EQU   0                                                        02946000
RPTLNCID EQU   ISTRPT+116                                               02947000
RPTDITT  EQU   ISTRPT+128                                               02948000
RPTFLAG1 EQU   ISTRPT+140                                               02949000
ISTRCL   EQU   0                                                        02950000
RCLADR   EQU   ISTRCL+72                                                02951000
RCLFLAG  EQU   RCLADR                                                   02952000
ISTRTR   EQU   0                                                        02953000
RTRADR   EQU   ISTRTR+124                                               02954000
RTRFLAG  EQU   RTRADR                                                   02955000
RTRRDFA  EQU   ISTRTR+136                                               02956000
RTRRAALL EQU   RTRRDFA                                                  02957000
RTRRDFB  EQU   ISTRTR+137                                               02958000
RTRRDFC  EQU   ISTRTR+138                                               02959000
RTRRDFD  EQU   ISTRTR+139                                               02960000
RTRRDFE  EQU   ISTRTR+140                                               02961000
RTRRDFF  EQU   ISTRTR+141                                               02962000
RTRCRFLG EQU   ISTRTR+143                                               02963000
RTRLSCMD EQU   RTRCRFLG                                                 02964000
RTRBSCID EQU   ISTRTR+188                                               02965000
ISTRIN   EQU   0                                                        02966000
RINDFD   EQU   ISTRIN+124                                               02967000
RINREMPO EQU   RINDFD                                                   02968000
RINNODEF EQU   RINDFD                                                   02969000
RINLDISC EQU   RINDFD                                                   02970000
RINNODID EQU   ISTRIN+125                                               02971000
RINRLDAF EQU   ISTRIN+126                                               02972000
RINREMOT EQU   ISTRIN+128                                               02973000
RINVPAB  EQU   ISTRIN+132                                               02974000
RINRPHCN EQU   ISTRIN+136                                               02975000
RINNCSPL EQU   ISTRIN+140                                               02976000
RINCNCNT EQU   ISTRIN+144                                               02977000
ISTRDS   EQU   0                                                        02978000
ISTDOT   EQU   0                                                        02979000
ISTRCC   EQU   0                                                        02980000
RCCFLAG  EQU   ISTRCC+73                                                02981000
RCCFLAGB EQU   ISTRCC+74                                                02982000
RCCSTAID EQU   ISTRCC+78                                                02983000
RCCID48  EQU   RCCSTAID+2                                               02984000
RCCCRFLG EQU   ISTRCC+108                                               02985000
ISTRLU   EQU   0                                                        02986000
RLUFLAG  EQU   ISTRLU+125                                               02987000
RLUCRFLG EQU   ISTRLU+126                                               02988000
RLUPACE  EQU   ISTRLU+132                                               02989000
RLUNCPPC EQU   ISTRLU+134                                               02990000
RLUUSSTB EQU   ISTRLU+140                                               02991000
RLUMODET EQU   ISTRLU+152                                               02992000
ISTRPX   EQU   0                                                        02993000
ISTRLX   EQU   0                                                        02994000
RLXFLAGA EQU   ISTRLX+76                                                02995000
ISTRSW   EQU   0                                                        02996000
ISTRDA   EQU   0                                                        02997000
RDAADR   EQU   ISTRDA+72                                                02998000
RDAFLAG  EQU   RDAADR                                                   02999000
RDAUCBAD EQU   RDAADR+1                                                 03000000
ISTRLS   EQU   0                                                        03001000
ISTDNT   EQU   0                                                        03002000
ISTGNT   EQU   0                                                        03003000
ISTPAT   EQU   0                                                        03004000
PATFLAGA EQU   ISTPAT+7                                                 03005000
ISTATCVT EQU   0                                                        03006000
ATCCOM   EQU   ISTATCVT                                                 03007000
ATCSTAT  EQU   ATCCOM                                                   03008000
ATCSTAT1 EQU   ATCSTAT                                                  03009000
ATCSTFLG EQU   ATCSTAT+1                                                03010000
ATCPOFLG EQU   ATCSTAT+2                                                03011000
ATCSTAT4 EQU   ATCSTAT+3                                                03012000
ATCCONFT EQU   ATCCOM+112                                               03013000
ATCIOTRC EQU   ATCCOM+140                                               03014000
ATCTHTRC EQU   ATCIOTRC                                                 03015000
ATCGTSTR EQU   ATCCOM+164                                               03016000
ATCCSMR  EQU   ISTATCVT+296                                             03017000
ATCSHRFG EQU   ISTATCVT+316                                             03018000
ATCMSGP  EQU   ISTATCVT+344                                             03019000
ATCHPGM  EQU   ISTATCVT+384                                             03020000
ATCLDNCS EQU   ISTATCVT+404                                             03021000
ATCLDECB EQU   ISTATCVT+408                                             03022000
ATCNODEL EQU   ISTATCVT+420                                             03023000
ATCNODDS EQU   ISTATCVT+428                                             03024000
ATCONFIG EQU   ISTATCVT+432                                             03025000
ATCAP33  EQU   ISTATCVT+444                                             03026000
ATCAP36  EQU   ISTATCVT+452                                             03027000
ATCVOCLK EQU   ISTATCVT+468                                             03028000
ATCRDTLK EQU   ISTATCVT+472                                             03029000
ATCVLCNT EQU   ISTATCVT+772                                             03030000
ATCRNO   EQU   ISTATCVT+788                                             03031000
ATCSOPD  EQU   ISTATCVT+792                                             03032000
ATCSIPD  EQU   ISTATCVT+800                                             03033000
ATCSECST EQU   ISTATCVT+812                                             03034000
ATCSTAT2 EQU   ISTATCVT+818                                             03035000
ATCINCW3 EQU   ISTATCVT+832                                             03036000
ATCVTBAM EQU   ISTATCVT+908                                             03037000
@NM00059 EQU   ATCVTBAM+3                                               03038000
ATCAOSM  EQU   ISTATCVT+912                                             03039000
ATCGSRBQ EQU   ATCAOSM+4                                                03040000
ATCGSRBG EQU   ATCGSRBQ                                                 03041000
ATCAP31  EQU   ATCAOSM+24                                               03042000
ATCAP34  EQU   ATCAOSM+32                                               03043000
ATCICAPP EQU   ATCAOSM+100                                              03044000
ATCLDAPP EQU   ATCAOSM+120                                              03045000
ATCDAPVT EQU   ATCAOSM+140                                              03046000
ATCAP37  EQU   ATCAOSM+264                                              03047000
ATCCRA   EQU   ATCAOSM+280                                              03048000
ATCCRACN EQU   ATCCRA+4                                                 03049000
ATCSRB   EQU   ATCAOSM+288                                              03050000
ATCSRBCN EQU   ATCSRB+4                                                 03051000
ATCCRPL  EQU   ATCAOSM+296                                              03052000
ATCRPLCN EQU   ATCCRPL+4                                                03053000
ATCVTFLG EQU   ATCAOSM+392                                              03054000
ATCZFLAG EQU   ATCAOSM+588                                              03055000
ISTAVT   EQU   0                                                        03056000
ISTAS49  EQU   ISTAVT+4                                                 03057000
ISTAHIP  EQU   ISTAS49                                                  03058000
ISTLDPRM EQU   0                                                        03059000
LDPFG    EQU   ISTLDPRM+20                                              03060000
LDPFB2   EQU   ISTLDPRM+21                                              03061000
ISTCONFT EQU   0                                                        03062000
CONHALT  EQU   ISTCONFT+106                                             03063000
CONFLAGS EQU   ISTCONFT+110                                             03064000
CONDSFLG EQU   CONFLAGS                                                 03065000
CONOPTFL EQU   CONFLAGS+1                                               03066000
CONSTAT  EQU   CONFLAGS+2                                               03067000
CONBUFF  EQU   CONFLAGS+3                                               03068000
CONFLG01 EQU   ISTCONFT+416                                             03069000
CONSCPID EQU   ISTCONFT+1356                                            03070000
CONSTAID EQU   CONSCPID+3                                               03071000
ISTLCCW  EQU   0                                                        03072000
LCCWOP   EQU   ISTLCCW                                                  03073000
LCCWRWOP EQU   LCCWOP                                                   03074000
LCCWCTL  EQU   LCCWRWOP                                                 03075000
LCCWFLAG EQU   ISTLCCW+1                                                03076000
LCCWLSI  EQU   LCCWFLAG                                                 03077000
ISTLCPB  EQU   0                                                        03078000
LCPREQTG EQU   ISTLCPB+2                                                03079000
LCPFLAGS EQU   LCPREQTG                                                 03080000
LCPZF001 EQU   LCPFLAGS                                                 03081000
LCPZRT02 EQU   LCPZF001                                                 03082000
LCPZF002 EQU   LCPFLAGS                                                 03083000
LCPZRT03 EQU   LCPZF002                                                 03084000
LCPZF003 EQU   LCPFLAGS                                                 03085000
LCPZRT04 EQU   LCPZF003                                                 03086000
LCPZF004 EQU   LCPFLAGS                                                 03087000
LCPZRT05 EQU   LCPZF004                                                 03088000
LCPZRT06 EQU   LCPFLAGS                                                 03089000
LCPZRT07 EQU   LCPFLAGS                                                 03090000
LCPMNRCD EQU   LCPREQTG+1                                               03091000
LCPZRT08 EQU   LCPMNRCD                                                 03092000
LCPZRT09 EQU   LCPMNRCD                                                 03093000
LCPCHAIN EQU   ISTLCPB+4                                                03094000
LCPCHAI1 EQU   LCPCHAIN                                                 03095000
LCPRUCNT EQU   ISTLCPB+8                                                03096000
LCPFLAG2 EQU   ISTLCPB+9                                                03097000
LCPTLBPI EQU   LCPFLAG2                                                 03098000
LCPFID0  EQU   LCPFLAG2                                                 03099000
LCPSEQ   EQU   ISTLCPB+10                                               03100000
LCPCID   EQU   ISTLCPB+16                                               03101000
LCPFDBA  EQU   ISTLCPB+24                                               03102000
LCPFLG1  EQU   ISTLCPB+37                                               03103000
LCPFLCCW EQU   ISTLCPB+40                                               03104000
LCPLCCW  EQU   ISTLCPB+48                                               03105000
LCPPABA  EQU   LCPLCCW+4                                                03106000
LCPRPHA  EQU   LCPPABA                                                  03107000
ISTZSAVE EQU   0                                                        03108000
ZSAZSVBC EQU   ISTZSAVE                                                 03109000
ZSAZSVMS EQU   ZSAZSVBC                                                 03110000
ISTPFCRR EQU   0                                                        03111000
PFCCRR   EQU   ISTPFCRR                                                 03112000
PFCCRRID EQU   PFCCRR                                                   03113000
PFCCRRLN EQU   PFCCRR+2                                                 03114000
PFCHDR   EQU   ISTPFCRR+4                                               03115000
PFCCRRO  EQU   PFCHDR                                                   03116000
PFCFRRO  EQU   PFCHDR+4                                                 03117000
ISTCFCRR EQU   0                                                        03118000
CFCAUDIT EQU   ISTCFCRR                                                 03119000
CFCNTRD  EQU   CFCAUDIT                                                 03120000
CFCCRT   EQU   CFCAUDIT+1                                               03121000
ISTZCRR  EQU   0                                                        03122000
ZCRCRR   EQU   ISTZCRR                                                  03123000
ZCRFLGS1 EQU   ISTZCRR+12                                               03124000
ZCRFLGS2 EQU   ISTZCRR+13                                               03125000
ZCRSWFLD EQU   ISTZCRR+14                                               03126000
ZCRENDSH EQU   ZCRSWFLD                                                 03127000
ZCRNDLCP EQU   ZCRSWFLD                                                 03128000
ZCRRESET EQU   ZCRSWFLD                                                 03129000
ZCRFLGS3 EQU   ISTZCRR+15                                               03130000
ZCRGENSW EQU   ISTZCRR+16                                               03131000
ZCRPFLGS EQU   ISTZCRR+17                                               03132000
ZCRIBPR  EQU   ISTZCRR+18                                               03133000
ZCRSCPSW EQU   ISTZCRR+19                                               03134000
ZCRPARMS EQU   ISTZCRR+24                                               03135000
ZCRFBPTR EQU   ZCRPARMS                                                 03136000
ZCRDFRDA EQU   ZCRPARMS+10                                              03137000
ZCRPCOD1 EQU   ZCRPARMS+12                                              03138000
ZCRPLSBF EQU   ZCRPCOD1                                                 03139000
ZCRPCOD2 EQU   ZCRPARMS+13                                              03140000
ZCRSVRTN EQU   ISTZCRR+56                                               03141000
ZCRWKARA EQU   ISTZCRR+156                                              03142000
ZCRCIDSV EQU   ISTZCRR+192                                              03143000
ZCRAUDIT EQU   ISTZCRR+440                                              03144000
ZCRENTER EQU   ZCRAUDIT+5                                               03145000
ZCRLCPB  EQU   ISTZCRR+480                                              03146000
ZCRRHRU  EQU   ZCRLCPB                                                  03147000
ISTASCRR EQU   0                                                        03148000
ASCFLAGS EQU   ISTASCRR+16                                              03149000
ASCFLG1  EQU   ASCFLAGS                                                 03150000
ASCFLG2  EQU   ASCFLAGS+2                                               03151000
ASCFLG3  EQU   ASCFLAGS+4                                               03152000
ASCUSRGS EQU   ISTASCRR+28                                              03153000
ISTAPCRR EQU   0                                                        03154000
APCATFLG EQU   ISTAPCRR+16                                              03155000
APCRFLG  EQU   ISTAPCRR+18                                              03156000
APCSAVE  EQU   ISTAPCRR+44                                              03157000
APCCOMF  EQU   ISTAPCRR+116                                             03158000
APCCOMF1 EQU   APCCOMF                                                  03159000
APC31FLG EQU   ISTAPCRR+132                                             03160000
APC52FLG EQU   ISTAPCRR+133                                             03161000
APC53FLG EQU   ISTAPCRR+134                                             03162000
APC54FLG EQU   ISTAPCRR+135                                             03163000
APC57FLG EQU   ISTAPCRR+136                                             03164000
ISTCRA   EQU   0                                                        03165000
CRABASIC EQU   ISTCRA                                                   03166000
CRAHDR   EQU   CRABASIC                                                 03167000
CRACRR   EQU   CRAHDR                                                   03168000
CRALKACT EQU   CRABASIC+8                                               03169000
CRAL2PTR EQU   CRABASIC+16                                              03170000
CRAL3PTR EQU   CRABASIC+20                                              03171000
CRASVC   EQU   ISTCRA+848                                               03172000
CRABUFA  EQU   CRASVC+68                                                03173000
ISTCNSTA EQU   0                                                        03174000
CNSTFLDA EQU   ISTCNSTA+16                                              03175000
CNSTFLDB EQU   ISTCNSTA+19                                              03176000
ISTVYCRR EQU   0                                                        03177000
VYCAUDIT EQU   ISTVYCRR+22                                              03178000
VYCNTRD  EQU   VYCAUDIT                                                 03179000
NINCVS   EQU   VYCNTRD+1                                                03180000
VYCCRT   EQU   VYCAUDIT+12                                              03181000
CINCVS   EQU   VYCCRT+1                                                 03182000
VYCRRCW3 EQU   ISTVYCRR+118                                             03183000
ISTGTNCS EQU   0                                                        03184000
GTNCSAD  EQU   ISTGTNCS                                                 03185000
GTNCSFLG EQU   ISTGTNCS+4                                               03186000
GTNCSREQ EQU   GTNCSFLG                                                 03187000
GTNCSRQU EQU   GTNCSFLG                                                 03188000
ISTINCW3 EQU   0                                                        03189000
CVSWKA   EQU   0                                                        03190000
CVSSVARA EQU   0                                                        03191000
CVSSVBKP EQU   CVSSVARA+4                                               03192000
CVSSVFWP EQU   CVSSVARA+8                                               03193000
ISTTPMPL EQU   0                                                        03194000
ISTDLRPL EQU   0                                                        03195000
DLRPLRSA EQU   ISTDLRPL                                                 03196000
DLRPLIDF EQU   DLRPLRSA                                                 03197000
DLRPLLTH EQU   DLRPLRSA+1                                               03198000
DLRPLFCD EQU   DLRPLRSA+2                                               03199000
DLRPLRCD EQU   DLRPLRSA+3                                               03200000
DLRPLQPT EQU   DLRPLRSA+4                                               03201000
DLRPLRPF EQU   ISTDLRPL+72                                              03202000
DLRPLRNF EQU   ISTDLRPL+73                                              03203000
DLRPLUSR EQU   ISTDLRPL+76                                              03204000
DLRPLIST EQU   ISTDLRPL+80                                              03205000
FMZL0056 EQU   0                                                        03206000
ISTAPC37 EQU   0                                                        03207000
FMZL0079 EQU   0                                                        03208000
FMZL0146 EQU   0                                                        03209000
FMZL0200 EQU   0                                                        03210000
FMZL0211 EQU   0                                                        03211000
FMZL0216 EQU   0                                                        03212000
FMZL0221 EQU   0                                                        03213000
FMZL0231 EQU   0                                                        03214000
@NM00106 EQU   0                                                        03215000
CMZID241 EQU   @NM00106                                                 03216000
@NM00107 EQU   @NM00106+4                                               03217000
CMZRL241 EQU   @NM00107                                                 03218000
CMZRA241 EQU   @NM00107+1                                               03219000
CMZEA241 EQU   @NM00106+8                                               03220000
CMZVP241 EQU   @NM00106+12                                              03221000
CMZSA241 EQU   0                                                        03222000
CMTA241  EQU   0                                                        03223000
ISTAPC34 EQU   0                                                        03224000
CVTS01   EQU   CVTPGSIA                                                 03225000
CVTLPDIA EQU   CVTS01+12                                                03226000
CVTDIRST EQU   CVTLPDIA                                                 03227000
CVTSLIDA EQU   CVTS01+24                                                03228000
CVTCTLFG EQU   CVTS01+50                                                03229000
CVTRV210 EQU   CVTS01+424                                               03230000
CVTRV219 EQU   CVTS01+425                                               03231000
CVTRV228 EQU   CVTS01+426                                               03232000
CVTRV237 EQU   CVTS01+427                                               03233000
CVTMFRTR EQU   CVTS01+452                                               03234000
CVTRV262 EQU   CVTS01+468                                               03235000
CVTRV271 EQU   CVTS01+469                                               03236000
CVTRV280 EQU   CVTS01+470                                               03237000
CVTRV289 EQU   CVTS01+471                                               03238000
CVTGSDA  EQU   CVTS01+600                                               03239000
IOBORG01 EQU   IOBPREFX+8                                               03240000
IOBNIOBA EQU   IOBORG01                                                 03241000
IOBNFLG1 EQU   IOBNIOBA                                                 03242000
IOBPRTOV EQU   IOBNFLG1                                                 03243000
IOBORG02 EQU   IOBPREFX+8                                               03244000
IOBDQADA EQU   IOBORG02                                                 03245000
IOBDEQIN EQU   IOBDQADA                                                 03246000
IOBORG03 EQU   IOBPREFX+12                                              03247000
IOBORG04 EQU   IOBINCAM                                                 03248000
IOBORG12 EQU   IOBINCAM                                                 03249000
IOBFL4   EQU   IOBORG12                                                 03250000
IOBEXTEN EQU   IOBSTDRD+32                                              03251000
IOBSEEK  EQU   IOBEXTEN                                                 03252000
IOBBB    EQU   IOBSEEK+1                                                03253000
IOBCC    EQU   IOBSEEK+3                                                03254000
IOBHH    EQU   IOBSEEK+5                                                03255000
IOBORG05 EQU   IOBEXTEN                                                 03256000
IOBORG06 EQU   IOBEXTEN                                                 03257000
IOBNXTPT EQU   IOBORG06+4                                               03258000
IOBSTATA EQU   IOBNXTPT                                                 03259000
IOBORG07 EQU   IOBEXTEN+8                                               03260000
W1IEXTEN EQU   IOBORG07                                                 03261000
IOBORG08 EQU   IOBEXTEN+8                                               03262000
IOBINDCT EQU   IOBORG08+4                                               03263000
IOBUNSQR EQU   IOBORG08+5                                               03264000
IOBFCHAD EQU   IOBORG08+8                                               03265000
IOBORG09 EQU   IOBEXTEN+8                                               03266000
IOBDPLAD EQU   IOBORG09+4                                               03267000
IOBDTYPE EQU   IOBORG09+8                                               03268000
IOBDTYP2 EQU   IOBORG09+9                                               03269000
IOBDSTAT EQU   IOBORG09+10                                              03270000
IOBSTAT1 EQU   IOBDSTAT                                                 03271000
IOBORG10 EQU   IOBEXTEN+8                                               03272000
IOBSEEK2 EQU   IOBORG10                                                 03273000
IOBORG11 EQU   IOBEXTEN                                                 03274000
IOBERCT  EQU   IOBORG11                                                 03275000
IOBUCBXV EQU   IOBERCT                                                  03276000
IOBNAME  EQU   IOBORG11+4                                               03277000
IOBORG13 EQU   IOBEXTEN                                                 03278000
IOBSKADR EQU   IOBORG13                                                 03279000
IOSATTSC EQU   IOSIPIB                                                  03280000
IOSWTOWA EQU   IOSIPIB                                                  03281000
IOSPCISC EQU   IOSIPIB                                                  03282000
FLC      EQU   PSA                                                      03283000
PSARSVTE EQU   PSARSVT                                                  03284000
LCPZTIE  EQU   LCPCID                                                   03285000
LCPZSNAM EQU   LCPZTIE+8                                                03286000
@NM00098 EQU   ISTNCSPL                                                 03287000
NCSPRIV  EQU   @NM00098+3                                               03288000
DLRPLCOQ EQU   DLRPLIST                                                 03289000
DLRPLOPT EQU   DLRPLCOQ                                                 03290000
DLRPLCR6 EQU   DLRPLIST                                                 03291000
DLRPLCON EQU   DLRPLCR6                                                 03292000
DLRPLNOD EQU   DLRPLCR6+4                                               03293000
@NM00101 EQU   DLRPLCR6+8                                               03294000
DLRPLFNC EQU   @NM00101                                                 03295000
RTRDNCBA EQU   ISTRTR+40                                                03296000
SRB      EQU   SRBSECT                                                  03297000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03298000
DLRPLTPL EQU   DLRPLCR6+44                                              03299000
DLRPLMSG EQU   DLRPLCR6+24                                              03300000
DLRPLSA2 EQU   DLRPLCR6+20                                              03301000
DLRPLSA1 EQU   DLRPLCR6+16                                              03302000
DLRPLMID EQU   DLRPLCR6+12                                              03303000
DLRPLSWS EQU   @NM00101+1                                               03304000
DLRPLTPM EQU   DLRPLCOQ+4                                               03305000
DLRPLGYN EQU   DLRPLOPT                                                 03306000
DLRPLFOL EQU   DLRPLOPT                                                 03307000
@NM00099 EQU   @NM00098                                                 03308000
LCPZTRV4 EQU   LCPZSNAM+4                                               03309000
LCPZTRV1 EQU   LCPZSNAM                                                 03310000
LCPZSNA  EQU   LCPZTIE+4                                                03311000
LCPZFMCA EQU   LCPZTIE                                                  03312000
PSARSAV  EQU   PSARSVTE+60                                              03313000
PSARSTK  EQU   PSARSVTE+56                                              03314000
PSAESAV3 EQU   PSARSVTE+52                                              03315000
PSAESTK3 EQU   PSARSVTE+48                                              03316000
PSAESAV2 EQU   PSARSVTE+44                                              03317000
PSAESTK2 EQU   PSARSVTE+40                                              03318000
PSAESAV1 EQU   PSARSVTE+36                                              03319000
PSAESTK1 EQU   PSARSVTE+32                                              03320000
PSAPSAV  EQU   PSARSVTE+28                                              03321000
PSAPSTK  EQU   PSARSVTE+24                                              03322000
PSAMSAV  EQU   PSARSVTE+20                                              03323000
PSAMSTK  EQU   PSARSVTE+16                                              03324000
PSASSAV  EQU   PSARSVTE+12                                              03325000
PSASSTK  EQU   PSARSVTE+8                                               03326000
PSANSTK  EQU   PSARSVTE+4                                               03327000
PSACSTK  EQU   PSARSVTE                                                 03328000
IOSPCIWA EQU   IOSPCISC+44                                              03329000
IOSPCIRS EQU   IOSPCISC+8                                               03330000
@NM00009 EQU   IOSPCISC+4                                               03331000
@NM00008 EQU   IOSPCISC                                                 03332000
IOSWRNDR EQU   IOSWTOWA+4                                               03333000
IOSWTOPT EQU   IOSWTOWA+3                                               03334000
IOSWTOCP EQU   IOSWTOWA+2                                               03335000
IOSWTOCH EQU   IOSWTOWA                                                 03336000
IOSATTWA EQU   IOSATTSC+40                                              03337000
@NM00007 EQU   IOSATTSC+24                                              03338000
IOSATTSN EQU   IOSATTSC                                                 03339000
IOBSKSS  EQU   IOBSKADR+3                                               03340000
IOBSK0   EQU   IOBSKADR+2                                               03341000
IOBSKTT  EQU   IOBSKADR+1                                               03342000
IOBSKRV  EQU   IOBSKADR                                                 03343000
IOBCSWSV EQU   IOBORG11+17                                              03344000
IOBSENSV EQU   IOBORG11+16                                              03345000
IOBRCD   EQU   IOBORG11+12                                              03346000
IOBMDREC EQU   IOBORG11+8                                               03347000
IOBNAMEA EQU   IOBNAME+1                                                03348000
IOBNAMSZ EQU   IOBNAME                                                  03349000
IOBERCTA EQU   IOBERCT+1                                                03350000
IOBRTYPE EQU   IOBUCBXV                                                 03351000
IOBRDCHP EQU   IOBORG10+20                                              03352000
IOBNEXTA EQU   IOBORG10+16                                              03353000
IOBREADA EQU   IOBORG10+12                                              03354000
IOBBUFC  EQU   IOBORG10+8                                               03355000
IOBSK2R  EQU   IOBSEEK2+7                                               03356000
IOBSK2HH EQU   IOBSEEK2+5                                               03357000
IOBSK2CC EQU   IOBSEEK2+3                                               03358000
IOBSK2BB EQU   IOBSEEK2+1                                               03359000
IOBSK2M  EQU   IOBSEEK2                                                 03360000
IOBCHNPR EQU   IOBORG09+40                                              03361000
IOBDNCRF EQU   IOBORG09+32                                              03362000
IOBRSV35 EQU   IOBORG09+24                                              03363000
IOBDQPTR EQU   IOBORG09+20                                              03364000
IOBRSV34 EQU   IOBORG09+18                                              03365000
IOBDBYTN EQU   IOBORG09+16                                              03366000
IOBDCPND EQU   IOBORG09+12                                              03367000
IOBSTAT2 EQU   IOBDSTAT+1                                               03368000
IOBSIORT EQU   IOBSTAT1                                                 03369000
IOBADDVU EQU   IOBSTAT1                                                 03370000
IOBBUFF  EQU   IOBSTAT1                                                 03371000
IOBENQUE EQU   IOBSTAT1                                                 03372000
IOBPASS2 EQU   IOBSTAT1                                                 03373000
IOBSYNCH EQU   IOBSTAT1                                                 03374000
IOBNEWVL EQU   IOBSTAT1                                                 03375000
IOBABNRM EQU   IOBSTAT1                                                 03376000
IOBRELEX EQU   IOBDTYP2                                                 03377000
IOBADDTY EQU   IOBDTYP2                                                 03378000
IOBTYPE  EQU   IOBDTYP2                                                 03379000
IOBRQUST EQU   IOBDTYP2                                                 03380000
IOBSUFFX EQU   IOBDTYP2                                                 03381000
IOBSBLKL EQU   IOBDTYP2                                                 03382000
IOBSKEY  EQU   IOBDTYP2                                                 03383000
IOBRELBL EQU   IOBDTYPE                                                 03384000
IOBRDEXC EQU   IOBDTYPE                                                 03385000
IOBDYNBF EQU   IOBDTYPE                                                 03386000
IOBACTAD EQU   IOBDTYPE                                                 03387000
IOBFDBCK EQU   IOBDTYPE                                                 03388000
IOBEXTSC EQU   IOBDTYPE                                                 03389000
IOBOVFLO EQU   IOBDTYPE                                                 03390000
IOBVERFY EQU   IOBDTYPE                                                 03391000
IOBDPLB  EQU   IOBDPLAD+1                                               03392000
IOBDAYLI EQU   IOBDPLAD                                                 03393000
IOBDIOBS EQU   IOBORG09+2                                               03394000
IOBDBYTR EQU   IOBORG09                                                 03395000
IOBBCHAD EQU   IOBORG08+12                                              03396000
IOBFCHNB EQU   IOBFCHAD+1                                               03397000
IOBCOUNT EQU   IOBFCHAD                                                 03398000
IOBASYN  EQU   IOBORG08+7                                               03399000
IOBAPP   EQU   IOBORG08+6                                               03400000
IOBRSV32 EQU   IOBUNSQR                                                 03401000
IOBRSV31 EQU   IOBUNSQR                                                 03402000
IOBRSV30 EQU   IOBUNSQR                                                 03403000
IOBKNRWR EQU   IOBUNSQR                                                 03404000
IOBKNWR  EQU   IOBUNSQR                                                 03405000
IOBNTAV2 EQU   IOBUNSQR                                                 03406000
IOBNTAV1 EQU   IOBUNSQR                                                 03407000
IOBCPBSY EQU   IOBUNSQR                                                 03408000
IOBCHNNL EQU   IOBINDCT                                                 03409000
IOBRSV29 EQU   IOBINDCT                                                 03410000
IOBRSV28 EQU   IOBINDCT                                                 03411000
IOBRSV27 EQU   IOBINDCT                                                 03412000
IOBKEYAD EQU   IOBINDCT                                                 03413000
IOBOVPTR EQU   IOBINDCT                                                 03414000
IOBUNSCH EQU   IOBINDCT                                                 03415000
IOBDEQCP EQU   IOBINDCT                                                 03416000
IOBCCWAD EQU   IOBORG08                                                 03417000
W1OEXTEN EQU   W1IEXTEN                                                 03418000
IOBCCW   EQU   IOBORG06+8                                               03419000
IOBNXTPB EQU   IOBNXTPT+1                                               03420000
IOBRSV26 EQU   IOBSTATA                                                 03421000
IOBRSV25 EQU   IOBSTATA                                                 03422000
IOBRSV24 EQU   IOBSTATA                                                 03423000
IOBRSV23 EQU   IOBSTATA                                                 03424000
IOBRSV22 EQU   IOBSTATA                                                 03425000
IOBRSV21 EQU   IOBSTATA                                                 03426000
IOBRSV20 EQU   IOBSTATA                                                 03427000
IOBAVLFL EQU   IOBSTATA                                                 03428000
IOBRSV37 EQU   IOBORG06+1                                               03429000
IOBUCBXG EQU   IOBORG06                                                 03430000
IOBCPA   EQU   IOBORG05+32                                              03431000
IOBERINF EQU   IOBORG05+16                                              03432000
IOBERCCW EQU   IOBORG05+8                                               03433000
IOBSNDPT EQU   IOBORG05+7                                               03434000
IOBRCVPT EQU   IOBORG05+6                                               03435000
IOBWORK  EQU   IOBORG05+1                                               03436000
IOBUCBX  EQU   IOBORG05                                                 03437000
IOBR     EQU   IOBSEEK+7                                                03438000
IOBHH2   EQU   IOBHH+1                                                  03439000
IOBHH1   EQU   IOBHH                                                    03440000
IOBCC2   EQU   IOBCC+1                                                  03441000
IOBCC1   EQU   IOBCC                                                    03442000
IOBBB2   EQU   IOBBB+1                                                  03443000
IOBBB1   EQU   IOBBB                                                    03444000
IOBM     EQU   IOBSEEK                                                  03445000
IOBRSV46 EQU   IOBFL4                                                   03446000
IOBRSV47 EQU   IOBFL4                                                   03447000
IOBENT   EQU   IOBFL4                                                   03448000
IOBEQP   EQU   IOBFL4                                                   03449000
IOBBUS   EQU   IOBFL4                                                   03450000
IOBDCK   EQU   IOBFL4                                                   03451000
IOBREJ   EQU   IOBFL4                                                   03452000
IOBOVR   EQU   IOBFL4                                                   03453000
IOBCRILC EQU   IOBORG04+1                                               03454000
IOBCRDCC EQU   IOBORG04                                                 03455000
IOBGQECB EQU   IOBORG03                                                 03456000
IOBSWAP  EQU   IOBORG02+4                                               03457000
IOBDQADB EQU   IOBDQADA+1                                               03458000
IOBRSV13 EQU   IOBDEQIN                                                 03459000
IOBRSV12 EQU   IOBDEQIN                                                 03460000
IOBRSV11 EQU   IOBDEQIN                                                 03461000
IOBRSV10 EQU   IOBDEQIN                                                 03462000
IOBRSV09 EQU   IOBDEQIN                                                 03463000
IOBRSV08 EQU   IOBDEQIN                                                 03464000
IOBRSV07 EQU   IOBDEQIN                                                 03465000
IOBDEQ   EQU   IOBDEQIN                                                 03466000
IOBNECB  EQU   IOBORG01+4                                               03467000
IOBNIOBB EQU   IOBNIOBA+1                                               03468000
IOBFIRST EQU   IOBNFLG1                                                 03469000
IOBUPERR EQU   IOBNFLG1                                                 03470000
IOBSPAN  EQU   IOBNFLG1                                                 03471000
IOBBKSPC EQU   IOBNFLG1                                                 03472000
IOBUPDAT EQU   IOBNFLG1                                                 03473000
IOBREAD  EQU   IOBNFLG1                                                 03474000
IOBWRITE EQU   IOBNFLG1                                                 03475000
IOBSEGMT EQU   IOBPRTOV                                                 03476000
CVTRV628 EQU   CVTS01+728                                               03477000
CVTRV627 EQU   CVTS01+724                                               03478000
CVTRV626 EQU   CVTS01+720                                               03479000
CVTRV625 EQU   CVTS01+716                                               03480000
CVTRV624 EQU   CVTS01+712                                               03481000
CVTRV623 EQU   CVTS01+708                                               03482000
CVTRV622 EQU   CVTS01+704                                               03483000
CVTRV621 EQU   CVTS01+700                                               03484000
CVTRV620 EQU   CVTS01+696                                               03485000
CVTRV619 EQU   CVTS01+692                                               03486000
CVTRV618 EQU   CVTS01+688                                               03487000
CVTRV617 EQU   CVTS01+684                                               03488000
CVTRV616 EQU   CVTS01+680                                               03489000
CVTRV615 EQU   CVTS01+676                                               03490000
CVTRV614 EQU   CVTS01+672                                               03491000
CVTRV613 EQU   CVTS01+668                                               03492000
CVTTCASP EQU   CVTS01+664                                               03493000
CVT0PT03 EQU   CVTS01+660                                               03494000
CVT0PT0E EQU   CVTS01+656                                               03495000
CVTIRM   EQU   CVTS01+652                                               03496000
CVTCGK   EQU   CVTS01+648                                               03497000
CVTRV607 EQU   CVTS01+644                                               03498000
CVTRV606 EQU   CVTS01+640                                               03499000
CVTRV605 EQU   CVTS01+636                                               03500000
CVTRV604 EQU   CVTS01+632                                               03501000
CVTEFF02 EQU   CVTS01+628                                               03502000
CVTCBBR  EQU   CVTS01+624                                               03503000
CVTSSCR  EQU   CVTS01+620                                               03504000
CVTEVENT EQU   CVTS01+616                                               03505000
CVTCRCA  EQU   CVTS01+612                                               03506000
CVTTPIO  EQU   CVTS01+608                                               03507000
CVTADV   EQU   CVTS01+604                                               03508000
CVTGSDAB EQU   CVTGSDA                                                  03509000
CVTQV3   EQU   CVTS01+596                                               03510000
CVTQV2   EQU   CVTS01+592                                               03511000
CVTQV1   EQU   CVTS01+588                                               03512000
CVTRPT   EQU   CVTS01+584                                               03513000
CVTSSRB  EQU   CVTS01+580                                               03514000
CVTCSDRL EQU   CVTS01+576                                               03515000
CVTEXP1  EQU   CVTS01+572                                               03516000
CVTRMPMT EQU   CVTS01+568                                               03517000
CVTRMPTT EQU   CVTS01+564                                               03518000
CVTVPSA  EQU   CVTS01+560                                               03519000
CVTVSTOP EQU   CVTS01+556                                               03520000
CVTGTFR8 EQU   CVTS01+552                                               03521000
CVTQUIT  EQU   CVTS01+548                                               03522000
CVTVACR  EQU   CVTS01+544                                               03523000
CVTWTCB  EQU   CVTS01+540                                               03524000
CVTSTPRS EQU   CVTS01+536                                               03525000
CVT0PT02 EQU   CVTS01+532                                               03526000
CVTDARCM EQU   CVTS01+528                                               03527000
CVTIRECM EQU   CVTS01+524                                               03528000
CVTJRECM EQU   CVTS01+520                                               03529000
CVTVEMS0 EQU   CVTS01+516                                               03530000
CVTSPFRR EQU   CVTS01+512                                               03531000
CVTRLSTG EQU   CVTS01+508                                               03532000
CVT0TC0A EQU   CVTS01+504                                               03533000
CVTGMBR  EQU   CVTS01+500                                               03534000
CVTLFRM  EQU   CVTS01+496                                               03535000
CVTRMBR  EQU   CVTS01+492                                               03536000
CVTVIOP  EQU   CVTS01+488                                               03537000
CVTRV307 EQU   CVTS01+486                                               03538000
CVTRV306 EQU   CVTS01+484                                               03539000
CVTRV305 EQU   CVTS01+482                                               03540000
CVTRV304 EQU   CVTS01+480                                               03541000
CVTRV303 EQU   CVTS01+478                                               03542000
CVTRV302 EQU   CVTS01+476                                               03543000
CVTTRCA  EQU   CVTS01+472                                               03544000
CVTRV297 EQU   CVTRV289                                                 03545000
CVTRV296 EQU   CVTRV289                                                 03546000
CVTRV295 EQU   CVTRV289                                                 03547000
CVTRV294 EQU   CVTRV289                                                 03548000
CVTRV293 EQU   CVTRV289                                                 03549000
CVTRV292 EQU   CVTRV289                                                 03550000
CVTRV291 EQU   CVTRV289                                                 03551000
CVTRV290 EQU   CVTRV289                                                 03552000
CVTRV288 EQU   CVTRV280                                                 03553000
CVTRV287 EQU   CVTRV280                                                 03554000
CVTRV286 EQU   CVTRV280                                                 03555000
CVTRV285 EQU   CVTRV280                                                 03556000
CVTRV284 EQU   CVTRV280                                                 03557000
CVTRV283 EQU   CVTRV280                                                 03558000
CVTRV282 EQU   CVTRV280                                                 03559000
CVTRV281 EQU   CVTRV280                                                 03560000
CVTRV279 EQU   CVTRV271                                                 03561000
CVTRV278 EQU   CVTRV271                                                 03562000
CVTRV277 EQU   CVTRV271                                                 03563000
CVTRV276 EQU   CVTRV271                                                 03564000
CVTRV275 EQU   CVTRV271                                                 03565000
CVTRV274 EQU   CVTRV271                                                 03566000
CVTRV273 EQU   CVTRV271                                                 03567000
CVTRV272 EQU   CVTRV271                                                 03568000
CVTRV270 EQU   CVTRV262                                                 03569000
CVTRV269 EQU   CVTRV262                                                 03570000
CVTRV268 EQU   CVTRV262                                                 03571000
CVTRV267 EQU   CVTRV262                                                 03572000
CVTRV266 EQU   CVTRV262                                                 03573000
CVTRV265 EQU   CVTRV262                                                 03574000
CVTRV264 EQU   CVTRV262                                                 03575000
CVTRV263 EQU   CVTRV262                                                 03576000
CVTVFP   EQU   CVTS01+464                                               03577000
CVTVSI   EQU   CVTS01+460                                               03578000
CVTVPSIB EQU   CVTS01+456                                               03579000
CVTMFACT EQU   CVTMFRTR                                                 03580000
CVTMFCTL EQU   CVTS01+448                                               03581000
CVTPVBP  EQU   CVTS01+444                                               03582000
CVTPWI   EQU   CVTS01+440                                               03583000
CVTRV254 EQU   CVTS01+438                                               03584000
CVTRV253 EQU   CVTS01+436                                               03585000
CVTRV252 EQU   CVTS01+434                                               03586000
CVTRV251 EQU   CVTS01+433                                               03587000
CVTRV250 EQU   CVTS01+432                                               03588000
CVTRV249 EQU   CVTS01+431                                               03589000
CVTRV248 EQU   CVTS01+430                                               03590000
CVTRV247 EQU   CVTS01+429                                               03591000
CVTRV246 EQU   CVTS01+428                                               03592000
CVTRV245 EQU   CVTRV237                                                 03593000
CVTRV244 EQU   CVTRV237                                                 03594000
CVTRV243 EQU   CVTRV237                                                 03595000
CVTRV242 EQU   CVTRV237                                                 03596000
CVTRV241 EQU   CVTRV237                                                 03597000
CVTRV240 EQU   CVTRV237                                                 03598000
CVTRV239 EQU   CVTRV237                                                 03599000
CVTRV238 EQU   CVTRV237                                                 03600000
CVTRV236 EQU   CVTRV228                                                 03601000
CVTRV235 EQU   CVTRV228                                                 03602000
CVTRV234 EQU   CVTRV228                                                 03603000
CVTRV233 EQU   CVTRV228                                                 03604000
CVTRV232 EQU   CVTRV228                                                 03605000
CVTRV231 EQU   CVTRV228                                                 03606000
CVTRV230 EQU   CVTRV228                                                 03607000
CVTRV229 EQU   CVTRV228                                                 03608000
CVTRV227 EQU   CVTRV219                                                 03609000
CVTRV226 EQU   CVTRV219                                                 03610000
CVTRV225 EQU   CVTRV219                                                 03611000
CVTRV224 EQU   CVTRV219                                                 03612000
CVTRV223 EQU   CVTRV219                                                 03613000
CVTRV222 EQU   CVTRV219                                                 03614000
CVTRV221 EQU   CVTRV219                                                 03615000
CVTRV220 EQU   CVTRV219                                                 03616000
CVTRV218 EQU   CVTRV210                                                 03617000
CVTRV217 EQU   CVTRV210                                                 03618000
CVTRV216 EQU   CVTRV210                                                 03619000
CVTRV215 EQU   CVTRV210                                                 03620000
CVTRV214 EQU   CVTRV210                                                 03621000
CVTRV213 EQU   CVTRV210                                                 03622000
CVTRV212 EQU   CVTRV210                                                 03623000
CVTRV211 EQU   CVTRV210                                                 03624000
CVTLCCAT EQU   CVTS01+420                                               03625000
CVTPCCAT EQU   CVTS01+416                                               03626000
CVTIPCRP EQU   CVTS01+412                                               03627000
CVTIPCRI EQU   CVTS01+408                                               03628000
CVTIPCDS EQU   CVTS01+404                                               03629000
CVTAIDVT EQU   CVTS01+400                                               03630000
CVTSSAP  EQU   CVTS01+396                                               03631000
CVTEHCIR EQU   CVTS01+392                                               03632000
CVTEHDEF EQU   CVTS01+388                                               03633000
CVTDAIR  EQU   CVTS01+384                                               03634000
CVTPERFM EQU   CVTS01+380                                               03635000
CVT044R2 EQU   CVTS01+376                                               03636000
CVTFETCH EQU   CVTS01+372                                               03637000
CVTRSTWD EQU   CVTS01+368                                               03638000
CVTSPOST EQU   CVTS01+364                                               03639000
CVTIOBP  EQU   CVTS01+360                                               03640000
CVTASMVT EQU   CVTS01+356                                               03641000
CVTRECRQ EQU   CVTS01+352                                               03642000
CVTWSAC  EQU   CVTS01+348                                               03643000
CVTRV149 EQU   CVTS01+344                                               03644000
CVTWSAL  EQU   CVTS01+340                                               03645000
CVTSPSA  EQU   CVTS01+336                                               03646000
CVTGLMN  EQU   CVTS01+332                                               03647000
CVTVEAC0 EQU   CVTS01+328                                               03648000
CVT062R1 EQU   CVTS01+324                                               03649000
CVTRPOST EQU   CVTS01+320                                               03650000
CVTDQIQE EQU   CVTS01+316                                               03651000
CVTCSD   EQU   CVTS01+312                                               03652000
CVTLKRMA EQU   CVTS01+308                                               03653000
CVTRSPIE EQU   CVTS01+304                                               03654000
CVTRENQ  EQU   CVTS01+300                                               03655000
CVTLQCB  EQU   CVTS01+296                                               03656000
CVTFQCB  EQU   CVTS01+292                                               03657000
CVTQCS01 EQU   CVTS01+288                                               03658000
CVTAPFT  EQU   CVTS01+284                                               03659000
CVTPARRL EQU   CVTS01+280                                               03660000
CVTVWAIT EQU   CVTS01+276                                               03661000
CVTGSPL  EQU   CVTS01+272                                               03662000
CVTLSMQ  EQU   CVTS01+268                                               03663000
CVTGSMQ  EQU   CVTS01+264                                               03664000
CVTEXPRO EQU   CVTS01+260                                               03665000
CVTOPCTP EQU   CVTS01+256                                               03666000
CVTSIC   EQU   CVTS01+252                                               03667000
CVTTPIOS EQU   CVTS01+248                                               03668000
CVTRTMS  EQU   CVTS01+244                                               03669000
CVTSDBF  EQU   CVTS01+240                                               03670000
CVTSCBP  EQU   CVTS01+236                                               03671000
CVTSDMP  EQU   CVTS01+232                                               03672000
CVTSV60  EQU   CVTS01+228                                               03673000
CVTRTMCT EQU   CVTS01+224                                               03674000
CVTASCBL EQU   CVTS01+220                                               03675000
CVTASCBH EQU   CVTS01+216                                               03676000
CVTGDA   EQU   CVTS01+212                                               03677000
CVTASVT  EQU   CVTS01+208                                               03678000
CVTVVMDI EQU   CVTS01+204                                               03679000
CVTAQTOP EQU   CVTS01+200                                               03680000
CVTIOSCS EQU   CVTS01+196                                               03681000
CVTSDRM  EQU   CVTS01+192                                               03682000
CVTOPTE  EQU   CVTS01+188                                               03683000
CVTSTXU  EQU   CVTS01+184                                               03684000
CVTQUIS  EQU   CVTS01+180                                               03685000
CVTPARS  EQU   CVTS01+176                                               03686000
CVTS1EE  EQU   CVTS01+172                                               03687000
CVTFRAS  EQU   CVTS01+168                                               03688000
CVTQSAS  EQU   CVTS01+164                                               03689000
CVTCRAS  EQU   CVTS01+160                                               03690000
CVTCRMN  EQU   CVTS01+156                                               03691000
CVTDELCP EQU   CVTS01+152                                               03692000
CVTFRECL EQU   CVTS01+148                                               03693000
CVTGETCL EQU   CVTS01+144                                               03694000
CVTBLDCP EQU   CVTS01+140                                               03695000
CVTAUTHL EQU   CVTS01+136                                               03696000
CVTSCAN  EQU   CVTS01+132                                               03697000
CVTRV144 EQU   CVTS01+130                                               03698000
CVTMAXMP EQU   CVTS01+128                                               03699000
CVTSTCK  EQU   CVTS01+124                                               03700000
CVTRV139 EQU   CVTS01+123                                               03701000
CVTDSSAC EQU   CVTS01+122                                               03702000
CVTRV513 EQU   CVTS01+121                                               03703000
CVTIOSPL EQU   CVTS01+120                                               03704000
CVTPTGT  EQU   CVTS01+116                                               03705000
CVTCSPIE EQU   CVTS01+112                                               03706000
CVTSMFEX EQU   CVTS01+108                                               03707000
CVTOLT0A EQU   CVTS01+104                                               03708000
CVTSRBRT EQU   CVTS01+100                                               03709000
CVTPUTL  EQU   CVTS01+96                                                03710000
CVTASCRL EQU   CVTS01+92                                                03711000
CVTASCRF EQU   CVTS01+88                                                03712000
CVTRV326 EQU   CVTS01+84                                                03713000
CVTRV325 EQU   CVTS01+80                                                03714000
CVTRV324 EQU   CVTS01+76                                                03715000
CVT0VL01 EQU   CVTS01+72                                                03716000
CVTSHRVM EQU   CVTS01+68                                                03717000
CVTRV332 EQU   CVTS01+64                                                03718000
CVTTAS   EQU   CVTS01+60                                                03719000
CVTRSCN  EQU   CVTS01+56                                                03720000
CVTTRAC2 EQU   CVTS01+54                                                03721000
CVTTRACE EQU   CVTS01+52                                                03722000
CVTAPG   EQU   CVTS01+51                                                03723000
CVTSDTRC EQU   CVTCTLFG                                                 03724000
CVTGTRCE EQU   CVTCTLFG                                                 03725000
CVTNOMP  EQU   CVTCTLFG                                                 03726000
CVTRSV79 EQU   CVTCTLFG                                                 03727000
CVTDSTAT EQU   CVTCTLFG                                                 03728000
CVTRSV78 EQU   CVTCTLFG                                                 03729000
CVTRV333 EQU   CVTCTLFG                                                 03730000
CVTRV323 EQU   CVTCTLFG                                                 03731000
CVTSPVLK EQU   CVTS01+49                                                03732000
CVTRSV77 EQU   CVTS01+48                                                03733000
CVTRV331 EQU   CVTS01+44                                                03734000
CVTRV330 EQU   CVTS01+40                                                03735000
CVTRV329 EQU   CVTS01+36                                                03736000
CVTRV328 EQU   CVTS01+32                                                03737000
CVTRV322 EQU   CVTS01+28                                                03738000
CVTSLID  EQU   CVTSLIDA+1                                               03739000
CVTSYLK  EQU   CVTSLIDA                                                 03740000
CVTRV321 EQU   CVTS01+20                                                03741000
CVTRV320 EQU   CVTS01+16                                                03742000
CVTLPDIR EQU   CVTLPDIA+1                                               03743000
CVTRSV69 EQU   CVTDIRST                                                 03744000
CVTRSV68 EQU   CVTDIRST                                                 03745000
CVTRSV67 EQU   CVTDIRST                                                 03746000
CVTRSV66 EQU   CVTDIRST                                                 03747000
CVTRSV65 EQU   CVTDIRST                                                 03748000
CVTRSV64 EQU   CVTDIRST                                                 03749000
CVTRSV63 EQU   CVTDIRST                                                 03750000
CVTDICOM EQU   CVTDIRST                                                 03751000
CVTPVTP  EQU   CVTS01+8                                                 03752000
CVTLPDSR EQU   CVTS01+4                                                 03753000
CVTGETL  EQU   CVTS01                                                   03754000
DLRPLR15 EQU   DLRPLRSA+16                                              03755000
@NM00100 EQU   DLRPLRSA+8                                               03756000
TPMPLCID EQU   ISTTPMPL+16                                              03757000
TPMPLTXT EQU   ISTTPMPL+12                                              03758000
TPMPLRNF EQU   ISTTPMPL+8                                               03759000
TPMPLRBA EQU   ISTTPMPL+5                                               03760000
TPMPLRLN EQU   ISTTPMPL+4                                               03761000
TPMPLMID EQU   ISTTPMPL                                                 03762000
@NM00097 EQU   CVSSVARA+12                                              03763000
@NM00096 EQU   CVSSVARA                                                 03764000
@NM00084 EQU   GTNCSFLG                                                 03765000
GTNCSAPP EQU   GTNCSFLG                                                 03766000
GTNCSWKA EQU   GTNCSFLG                                                 03767000
VYCRSV02 EQU   ISTVYCRR+128                                             03768000
VYCRSV04 EQU   ISTVYCRR+126                                             03769000
VYCRRSAV EQU   ISTVYCRR+46                                              03770000
VYCRSV03 EQU   VYCCRT+11                                                03771000
CINCFE   EQU   VYCCRT+11                                                03772000
CINCE9   EQU   VYCCRT+11                                                03773000
CINCVO   EQU   VYCCRT+11                                                03774000
CINCR5   EQU   VYCCRT+11                                                03775000
CINCR3   EQU   VYCCRT+10                                                03776000
CINCE8   EQU   VYCCRT+10                                                03777000
CINCE7   EQU   VYCCRT+10                                                03778000
CINCE6   EQU   VYCCRT+10                                                03779000
CINCE5   EQU   VYCCRT+10                                                03780000
CINCE1   EQU   VYCCRT+10                                                03781000
CINCUQ   EQU   VYCCRT+10                                                03782000
CINCUB   EQU   VYCCRT+10                                                03783000
CINCUA   EQU   VYCCRT+9                                                 03784000
CINCX9   EQU   VYCCRT+9                                                 03785000
CINCX8   EQU   VYCCRT+9                                                 03786000
CINCX7   EQU   VYCCRT+9                                                 03787000
CINCX6   EQU   VYCCRT+9                                                 03788000
CINCX3   EQU   VYCCRT+9                                                 03789000
CINCX2   EQU   VYCCRT+9                                                 03790000
CINCX1   EQU   VYCCRT+9                                                 03791000
CINCX0   EQU   VYCCRT+8                                                 03792000
CINCW9   EQU   VYCCRT+8                                                 03793000
CINCW8   EQU   VYCCRT+8                                                 03794000
CINCW7   EQU   VYCCRT+8                                                 03795000
CINCW6   EQU   VYCCRT+8                                                 03796000
CINCW5   EQU   VYCCRT+8                                                 03797000
CINCW4   EQU   VYCCRT+8                                                 03798000
CINCW2   EQU   VYCCRT+8                                                 03799000
CINCW0   EQU   VYCCRT+7                                                 03800000
CINCV9   EQU   VYCCRT+7                                                 03801000
CINCV8   EQU   VYCCRT+7                                                 03802000
CINCV7   EQU   VYCCRT+7                                                 03803000
CINCV6   EQU   VYCCRT+7                                                 03804000
CINCV5   EQU   VYCCRT+7                                                 03805000
CINCV4   EQU   VYCCRT+7                                                 03806000
CINCV3   EQU   VYCCRT+7                                                 03807000
CINCV2   EQU   VYCCRT+6                                                 03808000
CINCU8   EQU   VYCCRT+6                                                 03809000
CINCU7   EQU   VYCCRT+6                                                 03810000
CINCU6   EQU   VYCCRT+6                                                 03811000
CINCU5   EQU   VYCCRT+6                                                 03812000
CINCU4   EQU   VYCCRT+6                                                 03813000
CINCU3   EQU   VYCCRT+6                                                 03814000
CINCU2   EQU   VYCCRT+6                                                 03815000
CINCU1   EQU   VYCCRT+5                                                 03816000
CINCU0   EQU   VYCCRT+5                                                 03817000
CINCUM   EQU   VYCCRT+5                                                 03818000
CINCS1   EQU   VYCCRT+5                                                 03819000
CINCL8   EQU   VYCCRT+5                                                 03820000
CINCL7   EQU   VYCCRT+5                                                 03821000
CINCL6   EQU   VYCCRT+5                                                 03822000
CINCL5   EQU   VYCCRT+5                                                 03823000
CINCL4   EQU   VYCCRT+4                                                 03824000
CINCL3   EQU   VYCCRT+4                                                 03825000
CINCL2   EQU   VYCCRT+4                                                 03826000
CINCL1   EQU   VYCCRT+4                                                 03827000
CINCL0   EQU   VYCCRT+4                                                 03828000
CINCF4   EQU   VYCCRT+4                                                 03829000
CINCF3   EQU   VYCCRT+4                                                 03830000
CINCF1   EQU   VYCCRT+4                                                 03831000
CINCFM   EQU   VYCCRT+3                                                 03832000
CINCE4   EQU   VYCCRT+3                                                 03833000
CINCE3   EQU   VYCCRT+3                                                 03834000
CINCE2   EQU   VYCCRT+3                                                 03835000
CINCE0   EQU   VYCCRT+3                                                 03836000
CINCD9   EQU   VYCCRT+3                                                 03837000
CINCD8   EQU   VYCCRT+3                                                 03838000
CINCD7   EQU   VYCCRT+3                                                 03839000
CINCD6   EQU   VYCCRT+2                                                 03840000
CINCD5   EQU   VYCCRT+2                                                 03841000
CINCD4   EQU   VYCCRT+2                                                 03842000
CINCD3   EQU   VYCCRT+2                                                 03843000
CINCD2   EQU   VYCCRT+2                                                 03844000
CINCD1   EQU   VYCCRT+2                                                 03845000
CINCIP   EQU   VYCCRT+2                                                 03846000
CINCR2   EQU   VYCCRT+2                                                 03847000
CINCMS   EQU   VYCCRT+1                                                 03848000
CINCVN   EQU   VYCCRT+1                                                 03849000
CINCVP   EQU   VYCCRT+1                                                 03850000
CINCVX   EQU   VYCCRT+1                                                 03851000
CINCFS   EQU   VYCCRT+1                                                 03852000
CINCSM   EQU   VYCCRT+1                                                 03853000
CINCR1   EQU   VYCCRT+1                                                 03854000
CINCLF   EQU   VYCCRT                                                   03855000
CINCVA   EQU   VYCCRT                                                   03856000
CINCVI   EQU   VYCCRT                                                   03857000
CINCMD   EQU   VYCCRT                                                   03858000
CINCMY   EQU   VYCCRT                                                   03859000
CINCDL   EQU   VYCCRT                                                   03860000
CINCIO   EQU   VYCCRT                                                   03861000
CINCCL   EQU   VYCCRT                                                   03862000
VYCRSV01 EQU   VYCNTRD+11                                               03863000
NINCFE   EQU   VYCNTRD+11                                               03864000
NINCE9   EQU   VYCNTRD+11                                               03865000
NINCVO   EQU   VYCNTRD+11                                               03866000
NINCR5   EQU   VYCNTRD+11                                               03867000
NINCR3   EQU   VYCNTRD+10                                               03868000
NINCE8   EQU   VYCNTRD+10                                               03869000
NINCE7   EQU   VYCNTRD+10                                               03870000
NINCE6   EQU   VYCNTRD+10                                               03871000
NINCE5   EQU   VYCNTRD+10                                               03872000
NINCE1   EQU   VYCNTRD+10                                               03873000
NINCUQ   EQU   VYCNTRD+10                                               03874000
NINCUB   EQU   VYCNTRD+10                                               03875000
NINCUA   EQU   VYCNTRD+9                                                03876000
NINCX9   EQU   VYCNTRD+9                                                03877000
NINCX8   EQU   VYCNTRD+9                                                03878000
NINCX7   EQU   VYCNTRD+9                                                03879000
NINCX6   EQU   VYCNTRD+9                                                03880000
NINCX3   EQU   VYCNTRD+9                                                03881000
NINCX2   EQU   VYCNTRD+9                                                03882000
NINCX1   EQU   VYCNTRD+9                                                03883000
NINCX0   EQU   VYCNTRD+8                                                03884000
NINCW9   EQU   VYCNTRD+8                                                03885000
NINCW8   EQU   VYCNTRD+8                                                03886000
NINCW7   EQU   VYCNTRD+8                                                03887000
NINCW6   EQU   VYCNTRD+8                                                03888000
NINCW5   EQU   VYCNTRD+8                                                03889000
NINCW4   EQU   VYCNTRD+8                                                03890000
NINCW2   EQU   VYCNTRD+8                                                03891000
NINCW0   EQU   VYCNTRD+7                                                03892000
NINCV9   EQU   VYCNTRD+7                                                03893000
NINCV8   EQU   VYCNTRD+7                                                03894000
NINCV7   EQU   VYCNTRD+7                                                03895000
NINCV6   EQU   VYCNTRD+7                                                03896000
NINCV5   EQU   VYCNTRD+7                                                03897000
NINCV4   EQU   VYCNTRD+7                                                03898000
NINCV3   EQU   VYCNTRD+7                                                03899000
NINCV2   EQU   VYCNTRD+6                                                03900000
NINCU8   EQU   VYCNTRD+6                                                03901000
NINCU7   EQU   VYCNTRD+6                                                03902000
NINCU6   EQU   VYCNTRD+6                                                03903000
NINCU5   EQU   VYCNTRD+6                                                03904000
NINCU4   EQU   VYCNTRD+6                                                03905000
NINCU3   EQU   VYCNTRD+6                                                03906000
NINCU2   EQU   VYCNTRD+6                                                03907000
NINCU1   EQU   VYCNTRD+5                                                03908000
NINCU0   EQU   VYCNTRD+5                                                03909000
NINCUM   EQU   VYCNTRD+5                                                03910000
NINCS1   EQU   VYCNTRD+5                                                03911000
NINCL8   EQU   VYCNTRD+5                                                03912000
NINCL7   EQU   VYCNTRD+5                                                03913000
NINCL6   EQU   VYCNTRD+5                                                03914000
NINCL5   EQU   VYCNTRD+5                                                03915000
NINCL4   EQU   VYCNTRD+4                                                03916000
NINCL3   EQU   VYCNTRD+4                                                03917000
NINCL2   EQU   VYCNTRD+4                                                03918000
NINCL1   EQU   VYCNTRD+4                                                03919000
NINCL0   EQU   VYCNTRD+4                                                03920000
NINCF4   EQU   VYCNTRD+4                                                03921000
NINCF3   EQU   VYCNTRD+4                                                03922000
NINCF1   EQU   VYCNTRD+4                                                03923000
NINCFM   EQU   VYCNTRD+3                                                03924000
NINCE4   EQU   VYCNTRD+3                                                03925000
NINCE3   EQU   VYCNTRD+3                                                03926000
NINCE2   EQU   VYCNTRD+3                                                03927000
NINCE0   EQU   VYCNTRD+3                                                03928000
NINCD9   EQU   VYCNTRD+3                                                03929000
NINCD8   EQU   VYCNTRD+3                                                03930000
NINCD7   EQU   VYCNTRD+3                                                03931000
NINCD6   EQU   VYCNTRD+2                                                03932000
NINCD5   EQU   VYCNTRD+2                                                03933000
NINCD4   EQU   VYCNTRD+2                                                03934000
NINCD3   EQU   VYCNTRD+2                                                03935000
NINCD2   EQU   VYCNTRD+2                                                03936000
NINCD1   EQU   VYCNTRD+2                                                03937000
NINCIP   EQU   VYCNTRD+2                                                03938000
NINCR2   EQU   VYCNTRD+2                                                03939000
NINCMS   EQU   VYCNTRD+1                                                03940000
NINCVN   EQU   VYCNTRD+1                                                03941000
NINCVP   EQU   VYCNTRD+1                                                03942000
NINCVX   EQU   VYCNTRD+1                                                03943000
NINCFS   EQU   VYCNTRD+1                                                03944000
NINCSM   EQU   VYCNTRD+1                                                03945000
NINCR1   EQU   VYCNTRD+1                                                03946000
NINCLF   EQU   VYCNTRD                                                  03947000
NINCVA   EQU   VYCNTRD                                                  03948000
NINCVI   EQU   VYCNTRD                                                  03949000
NINCMD   EQU   VYCNTRD                                                  03950000
NINCMY   EQU   VYCNTRD                                                  03951000
NINCDL   EQU   VYCNTRD                                                  03952000
NINCIO   EQU   VYCNTRD                                                  03953000
NINCCL   EQU   VYCNTRD                                                  03954000
VYCCNS   EQU   ISTVYCRR                                                 03955000
CNSRSV05 EQU   CNSTFLDB+2                                               03956000
CNSLOG0B EQU   CNSTFLDB+2                                               03957000
CNSACCTB EQU   CNSTFLDB+2                                               03958000
CNSFREEB EQU   CNSTFLDB+2                                               03959000
CNSGETSB EQU   CNSTFLDB+2                                               03960000
CNSSEARB EQU   CNSTFLDB+2                                               03961000
CNSQUEUB EQU   CNSTFLDB+2                                               03962000
CNSACONB EQU   CNSTFLDB+2                                               03963000
CNSTCONB EQU   CNSTFLDB+1                                               03964000
CNSCLAQB EQU   CNSTFLDB+1                                               03965000
CNSCLINB EQU   CNSTFLDB+1                                               03966000
CNSGBINB EQU   CNSTFLDB+1                                               03967000
CNSLGINB EQU   CNSTFLDB+1                                               03968000
CNSACINB EQU   CNSTFLDB+1                                               03969000
CNSPSINB EQU   CNSTFLDB+1                                               03970000
CNSRQRLB EQU   CNSTFLDB+1                                               03971000
CNSTRRLB EQU   CNSTFLDB                                                 03972000
CNSDORLB EQU   CNSTFLDB                                                 03973000
CNSRLINB EQU   CNSTFLDB                                                 03974000
CNSQREQB EQU   CNSTFLDB                                                 03975000
CNSXREQB EQU   CNSTFLDB                                                 03976000
CNSAQINB EQU   CNSTFLDB                                                 03977000
CNSAUTHB EQU   CNSTFLDB                                                 03978000
CNSMRINB EQU   CNSTFLDB                                                 03979000
CNSRSV01 EQU   CNSTFLDA+2                                               03980000
CNSLOG0A EQU   CNSTFLDA+2                                               03981000
CNSACCTA EQU   CNSTFLDA+2                                               03982000
CNSFREEA EQU   CNSTFLDA+2                                               03983000
CNSGETSA EQU   CNSTFLDA+2                                               03984000
CNSSEARA EQU   CNSTFLDA+2                                               03985000
CNSQUEUA EQU   CNSTFLDA+2                                               03986000
CNSACONA EQU   CNSTFLDA+2                                               03987000
CNSTCONA EQU   CNSTFLDA+1                                               03988000
CNSCLAQA EQU   CNSTFLDA+1                                               03989000
CNSCLINA EQU   CNSTFLDA+1                                               03990000
CNSGBINA EQU   CNSTFLDA+1                                               03991000
CNSLGINA EQU   CNSTFLDA+1                                               03992000
CNSACINA EQU   CNSTFLDA+1                                               03993000
CNSPSINA EQU   CNSTFLDA+1                                               03994000
CNSRQRLA EQU   CNSTFLDA+1                                               03995000
CNSTRRLA EQU   CNSTFLDA                                                 03996000
CNSDORLA EQU   CNSTFLDA                                                 03997000
CNSRLINA EQU   CNSTFLDA                                                 03998000
CNSQREQA EQU   CNSTFLDA                                                 03999000
CNSXREQA EQU   CNSTFLDA                                                 04000000
CNSAQINA EQU   CNSTFLDA                                                 04001000
CNSAUTHA EQU   CNSTFLDA                                                 04002000
CNSMRINA EQU   CNSTFLDA                                                 04003000
CNSTPFX  EQU   ISTCNSTA                                                 04004000
CRACHAIN EQU   ISTCRA+928                                               04005000
CRARSV02 EQU   ISTCRA+924                                               04006000
CRARSV01 EQU   ISTCRA+920                                               04007000
CRABFTBA EQU   CRABUFA                                                  04008000
CRAMASK  EQU   CRASVC+64                                                04009000
CRAHSIZ  EQU   CRASVC+60                                                04010000
CRAASCRR EQU   CRASVC                                                   04011000
CRAPROCR EQU   ISTCRA+312                                               04012000
CRAPSS   EQU   ISTCRA+160                                               04013000
CRARPH   EQU   ISTCRA+52                                                04014000
CRALAPTR EQU   CRABASIC+48                                              04015000
CRAL9PTR EQU   CRABASIC+44                                              04016000
CRAL8PTR EQU   CRABASIC+40                                              04017000
CRAL7PTR EQU   CRABASIC+36                                              04018000
CRAL6PTR EQU   CRABASIC+32                                              04019000
CRAL5PTR EQU   CRABASIC+28                                              04020000
CRAL4PTR EQU   CRABASIC+24                                              04021000
CRAL1PTR EQU   CRABASIC+12                                              04022000
CRALEV01 EQU   CRALKACT+3                                               04023000
CRALEV02 EQU   CRALKACT+3                                               04024000
CRALEV03 EQU   CRALKACT+3                                               04025000
CRALEV04 EQU   CRALKACT+3                                               04026000
CRALEV05 EQU   CRALKACT+3                                               04027000
CRALEV06 EQU   CRALKACT+3                                               04028000
CRALEV07 EQU   CRALKACT+3                                               04029000
CRALEV08 EQU   CRALKACT+3                                               04030000
CRALEV09 EQU   CRALKACT+2                                               04031000
CRALEV10 EQU   CRALKACT+2                                               04032000
CRALEV11 EQU   CRALKACT+2                                               04033000
CRALEV12 EQU   CRALKACT+2                                               04034000
CRALEV13 EQU   CRALKACT+2                                               04035000
CRALEV14 EQU   CRALKACT+2                                               04036000
CRALEV15 EQU   CRALKACT+2                                               04037000
CRALEV16 EQU   CRALKACT+2                                               04038000
CRALEV17 EQU   CRALKACT+1                                               04039000
CRALEV18 EQU   CRALKACT+1                                               04040000
CRALEV19 EQU   CRALKACT+1                                               04041000
CRALEV20 EQU   CRALKACT+1                                               04042000
CRALEV21 EQU   CRALKACT+1                                               04043000
CRALEV22 EQU   CRALKACT+1                                               04044000
CRALEV23 EQU   CRALKACT+1                                               04045000
CRALEV24 EQU   CRALKACT+1                                               04046000
CRALEV25 EQU   CRALKACT                                                 04047000
CRALEV26 EQU   CRALKACT                                                 04048000
CRALEV27 EQU   CRALKACT                                                 04049000
CRALEV28 EQU   CRALKACT                                                 04050000
CRALEV29 EQU   CRALKACT                                                 04051000
CRALEV30 EQU   CRALKACT                                                 04052000
CRALEV31 EQU   CRALKACT                                                 04053000
CRALEV32 EQU   CRALKACT                                                 04054000
CRAFRR   EQU   CRAHDR+4                                                 04055000
@NM00083 EQU   ISTAPCRR+137                                             04056000
@NM00082 EQU   APC57FLG                                                 04057000
APCNREL  EQU   APC57FLG                                                 04058000
APCRECRA EQU   APC57FLG                                                 04059000
@NM00081 EQU   APC54FLG                                                 04060000
APCRLST  EQU   APC54FLG                                                 04061000
APCPR153 EQU   APC53FLG                                                 04062000
@NM00080 EQU   APC52FLG                                                 04063000
APCWKF   EQU   APC52FLG                                                 04064000
APCNWF   EQU   APC52FLG                                                 04065000
APCRDQ   EQU   APC52FLG                                                 04066000
APCQENQ  EQU   APC52FLG                                                 04067000
APCSMSR  EQU   APC52FLG                                                 04068000
APCCKRQ  EQU   APC52FLG                                                 04069000
@NM00079 EQU   APC31FLG                                                 04070000
APCSORT  EQU   APC31FLG                                                 04071000
APCRESCH EQU   APC31FLG                                                 04072000
APCTPXIT EQU   APC31FLG                                                 04073000
APCSWTWD EQU   ISTAPCRR+128                                             04074000
APCSAV2  EQU   ISTAPCRR+124                                             04075000
APCSAV1  EQU   ISTAPCRR+120                                             04076000
APCRETCD EQU   APCCOMF+2                                                04077000
@NM00078 EQU   APCCOMF1+1                                               04078000
APCZLBER EQU   APCCOMF1                                                 04079000
APCEXIT  EQU   APCCOMF1                                                 04080000
APCRELR  EQU   APCCOMF1                                                 04081000
APCIRB2  EQU   APCCOMF1                                                 04082000
APCIRB1  EQU   APCCOMF1                                                 04083000
APCSMCR  EQU   APCCOMF1                                                 04084000
APCUETSK EQU   APCCOMF1                                                 04085000
APCSSTSK EQU   APCCOMF1                                                 04086000
APCESTAL EQU   APCSAVE                                                  04087000
APCFRRPM EQU   ISTAPCRR+40                                              04088000
APCQWFO  EQU   ISTAPCRR+36                                              04089000
APCPABSV EQU   ISTAPCRR+32                                              04090000
APCRTRN  EQU   ISTAPCRR+28                                              04091000
APCTCBA  EQU   ISTAPCRR+24                                              04092000
APCPSTA  EQU   ISTAPCRR+20                                              04093000
@NM00077 EQU   APCRFLG+1                                                04094000
APC31R   EQU   APCRFLG                                                  04095000
APC58R   EQU   APCRFLG                                                  04096000
APC57R   EQU   APCRFLG                                                  04097000
APC56R   EQU   APCRFLG                                                  04098000
APC54R   EQU   APCRFLG                                                  04099000
APC53R   EQU   APCRFLG                                                  04100000
APC52R   EQU   APCRFLG                                                  04101000
APC51R   EQU   APCRFLG                                                  04102000
@NM00076 EQU   APCATFLG+1                                               04103000
APC31E   EQU   APCATFLG                                                 04104000
APC58E   EQU   APCATFLG                                                 04105000
APC57E   EQU   APCATFLG                                                 04106000
APC56E   EQU   APCATFLG                                                 04107000
APC54E   EQU   APCATFLG                                                 04108000
APC53E   EQU   APCATFLG                                                 04109000
APC52E   EQU   APCATFLG                                                 04110000
APC51E   EQU   APCATFLG                                                 04111000
APCHDRSV EQU   ISTAPCRR                                                 04112000
ASCPSREG EQU   ISTASCRR+44                                              04113000
ASCUSR01 EQU   ASCUSRGS+12                                              04114000
ASCUSR00 EQU   ASCUSRGS+8                                               04115000
ASCUSR15 EQU   ASCUSRGS+4                                               04116000
ASCUSR14 EQU   ASCUSRGS                                                 04117000
ASCETRYA EQU   ISTASCRR+24                                              04118000
ASCKEY   EQU   ISTASCRR+23                                              04119000
ASCAUDIT EQU   ASCFLG3                                                  04120000
ASCFBDUD EQU   ASCFLG3                                                  04121000
ASCLLKF  EQU   ASCFLG3                                                  04122000
ASCKEYF  EQU   ASCFLG3                                                  04123000
ASCFBDAL EQU   ASCFLG3                                                  04124000
ASCFSRGT EQU   ASCFLG3                                                  04125000
ASCICR   EQU   ASCFLG2                                                  04126000
ASCFSRIC EQU   ASCFLG2                                                  04127000
ASCFBDIC EQU   ASCFLG2                                                  04128000
ASCFBAIC EQU   ASCFLG2                                                  04129000
ASCPASTR EQU   ASCFLG1                                                  04130000
ASCFSR   EQU   ASCFLG1                                                  04131000
ASCFBD   EQU   ASCFLG1                                                  04132000
ASCFBA   EQU   ASCFLG1                                                  04133000
ASCPFCRR EQU   ISTASCRR                                                 04134000
ZCRRU    EQU   ZCRRHRU+3                                                04135000
ZCRRH    EQU   ZCRRHRU                                                  04136000
ZCRWORDA EQU   ISTZCRR+477                                              04137000
ZCRCMNRC EQU   ISTZCRR+476                                              04138000
ZCRRSV97 EQU   ZCRENTER+18                                              04139000
ZCREIC2B EQU   ZCRENTER+18                                              04140000
ZCREAC2B EQU   ZCRENTER+18                                              04141000
ZCRELCAB EQU   ZCRENTER+18                                              04142000
ZCREDCMF EQU   ZCRENTER+18                                              04143000
ZCREBCIF EQU   ZCRENTER+18                                              04144000
ZCREICSG EQU   ZCRENTER+18                                              04145000
ZCREDCK0 EQU   ZCRENTER+18                                              04146000
ZCRECFY0 EQU   ZCRENTER+17                                              04147000
ZCREKCCB EQU   ZCRENTER+17                                              04148000
ZCREDCNB EQU   ZCRENTER+17                                              04149000
ZCREICOE EQU   ZCRENTER+17                                              04150000
ZCREBCNB EQU   ZCRENTER+17                                              04151000
ZCREBC0L EQU   ZCRENTER+17                                              04152000
ZCREBCAL EQU   ZCRENTER+17                                              04153000
ZCREDCQR EQU   ZCRENTER+17                                              04154000
ZCREDCPR EQU   ZCRENTER+16                                              04155000
ZCREBCSB EQU   ZCRENTER+16                                              04156000
ZCREAC1R EQU   ZCRENTER+16                                              04157000
ZCRECCCI EQU   ZCRENTER+16                                              04158000
ZCRECCAI EQU   ZCRENTER+16                                              04159000
ZCRECCBI EQU   ZCRENTER+16                                              04160000
ZCREBCAR EQU   ZCRENTER+16                                              04161000
ZCREBCDR EQU   ZCRENTER+16                                              04162000
ZCREBCBR EQU   ZCRENTER+15                                              04163000
ZCREDCXR EQU   ZCRENTER+15                                              04164000
ZCREDCWB EQU   ZCRENTER+15                                              04165000
ZCREDCWR EQU   ZCRENTER+15                                              04166000
ZCREKCCN EQU   ZCRENTER+15                                              04167000
ZCREKCBN EQU   ZCRENTER+15                                              04168000
ZCREKCBB EQU   ZCRENTER+15                                              04169000
ZCREJC0B EQU   ZCRENTER+15                                              04170000
ZCREJCDB EQU   ZCRENTER+14                                              04171000
ZCREJCCB EQU   ZCRENTER+14                                              04172000
ZCREJCBB EQU   ZCRENTER+14                                              04173000
ZCREJCAB EQU   ZCRENTER+14                                              04174000
ZCREIC1B EQU   ZCRENTER+14                                              04175000
ZCREIC0B EQU   ZCRENTER+14                                              04176000
ZCREICX0 EQU   ZCRENTER+14                                              04177000
ZCREICWB EQU   ZCRENTER+14                                              04178000
ZCREICVB EQU   ZCRENTER+13                                              04179000
ZCREICUB EQU   ZCRENTER+13                                              04180000
ZCREICTB EQU   ZCRENTER+13                                              04181000
ZCREICSC EQU   ZCRENTER+13                                              04182000
ZCREICSB EQU   ZCRENTER+13                                              04183000
ZCREICRB EQU   ZCRENTER+13                                              04184000
ZCREICQB EQU   ZCRENTER+13                                              04185000
ZCREICQA EQU   ZCRENTER+13                                              04186000
ZCREICOB EQU   ZCRENTER+12                                              04187000
ZCREICOA EQU   ZCRENTER+12                                              04188000
ZCREICNB EQU   ZCRENTER+12                                              04189000
ZCREICNA EQU   ZCRENTER+12                                              04190000
ZCREICMB EQU   ZCRENTER+12                                              04191000
ZCREICLB EQU   ZCRENTER+12                                              04192000
ZCREICKG EQU   ZCRENTER+12                                              04193000
ZCREICKE EQU   ZCRENTER+12                                              04194000
ZCREICKB EQU   ZCRENTER+11                                              04195000
ZCREICJB EQU   ZCRENTER+11                                              04196000
ZCREICID EQU   ZCRENTER+11                                              04197000
ZCREICIB EQU   ZCRENTER+11                                              04198000
ZCREICHB EQU   ZCRENTER+11                                              04199000
ZCREICGB EQU   ZCRENTER+11                                              04200000
ZCREICEB EQU   ZCRENTER+11                                              04201000
ZCREICDB EQU   ZCRENTER+11                                              04202000
ZCREICCI EQU   ZCRENTER+10                                              04203000
ZCREICCB EQU   ZCRENTER+10                                              04204000
ZCREICBI EQU   ZCRENTER+10                                              04205000
ZCREICBB EQU   ZCRENTER+10                                              04206000
ZCREICAB EQU   ZCRENTER+10                                              04207000
ZCREICAA EQU   ZCRENTER+10                                              04208000
ZCREHCAN EQU   ZCRENTER+10                                              04209000
ZCREGC0B EQU   ZCRENTER+10                                              04210000
ZCREGC0A EQU   ZCRENTER+9                                               04211000
ZCREGCLA EQU   ZCRENTER+9                                               04212000
ZCREGCEB EQU   ZCRENTER+9                                               04213000
ZCREGCDB EQU   ZCRENTER+9                                               04214000
@NM00075 EQU   ZCRENTER+9                                               04215000
ZCREGCBB EQU   ZCRENTER+9                                               04216000
ZCREGCAB EQU   ZCRENTER+9                                               04217000
ZCREFCEB EQU   ZCRENTER+9                                               04218000
ZCREFCEA EQU   ZCRENTER+8                                               04219000
ZCREECTA EQU   ZCRENTER+8                                               04220000
ZCREECEA EQU   ZCRENTER+8                                               04221000
ZCREECDA EQU   ZCRENTER+8                                               04222000
ZCREECCB EQU   ZCRENTER+8                                               04223000
ZCREECCA EQU   ZCRENTER+8                                               04224000
ZCREECBB EQU   ZCRENTER+8                                               04225000
ZCREECBA EQU   ZCRENTER+8                                               04226000
ZCREDCMB EQU   ZCRENTER+7                                               04227000
ZCREDCL0 EQU   ZCRENTER+7                                               04228000
ZCREDCKB EQU   ZCRENTER+7                                               04229000
ZCREDCKA EQU   ZCRENTER+7                                               04230000
ZCREDCJ0 EQU   ZCRENTER+7                                               04231000
ZCREDCI0 EQU   ZCRENTER+7                                               04232000
ZCREDCH0 EQU   ZCRENTER+7                                               04233000
ZCREDCF0 EQU   ZCRENTER+7                                               04234000
ZCREDCE0 EQU   ZCRENTER+6                                               04235000
ZCREDCD0 EQU   ZCRENTER+6                                               04236000
ZCREDCC0 EQU   ZCRENTER+6                                               04237000
ZCREDCB0 EQU   ZCRENTER+6                                               04238000
ZCREDCA0 EQU   ZCRENTER+6                                               04239000
ZCRECC2B EQU   ZCRENTER+6                                               04240000
ZCRECC1B EQU   ZCRENTER+6                                               04241000
ZCRECC1A EQU   ZCRENTER+6                                               04242000
ZCRECC0B EQU   ZCRENTER+5                                               04243000
ZCRECC0A EQU   ZCRENTER+5                                               04244000
ZCREBC0B EQU   ZCRENTER+5                                               04245000
ZCREBC0A EQU   ZCRENTER+5                                               04246000
ZCREBCZ0 EQU   ZCRENTER+5                                               04247000
ZCREBCY0 EQU   ZCRENTER+5                                               04248000
ZCREBCX0 EQU   ZCRENTER+5                                               04249000
ZCREBCXA EQU   ZCRENTER+5                                               04250000
ZCREBCSC EQU   ZCRENTER+4                                               04251000
ZCREBCRB EQU   ZCRENTER+4                                               04252000
ZCREBCRA EQU   ZCRENTER+4                                               04253000
ZCREBCQB EQU   ZCRENTER+4                                               04254000
ZCREBCPB EQU   ZCRENTER+4                                               04255000
ZCREBCOB EQU   ZCRENTER+4                                               04256000
ZCREBCNE EQU   ZCRENTER+4                                               04257000
ZCREBCND EQU   ZCRENTER+4                                               04258000
ZCREBCMB EQU   ZCRENTER+3                                               04259000
ZCREBCLB EQU   ZCRENTER+3                                               04260000
ZCREBCLA EQU   ZCRENTER+3                                               04261000
ZCREBCKB EQU   ZCRENTER+3                                               04262000
ZCREBCKA EQU   ZCRENTER+3                                               04263000
ZCREBCJB EQU   ZCRENTER+3                                               04264000
ZCREBCJA EQU   ZCRENTER+3                                               04265000
ZCREBCID EQU   ZCRENTER+3                                               04266000
ZCREBCIB EQU   ZCRENTER+2                                               04267000
ZCREBCIA EQU   ZCRENTER+2                                               04268000
ZCREBCHB EQU   ZCRENTER+2                                               04269000
ZCREBCHA EQU   ZCRENTER+2                                               04270000
ZCREBCGB EQU   ZCRENTER+2                                               04271000
ZCREBCGA EQU   ZCRENTER+2                                               04272000
ZCREBCFB EQU   ZCRENTER+2                                               04273000
ZCREBCFA EQU   ZCRENTER+2                                               04274000
ZCREBCEB EQU   ZCRENTER+1                                               04275000
ZCREBCDI EQU   ZCRENTER+1                                               04276000
ZCREBCCB EQU   ZCRENTER+1                                               04277000
ZCREBCBI EQU   ZCRENTER+1                                               04278000
ZCREBCBB EQU   ZCRENTER+1                                               04279000
ZCREBCBA EQU   ZCRENTER+1                                               04280000
ZCREBCAM EQU   ZCRENTER+1                                               04281000
ZCREBCAI EQU   ZCRENTER+1                                               04282000
ZCREBCAG EQU   ZCRENTER                                                 04283000
ZCREBCAE EQU   ZCRENTER                                                 04284000
ZCREBCAB EQU   ZCRENTER                                                 04285000
ZCREBCAA EQU   ZCRENTER                                                 04286000
ZCREAC1B EQU   ZCRENTER                                                 04287000
ZCREAC0B EQU   ZCRENTER                                                 04288000
ZCREAC0A EQU   ZCRENTER                                                 04289000
ZCREAC1A EQU   ZCRENTER                                                 04290000
ZCRTNAME EQU   ZCRAUDIT+1                                               04291000
ZCRTID   EQU   ZCRAUDIT                                                 04292000
ZCRREMIC EQU   ISTZCRR+436                                              04293000
ZCRSAVEZ EQU   ISTZCRR+196                                              04294000
ZCRDAFSV EQU   ZCRCIDSV+2                                               04295000
ZCRSAFSV EQU   ZCRCIDSV                                                 04296000
ZCRR13SV EQU   ISTZCRR+188                                              04297000
ZCRR2SV  EQU   ISTZCRR+184                                              04298000
ZCROPCDE EQU   ISTZCRR+183                                              04299000
ZCRPRMTC EQU   ISTZCRR+182                                              04300000
ZCRRCDSV EQU   ISTZCRR+181                                              04301000
ZCRAWQSW EQU   ISTZCRR+180                                              04302000
ZCRTOPQ  EQU   ISTZCRR+180                                              04303000
ZCRLSTFB EQU   ISTZCRR+180                                              04304000
ZCRXSCHD EQU   ISTZCRR+180                                              04305000
ZCRNXTEL EQU   ISTZCRR+180                                              04306000
ZCRSCANQ EQU   ISTZCRR+180                                              04307000
ZCRMOREL EQU   ISTZCRR+180                                              04308000
ZCRFBPRC EQU   ISTZCRR+180                                              04309000
ZCRFSBSV EQU   ISTZCRR+176                                              04310000
ZCRSVWK5 EQU   ZCRWKARA+16                                              04311000
ZCRSVWK4 EQU   ZCRWKARA+12                                              04312000
ZCRSVWK3 EQU   ZCRWKARA+8                                               04313000
ZCRSVWK2 EQU   ZCRWKARA+4                                               04314000
ZCRSVWK1 EQU   ZCRWKARA                                                 04315000
ZCRSVF25 EQU   ZCRSVRTN+96                                              04316000
ZCRSVF24 EQU   ZCRSVRTN+92                                              04317000
ZCRSVF23 EQU   ZCRSVRTN+88                                              04318000
ZCRSVF22 EQU   ZCRSVRTN+84                                              04319000
ZCRSVF21 EQU   ZCRSVRTN+80                                              04320000
ZCRSVF20 EQU   ZCRSVRTN+76                                              04321000
ZCRSVF19 EQU   ZCRSVRTN+72                                              04322000
ZCRSVF18 EQU   ZCRSVRTN+68                                              04323000
ZCRSVF17 EQU   ZCRSVRTN+64                                              04324000
ZCRSVF16 EQU   ZCRSVRTN+60                                              04325000
ZCRSVF15 EQU   ZCRSVRTN+56                                              04326000
ZCRSVF14 EQU   ZCRSVRTN+52                                              04327000
ZCRSVF13 EQU   ZCRSVRTN+48                                              04328000
ZCRSVF12 EQU   ZCRSVRTN+44                                              04329000
ZCRSVF11 EQU   ZCRSVRTN+40                                              04330000
ZCRSVF10 EQU   ZCRSVRTN+36                                              04331000
ZCRSVF9  EQU   ZCRSVRTN+32                                              04332000
ZCRSVF8  EQU   ZCRSVRTN+28                                              04333000
ZCRSVF7  EQU   ZCRSVRTN+24                                              04334000
ZCRSVF6  EQU   ZCRSVRTN+20                                              04335000
ZCRSVF5  EQU   ZCRSVRTN+16                                              04336000
ZCRSVF4  EQU   ZCRSVRTN+12                                              04337000
ZCRSVF3  EQU   ZCRSVRTN+8                                               04338000
ZCRSVF2  EQU   ZCRSVRTN+4                                               04339000
ZCRSVF1  EQU   ZCRSVRTN                                                 04340000
ZCRPVZB  EQU   ISTZCRR+52                                               04341000
ZCRZLB   EQU   ISTZCRR+48                                               04342000
ZCRBFPTR EQU   ISTZCRR+44                                               04343000
ZCRCCWA  EQU   ISTZCRR+40                                               04344000
ZCRPSW   EQU   ZCRPARMS+15                                              04345000
ZCRPCHAR EQU   ZCRPARMS+14                                              04346000
ZCRPRES2 EQU   ZCRPCOD2                                                 04347000
ZCRPMFGF EQU   ZCRPCOD2                                                 04348000
ZCRPFHDR EQU   ZCRPCOD2                                                 04349000
ZCRPPG2  EQU   ZCRPCOD2                                                 04350000
ZCRPRES  EQU   ZCRPCOD1                                                 04351000
ZCRPCFTX EQU   ZCRPCOD1                                                 04352000
ZCRPBUF  EQU   ZCRPCOD1                                                 04353000
ZCRPLSCB EQU   ZCRPCOD1                                                 04354000
ZCRPLSBQ EQU   ZCRPLSBF                                                 04355000
ZCRPFSB  EQU   ZCRPCOD1                                                 04356000
ZCRPLNG  EQU   ZCRPCOD1                                                 04357000
ZCRPPG   EQU   ZCRPCOD1                                                 04358000
ZCRDTODA EQU   ZCRDFRDA                                                 04359000
ZCRMLNG  EQU   ZCRPARMS+8                                               04360000
ZCRTBPTR EQU   ZCRPARMS+4                                               04361000
ZCRCBPTR EQU   ZCRFBPTR                                                 04362000
ZCRCRLCP EQU   ISTZCRR+20                                               04363000
@NM00074 EQU   ZCRSCPSW                                                 04364000
ZCRSKIPT EQU   ZCRSCPSW                                                 04365000
ZCRFSBWE EQU   ZCRSCPSW                                                 04366000
ZCRPRCMP EQU   ZCRSCPSW                                                 04367000
ZCRLREQ  EQU   ZCRSCPSW                                                 04368000
ZCRRJLCP EQU   ZCRSCPSW                                                 04369000
ZCRTPINV EQU   ZCRSCPSW                                                 04370000
ZCRTPEX  EQU   ZCRSCPSW                                                 04371000
@NM00073 EQU   ZCRIBPR                                                  04372000
ZCR3270R EQU   ZCRIBPR                                                  04373000
ZCR3270  EQU   ZCRIBPR                                                  04374000
ZCRLCPFD EQU   ZCRIBPR                                                  04375000
ZCRLCPFR EQU   ZCRIBPR                                                  04376000
ZCRRELK  EQU   ZCRIBPR                                                  04377000
ZCRERR   EQU   ZCRIBPR                                                  04378000
ZCRNOBUF EQU   ZCRIBPR                                                  04379000
@NM00072 EQU   ZCRPFLGS                                                 04380000
ZCRQAHED EQU   ZCRPFLGS                                                 04381000
ZCRF1RES EQU   ZCRGENSW                                                 04382000
ZCRBRIS  EQU   ZCRGENSW                                                 04383000
ZCRCLRBD EQU   ZCRGENSW                                                 04384000
ZCREXRES EQU   ZCRGENSW                                                 04385000
ZCRLCSYN EQU   ZCRGENSW                                                 04386000
ZCRRT06  EQU   ZCRGENSW                                                 04387000
ZCRTSW2  EQU   ZCRGENSW                                                 04388000
ZCRTSW1  EQU   ZCRGENSW                                                 04389000
ZCRINLCP EQU   ZCRFLGS3                                                 04390000
ZCRWRPTR EQU   ZCRFLGS3                                                 04391000
ZCRNOFRE EQU   ZCRFLGS3                                                 04392000
ZCREDRIV EQU   ZCRFLGS3                                                 04393000
ZCRDISC  EQU   ZCRFLGS3                                                 04394000
ZCRTPDIS EQU   ZCRFLGS3                                                 04395000
ZCRTPCON EQU   ZCRFLGS3                                                 04396000
ZCRTIC   EQU   ZCRFLGS3                                                 04397000
ZCRCNLXL EQU   ZCRRESET                                                 04398000
ZCRENDAN EQU   ZCRSWFLD                                                 04399000
ZCRENDXL EQU   ZCRSWFLD                                                 04400000
ZCRENDX  EQU   ZCRSWFLD                                                 04401000
ZCROB1   EQU   ZCRNDLCP                                                 04402000
ZCRENDPR EQU   ZCRSWFLD                                                 04403000
ZCREXTYP EQU   ZCRSWFLD                                                 04404000
ZCRSLCP  EQU   ZCRENDSH                                                 04405000
ZCRIF0E3 EQU   ZCRFLGS2                                                 04406000
ZCRIF0E2 EQU   ZCRFLGS2                                                 04407000
ZCRIF0E1 EQU   ZCRFLGS2                                                 04408000
ZCROB    EQU   ZCRFLGS2                                                 04409000
ZCRFMSED EQU   ZCRFLGS2                                                 04410000
ZCRSHEDI EQU   ZCRFLGS2                                                 04411000
ZCRLOCAL EQU   ZCRFLGS2                                                 04412000
ZCRFEXIT EQU   ZCRFLGS1                                                 04413000
ZCRUNSOL EQU   ZCRFLGS1                                                 04414000
ZCRENDLP EQU   ZCRFLGS1                                                 04415000
ZCRNRMEX EQU   ZCRFLGS1                                                 04416000
ZCRWAIT  EQU   ZCRFLGS1                                                 04417000
ZCRDEQSW EQU   ZCRFLGS1                                                 04418000
ZCRQUESW EQU   ZCRFLGS1                                                 04419000
ZCREXSW  EQU   ZCRFLGS1                                                 04420000
ZCRFRRA  EQU   ISTZCRR+8                                                04421000
ZCRCHAIN EQU   ISTZCRR+4                                                04422000
ZCRFLAG  EQU   ZCRCRR+3                                                 04423000
ZCRLEN   EQU   ZCRCRR+1                                                 04424000
ZCRID    EQU   ZCRCRR                                                   04425000
CCFRSVD1 EQU   CFCCRT                                                   04426000
CCFCR2   EQU   CFCCRT                                                   04427000
CCFCRP   EQU   CFCCRT                                                   04428000
CCFCR1   EQU   CFCCRT                                                   04429000
CCFCS2   EQU   CFCCRT                                                   04430000
CCFCS1   EQU   CFCCRT                                                   04431000
NCFRSVD  EQU   CFCNTRD                                                  04432000
NCFCR2   EQU   CFCNTRD                                                  04433000
NCFCRP   EQU   CFCNTRD                                                  04434000
NCFCR1   EQU   CFCNTRD                                                  04435000
NCFCS2   EQU   CFCNTRD                                                  04436000
NCFCS1   EQU   CFCNTRD                                                  04437000
PFCRSV01 EQU   ISTPFCRR+13                                              04438000
PFCFTA   EQU   ISTPFCRR+12                                              04439000
CRRFRR   EQU   PFCFRRO                                                  04440000
CRRCHAIN EQU   PFCCRRO                                                  04441000
CRRLEN   EQU   PFCCRRLN                                                 04442000
PFCRSV10 EQU   PFCCRR+1                                                 04443000
CRRID    EQU   PFCCRRID                                                 04444000
ZSAZTRAC EQU   ISTZSAVE+36                                              04445000
ZSAZSVVR EQU   ISTZSAVE+12                                              04446000
ZSAZSVRR EQU   ISTZSAVE+8                                               04447000
ZSAZSVFC EQU   ISTZSAVE+4                                               04448000
ZSAZACTV EQU   ZSAZSVMS                                                 04449000
LCPFTYPE EQU   LCPRPHA                                                  04450000
LCPRSTQH EQU   LCPLCCW                                                  04451000
LCPCLREP EQU   ISTLCPB+44                                               04452000
LCPUBFSB EQU   LCPFLCCW                                                 04453000
LCPRSV77 EQU   ISTLCPB+39                                               04454000
LCPLCCWC EQU   ISTLCPB+38                                               04455000
LCPRSV78 EQU   LCPFLG1                                                  04456000
LCPTRANS EQU   LCPFLG1                                                  04457000
LCPSTLB  EQU   LCPFLG1                                                  04458000
LCPREDRV EQU   LCPFLG1                                                  04459000
LCPDIRPT EQU   LCPFLG1                                                  04460000
LCPINTER EQU   LCPFLG1                                                  04461000
LCPRESET EQU   LCPFLG1                                                  04462000
LCPSTYPE EQU   ISTLCPB+36                                               04463000
LCPFSNCH EQU   ISTLCPB+34                                               04464000
LCPFOSN  EQU   ISTLCPB+32                                               04465000
LCPTLBAD EQU   ISTLCPB+28                                               04466000
LCPFDB2  EQU   LCPFDBA+1                                                04467000
LCPFDB1  EQU   LCPFDBA                                                  04468000
LCPNXLCW EQU   ISTLCPB+20                                               04469000
LCPDAF   EQU   LCPCID+2                                                 04470000
LCPSAF   EQU   LCPCID                                                   04471000
LCPLCCW1 EQU   ISTLCPB+12                                               04472000
LCPRRCNT EQU   LCPSEQ+1                                                 04473000
LCPRRCCT EQU   LCPSEQ                                                   04474000
LCPATOP  EQU   LCPFLAG2                                                 04475000
LCPFREE  EQU   LCPFLAG2                                                 04476000
LCPDSTAT EQU   LCPFLAG2                                                 04477000
LCPEXRES EQU   LCPFID0                                                  04478000
LCPZRIMM EQU   LCPTLBPI                                                 04479000
LCPRSTRT EQU   LCPFLAG2                                                 04480000
LCPASYN  EQU   LCPFLAG2                                                 04481000
LCPPRFLG EQU   LCPFLAG2                                                 04482000
LCPZMIRC EQU   LCPRUCNT                                                 04483000
LCPCHAI2 EQU   LCPCHAIN+1                                               04484000
LCPCHNG  EQU   LCPCHAI1                                                 04485000
LCPZRT0B EQU   LCPMNRCD                                                 04486000
LCPZRT0A EQU   LCPMNRCD                                                 04487000
LCPZRTL9 EQU   LCPZRT09                                                 04488000
LCPZRTL8 EQU   LCPZRT08                                                 04489000
LCPZRTL7 EQU   LCPZRT07                                                 04490000
LCPZRTL6 EQU   LCPZRT06                                                 04491000
LCPZRTL5 EQU   LCPZRT05                                                 04492000
LCPZRTL4 EQU   LCPZRT04                                                 04493000
LCPZRTL3 EQU   LCPZRT03                                                 04494000
LCPZRTL2 EQU   LCPZRT02                                                 04495000
LCPZRT01 EQU   LCPFLAGS                                                 04496000
LCPZRT00 EQU   LCPFLAGS                                                 04497000
LCPLNGTH EQU   ISTLCPB+1                                                04498000
LCPTYPE  EQU   ISTLCPB                                                  04499000
LCCWDATA EQU   ISTLCCW+4                                                04500000
LCCWCNT  EQU   ISTLCCW+2                                                04501000
LCCWACI  EQU   LCCWFLAG                                                 04502000
LCCWRFI  EQU   LCCWFLAG                                                 04503000
LCCWPER  EQU   LCCWLSI                                                  04504000
LCCWIDAT EQU   LCCWFLAG                                                 04505000
LCCWNTVC EQU   LCCWFLAG                                                 04506000
LCCWCKPT EQU   LCCWFLAG                                                 04507000
LCCWCC   EQU   LCCWFLAG                                                 04508000
LCCWCD   EQU   LCCWFLAG                                                 04509000
LCCWTYPE EQU   LCCWCTL                                                  04510000
LCCWMODE EQU   LCCWCTL                                                  04511000
LCCWSOP  EQU   LCCWRWOP                                                 04512000
@NM00071 EQU   LCCWRWOP                                                 04513000
LCCWSD   EQU   LCCWOP                                                   04514000
LCCWSI   EQU   LCCWOP                                                   04515000
CONUESBF EQU   ISTCONFT+1362                                            04516000
CONSTVAR EQU   CONSTAID+1                                               04517000
CONSTFIL EQU   CONSTAID                                                 04518000
CONBLKNO EQU   CONSCPID+2                                               04519000
CONFILL  EQU   CONSCPID+1                                               04520000
CONFCNL  EQU   CONSCPID                                                 04521000
CONF01SV EQU   ISTCONFT+1352                                            04522000
CONSDMLC EQU   ISTCONFT+1348                                            04523000
CONSDECB EQU   ISTCONFT+1344                                            04524000
CONUNITS EQU   ISTCONFT+1342                                            04525000
CONRVPT1 EQU   ISTCONFT+1341                                            04526000
CONGLBBH EQU   ISTCONFT+1340                                            04527000
CONRSV24 EQU   ISTCONFT+1312                                            04528000
CONFTTAT EQU   ISTCONFT+1284                                            04529000
CONFXXAT EQU   ISTCONFT+1256                                            04530000
CONFLDAT EQU   ISTCONFT+1228                                            04531000
CONFTRAT EQU   ISTCONFT+1200                                            04532000
CONFNSAT EQU   ISTCONFT+1172                                            04533000
CONCSCB  EQU   ISTCONFT+1168                                            04534000
CONRSV50 EQU   ISTCONFT+1166                                            04535000
CONLIST  EQU   ISTCONFT+1164                                            04536000
CONSTAFP EQU   ISTCONFT+1160                                            04537000
CONECDET EQU   ISTCONFT+1156                                            04538000
CONRECON EQU   ISTCONFT+1036                                            04539000
CONNTSOL EQU   ISTCONFT+916                                             04540000
CONTRACE EQU   ISTCONFT+796                                             04541000
CONTOLTP EQU   ISTCONFT+676                                             04542000
CONVVTAM EQU   ISTCONFT+556                                             04543000
CONVTHDR EQU   ISTCONFT+420                                             04544000
CONRSV01 EQU   ISTCONFT+417                                             04545000
CONNSNEC EQU   CONFLG01                                                 04546000
CONFTPSA EQU   CONFLG01                                                 04547000
CONFTTA  EQU   CONFLG01                                                 04548000
CONFTNSA EQU   CONFLG01                                                 04549000
CONFTNAC EQU   CONFLG01                                                 04550000
CONFTEXS EQU   CONFLG01                                                 04551000
CONFTTMR EQU   CONFLG01                                                 04552000
CONFTSTM EQU   CONFLG01                                                 04553000
CONCRPLD EQU   ISTCONFT+404                                             04554000
CONPPDBF EQU   ISTCONFT+392                                             04555000
CONNPDBF EQU   ISTCONFT+380                                             04556000
CONAPDBF EQU   ISTCONFT+368                                             04557000
CONWPDBF EQU   ISTCONFT+356                                             04558000
CONIODBF EQU   ISTCONFT+344                                             04559000
CONUEDBF EQU   ISTCONFT+332                                             04560000
CONVPDBF EQU   ISTCONFT+320                                             04561000
CONVFDBF EQU   ISTCONFT+308                                             04562000
CONLPDBF EQU   ISTCONFT+296                                             04563000
CONLFDBF EQU   ISTCONFT+284                                             04564000
CONSPDBF EQU   ISTCONFT+272                                             04565000
CONSFDBF EQU   ISTCONFT+260                                             04566000
CONCRPLS EQU   ISTCONFT+248                                             04567000
CONPPSBF EQU   ISTCONFT+236                                             04568000
CONNPSBF EQU   ISTCONFT+224                                             04569000
CONAPSBF EQU   ISTCONFT+212                                             04570000
CONWPSBF EQU   ISTCONFT+200                                             04571000
CONIOSBF EQU   ISTCONFT+188                                             04572000
CONVPSBF EQU   ISTCONFT+176                                             04573000
CONVFSBF EQU   ISTCONFT+164                                             04574000
CONLPSBF EQU   ISTCONFT+152                                             04575000
CONLFSBF EQU   ISTCONFT+140                                             04576000
CONSPSBF EQU   ISTCONFT+128                                             04577000
CONSFSBF EQU   ISTCONFT+116                                             04578000
CONRSV17 EQU   ISTCONFT+115                                             04579000
CONCRPL  EQU   CONBUFF+1                                                04580000
CONPPEX  EQU   CONBUFF+1                                                04581000
CONNPEX  EQU   CONBUFF+1                                                04582000
CONAPEX  EQU   CONBUFF+1                                                04583000
CONWPEX  EQU   CONBUFF+1                                                04584000
CONIOEX  EQU   CONBUFF                                                  04585000
CONUECB  EQU   CONBUFF                                                  04586000
CONVPEX  EQU   CONBUFF                                                  04587000
CONVFEX  EQU   CONBUFF                                                  04588000
CONLPEX  EQU   CONBUFF                                                  04589000
CONLFEX  EQU   CONBUFF                                                  04590000
CONSPEX  EQU   CONBUFF                                                  04591000
CONSFEX  EQU   CONBUFF                                                  04592000
CONACTV  EQU   CONSTAT                                                  04593000
CONVRYIN EQU   CONSTAT                                                  04594000
CONLODED EQU   CONSTAT                                                  04595000
CONDSOPN EQU   CONSTAT                                                  04596000
CONSTOR  EQU   CONSTAT                                                  04597000
@NM00070 EQU   CONSTAT                                                  04598000
@NM00069 EQU   CONSTAT                                                  04599000
@NM00068 EQU   CONSTAT                                                  04600000
CONIOTR  EQU   CONOPTFL                                                 04601000
CONMODTR EQU   CONOPTFL                                                 04602000
CONBTUTR EQU   CONOPTFL                                                 04603000
CONBUFTR EQU   CONOPTFL                                                 04604000
@NM00067 EQU   CONOPTFL                                                 04605000
@NM00066 EQU   CONOPTFL                                                 04606000
@NM00065 EQU   CONOPTFL                                                 04607000
CONWRMST EQU   CONOPTFL                                                 04608000
CONSYLST EQU   CONDSFLG                                                 04609000
CONSYLIB EQU   CONDSFLG                                                 04610000
CONSYOBJ EQU   CONDSFLG                                                 04611000
@NM00064 EQU   CONDSFLG                                                 04612000
@NM00063 EQU   CONDSFLG                                                 04613000
@NM00062 EQU   CONDSFLG                                                 04614000
CONMODFY EQU   ISTCONFT+109                                             04615000
CONDISPL EQU   ISTCONFT+108                                             04616000
CONVARY  EQU   ISTCONFT+107                                             04617000
CONHLTS  EQU   CONHALT                                                  04618000
CONHLTQ  EQU   CONHALT                                                  04619000
CONLAST  EQU   ISTCONFT+105                                             04620000
CONRES2  EQU   ISTCONFT+104                                             04621000
CONCID   EQU   ISTCONFT+102                                             04622000
CONBUFSZ EQU   ISTCONFT+100                                             04623000
CONRSV02 EQU   ISTCONFT+96                                              04624000
CONDCBBA EQU   ISTCONFT+92                                              04625000
CONDCBLA EQU   ISTCONFT+88                                              04626000
CONDCBOA EQU   ISTCONFT+84                                              04627000
CONLDPRM EQU   ISTCONFT+80                                              04628000
CONRDBUF EQU   ISTCONFT+76                                              04629000
CONSTCIB EQU   ISTCONFT+72                                              04630000
CONENDLA EQU   ISTCONFT+68                                              04631000
CONVARLA EQU   ISTCONFT+64                                              04632000
CONMODLA EQU   ISTCONFT+60                                              04633000
CONHLTLA EQU   ISTCONFT+56                                              04634000
CONNCSLA EQU   ISTCONFT+52                                              04635000
CONDISLA EQU   ISTCONFT+48                                              04636000
CONCIBAD EQU   ISTCONFT+44                                              04637000
CONACB   EQU   ISTCONFT+40                                              04638000
CONFBPNM EQU   ISTCONFT+32                                              04639000
CONDMNM  EQU   ISTCONFT+24                                              04640000
CONAPSNM EQU   ISTCONFT+16                                              04641000
CONAPINM EQU   ISTCONFT+8                                               04642000
CONCONFG EQU   ISTCONFT                                                 04643000
LDPTCEP  EQU   ISTLDPRM+24                                              04644000
LDPRSV02 EQU   ISTLDPRM+22                                              04645000
LDPRSV01 EQU   LDPFB2                                                   04646000
LDPACTIF EQU   LDPFB2                                                   04647000
LDPATACH EQU   LDPFB2                                                   04648000
LDPFLAST EQU   LDPFB2                                                   04649000
LDPRSV03 EQU   LDPFG                                                    04650000
LDPPB    EQU   LDPFG                                                    04651000
LDPFX    EQU   LDPFG                                                    04652000
LDPDCBA  EQU   ISTLDPRM+16                                              04653000
LDPPDS   EQU   ISTLDPRM+8                                               04654000
LDPMBR   EQU   ISTLDPRM                                                 04655000
ISTPDAVP EQU   ISTAVT+40                                                04656000
ISTAVR01 EQU   ISTAVT+38                                                04657000
ISTVTTP  EQU   ISTAVT+36                                                04658000
ISTAGTWT EQU   ISTAVT+34                                                04659000
ISTATRT  EQU   ISTAVT+32                                                04660000
ISTARID  EQU   ISTAVT+30                                                04661000
ISTX1    EQU   ISTAVT+29                                                04662000
ISTPHNM  EQU   ISTAVT+24                                                04663000
ISTAPSEX EQU   ISTAVT+20                                                04664000
ISTVTTIK EQU   ISTAVT+18                                                04665000
AVTASID  EQU   ISTAVT+16                                                04666000
ISTAPSTA EQU   ISTAVT+12                                                04667000
ISTAS53  EQU   ISTAVT+8                                                 04668000
ISTACVT  EQU   ISTAVT                                                   04669000
ATCAOS   EQU   ISTATCVT+1584                                            04670000
ATCPOPAB EQU   ATCAOSM+640                                              04671000
ATCVIOPM EQU   ATCAOSM+636                                              04672000
ATCTPMMI EQU   ATCAOSM+632                                              04673000
ATCTPMPB EQU   ATCAOSM+600                                              04674000
ATCRSV88 EQU   ATCAOSM+596                                              04675000
ATCRPLCT EQU   ATCAOSM+594                                              04676000
ATCCRACT EQU   ATCAOSM+592                                              04677000
ATCSRBCT EQU   ATCAOSM+590                                              04678000
ATCRSV75 EQU   ATCAOSM+589                                              04679000
ATCRSV66 EQU   ATCZFLAG                                                 04680000
ATCZF001 EQU   ATCZFLAG                                                 04681000
ATCTPCP1 EQU   ATCAOSM+584                                              04682000
ATCTPCP0 EQU   ATCAOSM+580                                              04683000
ATCAICTN EQU   ATCAOSM+576                                              04684000
ATCZR01  EQU   ATCAOSM+572                                              04685000
ATCMPLTA EQU   ATCAOSM+568                                              04686000
ATCASCB  EQU   ATCAOSM+564                                              04687000
ATCAP86  EQU   ATCAOSM+560                                              04688000
ATCAP85  EQU   ATCAOSM+556                                              04689000
ATCAP84  EQU   ATCAOSM+552                                              04690000
ATCAP83  EQU   ATCAOSM+548                                              04691000
ATCAP82  EQU   ATCAOSM+544                                              04692000
ATCAP69  EQU   ATCAOSM+540                                              04693000
ATCAP66  EQU   ATCAOSM+536                                              04694000
ATCAP62  EQU   ATCAOSM+532                                              04695000
ATCAPC59 EQU   ATCAOSM+528                                              04696000
ATCAP56  EQU   ATCAOSM+524                                              04697000
ATCAP55  EQU   ATCAOSM+520                                              04698000
ATCRCFY0 EQU   ATCAOSM+516                                              04699000
ATCAP41  EQU   ATCAOSM+512                                              04700000
ATCAPC25 EQU   ATCAOSM+508                                              04701000
ATCAP23  EQU   ATCAOSM+504                                              04702000
ATCTPSPB EQU   ATCAOSM+472                                              04703000
ATCTRMPB EQU   ATCAOSM+440                                              04704000
ATCAPBE  EQU   ATCAOSM+436                                              04705000
ATCPSTA  EQU   ATCAOSM+432                                              04706000
ATCSMABF EQU   ATCAOSM+428                                              04707000
ATCSMAPR EQU   ATCAOSM+424                                              04708000
ATCTPWQA EQU   ATCAOSM+420                                              04709000
ATCSMAID EQU   ATCAOSM+416                                              04710000
ATCSMARA EQU   ATCAOSM+412                                              04711000
ATCCACXA EQU   ATCAOSM+408                                              04712000
ATCZLAAB EQU   ATCAOSM+404                                              04713000
ATCATA10 EQU   ATCAOSM+400                                              04714000
ATCHLTCB EQU   ATCAOSM+396                                              04715000
@NM00061 EQU   ATCVTFLG                                                 04716000
ATCVTACT EQU   ATCVTFLG                                                 04717000
ATCRPT40 EQU   ATCAOSM+388                                              04718000
ATCRPT39 EQU   ATCAOSM+384                                              04719000
ATCRPT38 EQU   ATCAOSM+380                                              04720000
ATCRPT37 EQU   ATCAOSM+376                                              04721000
ATCRPT36 EQU   ATCAOSM+372                                              04722000
ATCRPT35 EQU   ATCAOSM+368                                              04723000
ATCRPT34 EQU   ATCAOSM+364                                              04724000
ATCRPT33 EQU   ATCAOSM+360                                              04725000
ATCRPT32 EQU   ATCAOSM+356                                              04726000
ATCRPT31 EQU   ATCAOSM+352                                              04727000
ATCRPT30 EQU   ATCAOSM+348                                              04728000
ATCRPT29 EQU   ATCAOSM+344                                              04729000
ATCRPT28 EQU   ATCAOSM+340                                              04730000
ATCRPT27 EQU   ATCAOSM+336                                              04731000
ATCRPT26 EQU   ATCAOSM+332                                              04732000
ATCRPT25 EQU   ATCAOSM+328                                              04733000
ATCRPT24 EQU   ATCAOSM+324                                              04734000
ATCRPT23 EQU   ATCAOSM+320                                              04735000
ATCRPT22 EQU   ATCAOSM+316                                              04736000
ATCRPT21 EQU   ATCAOSM+312                                              04737000
ATCRPT20 EQU   ATCAOSM+308                                              04738000
ATCRPT19 EQU   ATCAOSM+304                                              04739000
ATCRPLAC EQU   ATCRPLCN+2                                               04740000
ATCRPLRC EQU   ATCRPLCN                                                 04741000
ATCCRPLQ EQU   ATCCRPL                                                  04742000
ATCSRBAC EQU   ATCSRBCN+2                                               04743000
ATCSRBRC EQU   ATCSRBCN                                                 04744000
ATCSRBQ  EQU   ATCSRB                                                   04745000
ATCCRAAC EQU   ATCCRACN+2                                               04746000
ATCCRARC EQU   ATCCRACN                                                 04747000
ATCCRAQ  EQU   ATCCRA                                                   04748000
ATCRPT12 EQU   ATCAOSM+276                                              04749000
ATCDMAPP EQU   ATCAOSM+272                                              04750000
ATCAP38  EQU   ATCAOSM+268                                              04751000
ATCZDFJ0 EQU   ATCAOSM+260                                              04752000
ATCAP51  EQU   ATCAOSM+256                                              04753000
ATCZPAB2 EQU   ATCAOSM+224                                              04754000
ATCZPAB1 EQU   ATCAOSM+192                                              04755000
ATCZLFVT EQU   ATCAOSM+188                                              04756000
ATCZLPVT EQU   ATCAOSM+184                                              04757000
ATCZDVTX EQU   ATCAOSM+180                                              04758000
ATCZDVTA EQU   ATCAOSM+176                                              04759000
ATCZDVT9 EQU   ATCAOSM+172                                              04760000
ATCZDVT8 EQU   ATCAOSM+168                                              04761000
ATCZDVT7 EQU   ATCAOSM+164                                              04762000
ATCRSV56 EQU   ATCDAPVT+22                                              04763000
ATCDAPDG EQU   ATCDAPVT+20                                              04764000
ATCDXCEA EQU   ATCDAPVT+16                                              04765000
ATCDCEA  EQU   ATCDAPVT+12                                              04766000
ATCDPCIA EQU   ATCDAPVT+8                                               04767000
ATCDSIOA EQU   ATCDAPVT+4                                               04768000
ATCDEOEA EQU   ATCDAPVT                                                 04769000
ATCZLAEA EQU   ATCLDAPP+16                                              04770000
ATCZLCEA EQU   ATCLDAPP+12                                              04771000
ATCRSV17 EQU   ATCLDAPP+8                                               04772000
ATCSMFRR EQU   ATCLDAPP+4                                               04773000
ATCCDTID EQU   ATCLDAPP                                                 04774000
ATCZAEA  EQU   ATCICAPP+16                                              04775000
ATCZCEA  EQU   ATCICAPP+12                                              04776000
ATCCDTCB EQU   ATCICAPP+8                                               04777000
ATCZSIOA EQU   ATCICAPP+4                                               04778000
ATCCDRPH EQU   ATCICAPP                                                 04779000
ATCAP65  EQU   ATCAOSM+96                                               04780000
ATCZDVT6 EQU   ATCAOSM+92                                               04781000
ATCZDVT4 EQU   ATCAOSM+88                                               04782000
ATCZDVT3 EQU   ATCAOSM+84                                               04783000
ATCZDVT1 EQU   ATCAOSM+80                                               04784000
ATCICNCB EQU   ATCAOSM+76                                               04785000
ATCZPSVT EQU   ATCAOSM+72                                               04786000
ATCZFSVT EQU   ATCAOSM+68                                               04787000
ATCAP64  EQU   ATCAOSM+64                                               04788000
ATCAP63  EQU   ATCAOSM+60                                               04789000
ATCAP61  EQU   ATCAOSM+56                                               04790000
ATCAP58  EQU   ATCAOSM+52                                               04791000
ATCAP57  EQU   ATCAOSM+48                                               04792000
ATCAP54  EQU   ATCAOSM+44                                               04793000
ATCAP53  EQU   ATCAOSM+40                                               04794000
ATCAP52  EQU   ATCAOSM+36                                               04795000
ATCAP32  EQU   ATCAOSM+28                                               04796000
ATCAP12  EQU   ATCAOSM+20                                               04797000
ATCAP11  EQU   ATCAOSM+16                                               04798000
ATCCMTCB EQU   ATCAOSM+12                                               04799000
ATCPRPH  EQU   ATCAOSM+8                                                04800000
ATCGSRBF EQU   ATCGSRBG                                                 04801000
ATCSRBRT EQU   ATCAOSM                                                  04802000
@NM00060 EQU   @NM00059                                                 04803000
ATCVTMAB EQU   @NM00059                                                 04804000
@NM00058 EQU   ATCVTBAM                                                 04805000
ATCVDLOK EQU   ISTATCVT+904                                             04806000
ATCVFPAB EQU   ISTATCVT+872                                             04807000
ATCVDPAB EQU   ISTATCVT+840                                             04808000
ATCIOECB EQU   ISTATCVT+836                                             04809000
ATCMODTB EQU   ISTATCVT+828                                             04810000
ATCUSSPT EQU   ISTATCVT+824                                             04811000
ATCSRTAB EQU   ISTATCVT+820                                             04812000
@NM00057 EQU   ISTATCVT+819                                             04813000
@NM00056 EQU   ATCSTAT2                                                 04814000
ATCTRSMS EQU   ATCSTAT2                                                 04815000
ATCTRLOK EQU   ATCSTAT2                                                 04816000
ATCTRPSS EQU   ATCSTAT2                                                 04817000
ATCTRESC EQU   ATCSTAT2                                                 04818000
ATCTRAPI EQU   ATCSTAT2                                                 04819000
ATCNMCTR EQU   ISTATCVT+816                                             04820000
ATCSEC51 EQU   ATCSECST                                                 04821000
ATCSEC40 EQU   ATCSIPD+8                                                04822000
ATCSEC30 EQU   ATCSIPD+4                                                04823000
ATCSEC21 EQU   ATCSIPD                                                  04824000
ATCSEC10 EQU   ATCSOPD+4                                                04825000
ATCSEC01 EQU   ATCSOPD                                                  04826000
ATCPOIA  EQU   ATCRNO+1                                                 04827000
@NM00055 EQU   ATCRNO                                                   04828000
ATCPODVT EQU   ISTATCVT+784                                             04829000
ATCS49XL EQU   ISTATCVT+780                                             04830000
ATCS49XI EQU   ISTATCVT+776                                             04831000
ATCLCLCT EQU   ATCVLCNT+2                                               04832000
ATCRNCNT EQU   ATCVLCNT                                                 04833000
ATCCFEAD EQU   ISTATCVT+768                                             04834000
ATCPTR00 EQU   ISTATCVT+736                                             04835000
ATCRSV10 EQU   ISTATCVT+704                                             04836000
ATCTACB  EQU   ISTATCVT+700                                             04837000
ATCVTINM EQU   ISTATCVT+696                                             04838000
ATCTCLIM EQU   ISTATCVT+692                                             04839000
ATCTCLOM EQU   ISTATCVT+688                                             04840000
ATCVTIPB EQU   ISTATCVT+656                                             04841000
ATCTCIPB EQU   ISTATCVT+624                                             04842000
ATCTIPAB EQU   ISTATCVT+592                                             04843000
ATCOCCCB EQU   ISTATCVT+588                                             04844000
ATCOCCOB EQU   ISTATCVT+584                                             04845000
ATCCDLAD EQU   ISTATCVT+580                                             04846000
ATCCCLAD EQU   ISTATCVT+576                                             04847000
ATCDLRPB EQU   ISTATCVT+544                                             04848000
ATCPGPAB EQU   ISTATCVT+512                                             04849000
ATCVPAB1 EQU   ISTATCVT+480                                             04850000
ATCRSV97 EQU   ISTATCVT+476                                             04851000
ATCCDFDN EQU   ISTATCVT+464                                             04852000
ATCCDFIN EQU   ISTATCVT+460                                             04853000
ATCDVTLK EQU   ISTATCVT+456                                             04854000
ATCAP35  EQU   ISTATCVT+448                                             04855000
ATCRSV99 EQU   ISTATCVT+440                                             04856000
ATCRSV69 EQU   ISTATCVT+416                                             04857000
ATCAPCR5 EQU   ISTATCVT+412                                             04858000
ATCCDPTR EQU   ISTATCVT+400                                             04859000
ATCADEL  EQU   ISTATCVT+396                                             04860000
ATCTODVT EQU   ISTATCVT+392                                             04861000
ATCDEBCH EQU   ISTATCVT+388                                             04862000
ATCHBSIZ EQU   ATCHPGM+2                                                04863000
ATCHBFNO EQU   ATCHPGM                                                  04864000
ATCCRME  EQU   ISTATCVT+380                                             04865000
ATCRVCHS EQU   ISTATCVT+372                                             04866000
ATCECTLP EQU   ISTATCVT+368                                             04867000
ATCZDVTB EQU   ISTATCVT+364                                             04868000
ATCECPRT EQU   ISTATCVT+360                                             04869000
ATCVTLOD EQU   ISTATCVT+356                                             04870000
ATCTRPAB EQU   ISTATCVT+352                                             04871000
ATCMSGM  EQU   ISTATCVT+348                                             04872000
ATCEPT   EQU   ISTATCVT+340                                             04873000
ATCDVT   EQU   ISTATCVT+336                                             04874000
ATCTRCPT EQU   ISTATCVT+332                                             04875000
ATCDVLOD EQU   ISTATCVT+328                                             04876000
ATCALERT EQU   ISTATCVT+324                                             04877000
ATCEPA   EQU   ISTATCVT+320                                             04878000
ATCSAF   EQU   ISTATCVT+318                                             04879000
ATCXRANG EQU   ISTATCVT+317                                             04880000
ATCLAST  EQU   ATCSHRFG                                                 04881000
ATCSHRTN EQU   ISTATCVT+308                                             04882000
ATCUEP   EQU   ISTATCVT+304                                             04883000
ATCOCRT  EQU   ISTATCVT+300                                             04884000
ATCCSMA  EQU   ATCCSMR                                                  04885000
ATCESC02 EQU   ISTATCVT+292                                             04886000
ATCESC01 EQU   ISTATCVT+288                                             04887000
ATCCDFND EQU   ISTATCVT+284                                             04888000
ATCCDDEL EQU   ISTATCVT+280                                             04889000
ATCCDADD EQU   ISTATCVT+276                                             04890000
ATCMNT   EQU   ISTATCVT+272                                             04891000
ATCRSV16 EQU   ISTATCVT+270                                             04892000
ATCMAXID EQU   ISTATCVT+269                                             04893000
ATCMSGSP EQU   ATCCOM+268                                               04894000
ATCCIDM  EQU   ATCCOM+266                                               04895000
ATCACTRM EQU   ATCCOM+264                                               04896000
ATCNERAP EQU   ATCCOM+260                                               04897000
ATCNESAL EQU   ATCCOM+256                                               04898000
ATCRCC65 EQU   ATCCOM+252                                               04899000
ATCRCC26 EQU   ATCCOM+248                                               04900000
ATCRCC63 EQU   ATCCOM+244                                               04901000
ATCRSV11 EQU   ATCCOM+242                                               04902000
ATCVTMID EQU   ATCCOM+240                                               04903000
ATCAPOST EQU   ATCCOM+236                                               04904000
ATCNERFN EQU   ATCCOM+232                                               04905000
ATCNERNE EQU   ATCCOM+228                                               04906000
ATCNERCV EQU   ATCCOM+224                                               04907000
ATCNERST EQU   ATCCOM+220                                               04908000
ATCDCC61 EQU   ATCCOM+216                                               04909000
ATCDCC60 EQU   ATCCOM+212                                               04910000
ATCSRTDF EQU   ATCCOM+208                                               04911000
ATCSRTAD EQU   ATCCOM+204                                               04912000
ATCFIRA  EQU   ATCCOM+200                                               04913000
ATCSMBQ  EQU   ATCCOM+196                                               04914000
ATCSMRC  EQU   ATCCOM+192                                               04915000
ATCSMRS  EQU   ATCCOM+188                                               04916000
ATCSMQU  EQU   ATCCOM+184                                               04917000
ATCSMRQ  EQU   ATCCOM+180                                               04918000
ATCACDA  EQU   ATCCOM+176                                               04919000
ATCSTMA  EQU   ATCCOM+172                                               04920000
ATCFRSTR EQU   ATCCOM+168                                               04921000
ATCREADA EQU   ATCCOM+160                                               04922000
ATCALOAD EQU   ATCCOM+156                                               04923000
ATCBLDLA EQU   ATCCOM+152                                               04924000
ATCFBRPH EQU   ATCCOM+148                                               04925000
ATCBFTRC EQU   ATCCOM+144                                               04926000
ATCTPBUF EQU   ATCTHTRC                                                 04927000
ATCREMOV EQU   ATCCOM+136                                               04928000
ATCADD   EQU   ATCCOM+132                                               04929000
ATCBPDA  EQU   ATCCOM+128                                               04930000
ATCDVTPT EQU   ATCCOM+124                                               04931000
ATCFEPT  EQU   ATCCOM+120                                               04932000
ATCFDVT  EQU   ATCCOM+116                                               04933000
ATCPTCHA EQU   ATCCOM+108                                               04934000
ATCAUTHA EQU   ATCCOM+104                                               04935000
ATCACCTA EQU   ATCCOM+100                                               04936000
ATCRDTH  EQU   ATCCOM+96                                                04937000
ATCFRSCH EQU   ATCCOM+92                                                04938000
ATCFSB   EQU   ATCCOM+88                                                04939000
ATCHLTMS EQU   ATCCOM+84                                                04940000
ATCECPRM EQU   ATCCOM+80                                                04941000
ATCECNET EQU   ATCCOM+76                                                04942000
ATCECOPC EQU   ATCCOM+72                                                04943000
ATCVPARM EQU   ATCCOM+68                                                04944000
ATCECVRQ EQU   ATCCOM+64                                                04945000
ATCECSES EQU   ATCCOM+60                                                04946000
ATCOCHA  EQU   ATCCOM+56                                                04947000
ATCDSPLQ EQU   ATCCOM+52                                                04948000
ATCECDSP EQU   ATCCOM+48                                                04949000
ATCVARYQ EQU   ATCCOM+44                                                04950000
ATCECVRY EQU   ATCCOM+40                                                04951000
ATCHALTQ EQU   ATCCOM+36                                                04952000
ATCECHLT EQU   ATCCOM+32                                                04953000
ATCMODQ  EQU   ATCCOM+28                                                04954000
ATCECMOD EQU   ATCCOM+24                                                04955000
ATCASCHD EQU   ATCCOM+20                                                04956000
ATCSRT   EQU   ATCCOM+16                                                04957000
ATCRDT   EQU   ATCCOM+12                                                04958000
ATCDCFRR EQU   ATCCOM+8                                                 04959000
ATCAPI   EQU   ATCCOM+4                                                 04960000
ATCRSV04 EQU   ATCSTAT4                                                 04961000
ATCVTTRC EQU   ATCSTAT4                                                 04962000
ATCNCSD  EQU   ATCSTAT4                                                 04963000
ATCMTST  EQU   ATCSTAT4                                                 04964000
ATCTPRT  EQU   ATCSTAT4                                                 04965000
ATCPRTAT EQU   ATCSTAT4                                                 04966000
@NM00054 EQU   ATCPOFLG                                                 04967000
ATCPOUNS EQU   ATCPOFLG                                                 04968000
ATCHSDMF EQU   ATCSTFLG                                                 04969000
@NM00053 EQU   ATCSTAT1                                                 04970000
ATCMDHLT EQU   ATCSTAT1                                                 04971000
ATCINHLT EQU   ATCSTAT1                                                 04972000
ATCNETSL EQU   ATCSTAT1                                                 04973000
ATCQKHLT EQU   ATCSTAT1                                                 04974000
ATCSNHLT EQU   ATCSTAT1                                                 04975000
ATCACTIV EQU   ATCSTAT1                                                 04976000
ATCSTART EQU   ATCSTAT1                                                 04977000
PATRSV01 EQU   PATFLAGA                                                 04978000
PATUSEFG EQU   PATFLAGA                                                 04979000
PATRDCNT EQU   ISTPAT+6                                                 04980000
PATGRPID EQU   ISTPAT+5                                                 04981000
PATPTHID EQU   ISTPAT+4                                                 04982000
PATDINDX EQU   ISTPAT+2                                                 04983000
PATGINDX EQU   ISTPAT                                                   04984000
GNTGRPNM EQU   ISTGNT                                                   04985000
DNTTELNO EQU   ISTDNT+1                                                 04986000
DNTCTDIG EQU   ISTDNT                                                   04987000
RLSRSV02 EQU   ISTRLS+140                                               04988000
RLSRSV01 EQU   ISTRLS+138                                               04989000
RLSCTELU EQU   ISTRLS+136                                               04990000
RLSPRE   EQU   ISTRLS                                                   04991000
RDARSVPT EQU   ISTRDA+84                                                04992000
RDAPUBI  EQU   ISTRDA+83                                                04993000
RDADFCUA EQU   ISTRDA+80                                                04994000
RDACTPCC EQU   ISTRDA+79                                                04995000
RDADACUA EQU   ISTRDA+76                                                04996000
RDALUBA  EQU   RDAUCBAD+1                                               04997000
RDACHQI  EQU   RDAUCBAD                                                 04998000
RDARSV01 EQU   RDAFLAG                                                  04999000
RDARBISA EQU   RDAFLAG                                                  05000000
RDAPRE   EQU   ISTRDA                                                   05001000
RSWRSV01 EQU   ISTRSW+152                                               05002000
RSWRSV02 EQU   ISTRSW+150                                               05003000
RSWCTELU EQU   ISTRSW+148                                               05004000
RSWGRUPZ EQU   ISTRSW+146                                               05005000
RSWDIALZ EQU   ISTRSW+144                                               05006000
RSWGRUPT EQU   ISTRSW+140                                               05007000
RSWDIALT EQU   ISTRSW+136                                               05008000
RSWPRE   EQU   ISTRSW                                                   05009000
RLXRSV03 EQU   ISTRLX+80                                                05010000
RLXRSV02 EQU   ISTRLX+77                                                05011000
RLXRSV01 EQU   RLXFLAGA                                                 05012000
RLXINUSE EQU   RLXFLAGA                                                 05013000
RLXNLUX  EQU   ISTRLX+72                                                05014000
RLXPRE   EQU   ISTRLX                                                   05015000
RPXRSV01 EQU   ISTRPX+80                                                05016000
RPXRSV02 EQU   ISTRPX+77                                                05017000
RPXMAXLU EQU   ISTRPX+76                                                05018000
RPXFLUX  EQU   ISTRPX+72                                                05019000
RPXPRE   EQU   ISTRPX                                                   05020000
RLURSV02 EQU   ISTRLU+172                                               05021000
RLULGMOD EQU   ISTRLU+164                                               05022000
RLUMODEP EQU   RLUMODET+8                                               05023000
RLUMODEN EQU   RLUMODET                                                 05024000
RLUUSSPT EQU   RLUUSSTB+8                                               05025000
RLUUSSNM EQU   RLUUSSTB                                                 05026000
RLURSV01 EQU   ISTRLU+137                                               05027000
RLULOCAD EQU   ISTRLU+136                                               05028000
RLUNCPPM EQU   RLUNCPPC+1                                               05029000
RLUNCPPN EQU   RLUNCPPC                                                 05030000
RLUPACEM EQU   RLUPACE+1                                                05031000
RLUPACEN EQU   RLUPACE                                                  05032000
RLUINTA  EQU   ISTRLU+128                                               05033000
RLUSSCFM EQU   ISTRLU+127                                               05034000
RLUCRRSV EQU   RLUCRFLG                                                 05035000
RLUACTLU EQU   RLUCRFLG                                                 05036000
RLURSV00 EQU   RLUFLAG                                                  05037000
RLUNDSES EQU   RLUFLAG                                                  05038000
RLUGSTAT EQU   RLUFLAG                                                  05039000
RLUBATCH EQU   RLUFLAG                                                  05040000
RLURBISA EQU   RLUFLAG                                                  05041000
RLUTYPE  EQU   ISTRLU+124                                               05042000
RLUCRPR  EQU   ISTRLU                                                   05043000
RCCRVPT2 EQU   ISTRCC+144                                               05044000
RCCXTOSW EQU   ISTRCC+140                                               05045000
RCCSWTOX EQU   ISTRCC+136                                               05046000
RCCRSPT2 EQU   ISTRCC+133                                               05047000
RCCADDR  EQU   ISTRCC+132                                               05048000
RCCPASSL EQU   ISTRCC+131                                               05049000
RCCMXOUT EQU   ISTRCC+130                                               05050000
RCCMXDAT EQU   ISTRCC+128                                               05051000
RCCINDEX EQU   ISTRCC+126                                               05052000
RCCPATHZ EQU   ISTRCC+124                                               05053000
RCCPATHT EQU   ISTRCC+120                                               05054000
RCCDPQ   EQU   ISTRCC+116                                               05055000
RCCTPAB  EQU   ISTRCC+112                                               05056000
RCCRSV02 EQU   ISTRCC+109                                               05057000
RCCCRRSV EQU   RCCCRFLG                                                 05058000
RCCCTCFL EQU   RCCCRFLG                                                 05059000
RCCACTPU EQU   RCCCRFLG                                                 05060000
RCCNCSPL EQU   ISTRCC+104                                               05061000
RCCRPHCN EQU   ISTRCC+100                                               05062000
RCCEPAB  EQU   ISTRCC+96                                                05063000
RCCDPAB  EQU   ISTRCC+92                                                05064000
RCCVPAB  EQU   ISTRCC+88                                                05065000
@NM00052 EQU   ISTRCC+87                                                05066000
RCCSESCT EQU   ISTRCC+86                                                05067000
RCCIDNUM EQU   RCCID48+3                                                05068000
RCCIDBLK EQU   RCCID48+2                                                05069000
RCCIDPA2 EQU   RCCID48+1                                                05070000
RCCIDPUT EQU   RCCID48                                                  05071000
RCCIDPA1 EQU   RCCSTAID                                                 05072000
RCCCTELU EQU   ISTRCC+76                                                05073000
RCCCNCNT EQU   ISTRCC+75                                                05074000
RCCRTGOH EQU   RCCFLAGB                                                 05075000
RCCBRKCN EQU   RCCFLAGB                                                 05076000
RCCRESET EQU   RCCFLAGB                                                 05077000
RCCFINAL EQU   RCCFLAGB                                                 05078000
RCCBNNSP EQU   RCCFLAGB                                                 05079000
RCCIRETR EQU   RCCFLAGB                                                 05080000
RCCDIALP EQU   RCCFLAGB                                                 05081000
RCCDSTCT EQU   RCCFLAGB                                                 05082000
RCCCTPGD EQU   RCCFLAG                                                  05083000
RCCPRGDN EQU   RCCFLAG                                                  05084000
RCCOUERP EQU   RCCFLAG                                                  05085000
RCCOHIMM EQU   RCCFLAG                                                  05086000
RCCLDISC EQU   RCCFLAG                                                  05087000
RCCERPIP EQU   RCCFLAG                                                  05088000
RCCCUDIE EQU   RCCFLAG                                                  05089000
RCCRBISA EQU   RCCFLAG                                                  05090000
RCCTYPE  EQU   ISTRCC+72                                                05091000
RCCPRE   EQU   ISTRCC                                                   05092000
DOTADTRM EQU   ISTDOT                                                   05093000
RDSADDOT EQU   ISTRDS+76                                                05094000
RDSCTATR EQU   ISTRDS+74                                                05095000
RDSCTTRM EQU   ISTRDS+72                                                05096000
RDSPRE   EQU   ISTRDS                                                   05097000
RINRSV05 EQU   ISTRIN+156                                               05098000
RINRSV04 EQU   ISTRIN+152                                               05099000
RINLOCRN EQU   ISTRIN+148                                               05100000
RINRSV02 EQU   ISTRIN+145                                               05101000
RTRCNCNT EQU   RINCNCNT                                                 05102000
RTRNCSPL EQU   RINNCSPL                                                 05103000
RTRRPHCN EQU   RINRPHCN                                                 05104000
RTRVPAB  EQU   RINVPAB                                                  05105000
RTRREMOT EQU   RINREMOT                                                 05106000
RTRRLDAF EQU   RINRLDAF                                                 05107000
RTRNODID EQU   RINNODID                                                 05108000
RINRSV01 EQU   RINDFD                                                   05109000
RTRLDISC EQU   RINLDISC                                                 05110000
RTRNODEF EQU   RINNODEF                                                 05111000
RTRREMPO EQU   RINREMPO                                                 05112000
RINCRPRE EQU   ISTRIN                                                   05113000
RTRRSV04 EQU   ISTRTR+210                                               05114000
RTRLCTI  EQU   ISTRTR+209                                               05115000
RTRIDCAS EQU   RTRBSCID+1                                               05116000
RTRIDLEN EQU   RTRBSCID                                                 05117000
RTRRSVDD EQU   ISTRTR+181                                               05118000
RTRRDFG  EQU   ISTRTR+180                                               05119000
RTRDIAA  EQU   ISTRTR+176                                               05120000
RTRPOLA  EQU   ISTRTR+172                                               05121000
RTRCADDR EQU   ISTRTR+164                                               05122000
RTRCTADR EQU   ISTRTR+162                                               05123000
RTRCTPOL EQU   ISTRTR+160                                               05124000
RTRCTDIA EQU   ISTRTR+158                                               05125000
RTRRSV03 EQU   ISTRTR+156                                               05126000
RTRRVPT1 EQU   ISTRTR+152                                               05127000
RTRBHSN1 EQU   ISTRTR+144                                               05128000
RTRCRSV2 EQU   RTRCRFLG                                                 05129000
RTRDTRLM EQU   RTRLSCMD                                                 05130000
RTRCRSV1 EQU   RTRCRFLG                                                 05131000
RTRTRMAX EQU   ISTRTR+142                                               05132000
RTRRSV24 EQU   RTRRDFF                                                  05133000
RTRRFDEK EQU   RTRRDFF                                                  05134000
RTRRFANK EQU   RTRRDFF                                                  05135000
RTRRFPFK EQU   RTRRDFF                                                  05136000
RTRRFPEN EQU   RTRRDFF                                                  05137000
RTRRFXCT EQU   RTRRDFF                                                  05138000
RTRRESCT EQU   RTRRDFE                                                  05139000
RTRRESUP EQU   RTRRDFE                                                  05140000
RTRREATT EQU   RTRRDFE                                                  05141000
RTRRECHK EQU   RTRRDFE                                                  05142000
RTRREACR EQU   RTRRDFE                                                  05143000
RTRRSV0A EQU   RTRRDFE                                                  05144000
RTRREBRK EQU   RTRRDFE                                                  05145000
RTRRSV11 EQU   RTRRDFD                                                  05146000
RTRRSV10 EQU   RTRRDFD                                                  05147000
RTRRDBHI EQU   RTRRDFD                                                  05148000
RTRRDBHD EQU   RTRRDFD                                                  05149000
RTRRDBHN EQU   RTRRDFD                                                  05150000
RTRRSV23 EQU   RTRRDFC                                                  05151000
RTRRCXMS EQU   RTRRDFC                                                  05152000
RTRRCMSG EQU   RTRRDFC                                                  05153000
RTRRCBLK EQU   RTRRDFC                                                  05154000
RTRRCPT3 EQU   RTRRDFC                                                  05155000
RTRRCIT2 EQU   RTRRDFC                                                  05156000
RTRRCIT1 EQU   RTRRDFC                                                  05157000
RTRRSV32 EQU   RTRRDFB                                                  05158000
RTRRBEND EQU   RTRRDFB                                                  05159000
RTRRBECT EQU   RTRRDFB                                                  05160000
RTRRSV02 EQU   RTRRDFA                                                  05161000
RTRRACTR EQU   RTRRDFA                                                  05162000
RTRRSV60 EQU   RTRRDFA                                                  05163000
RTRRACDT EQU   RTRRDFA                                                  05164000
RTRRAPT3 EQU   RTRRAALL                                                 05165000
RTRRAPT2 EQU   RTRRAALL                                                 05166000
RTRRAPT1 EQU   RTRRAALL                                                 05167000
RTRRAATN EQU   RTRRDFA                                                  05168000
RTRRSV45 EQU   ISTRTR+132                                               05169000
RTRRSV01 EQU   ISTRTR+130                                               05170000
RTRCTECM EQU   ISTRTR+128                                               05171000
RTRADRPT EQU   RTRADR+1                                                 05172000
RTRRSV22 EQU   RTRFLAG                                                  05173000
RTRVTERM EQU   RTRFLAG                                                  05174000
RTRRSV51 EQU   RTRFLAG                                                  05175000
RTRRBISA EQU   RTRFLAG                                                  05176000
RTRRSV21 EQU   RTRFLAG                                                  05177000
RTRCRPR  EQU   ISTRTR                                                   05178000
RCLRVPT2 EQU   ISTRCL+92                                                05179000
RCLRVPT1 EQU   ISTRCL+88                                                05180000
RCLGPOLA EQU   ISTRCL+84                                                05181000
RCLCTNGP EQU   ISTRCL+82                                                05182000
RCLRSV01 EQU   ISTRCL+80                                                05183000
RCLCTECM EQU   ISTRCL+78                                                05184000
RCLCTETR EQU   ISTRCL+76                                                05185000
RCLGPADR EQU   RCLADR+1                                                 05186000
RCLRSV33 EQU   RCLFLAG                                                  05187000
RCLBATCH EQU   RCLFLAG                                                  05188000
RCLRBISA EQU   RCLFLAG                                                  05189000
RCLRSV22 EQU   RCLFLAG                                                  05190000
RCLPRE   EQU   ISTRCL                                                   05191000
RPTRSV03 EQU   ISTRPT+156                                               05192000
RPTRSV02 EQU   ISTRPT+152                                               05193000
RPTNSNSV EQU   ISTRPT+148                                               05194000
RPTPTHCT EQU   ISTRPT+146                                               05195000
RPTPEPCT EQU   ISTRPT+144                                               05196000
RPTDAFSV EQU   ISTRPT+142                                               05197000
RPTRSV01 EQU   ISTRPT+141                                               05198000
RPTISTAT EQU   RPTFLAG1                                                 05199000
RPTDYNAM EQU   RPTFLAG1                                                 05200000
RPTVYIMM EQU   RPTFLAG1                                                 05201000
RPTVIODN EQU   RPTFLAG1                                                 05202000
RPTONLIN EQU   RPTFLAG1                                                 05203000
RPTHLVPD EQU   RPTFLAG1                                                 05204000
RPTVRYPD EQU   RPTFLAG1                                                 05205000
RPTASLEP EQU   RPTFLAG1                                                 05206000
RPTUTERM EQU   ISTRPT+136                                               05207000
RPTATERM EQU   ISTRPT+132                                               05208000
RPTDIVT  EQU   RPTDITT                                                  05209000
RPTCTNM  EQU   ISTRPT+120                                               05210000
RPTLNDAF EQU   RPTLNCID+2                                               05211000
RPTLNSAF EQU   RPTLNCID                                                 05212000
RPTLN    EQU   ISTRPT                                                   05213000
RLNRVPT2 EQU   ISTRLN+112                                               05214000
RLNNCSPL EQU   ISTRLN+108                                               05215000
RLNX2SW  EQU   ISTRLN+104                                               05216000
@NM00051 EQU   ISTRLN+103                                               05217000
RLNCRRSV EQU   RLNCRFLG                                                 05218000
RLNSWEP  EQU   RLNCRFLG                                                 05219000
RLNSVSKP EQU   RLNLSCMD                                                 05220000
RLNSESLM EQU   RLNLSCMD                                                 05221000
RLNNPRLM EQU   RLNLSCMD                                                 05222000
RLNSWNCP EQU   RLNCRFLG                                                 05223000
RLNACTLN EQU   RLNCRFLG                                                 05224000
RLNPAUSE EQU   ISTRLN+101                                               05225000
RLNPOLMT EQU   ISTRLN+100                                               05226000
RLNACTSN EQU   ISTRLN+98                                                05227000
RLNRESV1 EQU   ISTRLN+97                                                05228000
RLNACTRM EQU   ISTRLN+96                                                05229000
RLNCTSES EQU   ISTRLN+95                                                05230000
RLNRDSLM EQU   ISTRLN+94                                                05231000
RLNAUTOA EQU   ISTRLN+92                                                05232000
RLNRDFD  EQU   RLNRDF+3                                                 05233000
RLNRDFC  EQU   RLNRDF+2                                                 05234000
RLNMULTP EQU   RLNRDFB                                                  05235000
RLNRATRN EQU   RLNRDFB                                                  05236000
RLNRAPOL EQU   RLNRDFB                                                  05237000
RLNTTV   EQU   RLNRDFB                                                  05238000
RLNRSV0B EQU   RLNRDFB                                                  05239000
RLNAUTOD EQU   RLNRDFB                                                  05240000
RLNANSWR EQU   RLNRDFB                                                  05241000
RLNRBUSE EQU   RLNRDFB                                                  05242000
RLNRAPEP EQU   RLNRDFA                                                  05243000
RLNRANCP EQU   RLNRDFA                                                  05244000
RLNRAEP  EQU   RLNRDFA                                                  05245000
RLNIDV   EQU   RLNRDFA                                                  05246000
RLNPORT  EQU   RLNRDFA                                                  05247000
RLNGANSW EQU   RLNRDFA                                                  05248000
RLNRACAN EQU   RLNRACNT                                                 05249000
RLNRACAT EQU   RLNRACNT                                                 05250000
RLNRSV04 EQU   RLNSTAT2                                                 05251000
RLNINUSE EQU   RLNSTAT2                                                 05252000
RLNOHIN  EQU   RLNSTAT2                                                 05253000
RLNRSV03 EQU   RLNSTAT1                                                 05254000
RLNVD    EQU   RLNSTAT1                                                 05255000
RLNINOPP EQU   RLNSTAT1                                                 05256000
RLNINOPL EQU   RLNSTAT1                                                 05257000
RLNLRST  EQU   RLNSTAT1                                                 05258000
RLNTRAP  EQU   RLNSTAT1                                                 05259000
RLNACTCT EQU   ISTRLN+84                                                05260000
RLNCTECM EQU   ISTRLN+82                                                05261000
RLNCTEIN EQU   ISTRLN+80                                                05262000
RLNCTETR EQU   ISTRLN+78                                                05263000
RLNCTECL EQU   ISTRLN+76                                                05264000
RLNCUA   EQU   RLNUCBAD                                                 05265000
RLNRSV01 EQU   RLNFLAG                                                  05266000
RLNRBISA EQU   RLNFLAG                                                  05267000
RLNEAM   EQU   RLNFLAG                                                  05268000
RLNPRE   EQU   ISTRLN                                                   05269000
RGPRVPT2 EQU   ISTRGP+88                                                05270000
RGPRVPT1 EQU   ISTRGP+84                                                05271000
RGPCTECM EQU   ISTRGP+82                                                05272000
RGPCTEIN EQU   ISTRGP+80                                                05273000
RGPCTETR EQU   ISTRGP+78                                                05274000
RGPCTECL EQU   ISTRGP+76                                                05275000
RGPCTELN EQU   ISTRGP+74                                                05276000
RGPRSV03 EQU   ISTRGP+73                                                05277000
RGPRSV02 EQU   RGPFLG                                                   05278000
RGPASDLC EQU   RGPFLG                                                   05279000
RGPABSC  EQU   RGPFLG                                                   05280000
RGPASS   EQU   RGPFLG                                                   05281000
RGPADIL  EQU   RGPFLG                                                   05282000
RGPPRE   EQU   ISTRGP                                                   05283000
RRNRINNM EQU   ISTRRN+248                                               05284000
@NM00050 EQU   ISTRRN+247                                               05285000
RRNRDCUA EQU   ISTRRN+244                                               05286000
RRNLASTE EQU   ISTRRN+240                                               05287000
RRNNCSPL EQU   ISTRRN+236                                               05288000
RRNRPLPT EQU   ISTRRN+232                                               05289000
RRNMSIZE EQU   ISTRRN+228                                               05290000
RRNNCPNM EQU   ISTRRN+221                                               05291000
RRNCTPCC EQU   ISTRRN+220                                               05292000
RRNHBUFS EQU   ISTRRN+218                                               05293000
RRNHLENT EQU   RRNHPRE+1                                                05294000
RRNHLENH EQU   RRNHPRE                                                  05295000
RRNNMNCP EQU   ISTRRN+208                                               05296000
RRNDELAY EQU   ISTRRN+206                                               05297000
RRNRSV04 EQU   ISTRRN+200                                               05298000
RRNRSV88 EQU   RRNNMDPD+7                                               05299000
RRNPUBI  EQU   RRNNMDPD+6                                               05300000
RRNDPLUB EQU   RRNNMDPD                                                 05301000
RRNEPADR EQU   ISTRRN+190                                               05302000
RRNCPLUB EQU   ISTRRN+184                                               05303000
RRNFLUX  EQU   ISTRRN+180                                               05304000
RRNRSV05 EQU   RRNCMFD                                                  05305000
RRNREMPO EQU   RRNCMFD                                                  05306000
RRNCDREC EQU   RRNCMFD                                                  05307000
RRNCDDSI EQU   RRNCMFD                                                  05308000
RRNCDBCK EQU   RRNCMFD                                                  05309000
RRNCDDTL EQU   RRNCMFD                                                  05310000
RRNCDSTD EQU   RRNCMFD                                                  05311000
RRNCDCSP EQU   RRNCMFD                                                  05312000
RRNCCCSL EQU   RRNCMFC                                                  05313000
RRNCCSIM EQU   RRNCMFC                                                  05314000
RRNCCRCM EQU   RRNCMFC                                                  05315000
RRNCCRIM EQU   RRNCMFC                                                  05316000
RRNCCCRC EQU   RRNCMFC                                                  05317000
RRNCCRST EQU   RRNCMFC                                                  05318000
RRNCCRDQ EQU   RRNCMFC                                                  05319000
RRNCCRCN EQU   RRNCMFC                                                  05320000
RRNCBALT EQU   RRNCMFB                                                  05321000
RRNCBMOD EQU   RRNCMFB                                                  05322000
RRNCBNPL EQU   RRNCMFB                                                  05323000
RRNCBRLS EQU   RRNCMFB                                                  05324000
RRNCBRDS EQU   RRNCMFB                                                  05325000
RRNCBDLR EQU   RRNCMFB                                                  05326000
RRNCBDLH EQU   RRNCMFB                                                  05327000
RRNCBDLO EQU   RRNCMFB                                                  05328000
RRNCADGO EQU   RRNCMFA                                                  05329000
RRNCADTD EQU   RRNCMFA                                                  05330000
RRNCACDT EQU   RRNCMFA                                                  05331000
RRNCAMBH EQU   RRNCMFA                                                  05332000
RRNCAATI EQU   RRNCMFA                                                  05333000
RRNCAATG EQU   RRNCMFA                                                  05334000
RRNCAATD EQU   RRNCMFA                                                  05335000
RRNCAALL EQU   RRNCMFA                                                  05336000
RRNRSV55 EQU   RRNRDF+3                                                 05337000
RRNPTASL EQU   RRNRDFB+1                                                05338000
RRNRSV01 EQU   RRNRDFB+1                                                05339000
RRNVYDON EQU   RRNRDFB+1                                                05340000
RRNRBBUP EQU   RRNRDFB+1                                                05341000
RRNRSV03 EQU   RRNRDFB                                                  05342000
RRNRBCT2 EQU   RRNRDFB                                                  05343000
RRNRBCT1 EQU   RRNRDFB                                                  05344000
RRNRBSEC EQU   RRNRDFB                                                  05345000
RRNRBCCT EQU   RRNRDFB                                                  05346000
RRNRBCCL EQU   RRNRDFB                                                  05347000
RRNRSV02 EQU   RRNRDFB                                                  05348000
RRNRBMDL EQU   RRNRDFB                                                  05349000
RRNRAPEP EQU   RRNRDFA                                                  05350000
RRNRANCP EQU   RRNRDFA                                                  05351000
RRNRAOLT EQU   RRNRDFA                                                  05352000
RRNRASYN EQU   RRNRDFA                                                  05353000
RRNRADMP EQU   RRNRDFA                                                  05354000
RRNRAIPL EQU   RRNRDFA                                                  05355000
RRNRASHT EQU   RRNRDFA                                                  05356000
RRNCTENT EQU   ISTRRN+170                                               05357000
RRNCTECM EQU   ISTRRN+168                                               05358000
RRNCTEIN EQU   ISTRRN+166                                               05359000
RRNCTETR EQU   ISTRRN+164                                               05360000
RRNCTECL EQU   ISTRRN+162                                               05361000
RRNCTELI EQU   ISTRRN+160                                               05362000
RRNCTEGP EQU   ISTRRN+158                                               05363000
RRNCTBHS EQU   ISTRRN+156                                               05364000
RRNBHSET EQU   ISTRRN+152                                               05365000
RRNTRENT EQU   ISTRRN+148                                               05366000
RRNRLDIP EQU   ISTRRN+147                                               05367000
RRNRNCUA EQU   ISTRRN+144                                               05368000
RRNGRPA  EQU   ISTRRN+140                                               05369000
RRNLUBA  EQU   RRNUCBAD+1                                               05370000
RRNCHQI  EQU   RRNUCBAD                                                 05371000
RRNRSV11 EQU   RRNFLAG                                                  05372000
RRNDSTCT EQU   RRNFLAG                                                  05373000
RRNERPIP EQU   RRNFLAG                                                  05374000
RRNLCDIP EQU   RRNFLAG                                                  05375000
RRNLCDIE EQU   RRNFLAG                                                  05376000
RRNRBISA EQU   RRNFLAG                                                  05377000
RRNRSV89 EQU   RRNFLAG                                                  05378000
RRNPRE   EQU   ISTRRN                                                   05379000
RLCRVPT2 EQU   ISTRLC+80                                                05380000
RLCRVPT1 EQU   ISTRLC+79                                                05381000
RLCLCCUA EQU   ISTRLC+76                                                05382000
RLCUCBAD EQU   RLCADR+1                                                 05383000
RLCRSVDE EQU   RLCFLAG                                                  05384000
RLCACNT  EQU   RLCFLAG                                                  05385000
RLCRSV14 EQU   RLCFLAG                                                  05386000
RLCRBISA EQU   RLCFLAG                                                  05387000
RLCRSV22 EQU   RLCFLAG                                                  05388000
RLCPRE   EQU   ISTRLC                                                   05389000
RAPRVPT2 EQU   ISTRAP+116                                               05390000
RAPRVPT1 EQU   ISTRAP+112                                               05391000
RAPBFACT EQU   ISTRAP+111                                               05392000
RAPRSV17 EQU   RAPFLGC                                                  05393000
RAPRSV16 EQU   RAPFLGC                                                  05394000
RAPRSV15 EQU   RAPFLGC                                                  05395000
RAPRSV14 EQU   RAPFLGC                                                  05396000
RAPRSV13 EQU   RAPFLGC                                                  05397000
RAPRSV12 EQU   RAPFLGC                                                  05398000
RAPRSV11 EQU   RAPFLGC                                                  05399000
RAPRSV10 EQU   RAPFLGC                                                  05400000
RAPANVPC EQU   RAPFLGB                                                  05401000
RAPASPO  EQU   RAPFLGB                                                  05402000
RAPAPPO  EQU   RAPFLGB                                                  05403000
RAPAACQ  EQU   RAPFLGB                                                  05404000
RAPAPRMT EQU   RAPFLGB                                                  05405000
RAPAPASS EQU   RAPFLGB                                                  05406000
RAPABLCK EQU   RAPFLGB                                                  05407000
RAPALLF  EQU   RAPFLGB                                                  05408000
RAPRSV06 EQU   RAPFLG                                                   05409000
RAPRSV05 EQU   RAPFLG                                                   05410000
RAPRSV04 EQU   RAPFLG                                                   05411000
RAPRSV03 EQU   RAPFLG                                                   05412000
RAPATLGN EQU   RAPFLG                                                   05413000
RAPASLGI EQU   RAPFLG                                                   05414000
RAPAQUI  EQU   RAPFLG                                                   05415000
RAPABLGN EQU   RAPFLG                                                   05416000
RAPACEQD EQU   ISTRAP+106                                               05417000
RAPTRPRE EQU   ISTRAP+104                                               05418000
RAPACEAP EQU   ISTRAP+100                                               05419000
RAPICEAQ EQU   ISTRAP+96                                                05420000
RAPICEAC EQU   ISTRAP+92                                                05421000
RAPICELG EQU   ISTRAP+88                                                05422000
RAPAPPWD EQU   ISTRAP+80                                                05423000
RAPACDEB EQU   ISTRAP+76                                                05424000
RAPACBA  EQU   ISTRAP+72                                                05425000
RAPPRE   EQU   ISTRAP                                                   05426000
RDTVSRPL EQU   ISTRDT+132                                               05427000
RDTCRSPW EQU   ISTRDT+124                                               05428000
RDTCRSDS EQU   ISTRDT+116                                               05429000
@NM00049 EQU   ISTRDT+113                                               05430000
RRNSTCNT EQU   RDTSTCNT                                                 05431000
RRNVYRPH EQU   RDTVYRPH                                                 05432000
RDTTPAB  EQU   ISTRDT+104                                               05433000
RDTDPAB  EQU   ISTRDT+100                                               05434000
RDTEPAB  EQU   ISTRDT+96                                                05435000
RDTRSV01 EQU   RDTFLAGB                                                 05436000
RDTBHSET EQU   RDTFLAGB                                                 05437000
RDTCTCFL EQU   RDTFLAGB                                                 05438000
RDTCTPGD EQU   RDTFLAGB                                                 05439000
RDTPRGDN EQU   RDTFLAGB                                                 05440000
RDTOUERP EQU   RDTFLAGB                                                 05441000
RDTNODID EQU   ISTRDT+89                                                05442000
RDTMAXID EQU   ISTRDT+88                                                05443000
RDTCTSNT EQU   ISTRDT+86                                                05444000
RDTFLAGS EQU   ISTRDT+84                                                05445000
RDTBACK  EQU   ISTRDT+80                                                05446000
RDTFORW  EQU   ISTRDT+76                                                05447000
RDTLEN   EQU   RDTPLEN+1                                                05448000
RDTPRILS EQU   RDTPRIOR                                                 05449000
RDTPRISW EQU   RDTPRIOR                                                 05450000
RDTPRIRN EQU   RDTPRIOR                                                 05451000
RDTPRILC EQU   RDTPRIOR                                                 05452000
RDTPRIAP EQU   RDTPRIOR                                                 05453000
@NM00048 EQU   RDTPRIOR                                                 05454000
RDTPRE   EQU   ISTRDT                                                   05455000
RCPRSV05 EQU   ISTRCPRE+120                                             05456000
RCPRSV04 EQU   ISTRCPRE+116                                             05457000
RCPRSV03 EQU   ISTRCPRE+112                                             05458000
RCPINTA  EQU   RCPLGNIN+16                                              05459000
RCPLGNCT EQU   RCPLGNIN+8                                               05460000
RCPLGNAP EQU   RCPLGNIN                                                 05461000
@NM00047 EQU   RCPPMODE                                                 05462000
RCPRRECD EQU   RCPPMODE                                                 05463000
RCPRBASC EQU   RCPPMODE                                                 05464000
RCPBFLIM EQU   ISTRCPRE+90                                              05465000
RCPBHSI2 EQU   ISTRCPRE+89                                              05466000
RCPBHSI1 EQU   ISTRCPRE+88                                              05467000
RCPACETR EQU   ISTRCPRE+84                                              05468000
RCPICEAQ EQU   ISTRCPRE+80                                              05469000
RCPLNAPA EQU   ISTRCPRE+76                                              05470000
RCPICELN EQU   ISTRCPRE+72                                              05471000
RCPPRE   EQU   ISTRCPRE                                                 05472000
RPRCONID EQU   ISTRPRE+63                                               05473000
RPRCLVPD EQU   RPRFLAGC                                                 05474000
RPRINIMM EQU   RPRFLAGD                                                 05475000
RPRRSV05 EQU   RPRFLAGD                                                 05476000
RPRCONP  EQU   RPRFLAGD                                                 05477000
RPRACTP  EQU   RPRFLAGD                                                 05478000
RPRRSON  EQU   RPRFLAGD                                                 05479000
RPRCONCT EQU   RPRFLAGD                                                 05480000
RPRLTASN EQU   RPRFLAGD                                                 05481000
RPRPTHCT EQU   ISTRPRE+60                                               05482000
RPRSWDAF EQU   ISTRPRE+58                                               05483000
RPRSTPCT EQU   ISTRPRE+56                                               05484000
RPRRVPT1 EQU   ISTRPRE+52                                               05485000
RPRDEVCH EQU   ISTRPRE+44                                               05486000
RPRNCBA  EQU   ISTRPRE+40                                               05487000
RPRLGONB EQU   ISTRPRE+32                                               05488000
RPRLGONF EQU   ISTRPRE+28                                               05489000
RPRHDTYP EQU   ISTRPRE+27                                               05490000
RPRTIOCT EQU   ISTRPRE+26                                               05491000
RPRPEPCT EQU   ISTRPRE+24                                               05492000
RPRRSV03 EQU   RPRCAUSE                                                 05493000
RPRRSYNC EQU   RPRCAUSE                                                 05494000
RPRCRCPT EQU   RPRCAUSE                                                 05495000
RPRNOSRT EQU   RPRCAUSE                                                 05496000
RPRINTST EQU   RPRFLAGB                                                 05497000
RPRVYIMM EQU   RPRFLAGB                                                 05498000
RPRHLVPD EQU   RPRFLAGB                                                 05499000
RPRVIODN EQU   RPRFLAGB                                                 05500000
RPRAOPN  EQU   RPRFLAGB                                                 05501000
RPRENTVT EQU   RPRFLAGB                                                 05502000
RPRVRYPD EQU   RPRFLAGA                                                 05503000
RPRENTED EQU   RPRFLAGA                                                 05504000
RPRENTIO EQU   RPRFLAGA                                                 05505000
RPRENTBF EQU   RPRFLAGA                                                 05506000
RPRTIED  EQU   RPRFLAGA                                                 05507000
RPRINV   EQU   RPRFLAGA                                                 05508000
RPRACT   EQU   RPRFLAGA                                                 05509000
RPRPELEN EQU   ISTRPRE+18                                               05510000
RPRELEN  EQU   ISTRPRE+16                                               05511000
RPRRLOCK EQU   ISTRPRE+12                                               05512000
RPRDAF   EQU   RPRCOMID+2                                               05513000
RPRSAF   EQU   RPRCOMID                                                 05514000
RPRNAME  EQU   ISTRPRE                                                  05515000
DEVRSV03 EQU   ISTDEVCH+5                                               05516000
DEVPHYSA EQU   ISTDEVCH+4                                               05517000
DEVCSLPN EQU   DEVCHAR3                                                 05518000
DEVCSTCL EQU   DEVCHAR3                                                 05519000
DEVCCHEK EQU   DEVCHAR3                                                 05520000
DEVCATTN EQU   DEVCHAR3                                                 05521000
DEVCSWL  EQU   DEVFCCTL                                                 05522000
DEVCRVB  EQU   DEVFCCTL                                                 05523000
DEVCSSL  EQU   DEVFCCTL                                                 05524000
DEVCBSC  EQU   DEVFCCTL                                                 05525000
DEVMCODE EQU   ISTDEVCH+2                                               05526000
DEVCHAR2 EQU   DEVTCODE                                                 05527000
DEVRSV01 EQU   DEVCHAR                                                  05528000
DEVCCTL  EQU   DEVCHAR                                                  05529000
DEVNNSPT EQU   DEVCHAR                                                  05530000
DEVSPS   EQU   DEVCHAR                                                  05531000
DEVSUBND EQU   DEVCHAR                                                  05532000
DEVCONVR EQU   DEVCHAR                                                  05533000
DEVOTPUT EQU   DEVCHAR                                                  05534000
DEVINPUT EQU   DEVCHAR                                                  05535000
LOKXCL   EQU   @NM00045                                                 05536000
LOKPRY   EQU   @NM00045                                                 05537000
@NM00046 EQU   @NM00045                                                 05538000
@NM00044 EQU   LOKCHNG                                                  05539000
LOKCT    EQU   ISTLOK                                                   05540000
NCSRUITS EQU   NCSUSSRU+2                                               05541000
NCSRULEN EQU   NCSUSSRU                                                 05542000
NCSAPPAB EQU   NCSAPP+608                                               05543000
NCSAPDAT EQU   NCSAPBUE+8                                               05544000
NCSAPRU  EQU   NCSAPBUE+3                                               05545000
NCSRSV04 EQU   NCSAPBUE                                                 05546000
NCSAPEND EQU   NCSAPP+84                                                05547000
NCSAPTXT EQU   NCSAPP+76                                                05548000
NCSAPECB EQU   NCSAPP+72                                                05549000
NCSAPSA  EQU   NCSAPP                                                   05550000
NCSPLPDB EQU   NCSPLSID+5                                               05551000
NCSPLNID EQU   NCSPLPHD                                                 05552000
NCSPLPO  EQU   NCSPLSTA                                                 05553000
NCSRSVD4 EQU   NCSPLSTA                                                 05554000
NCSRSVD2 EQU   NCSCRMOD                                                 05555000
NCSPTMOD EQU   NCSCRMOD                                                 05556000
NCSAIMOD EQU   NCSCRMOD                                                 05557000
NCSRSVD1 EQU   NCSCHKPT+1                                               05558000
NCSPTUSE EQU   NCSCHKPT+1                                               05559000
NCSRNME  EQU   NCSCHKPT+1                                               05560000
NCSCUA   EQU   NCSCHKPT+1                                               05561000
NCSANSMD EQU   NCSCHKPT+1                                               05562000
NCSLGMOD EQU   NCSCHKPT                                                 05563000
NCSLGAPL EQU   NCSCHKPT                                                 05564000
NCSDTRLM EQU   NCSCHKPT                                                 05565000
NCSESLM  EQU   NCSCHKPT                                                 05566000
NCSNRPL  EQU   NCSCHKPT                                                 05567000
NCSPOLD  EQU   NCSCHKPT                                                 05568000
NCSPACTV EQU   NCSCHKPT                                                 05569000
NCSACTV  EQU   NCSCHKPT                                                 05570000
NCSCRDTE EQU   ISTNCSPL+264                                             05571000
NCSPLRTY EQU   ISTNCSPL+263                                             05572000
NCSPLRH  EQU   ISTNCSPL+260                                             05573000
NCSUFMCB EQU   ISTNCSPL+256                                             05574000
NCSMGLPT EQU   ISTNCSPL+252                                             05575000
NCSCPWPT EQU   ISTNCSPL+248                                             05576000
NCSSENS2 EQU   NCSSENSE+2                                               05577000
NCSSNS2  EQU   NCSSENSE+1                                               05578000
NCSSNS1  EQU   NCSSENSE                                                 05579000
NCSPLNSN EQU   ISTNCSPL+240                                             05580000
NCSPLMID EQU   ISTNCSPL+232                                             05581000
NCSPLPID EQU   ISTNCSPL+231                                             05582000
NCSPLGID EQU   ISTNCSPL+230                                             05583000
NCSPLSQN EQU   ISTNCSPL+228                                             05584000
NCSRNAME EQU   ISTNCSPL+220                                             05585000
NCSPLRUI EQU   ISTNCSPL+212                                             05586000
NCSPLRUO EQU   ISTNCSPL+208                                             05587000
NCSPLRRP EQU   ISTNCSPL+204                                             05588000
NCSPLWEL EQU   ISTNCSPL+200                                             05589000
NCSPLSPL EQU   ISTNCSPL+196                                             05590000
NCSPLP3  EQU   ISTNCSPL+192                                             05591000
NCSPLP2  EQU   ISTNCSPL+188                                             05592000
NCSPLP1  EQU   ISTNCSPL+184                                             05593000
NCSPLOLN EQU   ISTNCSPL+182                                             05594000
@NM00043 EQU   NCSPLFL5                                                 05595000
NCSFORCE EQU   NCSPLFL5                                                 05596000
NCSSDLK  EQU   NCSPLFL5                                                 05597000
NCSSCPPS EQU   NCSPLFL5                                                 05598000
NCSDLRSN EQU   ISTNCSPL+180                                             05599000
NCSPL2AP EQU   NCSPLFL4                                                 05600000
NCSDSPN  EQU   NCSPLFL4                                                 05601000
NCSDSPI  EQU   NCSPLFL4                                                 05602000
NCSDSPA  EQU   NCSPLFL4                                                 05603000
NCSDSPE  EQU   NCSPLFL4                                                 05604000
NCSPLVID EQU   NCSPLFL4                                                 05605000
NCSPLRSO EQU   NCSPLFL4                                                 05606000
NCSDLNID EQU   NCSPLFL4                                                 05607000
NCSEND   EQU   NCSPLFL3                                                 05608000
NCSFINAL EQU   NCSPLFL3                                                 05609000
NCSANS   EQU   NCSPLFL3                                                 05610000
NCSPID   EQU   NCSPLFL3                                                 05611000
NCSGID   EQU   NCSPLFL3                                                 05612000
NCSPLANS EQU   NCSPLFL3                                                 05613000
NCSEPP   EQU   NCSPLFL3                                                 05614000
NCSPLMOM EQU   NCSPLFL3                                                 05615000
NCSPLVIT EQU   NCSPLFL2                                                 05616000
NCSPLVIS EQU   NCSPLFL2                                                 05617000
NCSREMPO EQU   NCSPLFL2                                                 05618000
NCSPLDS  EQU   NCSPLFL2                                                 05619000
NCSOUFMC EQU   NCSPLFL2                                                 05620000
NCSPLRIO EQU   NCSPLFL2                                                 05621000
NCSPLRSF EQU   NCSPLFL2                                                 05622000
NCSPLPOS EQU   NCSPLFL1                                                 05623000
NCSPL2CN EQU   NCSPLFL1                                                 05624000
NCSPLAPU EQU   NCSPLFL1                                                 05625000
NCSPLNON EQU   NCSPLFL1                                                 05626000
NCSPLEBN EQU   NCSPLFL1                                                 05627000
NCSPLSOM EQU   NCSPLFL1                                                 05628000
NCSPLRCR EQU   ISTNCSPL+172                                             05629000
NCSPLECB EQU   ISTNCSPL+164                                             05630000
NCSPLDAF EQU   NCSPLCID+2                                               05631000
NCSPLSAF EQU   NCSPLCID                                                 05632000
NCSPLRCD EQU   NCSPLRAD+1                                               05633000
NCSLSCMD EQU   NCSPLRAD                                                 05634000
NCSPLWRF EQU   ISTNCSPL+72                                              05635000
NCSPLWRE EQU   ISTNCSPL+68                                              05636000
NCSUSRNF EQU   NCSCRFLG                                                 05637000
NCSOPRQU EQU   NCSCRFLG                                                 05638000
NCSCRDSE EQU   NCSCRFLG                                                 05639000
NCSFMERP EQU   NCSCRFLG                                                 05640000
NCSFMCLD EQU   NCSCRFLG                                                 05641000
NCSMSGSP EQU   ISTNCSPL+63                                              05642000
NCSNCPEP EQU   ISTNCSPL+62                                              05643000
NCSCMDB  EQU   NCSPLCMD+1                                               05644000
@NM00042 EQU   NCSCMDA                                                  05645000
NCSPLUFM EQU   NCSCMDA                                                  05646000
NCSPLFLO EQU   NCSCMDA                                                  05647000
NCSPLSYN EQU   NCSCMDA                                                  05648000
NCSPLCTL EQU   NCSCMDA                                                  05649000
NCSPLSYS EQU   NCSCMDA                                                  05650000
NCSCRPID EQU   ISTNCSPL+51                                              05651000
NCSCRCMD EQU   ISTNCSPL+50                                              05652000
NCSDLID  EQU   ISTNCSPL+44                                              05653000
NCSPLLID EQU   ISTNCSPL+36                                              05654000
NCSRRNPT EQU   ISTNCSPL+24                                              05655000
NCSIORC  EQU   ISTNCSPL+23                                              05656000
NCSPRMRC EQU   ISTNCSPL+22                                              05657000
NCSOVFMC EQU   NCSPLVF1                                                 05658000
NCSRSV02 EQU   NCSPLVFL                                                 05659000
NCSDACLK EQU   NCSPLVFL                                                 05660000
NCSABCON EQU   NCSPLVFL                                                 05661000
NCSDCONT EQU   NCSPLVFL                                                 05662000
NCSVNCSA EQU   NCSPLVFL                                                 05663000
NCSVBF16 EQU   NCSPLVBF+1                                               05664000
NCSVBF15 EQU   NCSPLVBF+1                                               05665000
NCSVBF14 EQU   NCSPLVBF+1                                               05666000
NCSVBF13 EQU   NCSPLVBF+1                                               05667000
NCSVBF12 EQU   NCSPLVBF+1                                               05668000
NCSVBF11 EQU   NCSPLVBF+1                                               05669000
NCSVBF10 EQU   NCSPLVBF+1                                               05670000
NCSVBF09 EQU   NCSPLVBF+1                                               05671000
NCSVBF08 EQU   NCSPLVBF                                                 05672000
NCSVBF07 EQU   NCSPLVBF                                                 05673000
NCSVBF06 EQU   NCSPLVBF                                                 05674000
NCSVBF05 EQU   NCSPLVBF                                                 05675000
NCSVBF04 EQU   NCSPLVBF                                                 05676000
NCSVBF03 EQU   NCSPLVBF                                                 05677000
NCSVBF02 EQU   NCSPLVBF                                                 05678000
NCSVBF01 EQU   NCSPLVBF                                                 05679000
NCSPLVCD EQU   ISTNCSPL+17                                              05680000
@NM00041 EQU   ISTNCSPL+16                                              05681000
NCSCRWKA EQU   NCSPFX+12                                                05682000
@NM00040 EQU   NCSPFX                                                   05683000
PFXBCK   EQU   ISTPFX+12                                                05684000
PFXFWD   EQU   ISTPFX+8                                                 05685000
PFXLNG   EQU   ISTPFX+5                                                 05686000
PFXPRTY  EQU   ISTPFX+4                                                 05687000
PFXCBID  EQU   PFXID                                                    05688000
POHID    EQU   ISTPOHD+2                                                05689000
POHGEN   EQU   POHSTAT                                                  05690000
POHRREQ  EQU   POHSTAT                                                  05691000
POHRSVD2 EQU   POHSTAT                                                  05692000
POHCNTRL EQU   POHSTAT                                                  05693000
POHLBL   EQU   POHSTAT                                                  05694000
POHDATA  EQU   POHSTAT                                                  05695000
POHEND   EQU   POHSTAT                                                  05696000
POHRSVD1 EQU   ISTPOHD                                                  05697000
DYPRSV01 EQU   ISTDYPAB+12                                              05698000
DYPTSKID EQU   ISTDYPAB+8                                               05699000
DYPCHAIN EQU   ISTDYPAB+4                                               05700000
DYPFLGS  EQU   ISTDYPAB+2                                               05701000
DYPLNGTH EQU   ISTDYPAB+1                                               05702000
DYPTYPE  EQU   ISTDYPAB                                                 05703000
PABRPHA  EQU   PABRPHFG+1                                               05704000
PABNODQ  EQU   PABFLAGS                                                 05705000
PABINHBT EQU   PABFLAGS                                                 05706000
PABERLOK EQU   PABERRLK                                                 05707000
PABSSN   EQU   PABFLAGS                                                 05708000
PABDYNAM EQU   PABFLAGS                                                 05709000
PABNORPR EQU   PABFLAGS                                                 05710000
PABPRIOR EQU   PABFLAGS                                                 05711000
PABAPYP  EQU   PABFLAGS                                                 05712000
PABDVTA  EQU   ISTPAB+9                                                 05713000
PABOFFST EQU   ISTPAB+8                                                 05714000
PABCHNGP EQU   PABCHAIN+1                                               05715000
PABRSV02 EQU   PABCHAIN                                                 05716000
PABDELAY EQU   PABCHAIN                                                 05717000
PABRUNNG EQU   PABCHAIN                                                 05718000
PABRESET EQU   PABCHAIN                                                 05719000
PABUNCON EQU   PABCHAIN                                                 05720000
PABCDP   EQU   PABCHAIN                                                 05721000
PABRESCH EQU   PABCHAIN                                                 05722000
PABCHNG  EQU   PABCHAIN                                                 05723000
PABWEQP  EQU   PABWEQA+1                                                05724000
PABRSV01 EQU   PABWEQA                                                  05725000
PABWEQG  EQU   PABWEQA                                                  05726000
RPHNEXPO EQU   ISTRPH+104                                               05727000
RPHSAV16 EQU   RPHWORK+60                                               05728000
RPHSAV15 EQU   RPHWORK+56                                               05729000
RPHSAV14 EQU   RPHWORK+52                                               05730000
RPHSAV13 EQU   RPHWORK+48                                               05731000
RPHSAV12 EQU   RPHWORK+44                                               05732000
RPHSAV11 EQU   RPHWORK+40                                               05733000
RPHSAV10 EQU   RPHWORK+36                                               05734000
RPHSAVE9 EQU   RPHWORK+32                                               05735000
RPHSAVE8 EQU   RPHWORK+28                                               05736000
RPHSAVE7 EQU   RPHWORK+24                                               05737000
RPHSAVE6 EQU   RPHWORK+20                                               05738000
RPHSAVE5 EQU   RPHWORK+16                                               05739000
RPHSAVE4 EQU   RPHWORK+12                                               05740000
RPHSAVE3 EQU   RPHWORK+8                                                05741000
RPHSAVE2 EQU   RPHWORK+4                                                05742000
RPHSHALF EQU   RPHSAVE1+2                                               05743000
RPHSBIT8 EQU   RPHSBITS                                                 05744000
RPHSBIT7 EQU   RPHSBITS                                                 05745000
RPHSBIT6 EQU   RPHSBITS                                                 05746000
RPHSBIT5 EQU   RPHSBITS                                                 05747000
RPHSBIT4 EQU   RPHSBITS                                                 05748000
RPHSBIT3 EQU   RPHSBITS                                                 05749000
RPHSBIT2 EQU   RPHSBITS                                                 05750000
RPHSBIT1 EQU   RPHSBITS                                                 05751000
RPHSBYTE EQU   RPHSAVE1                                                 05752000
RPHPABQP EQU   RPHPABQA+1                                               05753000
RPHPABFG EQU   RPHPABQA                                                 05754000
RPHSRP34 EQU   RPHSRPRM+2                                               05755000
RPHSRP12 EQU   RPHSRPRM                                                 05756000
RPHWEGT  EQU   RPHCSPA                                                  05757000
RPHMAJCB EQU   ISTRPH+21                                                05758000
RPHPABOF EQU   ISTRPH+20                                                05759000
RPHRESUM EQU   RPHRESMA+1                                               05760000
RPHRSV01 EQU   RPHWPFLG                                                 05761000
RPHPURGE EQU   RPHWPFLG                                                 05762000
RPHPT    EQU   RPHWPFLG                                                 05763000
RPHWT    EQU   RPHWPFLG                                                 05764000
RPHRSKEY EQU   RPHWPFLG                                                 05765000
RPHDVTA  EQU   ISTRPH+12                                                05766000
RPHTIK   EQU   RPHTSKID+3                                               05767000
@NM00038 EQU   RPHTSKID                                                 05768000
RPHRPHAP EQU   RPHRPHA+1                                                05769000
@NM00037 EQU   RPHRPHA                                                  05770000
RPHGATE  EQU   RPHRPHA                                                  05771000
@NM00036 EQU   RPHFLGB                                                  05772000
RPHRLCRA EQU   RPHFLGB                                                  05773000
RPHNRSAV EQU   RPHFLGB                                                  05774000
RPHPGCMP EQU   RPHFLGB                                                  05775000
RPHFBAPS EQU   RPHFLGB                                                  05776000
RPHBSSP  EQU   RPHFLGB                                                  05777000
RPHLOCK  EQU   RPHFLGB                                                  05778000
RPHFNFLG EQU   RPHFSTLC                                                 05779000
RPHMLTCP EQU   RPHFLAGS                                                 05780000
RPHSMCLR EQU   RPHFLAGS                                                 05781000
RPHSMTYP EQU   RPHFLAGS                                                 05782000
RPHSMQ   EQU   RPHFLAGS                                                 05783000
RPHAUTEX EQU   RPHAPTYP                                                 05784000
RPHSPGIN EQU   RPHFLAGS                                                 05785000
RPHOGIND EQU   RPHFLAGS                                                 05786000
RPHLNGTH EQU   RPHCNTL+1                                                05787000
RPHTYPE  EQU   RPHCNTL                                                  05788000
@NM00011 EQU   SRBSECT+40                                               05789000
@NM00010 EQU   SRBSECT+38                                               05790000
SRBPRIOR EQU   SRBSECT+37                                               05791000
SRBPKF   EQU   SRBSECT+36                                               05792000
SRBSAVE  EQU   SRBSECT+32                                               05793000
SRBPARM  EQU   SRBSECT+28                                               05794000
SRBRMTR  EQU   SRBSECT+24                                               05795000
SRBEP    EQU   SRBSECT+20                                               05796000
SRBPTCB  EQU   SRBFLC+4                                                 05797000
SRBPASID EQU   SRBFLC+2                                                 05798000
SRBCPAFF EQU   SRBFLC                                                   05799000
SRBASCB  EQU   SRBSECT+8                                                05800000
SRBFLNK  EQU   SRBSECT+4                                                05801000
SRBID    EQU   SRBSECT                                                  05802000
IOSEND   EQU   IOSB+108                                                 05803000
IOSSKR   EQU   IOSEEKA+7                                                05804000
IOSSKH2  EQU   IOSSKHH+1                                                05805000
IOSSKH1  EQU   IOSSKHH                                                  05806000
IOSSKCC  EQU   IOSCCHH                                                  05807000
IOSSKBB  EQU   IOSEEKA+1                                                05808000
IOSSKM   EQU   IOSEEKA                                                  05809000
IOSEEK   EQU   IOSB+92                                                  05810000
IOSMDM   EQU   IOSB+91                                                  05811000
IOSMDB   EQU   IOSB+90                                                  05812000
IOSCKEY7 EQU   IOSCKEY                                                  05813000
IOSCKEY6 EQU   IOSCKEY                                                  05814000
IOSCKEY5 EQU   IOSCKEY                                                  05815000
IOSCKEY4 EQU   IOSCKEY                                                  05816000
@NM00006 EQU   IOSCKEY                                                  05817000
IOSFMSK  EQU   IOSB+88                                                  05818000
IOSCUDEV EQU   IOSPATH+1                                                05819000
@NM00005 EQU   IOSCHN                                                   05820000
IOSPATH3 EQU   IOSCHN                                                   05821000
IOSPATH2 EQU   IOSCHN                                                   05822000
IOSEXP   EQU   IOSCHN                                                   05823000
IOSGDP   EQU   IOSCHN                                                   05824000
IOSAFF   EQU   IOSB+85                                                  05825000
IOSRSS1B EQU   IOSB+84                                                  05826000
IOSDSID  EQU   IOSB+80                                                  05827000
IOSVST   EQU   IOSB+76                                                  05828000
IOSRST   EQU   IOSB+72                                                  05829000
IOSDIE   EQU   IOSB+68                                                  05830000
IOSABN   EQU   IOSB+64                                                  05831000
IOSNRM   EQU   IOSB+60                                                  05832000
IOSPCI   EQU   IOSB+56                                                  05833000
IOSERP   EQU   IOSB+52                                                  05834000
IOSPCHN  EQU   IOSB+48                                                  05835000
IOSSNS   EQU   IOSB+42                                                  05836000
IOSAPMSK EQU   IOSB+40                                                  05837000
IOSRES4A EQU   IOSB+36                                                  05838000
IOSUSE   EQU   IOSB+32                                                  05839000
IOSSRB   EQU   IOSB+28                                                  05840000
IOSCSWRC EQU   IOSCSW+5                                                 05841000
IOSTSB   EQU   IOSTATUS+1                                               05842000
IOSTSA   EQU   IOSTATUS                                                 05843000
IOSCSWCA EQU   IOSCSW                                                   05844000
IOSCC    EQU   @NM00004                                                 05845000
IOSUCB   EQU   IOSB+16                                                  05846000
IOSOPT2X EQU   IOSOPT2                                                  05847000
IOSHTP   EQU   IOSOPT2                                                  05848000
IOSRELSE EQU   IOSOPT                                                   05849000
IOSAPR   EQU   IOSOPT                                                   05850000
IOSTSLL  EQU   IOSOPT                                                   05851000
IOSNERP  EQU   IOSOPT                                                   05852000
IOSPSLL  EQU   IOSOPT                                                   05853000
IOSQISCE EQU   IOSOPT                                                   05854000
IOSDEP   EQU   IOSOPT                                                   05855000
IOSBYP   EQU   IOSOPT                                                   05856000
IOSCOD   EQU   IOSB+13                                                  05857000
IOSPKY7  EQU   IOSPKEY                                                  05858000
IOSPGDPX EQU   IOSPKEY                                                  05859000
IOSIDR   EQU   IOSPKEY                                                  05860000
IOSLCL   EQU   IOSPKEY                                                  05861000
@NM00003 EQU   IOSPKEY                                                  05862000
IOSPGAD  EQU   IOSB+8                                                   05863000
IOSASID  EQU   IOSB+6                                                   05864000
IOSPRLVL EQU   IOSB+5                                                   05865000
IOSDVRID EQU   IOSB+4                                                   05866000
IOSPROC  EQU   IOSB+3                                                   05867000
IOSFLC7  EQU   IOSFLC                                                   05868000
IOSFLC6  EQU   IOSFLC                                                   05869000
IOSRWAIT EQU   IOSFLC                                                   05870000
IOSTP    EQU   IOSFLC                                                   05871000
IOSCC3WE EQU   IOSFLC                                                   05872000
IOSVERIF EQU   IOSDVALT                                                 05873000
IOSDVMNT EQU   IOSFLC                                                   05874000
IOSLOG   EQU   IOSFLB                                                   05875000
IOSBDCST EQU   IOSFLB                                                   05876000
IOSMSG   EQU   IOSFLB                                                   05877000
IOSFLB4  EQU   IOSFLB                                                   05878000
IOSFLB3  EQU   IOSFLB                                                   05879000
IOSFLB2  EQU   IOSFLB                                                   05880000
IOSSDR   EQU   IOSFLB                                                   05881000
IOSDIESE EQU   IOSFLB                                                   05882000
IOSIOSB  EQU   IOSFLA                                                   05883000
IOSDOM   EQU   IOSFLA                                                   05884000
IOSEX    EQU   IOSFLA                                                   05885000
IOSSMDB  EQU   IOSFLA                                                   05886000
IOSSMDA  EQU   IOSFLA                                                   05887000
IOSERR   EQU   IOSFLA                                                   05888000
IOSCCHN  EQU   IOSACHN                                                  05889000
IOSDCHN  EQU   IOSACHN                                                  05890000
IOBERRCT EQU   IOBSTDRD+30                                              05891000
IOBRSV19 EQU   IOBINCAM+1                                               05892000
IOBOLTST EQU   IOBBTAMF                                                 05893000
IOBRFTMG EQU   IOBBTAMF                                                 05894000
IOBRSV17 EQU   IOBBTAMF                                                 05895000
IOBRSV16 EQU   IOBBTAMF                                                 05896000
IOBRSV15 EQU   IOBBTAMF                                                 05897000
IOBRSV14 EQU   IOBBTAMF                                                 05898000
IOBINUSE EQU   IOBBTAMF                                                 05899000
IOBPRMER EQU   IOBBTAMF                                                 05900000
IOBRSTRB EQU   IOBRESTR+1                                               05901000
IOBREPOS EQU   IOBRESTR                                                 05902000
IOBDCBPB EQU   IOBDCBPT+1                                               05903000
IOBRSV44 EQU   IOBFLAG4                                                 05904000
IOBJES3I EQU   IOBFLAG4                                                 05905000
IOBRSV42 EQU   IOBFLAG4                                                 05906000
IOBRSV41 EQU   IOBFLAG4                                                 05907000
IOBRSV40 EQU   IOBFLAG4                                                 05908000
IOBPMERR EQU   IOBFLAG4                                                 05909000
IOBCC3WE EQU   IOBFLAG4                                                 05910000
IOBGDPOL EQU   IOBFLAG4                                                 05911000
IOBSTRTB EQU   IOBSTART+1                                               05912000
IOBSIOCC EQU   IOBSTART                                                 05913000
IOBCSB7  EQU   IOBCSTAT                                                 05914000
IOBCSB6  EQU   IOBCSTAT                                                 05915000
IOBCSB5  EQU   IOBCSTAT                                                 05916000
IOBCSB4  EQU   IOBCSTAT                                                 05917000
IOBCSB3  EQU   IOBCSTAT                                                 05918000
IOBCSB2  EQU   IOBCSTAT                                                 05919000
IOBCSB1  EQU   IOBCSTAT                                                 05920000
IOBCSB0  EQU   IOBCSTAT                                                 05921000
IOBUSB7  EQU   IOBUSTAT                                                 05922000
IOBUSB6  EQU   IOBUSTAT                                                 05923000
IOBUSB5  EQU   IOBUSTAT                                                 05924000
IOBUSB4  EQU   IOBUSTAT                                                 05925000
IOBUSB3  EQU   IOBUSTAT                                                 05926000
IOBUSB2  EQU   IOBUSTAT                                                 05927000
IOBUSB1  EQU   IOBUSTAT                                                 05928000
IOBUSB0  EQU   IOBUSTAT                                                 05929000
IOBCMDA  EQU   IOBIOCSW                                                 05930000
IOBLOG   EQU   IOBFL3                                                   05931000
IOBJAM   EQU   IOBICL                                                   05932000
IOBMSG   EQU   IOBFL3                                                   05933000
IOBSDR   EQU   IOBCNC                                                   05934000
IOBACU   EQU   IOBFL3                                                   05935000
IOBCDC   EQU   IOBFL3                                                   05936000
IOBICC   EQU   IOBFL3                                                   05937000
IOBCCC   EQU   IOBFL3                                                   05938000
IOBECBPB EQU   IOBECBPT+1                                               05939000
IOBECBCC EQU   IOBECBPT                                                 05940000
IOBS1B7  EQU   IOBSENS1                                                 05941000
IOBS1B6  EQU   IOBSENS1                                                 05942000
IOBS1B5  EQU   IOBSENS1                                                 05943000
IOBS1B4  EQU   IOBSENS1                                                 05944000
IOBS1B3  EQU   IOBSENS1                                                 05945000
IOBS1B2  EQU   IOBSENS1                                                 05946000
IOBS1B1  EQU   IOBSENS1                                                 05947000
IOBS1B0  EQU   IOBSENS1                                                 05948000
IOBSNSC9 EQU   IOBS0B7                                                  05949000
IOBS0B6  EQU   IOBSENS0                                                 05950000
IOBS0B5  EQU   IOBSENS0                                                 05951000
IOBS0B4  EQU   IOBSENS0                                                 05952000
IOBS0B3  EQU   IOBSENS0                                                 05953000
IOBS0B2  EQU   IOBSENS0                                                 05954000
IOBS0B1  EQU   IOBSENS0                                                 05955000
IOBS0B0  EQU   IOBSENS0                                                 05956000
IOBPNCH  EQU   IOBFLAG2                                                 05957000
IOBSTATO EQU   IOBFLAG2                                                 05958000
IOBSKUPD EQU   IOBFLAG2                                                 05959000
IOBALTTR EQU   IOBFLAG2                                                 05960000
IOBRRT2  EQU   IOBRDHA0                                                 05961000
IOBRRT3  EQU   IOBPURGE                                                 05962000
IOBSENSE EQU   IOBFLAG2                                                 05963000
IOBHALT  EQU   IOBFLAG2                                                 05964000
IOBSPSVC EQU   IOBRSTRT                                                 05965000
IOBUNREL EQU   IOBFLAG1                                                 05966000
IOBIOERR EQU   IOBFLAG1                                                 05967000
IOBFCREX EQU   IOBCYCCK                                                 05968000
IOBRPSTN EQU   IOBFLAG1                                                 05969000
IOBERRTN EQU   IOBFLAG1                                                 05970000
IOBCMDCH EQU   IOBFLAG1                                                 05971000
IOBDATCH EQU   IOBFLAG1                                                 05972000
IOBCNOPA EQU   IOBPREFX+12                                              05973000
IOBCICB  EQU   IOBPREFX+8                                               05974000
IOBCECB  EQU   IOBPREFX+4                                               05975000
IOBCONOP EQU   IOBPREFX+3                                               05976000
IOBCINOP EQU   IOBPREFX+2                                               05977000
IOBRSV05 EQU   IOBPREFX+1                                               05978000
IOBPCI   EQU   IOBCFLG1                                                 05979000
IOBRSTCH EQU   IOBCFLG1                                                 05980000
IOBABAPP EQU   IOBCFLG1                                                 05981000
IOBPTST  EQU   IOBCFLG1                                                 05982000
IOBRSV04 EQU   IOBCFLG1                                                 05983000
IOBRSV03 EQU   IOBCFLG1                                                 05984000
IOBRSV02 EQU   IOBCFLG1                                                 05985000
IOBRSV01 EQU   IOBCFLG1                                                 05986000
CVTLEVL  EQU   CVTRELNO+2                                               05987000
CVTNUMB  EQU   CVTRELNO                                                 05988000
CVTMDL   EQU   CVTFIX+250                                               05989000
@NM00002 EQU   CVTFIX+248                                               05990000
@NM00001 EQU   CVTFIX                                                   05991000
CVTRV482 EQU   CVTXTNT2+128                                             05992000
CVTRV481 EQU   CVTXTNT2+124                                             05993000
CVTRV480 EQU   CVTXTNT2+120                                             05994000
CVTRV479 EQU   CVTXTNT2+118                                             05995000
CVTRV478 EQU   CVTXTNT2+117                                             05996000
CVTRV477 EQU   CVTXTNT2+116                                             05997000
CVTRV476 EQU   CVTXTNT2+115                                             05998000
CVTRV475 EQU   CVTXTNT2+114                                             05999000
CVTRV474 EQU   CVTRV466                                                 06000000
CVTRV473 EQU   CVTRV466                                                 06001000
CVTRV472 EQU   CVTRV466                                                 06002000
CVTRV471 EQU   CVTRV466                                                 06003000
CVTRV470 EQU   CVTRV466                                                 06004000
CVTRV469 EQU   CVTRV466                                                 06005000
CVTRV468 EQU   CVTRV466                                                 06006000
CVTRV467 EQU   CVTRV466                                                 06007000
CVTRV465 EQU   CVTRV457                                                 06008000
CVTRV464 EQU   CVTRV457                                                 06009000
CVTRV463 EQU   CVTRV457                                                 06010000
CVTRV462 EQU   CVTRV457                                                 06011000
CVTRV461 EQU   CVTRV457                                                 06012000
CVTRV460 EQU   CVTRV457                                                 06013000
CVTRV459 EQU   CVTRV457                                                 06014000
CVTRV458 EQU   CVTRV457                                                 06015000
CVTRV456 EQU   CVTXTNT2+108                                             06016000
CVTRV455 EQU   CVTXTNT2+104                                             06017000
CVTRV454 EQU   CVTXTNT2+100                                             06018000
CVTRV453 EQU   CVTXTNT2+96                                              06019000
CVTRV452 EQU   CVTXTNT2+94                                              06020000
CVTRV451 EQU   CVTXTNT2+92                                              06021000
CVTRV450 EQU   CVTXTNT2+90                                              06022000
CVTRV449 EQU   CVTXTNT2+88                                              06023000
CVTRV448 EQU   CVTXTNT2+87                                              06024000
CVTRV447 EQU   CVTXTNT2+86                                              06025000
CVTRV446 EQU   CVTRV438                                                 06026000
CVTRV445 EQU   CVTRV438                                                 06027000
CVTRV444 EQU   CVTRV438                                                 06028000
CVTRV443 EQU   CVTRV438                                                 06029000
CVTRV442 EQU   CVTRV438                                                 06030000
CVTRV441 EQU   CVTRV438                                                 06031000
CVTRV440 EQU   CVTRV438                                                 06032000
CVTRV439 EQU   CVTRV438                                                 06033000
CVTRV437 EQU   CVTRV429                                                 06034000
CVTRV436 EQU   CVTRV429                                                 06035000
CVTRV435 EQU   CVTRV429                                                 06036000
CVTRV434 EQU   CVTRV429                                                 06037000
CVTRV433 EQU   CVTRV429                                                 06038000
CVTRV432 EQU   CVTRV429                                                 06039000
CVTRV431 EQU   CVTRV429                                                 06040000
CVTRV430 EQU   CVTRV429                                                 06041000
CVTRV428 EQU   CVTXTNT2+80                                              06042000
CVTRV427 EQU   CVTXTNT2+76                                              06043000
CVTRV426 EQU   CVTXTNT2+72                                              06044000
CVTRV425 EQU   CVTXTNT2+68                                              06045000
CVTATACT EQU   CVTATCVT                                                 06046000
CVTRV423 EQU   CVTXTNT2+62                                              06047000
CVTRV422 EQU   CVTXTNT2+60                                              06048000
CVTRV421 EQU   CVTXTNT2+58                                              06049000
CVTRV420 EQU   CVTXTNT2+56                                              06050000
CVTRV419 EQU   CVTXTNT2+55                                              06051000
CVTRV418 EQU   CVTXTNT2+54                                              06052000
CVTRV417 EQU   CVTRV409                                                 06053000
CVTRV416 EQU   CVTRV409                                                 06054000
CVTRV415 EQU   CVTRV409                                                 06055000
CVTRV414 EQU   CVTRV409                                                 06056000
CVTRV413 EQU   CVTRV409                                                 06057000
CVTRV412 EQU   CVTRV409                                                 06058000
CVTRV411 EQU   CVTRV409                                                 06059000
CVTRV410 EQU   CVTRV409                                                 06060000
CVTRV408 EQU   CVTRV400                                                 06061000
CVTRV407 EQU   CVTRV400                                                 06062000
CVTRV406 EQU   CVTRV400                                                 06063000
CVTRV405 EQU   CVTRV400                                                 06064000
CVTRV404 EQU   CVTRV400                                                 06065000
CVTRV403 EQU   CVTRV400                                                 06066000
CVTRV402 EQU   CVTRV400                                                 06067000
CVTRV401 EQU   CVTRV400                                                 06068000
CVTICB   EQU   CVTXTNT2+48                                              06069000
CVTSKTA  EQU   CVTXTNT2+44                                              06070000
CVTSHSB  EQU   CVTSHS                                                   06071000
CVTRSV98 EQU   CVTXTNT2+36                                              06072000
CVTRSV97 EQU   CVTXTNT2+34                                              06073000
CVTRSV96 EQU   CVTXTNT2+32                                              06074000
CVTOLTEP EQU   CVTXTNT2+28                                              06075000
CVTQIDA  EQU   CVTQID+1                                                 06076000
CVTRSV95 EQU   CVTQID                                                   06077000
CVTRSV94 EQU   CVTXTNT2+20                                              06078000
CVTRSV93 EQU   CVTXTNT2+16                                              06079000
CVTRSV92 EQU   CVTXTNT2+12                                              06080000
CVTDEBVR EQU   CVTXTNT2+8                                               06081000
CVTRSV91 EQU   CVTXTNT2+6                                               06082000
CVTRSV9H EQU   CVTFLGBT                                                 06083000
CVTRSV9G EQU   CVTFLGBT                                                 06084000
CVTRSV9F EQU   CVTFLGBT                                                 06085000
CVTRSV9E EQU   CVTFLGBT                                                 06086000
CVTRSV9D EQU   CVTFLGBT                                                 06087000
CVTRSV9C EQU   CVTFLGBT                                                 06088000
CVTVME   EQU   CVTFLGBT                                                 06089000
CVTNPE   EQU   CVTFLGBT                                                 06090000
CVTNUCLS EQU   CVTXTNT2+4                                               06091000
CVTDSSVA EQU   CVTDSSV+1                                                06092000
CVTRSV89 EQU   CVTDSSV                                                  06093000
CVTRSV88 EQU   CVTXTNT1+8                                               06094000
CVTRSV87 EQU   CVTXTNT1+4                                               06095000
CVTFACHN EQU   CVTXTNT1                                                 06096000
CVTRV488 EQU   CVTMAP+412                                               06097000
CVTRV487 EQU   CVTMAP+408                                               06098000
CVTRV486 EQU   CVTMAP+404                                               06099000
CVTRV485 EQU   CVTMAP+400                                               06100000
CVTACTAP EQU   CVTMAP+396                                               06101000
CVTAUTH  EQU   CVTMAP+392                                               06102000
CVTATMCA EQU   CVTATMCT+1                                               06103000
CVTATMST EQU   CVTATMCT                                                 06104000
CVTRSV61 EQU   CVTMAP+384                                               06105000
CVTVOLT1 EQU   CVTVOLM1+1                                               06106000
CVTVOLI1 EQU   CVTVOLF1                                                 06107000
CVTSTOA  EQU   CVTMAP+376                                               06108000
CVTRSV58 EQU   CVTMAP+374                                               06109000
CVTRSV57 EQU   CVTMAP+372                                               06110000
CVTDDCE  EQU   CVTMAP+368                                               06111000
CVTPNWFR EQU   CVTMAP+364                                               06112000
CVTSMF   EQU   CVTMAP+360                                               06113000
CVTSULK  EQU   CVTMAP+358                                               06114000
CVTSLKO  EQU   CVTSYSK                                                  06115000
CVTSLKP  EQU   CVTSYSK                                                  06116000
CVTSLKQ  EQU   CVTSYSK                                                  06117000
CVTSLKR  EQU   CVTSYSK                                                  06118000
CVTRSV56 EQU   CVTSYSK                                                  06119000
CVTRSV55 EQU   CVTSYSK                                                  06120000
CVTRSV54 EQU   CVTSYSK                                                  06121000
CVTRSV53 EQU   CVTSYSK                                                  06122000
CVTRSV52 EQU   CVTA1F1                                                  06123000
CVTRSV51 EQU   CVTA1F1                                                  06124000
CVTRSV50 EQU   CVTA1F1                                                  06125000
CVTRSV49 EQU   CVTA1F1                                                  06126000
CVTRSV48 EQU   CVTA1F1                                                  06127000
CVTRSV47 EQU   CVTA1F1                                                  06128000
CVTSRSW  EQU   CVTA1F1                                                  06129000
CVTPFSW  EQU   CVTA1F1                                                  06130000
CVTPCVT  EQU   CVTMAP+352                                               06131000
CVTRSV46 EQU   CVTMAP+344                                               06132000
CVTRSV45 EQU   CVTMAP+340                                               06133000
CVTRSV44 EQU   CVTMAP+338                                               06134000
CVTRSV43 EQU   CVTMAP+336                                               06135000
CVTHJESA EQU   CVTHJES+1                                                06136000
CVTRSV42 EQU   CVTHJES                                                  06137000
CVTEXT2A EQU   CVTEXT2+1                                                06138000
CVTRSV41 EQU   CVTEXT2                                                  06139000
CVTAPFA  EQU   CVTAPF+1                                                 06140000
CVTRSV40 EQU   CVTAPF                                                   06141000
CVTRV518 EQU   CVTINTLA                                                 06142000
CVTRV517 EQU   CVTERPV                                                  06143000
CVTEORM  EQU   CVTMAP+312                                               06144000
CVTMCHPR EQU   CVTMAP+308                                               06145000
CVTTZ    EQU   CVTMAP+304                                               06146000
CVTJEPS  EQU   CVTMAP+300                                               06147000
CVTJESCT EQU   CVTMAP+296                                               06148000
CVTMODE  EQU   CVTMAP+292                                               06149000
CVTPTRV  EQU   CVTMAP+288                                               06150000
CVTREAL  EQU   CVTMAP+284                                               06151000
CVTRSV39 EQU   CVTMAP+280                                               06152000
CVTRSV38 EQU   CVTMAP+276                                               06153000
CVTDMSRA EQU   CVTDMSR+1                                                06154000
CVTRV634 EQU   CVTDMSRF                                                 06155000
CVTRV633 EQU   CVTDMSRF                                                 06156000
CVTRV632 EQU   CVTDMSRF                                                 06157000
CVTRV631 EQU   CVTDMSRF                                                 06158000
CVTRV630 EQU   CVTDMSRF                                                 06159000
CVTRV629 EQU   CVTDMSRF                                                 06160000
CVTUDUMP EQU   CVTDMSRF                                                 06161000
CVTSDUMP EQU   CVTDMSRF                                                 06162000
CVTQMSGA EQU   CVTQMSG+1                                                06163000
CVTRSV36 EQU   CVTQMSG                                                  06164000
CVTAMFF  EQU   CVTMAP+264                                               06165000
CVTPURGA EQU   CVTPURG+1                                                06166000
CVTRSV35 EQU   CVTPURG                                                  06167000
CVTCBSP  EQU   CVTMAP+256                                               06168000
CVTATERA EQU   CVTATER+1                                                06169000
CVTSYST  EQU   CVTATER                                                  06170000
CVTVOLT2 EQU   CVTTAT                                                   06171000
CVTVOLI2 EQU   CVTVOLF2                                                 06172000
CVTAQAVB EQU   CVTAQAVT+1                                               06173000
CVTRSV34 EQU   CVTTCMFG                                                 06174000
CVTRSV33 EQU   CVTTCMFG                                                 06175000
CVTRSV32 EQU   CVTTCMFG                                                 06176000
CVTRSV31 EQU   CVTTCMFG                                                 06177000
CVTRSV30 EQU   CVTTCMFG                                                 06178000
CVTRSV29 EQU   CVTTCMFG                                                 06179000
CVTRSV28 EQU   CVTTCMFG                                                 06180000
CVTTCRDY EQU   CVTTCMFG                                                 06181000
CVTGTFA  EQU   CVTGTF+1                                                 06182000
CVTRSV27 EQU   CVTGTFST                                                 06183000
CVTRNIO  EQU   CVTGTFST                                                 06184000
CVTUSR   EQU   CVTGTFST                                                 06185000
CVTRV318 EQU   CVTFORM                                                  06186000
CVTRV317 EQU   CVTTMODE                                                 06187000
CVTRV316 EQU   CVTSTATE                                                 06188000
CVTRV315 EQU   CVTGTFS                                                  06189000
CVTGTFAV EQU   CVTGTFS                                                  06190000
CVT0SCR1 EQU   CVTMAP+232                                               06191000
CVTRV515 EQU   CVTMAP+228                                               06192000
CVTRMS   EQU   CVTMAP+224                                               06193000
CVTPATCH EQU   CVTMAP+220                                               06194000
CVTTSCE  EQU   CVTMAP+216                                               06195000
CVTLNKSC EQU   CVTMAP+214                                               06196000
CVTQABST EQU   CVTMAP+212                                               06197000
CVTMDLDS EQU   CVTMAP+208                                               06198000
CVTUSER  EQU   CVTMAP+204                                               06199000
CVTABEND EQU   CVTMAP+200                                               06200000
CVTSMCA  EQU   CVTMAP+196                                               06201000
CVTRSV18 EQU   CVTMAP+192                                               06202000
CVTQLPAQ EQU   CVTMAP+188                                               06203000
CVTQCDSR EQU   CVTMAP+184                                               06204000
CVTRSV17 EQU   CVTOPTB                                                  06205000
CVTRSV16 EQU   CVTOPTB                                                  06206000
CVTFP    EQU   CVTOPTB                                                  06207000
CVTAPTHR EQU   CVTOPTB                                                  06208000
CVTNLOG  EQU   CVTOPTB                                                  06209000
CVTTOD   EQU   CVTOPTB                                                  06210000
CVTCTIMS EQU   CVTOPTB                                                  06211000
CVTPROT  EQU   CVTOPTB                                                  06212000
CVTXPFP  EQU   CVTOPTA                                                  06213000
CVTASCII EQU   CVTOPTA                                                  06214000
CVTRSV13 EQU   CVTOPTA                                                  06215000
CVTRSV12 EQU   CVTOPTA                                                  06216000
CVTNIP   EQU   CVTOPTA                                                  06217000
CVTDDR   EQU   CVTOPTA                                                  06218000
CVTAPR   EQU   CVTOPTA                                                  06219000
CVTCCH   EQU   CVTOPTA                                                  06220000
CVTSNCTR EQU   CVTMAP+180                                               06221000
CVTQMWR  EQU   CVTMAP+176                                               06222000
CVTQOCR  EQU   CVTMAP+172                                               06223000
CVT1EF00 EQU   CVTMAP+168                                               06224000
CVTMZ00  EQU   CVTMAP+164                                               06225000
CVTHEAD  EQU   CVTMAP+160                                               06226000
CVTRSV11 EQU   CVTMAP+156                                               06227000
CVTMSER  EQU   CVTMAP+148                                               06228000
CVTRV516 EQU   CVTIERLC                                                 06229000
CVTILCH  EQU   CVTMAP+140                                               06230000
CVT0DS   EQU   CVTMAP+136                                               06231000
CVTFBOSV EQU   CVTMAP+132                                               06232000
CVTNUCB  EQU   CVTMAP+128                                               06233000
CVTIXAVL EQU   CVTMAP+124                                               06234000
CVTIOQET EQU   CVTMAP+120                                               06235000
CVTDCBA  EQU   CVTMAP+117                                               06236000
CVTMVS2  EQU   CVTDCB                                                   06237000
CVT6DAT  EQU   CVTDCB                                                   06238000
CVT4MPS  EQU   CVTDCB                                                   06239000
CVTRSV09 EQU   CVTDCB                                                   06240000
CVT4MS1  EQU   CVTDCB                                                   06241000
CVT2SPS  EQU   CVTDCB                                                   06242000
CVT1SSS  EQU   CVTDCB                                                   06243000
CVTRSV08 EQU   CVTDCB                                                   06244000
CVTSTB   EQU   CVTMAP+112                                               06245000
CVTQTD00 EQU   CVTMAP+108                                               06246000
CVTQTE00 EQU   CVTMAP+104                                               06247000
CVTCUCB  EQU   CVTMAP+100                                               06248000
CVTSJQ   EQU   CVTMAP+96                                                06249000
CVTPBLDL EQU   CVTMAP+92                                                06250000
CVTTPC   EQU   CVTMAP+88                                                06251000
CVTSVDCB EQU   CVTMAP+84                                                06252000
CVTBRET  EQU   CVTMAP+82                                                06253000
CVTEXIT  EQU   CVTMAP+80                                                06254000
CVT0FN00 EQU   CVTMAP+76                                                06255000
CVTDARA  EQU   CVTDAR+1                                                 06256000
CVTRSV07 EQU   CVTFLGS1                                                 06257000
CVTRSV06 EQU   CVTFLGS1                                                 06258000
CVTRSV05 EQU   CVTFLGS1                                                 06259000
CVTRSV04 EQU   CVTFLGS1                                                 06260000
CVTRSV03 EQU   CVTFLGS1                                                 06261000
CVTRSV02 EQU   CVTFLGS1                                                 06262000
CVTRSV01 EQU   CVTFLGS1                                                 06263000
CVTDMPLK EQU   CVTFLGS1                                                 06264000
CVTXITP  EQU   CVTMAP+68                                                06265000
CVTZDTAB EQU   CVTMAP+64                                                06266000
CVTMSLT  EQU   CVTMAP+60                                                06267000
CVTDATE  EQU   CVTMAP+56                                                06268000
CVTBTERM EQU   CVTMAP+52                                                06269000
CVTSYSAD EQU   CVTMAP+48                                                06270000
CVTXTLER EQU   CVTMAP+44                                                06271000
CVTILK2  EQU   CVTMAP+40                                                06272000
CVTILK1  EQU   CVTMAP+36                                                06273000
CVTPRLTV EQU   CVTMAP+32                                                06274000
CVTPCNVT EQU   CVTMAP+28                                                06275000
CVT0VL00 EQU   CVTMAP+24                                                06276000
CVTXAPG  EQU   CVTMAP+20                                                06277000
CVTBUF   EQU   CVTMAP+16                                                06278000
CVTJOB   EQU   CVTMAP+12                                                06279000
CVTLINK  EQU   CVTMAP+8                                                 06280000
CVT0EF00 EQU   CVTMAP+4                                                 06281000
CVTTCBP  EQU   CVTMAP                                                   06282000
CVT      EQU   CVTMAP                                                   06283000
@NM00035 EQU   PSA+3668                                                 06284000
PSASTAK  EQU   PSA+3072                                                 06285000
@NM00034 EQU   PSA+1048                                                 06286000
PSAUSEND EQU   PSA+1048                                                 06287000
PSARV062 EQU   PSA+1044                                                 06288000
PSACDAL  EQU   PSA+1040                                                 06289000
PSAWTCOD EQU   PSA+1036                                                 06290000
PSAATCVT EQU   PSA+1032                                                 06291000
PSAPCPSW EQU   PSA+1024                                                 06292000
PSAPIR2  EQU   PSA+1020                                                 06293000
PSARV059 EQU   PSA+1018                                                 06294000
PSASVC13 EQU   PSA+1016                                                 06295000
PSALSFCC EQU   PSA+1012                                                 06296000
PSASFACC EQU   PSA+1008                                                 06297000
PSASTOP  EQU   PSA+992                                                  06298000
PSASTART EQU   PSA+976                                                  06299000
PSARSPSW EQU   PSA+968                                                  06300000
PSASRPSW EQU   PSA+960                                                  06301000
PSARV045 EQU   PSA+892                                                  06302000
PSARV044 EQU   PSA+888                                                  06303000
PSARV043 EQU   PSA+884                                                  06304000
PSARV042 EQU   PSA+880                                                  06305000
PSARV041 EQU   PSA+876                                                  06306000
PSARV040 EQU   PSA+872                                                  06307000
PSARV025 EQU   PSA+868                                                  06308000
PSADSSED EQU   PSA+868                                                  06309000
PSADSSPR EQU   PSA+864                                                  06310000
PSADSSFW EQU   PSA+860                                                  06311000
PSADSS14 EQU   PSA+856                                                  06312000
PSADSSPP EQU   PSA+848                                                  06313000
PSADSSRP EQU   PSA+840                                                  06314000
PSADSS05 EQU   PSADSSF4                                                 06315000
PSADSS10 EQU   PSADSSF4                                                 06316000
PSADSSVE EQU   PSADSSF4                                                 06317000
PSADSSDE EQU   PSADSSF4                                                 06318000
PSADSSC0 EQU   PSADSSF4                                                 06319000
PSADSSIE EQU   PSADSSF4                                                 06320000
PSADSS12 EQU   PSADSSF4                                                 06321000
PSADSSRC EQU   PSADSSF4                                                 06322000
PSARV057 EQU   PSADSSF3                                                 06323000
PSARV056 EQU   PSADSSF3                                                 06324000
PSARV055 EQU   PSADSSF3                                                 06325000
PSADSSMC EQU   PSADSSF3                                                 06326000
PSADSSRW EQU   PSADSSF3                                                 06327000
PSADSSNM EQU   PSADSSF3                                                 06328000
PSADSSES EQU   PSADSSF3                                                 06329000
PSADSSGP EQU   PSADSSF3                                                 06330000
PSADSSF2 EQU   PSADSSFL+1                                               06331000
PSADSSPI EQU   PSADSSF1                                                 06332000
PSADSSOI EQU   PSADSSF1                                                 06333000
PSADSSSP EQU   PSADSSF1                                                 06334000
PSADSSTP EQU   PSADSSF1                                                 06335000
PSADSSDW EQU   PSADSSF1                                                 06336000
PSADSSDD EQU   PSADSSF1                                                 06337000
PSADSSDM EQU   PSADSSF1                                                 06338000
PSADSSMV EQU   PSADSSF1                                                 06339000
PSADSSTS EQU   PSA+816                                                  06340000
PSADSSWK EQU   PSA+812                                                  06341000
PSADSSR3 EQU   PSA+808                                                  06342000
PSADSSR2 EQU   PSA+804                                                  06343000
PSADSSRS EQU   PSA+800                                                  06344000
PSASTOR  EQU   PSA+796                                                  06345000
PSACPUSA EQU   PSA+794                                                  06346000
PSAVSTAP EQU   PSA+792                                                  06347000
PSAWKVAP EQU   PSA+788                                                  06348000
PSAWKRAP EQU   PSA+784                                                  06349000
PSAMCHIC EQU   PSA+783                                                  06350000
PSARV061 EQU   PSA+782                                                  06351000
PSASYMSK EQU   PSA+781                                                  06352000
PSAMCHFL EQU   PSA+780                                                  06353000
PSACR0   EQU   PSA+776                                                  06354000
PSAPSWSV EQU   PSA+768                                                  06355000
PSACLHS  EQU   PSAHLHI                                                  06356000
PSALKR15 EQU   PSALKSA+60                                               06357000
PSALKR14 EQU   PSALKSA+56                                               06358000
PSALKR13 EQU   PSALKSA+52                                               06359000
PSALKR12 EQU   PSALKSA+48                                               06360000
PSALKR11 EQU   PSALKSA+44                                               06361000
PSALKR10 EQU   PSALKSA+40                                               06362000
PSALKR9  EQU   PSALKSA+36                                               06363000
PSALKR8  EQU   PSALKSA+32                                               06364000
PSALKR7  EQU   PSALKSA+28                                               06365000
PSALKR6  EQU   PSALKSA+24                                               06366000
PSALKR5  EQU   PSALKSA+20                                               06367000
PSALKR4  EQU   PSALKSA+16                                               06368000
PSALKR3  EQU   PSALKSA+12                                               06369000
PSALKR2  EQU   PSALKSA+8                                                06370000
PSALKR1  EQU   PSALKSA+4                                                06371000
PSALKR0  EQU   PSALKSA                                                  06372000
PSARV023 EQU   PSACLHT+52                                               06373000
PSALOCAL EQU   PSACLHT+48                                               06374000
PSACMSL  EQU   PSACLHT+44                                               06375000
PSAOPTL  EQU   PSACLHT+40                                               06376000
PSATPACL EQU   PSACLHT+36                                               06377000
PSATPDNL EQU   PSACLHT+32                                               06378000
PSATPNCL EQU   PSACLHT+28                                               06379000
PSAIOSLL EQU   PSACLHT+24                                               06380000
PSAIOSUL EQU   PSACLHT+20                                               06381000
PSAIOSCL EQU   PSACLHT+16                                               06382000
PSAIOSSL EQU   PSACLHT+12                                               06383000
PSASALCL EQU   PSACLHT+8                                                06384000
PSAASML  EQU   PSACLHT+4                                                06385000
PSADISPL EQU   PSACLHT                                                  06386000
PSASRSA  EQU   PSA+636                                                  06387000
PSARV050 EQU   PSA+634                                                  06388000
PSADSSGO EQU   PSA+633                                                  06389000
PSARECUR EQU   PSA+632                                                  06390000
PSAHLHIS EQU   PSA+628                                                  06391000
PSAIPCSA EQU   PSA+624                                                  06392000
@NM00033 EQU   PSA+621                                                  06393000
PSAIPCDM EQU   PSA+620                                                  06394000
PSAIPCD  EQU   PSA+616                                                  06395000
@NM00032 EQU   PSA+613                                                  06396000
PSAIPCRM EQU   PSA+612                                                  06397000
PSAIPCR  EQU   PSA+608                                                  06398000
PSAMCHEX EQU   PSA+600                                                  06399000
PSAMPSW  EQU   PSA+592                                                  06400000
PSAEXPS2 EQU   PSA+584                                                  06401000
PSAEXPS1 EQU   PSA+576                                                  06402000
PSAPIREG EQU   PSA+572                                                  06403000
PSARSREG EQU   PSA+568                                                  06404000
PSAGPREG EQU   PSA+556                                                  06405000
PSARV022 EQU   PSASUP4                                                  06406000
PSARV021 EQU   PSASUP4                                                  06407000
PSARV020 EQU   PSASUP4                                                  06408000
PSARV019 EQU   PSASUP4                                                  06409000
PSARV018 EQU   PSASUP4                                                  06410000
PSARV017 EQU   PSASUP4                                                  06411000
PSARV016 EQU   PSASUP4                                                  06412000
PSARV015 EQU   PSASUP4                                                  06413000
PSARV014 EQU   PSASUP3                                                  06414000
PSARV013 EQU   PSASUP3                                                  06415000
PSARV012 EQU   PSASUP3                                                  06416000
PSARV011 EQU   PSASUP3                                                  06417000
PSASPR   EQU   PSASUP3                                                  06418000
PSAPSREG EQU   PSASUP3                                                  06419000
PSAPI2   EQU   PSASUP3                                                  06420000
PSAIOSUP EQU   PSASUP3                                                  06421000
PSALCR   EQU   PSASUP2                                                  06422000
PSARTM   EQU   PSASUP2                                                  06423000
PSAACR   EQU   PSASUP2                                                  06424000
PSAIPCE2 EQU   PSASUP2                                                  06425000
PSAIPCES EQU   PSASUP2                                                  06426000
PSAIPCEC EQU   PSASUP2                                                  06427000
PSAGTF   EQU   PSASUP2                                                  06428000
PSAIPCRI EQU   PSASUP2                                                  06429000
PSARV063 EQU   PSASUP1                                                  06430000
PSATCTL  EQU   PSASUP1                                                  06431000
PSADISP  EQU   PSASUP1                                                  06432000
PSALOCK  EQU   PSASUP1                                                  06433000
PSAPI    EQU   PSASUP1                                                  06434000
PSAEXT   EQU   PSASUP1                                                  06435000
PSASVC   EQU   PSASUP1                                                  06436000
PSAIO    EQU   PSASUP1                                                  06437000
PSAAOLD  EQU   PSA+548                                                  06438000
PSAANEW  EQU   PSA+544                                                  06439000
PSATOLD  EQU   PSA+540                                                  06440000
PSATNEW  EQU   PSA+536                                                  06441000
PSALCCAR EQU   PSA+532                                                  06442000
PSALCCAV EQU   PSA+528                                                  06443000
PSAPCCAR EQU   PSA+524                                                  06444000
PSAPCCAV EQU   PSA+520                                                  06445000
PSACPULA EQU   PSA+518                                                  06446000
PSACPUPA EQU   PSA+516                                                  06447000
PSAPSA   EQU   PSA+512                                                  06448000
FLCHDEND EQU   PSA+512                                                  06449000
FLCCRSAV EQU   FLCMCLA+280                                              06450000
FLCGRSAV EQU   FLCMCLA+216                                              06451000
FLCFPSAV EQU   FLCMCLA+184                                              06452000
FLCFLA   EQU   FLCMCLA+88                                               06453000
FLCRGNCD EQU   FLCMCLA+84                                               06454000
FLCFSAA  EQU   FLCFSA+1                                                 06455000
@NM00031 EQU   FLCFSA                                                   06456000
@NM00030 EQU   FLCMCLA+72                                               06457000
FLCMCIC  EQU   FLCMCLA+64                                               06458000
@NM00029 EQU   FLCMCLA+20                                               06459000
FLCIOAA  EQU   FLCIOA+1                                                 06460000
@NM00028 EQU   FLCIOA                                                   06461000
@NM00027 EQU   FLCMCLA+15                                               06462000
@NM00026 EQU   FLCMCLA+14                                               06463000
@NM00025 EQU   FLCMCLA+12                                               06464000
FLCLCL   EQU   FLCMCLA+8                                                06465000
FLCIOELA EQU   FLCIOEL+1                                                06466000
@NM00024 EQU   FLCIOEL                                                  06467000
FLCCHNID EQU   FLCMCLA                                                  06468000
@NM00023 EQU   PSA+160                                                  06469000
FLCMTRCD EQU   PSA+157                                                  06470000
@NM00022 EQU   PSA+156                                                  06471000
FLCPERA  EQU   FLCPER+1                                                 06472000
@NM00021 EQU   FLCPER                                                   06473000
@NM00020 EQU   PSA+151                                                  06474000
FLCPERCD EQU   PSA+150                                                  06475000
FLCMCNUM EQU   PSA+149                                                  06476000
@NM00019 EQU   PSA+148                                                  06477000
FLCTEAA  EQU   FLCTEA+1                                                 06478000
@NM00018 EQU   FLCTEA                                                   06479000
PSAPIPC  EQU   PSAPICOD                                                 06480000
PSAPIMC  EQU   PSAPICOD                                                 06481000
PSAPIPER EQU   PSAPICOD                                                 06482000
PSARV049 EQU   FLCPICOD                                                 06483000
FLCPILCB EQU   FLCPIILC                                                 06484000
@NM00017 EQU   FLCPIILC                                                 06485000
@NM00016 EQU   PSAEPPSW                                                 06486000
FLCSVCN  EQU   PSAESPSW+2                                               06487000
FLCSILCB EQU   FLCSVILC                                                 06488000
@NM00015 EQU   FLCSVILC                                                 06489000
@NM00014 EQU   PSAESPSW                                                 06490000
FLCEICOD EQU   PSAEEPSW+2                                               06491000
PSASPAD  EQU   PSAEEPSW                                                 06492000
@NM00013 EQU   PSA+128                                                  06493000
FLCINPSW EQU   PSA+120                                                  06494000
FLCMNPSW EQU   PSA+112                                                  06495000
FLCPNPSW EQU   PSA+104                                                  06496000
FLCSNPSW EQU   PSA+96                                                   06497000
FLCENPSW EQU   PSA+88                                                   06498000
FLCTRACE EQU   PSA+84                                                   06499000
FLCTIMER EQU   PSA+80                                                   06500000
FLCCVT2  EQU   PSA+76                                                   06501000
FLCCAW   EQU   PSA+72                                                   06502000
FLCCSW   EQU   PSA+64                                                   06503000
FLCIOPSW EQU   PSA+56                                                   06504000
FLCMOPSW EQU   PSA+48                                                   06505000
FLCPOPSW EQU   PSA+40                                                   06506000
FLCSOPSW EQU   PSA+32                                                   06507000
FLCEOPSW EQU   PSA+24                                                   06508000
@NM00012 EQU   FLCICCW2+4                                               06509000
FLCCVT   EQU   FLCICCW2                                                 06510000
FLCICCW1 EQU   FLCROPSW                                                 06511000
FLCIPPSW EQU   FLCRNPSW                                                 06512000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      06513000
@RC00646 EQU   @RC00645                                                 06514000
@RC00722 EQU   @RC00714                                                 06515000
@RC01010 EQU   @RC01007                                                 06516000
@RC00975 EQU   @RC00970                                                 06517000
@RC01191 EQU   @RC01183                                                 06518000
CVSCOPY# EQU   @RC00646                                                 06519000
@RC00977 EQU   @RC00975                                                 06520000
@RC00998 EQU   @RC00975                                                 06521000
@RC01000 EQU   @RC00998                                                 06522000
@RC01103 EQU   @RC01000                                                 06523000
@ENDDATA EQU   *                                                        06524000
         END   ISTINCVS,(C'PLS2246',0603,76205)                         06525000
