         TITLE 'ISTINMDD - MVS DEVICE DEALLOCATION ROUTINE             *00001000
                        '                                               00002000
ISTINMDD CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTINMDD  78.206'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
         L     @00,@SIZDATD                                        0001 00014000
         GETMAIN  R,LV=(0)                                              00015000
         LR    @11,@01                                             0001 00016000
         USING @DATD,@11                                           0001 00017000
         ST    @13,@SA00001+4                                      0001 00018000
         LM    @00,@01,20(@13)                                     0001 00019000
         ST    @11,8(,@13)                                         0001 00020000
         LR    @13,@11                                             0001 00021000
*                                                                  0272 00022000
*                            /* ISTINMDD CODE STARTS HERE            */ 00023000
*                                                                  0272 00024000
*                            /* BASIC LOOP IDENTIFIES UCBS FOR VTAM  */ 00025000
*                            /* AND RESETS FIELDS BEFORE DEALLOCA-   */ 00026000
*                            /* TION OF DEVICES                      */ 00027000
*                                                                  0272 00028000
*                            /* RTM HAS PURGED DEVICES BEFORE THIS   */ 00029000
*                                                                  0272 00030000
* WKS99RBP = ADDR(WKAS99RB);  /* SET PTR TO S99RB AREA               */ 00031000
         LA    @10,WKAS99RB                                        0272 00032000
         ST    @10,WKS99RBP                                        0272 00033000
* S99RBPND = ON;              /* THESE FIELDS REMAIN CONSTANT FOR    */ 00034000
         LA    @09,WKS99RBP                                        0273 00035000
         OI    S99RBPND(@09),B'10000000'                           0273 00036000
* S99RB = S99RB && S99RB;     /* ALL CALLS TO DEALLOCATE DEVICES     */ 00037000
         XC    S99RB(20,@10),S99RB(@10)                            0274 00038000
* S99RBLN = LENGTH(S99RB);                                         0275 00039000
         MVI   S99RBLN(@10),X'14'                                  0275 00040000
* S99VERB = S99VRBUN;                                              0276 00041000
         MVI   S99VERB(@10),X'02'                                  0276 00042000
* S99TXTPP = ADDR(S99TUP1);                                        0277 00043000
         LA    @00,S99TUP1                                         0277 00044000
         ST    @00,S99TXTPP(,@10)                                  0277 00045000
* S99TUP1 = ADDR(S99TU1);                                          0278 00046000
         LA    @10,S99TU1                                          0278 00047000
         ST    @10,S99TUP1                                         0278 00048000
* S99TUEND = ON;                                                   0279 00049000
         OI    S99TUEND,B'10000000'                                0279 00050000
* S99NUM1 = ONE;                                                   0280 00051000
         MVC   S99NUM1(2),@CH00060                                 0280 00052000
* S99KEY1= DUNDDNAM;                                               0281 00053000
         MVC   S99KEY1(2),@CB03142                                 0281 00054000
* S99LEN1 = LENGTH(S99PARM1);                                      0282 00055000
         LA    @10,8                                               0282 00056000
         STH   @10,S99LEN1                                         0282 00057000
* R13 = R13 + ADJ;           /* ADJUST SAVEAREA PTR FOR IOSGEN       */ 00058000
*                                                                  0283 00059000
         ALR   R13,@10                                             0283 00060000
*                            /* MAJOR LOOP TO FIND DEVICES           */ 00061000
* DO UCBNUM = 0 TO 4095 BY 1;                                      0284 00062000
         SLR   UCBNUM,UCBNUM                                       0284 00063000
@DL00284 DS    0H                                                  0285 00064000
*   R6 = UCBNUM;                                                   0285 00065000
         LR    R6,UCBNUM                                           0285 00066000
*   R15 = ZERO;                                                    0286 00067000
*                                                                  0286 00068000
         SLR   R15,R15                                             0286 00069000
*   GEN REFS(CVTILK1,CVTILK2,CVTIXAVL,CVTMAP,IOCOMEX,CVTPTR,IOCOM,IOX,  00070000
*             IOCUCBBM,IOXHICH) SETS(UCBPTR);                      0287 00071000
*                                                                  0287 00072000
        IOSGEN UCBLOOK,UCB=(UCBPTR),REG=(R6)                            00073000
*   IF R15 = ZERO            /* TEST FOR VALID UCB FOR THIS CUA     */  00074000
*                                                                  0288 00075000
*     THEN                    /* VALID UCB ENTRY                     */ 00076000
         SLR   @10,@10                                             0288 00077000
         CR    R15,@10                                             0288 00078000
         BNE   @RF00288                                            0288 00079000
*       IF UCBONLI = ON &     /* DEVICE ONLINE                       */ 00080000
*          UCBALOC = ON &     /* AND ALLOCATED                       */ 00081000
*          UCBASID = AVTASID  /* AND BELONGS TO VTAM                 */ 00082000
*         &(UCB3COMM = ON |   /* AND IS EITHER 370X,3790 OR 3270     */ 00083000
*           UCB3DISP = ON)    /*                                     */ 00084000
*                                                                  0289 00085000
*       THEN                                                       0289 00086000
         TM    UCBONLI(UCBPTR),B'10001000'                         0289 00087000
         BNO   @RF00289                                            0289 00088000
         L     @04,UCBEXTPT(,UCBPTR)                               0289 00089000
         L     @09,FLCCVT                                          0289 00090000
         L     @09,CVTEXT2(,@09)                                   0289 00091000
         L     @09,CVTATCVT(,@09)                                  0289 00092000
         CLC   UCBASID(2,@04),AVTASID(@09)                         0289 00093000
         BNE   @RF00289                                            0289 00094000
         TM    UCB3COMM(UCBPTR),B'01010000'                        0289 00095000
         BZ    @RF00289                                            0289 00096000
*         DO;                                                      0290 00097000
*           IF UCB3COMM = ON  /* FOR 370X, RESET INDICES TO ZERO     */ 00098000
*           THEN                                                   0291 00099000
         TM    UCB3COMM(UCBPTR),B'01000000'                        0291 00100000
         BNO   @RF00291                                            0291 00101000
*             DO;                                                  0292 00102000
* /*       UNHOOK TPIOS APPENDAGE FROM ICNCB                 @ZA33118*/ 00103000
*          UCBICNCB->ICNAPPAD = ADDR(ATCLCPTR->ATCDAPVT);  /*@ZA33118*/ 00104000
         L     @09,UCBICNCB(,UCBPTR)                               0293 00105000
         L     @08,ATCLCPTR                                        0293 00106000
         LA    @00,ATCDAPVT(,@08)                                  0293 00107000
         STCM  @00,7,ICNAPPAD(@09)                                 0293 00108000
*               UCBATI = HEXZERO;                                  0294 00109000
         MVI   UCBATI(@04),X'00'                                   0294 00110000
*               UCBETI = HEXZERO;                                  0295 00111000
         MVI   UCBETI(@04),X'00'                                   0295 00112000
*               UCBICNCB = ZERO;                                   0296 00113000
         ST    @10,UCBICNCB(,UCBPTR)                               0296 00114000
*             END;                                                 0297 00115000
*           ELSE                                                   0298 00116000
*             DO;             /* FOR 3270 OR 3790                    */ 00117000
         B     @RC00291                                            0298 00118000
@RF00291 DS    0H                                                  0299 00119000
* /*       UNHOOK TPIOS APPENDAGE FROM LDNCB                 @ZA33118*/ 00120000
*          UCBLDNCB->LDNAPPAD = ADDR(ATCLCPTR->ATCDAPVT);  /*@ZA33118*/ 00121000
         L     @10,UCBLDNCB-1(,UCBPTR)                             0299 00122000
         LA    @10,0(,@10)                                         0299 00123000
         L     @04,ATCLCPTR                                        0299 00124000
         LA    @04,ATCDAPVT(,@04)                                  0299 00125000
         STCM  @04,7,LDNAPPAD(@10)                                 0299 00126000
*               UCBATI = '1C'X;                                    0300 00127000
         L     @10,UCBEXTPT(,UCBPTR)                               0300 00128000
         MVI   UCBATI(@10),X'1C'                                   0300 00129000
*               UCBETI = '69'X;                                    0301 00130000
         MVI   UCBETI(@10),X'69'                                   0301 00131000
*               UCBLDNCB = ZERO;                                   0302 00132000
         SLR   @10,@10                                             0302 00133000
         STCM  @10,7,UCBLDNCB(UCBPTR)                              0302 00134000
*             END;                                                 0303 00135000
*                          /* SET UP PARAMETER LIST FOR DEALLOCATION */ 00136000
*           S99PARM1 ='';                                          0304 00137000
@RC00291 MVI   S99PARM1,C' '                                       0304 00138000
         MVC   S99PARM1+1(7),S99PARM1                              0304 00139000
*           S99PARM1(1:2) = TP;                                    0305 00140000
         MVC   S99PARM1(2),@CC03376                                0305 00141000
*           S99PARM1(3:5) = UCBNAME;                               0306 00142000
         MVC   S99PARM1+2(3),UCBNAME(UCBPTR)                       0306 00143000
*           R1 = ADDR(S99RBPTR);                                   0307 00144000
*                                                                  0307 00145000
         LA    R1,WKS99RBP                                         0307 00146000
*           GEN(SVC 99);      /* SYSTEM DEALLOCATION                 */ 00147000
*                                                                  0308 00148000
         SVC 99                                                         00149000
*         END;                                                     0309 00150000
*                                                                  0309 00151000
*       ELSE;                 /* DEVICE DOES NOT BELONG TO VTAM      */ 00152000
@RF00289 DS    0H                                                  0311 00153000
*     ELSE;                   /* INVALID UCB FOR THIS CUA            */ 00154000
@RF00288 DS    0H                                                  0312 00155000
* END;                        /* END OF LOOP THROUGH UCBS            */ 00156000
*                                                                  0312 00157000
         AL    UCBNUM,@CF00060                                     0312 00158000
         C     UCBNUM,@CF03391                                     0312 00159000
         BNH   @DL00284                                            0312 00160000
* R13 = R13 - ADJ;            /* ADJUST SAVEAREA POINTER BACK        */ 00161000
*                                                                  0313 00162000
*                                                                  0313 00163000
         SL    R13,@CF00058                                        0313 00164000
*/* TPEPILOG   */                                                  0314 00165000
* GEN (PRINT OFF);                                                 0314 00166000
*                                                                  0314 00167000
         PRINT OFF                                                      00168000
* GEN (PRINT ON);                                                  0315 00169000
         PRINT ON                                                       00170000
*/* END OF TPEPILOG */                   /* END OF PROCEDURE       0316 00171000
*        */                                                        0316 00172000
*END ISTINMDD                                                      0316 00173000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00174000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00175000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                        * 00176000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        * 00177000
*/*%INCLUDE SYSLIB  (IEZIOB  )                                        * 00178000
*/*%INCLUDE SYSLIB  (IECDIOCM)                                        * 00179000
*/*%INCLUDE SYSLIB  (IECDIOCX)                                        * 00180000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                        * 00181000
*/*%INCLUDE SYSLIB  (IHASRB  )                                        * 00182000
*/*%INCLUDE SYSLIB  (IEFZB4D0)                                        * 00183000
*/*%INCLUDE SYSLIB  (IEFZB4D2)                                        * 00184000
*;                                                                 0316 00185000
@EL00001 L     @13,4(,@13)                                         0316 00186000
@EF00001 L     @00,@SIZDATD                                        0316 00187000
         LR    @01,@11                                             0316 00188000
         FREEMAIN R,LV=(0),A=(1)                                        00189000
@ER00001 LM    @14,@12,12(@13)                                     0316 00190000
         BR    @14                                                 0316 00191000
@DATA    DS    0H                                                       00192000
@DATD    DSECT                                                          00193000
         DS    0F                                                       00194000
@SA00001 DS    18F                                                      00195000
ISTINMDD CSECT                                                          00196000
         DS    0F                                                       00197000
@CF00060 DC    F'1'                                                     00198000
@CH00060 EQU   @CF00060+2                                               00199000
@CF00058 DC    F'8'                                                     00200000
@CF03391 DC    F'4095'                                                  00201000
@DATD    DSECT                                                          00202000
         DS    0D                                                       00203000
IOBPRPTR DS    A                                                        00204000
IOBSTPTR DS    A                                                        00205000
IOCOMPTR DS    A                                                        00206000
IOCXPTR  DS    A                                                        00207000
IOSBPTR  DS    A                                                        00208000
SRBPTR   DS    A                                                        00209000
LDNCBPTR DS    A                                                        00210000
S99TUFP  DS    A                                                        00211000
WKS99RBP DS    A                                                        00212000
S99TUS   DS    CL18                                                     00213000
         ORG   S99TUS                                                   00214000
S99TUP1  DS    AL4                                                      00215000
         ORG   S99TUP1                                                  00216000
S99TUEND DS    BL1                                                      00217000
         ORG   S99TUS+4                                                 00218000
S99TU1   DS    CL14                                                     00219000
         ORG   S99TU1                                                   00220000
S99KEY1  DS    CL2                                                      00221000
S99NUM1  DS    CL2                                                      00222000
S99LEN1  DS    CL2                                                      00223000
S99PARM1 DS    CL8                                                      00224000
         ORG   S99TUS+18                                                00225000
WKAS99RB DS    CL20                                                     00226000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00227000
@ENDDATD EQU   *                                                        00228000
ISTINMDD CSECT                                                          00229000
         DS    0F                                                       00230000
@SIZDATD DC    AL1(0)                                                   00231000
         DC    AL3(@ENDDATD-@DATD)                                      00232000
         DS    0D                                                       00233000
@CC03376 DC    C'TP'                                                    00234000
@CB03142 DC    X'0001'                                                  00235000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00236000
@01      EQU   01                                                       00237000
@02      EQU   02                                                       00238000
@03      EQU   03                                                       00239000
@04      EQU   04                                                       00240000
@05      EQU   05                                                       00241000
@06      EQU   06                                                       00242000
@07      EQU   07                                                       00243000
@08      EQU   08                                                       00244000
@09      EQU   09                                                       00245000
@10      EQU   10                                                       00246000
@11      EQU   11                                                       00247000
@12      EQU   12                                                       00248000
@13      EQU   13                                                       00249000
@14      EQU   14                                                       00250000
@15      EQU   15                                                       00251000
UCBNUM   EQU   @05                                                      00252000
UCBPTR   EQU   @07                                                      00253000
RPHPTR   EQU   @01                                                      00254000
R13      EQU   @13                                                      00255000
R14      EQU   @14                                                      00256000
R15      EQU   @15                                                      00257000
R6       EQU   @06                                                      00258000
R1       EQU   @01                                                      00259000
CVTPTR   EQU   16                                                       00260000
PSA      EQU   0                                                        00261000
FLCRNPSW EQU   PSA                                                      00262000
FLCROPSW EQU   PSA+8                                                    00263000
FLCICCW2 EQU   PSA+16                                                   00264000
FLCCVT   EQU   FLCICCW2                                                 00265000
PSAEEPSW EQU   PSA+132                                                  00266000
PSAESPSW EQU   PSA+136                                                  00267000
FLCSVILC EQU   PSAESPSW+1                                               00268000
PSAEPPSW EQU   PSA+140                                                  00269000
FLCPIILC EQU   PSAEPPSW+1                                               00270000
FLCPICOD EQU   PSAEPPSW+2                                               00271000
PSAPICOD EQU   FLCPICOD+1                                               00272000
FLCTEA   EQU   PSAEPPSW+4                                               00273000
FLCPER   EQU   PSA+152                                                  00274000
FLCMCLA  EQU   PSA+168                                                  00275000
FLCIOEL  EQU   FLCMCLA+4                                                00276000
FLCIOA   EQU   FLCMCLA+16                                               00277000
FLCFSA   EQU   FLCMCLA+80                                               00278000
PSASUPER EQU   PSA+552                                                  00279000
PSASUP1  EQU   PSASUPER                                                 00280000
PSASUP2  EQU   PSASUPER+1                                               00281000
PSASUP3  EQU   PSASUPER+2                                               00282000
PSASUP4  EQU   PSASUPER+3                                               00283000
PSACLHT  EQU   PSA+640                                                  00284000
PSALKSA  EQU   PSA+696                                                  00285000
PSAHLHI  EQU   PSA+760                                                  00286000
PSADSSFL EQU   PSA+836                                                  00287000
PSADSSF1 EQU   PSADSSFL                                                 00288000
PSADSSF3 EQU   PSADSSFL+2                                               00289000
PSADSSF4 EQU   PSADSSFL+3                                               00290000
PSARSVT  EQU   PSA+896                                                  00291000
ATCLCPTR EQU   1032                                                     00292000
CVTMAP   EQU   0                                                        00293000
CVTILK1  EQU   CVTMAP+36                                                00294000
CVTILK2  EQU   CVTMAP+40                                                00295000
CVTDAR   EQU   CVTMAP+72                                                00296000
CVTFLGS1 EQU   CVTDAR                                                   00297000
CVTDCB   EQU   CVTMAP+116                                               00298000
CVTIXAVL EQU   CVTMAP+124                                               00299000
CVTIERLC EQU   CVTMAP+144                                               00300000
CVTOPTA  EQU   CVTMAP+182                                               00301000
CVTOPTB  EQU   CVTMAP+183                                               00302000
CVTGTF   EQU   CVTMAP+236                                               00303000
CVTGTFST EQU   CVTGTF                                                   00304000
CVTGTFS  EQU   CVTGTFST                                                 00305000
CVTSTATE EQU   CVTGTFST                                                 00306000
CVTTMODE EQU   CVTGTFST                                                 00307000
CVTFORM  EQU   CVTGTFST                                                 00308000
CVTAQAVT EQU   CVTMAP+240                                               00309000
CVTTCMFG EQU   CVTAQAVT                                                 00310000
CVTVOLM2 EQU   CVTMAP+244                                               00311000
CVTTATA  EQU   CVTVOLM2                                                 00312000
CVTTSKS  EQU   CVTTATA                                                  00313000
CVTVOLF2 EQU   CVTTSKS                                                  00314000
CVTTAT   EQU   CVTTATA+1                                                00315000
CVTATER  EQU   CVTMAP+248                                               00316000
CVTEXT1  EQU   CVTMAP+252                                               00317000
CVTPURG  EQU   CVTMAP+260                                               00318000
CVTQMSG  EQU   CVTMAP+268                                               00319000
CVTDMSR  EQU   CVTMAP+272                                               00320000
CVTRSV37 EQU   CVTDMSR                                                  00321000
CVTDMSRF EQU   CVTRSV37                                                 00322000
CVTERPV  EQU   CVTMAP+316                                               00323000
CVTINTLA EQU   CVTMAP+320                                               00324000
CVTAPF   EQU   CVTMAP+324                                               00325000
CVTEXT2  EQU   CVTMAP+328                                               00326000
CVTHJES  EQU   CVTMAP+332                                               00327000
CVTPGSIA EQU   CVTMAP+348                                               00328000
CVTA1F1  EQU   CVTMAP+356                                               00329000
CVTSYSK  EQU   CVTMAP+357                                               00330000
CVTVOLM1 EQU   CVTMAP+380                                               00331000
CVTVOLF1 EQU   CVTVOLM1                                                 00332000
CVTATMCT EQU   CVTMAP+388                                               00333000
CVTXTNT1 EQU   0                                                        00334000
CVTXTNT2 EQU   0                                                        00335000
CVTDSSV  EQU   CVTXTNT2                                                 00336000
CVTFLGBT EQU   CVTXTNT2+5                                               00337000
CVTQID   EQU   CVTXTNT2+24                                              00338000
CVTSHS   EQU   CVTXTNT2+40                                              00339000
CVTRV400 EQU   CVTXTNT2+52                                              00340000
CVTRV409 EQU   CVTXTNT2+53                                              00341000
CVTATCVT EQU   CVTXTNT2+64                                              00342000
CVTRV429 EQU   CVTXTNT2+84                                              00343000
CVTRV438 EQU   CVTXTNT2+85                                              00344000
CVTRV457 EQU   CVTXTNT2+112                                             00345000
CVTRV466 EQU   CVTXTNT2+113                                             00346000
CVTFIX   EQU   0                                                        00347000
CVTRELNO EQU   CVTFIX+252                                               00348000
UCB      EQU   0                                                        00349000
UCBOB    EQU   0                                                        00350000
UCBJBNR  EQU   UCBOB                                                    00351000
UCBFL5   EQU   UCBOB+1                                                  00352000
UCBAF    EQU   UCBFL5                                                   00353000
UCBSTAT  EQU   UCBOB+3                                                  00354000
UCBONLI  EQU   UCBSTAT                                                  00355000
UCBALOC  EQU   UCBSTAT                                                  00356000
UCBCHAN  EQU   UCBOB+4                                                  00357000
UCBSFLS  EQU   UCBOB+6                                                  00358000
UCBFLA   EQU   UCBSFLS                                                  00359000
UCBFL1   EQU   UCBFLA                                                   00360000
UCBBSY   EQU   UCBFL1                                                   00361000
UCBNRY   EQU   UCBFL1                                                   00362000
UCBPST   EQU   UCBFL1                                                   00363000
UCBCUB   EQU   UCBFL1                                                   00364000
UCBFLB   EQU   UCBSFLS+1                                                00365000
UCBCHM   EQU   UCBOB+8                                                  00366000
UCBCHM1  EQU   UCBCHM                                                   00367000
UCBPTH0  EQU   UCBCHM1                                                  00368000
UCBPTH1  EQU   UCBCHM1                                                  00369000
UCBWGT   EQU   UCBOB+12                                                 00370000
UCBNAME  EQU   UCBOB+13                                                 00371000
UCBTYP   EQU   UCBOB+16                                                 00372000
UCBTBYT1 EQU   UCBTYP                                                   00373000
UCB1FEA5 EQU   UCBTBYT1                                                 00374000
UCB1FEA6 EQU   UCBTBYT1                                                 00375000
UCBTBYT2 EQU   UCBTYP+1                                                 00376000
UCB2OPT2 EQU   UCBTBYT2                                                 00377000
UCBDUDN1 EQU   UCB2OPT2                                                 00378000
UCB2OPT3 EQU   UCBTBYT2                                                 00379000
UCBDUDN2 EQU   UCB2OPT3                                                 00380000
UCB2OPT4 EQU   UCBTBYT2                                                 00381000
UCBRWTAU EQU   UCB2OPT4                                                 00382000
UCB2OPT6 EQU   UCBTBYT2                                                 00383000
UCB2OPT7 EQU   UCBTBYT2                                                 00384000
UCBTBYT3 EQU   UCBTYP+2                                                 00385000
UCBDVCLS EQU   UCBTBYT3                                                 00386000
UCB3COMM EQU   UCBDVCLS                                                 00387000
UCB3DISP EQU   UCBDVCLS                                                 00388000
UCBTBYT4 EQU   UCBTYP+3                                                 00389000
UCBEXTPT EQU   UCBOB+20                                                 00390000
UCBFLC   EQU   UCBEXTPT                                                 00391000
UCBDEV   EQU   UCBOB+24                                                 00392000
UCBCMEXT EQU   0                                                        00393000
UCBETI   EQU   UCBCMEXT                                                 00394000
UCBATI   EQU   UCBCMEXT+3                                               00395000
@NM00006 EQU   UCBATI                                                   00396000
UCBFLP1  EQU   UCBCMEXT+5                                               00397000
UCBASID  EQU   UCBCMEXT+14                                              00398000
UCBMT    EQU   0                                                        00399000
UCBOCR   EQU   0                                                        00400000
UCB3540X EQU   0                                                        00401000
UCBDKBYT EQU   UCB3540X+6                                               00402000
UCB3800X EQU   0                                                        00403000
UCBOPTNS EQU   UCB3800X                                                 00404000
UCBACTIV EQU   UCB3800X+3                                               00405000
UCBMDRBF EQU   UCB3800X+36                                              00406000
UCBUCS   EQU   0                                                        00407000
UCBUCSOP EQU   UCBUCS+4                                                 00408000
UCBFCBOP EQU   UCBUCS+5                                                 00409000
IOBPREFX EQU   0                                                        00410000
IOBCFLG1 EQU   IOBPREFX                                                 00411000
IOBSTDRD EQU   0                                                        00412000
IOBFLAG1 EQU   IOBSTDRD                                                 00413000
IOBCYCCK EQU   IOBFLAG1                                                 00414000
IOBRSTRT EQU   IOBFLAG1                                                 00415000
IOBFLAG2 EQU   IOBSTDRD+1                                               00416000
IOBPURGE EQU   IOBFLAG2                                                 00417000
IOBRDHA0 EQU   IOBFLAG2                                                 00418000
IOBSENS0 EQU   IOBSTDRD+2                                               00419000
IOBS0B7  EQU   IOBSENS0                                                 00420000
IOBSENS1 EQU   IOBSTDRD+3                                               00421000
IOBECBPT EQU   IOBSTDRD+4                                               00422000
IOBFLAG3 EQU   IOBSTDRD+8                                               00423000
IOBFL3   EQU   IOBFLAG3                                                 00424000
IOBCNC   EQU   IOBFL3                                                   00425000
IOBICL   EQU   IOBFL3                                                   00426000
IOBCSW   EQU   IOBSTDRD+9                                               00427000
IOBIOCSW EQU   IOBCSW                                                   00428000
IOBSTBYT EQU   IOBIOCSW+3                                               00429000
IOBUSTAT EQU   IOBSTBYT                                                 00430000
IOBCSTAT EQU   IOBSTBYT+1                                               00431000
IOBSTART EQU   IOBSTDRD+16                                              00432000
IOBDCBPT EQU   IOBSTDRD+20                                              00433000
IOBFLAG4 EQU   IOBDCBPT                                                 00434000
IOBRESTR EQU   IOBSTDRD+24                                              00435000
IOBINCAM EQU   IOBSTDRD+28                                              00436000
IOBBTAMF EQU   IOBINCAM                                                 00437000
IOCOM    EQU   0                                                        00438000
IOCOMEX  EQU   IOCOM+64                                                 00439000
IOCUCBBM EQU   IOCOM+120                                                00440000
IOCX     EQU   0                                                        00441000
IOX      EQU   IOCX                                                     00442000
IOXHICH  EQU   IOCX+4                                                   00443000
IOSB     EQU   0                                                        00444000
IOSFLA   EQU   IOSB                                                     00445000
IOSACHN  EQU   IOSFLA                                                   00446000
IOSFLB   EQU   IOSB+1                                                   00447000
IOSFLC   EQU   IOSB+2                                                   00448000
IOSDVALT EQU   IOSFLC                                                   00449000
IOSPKEY  EQU   IOSB+12                                                  00450000
IOSOPT   EQU   IOSB+14                                                  00451000
IOSOPT2  EQU   IOSB+15                                                  00452000
@NM00035 EQU   IOSB+20                                                  00453000
IOSCSW   EQU   @NM00035+1                                               00454000
IOSTATUS EQU   IOSCSW+3                                                 00455000
IOSIPIB  EQU   IOSB+44                                                  00456000
IOSPATH  EQU   IOSB+86                                                  00457000
IOSCHN   EQU   IOSPATH                                                  00458000
IOSCKEY  EQU   IOSB+89                                                  00459000
IOSEEKA  EQU   IOSB+100                                                 00460000
IOSCCHH  EQU   IOSEEKA+3                                                00461000
IOSSKHH  EQU   IOSCCHH+2                                                00462000
SRBSECT  EQU   0                                                        00463000
SRBFLC   EQU   SRBSECT+12                                               00464000
ISTPAB   EQU   0                                                        00465000
PABWQCHN EQU   ISTPAB                                                   00466000
PABWEQA  EQU   PABWQCHN                                                 00467000
PABCHAIN EQU   PABWQCHN+4                                               00468000
PABRPHFG EQU   ISTPAB+12                                                00469000
PABFLAGS EQU   PABRPHFG                                                 00470000
PABERLCK EQU   PABFLAGS                                                 00471000
PABERRLK EQU   PABERLCK                                                 00472000
ISTLOK   EQU   0                                                        00473000
LOKCHN   EQU   ISTLOK+1                                                 00474000
LOKCHNG  EQU   LOKCHN                                                   00475000
@NM00044 EQU   LOKCHNG+2                                                00476000
ISTDYPAB EQU   0                                                        00477000
ISTRPH   EQU   0                                                        00478000
RPHCNTL  EQU   ISTRPH                                                   00479000
RPHFLAGS EQU   RPHCNTL+2                                                00480000
RPHAPTYP EQU   RPHFLAGS                                                 00481000
RPHFSTLC EQU   RPHFLAGS                                                 00482000
RPHFLGB  EQU   RPHCNTL+3                                                00483000
RPHRPHA  EQU   ISTRPH+4                                                 00484000
RPHCVFLG EQU   RPHRPHA                                                  00485000
RPHGATE  EQU   RPHCVFLG                                                 00486000
RPHTSKID EQU   ISTRPH+8                                                 00487000
RPHRESMA EQU   ISTRPH+16                                                00488000
RPHWPFLG EQU   RPHRESMA                                                 00489000
RPHWEA   EQU   ISTRPH+24                                                00490000
RPHCSPA  EQU   RPHWEA                                                   00491000
RPHSRPRM EQU   ISTRPH+28                                                00492000
RPHPABQA EQU   ISTRPH+36                                                00493000
RPHWORK  EQU   ISTRPH+40                                                00494000
RPHSAVE1 EQU   RPHWORK                                                  00495000
RPHSBITS EQU   RPHSAVE1+1                                               00496000
ISTATCVT EQU   0                                                        00497000
ATCCOM   EQU   ISTATCVT                                                 00498000
ATCSTAT  EQU   ATCCOM                                                   00499000
ATCSTAT1 EQU   ATCSTAT                                                  00500000
ATCSTFLG EQU   ATCSTAT+1                                                00501000
ATCPOFLG EQU   ATCSTAT+2                                                00502000
ATCSTAT4 EQU   ATCSTAT+3                                                00503000
ATCIOTRC EQU   ATCCOM+140                                               00504000
ATCTHTRC EQU   ATCIOTRC                                                 00505000
ATCCSMR  EQU   ISTATCVT+296                                             00506000
ATCSHRFG EQU   ISTATCVT+316                                             00507000
ATCHPGM  EQU   ISTATCVT+384                                             00508000
ATCVLCNT EQU   ISTATCVT+772                                             00509000
ATCRNO   EQU   ISTATCVT+788                                             00510000
ATCSOPD  EQU   ISTATCVT+792                                             00511000
ATCSIPD  EQU   ISTATCVT+800                                             00512000
ATCSECST EQU   ISTATCVT+812                                             00513000
ATCSTAT2 EQU   ISTATCVT+818                                             00514000
ATCVTBAM EQU   ISTATCVT+908                                             00515000
@NM00055 EQU   ATCVTBAM+3                                               00516000
ATCAOSM  EQU   ISTATCVT+912                                             00517000
ATCGSRBQ EQU   ATCAOSM+4                                                00518000
ATCGSRBG EQU   ATCGSRBQ                                                 00519000
ATCICAPP EQU   ATCAOSM+100                                              00520000
ATCLDAPP EQU   ATCAOSM+120                                              00521000
ATCDAPVT EQU   ATCAOSM+140                                              00522000
ATCCRA   EQU   ATCAOSM+280                                              00523000
ATCCRACN EQU   ATCCRA+4                                                 00524000
ATCSRB   EQU   ATCAOSM+288                                              00525000
ATCSRBCN EQU   ATCSRB+4                                                 00526000
ATCCRPL  EQU   ATCAOSM+296                                              00527000
ATCRPLCN EQU   ATCCRPL+4                                                00528000
ATCSQAFR EQU   ATCAOSM+304                                              00529000
ATCORTBC EQU   ATCSQAFR+4                                               00530000
ATCORSRB EQU   ATCORTBC                                                 00531000
@NM00057 EQU   ATCAOSM+332                                              00532000
ATCVTFLG EQU   ATCAOSM+392                                              00533000
ATCZFLAG EQU   ATCAOSM+588                                              00534000
ISTAVT   EQU   0                                                        00535000
ISTAS49  EQU   ISTAVT+4                                                 00536000
AVTASID  EQU   ISTAVT+16                                                00537000
ISTDEVCH EQU   0                                                        00538000
DEVSHCH  EQU   ISTDEVCH                                                 00539000
DEVCHAR  EQU   DEVSHCH                                                  00540000
DEVTCODE EQU   ISTDEVCH+1                                               00541000
DEVFLAGS EQU   ISTDEVCH+3                                               00542000
DEVFCCTL EQU   DEVFLAGS                                                 00543000
DEVCHAR3 EQU   DEVFLAGS                                                 00544000
ISTNCB   EQU   0                                                        00545000
NCBFLAGS EQU   ISTNCB+24                                                00546000
NCBFRAS  EQU   NCBFLAGS+1                                               00547000
NCBFTRIO EQU   NCBFRAS                                                  00548000
NCBFLAG1 EQU   NCBFLAGS+2                                               00549000
ISTICNCB EQU   0                                                        00550000
@NM00062 EQU   ISTICNCB+53                                              00551000
ICNCKFLD EQU   ISTICNCB+96                                              00552000
ICNFLAG  EQU   ISTICNCB+100                                             00553000
ICNZF006 EQU   ICNFLAG                                                  00554000
ICNFFLAG EQU   ISTICNCB+101                                             00555000
ICNZSWS  EQU   ISTICNCB+102                                             00556000
ICNFLAG2 EQU   ISTICNCB+236                                             00557000
ICNZD001 EQU   ISTICNCB+288                                             00558000
ICNWSCCW EQU   ICNZD001                                                 00559000
ICNZD002 EQU   ISTICNCB+296                                             00560000
ICNZD003 EQU   ISTICNCB+320                                             00561000
ICNRSCCW EQU   ICNZD003                                                 00562000
ICNZD004 EQU   ISTICNCB+328                                             00563000
ICNZS1VR EQU   ISTICNCB+348                                             00564000
ICNSRV02 EQU   ICNZS1VR                                                 00565000
ICNDIEWA EQU   ICNSRV02                                                 00566000
ICNDCDEB EQU   ISTICNCB+480                                             00567000
ICNAPPAD EQU   ICNDCDEB+5                                               00568000
ICNDIDEB EQU   ICNDCDEB+12                                              00569000
ICNZFLAG EQU   ISTICNCB+508                                             00570000
ICNZH002 EQU   ISTICNCB+509                                             00571000
ICNZS002 EQU   ICNZH002                                                 00572000
ICNZS003 EQU   ICNZH002                                                 00573000
ICNZS004 EQU   ICNZH002                                                 00574000
ICNZS006 EQU   ICNZH002                                                 00575000
ICNZS007 EQU   ICNZH002                                                 00576000
ICNZS008 EQU   ICNZH002                                                 00577000
ICNZS009 EQU   ICNZH002+1                                               00578000
ICNZS00A EQU   ICNZH002+1                                               00579000
ICNZCONS EQU   ISTICNCB+680                                             00580000
ISTLDNCB EQU   0                                                        00581000
LDNCFLAG EQU   ISTLDNCB+54                                              00582000
LDNFLAGS EQU   ISTLDNCB+107                                             00583000
LDNFLAG2 EQU   ISTLDNCB+110                                             00584000
LDNZIOLK EQU   ISTLDNCB+184                                             00585000
LDNZERPF EQU   ISTLDNCB+185                                             00586000
LDNZCPAN EQU   LDNZERPF                                                 00587000
LDNZEPIN EQU   LDNZERPF                                                 00588000
LDNZLPC  EQU   ISTLDNCB+186                                             00589000
LDNDCDEB EQU   ISTLDNCB+304                                             00590000
LDNAPPAD EQU   LDNDCDEB+5                                               00591000
LDNZSAV3 EQU   ISTLDNCB+376                                             00592000
LDNZSAV4 EQU   LDNZSAV3+8                                               00593000
LDNZH003 EQU   ISTLDNCB+577                                             00594000
S99RBPTR EQU   0                                                        00595000
S99RBPND EQU   S99RBPTR                                                 00596000
S99RB    EQU   0                                                        00597000
S99RBLN  EQU   S99RB                                                    00598000
S99VERB  EQU   S99RB+1                                                  00599000
S99FLAG1 EQU   S99RB+2                                                  00600000
S99FLG11 EQU   S99FLAG1                                                 00601000
S99RSC   EQU   S99RB+4                                                  00602000
S99TXTPP EQU   S99RB+8                                                  00603000
S99FLAG2 EQU   S99RB+16                                                 00604000
S99FLG21 EQU   S99FLAG2                                                 00605000
S99FLG22 EQU   S99FLAG2+1                                               00606000
S99TUPL  EQU   0                                                        00607000
S99TUPTR EQU   S99TUPL                                                  00608000
S99TUP   EQU   0                                                        00609000
S99TUNIT EQU   0                                                        00610000
S99TUENT EQU   S99TUNIT+4                                               00611000
S99TUFLD EQU   0                                                        00612000
UCBBGN   EQU   0                                                        00613000
CVTS01   EQU   CVTPGSIA                                                 00614000
CVTLPDIA EQU   CVTS01+12                                                00615000
CVTDIRST EQU   CVTLPDIA                                                 00616000
CVTSLIDA EQU   CVTS01+24                                                00617000
CVTCTLFG EQU   CVTS01+50                                                00618000
CVTRV210 EQU   CVTS01+424                                               00619000
CVTRV219 EQU   CVTS01+425                                               00620000
CVTRV228 EQU   CVTS01+426                                               00621000
CVTRV237 EQU   CVTS01+427                                               00622000
CVTMFRTR EQU   CVTS01+452                                               00623000
CVTRV262 EQU   CVTS01+468                                               00624000
CVTRV271 EQU   CVTS01+469                                               00625000
CVTRV280 EQU   CVTS01+470                                               00626000
CVTRV289 EQU   CVTS01+471                                               00627000
CVTGSDA  EQU   CVTS01+600                                               00628000
UCBOBS01 EQU   UCBDEV                                                   00629000
UCBSTAB  EQU   UCBOBS01+10                                              00630000
UCBBSVL  EQU   UCBSTAB                                                  00631000
UCBPRSRS EQU   UCBSTAB                                                  00632000
UCBDMCT  EQU   UCBOBS01+11                                              00633000
UCBFL4   EQU   UCBOBS01+13                                              00634000
UCBOBS02 EQU   UCBDEV                                                   00635000
UCBTFL1  EQU   UCBOBS02+19                                              00636000
UCBXTN   EQU   UCBOBS02+20                                              00637000
UCBVOPT  EQU   UCBXTN                                                   00638000
UCBOBS03 EQU   UCBDEV                                                   00639000
UCBXTADR EQU   UCBOBS03                                                 00640000
UCBOBS04 EQU   UCBDEV                                                   00641000
UCBBTA   EQU   UCBOBS04+12                                              00642000
UCBOBS06 EQU   UCBDEV                                                   00643000
UCBAOF   EQU   UCBOBS06                                                 00644000
UCBAOF1  EQU   UCBAOF                                                   00645000
UCBAOF2  EQU   UCBAOF+1                                                 00646000
@NM00005 EQU   UCBOBS06+3                                               00647000
UCBIRB   EQU   UCBOBS06+4                                               00648000
UCBGRAF  EQU   UCBIRB                                                   00649000
UCBLDNCA EQU   UCBOBS06+8                                               00650000
UCBRDYQ  EQU   UCBLDNCA                                                 00651000
UCBIRLN  EQU   UCBRDYQ                                                  00652000
UCBLDNCB EQU   UCBRDYQ+1                                                00653000
UCBCTLNK EQU   UCBOBS06+12                                              00654000
UCBOBS07 EQU   UCBDEV                                                   00655000
UCBICNCB EQU   UCBOBS07+4                                               00656000
UCBOBS08 EQU   UCBDEV                                                   00657000
UCBCTCAD EQU   UCBOBS08                                                 00658000
UCBCTCF1 EQU   UCBOBS08+4                                               00659000
UCBOBS09 EQU   UCBDEV                                                   00660000
PSARSVTE EQU   PSARSVT                                                  00661000
IOBORG01 EQU   IOBPREFX+8                                               00662000
IOBNIOBA EQU   IOBORG01                                                 00663000
IOBNFLG1 EQU   IOBNIOBA                                                 00664000
IOBPRTOV EQU   IOBNFLG1                                                 00665000
IOBORG02 EQU   IOBPREFX+8                                               00666000
IOBDQADA EQU   IOBORG02                                                 00667000
IOBDEQIN EQU   IOBDQADA                                                 00668000
IOBORG03 EQU   IOBPREFX+12                                              00669000
IOBORG04 EQU   IOBINCAM                                                 00670000
IOBORG12 EQU   IOBINCAM                                                 00671000
IOBFL4   EQU   IOBORG12                                                 00672000
IOBEXTEN EQU   IOBSTDRD+32                                              00673000
IOBSEEK  EQU   IOBEXTEN                                                 00674000
IOBBB    EQU   IOBSEEK+1                                                00675000
IOBCC    EQU   IOBSEEK+3                                                00676000
IOBHH    EQU   IOBSEEK+5                                                00677000
IOBORG05 EQU   IOBEXTEN                                                 00678000
IOBORG06 EQU   IOBEXTEN                                                 00679000
IOBNXTPT EQU   IOBORG06+4                                               00680000
IOBSTATA EQU   IOBNXTPT                                                 00681000
IOBORG07 EQU   IOBEXTEN+8                                               00682000
W1IEXTEN EQU   IOBORG07                                                 00683000
IOBORG08 EQU   IOBEXTEN+8                                               00684000
IOBINDCT EQU   IOBORG08+4                                               00685000
IOBUNSQR EQU   IOBORG08+5                                               00686000
IOBFCHAD EQU   IOBORG08+8                                               00687000
IOBORG09 EQU   IOBEXTEN+8                                               00688000
IOBDPLAD EQU   IOBORG09+4                                               00689000
IOBDTYPE EQU   IOBORG09+8                                               00690000
IOBDTYP2 EQU   IOBORG09+9                                               00691000
IOBDSTAT EQU   IOBORG09+10                                              00692000
IOBSTAT1 EQU   IOBDSTAT                                                 00693000
IOBORG10 EQU   IOBEXTEN+8                                               00694000
IOBSEEK2 EQU   IOBORG10                                                 00695000
IOBORG11 EQU   IOBEXTEN                                                 00696000
IOBERCT  EQU   IOBORG11                                                 00697000
IOBUCBXV EQU   IOBERCT                                                  00698000
IOBNAME  EQU   IOBORG11+4                                               00699000
IOBORG13 EQU   IOBEXTEN                                                 00700000
IOBSKADR EQU   IOBORG13                                                 00701000
IOSATTSC EQU   IOSIPIB                                                  00702000
IOSWTOWA EQU   IOSIPIB                                                  00703000
IOSPCISC EQU   IOSIPIB                                                  00704000
FLC      EQU   PSA                                                      00705000
SRB      EQU   SRBSECT                                                  00706000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00707000
IOSPCIWA EQU   IOSPCISC+44                                              00708000
IOSPCIRS EQU   IOSPCISC+8                                               00709000
@NM00040 EQU   IOSPCISC+4                                               00710000
@NM00039 EQU   IOSPCISC                                                 00711000
IOSWRNDR EQU   IOSWTOWA+4                                               00712000
IOSWTOPT EQU   IOSWTOWA+3                                               00713000
IOSWTOCP EQU   IOSWTOWA+2                                               00714000
IOSWTOCH EQU   IOSWTOWA                                                 00715000
IOSATTWA EQU   IOSATTSC+40                                              00716000
@NM00038 EQU   IOSATTSC+24                                              00717000
IOSATTSN EQU   IOSATTSC                                                 00718000
IOBSKSS  EQU   IOBSKADR+3                                               00719000
IOBSK0   EQU   IOBSKADR+2                                               00720000
IOBSKTT  EQU   IOBSKADR+1                                               00721000
IOBSKRV  EQU   IOBSKADR                                                 00722000
IOBCSWSV EQU   IOBORG11+17                                              00723000
IOBSENSV EQU   IOBORG11+16                                              00724000
IOBRCD   EQU   IOBORG11+12                                              00725000
IOBMDREC EQU   IOBORG11+8                                               00726000
IOBNAMEA EQU   IOBNAME+1                                                00727000
IOBNAMSZ EQU   IOBNAME                                                  00728000
IOBERCTA EQU   IOBERCT+1                                                00729000
IOBRTYPE EQU   IOBUCBXV                                                 00730000
IOBRDCHP EQU   IOBORG10+20                                              00731000
IOBNEXTA EQU   IOBORG10+16                                              00732000
IOBREADA EQU   IOBORG10+12                                              00733000
IOBBUFC  EQU   IOBORG10+8                                               00734000
IOBSK2R  EQU   IOBSEEK2+7                                               00735000
IOBSK2HH EQU   IOBSEEK2+5                                               00736000
IOBSK2CC EQU   IOBSEEK2+3                                               00737000
IOBSK2BB EQU   IOBSEEK2+1                                               00738000
IOBSK2M  EQU   IOBSEEK2                                                 00739000
IOBCHNPR EQU   IOBORG09+40                                              00740000
IOBDNCRF EQU   IOBORG09+32                                              00741000
IOBRSV35 EQU   IOBORG09+24                                              00742000
IOBDQPTR EQU   IOBORG09+20                                              00743000
IOBRSV34 EQU   IOBORG09+18                                              00744000
IOBDBYTN EQU   IOBORG09+16                                              00745000
IOBDCPND EQU   IOBORG09+12                                              00746000
IOBSTAT2 EQU   IOBDSTAT+1                                               00747000
IOBSIORT EQU   IOBSTAT1                                                 00748000
IOBADDVU EQU   IOBSTAT1                                                 00749000
IOBBUFF  EQU   IOBSTAT1                                                 00750000
IOBENQUE EQU   IOBSTAT1                                                 00751000
IOBPASS2 EQU   IOBSTAT1                                                 00752000
IOBSYNCH EQU   IOBSTAT1                                                 00753000
IOBNEWVL EQU   IOBSTAT1                                                 00754000
IOBABNRM EQU   IOBSTAT1                                                 00755000
IOBRELEX EQU   IOBDTYP2                                                 00756000
IOBADDTY EQU   IOBDTYP2                                                 00757000
IOBTYPE  EQU   IOBDTYP2                                                 00758000
IOBRQUST EQU   IOBDTYP2                                                 00759000
IOBSUFFX EQU   IOBDTYP2                                                 00760000
IOBSBLKL EQU   IOBDTYP2                                                 00761000
IOBSKEY  EQU   IOBDTYP2                                                 00762000
IOBRELBL EQU   IOBDTYPE                                                 00763000
IOBRDEXC EQU   IOBDTYPE                                                 00764000
IOBDYNBF EQU   IOBDTYPE                                                 00765000
IOBACTAD EQU   IOBDTYPE                                                 00766000
IOBFDBCK EQU   IOBDTYPE                                                 00767000
IOBEXTSC EQU   IOBDTYPE                                                 00768000
IOBOVFLO EQU   IOBDTYPE                                                 00769000
IOBVERFY EQU   IOBDTYPE                                                 00770000
IOBDPLB  EQU   IOBDPLAD+1                                               00771000
IOBDAYLI EQU   IOBDPLAD                                                 00772000
IOBDIOBS EQU   IOBORG09+2                                               00773000
IOBDBYTR EQU   IOBORG09                                                 00774000
IOBBCHAD EQU   IOBORG08+12                                              00775000
IOBFCHNB EQU   IOBFCHAD+1                                               00776000
IOBCOUNT EQU   IOBFCHAD                                                 00777000
IOBASYN  EQU   IOBORG08+7                                               00778000
IOBAPP   EQU   IOBORG08+6                                               00779000
IOBRSV32 EQU   IOBUNSQR                                                 00780000
IOBRSV31 EQU   IOBUNSQR                                                 00781000
IOBRSV30 EQU   IOBUNSQR                                                 00782000
IOBKNRWR EQU   IOBUNSQR                                                 00783000
IOBKNWR  EQU   IOBUNSQR                                                 00784000
IOBNTAV2 EQU   IOBUNSQR                                                 00785000
IOBNTAV1 EQU   IOBUNSQR                                                 00786000
IOBCPBSY EQU   IOBUNSQR                                                 00787000
IOBCHNNL EQU   IOBINDCT                                                 00788000
IOBRSV29 EQU   IOBINDCT                                                 00789000
IOBRSV28 EQU   IOBINDCT                                                 00790000
IOBRSV27 EQU   IOBINDCT                                                 00791000
IOBKEYAD EQU   IOBINDCT                                                 00792000
IOBOVPTR EQU   IOBINDCT                                                 00793000
IOBUNSCH EQU   IOBINDCT                                                 00794000
IOBDEQCP EQU   IOBINDCT                                                 00795000
IOBCCWAD EQU   IOBORG08                                                 00796000
W1OEXTEN EQU   W1IEXTEN                                                 00797000
IOBCCW   EQU   IOBORG06+8                                               00798000
IOBNXTPB EQU   IOBNXTPT+1                                               00799000
IOBRSV26 EQU   IOBSTATA                                                 00800000
IOBRSV25 EQU   IOBSTATA                                                 00801000
IOBRSV24 EQU   IOBSTATA                                                 00802000
IOBRSV23 EQU   IOBSTATA                                                 00803000
IOBRSV22 EQU   IOBSTATA                                                 00804000
IOBRSV21 EQU   IOBSTATA                                                 00805000
IOBRSV20 EQU   IOBSTATA                                                 00806000
IOBAVLFL EQU   IOBSTATA                                                 00807000
IOBRSV37 EQU   IOBORG06+1                                               00808000
IOBUCBXG EQU   IOBORG06                                                 00809000
IOBCPA   EQU   IOBORG05+32                                              00810000
IOBERINF EQU   IOBORG05+16                                              00811000
IOBERCCW EQU   IOBORG05+8                                               00812000
IOBSNDPT EQU   IOBORG05+7                                               00813000
IOBRCVPT EQU   IOBORG05+6                                               00814000
IOBWORK  EQU   IOBORG05+1                                               00815000
IOBUCBX  EQU   IOBORG05                                                 00816000
IOBR     EQU   IOBSEEK+7                                                00817000
IOBHH2   EQU   IOBHH+1                                                  00818000
IOBHH1   EQU   IOBHH                                                    00819000
IOBCC2   EQU   IOBCC+1                                                  00820000
IOBCC1   EQU   IOBCC                                                    00821000
IOBBB2   EQU   IOBBB+1                                                  00822000
IOBBB1   EQU   IOBBB                                                    00823000
IOBM     EQU   IOBSEEK                                                  00824000
IOBRSV46 EQU   IOBFL4                                                   00825000
IOBRSV47 EQU   IOBFL4                                                   00826000
IOBENT   EQU   IOBFL4                                                   00827000
IOBEQP   EQU   IOBFL4                                                   00828000
IOBBUS   EQU   IOBFL4                                                   00829000
IOBDCK   EQU   IOBFL4                                                   00830000
IOBREJ   EQU   IOBFL4                                                   00831000
IOBOVR   EQU   IOBFL4                                                   00832000
IOBCRILC EQU   IOBORG04+1                                               00833000
IOBCRDCC EQU   IOBORG04                                                 00834000
IOBGQECB EQU   IOBORG03                                                 00835000
IOBSWAP  EQU   IOBORG02+4                                               00836000
IOBDQADB EQU   IOBDQADA+1                                               00837000
IOBRSV13 EQU   IOBDEQIN                                                 00838000
IOBRSV12 EQU   IOBDEQIN                                                 00839000
IOBRSV11 EQU   IOBDEQIN                                                 00840000
IOBRSV10 EQU   IOBDEQIN                                                 00841000
IOBRSV09 EQU   IOBDEQIN                                                 00842000
IOBRSV08 EQU   IOBDEQIN                                                 00843000
IOBRSV07 EQU   IOBDEQIN                                                 00844000
IOBDEQ   EQU   IOBDEQIN                                                 00845000
IOBNECB  EQU   IOBORG01+4                                               00846000
IOBNIOBB EQU   IOBNIOBA+1                                               00847000
IOBFIRST EQU   IOBNFLG1                                                 00848000
IOBUPERR EQU   IOBNFLG1                                                 00849000
IOBSPAN  EQU   IOBNFLG1                                                 00850000
IOBBKSPC EQU   IOBNFLG1                                                 00851000
IOBUPDAT EQU   IOBNFLG1                                                 00852000
IOBREAD  EQU   IOBNFLG1                                                 00853000
IOBWRITE EQU   IOBNFLG1                                                 00854000
IOBSEGMT EQU   IOBPRTOV                                                 00855000
PSARSAV  EQU   PSARSVTE+60                                              00856000
PSARSTK  EQU   PSARSVTE+56                                              00857000
PSAESAV3 EQU   PSARSVTE+52                                              00858000
PSAESTK3 EQU   PSARSVTE+48                                              00859000
PSAESAV2 EQU   PSARSVTE+44                                              00860000
PSAESTK2 EQU   PSARSVTE+40                                              00861000
PSAESAV1 EQU   PSARSVTE+36                                              00862000
PSAESTK1 EQU   PSARSVTE+32                                              00863000
PSAPSAV  EQU   PSARSVTE+28                                              00864000
PSAPSTK  EQU   PSARSVTE+24                                              00865000
PSAMSAV  EQU   PSARSVTE+20                                              00866000
PSAMSTK  EQU   PSARSVTE+16                                              00867000
PSASSAV  EQU   PSARSVTE+12                                              00868000
PSASSTK  EQU   PSARSVTE+8                                               00869000
PSANSTK  EQU   PSARSVTE+4                                               00870000
PSACSTK  EQU   PSARSVTE                                                 00871000
UCBRV066 EQU   UCBOBS09+4                                               00872000
UCBIOSBA EQU   UCBOBS09                                                 00873000
UCBRV042 EQU   UCBOBS08+5                                               00874000
UCBRV082 EQU   UCBCTCF1                                                 00875000
UCBRV081 EQU   UCBCTCF1                                                 00876000
UCBRV080 EQU   UCBCTCF1                                                 00877000
UCBRV079 EQU   UCBCTCF1                                                 00878000
UCBRV078 EQU   UCBCTCF1                                                 00879000
UCBRV077 EQU   UCBCTCF1                                                 00880000
UCBRV076 EQU   UCBCTCF1                                                 00881000
UCBCTC80 EQU   UCBCTCF1                                                 00882000
UCBCTCAL EQU   UCBCTCAD                                                 00883000
UCBRV040 EQU   UCBOBS07                                                 00884000
UCBCTLNA EQU   UCBCTLNK+1                                               00885000
UCBRLN   EQU   UCBCTLNK                                                 00886000
UCBRDYQA EQU   UCBLDNCB                                                 00887000
UCBINRLN EQU   UCBIRLN                                                  00888000
UCBIRBA  EQU   UCBIRB+1                                                 00889000
UCBRV039 EQU   UCBGRAF                                                  00890000
UCBDWNR  EQU   UCBGRAF                                                  00891000
UCBRPND  EQU   UCBGRAF                                                  00892000
UCBUPM   EQU   UCBGRAF                                                  00893000
UCBBTAM  EQU   UCBGRAF                                                  00894000
UCBDRNO  EQU   UCBGRAF                                                  00895000
UCBDRO   EQU   UCBGRAF                                                  00896000
UCBOIP   EQU   UCBGRAF                                                  00897000
UCBATRCD EQU   @NM00005                                                 00898000
UCBSKPFG EQU   @NM00005                                                 00899000
UCBRIPND EQU   @NM00005                                                 00900000
UCBRTIAC EQU   @NM00005                                                 00901000
UCBRSV79 EQU   @NM00005                                                 00902000
UCBRSV78 EQU   @NM00005                                                 00903000
UCBRSV77 EQU   @NM00005                                                 00904000
UCBOLTEP EQU   @NM00005                                                 00905000
UCBATNCT EQU   UCBOBS06+2                                               00906000
UCBRSV76 EQU   UCBAOF2                                                  00907000
UCBRSV75 EQU   UCBAOF2                                                  00908000
UCBRSV74 EQU   UCBAOF2                                                  00909000
UCBRSV73 EQU   UCBAOF2                                                  00910000
UCBRSV72 EQU   UCBAOF2                                                  00911000
UCBRSV71 EQU   UCBAOF2                                                  00912000
UCBRSV70 EQU   UCBAOF2                                                  00913000
UCBRSV69 EQU   UCBAOF2                                                  00914000
UCBRSV68 EQU   UCBAOF1                                                  00915000
UCBRSV67 EQU   UCBAOF1                                                  00916000
UCBRSV66 EQU   UCBAOF1                                                  00917000
UCBRSV65 EQU   UCBAOF1                                                  00918000
UCBRSV64 EQU   UCBAOF1                                                  00919000
UCBOFNL  EQU   UCBAOF1                                                  00920000
UCBOFSP  EQU   UCBAOF1                                                  00921000
UCBOFMCR EQU   UCBAOF1                                                  00922000
UCBBTB   EQU   UCBBTA+1                                                 00923000
UCBDI    EQU   UCBBTA                                                   00924000
UCBSNS   EQU   UCBOBS04+8                                               00925000
UCBTEB   EQU   UCBOBS04+4                                               00926000
UCBGCB   EQU   UCBOBS04+3                                               00927000
UCBOPEN  EQU   UCBOBS04+2                                               00928000
UCBSTART EQU   UCBOBS04                                                 00929000
UCBXTNB  EQU   UCBXTN+1                                                 00930000
UCBRSV22 EQU   UCBVOPT                                                  00931000
UCBRSV21 EQU   UCBVOPT                                                  00932000
UCBRSV20 EQU   UCBVOPT                                                  00933000
UCBESVE  EQU   UCBVOPT                                                  00934000
UCBERPC  EQU   UCBVOPT                                                  00935000
UCBESVC  EQU   UCBVOPT                                                  00936000
UCBEVA   EQU   UCBVOPT                                                  00937000
UCBESV   EQU   UCBVOPT                                                  00938000
UCBRV009 EQU   UCBTFL1                                                  00939000
UCBRV008 EQU   UCBTFL1                                                  00940000
UCBRV007 EQU   UCBTFL1                                                  00941000
UCBRV006 EQU   UCBTFL1                                                  00942000
UCBRV005 EQU   UCBTFL1                                                  00943000
UCBRV038 EQU   UCBTFL1                                                  00944000
UCBNSLTP EQU   UCBTFL1                                                  00945000
UCBNLTP  EQU   UCBTFL1                                                  00946000
UCBRES1B EQU   UCBOBS02+18                                              00947000
UCBFSER  EQU   UCBOBS02+12                                              00948000
@NM00004 EQU   UCBOBS02+4                                               00949000
UCBFSEQ  EQU   UCBOBS02+2                                               00950000
UCBFSCT  EQU   UCBOBS02                                                 00951000
UCBNEXP  EQU   UCBOBS01+20                                              00952000
UCBBASE  EQU   UCBOBS01+16                                              00953000
UCBRES1A EQU   UCBOBS01+15                                              00954000
UCBUSER  EQU   UCBOBS01+14                                              00955000
UCBFL47  EQU   UCBFL4                                                   00956000
UCBFL46  EQU   UCBFL4                                                   00957000
UCBFL45  EQU   UCBFL4                                                   00958000
UCBRV065 EQU   UCBFL4                                                   00959000
UCBDSS   EQU   UCBFL4                                                   00960000
UCBRV028 EQU   UCBFL4                                                   00961000
UCBWDAV  EQU   UCBFL4                                                   00962000
UCBDAVV  EQU   UCBFL4                                                   00963000
UCBSQC   EQU   UCBOBS01+12                                              00964000
UCBDATP  EQU   UCBOBS01+12                                              00965000
UCBDMC   EQU   UCBDMCT                                                  00966000
UCBMOUNT EQU   UCBDMCT                                                  00967000
UCBBNUL  EQU   UCBSTAB                                                  00968000
UCBSHAR  EQU   UCBSTAB                                                  00969000
UCBBSTR  EQU   UCBSTAB                                                  00970000
UCBBPUB  EQU   UCBSTAB                                                  00971000
UCBBPRV  EQU   UCBSTAB                                                  00972000
UCBBALB  EQU   UCBPRSRS                                                 00973000
UCBPGFL  EQU   UCBSTAB                                                  00974000
UCBDVSHR EQU   UCBBSVL                                                  00975000
UCBVOLI  EQU   UCBOBS01+4                                               00976000
UCBVTOC  EQU   UCBOBS01                                                 00977000
CVTRV628 EQU   CVTS01+728                                               00978000
CVTRV627 EQU   CVTS01+724                                               00979000
CVTRV626 EQU   CVTS01+720                                               00980000
CVTRV625 EQU   CVTS01+716                                               00981000
CVTRV624 EQU   CVTS01+712                                               00982000
CVTRV623 EQU   CVTS01+708                                               00983000
CVTRV622 EQU   CVTS01+704                                               00984000
CVTRV621 EQU   CVTS01+700                                               00985000
CVTRV620 EQU   CVTS01+696                                               00986000
CVTRV619 EQU   CVTS01+692                                               00987000
CVTRV618 EQU   CVTS01+688                                               00988000
CVTRV617 EQU   CVTS01+684                                               00989000
CVTRV616 EQU   CVTS01+680                                               00990000
CVTRV615 EQU   CVTS01+676                                               00991000
CVTRV614 EQU   CVTS01+672                                               00992000
CVTRV613 EQU   CVTS01+668                                               00993000
CVTTCASP EQU   CVTS01+664                                               00994000
CVT0PT03 EQU   CVTS01+660                                               00995000
CVT0PT0E EQU   CVTS01+656                                               00996000
CVTIRM   EQU   CVTS01+652                                               00997000
CVTCGK   EQU   CVTS01+648                                               00998000
CVTRV607 EQU   CVTS01+644                                               00999000
CVTRV606 EQU   CVTS01+640                                               01000000
CVTRV605 EQU   CVTS01+636                                               01001000
CVTRV604 EQU   CVTS01+632                                               01002000
CVTEFF02 EQU   CVTS01+628                                               01003000
CVTCBBR  EQU   CVTS01+624                                               01004000
CVTSSCR  EQU   CVTS01+620                                               01005000
CVTEVENT EQU   CVTS01+616                                               01006000
CVTCRCA  EQU   CVTS01+612                                               01007000
CVTTPIO  EQU   CVTS01+608                                               01008000
CVTADV   EQU   CVTS01+604                                               01009000
CVTGSDAB EQU   CVTGSDA                                                  01010000
CVTQV3   EQU   CVTS01+596                                               01011000
CVTQV2   EQU   CVTS01+592                                               01012000
CVTQV1   EQU   CVTS01+588                                               01013000
CVTRPT   EQU   CVTS01+584                                               01014000
CVTSSRB  EQU   CVTS01+580                                               01015000
CVTCSDRL EQU   CVTS01+576                                               01016000
CVTEXP1  EQU   CVTS01+572                                               01017000
CVTRMPMT EQU   CVTS01+568                                               01018000
CVTRMPTT EQU   CVTS01+564                                               01019000
CVTVPSA  EQU   CVTS01+560                                               01020000
CVTVSTOP EQU   CVTS01+556                                               01021000
CVTGTFR8 EQU   CVTS01+552                                               01022000
CVTQUIT  EQU   CVTS01+548                                               01023000
CVTVACR  EQU   CVTS01+544                                               01024000
CVTWTCB  EQU   CVTS01+540                                               01025000
CVTSTPRS EQU   CVTS01+536                                               01026000
CVT0PT02 EQU   CVTS01+532                                               01027000
CVTDARCM EQU   CVTS01+528                                               01028000
CVTIRECM EQU   CVTS01+524                                               01029000
CVTJRECM EQU   CVTS01+520                                               01030000
CVTVEMS0 EQU   CVTS01+516                                               01031000
CVTSPFRR EQU   CVTS01+512                                               01032000
CVTRLSTG EQU   CVTS01+508                                               01033000
CVT0TC0A EQU   CVTS01+504                                               01034000
CVTGMBR  EQU   CVTS01+500                                               01035000
CVTLFRM  EQU   CVTS01+496                                               01036000
CVTRMBR  EQU   CVTS01+492                                               01037000
CVTVIOP  EQU   CVTS01+488                                               01038000
CVTRV307 EQU   CVTS01+486                                               01039000
CVTRV306 EQU   CVTS01+484                                               01040000
CVTRV305 EQU   CVTS01+482                                               01041000
CVTRV304 EQU   CVTS01+480                                               01042000
CVTRV303 EQU   CVTS01+478                                               01043000
CVTRV302 EQU   CVTS01+476                                               01044000
CVTTRCA  EQU   CVTS01+472                                               01045000
CVTRV297 EQU   CVTRV289                                                 01046000
CVTRV296 EQU   CVTRV289                                                 01047000
CVTRV295 EQU   CVTRV289                                                 01048000
CVTRV294 EQU   CVTRV289                                                 01049000
CVTRV293 EQU   CVTRV289                                                 01050000
CVTRV292 EQU   CVTRV289                                                 01051000
CVTRV291 EQU   CVTRV289                                                 01052000
CVTRV290 EQU   CVTRV289                                                 01053000
CVTRV288 EQU   CVTRV280                                                 01054000
CVTRV287 EQU   CVTRV280                                                 01055000
CVTRV286 EQU   CVTRV280                                                 01056000
CVTRV285 EQU   CVTRV280                                                 01057000
CVTRV284 EQU   CVTRV280                                                 01058000
CVTRV283 EQU   CVTRV280                                                 01059000
CVTRV282 EQU   CVTRV280                                                 01060000
CVTRV281 EQU   CVTRV280                                                 01061000
CVTRV279 EQU   CVTRV271                                                 01062000
CVTRV278 EQU   CVTRV271                                                 01063000
CVTRV277 EQU   CVTRV271                                                 01064000
CVTRV276 EQU   CVTRV271                                                 01065000
CVTRV275 EQU   CVTRV271                                                 01066000
CVTRV274 EQU   CVTRV271                                                 01067000
CVTRV273 EQU   CVTRV271                                                 01068000
CVTRV272 EQU   CVTRV271                                                 01069000
CVTRV270 EQU   CVTRV262                                                 01070000
CVTRV269 EQU   CVTRV262                                                 01071000
CVTRV268 EQU   CVTRV262                                                 01072000
CVTRV267 EQU   CVTRV262                                                 01073000
CVTRV266 EQU   CVTRV262                                                 01074000
CVTRV265 EQU   CVTRV262                                                 01075000
CVTRV264 EQU   CVTRV262                                                 01076000
CVTRV263 EQU   CVTRV262                                                 01077000
CVTVFP   EQU   CVTS01+464                                               01078000
CVTVSI   EQU   CVTS01+460                                               01079000
CVTVPSIB EQU   CVTS01+456                                               01080000
CVTMFACT EQU   CVTMFRTR                                                 01081000
CVTMFCTL EQU   CVTS01+448                                               01082000
CVTPVBP  EQU   CVTS01+444                                               01083000
CVTPWI   EQU   CVTS01+440                                               01084000
CVTRV254 EQU   CVTS01+438                                               01085000
CVTRV253 EQU   CVTS01+436                                               01086000
CVTRV252 EQU   CVTS01+434                                               01087000
CVTRV251 EQU   CVTS01+433                                               01088000
CVTRV250 EQU   CVTS01+432                                               01089000
CVTRV249 EQU   CVTS01+431                                               01090000
CVTRV248 EQU   CVTS01+430                                               01091000
CVTRV247 EQU   CVTS01+429                                               01092000
CVTRV246 EQU   CVTS01+428                                               01093000
CVTRV245 EQU   CVTRV237                                                 01094000
CVTRV244 EQU   CVTRV237                                                 01095000
CVTRV243 EQU   CVTRV237                                                 01096000
CVTRV242 EQU   CVTRV237                                                 01097000
CVTRV241 EQU   CVTRV237                                                 01098000
CVTRV240 EQU   CVTRV237                                                 01099000
CVTRV239 EQU   CVTRV237                                                 01100000
CVTRV238 EQU   CVTRV237                                                 01101000
CVTRV236 EQU   CVTRV228                                                 01102000
CVTRV235 EQU   CVTRV228                                                 01103000
CVTRV234 EQU   CVTRV228                                                 01104000
CVTRV233 EQU   CVTRV228                                                 01105000
CVTRV232 EQU   CVTRV228                                                 01106000
CVTRV231 EQU   CVTRV228                                                 01107000
CVTRV230 EQU   CVTRV228                                                 01108000
CVTRV229 EQU   CVTRV228                                                 01109000
CVTRV227 EQU   CVTRV219                                                 01110000
CVTRV226 EQU   CVTRV219                                                 01111000
CVTRV225 EQU   CVTRV219                                                 01112000
CVTRV224 EQU   CVTRV219                                                 01113000
CVTRV223 EQU   CVTRV219                                                 01114000
CVTRV222 EQU   CVTRV219                                                 01115000
CVTRV221 EQU   CVTRV219                                                 01116000
CVTRV220 EQU   CVTRV219                                                 01117000
CVTRV218 EQU   CVTRV210                                                 01118000
CVTRV217 EQU   CVTRV210                                                 01119000
CVTRV216 EQU   CVTRV210                                                 01120000
CVTRV215 EQU   CVTRV210                                                 01121000
CVTRV214 EQU   CVTRV210                                                 01122000
CVTRV213 EQU   CVTRV210                                                 01123000
CVTRV212 EQU   CVTRV210                                                 01124000
CVTRV211 EQU   CVTRV210                                                 01125000
CVTLCCAT EQU   CVTS01+420                                               01126000
CVTPCCAT EQU   CVTS01+416                                               01127000
CVTIPCRP EQU   CVTS01+412                                               01128000
CVTIPCRI EQU   CVTS01+408                                               01129000
CVTIPCDS EQU   CVTS01+404                                               01130000
CVTAIDVT EQU   CVTS01+400                                               01131000
CVTSSAP  EQU   CVTS01+396                                               01132000
CVTEHCIR EQU   CVTS01+392                                               01133000
CVTEHDEF EQU   CVTS01+388                                               01134000
CVTDAIR  EQU   CVTS01+384                                               01135000
CVTPERFM EQU   CVTS01+380                                               01136000
CVT044R2 EQU   CVTS01+376                                               01137000
CVTFETCH EQU   CVTS01+372                                               01138000
CVTRSTWD EQU   CVTS01+368                                               01139000
CVTSPOST EQU   CVTS01+364                                               01140000
CVTIOBP  EQU   CVTS01+360                                               01141000
CVTASMVT EQU   CVTS01+356                                               01142000
CVTRECRQ EQU   CVTS01+352                                               01143000
CVTWSAC  EQU   CVTS01+348                                               01144000
CVTRV149 EQU   CVTS01+344                                               01145000
CVTWSAL  EQU   CVTS01+340                                               01146000
CVTSPSA  EQU   CVTS01+336                                               01147000
CVTGLMN  EQU   CVTS01+332                                               01148000
CVTVEAC0 EQU   CVTS01+328                                               01149000
CVT062R1 EQU   CVTS01+324                                               01150000
CVTRPOST EQU   CVTS01+320                                               01151000
CVTDQIQE EQU   CVTS01+316                                               01152000
CVTCSD   EQU   CVTS01+312                                               01153000
CVTLKRMA EQU   CVTS01+308                                               01154000
CVTRSPIE EQU   CVTS01+304                                               01155000
CVTRENQ  EQU   CVTS01+300                                               01156000
CVTLQCB  EQU   CVTS01+296                                               01157000
CVTFQCB  EQU   CVTS01+292                                               01158000
CVTQCS01 EQU   CVTS01+288                                               01159000
CVTAPFT  EQU   CVTS01+284                                               01160000
CVTPARRL EQU   CVTS01+280                                               01161000
CVTVWAIT EQU   CVTS01+276                                               01162000
CVTGSPL  EQU   CVTS01+272                                               01163000
CVTLSMQ  EQU   CVTS01+268                                               01164000
CVTGSMQ  EQU   CVTS01+264                                               01165000
CVTEXPRO EQU   CVTS01+260                                               01166000
CVTOPCTP EQU   CVTS01+256                                               01167000
CVTSIC   EQU   CVTS01+252                                               01168000
CVTTPIOS EQU   CVTS01+248                                               01169000
CVTRTMS  EQU   CVTS01+244                                               01170000
CVTSDBF  EQU   CVTS01+240                                               01171000
CVTSCBP  EQU   CVTS01+236                                               01172000
CVTSDMP  EQU   CVTS01+232                                               01173000
CVTSV60  EQU   CVTS01+228                                               01174000
CVTRTMCT EQU   CVTS01+224                                               01175000
CVTASCBL EQU   CVTS01+220                                               01176000
CVTASCBH EQU   CVTS01+216                                               01177000
CVTGDA   EQU   CVTS01+212                                               01178000
CVTASVT  EQU   CVTS01+208                                               01179000
CVTVVMDI EQU   CVTS01+204                                               01180000
CVTAQTOP EQU   CVTS01+200                                               01181000
CVTIOSCS EQU   CVTS01+196                                               01182000
CVTSDRM  EQU   CVTS01+192                                               01183000
CVTOPTE  EQU   CVTS01+188                                               01184000
CVTSTXU  EQU   CVTS01+184                                               01185000
CVTQUIS  EQU   CVTS01+180                                               01186000
CVTPARS  EQU   CVTS01+176                                               01187000
CVTS1EE  EQU   CVTS01+172                                               01188000
CVTFRAS  EQU   CVTS01+168                                               01189000
CVTQSAS  EQU   CVTS01+164                                               01190000
CVTCRAS  EQU   CVTS01+160                                               01191000
CVTCRMN  EQU   CVTS01+156                                               01192000
CVTDELCP EQU   CVTS01+152                                               01193000
CVTFRECL EQU   CVTS01+148                                               01194000
CVTGETCL EQU   CVTS01+144                                               01195000
CVTBLDCP EQU   CVTS01+140                                               01196000
CVTAUTHL EQU   CVTS01+136                                               01197000
CVTSCAN  EQU   CVTS01+132                                               01198000
CVTRV144 EQU   CVTS01+130                                               01199000
CVTMAXMP EQU   CVTS01+128                                               01200000
CVTSTCK  EQU   CVTS01+124                                               01201000
CVTRV139 EQU   CVTS01+123                                               01202000
CVTDSSAC EQU   CVTS01+122                                               01203000
CVTRV513 EQU   CVTS01+121                                               01204000
CVTIOSPL EQU   CVTS01+120                                               01205000
CVTPTGT  EQU   CVTS01+116                                               01206000
CVTCSPIE EQU   CVTS01+112                                               01207000
CVTSMFEX EQU   CVTS01+108                                               01208000
CVTOLT0A EQU   CVTS01+104                                               01209000
CVTSRBRT EQU   CVTS01+100                                               01210000
CVTPUTL  EQU   CVTS01+96                                                01211000
CVTASCRL EQU   CVTS01+92                                                01212000
CVTASCRF EQU   CVTS01+88                                                01213000
CVTRV326 EQU   CVTS01+84                                                01214000
CVTRV325 EQU   CVTS01+80                                                01215000
CVTRV324 EQU   CVTS01+76                                                01216000
CVT0VL01 EQU   CVTS01+72                                                01217000
CVTSHRVM EQU   CVTS01+68                                                01218000
CVTRV332 EQU   CVTS01+64                                                01219000
CVTTAS   EQU   CVTS01+60                                                01220000
CVTRSCN  EQU   CVTS01+56                                                01221000
CVTTRAC2 EQU   CVTS01+54                                                01222000
CVTTRACE EQU   CVTS01+52                                                01223000
CVTAPG   EQU   CVTS01+51                                                01224000
CVTSDTRC EQU   CVTCTLFG                                                 01225000
CVTGTRCE EQU   CVTCTLFG                                                 01226000
CVTNOMP  EQU   CVTCTLFG                                                 01227000
CVTRSV79 EQU   CVTCTLFG                                                 01228000
CVTDSTAT EQU   CVTCTLFG                                                 01229000
CVTRSV78 EQU   CVTCTLFG                                                 01230000
CVTRV333 EQU   CVTCTLFG                                                 01231000
CVTRV323 EQU   CVTCTLFG                                                 01232000
CVTSPVLK EQU   CVTS01+49                                                01233000
CVTRSV77 EQU   CVTS01+48                                                01234000
CVTRV331 EQU   CVTS01+44                                                01235000
CVTRV330 EQU   CVTS01+40                                                01236000
CVTRV329 EQU   CVTS01+36                                                01237000
CVTRV328 EQU   CVTS01+32                                                01238000
CVTRV322 EQU   CVTS01+28                                                01239000
CVTSLID  EQU   CVTSLIDA+1                                               01240000
CVTSYLK  EQU   CVTSLIDA                                                 01241000
CVTRV321 EQU   CVTS01+20                                                01242000
CVTRV320 EQU   CVTS01+16                                                01243000
CVTLPDIR EQU   CVTLPDIA+1                                               01244000
CVTRSV69 EQU   CVTDIRST                                                 01245000
CVTRSV68 EQU   CVTDIRST                                                 01246000
CVTRSV67 EQU   CVTDIRST                                                 01247000
CVTRSV66 EQU   CVTDIRST                                                 01248000
CVTRSV65 EQU   CVTDIRST                                                 01249000
CVTRSV64 EQU   CVTDIRST                                                 01250000
CVTRSV63 EQU   CVTDIRST                                                 01251000
CVTDICOM EQU   CVTDIRST                                                 01252000
CVTPVTP  EQU   CVTS01+8                                                 01253000
CVTLPDSR EQU   CVTS01+4                                                 01254000
CVTGETL  EQU   CVTS01                                                   01255000
S99TUPRM EQU   S99TUFLD+2                                               01256000
S99TULEN EQU   S99TUFLD                                                 01257000
S99TUPAR EQU   S99TUENT+2                                               01258000
S99TULNG EQU   S99TUENT                                                 01259000
S99TUNUM EQU   S99TUNIT+2                                               01260000
S99TUKEY EQU   S99TUNIT                                                 01261000
S99TUPND EQU   S99TUP                                                   01262000
S99TUPLN EQU   S99TUPTR                                                 01263000
S99FLG24 EQU   S99FLAG2+3                                               01264000
S99FLG23 EQU   S99FLAG2+2                                               01265000
S99PCINT EQU   S99FLG22                                                 01266000
S99UDEVT EQU   S99FLG22                                                 01267000
S99MOUNT EQU   S99FLG21                                                 01268000
S99CATLG EQU   S99FLG21                                                 01269000
S99TIONQ EQU   S99FLG21                                                 01270000
S99OFFLN EQU   S99FLG21                                                 01271000
S99WTUNT EQU   S99FLG21                                                 01272000
S99NORES EQU   S99FLG21                                                 01273000
S99WTDSN EQU   S99FLG21                                                 01274000
S99WTVOL EQU   S99FLG21                                                 01275000
S99RSV01 EQU   S99RB+12                                                 01276000
S99INFO  EQU   S99RSC+2                                                 01277000
S99ERROR EQU   S99RSC                                                   01278000
S99FLG12 EQU   S99FLAG1+1                                               01279000
S99JBSYS EQU   S99FLG11                                                 01280000
S99NOMNT EQU   S99FLG11                                                 01281000
S99NOCNV EQU   S99FLG11                                                 01282000
S99ONCNV EQU   S99FLG11                                                 01283000
LDNZS00F EQU   LDNZH003+1                                               01284000
LDNZS00E EQU   LDNZH003+1                                               01285000
LDNZS00D EQU   LDNZH003+1                                               01286000
LDNZS00C EQU   LDNZH003+1                                               01287000
LDNZS00B EQU   LDNZH003+1                                               01288000
LDNZS007 EQU   LDNZH003                                                 01289000
LDNZS006 EQU   LDNZH003                                                 01290000
LDNZS005 EQU   LDNZH003                                                 01291000
LDNZS004 EQU   LDNZH003                                                 01292000
LDNZS003 EQU   LDNZH003                                                 01293000
LDNZS002 EQU   LDNZH003                                                 01294000
LDNZS001 EQU   LDNZH003                                                 01295000
LDNZS000 EQU   LDNZH003                                                 01296000
LDNZX006 EQU   ISTLDNCB+576                                             01297000
LDNZC001 EQU   ISTLDNCB+569                                             01298000
LDNZX005 EQU   ISTLDNCB+568                                             01299000
LDNZV006 EQU   ISTLDNCB+564                                             01300000
LDNSRB   EQU   ISTLDNCB+520                                             01301000
LDNIOSB  EQU   ISTLDNCB+412                                             01302000
@NM00071 EQU   LDNZSAV3+28                                              01303000
LDNRSV06 EQU   LDNZSAV4+16                                              01304000
LDNZSAV6 EQU   LDNZSAV4+12                                              01305000
LDNZSAV5 EQU   LDNZSAV4                                                 01306000
LDNZSAVE EQU   LDNZSAV3                                                 01307000
LDNZSAV2 EQU   ISTLDNCB+368                                             01308000
LDNZSAV1 EQU   ISTLDNCB+352                                             01309000
LDNZ3RR  EQU   ISTLDNCB+348                                             01310000
LDNZ2RR  EQU   ISTLDNCB+344                                             01311000
LDNZ1RR  EQU   ISTLDNCB+340                                             01312000
LDNRSV0B EQU   ISTLDNCB+336                                             01313000
LDNRSV0A EQU   ISTLDNCB+332                                             01314000
LDNRSV09 EQU   ISTLDNCB+328                                             01315000
LDNRSV08 EQU   ISTLDNCB+324                                             01316000
LDNRSV07 EQU   ISTLDNCB+320                                             01317000
LDNDEAD  EQU   LDNDCDEB+12                                              01318000
LDNUCBAD EQU   LDNDCDEB+8                                               01319000
LDNEXSCL EQU   LDNDCDEB+4                                               01320000
LDNDCBAD EQU   LDNDCDEB+1                                               01321000
LDNDEBID EQU   LDNDCDEB                                                 01322000
LDNZRIND EQU   ISTLDNCB+300                                             01323000
LDNRPH   EQU   ISTLDNCB+192                                             01324000
LDNZTCP  EQU   ISTLDNCB+188                                             01325000
LDNZCHNC EQU   ISTLDNCB+187                                             01326000
LDNZLPC7 EQU   LDNZLPC                                                  01327000
LDNZLPC6 EQU   LDNZLPC                                                  01328000
LDNZLPC5 EQU   LDNZLPC                                                  01329000
LDNZLPC4 EQU   LDNZLPC                                                  01330000
LDNZLPC3 EQU   LDNZLPC                                                  01331000
LDNZLPC2 EQU   LDNZLPC                                                  01332000
LDNZLPC1 EQU   LDNZLPC                                                  01333000
LDNZLPC0 EQU   LDNZLPC                                                  01334000
LDNRSV05 EQU   LDNZERPF                                                 01335000
LDNZCTOV EQU   LDNZEPIN                                                 01336000
LDNZF001 EQU   LDNZEPIN                                                 01337000
LDNZFRDW EQU   LDNZCPAN                                                 01338000
LDNZFRD  EQU   LDNZCPAN                                                 01339000
LDNZNARD EQU   LDNZCPAN                                                 01340000
LDNRSV04 EQU   LDNZIOLK                                                 01341000
LDNZATBF EQU   LDNZIOLK                                                 01342000
LDNZERLK EQU   LDNZIOLK                                                 01343000
LDNZDSIC EQU   LDNZIOLK                                                 01344000
LDNZPAB1 EQU   ISTLDNCB+168                                             01345000
LDNZV005 EQU   ISTLDNCB+160                                             01346000
LDNZS1VR EQU   ISTLDNCB+136                                             01347000
LDNZS1RR EQU   ISTLDNCB+132                                             01348000
LDNZS1FC EQU   ISTLDNCB+128                                             01349000
LDNZS1BC EQU   ISTLDNCB+124                                             01350000
LDNZLOCK EQU   ISTLDNCB+120                                             01351000
LDNZFBUF EQU   ISTLDNCB+116                                             01352000
LDNZLAST EQU   ISTLDNCB+112                                             01353000
LDNRSV02 EQU   LDNFLAG2                                                 01354000
LDNZFF04 EQU   LDNFLAG2                                                 01355000
LDNZFF69 EQU   LDNFLAGS+2                                               01356000
LDNTPBIO EQU   LDNFLAGS+2                                               01357000
LDNZFF03 EQU   LDNFLAGS+2                                               01358000
LDNZFF02 EQU   LDNFLAGS+2                                               01359000
LDNZFF01 EQU   LDNFLAGS+2                                               01360000
LDNZFF00 EQU   LDNFLAGS+2                                               01361000
LDNCLOSD EQU   LDNFLAGS+2                                               01362000
LDNZENTR EQU   LDNFLAGS+2                                               01363000
LDNZICCW EQU   LDNFLAGS+1                                               01364000
LDNZREC  EQU   LDNFLAGS+1                                               01365000
LDNZCTXT EQU   LDNFLAGS+1                                               01366000
LDNZATLK EQU   LDNFLAGS+1                                               01367000
LDNZCHNE EQU   LDNFLAGS+1                                               01368000
LDNZATTP EQU   LDNFLAGS+1                                               01369000
LDNZIOBY EQU   LDNFLAGS+1                                               01370000
LDNZF00A EQU   LDNFLAGS+1                                               01371000
LDNZF009 EQU   LDNFLAGS                                                 01372000
LDNZF008 EQU   LDNFLAGS                                                 01373000
LDNZF007 EQU   LDNFLAGS                                                 01374000
LDNZF006 EQU   LDNFLAGS                                                 01375000
LDNZF005 EQU   LDNFLAGS                                                 01376000
LDNZF004 EQU   LDNFLAGS                                                 01377000
LDNZF003 EQU   LDNFLAGS                                                 01378000
LDNZF002 EQU   LDNFLAGS                                                 01379000
LDNZHDCC EQU   ISTLDNCB+106                                             01380000
LDNZARM  EQU   ISTLDNCB+104                                             01381000
LDNZRM   EQU   ISTLDNCB+102                                             01382000
LDNZRB   EQU   ISTLDNCB+100                                             01383000
LDNCPQ   EQU   ISTLDNCB+96                                              01384000
LDNSIOQ  EQU   ISTLDNCB+92                                              01385000
LDNZX002 EQU   ISTLDNCB+91                                              01386000
LDNZX001 EQU   ISTLDNCB+90                                              01387000
LDNZH002 EQU   ISTLDNCB+88                                              01388000
LDNZV001 EQU   ISTLDNCB+84                                              01389000
LDNZACSW EQU   ISTLDNCB+76                                              01390000
LDNZC002 EQU   ISTLDNCB+68                                              01391000
LDNCSWSV EQU   ISTLDNCB+60                                              01392000
LDNCHFLD EQU   ISTLDNCB+56                                              01393000
LDNRESRV EQU   ISTLDNCB+55                                              01394000
@NM00070 EQU   LDNCFLAG                                                 01395000
LDNRMF   EQU   LDNCFLAG                                                 01396000
LDNIBI   EQU   LDNCFLAG                                                 01397000
LDNTSAF  EQU   ISTLDNCB+52                                              01398000
LDNCUUA  EQU   ISTLDNCB+48                                              01399000
LDNCB    EQU   ISTLDNCB                                                 01400000
ICNZCON6 EQU   ICNZCONS+10                                              01401000
ICNZCON5 EQU   ICNZCONS+8                                               01402000
ICNZCON4 EQU   ICNZCONS+6                                               01403000
ICNZCON3 EQU   ICNZCONS+4                                               01404000
ICNZCON2 EQU   ICNZCONS+2                                               01405000
ICNZCON1 EQU   ICNZCONS                                                 01406000
ICNZATSA EQU   ISTICNCB+676                                             01407000
ICNZX012 EQU   ISTICNCB+675                                             01408000
ICNZX011 EQU   ISTICNCB+674                                             01409000
ICNZX010 EQU   ISTICNCB+672                                             01410000
ICNSRB   EQU   ISTICNCB+628                                             01411000
ICNIOSB  EQU   ISTICNCB+520                                             01412000
ICNZC001 EQU   ISTICNCB+512                                             01413000
ICNZX013 EQU   ISTICNCB+511                                             01414000
ICNZS010 EQU   ICNZH002+1                                               01415000
ICNZS00F EQU   ICNZH002+1                                               01416000
ICNZS00E EQU   ICNZH002+1                                               01417000
ICNZS00D EQU   ICNZH002+1                                               01418000
ICNZS00C EQU   ICNZH002+1                                               01419000
ICNZS00B EQU   ICNZH002+1                                               01420000
ICNZS01A EQU   ICNZS00A                                                 01421000
ICNZS019 EQU   ICNZS009                                                 01422000
ICNZS018 EQU   ICNZS008                                                 01423000
ICNZS017 EQU   ICNZS007                                                 01424000
ICNZS016 EQU   ICNZS006                                                 01425000
ICNZS005 EQU   ICNZH002                                                 01426000
ICNZS014 EQU   ICNZS004                                                 01427000
ICNZS013 EQU   ICNZS003                                                 01428000
ICNZS012 EQU   ICNZS002                                                 01429000
ICNZS001 EQU   ICNZH002                                                 01430000
ICNZF028 EQU   ICNZFLAG                                                 01431000
ICNZF027 EQU   ICNZFLAG                                                 01432000
ICNZF026 EQU   ICNZFLAG                                                 01433000
ICNZF025 EQU   ICNZFLAG                                                 01434000
ICNZF024 EQU   ICNZFLAG                                                 01435000
ICNZF023 EQU   ICNZFLAG                                                 01436000
ICNZF022 EQU   ICNZFLAG                                                 01437000
ICNZF021 EQU   ICNZFLAG                                                 01438000
ICNWORD5 EQU   ISTICNCB+504                                             01439000
ICNMSIZE EQU   ISTICNCB+500                                             01440000
ICNLCVTA EQU   ISTICNCB+496                                             01441000
ICNDEBAD EQU   ICNDIDEB+1                                               01442000
ICNDCBIF EQU   ICNDIDEB                                                 01443000
ICNUCBAD EQU   ICNDCDEB+8                                               01444000
ICNEXSCL EQU   ICNDCDEB+4                                               01445000
ICNDCBAD EQU   ICNDCDEB+1                                               01446000
ICNDEBID EQU   ICNDCDEB                                                 01447000
@NM00069 EQU   ISTICNCB+477                                             01448000
ICNERCNT EQU   ISTICNCB+476                                             01449000
ICNZX002 EQU   ISTICNCB+475                                             01450000
ICNZX001 EQU   ISTICNCB+474                                             01451000
ICNZH001 EQU   ISTICNCB+472                                             01452000
ICNZSW3R EQU   ISTICNCB+468                                             01453000
ICNZSW2R EQU   ISTICNCB+464                                             01454000
ICNZSW1R EQU   ISTICNCB+460                                             01455000
ICNZS4VR EQU   ISTICNCB+436                                             01456000
ICNZS4RR EQU   ISTICNCB+432                                             01457000
ICNZS4FC EQU   ISTICNCB+428                                             01458000
ICNZS4BC EQU   ISTICNCB+424                                             01459000
ICNZS3VR EQU   ISTICNCB+400                                             01460000
ICNZS3RR EQU   ISTICNCB+396                                             01461000
ICNZS3FC EQU   ISTICNCB+392                                             01462000
ICNZS3BC EQU   ISTICNCB+388                                             01463000
ICNZS1RC EQU   ICNZS1VR+36                                              01464000
ICNDIEW3 EQU   ICNDIEWA+8                                               01465000
ICNDIEW2 EQU   ICNDIEWA+4                                               01466000
ICNDIEW1 EQU   ICNDIEWA                                                 01467000
ICNZS1RR EQU   ISTICNCB+344                                             01468000
ICNZS1FC EQU   ISTICNCB+340                                             01469000
ICNZS1BC EQU   ISTICNCB+336                                             01470000
ICNRSTIC EQU   ICNZD004                                                 01471000
ICNRDCOD EQU   ICNRSCCW                                                 01472000
ICNZD006 EQU   ISTICNCB+312                                             01473000
ICNZD005 EQU   ISTICNCB+304                                             01474000
ICNWSTIC EQU   ICNZD002                                                 01475000
ICNWRCOD EQU   ICNWSCCW                                                 01476000
ICNZV008 EQU   ISTICNCB+284                                             01477000
ICNZV007 EQU   ISTICNCB+280                                             01478000
ICNZV006 EQU   ISTICNCB+276                                             01479000
ICNZV005 EQU   ISTICNCB+272                                             01480000
ICNZV004 EQU   ISTICNCB+268                                             01481000
ICNLSTIT EQU   ISTICNCB+264                                             01482000
ICNLSTIF EQU   ISTICNCB+260                                             01483000
ICNZV002 EQU   ISTICNCB+256                                             01484000
ICNZV001 EQU   ISTICNCB+252                                             01485000
ICNZV00A EQU   ISTICNCB+249                                             01486000
ICNBUFF  EQU   ISTICNCB+248                                             01487000
ICNCPQ   EQU   ISTICNCB+244                                             01488000
ICNNICNA EQU   ISTICNCB+240                                             01489000
@NM00068 EQU   ICNFLAG2+2                                               01490000
ICNZF019 EQU   ICNFLAG2+2                                               01491000
ICNZF018 EQU   ICNFLAG2+2                                               01492000
ICNZF017 EQU   ICNFLAG2+2                                               01493000
ICNZF016 EQU   ICNFLAG2+2                                               01494000
ICNZF015 EQU   ICNFLAG2+2                                               01495000
ICNMSG   EQU   ICNFLAG2+1                                               01496000
ICNCLOSE EQU   ICNFLAG2+1                                               01497000
ICNZF014 EQU   ICNFLAG2+1                                               01498000
ICNZF013 EQU   ICNFLAG2+1                                               01499000
ICNZF012 EQU   ICNFLAG2+1                                               01500000
ICNZF011 EQU   ICNFLAG2+1                                               01501000
ICNZF00D EQU   ICNFLAG2+1                                               01502000
ICNZF00B EQU   ICNFLAG2+1                                               01503000
ICNZF00A EQU   ICNFLAG2                                                 01504000
ICNZF008 EQU   ICNFLAG2                                                 01505000
ICNZF007 EQU   ICNFLAG2                                                 01506000
ICNZF005 EQU   ICNFLAG2                                                 01507000
ICNZF004 EQU   ICNFLAG2                                                 01508000
ICNZF003 EQU   ICNFLAG2                                                 01509000
ICNZF002 EQU   ICNFLAG2                                                 01510000
ICNZF001 EQU   ICNFLAG2                                                 01511000
ICNLOCK  EQU   ISTICNCB+232                                             01512000
ICNLICNA EQU   ISTICNCB+228                                             01513000
ICNRPH   EQU   ISTICNCB+120                                             01514000
ICNZV003 EQU   ISTICNCB+116                                             01515000
ICNLAST  EQU   ISTICNCB+112                                             01516000
ICNLSTBT EQU   ISTICNCB+108                                             01517000
ICNSIOQ  EQU   ISTICNCB+104                                             01518000
ICNFLAG1 EQU   ISTICNCB+103                                             01519000
ICNZSW08 EQU   ICNZSWS                                                  01520000
ICNZSW07 EQU   ICNZSWS                                                  01521000
ICNZSW06 EQU   ICNZSWS                                                  01522000
ICNZSW05 EQU   ICNZSWS                                                  01523000
ICNZSW04 EQU   ICNZSWS                                                  01524000
ICNZSW03 EQU   ICNZSWS                                                  01525000
ICNZSW02 EQU   ICNZSWS                                                  01526000
ICNZSW01 EQU   ICNZSWS                                                  01527000
ICNZFF69 EQU   ICNFFLAG                                                 01528000
@NM00067 EQU   ICNFFLAG                                                 01529000
ICNZFF05 EQU   ICNFFLAG                                                 01530000
ICNZFF04 EQU   ICNFFLAG                                                 01531000
ICNZFF03 EQU   ICNFFLAG                                                 01532000
ICNZFF02 EQU   ICNFFLAG                                                 01533000
ICNZFF01 EQU   ICNFFLAG                                                 01534000
ICNZFF00 EQU   ICNFFLAG                                                 01535000
@NM00066 EQU   ICNFLAG                                                  01536000
ICNZCRIT EQU   ICNFLAG                                                  01537000
ICNSTART EQU   ICNFLAG                                                  01538000
ICNSLOW  EQU   ICNFLAG                                                  01539000
ICNZF010 EQU   ICNFLAG                                                  01540000
ICNZF00F EQU   ICNFLAG                                                  01541000
ICNZF00E EQU   ICNFLAG                                                  01542000
ICNCONF  EQU   ICNZF006                                                 01543000
ICNCKPAB EQU   ICNCKFLD+1                                               01544000
ICNRSV07 EQU   ICNCKFLD                                                 01545000
ICNCKBIT EQU   ICNCKFLD                                                 01546000
ICNZPAB4 EQU   ISTICNCB+80                                              01547000
ICNZPAB1 EQU   ISTICNCB+64                                              01548000
ICNRSV01 EQU   ISTICNCB+60                                              01549000
@NM00065 EQU   ISTICNCB+56                                              01550000
@NM00064 EQU   ISTICNCB+54                                              01551000
@NM00063 EQU   @NM00062                                                 01552000
ICNRRY   EQU   @NM00062                                                 01553000
ICNLCLUS EQU   @NM00062                                                 01554000
ICNROLN  EQU   @NM00062                                                 01555000
ICNRNRY  EQU   @NM00062                                                 01556000
ICNLNKMD EQU   ISTICNCB+52                                              01557000
ICNCUUA  EQU   ISTICNCB+48                                              01558000
ICNCB    EQU   ISTICNCB                                                 01559000
NCBRSV01 EQU   ISTNCB+46                                                01560000
NCBSWDAF EQU   ISTNCB+44                                                01561000
NCBDEVCH EQU   ISTNCB+36                                                01562000
NCBFMCBP EQU   ISTNCB+32                                                01563000
NCBLTRC  EQU   ISTNCB+30                                                01564000
NCBRVPT1 EQU   ISTNCB+28                                                01565000
NCBNMLLN EQU   NCBFLAGS+3                                               01566000
@NM00061 EQU   NCBFLAG1                                                 01567000
NCBFORCE EQU   NCBFLAG1                                                 01568000
NCBTTF   EQU   NCBFLAG1                                                 01569000
NCBRSYNC EQU   NCBFLAG1                                                 01570000
NCBRSTRT EQU   NCBFLAG1                                                 01571000
NCBCONF  EQU   NCBFLAG1                                                 01572000
NCBSNAI  EQU   NCBFLAG1                                                 01573000
NCBFLTIO EQU   NCBFTRIO                                                 01574000
NCBCSTAT EQU   NCBFLAGS                                                 01575000
NCBNCSL  EQU   ISTNCB+22                                                01576000
NCBNCBA  EQU   ISTNCB+20                                                01577000
NCBFMCBA EQU   ISTNCB+16                                                01578000
NCBNSNA  EQU   ISTNCB+12                                                01579000
NCBTSKID EQU   ISTNCB+8                                                 01580000
NCBRDTE  EQU   ISTNCB+4                                                 01581000
NCBDAF   EQU   ISTNCB+2                                                 01582000
NCBLNGTH EQU   ISTNCB+1                                                 01583000
NCBTYPE  EQU   ISTNCB                                                   01584000
DEVRSV03 EQU   ISTDEVCH+5                                               01585000
DEVPHYSA EQU   ISTDEVCH+4                                               01586000
DEVCSLPN EQU   DEVCHAR3                                                 01587000
DEVCSTCL EQU   DEVCHAR3                                                 01588000
DEVCCHEK EQU   DEVCHAR3                                                 01589000
DEVCATTN EQU   DEVCHAR3                                                 01590000
DEVCSWL  EQU   DEVFCCTL                                                 01591000
DEVCRVB  EQU   DEVFCCTL                                                 01592000
DEVCSSL  EQU   DEVFCCTL                                                 01593000
DEVCBSC  EQU   DEVFCCTL                                                 01594000
DEVMCODE EQU   ISTDEVCH+2                                               01595000
DEVCHAR2 EQU   DEVTCODE                                                 01596000
DEVRSV01 EQU   DEVCHAR                                                  01597000
DEVCCTL  EQU   DEVCHAR                                                  01598000
DEVNNSPT EQU   DEVCHAR                                                  01599000
DEVSPS   EQU   DEVCHAR                                                  01600000
DEVSUBND EQU   DEVCHAR                                                  01601000
DEVCONVR EQU   DEVCHAR                                                  01602000
DEVOTPUT EQU   DEVCHAR                                                  01603000
DEVINPUT EQU   DEVCHAR                                                  01604000
ISTPDAVP EQU   ISTAVT+40                                                01605000
ISTAVR01 EQU   ISTAVT+38                                                01606000
ISTVTTP  EQU   ISTAVT+36                                                01607000
ISTAGTWT EQU   ISTAVT+34                                                01608000
ISTATRT  EQU   ISTAVT+32                                                01609000
ISTARID  EQU   ISTAVT+30                                                01610000
ISTX1    EQU   ISTAVT+29                                                01611000
ISTPHNM  EQU   ISTAVT+24                                                01612000
ISTAPSEX EQU   ISTAVT+20                                                01613000
ISTVTTIK EQU   ISTAVT+18                                                01614000
ISTAPSTA EQU   ISTAVT+12                                                01615000
ISTAS53  EQU   ISTAVT+8                                                 01616000
ISTAHIP  EQU   ISTAS49                                                  01617000
ISTACVT  EQU   ISTAVT                                                   01618000
ATCAOS   EQU   ISTATCVT+1584                                            01619000
ATCPOPAB EQU   ATCAOSM+640                                              01620000
ATCVIOPM EQU   ATCAOSM+636                                              01621000
ATCTPMMI EQU   ATCAOSM+632                                              01622000
ATCTPMPB EQU   ATCAOSM+600                                              01623000
ATCRSV88 EQU   ATCAOSM+596                                              01624000
ATCRPLCT EQU   ATCAOSM+594                                              01625000
ATCCRACT EQU   ATCAOSM+592                                              01626000
ATCSRBCT EQU   ATCAOSM+590                                              01627000
ATCRSV75 EQU   ATCAOSM+589                                              01628000
ATCRSV66 EQU   ATCZFLAG                                                 01629000
ATCZF001 EQU   ATCZFLAG                                                 01630000
ATCTPCP1 EQU   ATCAOSM+584                                              01631000
ATCTPCP0 EQU   ATCAOSM+580                                              01632000
ATCAICTN EQU   ATCAOSM+576                                              01633000
ATCZR01  EQU   ATCAOSM+572                                              01634000
ATCMPLTA EQU   ATCAOSM+568                                              01635000
ATCASCB  EQU   ATCAOSM+564                                              01636000
ATCAP86  EQU   ATCAOSM+560                                              01637000
ATCAP85  EQU   ATCAOSM+556                                              01638000
ATCAP84  EQU   ATCAOSM+552                                              01639000
ATCAP83  EQU   ATCAOSM+548                                              01640000
ATCAP82  EQU   ATCAOSM+544                                              01641000
ATCAP69  EQU   ATCAOSM+540                                              01642000
ATCAP66  EQU   ATCAOSM+536                                              01643000
ATCAP62  EQU   ATCAOSM+532                                              01644000
ATCAPC59 EQU   ATCAOSM+528                                              01645000
ATCAP56  EQU   ATCAOSM+524                                              01646000
ATCAP55  EQU   ATCAOSM+520                                              01647000
ATCRCFY0 EQU   ATCAOSM+516                                              01648000
ATCAP41  EQU   ATCAOSM+512                                              01649000
ATCAPC25 EQU   ATCAOSM+508                                              01650000
ATCAP23  EQU   ATCAOSM+504                                              01651000
ATCTPSPB EQU   ATCAOSM+472                                              01652000
ATCTRMPB EQU   ATCAOSM+440                                              01653000
ATCAPBE  EQU   ATCAOSM+436                                              01654000
ATCPSTA  EQU   ATCAOSM+432                                              01655000
ATCSMABF EQU   ATCAOSM+428                                              01656000
ATCSMAPR EQU   ATCAOSM+424                                              01657000
ATCTPWQA EQU   ATCAOSM+420                                              01658000
ATCSMAID EQU   ATCAOSM+416                                              01659000
ATCSMARA EQU   ATCAOSM+412                                              01660000
ATCCACXA EQU   ATCAOSM+408                                              01661000
ATCZLAAB EQU   ATCAOSM+404                                              01662000
ATCATA10 EQU   ATCAOSM+400                                              01663000
ATCHLTCB EQU   ATCAOSM+396                                              01664000
@NM00060 EQU   ATCVTFLG                                                 01665000
ATCVTACT EQU   ATCVTFLG                                                 01666000
ATCRPT40 EQU   ATCAOSM+388                                              01667000
ATCRPT39 EQU   ATCAOSM+384                                              01668000
ATCRPT38 EQU   ATCAOSM+380                                              01669000
ATCRPT37 EQU   ATCAOSM+376                                              01670000
ATCRPT36 EQU   ATCAOSM+372                                              01671000
ATCRPT35 EQU   ATCAOSM+368                                              01672000
ATCRPT34 EQU   ATCAOSM+364                                              01673000
ATCRPT33 EQU   ATCAOSM+360                                              01674000
ATCRPT32 EQU   ATCAOSM+356                                              01675000
ATCRPT31 EQU   ATCAOSM+352                                              01676000
ATCRPT30 EQU   ATCAOSM+348                                              01677000
ATCOCWCB EQU   ATCAOSM+344                                              01678000
ATCOCWOB EQU   ATCAOSM+340                                              01679000
ATCRPT27 EQU   ATCAOSM+336                                              01680000
@NM00059 EQU   ATCAOSM+333                                              01681000
@NM00058 EQU   @NM00057                                                 01682000
ATCSNUF  EQU   @NM00057                                                 01683000
ATCOPKL  EQU   @NM00057                                                 01684000
ATCABEN  EQU   @NM00057                                                 01685000
ATCAIWT  EQU   ATCAOSM+328                                              01686000
ATCINFDD EQU   ATCAOSM+324                                              01687000
ATCORFMG EQU   ATCAOSM+320                                              01688000
ATCORFRL EQU   ATCAOSM+316                                              01689000
ATCOROBT EQU   ATCAOSM+312                                              01690000
ATCORQG  EQU   ATCORSRB                                                 01691000
ATCORTBF EQU   ATCSQAFR                                                 01692000
ATCRPLAC EQU   ATCRPLCN+2                                               01693000
ATCRPLRC EQU   ATCRPLCN                                                 01694000
ATCCRPLQ EQU   ATCCRPL                                                  01695000
ATCSRBAC EQU   ATCSRBCN+2                                               01696000
ATCSRBRC EQU   ATCSRBCN                                                 01697000
ATCSRBQ  EQU   ATCSRB                                                   01698000
ATCCRAAC EQU   ATCCRACN+2                                               01699000
ATCCRARC EQU   ATCCRACN                                                 01700000
ATCCRAQ  EQU   ATCCRA                                                   01701000
ATCRPT12 EQU   ATCAOSM+276                                              01702000
ATCDMAPP EQU   ATCAOSM+272                                              01703000
ATCAP38  EQU   ATCAOSM+268                                              01704000
ATCAP37  EQU   ATCAOSM+264                                              01705000
ATCZDFJ0 EQU   ATCAOSM+260                                              01706000
ATCAP51  EQU   ATCAOSM+256                                              01707000
ATCZPAB2 EQU   ATCAOSM+224                                              01708000
ATCZPAB1 EQU   ATCAOSM+192                                              01709000
ATCZLFVT EQU   ATCAOSM+188                                              01710000
ATCZLPVT EQU   ATCAOSM+184                                              01711000
ATCZDVTX EQU   ATCAOSM+180                                              01712000
ATCZDVTA EQU   ATCAOSM+176                                              01713000
ATCZDVT9 EQU   ATCAOSM+172                                              01714000
ATCZDVT8 EQU   ATCAOSM+168                                              01715000
ATCZDVT7 EQU   ATCAOSM+164                                              01716000
ATCRSV56 EQU   ATCDAPVT+22                                              01717000
ATCDAPDG EQU   ATCDAPVT+20                                              01718000
ATCDXCEA EQU   ATCDAPVT+16                                              01719000
ATCDCEA  EQU   ATCDAPVT+12                                              01720000
ATCDPCIA EQU   ATCDAPVT+8                                               01721000
ATCDSIOA EQU   ATCDAPVT+4                                               01722000
ATCDEOEA EQU   ATCDAPVT                                                 01723000
ATCZLAEA EQU   ATCLDAPP+16                                              01724000
ATCZLCEA EQU   ATCLDAPP+12                                              01725000
ATCRSV17 EQU   ATCLDAPP+8                                               01726000
ATCSMFRR EQU   ATCLDAPP+4                                               01727000
ATCCDTID EQU   ATCLDAPP                                                 01728000
ATCZAEA  EQU   ATCICAPP+16                                              01729000
ATCZCEA  EQU   ATCICAPP+12                                              01730000
ATCCDTCB EQU   ATCICAPP+8                                               01731000
ATCZSIOA EQU   ATCICAPP+4                                               01732000
ATCCDRPH EQU   ATCICAPP                                                 01733000
ATCAP65  EQU   ATCAOSM+96                                               01734000
ATCZDVT6 EQU   ATCAOSM+92                                               01735000
ATCZDVT4 EQU   ATCAOSM+88                                               01736000
ATCZDVT3 EQU   ATCAOSM+84                                               01737000
ATCZDVT1 EQU   ATCAOSM+80                                               01738000
ATCICNCB EQU   ATCAOSM+76                                               01739000
ATCZPSVT EQU   ATCAOSM+72                                               01740000
ATCZFSVT EQU   ATCAOSM+68                                               01741000
ATCAP64  EQU   ATCAOSM+64                                               01742000
ATCAP63  EQU   ATCAOSM+60                                               01743000
ATCAP61  EQU   ATCAOSM+56                                               01744000
ATCAP58  EQU   ATCAOSM+52                                               01745000
ATCAP57  EQU   ATCAOSM+48                                               01746000
ATCAP54  EQU   ATCAOSM+44                                               01747000
ATCAP53  EQU   ATCAOSM+40                                               01748000
ATCAP52  EQU   ATCAOSM+36                                               01749000
ATCAP34  EQU   ATCAOSM+32                                               01750000
ATCAP32  EQU   ATCAOSM+28                                               01751000
ATCAP31  EQU   ATCAOSM+24                                               01752000
ATCAP12  EQU   ATCAOSM+20                                               01753000
ATCAP11  EQU   ATCAOSM+16                                               01754000
ATCCMTCB EQU   ATCAOSM+12                                               01755000
ATCPRPH  EQU   ATCAOSM+8                                                01756000
ATCGSRBF EQU   ATCGSRBG                                                 01757000
ATCSRBRT EQU   ATCAOSM                                                  01758000
@NM00056 EQU   @NM00055                                                 01759000
ATCVTMAB EQU   @NM00055                                                 01760000
@NM00054 EQU   ATCVTBAM                                                 01761000
ATCVDLOK EQU   ISTATCVT+904                                             01762000
ATCVFPAB EQU   ISTATCVT+872                                             01763000
ATCVDPAB EQU   ISTATCVT+840                                             01764000
ATCIOECB EQU   ISTATCVT+836                                             01765000
ATCINCW3 EQU   ISTATCVT+832                                             01766000
ATCMODTB EQU   ISTATCVT+828                                             01767000
ATCUSSPT EQU   ISTATCVT+824                                             01768000
ATCSRTAB EQU   ISTATCVT+820                                             01769000
@NM00053 EQU   ISTATCVT+819                                             01770000
@NM00052 EQU   ATCSTAT2                                                 01771000
ATCTRSMS EQU   ATCSTAT2                                                 01772000
ATCTRLOK EQU   ATCSTAT2                                                 01773000
ATCTRPSS EQU   ATCSTAT2                                                 01774000
ATCTRESC EQU   ATCSTAT2                                                 01775000
ATCTRAPI EQU   ATCSTAT2                                                 01776000
ATCNMCTR EQU   ISTATCVT+816                                             01777000
ATCSEC51 EQU   ATCSECST                                                 01778000
ATCSEC40 EQU   ATCSIPD+8                                                01779000
ATCSEC30 EQU   ATCSIPD+4                                                01780000
ATCSEC21 EQU   ATCSIPD                                                  01781000
ATCSEC10 EQU   ATCSOPD+4                                                01782000
ATCSEC01 EQU   ATCSOPD                                                  01783000
ATCPOIA  EQU   ATCRNO+1                                                 01784000
@NM00051 EQU   ATCRNO                                                   01785000
ATCPODVT EQU   ISTATCVT+784                                             01786000
ATCS49XL EQU   ISTATCVT+780                                             01787000
ATCS49XI EQU   ISTATCVT+776                                             01788000
ATCLCLCT EQU   ATCVLCNT+2                                               01789000
ATCRNCNT EQU   ATCVLCNT                                                 01790000
ATCCFEAD EQU   ISTATCVT+768                                             01791000
ATCPTR00 EQU   ISTATCVT+736                                             01792000
ATCRSV10 EQU   ISTATCVT+704                                             01793000
ATCTACB  EQU   ISTATCVT+700                                             01794000
ATCVTINM EQU   ISTATCVT+696                                             01795000
ATCTCLIM EQU   ISTATCVT+692                                             01796000
ATCTCLOM EQU   ISTATCVT+688                                             01797000
ATCVTIPB EQU   ISTATCVT+656                                             01798000
ATCTCIPB EQU   ISTATCVT+624                                             01799000
ATCTIPAB EQU   ISTATCVT+592                                             01800000
ATCOCCCB EQU   ISTATCVT+588                                             01801000
ATCOCCOB EQU   ISTATCVT+584                                             01802000
ATCCDLAD EQU   ISTATCVT+580                                             01803000
ATCCCLAD EQU   ISTATCVT+576                                             01804000
ATCDLRPB EQU   ISTATCVT+544                                             01805000
ATCPGPAB EQU   ISTATCVT+512                                             01806000
ATCVPAB1 EQU   ISTATCVT+480                                             01807000
ATCRSV97 EQU   ISTATCVT+476                                             01808000
ATCRDTLK EQU   ISTATCVT+472                                             01809000
ATCVOCLK EQU   ISTATCVT+468                                             01810000
ATCCDFDN EQU   ISTATCVT+464                                             01811000
ATCCDFIN EQU   ISTATCVT+460                                             01812000
ATCDVTLK EQU   ISTATCVT+456                                             01813000
ATCAP36  EQU   ISTATCVT+452                                             01814000
ATCAP35  EQU   ISTATCVT+448                                             01815000
ATCAP33  EQU   ISTATCVT+444                                             01816000
ATCRSV99 EQU   ISTATCVT+440                                             01817000
ATCONFIG EQU   ISTATCVT+432                                             01818000
ATCNODDS EQU   ISTATCVT+428                                             01819000
ATCNODEL EQU   ISTATCVT+420                                             01820000
ATCRSV69 EQU   ISTATCVT+416                                             01821000
ATCAPCR5 EQU   ISTATCVT+412                                             01822000
ATCLDECB EQU   ISTATCVT+408                                             01823000
ATCLDNCS EQU   ISTATCVT+404                                             01824000
ATCCDPTR EQU   ISTATCVT+400                                             01825000
ATCADEL  EQU   ISTATCVT+396                                             01826000
ATCTODVT EQU   ISTATCVT+392                                             01827000
ATCDEBCH EQU   ISTATCVT+388                                             01828000
ATCHBSIZ EQU   ATCHPGM+2                                                01829000
ATCHBFNO EQU   ATCHPGM                                                  01830000
ATCCRME  EQU   ISTATCVT+380                                             01831000
ATCRVCHS EQU   ISTATCVT+372                                             01832000
ATCECTLP EQU   ISTATCVT+368                                             01833000
ATCZDVTB EQU   ISTATCVT+364                                             01834000
ATCECPRT EQU   ISTATCVT+360                                             01835000
ATCVTLOD EQU   ISTATCVT+356                                             01836000
ATCTRPAB EQU   ISTATCVT+352                                             01837000
ATCMSGM  EQU   ISTATCVT+348                                             01838000
ATCMSGP  EQU   ISTATCVT+344                                             01839000
ATCEPT   EQU   ISTATCVT+340                                             01840000
ATCDVT   EQU   ISTATCVT+336                                             01841000
ATCTRCPT EQU   ISTATCVT+332                                             01842000
ATCDVLOD EQU   ISTATCVT+328                                             01843000
ATCALERT EQU   ISTATCVT+324                                             01844000
ATCEPA   EQU   ISTATCVT+320                                             01845000
ATCSAF   EQU   ISTATCVT+318                                             01846000
ATCXRANG EQU   ISTATCVT+317                                             01847000
ATCLAST  EQU   ATCSHRFG                                                 01848000
ATCSHRTN EQU   ISTATCVT+308                                             01849000
ATCUEP   EQU   ISTATCVT+304                                             01850000
ATCOCRT  EQU   ISTATCVT+300                                             01851000
ATCCSMA  EQU   ATCCSMR                                                  01852000
ATCESC02 EQU   ISTATCVT+292                                             01853000
ATCESC01 EQU   ISTATCVT+288                                             01854000
ATCCDFND EQU   ISTATCVT+284                                             01855000
ATCCDDEL EQU   ISTATCVT+280                                             01856000
ATCCDADD EQU   ISTATCVT+276                                             01857000
ATCMNT   EQU   ISTATCVT+272                                             01858000
ATCRSV16 EQU   ISTATCVT+270                                             01859000
ATCMAXID EQU   ISTATCVT+269                                             01860000
ATCMSGSP EQU   ATCCOM+268                                               01861000
ATCCIDM  EQU   ATCCOM+266                                               01862000
ATCACTRM EQU   ATCCOM+264                                               01863000
ATCNERAP EQU   ATCCOM+260                                               01864000
ATCNESAL EQU   ATCCOM+256                                               01865000
ATCRCC65 EQU   ATCCOM+252                                               01866000
ATCRCC26 EQU   ATCCOM+248                                               01867000
ATCRCC63 EQU   ATCCOM+244                                               01868000
ATCRSV11 EQU   ATCCOM+242                                               01869000
ATCVTMID EQU   ATCCOM+240                                               01870000
ATCAPOST EQU   ATCCOM+236                                               01871000
ATCNERFN EQU   ATCCOM+232                                               01872000
ATCNERNE EQU   ATCCOM+228                                               01873000
ATCNERCV EQU   ATCCOM+224                                               01874000
ATCNERST EQU   ATCCOM+220                                               01875000
ATCDCC61 EQU   ATCCOM+216                                               01876000
ATCDCC60 EQU   ATCCOM+212                                               01877000
ATCSRTDF EQU   ATCCOM+208                                               01878000
ATCSRTAD EQU   ATCCOM+204                                               01879000
ATCFIRA  EQU   ATCCOM+200                                               01880000
ATCSMBQ  EQU   ATCCOM+196                                               01881000
ATCSMRC  EQU   ATCCOM+192                                               01882000
ATCSMRS  EQU   ATCCOM+188                                               01883000
ATCSMQU  EQU   ATCCOM+184                                               01884000
ATCSMRQ  EQU   ATCCOM+180                                               01885000
ATCACDA  EQU   ATCCOM+176                                               01886000
ATCSTMA  EQU   ATCCOM+172                                               01887000
ATCFRSTR EQU   ATCCOM+168                                               01888000
ATCGTSTR EQU   ATCCOM+164                                               01889000
ATCREADA EQU   ATCCOM+160                                               01890000
ATCALOAD EQU   ATCCOM+156                                               01891000
ATCBLDLA EQU   ATCCOM+152                                               01892000
ATCFBRPH EQU   ATCCOM+148                                               01893000
ATCBFTRC EQU   ATCCOM+144                                               01894000
ATCTPBUF EQU   ATCTHTRC                                                 01895000
ATCREMOV EQU   ATCCOM+136                                               01896000
ATCADD   EQU   ATCCOM+132                                               01897000
ATCBPDA  EQU   ATCCOM+128                                               01898000
ATCDVTPT EQU   ATCCOM+124                                               01899000
ATCFEPT  EQU   ATCCOM+120                                               01900000
ATCFDVT  EQU   ATCCOM+116                                               01901000
ATCCONFT EQU   ATCCOM+112                                               01902000
ATCPTCHA EQU   ATCCOM+108                                               01903000
ATCAUTHA EQU   ATCCOM+104                                               01904000
ATCACCTA EQU   ATCCOM+100                                               01905000
ATCRDTH  EQU   ATCCOM+96                                                01906000
ATCFRSCH EQU   ATCCOM+92                                                01907000
ATCFSB   EQU   ATCCOM+88                                                01908000
ATCHLTMS EQU   ATCCOM+84                                                01909000
ATCECPRM EQU   ATCCOM+80                                                01910000
ATCECNET EQU   ATCCOM+76                                                01911000
ATCECOPC EQU   ATCCOM+72                                                01912000
ATCVPARM EQU   ATCCOM+68                                                01913000
ATCECVRQ EQU   ATCCOM+64                                                01914000
ATCECSES EQU   ATCCOM+60                                                01915000
ATCOCHA  EQU   ATCCOM+56                                                01916000
ATCDSPLQ EQU   ATCCOM+52                                                01917000
ATCECDSP EQU   ATCCOM+48                                                01918000
ATCVARYQ EQU   ATCCOM+44                                                01919000
ATCECVRY EQU   ATCCOM+40                                                01920000
ATCHALTQ EQU   ATCCOM+36                                                01921000
ATCECHLT EQU   ATCCOM+32                                                01922000
ATCMODQ  EQU   ATCCOM+28                                                01923000
ATCECMOD EQU   ATCCOM+24                                                01924000
ATCASCHD EQU   ATCCOM+20                                                01925000
ATCSRT   EQU   ATCCOM+16                                                01926000
ATCRDT   EQU   ATCCOM+12                                                01927000
ATCDCFRR EQU   ATCCOM+8                                                 01928000
ATCAPI   EQU   ATCCOM+4                                                 01929000
ATCRSV04 EQU   ATCSTAT4                                                 01930000
ATCVTTRC EQU   ATCSTAT4                                                 01931000
ATCNCSD  EQU   ATCSTAT4                                                 01932000
ATCMTST  EQU   ATCSTAT4                                                 01933000
ATCTPRT  EQU   ATCSTAT4                                                 01934000
ATCPRTAT EQU   ATCSTAT4                                                 01935000
@NM00050 EQU   ATCPOFLG                                                 01936000
ATCPOUNS EQU   ATCPOFLG                                                 01937000
ATCHSDMF EQU   ATCSTFLG                                                 01938000
@NM00049 EQU   ATCSTAT1                                                 01939000
ATCMDHLT EQU   ATCSTAT1                                                 01940000
ATCINHLT EQU   ATCSTAT1                                                 01941000
ATCNETSL EQU   ATCSTAT1                                                 01942000
ATCQKHLT EQU   ATCSTAT1                                                 01943000
ATCSNHLT EQU   ATCSTAT1                                                 01944000
ATCACTIV EQU   ATCSTAT1                                                 01945000
ATCSTART EQU   ATCSTAT1                                                 01946000
RPHNEXPO EQU   ISTRPH+104                                               01947000
RPHSAV16 EQU   RPHWORK+60                                               01948000
RPHSAV15 EQU   RPHWORK+56                                               01949000
RPHSAV14 EQU   RPHWORK+52                                               01950000
RPHSAV13 EQU   RPHWORK+48                                               01951000
RPHSAV12 EQU   RPHWORK+44                                               01952000
RPHSAV11 EQU   RPHWORK+40                                               01953000
RPHSAV10 EQU   RPHWORK+36                                               01954000
RPHSAVE9 EQU   RPHWORK+32                                               01955000
RPHSAVE8 EQU   RPHWORK+28                                               01956000
RPHSAVE7 EQU   RPHWORK+24                                               01957000
RPHSAVE6 EQU   RPHWORK+20                                               01958000
RPHSAVE5 EQU   RPHWORK+16                                               01959000
RPHSAVE4 EQU   RPHWORK+12                                               01960000
RPHSAVE3 EQU   RPHWORK+8                                                01961000
RPHSAVE2 EQU   RPHWORK+4                                                01962000
RPHSHALF EQU   RPHSAVE1+2                                               01963000
RPHSBIT8 EQU   RPHSBITS                                                 01964000
RPHSBIT7 EQU   RPHSBITS                                                 01965000
RPHSBIT6 EQU   RPHSBITS                                                 01966000
RPHSBIT5 EQU   RPHSBITS                                                 01967000
RPHSBIT4 EQU   RPHSBITS                                                 01968000
RPHSBIT3 EQU   RPHSBITS                                                 01969000
RPHSBIT2 EQU   RPHSBITS                                                 01970000
RPHSBIT1 EQU   RPHSBITS                                                 01971000
RPHSBYTE EQU   RPHSAVE1                                                 01972000
RPHPABQP EQU   RPHPABQA+1                                               01973000
RPHPABFG EQU   RPHPABQA                                                 01974000
RPHCRR   EQU   ISTRPH+32                                                01975000
RPHSRP34 EQU   RPHSRPRM+2                                               01976000
RPHSRP12 EQU   RPHSRPRM                                                 01977000
RPHWEGT  EQU   RPHCSPA                                                  01978000
RPHMAJCB EQU   ISTRPH+21                                                01979000
RPHPABOF EQU   ISTRPH+20                                                01980000
RPHRESUM EQU   RPHRESMA+1                                               01981000
RPHRSV01 EQU   RPHWPFLG                                                 01982000
RPHPURGE EQU   RPHWPFLG                                                 01983000
RPHPT    EQU   RPHWPFLG                                                 01984000
RPHWT    EQU   RPHWPFLG                                                 01985000
RPHRSKEY EQU   RPHWPFLG                                                 01986000
RPHDVTA  EQU   ISTRPH+12                                                01987000
RPHTIK   EQU   RPHTSKID+3                                               01988000
@NM00048 EQU   RPHTSKID                                                 01989000
RPHRPHAP EQU   RPHRPHA+1                                                01990000
@NM00047 EQU   RPHCVFLG                                                 01991000
RPHFRRPH EQU   RPHCVFLG                                                 01992000
RPHOWRPH EQU   RPHCVFLG                                                 01993000
RPHCDRPH EQU   RPHCVFLG                                                 01994000
RPHPSRPH EQU   RPHCVFLG                                                 01995000
RPHVYRPH EQU   RPHGATE                                                  01996000
@NM00046 EQU   RPHFLGB                                                  01997000
RPHRLCRA EQU   RPHFLGB                                                  01998000
RPHNRSAV EQU   RPHFLGB                                                  01999000
RPHPGCMP EQU   RPHFLGB                                                  02000000
RPHFBAPS EQU   RPHFLGB                                                  02001000
RPHBSSP  EQU   RPHFLGB                                                  02002000
RPHLOCK  EQU   RPHFLGB                                                  02003000
RPHFNFLG EQU   RPHFSTLC                                                 02004000
RPHMLTCP EQU   RPHFLAGS                                                 02005000
RPHSMCLR EQU   RPHFLAGS                                                 02006000
RPHSMTYP EQU   RPHFLAGS                                                 02007000
RPHSMQ   EQU   RPHFLAGS                                                 02008000
RPHAUTEX EQU   RPHAPTYP                                                 02009000
RPHSPGIN EQU   RPHFLAGS                                                 02010000
RPHOGIND EQU   RPHFLAGS                                                 02011000
RPHLNGTH EQU   RPHCNTL+1                                                02012000
RPHTYPE  EQU   RPHCNTL                                                  02013000
DYPPAB   EQU   ISTDYPAB+16                                              02014000
DYPRSV01 EQU   ISTDYPAB+12                                              02015000
DYPTSKID EQU   ISTDYPAB+8                                               02016000
DYPCHAIN EQU   ISTDYPAB+4                                               02017000
DYPFLGS  EQU   ISTDYPAB+2                                               02018000
DYPLNGTH EQU   ISTDYPAB+1                                               02019000
DYPTYPE  EQU   ISTDYPAB                                                 02020000
LOKXCL   EQU   @NM00044                                                 02021000
LOKPRY   EQU   @NM00044                                                 02022000
@NM00045 EQU   @NM00044                                                 02023000
@NM00043 EQU   LOKCHNG                                                  02024000
LOKCT    EQU   ISTLOK                                                   02025000
PABRPHA  EQU   PABRPHFG+1                                               02026000
PABNODQ  EQU   PABFLAGS                                                 02027000
PABINHBT EQU   PABFLAGS                                                 02028000
PABERLOK EQU   PABERRLK                                                 02029000
PABSSN   EQU   PABFLAGS                                                 02030000
PABDYNAM EQU   PABFLAGS                                                 02031000
PABNORPR EQU   PABFLAGS                                                 02032000
PABPRIOR EQU   PABFLAGS                                                 02033000
PABAPYP  EQU   PABFLAGS                                                 02034000
PABDVTA  EQU   ISTPAB+9                                                 02035000
PABOFFST EQU   ISTPAB+8                                                 02036000
PABCHNGP EQU   PABCHAIN+1                                               02037000
PABRSV02 EQU   PABCHAIN                                                 02038000
PABDELAY EQU   PABCHAIN                                                 02039000
PABRUNNG EQU   PABCHAIN                                                 02040000
PABRESET EQU   PABCHAIN                                                 02041000
PABUNCON EQU   PABCHAIN                                                 02042000
PABCDP   EQU   PABCHAIN                                                 02043000
PABRESCH EQU   PABCHAIN                                                 02044000
PABCHNG  EQU   PABCHAIN                                                 02045000
PABWEQP  EQU   PABWEQA+1                                                02046000
PABRSV01 EQU   PABWEQA                                                  02047000
PABWEQG  EQU   PABWEQA                                                  02048000
@NM00042 EQU   SRBSECT+40                                               02049000
@NM00041 EQU   SRBSECT+38                                               02050000
SRBPRIOR EQU   SRBSECT+37                                               02051000
SRBPKF   EQU   SRBSECT+36                                               02052000
SRBSAVE  EQU   SRBSECT+32                                               02053000
SRBPARM  EQU   SRBSECT+28                                               02054000
SRBRMTR  EQU   SRBSECT+24                                               02055000
SRBEP    EQU   SRBSECT+20                                               02056000
SRBPTCB  EQU   SRBFLC+4                                                 02057000
SRBPASID EQU   SRBFLC+2                                                 02058000
SRBCPAFF EQU   SRBFLC                                                   02059000
SRBASCB  EQU   SRBSECT+8                                                02060000
SRBFLNK  EQU   SRBSECT+4                                                02061000
SRBID    EQU   SRBSECT                                                  02062000
IOSEND   EQU   IOSB+108                                                 02063000
IOSSKR   EQU   IOSEEKA+7                                                02064000
IOSSKH2  EQU   IOSSKHH+1                                                02065000
IOSSKH1  EQU   IOSSKHH                                                  02066000
IOSSKCC  EQU   IOSCCHH                                                  02067000
IOSSKBB  EQU   IOSEEKA+1                                                02068000
IOSSKM   EQU   IOSEEKA                                                  02069000
IOSEEK   EQU   IOSB+92                                                  02070000
IOSMDM   EQU   IOSB+91                                                  02071000
IOSMDB   EQU   IOSB+90                                                  02072000
IOSCKEY7 EQU   IOSCKEY                                                  02073000
IOSCKEY6 EQU   IOSCKEY                                                  02074000
IOSCKEY5 EQU   IOSCKEY                                                  02075000
IOSCKEY4 EQU   IOSCKEY                                                  02076000
@NM00037 EQU   IOSCKEY                                                  02077000
IOSFMSK  EQU   IOSB+88                                                  02078000
IOSCUDEV EQU   IOSPATH+1                                                02079000
@NM00036 EQU   IOSCHN                                                   02080000
IOSPATH3 EQU   IOSCHN                                                   02081000
IOSPATH2 EQU   IOSCHN                                                   02082000
IOSEXP   EQU   IOSCHN                                                   02083000
IOSGDP   EQU   IOSCHN                                                   02084000
IOSAFF   EQU   IOSB+85                                                  02085000
IOSRSS1B EQU   IOSB+84                                                  02086000
IOSDSID  EQU   IOSB+80                                                  02087000
IOSVST   EQU   IOSB+76                                                  02088000
IOSRST   EQU   IOSB+72                                                  02089000
IOSDIE   EQU   IOSB+68                                                  02090000
IOSABN   EQU   IOSB+64                                                  02091000
IOSNRM   EQU   IOSB+60                                                  02092000
IOSPCI   EQU   IOSB+56                                                  02093000
IOSERP   EQU   IOSB+52                                                  02094000
IOSPCHN  EQU   IOSB+48                                                  02095000
IOSSNS   EQU   IOSB+42                                                  02096000
IOSAPMSK EQU   IOSB+40                                                  02097000
IOSRES4A EQU   IOSB+36                                                  02098000
IOSUSE   EQU   IOSB+32                                                  02099000
IOSSRB   EQU   IOSB+28                                                  02100000
IOSCSWRC EQU   IOSCSW+5                                                 02101000
IOSTSB   EQU   IOSTATUS+1                                               02102000
IOSTSA   EQU   IOSTATUS                                                 02103000
IOSCSWCA EQU   IOSCSW                                                   02104000
IOSCC    EQU   @NM00035                                                 02105000
IOSUCB   EQU   IOSB+16                                                  02106000
IOSOPT2X EQU   IOSOPT2                                                  02107000
IOSHTP   EQU   IOSOPT2                                                  02108000
IOSRELSE EQU   IOSOPT                                                   02109000
IOSAPR   EQU   IOSOPT                                                   02110000
IOSTSLL  EQU   IOSOPT                                                   02111000
IOSNERP  EQU   IOSOPT                                                   02112000
IOSPSLL  EQU   IOSOPT                                                   02113000
IOSQISCE EQU   IOSOPT                                                   02114000
IOSDEP   EQU   IOSOPT                                                   02115000
IOSBYP   EQU   IOSOPT                                                   02116000
IOSCOD   EQU   IOSB+13                                                  02117000
IOSPKY7  EQU   IOSPKEY                                                  02118000
IOSPGDPX EQU   IOSPKEY                                                  02119000
IOSIDR   EQU   IOSPKEY                                                  02120000
IOSLCL   EQU   IOSPKEY                                                  02121000
@NM00034 EQU   IOSPKEY                                                  02122000
IOSPGAD  EQU   IOSB+8                                                   02123000
IOSASID  EQU   IOSB+6                                                   02124000
IOSPRLVL EQU   IOSB+5                                                   02125000
IOSDVRID EQU   IOSB+4                                                   02126000
IOSPROC  EQU   IOSB+3                                                   02127000
IOSFLC7  EQU   IOSFLC                                                   02128000
IOSFLC6  EQU   IOSFLC                                                   02129000
IOSRWAIT EQU   IOSFLC                                                   02130000
IOSTP    EQU   IOSFLC                                                   02131000
IOSCC3WE EQU   IOSFLC                                                   02132000
IOSVERIF EQU   IOSDVALT                                                 02133000
IOSDVMNT EQU   IOSFLC                                                   02134000
IOSLOG   EQU   IOSFLB                                                   02135000
IOSBDCST EQU   IOSFLB                                                   02136000
IOSMSG   EQU   IOSFLB                                                   02137000
IOSFLB4  EQU   IOSFLB                                                   02138000
IOSFLB3  EQU   IOSFLB                                                   02139000
IOSFLB2  EQU   IOSFLB                                                   02140000
IOSSDR   EQU   IOSFLB                                                   02141000
IOSDIESE EQU   IOSFLB                                                   02142000
IOSIOSB  EQU   IOSFLA                                                   02143000
IOSDOM   EQU   IOSFLA                                                   02144000
IOSEX    EQU   IOSFLA                                                   02145000
IOSSMDB  EQU   IOSFLA                                                   02146000
IOSSMDA  EQU   IOSFLA                                                   02147000
IOSERR   EQU   IOSFLA                                                   02148000
IOSCCHN  EQU   IOSACHN                                                  02149000
IOSDCHN  EQU   IOSACHN                                                  02150000
IOXEND   EQU   IOCX+32                                                  02151000
IOXPSIF  EQU   IOCX+28                                                  02152000
IOXPSIX  EQU   IOCX+24                                                  02153000
IOXSTIDC EQU   IOCX+20                                                  02154000
IOXCRHD  EQU   IOCX+16                                                  02155000
IOXCRHA  EQU   IOCX+12                                                  02156000
IOXTCQSC EQU   IOCX+8                                                   02157000
@NM00033 EQU   IOCX+6                                                   02158000
IOXLCHCT EQU   IOCX+5                                                   02159000
IOXCHMSK EQU   IOCX+2                                                   02160000
IOXOFSET EQU   IOX                                                      02161000
IOCOEND  EQU   IOCOM+128                                                02162000
IOCPATCH EQU   IOCOM+124                                                02163000
IOCQCNT  EQU   IOCOM+116                                                02164000
IOCIOSDQ EQU   IOCOM+112                                                02165000
IOCIOSEQ EQU   IOCOM+108                                                02166000
IOCSVCF  EQU   IOCOM+104                                                02167000
IOCTCCW  EQU   IOCOM+100                                                02168000
IOCRSVTB EQU   IOCOM+96                                                 02169000
IOCMFCNT EQU   IOCOM+92                                                 02170000
IOCMFHK  EQU   IOCOM+88                                                 02171000
IOCGENA  EQU   IOCOM+84                                                 02172000
IOCCCH   EQU   IOCOM+80                                                 02173000
IOCASYNQ EQU   IOCOM+76                                                 02174000
IOCLCHTB EQU   IOCOM+72                                                 02175000
IOCATTBL EQU   IOCOM+68                                                 02176000
IOCSYNCH EQU   IOCOM+56                                                 02177000
IOCCATLK EQU   IOCOM+48                                                 02178000
IOCPRGID EQU   IOCOM+44                                                 02179000
IOCIOSCP EQU   IOCOM+40                                                 02180000
IOCORMGT EQU   IOCOM+36                                                 02181000
IOCVOID  EQU   IOCOM+32                                                 02182000
IOCSTIO  EQU   IOCOM+28                                                 02183000
@NM00032 EQU   IOCOM+24                                                 02184000
@NM00031 EQU   IOCOM+20                                                 02185000
IOCINT   EQU   IOCOM+16                                                 02186000
IOCCTBL  EQU   IOCOM+12                                                 02187000
IOCHIO   EQU   IOCOM+8                                                  02188000
IOCPST   EQU   IOCOM+4                                                  02189000
IOCPGCT  EQU   IOCOM+2                                                  02190000
IOCVOICT EQU   IOCOM                                                    02191000
IOBERRCT EQU   IOBSTDRD+30                                              02192000
IOBRSV19 EQU   IOBINCAM+1                                               02193000
IOBOLTST EQU   IOBBTAMF                                                 02194000
IOBRFTMG EQU   IOBBTAMF                                                 02195000
IOBRSV17 EQU   IOBBTAMF                                                 02196000
IOBRSV16 EQU   IOBBTAMF                                                 02197000
IOBRSV15 EQU   IOBBTAMF                                                 02198000
IOBRSV14 EQU   IOBBTAMF                                                 02199000
IOBINUSE EQU   IOBBTAMF                                                 02200000
IOBPRMER EQU   IOBBTAMF                                                 02201000
IOBRSTRB EQU   IOBRESTR+1                                               02202000
IOBREPOS EQU   IOBRESTR                                                 02203000
IOBDCBPB EQU   IOBDCBPT+1                                               02204000
IOBRSV44 EQU   IOBFLAG4                                                 02205000
IOBJES3I EQU   IOBFLAG4                                                 02206000
IOBRSV42 EQU   IOBFLAG4                                                 02207000
IOBRSV41 EQU   IOBFLAG4                                                 02208000
IOBRSV40 EQU   IOBFLAG4                                                 02209000
IOBPMERR EQU   IOBFLAG4                                                 02210000
IOBCC3WE EQU   IOBFLAG4                                                 02211000
IOBGDPOL EQU   IOBFLAG4                                                 02212000
IOBSTRTB EQU   IOBSTART+1                                               02213000
IOBSIOCC EQU   IOBSTART                                                 02214000
IOBCSB7  EQU   IOBCSTAT                                                 02215000
IOBCSB6  EQU   IOBCSTAT                                                 02216000
IOBCSB5  EQU   IOBCSTAT                                                 02217000
IOBCSB4  EQU   IOBCSTAT                                                 02218000
IOBCSB3  EQU   IOBCSTAT                                                 02219000
IOBCSB2  EQU   IOBCSTAT                                                 02220000
IOBCSB1  EQU   IOBCSTAT                                                 02221000
IOBCSB0  EQU   IOBCSTAT                                                 02222000
IOBUSB7  EQU   IOBUSTAT                                                 02223000
IOBUSB6  EQU   IOBUSTAT                                                 02224000
IOBUSB5  EQU   IOBUSTAT                                                 02225000
IOBUSB4  EQU   IOBUSTAT                                                 02226000
IOBUSB3  EQU   IOBUSTAT                                                 02227000
IOBUSB2  EQU   IOBUSTAT                                                 02228000
IOBUSB1  EQU   IOBUSTAT                                                 02229000
IOBUSB0  EQU   IOBUSTAT                                                 02230000
IOBCMDA  EQU   IOBIOCSW                                                 02231000
IOBLOG   EQU   IOBFL3                                                   02232000
IOBJAM   EQU   IOBICL                                                   02233000
IOBMSG   EQU   IOBFL3                                                   02234000
IOBSDR   EQU   IOBCNC                                                   02235000
IOBACU   EQU   IOBFL3                                                   02236000
IOBCDC   EQU   IOBFL3                                                   02237000
IOBICC   EQU   IOBFL3                                                   02238000
IOBCCC   EQU   IOBFL3                                                   02239000
IOBECBPB EQU   IOBECBPT+1                                               02240000
IOBECBCC EQU   IOBECBPT                                                 02241000
IOBS1B7  EQU   IOBSENS1                                                 02242000
IOBS1B6  EQU   IOBSENS1                                                 02243000
IOBS1B5  EQU   IOBSENS1                                                 02244000
IOBS1B4  EQU   IOBSENS1                                                 02245000
IOBS1B3  EQU   IOBSENS1                                                 02246000
IOBS1B2  EQU   IOBSENS1                                                 02247000
IOBS1B1  EQU   IOBSENS1                                                 02248000
IOBS1B0  EQU   IOBSENS1                                                 02249000
IOBSNSC9 EQU   IOBS0B7                                                  02250000
IOBS0B6  EQU   IOBSENS0                                                 02251000
IOBS0B5  EQU   IOBSENS0                                                 02252000
IOBS0B4  EQU   IOBSENS0                                                 02253000
IOBS0B3  EQU   IOBSENS0                                                 02254000
IOBS0B2  EQU   IOBSENS0                                                 02255000
IOBS0B1  EQU   IOBSENS0                                                 02256000
IOBS0B0  EQU   IOBSENS0                                                 02257000
IOBPNCH  EQU   IOBFLAG2                                                 02258000
IOBSTATO EQU   IOBFLAG2                                                 02259000
IOBSKUPD EQU   IOBFLAG2                                                 02260000
IOBALTTR EQU   IOBFLAG2                                                 02261000
IOBRRT2  EQU   IOBRDHA0                                                 02262000
IOBRRT3  EQU   IOBPURGE                                                 02263000
IOBSENSE EQU   IOBFLAG2                                                 02264000
IOBHALT  EQU   IOBFLAG2                                                 02265000
IOBSPSVC EQU   IOBRSTRT                                                 02266000
IOBUNREL EQU   IOBFLAG1                                                 02267000
IOBIOERR EQU   IOBFLAG1                                                 02268000
IOBFCREX EQU   IOBCYCCK                                                 02269000
IOBRPSTN EQU   IOBFLAG1                                                 02270000
IOBERRTN EQU   IOBFLAG1                                                 02271000
IOBCMDCH EQU   IOBFLAG1                                                 02272000
IOBDATCH EQU   IOBFLAG1                                                 02273000
IOBCNOPA EQU   IOBPREFX+12                                              02274000
IOBCICB  EQU   IOBPREFX+8                                               02275000
IOBCECB  EQU   IOBPREFX+4                                               02276000
IOBCONOP EQU   IOBPREFX+3                                               02277000
IOBCINOP EQU   IOBPREFX+2                                               02278000
IOBRSV05 EQU   IOBPREFX+1                                               02279000
IOBPCI   EQU   IOBCFLG1                                                 02280000
IOBRSTCH EQU   IOBCFLG1                                                 02281000
IOBABAPP EQU   IOBCFLG1                                                 02282000
IOBPTST  EQU   IOBCFLG1                                                 02283000
IOBRSV04 EQU   IOBCFLG1                                                 02284000
IOBRSV03 EQU   IOBCFLG1                                                 02285000
IOBRSV02 EQU   IOBCFLG1                                                 02286000
IOBRSV01 EQU   IOBCFLG1                                                 02287000
UCBERADR EQU   UCBUCS+12                                                02288000
UCBFCBID EQU   UCBUCS+8                                                 02289000
UCBERCNT EQU   UCBUCS+7                                                 02290000
UCBRSV51 EQU   UCBUCS+6                                                 02291000
UCBRSV50 EQU   UCBFCBOP                                                 02292000
UCBRSV49 EQU   UCBFCBOP                                                 02293000
UCBRSV48 EQU   UCBFCBOP                                                 02294000
UCBRSV47 EQU   UCBFCBOP                                                 02295000
UCBRSV46 EQU   UCBFCBOP                                                 02296000
UCBRSV45 EQU   UCBFCBOP                                                 02297000
UCBRSV44 EQU   UCBFCBOP                                                 02298000
UCBFCBO1 EQU   UCBFCBOP                                                 02299000
UCBUCSPE EQU   UCBUCSOP                                                 02300000
UCBRSV43 EQU   UCBUCSOP                                                 02301000
UCBRSV42 EQU   UCBUCSOP                                                 02302000
UCBRSV41 EQU   UCBUCSOP                                                 02303000
UCBRSV40 EQU   UCBUCSOP                                                 02304000
UCBRSV39 EQU   UCBUCSOP                                                 02305000
UCBUCSO2 EQU   UCBUCSOP                                                 02306000
UCBUCSO1 EQU   UCBUCSOP                                                 02307000
UCBUCSID EQU   UCBUCS                                                   02308000
UCBMDRBA EQU   UCBMDRBF+1                                               02309000
UCBRV075 EQU   UCBMDRBF                                                 02310000
UCBRV074 EQU   UCB3800X+32                                              02311000
UCBIMAGE EQU   UCB3800X+28                                              02312000
UCBFCBNM EQU   UCB3800X+24                                              02313000
UCBCHAR4 EQU   UCB3800X+20                                              02314000
UCBCHAR3 EQU   UCB3800X+16                                              02315000
UCBCHAR2 EQU   UCB3800X+12                                              02316000
UCBCHAR1 EQU   UCB3800X+8                                               02317000
UCBCGMID EQU   UCB3800X+4                                               02318000
UCBBRSTA EQU   UCBACTIV                                                 02319000
UCBRV063 EQU   UCBACTIV                                                 02320000
UCBRV062 EQU   UCBACTIV                                                 02321000
UCBRV061 EQU   UCBACTIV                                                 02322000
UCBRV060 EQU   UCBACTIV                                                 02323000
UCBRV059 EQU   UCBACTIV                                                 02324000
UCBRV058 EQU   UCBACTIV                                                 02325000
UCBRV057 EQU   UCBACTIV                                                 02326000
UCBRV050 EQU   UCB3800X+2                                               02327000
UCBCGMNO EQU   UCB3800X+1                                               02328000
UCBRV083 EQU   UCBOPTNS                                                 02329000
UCBBRSTR EQU   UCBOPTNS                                                 02330000
UCBRV056 EQU   UCBOPTNS                                                 02331000
UCBRV055 EQU   UCBOPTNS                                                 02332000
UCBRV054 EQU   UCBOPTNS                                                 02333000
UCBRV053 EQU   UCBOPTNS                                                 02334000
UCBRV052 EQU   UCBOPTNS                                                 02335000
UCBRV051 EQU   UCBOPTNS                                                 02336000
UCBRV073 EQU   UCB3540X+7                                               02337000
UCBRV072 EQU   UCBDKBYT                                                 02338000
UCBRV071 EQU   UCBDKBYT                                                 02339000
UCBRV070 EQU   UCBDKBYT                                                 02340000
UCBRV069 EQU   UCBDKBYT                                                 02341000
UCBRV068 EQU   UCBDKBYT                                                 02342000
UCBRV067 EQU   UCBDKBYT                                                 02343000
UCBVLVER EQU   UCBDKBYT                                                 02344000
UCBDKAMX EQU   UCBDKBYT                                                 02345000
UCBVLSER EQU   UCB3540X                                                 02346000
UCBRDATA EQU   UCBOCR+4                                                 02347000
UCBFRID  EQU   UCBOCR                                                   02348000
UCBCLN   EQU   UCBMT+14                                                 02349000
UCBERG   EQU   UCBMT+12                                                 02350000
UCBMS    EQU   UCBMT+11                                                 02351000
UCBNB    EQU   UCBMT+10                                                 02352000
UCBPW    EQU   UCBMT+9                                                  02353000
UCBPR    EQU   UCBMT+8                                                  02354000
UCBSIO   EQU   UCBMT+6                                                  02355000
UCBTW    EQU   UCBMT+5                                                  02356000
UCBTR    EQU   UCBMT+4                                                  02357000
UCBTWT   EQU   UCBMT+3                                                  02358000
UCBTRT   EQU   UCBMT+2                                                  02359000
UCBCTD   EQU   UCBMT                                                    02360000
UCBWTOID EQU   UCBCMEXT+17                                              02361000
UCBRV043 EQU   UCBCMEXT+16                                              02362000
UCBMFCNT EQU   UCBCMEXT+12                                              02363000
UCBPMSK  EQU   UCBCMEXT+10                                              02364000
UCBCCWOF EQU   UCBCMEXT+8                                               02365000
UCBRV041 EQU   UCBCMEXT+6                                               02366000
UCBRV036 EQU   UCBFLP1                                                  02367000
UCBRV035 EQU   UCBFLP1                                                  02368000
UCBERLOG EQU   UCBFLP1                                                  02369000
UCBRV033 EQU   UCBFLP1                                                  02370000
UCBRV032 EQU   UCBFLP1                                                  02371000
UCBRV031 EQU   UCBFLP1                                                  02372000
UCBSHRUP EQU   UCBFLP1                                                  02373000
UCBNSRCH EQU   UCBFLP1                                                  02374000
UCBSNSCT EQU   UCBCMEXT+4                                               02375000
UCBHPDV  EQU   @NM00006                                                 02376000
UCBHALI  EQU   @NM00006                                                 02377000
UCBRSV09 EQU   @NM00006                                                 02378000
UCBRSV08 EQU   @NM00006                                                 02379000
UCBRSV07 EQU   @NM00006                                                 02380000
UCBRSV06 EQU   @NM00006                                                 02381000
UCBRSV05 EQU   @NM00006                                                 02382000
UCBRSV04 EQU   @NM00006                                                 02383000
UCBDTI   EQU   UCBCMEXT+2                                               02384000
UCBSTI   EQU   UCBCMEXT+1                                               02385000
UCBEXTP  EQU   UCBEXTPT+1                                               02386000
UCBDDRSW EQU   UCBFLC                                                   02387000
UCBTICBT EQU   UCBFLC                                                   02388000
UCBIVRR  EQU   UCBFLC                                                   02389000
UCBIVRS  EQU   UCBFLC                                                   02390000
UCBITF   EQU   UCBFLC                                                   02391000
UCBUDE   EQU   UCBFLC                                                   02392000
UCBWAA   EQU   UCBFLC                                                   02393000
UCBATTP  EQU   UCBFLC                                                   02394000
UCBUNTYP EQU   UCBTBYT4                                                 02395000
UCBRSV11 EQU   UCBDVCLS                                                 02396000
UCBRSV10 EQU   UCBDVCLS                                                 02397000
UCB3CHAR EQU   UCBDVCLS                                                 02398000
UCB3UREC EQU   UCBDVCLS                                                 02399000
UCB3DACC EQU   UCBDVCLS                                                 02400000
UCB3TAPE EQU   UCBDVCLS                                                 02401000
UCBDVPWR EQU   UCB2OPT7                                                 02402000
UCBVLPWR EQU   UCB2OPT6                                                 02403000
UCB2OPT5 EQU   UCBTBYT2                                                 02404000
UCBRVDEV EQU   UCBRWTAU                                                 02405000
UCBRPS   EQU   UCBDUDN2                                                 02406000
UCBRR    EQU   UCBDUDN1                                                 02407000
UCB2OPT1 EQU   UCBTBYT2                                                 02408000
UCB2OPT0 EQU   UCBTBYT2                                                 02409000
UCB1FEA7 EQU   UCBTBYT1                                                 02410000
UCBD6250 EQU   UCB1FEA6                                                 02411000
UCBD1600 EQU   UCB1FEA5                                                 02412000
UCB1FEA4 EQU   UCBTBYT1                                                 02413000
UCB1FEA3 EQU   UCBTBYT1                                                 02414000
UCB1FEA2 EQU   UCBTBYT1                                                 02415000
UCB1FEA1 EQU   UCBTBYT1                                                 02416000
UCB1FEA0 EQU   UCBTBYT1                                                 02417000
UCBRV029 EQU   UCBWGT                                                   02418000
UCBVHRSN EQU   UCBWGT                                                   02419000
UCBVORSN EQU   UCBWGT                                                   02420000
UCBMTPXP EQU   UCBWGT                                                   02421000
UCBREW   EQU   UCBWGT                                                   02422000
UCBPUB   EQU   UCBWGT                                                   02423000
UCBOUT   EQU   UCBWGT                                                   02424000
UCBIN    EQU   UCBWGT                                                   02425000
UCBCPU   EQU   UCBOB+11                                                 02426000
UCBLCI   EQU   UCBOB+10                                                 02427000
UCBCNT   EQU   UCBOB+9                                                  02428000
UCBRV017 EQU   UCBCHM1                                                  02429000
UCBRV016 EQU   UCBCHM1                                                  02430000
UCBRV015 EQU   UCBCHM1                                                  02431000
UCBRV014 EQU   UCBCHM1                                                  02432000
UCBSPB   EQU   UCBPTH1                                                  02433000
UCBPPB   EQU   UCBPTH1                                                  02434000
UCBSPA   EQU   UCBPTH0                                                  02435000
UCBPPA   EQU   UCBPTH0                                                  02436000
UCBSIGP  EQU   UCBFLB                                                   02437000
UCBVALPH EQU   UCBFLB                                                   02438000
UCBCRHSN EQU   UCBFLB                                                   02439000
UCBCRHRV EQU   UCBFLB                                                   02440000
UCBRESVH EQU   UCBFLB                                                   02441000
UCBSPST  EQU   UCBFLB                                                   02442000
UCBASNS  EQU   UCBFLB                                                   02443000
UCBIORST EQU   UCBFLB                                                   02444000
UCBQISCE EQU   UCBFL1                                                   02445000
UCBACTV  EQU   UCBFL1                                                   02446000
UCBSAP   EQU   UCBFL1                                                   02447000
UCBNOTRC EQU   UCBCUB                                                   02448000
UCBPSNS  EQU   UCBFL1                                                   02449000
UCBUSING EQU   UCBPST                                                   02450000
UCBNOTRD EQU   UCBNRY                                                   02451000
UCBBUSYD EQU   UCBBSY                                                   02452000
UCBUA    EQU   UCBCHAN+1                                                02453000
UCBCHA   EQU   UCBCHAN                                                  02454000
UCBDADI  EQU   UCBSTAT                                                  02455000
UCBSYSR  EQU   UCBSTAT                                                  02456000
UCBPRES  EQU   UCBSTAT                                                  02457000
UCBUNLD  EQU   UCBSTAT                                                  02458000
UCBRESV  EQU   UCBSTAT                                                  02459000
UCBCHGS  EQU   UCBSTAT                                                  02460000
UCBID    EQU   UCBOB+2                                                  02461000
UCBALTPH EQU   UCBFL5                                                   02462000
UCBALTCU EQU   UCBFL5                                                   02463000
UCBNALOC EQU   UCBFL5                                                   02464000
UCBENVRD EQU   UCBFL5                                                   02465000
UCBVSDR  EQU   UCBFL5                                                   02466000
UCBSASK  EQU   UCBFL5                                                   02467000
UCBAMV   EQU   UCBAF                                                    02468000
UCBDCC   EQU   UCBFL5                                                   02469000
UCBMONT  EQU   UCBJBNR                                                  02470000
UCBRV011 EQU   UCBJBNR                                                  02471000
UCBRSV02 EQU   UCBJBNR                                                  02472000
UCBOLDSM EQU   UCBJBNR                                                  02473000
UCBRV003 EQU   UCBJBNR                                                  02474000
UCBDUC   EQU   UCBJBNR                                                  02475000
UCBJES3  EQU   UCBJBNR                                                  02476000
UCBVRDEV EQU   UCBJBNR                                                  02477000
UCBCMSEG EQU   UCBOB                                                    02478000
UCBPFXND EQU   UCB+512                                                  02479000
UCBIOQ   EQU   UCB+508                                                  02480000
UCBLOCK  EQU   UCB+504                                                  02481000
UCBPXST  EQU   UCB+504                                                  02482000
@NM00003 EQU   UCB                                                      02483000
CVTLEVL  EQU   CVTRELNO+2                                               02484000
CVTNUMB  EQU   CVTRELNO                                                 02485000
CVTMDL   EQU   CVTFIX+250                                               02486000
@NM00002 EQU   CVTFIX+248                                               02487000
@NM00001 EQU   CVTFIX                                                   02488000
CVTRV482 EQU   CVTXTNT2+128                                             02489000
CVTRV481 EQU   CVTXTNT2+124                                             02490000
CVTRV480 EQU   CVTXTNT2+120                                             02491000
CVTRV479 EQU   CVTXTNT2+118                                             02492000
CVTRV478 EQU   CVTXTNT2+117                                             02493000
CVTRV477 EQU   CVTXTNT2+116                                             02494000
CVTRV476 EQU   CVTXTNT2+115                                             02495000
CVTRV475 EQU   CVTXTNT2+114                                             02496000
CVTRV474 EQU   CVTRV466                                                 02497000
CVTRV473 EQU   CVTRV466                                                 02498000
CVTRV472 EQU   CVTRV466                                                 02499000
CVTRV471 EQU   CVTRV466                                                 02500000
CVTRV470 EQU   CVTRV466                                                 02501000
CVTRV469 EQU   CVTRV466                                                 02502000
CVTRV468 EQU   CVTRV466                                                 02503000
CVTRV467 EQU   CVTRV466                                                 02504000
CVTRV465 EQU   CVTRV457                                                 02505000
CVTRV464 EQU   CVTRV457                                                 02506000
CVTRV463 EQU   CVTRV457                                                 02507000
CVTRV462 EQU   CVTRV457                                                 02508000
CVTRV461 EQU   CVTRV457                                                 02509000
CVTRV460 EQU   CVTRV457                                                 02510000
CVTRV459 EQU   CVTRV457                                                 02511000
CVTRV458 EQU   CVTRV457                                                 02512000
CVTRV456 EQU   CVTXTNT2+108                                             02513000
CVTRV455 EQU   CVTXTNT2+104                                             02514000
CVTRV454 EQU   CVTXTNT2+100                                             02515000
CVTRV453 EQU   CVTXTNT2+96                                              02516000
CVTRV452 EQU   CVTXTNT2+94                                              02517000
CVTRV451 EQU   CVTXTNT2+92                                              02518000
CVTRV450 EQU   CVTXTNT2+90                                              02519000
CVTRV449 EQU   CVTXTNT2+88                                              02520000
CVTRV448 EQU   CVTXTNT2+87                                              02521000
CVTRV447 EQU   CVTXTNT2+86                                              02522000
CVTRV446 EQU   CVTRV438                                                 02523000
CVTRV445 EQU   CVTRV438                                                 02524000
CVTRV444 EQU   CVTRV438                                                 02525000
CVTRV443 EQU   CVTRV438                                                 02526000
CVTRV442 EQU   CVTRV438                                                 02527000
CVTRV441 EQU   CVTRV438                                                 02528000
CVTRV440 EQU   CVTRV438                                                 02529000
CVTRV439 EQU   CVTRV438                                                 02530000
CVTRV437 EQU   CVTRV429                                                 02531000
CVTRV436 EQU   CVTRV429                                                 02532000
CVTRV435 EQU   CVTRV429                                                 02533000
CVTRV434 EQU   CVTRV429                                                 02534000
CVTRV433 EQU   CVTRV429                                                 02535000
CVTRV432 EQU   CVTRV429                                                 02536000
CVTRV431 EQU   CVTRV429                                                 02537000
CVTRV430 EQU   CVTRV429                                                 02538000
CVTRV428 EQU   CVTXTNT2+80                                              02539000
CVTRV427 EQU   CVTXTNT2+76                                              02540000
CVTRV426 EQU   CVTXTNT2+72                                              02541000
CVTRV425 EQU   CVTXTNT2+68                                              02542000
CVTATACT EQU   CVTATCVT                                                 02543000
CVTRV423 EQU   CVTXTNT2+62                                              02544000
CVTRV422 EQU   CVTXTNT2+60                                              02545000
CVTRV421 EQU   CVTXTNT2+58                                              02546000
CVTRV420 EQU   CVTXTNT2+56                                              02547000
CVTRV419 EQU   CVTXTNT2+55                                              02548000
CVTRV418 EQU   CVTXTNT2+54                                              02549000
CVTRV417 EQU   CVTRV409                                                 02550000
CVTRV416 EQU   CVTRV409                                                 02551000
CVTRV415 EQU   CVTRV409                                                 02552000
CVTRV414 EQU   CVTRV409                                                 02553000
CVTRV413 EQU   CVTRV409                                                 02554000
CVTRV412 EQU   CVTRV409                                                 02555000
CVTRV411 EQU   CVTRV409                                                 02556000
CVTRV410 EQU   CVTRV409                                                 02557000
CVTRV408 EQU   CVTRV400                                                 02558000
CVTRV407 EQU   CVTRV400                                                 02559000
CVTRV406 EQU   CVTRV400                                                 02560000
CVTRV405 EQU   CVTRV400                                                 02561000
CVTRV404 EQU   CVTRV400                                                 02562000
CVTRV403 EQU   CVTRV400                                                 02563000
CVTRV402 EQU   CVTRV400                                                 02564000
CVTRV401 EQU   CVTRV400                                                 02565000
CVTICB   EQU   CVTXTNT2+48                                              02566000
CVTSKTA  EQU   CVTXTNT2+44                                              02567000
CVTSHSB  EQU   CVTSHS                                                   02568000
CVTRSV98 EQU   CVTXTNT2+36                                              02569000
CVTRSV97 EQU   CVTXTNT2+34                                              02570000
CVTRSV96 EQU   CVTXTNT2+32                                              02571000
CVTOLTEP EQU   CVTXTNT2+28                                              02572000
CVTQIDA  EQU   CVTQID+1                                                 02573000
CVTRSV95 EQU   CVTQID                                                   02574000
CVTRSV94 EQU   CVTXTNT2+20                                              02575000
CVTRSV93 EQU   CVTXTNT2+16                                              02576000
CVTRSV92 EQU   CVTXTNT2+12                                              02577000
CVTDEBVR EQU   CVTXTNT2+8                                               02578000
CVTRSV91 EQU   CVTXTNT2+6                                               02579000
CVTRSV9H EQU   CVTFLGBT                                                 02580000
CVTRSV9G EQU   CVTFLGBT                                                 02581000
CVTRSV9F EQU   CVTFLGBT                                                 02582000
CVTRSV9E EQU   CVTFLGBT                                                 02583000
CVTRSV9D EQU   CVTFLGBT                                                 02584000
CVTRSV9C EQU   CVTFLGBT                                                 02585000
CVTVME   EQU   CVTFLGBT                                                 02586000
CVTNPE   EQU   CVTFLGBT                                                 02587000
CVTNUCLS EQU   CVTXTNT2+4                                               02588000
CVTDSSVA EQU   CVTDSSV+1                                                02589000
CVTRSV89 EQU   CVTDSSV                                                  02590000
CVTRSV88 EQU   CVTXTNT1+8                                               02591000
CVTRSV87 EQU   CVTXTNT1+4                                               02592000
CVTFACHN EQU   CVTXTNT1                                                 02593000
CVTRV488 EQU   CVTMAP+412                                               02594000
CVTRV487 EQU   CVTMAP+408                                               02595000
CVTRV486 EQU   CVTMAP+404                                               02596000
CVTRV485 EQU   CVTMAP+400                                               02597000
CVTACTAP EQU   CVTMAP+396                                               02598000
CVTAUTH  EQU   CVTMAP+392                                               02599000
CVTATMCA EQU   CVTATMCT+1                                               02600000
CVTATMST EQU   CVTATMCT                                                 02601000
CVTRSV61 EQU   CVTMAP+384                                               02602000
CVTVOLT1 EQU   CVTVOLM1+1                                               02603000
CVTVOLI1 EQU   CVTVOLF1                                                 02604000
CVTSTOA  EQU   CVTMAP+376                                               02605000
CVTRSV58 EQU   CVTMAP+374                                               02606000
CVTRSV57 EQU   CVTMAP+372                                               02607000
CVTDDCE  EQU   CVTMAP+368                                               02608000
CVTPNWFR EQU   CVTMAP+364                                               02609000
CVTSMF   EQU   CVTMAP+360                                               02610000
CVTSULK  EQU   CVTMAP+358                                               02611000
CVTSLKO  EQU   CVTSYSK                                                  02612000
CVTSLKP  EQU   CVTSYSK                                                  02613000
CVTSLKQ  EQU   CVTSYSK                                                  02614000
CVTSLKR  EQU   CVTSYSK                                                  02615000
CVTRSV56 EQU   CVTSYSK                                                  02616000
CVTRSV55 EQU   CVTSYSK                                                  02617000
CVTRSV54 EQU   CVTSYSK                                                  02618000
CVTRSV53 EQU   CVTSYSK                                                  02619000
CVTRSV52 EQU   CVTA1F1                                                  02620000
CVTRSV51 EQU   CVTA1F1                                                  02621000
CVTRSV50 EQU   CVTA1F1                                                  02622000
CVTRSV49 EQU   CVTA1F1                                                  02623000
CVTRSV48 EQU   CVTA1F1                                                  02624000
CVTRSV47 EQU   CVTA1F1                                                  02625000
CVTSRSW  EQU   CVTA1F1                                                  02626000
CVTPFSW  EQU   CVTA1F1                                                  02627000
CVTPCVT  EQU   CVTMAP+352                                               02628000
CVTRSV46 EQU   CVTMAP+344                                               02629000
CVTRSV45 EQU   CVTMAP+340                                               02630000
CVTRSV44 EQU   CVTMAP+338                                               02631000
CVTRSV43 EQU   CVTMAP+336                                               02632000
CVTHJESA EQU   CVTHJES+1                                                02633000
CVTRSV42 EQU   CVTHJES                                                  02634000
CVTEXT2A EQU   CVTEXT2+1                                                02635000
CVTRSV41 EQU   CVTEXT2                                                  02636000
CVTAPFA  EQU   CVTAPF+1                                                 02637000
CVTRSV40 EQU   CVTAPF                                                   02638000
CVTRV518 EQU   CVTINTLA                                                 02639000
CVTRV517 EQU   CVTERPV                                                  02640000
CVTEORM  EQU   CVTMAP+312                                               02641000
CVTMCHPR EQU   CVTMAP+308                                               02642000
CVTTZ    EQU   CVTMAP+304                                               02643000
CVTJEPS  EQU   CVTMAP+300                                               02644000
CVTJESCT EQU   CVTMAP+296                                               02645000
CVTMODE  EQU   CVTMAP+292                                               02646000
CVTPTRV  EQU   CVTMAP+288                                               02647000
CVTREAL  EQU   CVTMAP+284                                               02648000
CVTRSV39 EQU   CVTMAP+280                                               02649000
CVTRSV38 EQU   CVTMAP+276                                               02650000
CVTDMSRA EQU   CVTDMSR+1                                                02651000
CVTRV634 EQU   CVTDMSRF                                                 02652000
CVTRV633 EQU   CVTDMSRF                                                 02653000
CVTRV632 EQU   CVTDMSRF                                                 02654000
CVTRV631 EQU   CVTDMSRF                                                 02655000
CVTRV630 EQU   CVTDMSRF                                                 02656000
CVTRV629 EQU   CVTDMSRF                                                 02657000
CVTUDUMP EQU   CVTDMSRF                                                 02658000
CVTSDUMP EQU   CVTDMSRF                                                 02659000
CVTQMSGA EQU   CVTQMSG+1                                                02660000
CVTRSV36 EQU   CVTQMSG                                                  02661000
CVTAMFF  EQU   CVTMAP+264                                               02662000
CVTPURGA EQU   CVTPURG+1                                                02663000
CVTRSV35 EQU   CVTPURG                                                  02664000
CVTCBSP  EQU   CVTMAP+256                                               02665000
CVTATERA EQU   CVTATER+1                                                02666000
CVTSYST  EQU   CVTATER                                                  02667000
CVTVOLT2 EQU   CVTTAT                                                   02668000
CVTVOLI2 EQU   CVTVOLF2                                                 02669000
CVTAQAVB EQU   CVTAQAVT+1                                               02670000
CVTRSV34 EQU   CVTTCMFG                                                 02671000
CVTRSV33 EQU   CVTTCMFG                                                 02672000
CVTRSV32 EQU   CVTTCMFG                                                 02673000
CVTRSV31 EQU   CVTTCMFG                                                 02674000
CVTRSV30 EQU   CVTTCMFG                                                 02675000
CVTRSV29 EQU   CVTTCMFG                                                 02676000
CVTRSV28 EQU   CVTTCMFG                                                 02677000
CVTTCRDY EQU   CVTTCMFG                                                 02678000
CVTGTFA  EQU   CVTGTF+1                                                 02679000
CVTRSV27 EQU   CVTGTFST                                                 02680000
CVTRNIO  EQU   CVTGTFST                                                 02681000
CVTUSR   EQU   CVTGTFST                                                 02682000
CVTRV318 EQU   CVTFORM                                                  02683000
CVTRV317 EQU   CVTTMODE                                                 02684000
CVTRV316 EQU   CVTSTATE                                                 02685000
CVTRV315 EQU   CVTGTFS                                                  02686000
CVTGTFAV EQU   CVTGTFS                                                  02687000
CVT0SCR1 EQU   CVTMAP+232                                               02688000
CVTRV515 EQU   CVTMAP+228                                               02689000
CVTRMS   EQU   CVTMAP+224                                               02690000
CVTPATCH EQU   CVTMAP+220                                               02691000
CVTTSCE  EQU   CVTMAP+216                                               02692000
CVTLNKSC EQU   CVTMAP+214                                               02693000
CVTQABST EQU   CVTMAP+212                                               02694000
CVTMDLDS EQU   CVTMAP+208                                               02695000
CVTUSER  EQU   CVTMAP+204                                               02696000
CVTABEND EQU   CVTMAP+200                                               02697000
CVTSMCA  EQU   CVTMAP+196                                               02698000
CVTRSV18 EQU   CVTMAP+192                                               02699000
CVTQLPAQ EQU   CVTMAP+188                                               02700000
CVTQCDSR EQU   CVTMAP+184                                               02701000
CVTRSV17 EQU   CVTOPTB                                                  02702000
CVTRSV16 EQU   CVTOPTB                                                  02703000
CVTFP    EQU   CVTOPTB                                                  02704000
CVTAPTHR EQU   CVTOPTB                                                  02705000
CVTNLOG  EQU   CVTOPTB                                                  02706000
CVTTOD   EQU   CVTOPTB                                                  02707000
CVTCTIMS EQU   CVTOPTB                                                  02708000
CVTPROT  EQU   CVTOPTB                                                  02709000
CVTXPFP  EQU   CVTOPTA                                                  02710000
CVTASCII EQU   CVTOPTA                                                  02711000
CVTRSV13 EQU   CVTOPTA                                                  02712000
CVTRSV12 EQU   CVTOPTA                                                  02713000
CVTNIP   EQU   CVTOPTA                                                  02714000
CVTDDR   EQU   CVTOPTA                                                  02715000
CVTAPR   EQU   CVTOPTA                                                  02716000
CVTCCH   EQU   CVTOPTA                                                  02717000
CVTSNCTR EQU   CVTMAP+180                                               02718000
CVTQMWR  EQU   CVTMAP+176                                               02719000
CVTQOCR  EQU   CVTMAP+172                                               02720000
CVT1EF00 EQU   CVTMAP+168                                               02721000
CVTMZ00  EQU   CVTMAP+164                                               02722000
CVTHEAD  EQU   CVTMAP+160                                               02723000
CVTRSV11 EQU   CVTMAP+156                                               02724000
CVT0PT01 EQU   CVTMAP+152                                               02725000
CVTMSER  EQU   CVTMAP+148                                               02726000
CVTRV516 EQU   CVTIERLC                                                 02727000
CVTILCH  EQU   CVTMAP+140                                               02728000
CVT0DS   EQU   CVTMAP+136                                               02729000
CVTFBOSV EQU   CVTMAP+132                                               02730000
CVTNUCB  EQU   CVTMAP+128                                               02731000
CVTIOQET EQU   CVTMAP+120                                               02732000
CVTDCBA  EQU   CVTMAP+117                                               02733000
CVTMVS2  EQU   CVTDCB                                                   02734000
CVT6DAT  EQU   CVTDCB                                                   02735000
CVT4MPS  EQU   CVTDCB                                                   02736000
CVTRSV09 EQU   CVTDCB                                                   02737000
CVT4MS1  EQU   CVTDCB                                                   02738000
CVT2SPS  EQU   CVTDCB                                                   02739000
CVT1SSS  EQU   CVTDCB                                                   02740000
CVTRSV08 EQU   CVTDCB                                                   02741000
CVTSTB   EQU   CVTMAP+112                                               02742000
CVTQTD00 EQU   CVTMAP+108                                               02743000
CVTQTE00 EQU   CVTMAP+104                                               02744000
CVTCUCB  EQU   CVTMAP+100                                               02745000
CVTSJQ   EQU   CVTMAP+96                                                02746000
CVTPBLDL EQU   CVTMAP+92                                                02747000
CVTTPC   EQU   CVTMAP+88                                                02748000
CVTSVDCB EQU   CVTMAP+84                                                02749000
CVTBRET  EQU   CVTMAP+82                                                02750000
CVTEXIT  EQU   CVTMAP+80                                                02751000
CVT0FN00 EQU   CVTMAP+76                                                02752000
CVTDARA  EQU   CVTDAR+1                                                 02753000
CVTRSV07 EQU   CVTFLGS1                                                 02754000
CVTRSV06 EQU   CVTFLGS1                                                 02755000
CVTRSV05 EQU   CVTFLGS1                                                 02756000
CVTRSV04 EQU   CVTFLGS1                                                 02757000
CVTRSV03 EQU   CVTFLGS1                                                 02758000
CVTRSV02 EQU   CVTFLGS1                                                 02759000
CVTRSV01 EQU   CVTFLGS1                                                 02760000
CVTDMPLK EQU   CVTFLGS1                                                 02761000
CVTXITP  EQU   CVTMAP+68                                                02762000
CVTZDTAB EQU   CVTMAP+64                                                02763000
CVTMSLT  EQU   CVTMAP+60                                                02764000
CVTDATE  EQU   CVTMAP+56                                                02765000
CVTBTERM EQU   CVTMAP+52                                                02766000
CVTSYSAD EQU   CVTMAP+48                                                02767000
CVTXTLER EQU   CVTMAP+44                                                02768000
CVTPRLTV EQU   CVTMAP+32                                                02769000
CVTPCNVT EQU   CVTMAP+28                                                02770000
CVT0VL00 EQU   CVTMAP+24                                                02771000
CVTXAPG  EQU   CVTMAP+20                                                02772000
CVTBUF   EQU   CVTMAP+16                                                02773000
CVTJOB   EQU   CVTMAP+12                                                02774000
CVTLINK  EQU   CVTMAP+8                                                 02775000
CVT0EF00 EQU   CVTMAP+4                                                 02776000
CVTTCBP  EQU   CVTMAP                                                   02777000
CVT      EQU   CVTMAP                                                   02778000
@NM00030 EQU   PSA+3668                                                 02779000
PSASTAK  EQU   PSA+3072                                                 02780000
@NM00029 EQU   PSA+1048                                                 02781000
PSAUSEND EQU   PSA+1048                                                 02782000
PSARV062 EQU   PSA+1044                                                 02783000
PSACDAL  EQU   PSA+1040                                                 02784000
PSAWTCOD EQU   PSA+1036                                                 02785000
PSAATCVT EQU   PSA+1032                                                 02786000
PSAPCPSW EQU   PSA+1024                                                 02787000
PSAPIR2  EQU   PSA+1020                                                 02788000
PSARV059 EQU   PSA+1018                                                 02789000
PSASVC13 EQU   PSA+1016                                                 02790000
PSALSFCC EQU   PSA+1012                                                 02791000
PSASFACC EQU   PSA+1008                                                 02792000
PSASTOP  EQU   PSA+992                                                  02793000
PSASTART EQU   PSA+976                                                  02794000
PSARSPSW EQU   PSA+968                                                  02795000
PSASRPSW EQU   PSA+960                                                  02796000
PSARV045 EQU   PSA+892                                                  02797000
PSARV044 EQU   PSA+888                                                  02798000
PSARV043 EQU   PSA+884                                                  02799000
PSARV042 EQU   PSA+880                                                  02800000
PSARV041 EQU   PSA+876                                                  02801000
PSARV040 EQU   PSA+872                                                  02802000
PSARV025 EQU   PSA+868                                                  02803000
PSADSSED EQU   PSA+868                                                  02804000
PSADSSPR EQU   PSA+864                                                  02805000
PSADSSFW EQU   PSA+860                                                  02806000
PSADSS14 EQU   PSA+856                                                  02807000
PSADSSPP EQU   PSA+848                                                  02808000
PSADSSRP EQU   PSA+840                                                  02809000
PSADSS05 EQU   PSADSSF4                                                 02810000
PSADSS10 EQU   PSADSSF4                                                 02811000
PSADSSVE EQU   PSADSSF4                                                 02812000
PSADSSDE EQU   PSADSSF4                                                 02813000
PSADSSC0 EQU   PSADSSF4                                                 02814000
PSADSSIE EQU   PSADSSF4                                                 02815000
PSADSS12 EQU   PSADSSF4                                                 02816000
PSADSSRC EQU   PSADSSF4                                                 02817000
PSARV057 EQU   PSADSSF3                                                 02818000
PSARV056 EQU   PSADSSF3                                                 02819000
PSARV055 EQU   PSADSSF3                                                 02820000
PSADSSMC EQU   PSADSSF3                                                 02821000
PSADSSRW EQU   PSADSSF3                                                 02822000
PSADSSNM EQU   PSADSSF3                                                 02823000
PSADSSES EQU   PSADSSF3                                                 02824000
PSADSSGP EQU   PSADSSF3                                                 02825000
PSADSSF2 EQU   PSADSSFL+1                                               02826000
PSADSSPI EQU   PSADSSF1                                                 02827000
PSADSSOI EQU   PSADSSF1                                                 02828000
PSADSSSP EQU   PSADSSF1                                                 02829000
PSADSSTP EQU   PSADSSF1                                                 02830000
PSADSSDW EQU   PSADSSF1                                                 02831000
PSADSSDD EQU   PSADSSF1                                                 02832000
PSADSSDM EQU   PSADSSF1                                                 02833000
PSADSSMV EQU   PSADSSF1                                                 02834000
PSADSSTS EQU   PSA+816                                                  02835000
PSADSSWK EQU   PSA+812                                                  02836000
PSADSSR3 EQU   PSA+808                                                  02837000
PSADSSR2 EQU   PSA+804                                                  02838000
PSADSSRS EQU   PSA+800                                                  02839000
PSASTOR  EQU   PSA+796                                                  02840000
PSACPUSA EQU   PSA+794                                                  02841000
PSAVSTAP EQU   PSA+792                                                  02842000
PSAWKVAP EQU   PSA+788                                                  02843000
PSAWKRAP EQU   PSA+784                                                  02844000
PSAMCHIC EQU   PSA+783                                                  02845000
PSARV061 EQU   PSA+782                                                  02846000
PSASYMSK EQU   PSA+781                                                  02847000
PSAMCHFL EQU   PSA+780                                                  02848000
PSACR0   EQU   PSA+776                                                  02849000
PSAPSWSV EQU   PSA+768                                                  02850000
PSALITA  EQU   PSA+764                                                  02851000
PSACLHS  EQU   PSAHLHI                                                  02852000
PSALKR15 EQU   PSALKSA+60                                               02853000
PSALKR14 EQU   PSALKSA+56                                               02854000
PSALKR13 EQU   PSALKSA+52                                               02855000
PSALKR12 EQU   PSALKSA+48                                               02856000
PSALKR11 EQU   PSALKSA+44                                               02857000
PSALKR10 EQU   PSALKSA+40                                               02858000
PSALKR9  EQU   PSALKSA+36                                               02859000
PSALKR8  EQU   PSALKSA+32                                               02860000
PSALKR7  EQU   PSALKSA+28                                               02861000
PSALKR6  EQU   PSALKSA+24                                               02862000
PSALKR5  EQU   PSALKSA+20                                               02863000
PSALKR4  EQU   PSALKSA+16                                               02864000
PSALKR3  EQU   PSALKSA+12                                               02865000
PSALKR2  EQU   PSALKSA+8                                                02866000
PSALKR1  EQU   PSALKSA+4                                                02867000
PSALKR0  EQU   PSALKSA                                                  02868000
PSARV023 EQU   PSACLHT+52                                               02869000
PSALOCAL EQU   PSACLHT+48                                               02870000
PSACMSL  EQU   PSACLHT+44                                               02871000
PSAOPTL  EQU   PSACLHT+40                                               02872000
PSATPACL EQU   PSACLHT+36                                               02873000
PSATPDNL EQU   PSACLHT+32                                               02874000
PSATPNCL EQU   PSACLHT+28                                               02875000
PSAIOSLL EQU   PSACLHT+24                                               02876000
PSAIOSUL EQU   PSACLHT+20                                               02877000
PSAIOSCL EQU   PSACLHT+16                                               02878000
PSAIOSSL EQU   PSACLHT+12                                               02879000
PSASALCL EQU   PSACLHT+8                                                02880000
PSAASML  EQU   PSACLHT+4                                                02881000
PSADISPL EQU   PSACLHT                                                  02882000
PSASRSA  EQU   PSA+636                                                  02883000
PSARV050 EQU   PSA+634                                                  02884000
PSADSSGO EQU   PSA+633                                                  02885000
PSARECUR EQU   PSA+632                                                  02886000
PSAHLHIS EQU   PSA+628                                                  02887000
PSAIPCSA EQU   PSA+624                                                  02888000
@NM00028 EQU   PSA+621                                                  02889000
PSAIPCDM EQU   PSA+620                                                  02890000
PSAIPCD  EQU   PSA+616                                                  02891000
@NM00027 EQU   PSA+613                                                  02892000
PSAIPCRM EQU   PSA+612                                                  02893000
PSAIPCR  EQU   PSA+608                                                  02894000
PSAMCHEX EQU   PSA+600                                                  02895000
PSAMPSW  EQU   PSA+592                                                  02896000
PSAEXPS2 EQU   PSA+584                                                  02897000
PSAEXPS1 EQU   PSA+576                                                  02898000
PSAPIREG EQU   PSA+572                                                  02899000
PSARSREG EQU   PSA+568                                                  02900000
PSAGPREG EQU   PSA+556                                                  02901000
PSARV022 EQU   PSASUP4                                                  02902000
PSARV021 EQU   PSASUP4                                                  02903000
PSARV020 EQU   PSASUP4                                                  02904000
PSARV019 EQU   PSASUP4                                                  02905000
PSARV018 EQU   PSASUP4                                                  02906000
PSARV017 EQU   PSASUP4                                                  02907000
PSARV016 EQU   PSASUP4                                                  02908000
PSARV015 EQU   PSASUP4                                                  02909000
PSARV014 EQU   PSASUP3                                                  02910000
PSARV013 EQU   PSASUP3                                                  02911000
PSARV012 EQU   PSASUP3                                                  02912000
PSARV011 EQU   PSASUP3                                                  02913000
PSASPR   EQU   PSASUP3                                                  02914000
PSAPSREG EQU   PSASUP3                                                  02915000
PSAPI2   EQU   PSASUP3                                                  02916000
PSAIOSUP EQU   PSASUP3                                                  02917000
PSALCR   EQU   PSASUP2                                                  02918000
PSARTM   EQU   PSASUP2                                                  02919000
PSAACR   EQU   PSASUP2                                                  02920000
PSAIPCE2 EQU   PSASUP2                                                  02921000
PSAIPCES EQU   PSASUP2                                                  02922000
PSAIPCEC EQU   PSASUP2                                                  02923000
PSAGTF   EQU   PSASUP2                                                  02924000
PSAIPCRI EQU   PSASUP2                                                  02925000
PSARV063 EQU   PSASUP1                                                  02926000
PSATCTL  EQU   PSASUP1                                                  02927000
PSADISP  EQU   PSASUP1                                                  02928000
PSALOCK  EQU   PSASUP1                                                  02929000
PSAPI    EQU   PSASUP1                                                  02930000
PSAEXT   EQU   PSASUP1                                                  02931000
PSASVC   EQU   PSASUP1                                                  02932000
PSAIO    EQU   PSASUP1                                                  02933000
PSAAOLD  EQU   PSA+548                                                  02934000
PSAANEW  EQU   PSA+544                                                  02935000
PSATOLD  EQU   PSA+540                                                  02936000
PSATNEW  EQU   PSA+536                                                  02937000
PSALCCAR EQU   PSA+532                                                  02938000
PSALCCAV EQU   PSA+528                                                  02939000
PSAPCCAR EQU   PSA+524                                                  02940000
PSAPCCAV EQU   PSA+520                                                  02941000
PSACPULA EQU   PSA+518                                                  02942000
PSACPUPA EQU   PSA+516                                                  02943000
PSAPSA   EQU   PSA+512                                                  02944000
FLCHDEND EQU   PSA+512                                                  02945000
FLCCRSAV EQU   FLCMCLA+280                                              02946000
FLCGRSAV EQU   FLCMCLA+216                                              02947000
FLCFPSAV EQU   FLCMCLA+184                                              02948000
FLCFLA   EQU   FLCMCLA+88                                               02949000
FLCRGNCD EQU   FLCMCLA+84                                               02950000
FLCFSAA  EQU   FLCFSA+1                                                 02951000
@NM00026 EQU   FLCFSA                                                   02952000
@NM00025 EQU   FLCMCLA+72                                               02953000
FLCMCIC  EQU   FLCMCLA+64                                               02954000
@NM00024 EQU   FLCMCLA+20                                               02955000
FLCIOAA  EQU   FLCIOA+1                                                 02956000
@NM00023 EQU   FLCIOA                                                   02957000
@NM00022 EQU   FLCMCLA+15                                               02958000
@NM00021 EQU   FLCMCLA+14                                               02959000
@NM00020 EQU   FLCMCLA+12                                               02960000
FLCLCL   EQU   FLCMCLA+8                                                02961000
FLCIOELA EQU   FLCIOEL+1                                                02962000
@NM00019 EQU   FLCIOEL                                                  02963000
FLCCHNID EQU   FLCMCLA                                                  02964000
@NM00018 EQU   PSA+160                                                  02965000
FLCMTRCD EQU   PSA+157                                                  02966000
@NM00017 EQU   PSA+156                                                  02967000
FLCPERA  EQU   FLCPER+1                                                 02968000
@NM00016 EQU   FLCPER                                                   02969000
@NM00015 EQU   PSA+151                                                  02970000
FLCPERCD EQU   PSA+150                                                  02971000
FLCMCNUM EQU   PSA+149                                                  02972000
@NM00014 EQU   PSA+148                                                  02973000
FLCTEAA  EQU   FLCTEA+1                                                 02974000
@NM00013 EQU   FLCTEA                                                   02975000
PSAPIPC  EQU   PSAPICOD                                                 02976000
PSAPIMC  EQU   PSAPICOD                                                 02977000
PSAPIPER EQU   PSAPICOD                                                 02978000
PSARV049 EQU   FLCPICOD                                                 02979000
FLCPILCB EQU   FLCPIILC                                                 02980000
@NM00012 EQU   FLCPIILC                                                 02981000
@NM00011 EQU   PSAEPPSW                                                 02982000
FLCSVCN  EQU   PSAESPSW+2                                               02983000
FLCSILCB EQU   FLCSVILC                                                 02984000
@NM00010 EQU   FLCSVILC                                                 02985000
@NM00009 EQU   PSAESPSW                                                 02986000
FLCEICOD EQU   PSAEEPSW+2                                               02987000
PSASPAD  EQU   PSAEEPSW                                                 02988000
@NM00008 EQU   PSA+128                                                  02989000
FLCINPSW EQU   PSA+120                                                  02990000
FLCMNPSW EQU   PSA+112                                                  02991000
FLCPNPSW EQU   PSA+104                                                  02992000
FLCSNPSW EQU   PSA+96                                                   02993000
FLCENPSW EQU   PSA+88                                                   02994000
FLCTRACE EQU   PSA+84                                                   02995000
FLCTIMER EQU   PSA+80                                                   02996000
FLCCVT2  EQU   PSA+76                                                   02997000
FLCCAW   EQU   PSA+72                                                   02998000
FLCCSW   EQU   PSA+64                                                   02999000
FLCIOPSW EQU   PSA+56                                                   03000000
FLCMOPSW EQU   PSA+48                                                   03001000
FLCPOPSW EQU   PSA+40                                                   03002000
FLCSOPSW EQU   PSA+32                                                   03003000
FLCEOPSW EQU   PSA+24                                                   03004000
@NM00007 EQU   FLCICCW2+4                                               03005000
FLCICCW1 EQU   FLCROPSW                                                 03006000
FLCIPPSW EQU   FLCRNPSW                                                 03007000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03008000
@ENDDATA EQU   *                                                        03009000
         END   ISTINMDD,(C'PLS1937',0603,78206)                         03010000
